{
  "items": [
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/130296/like-machine-learning-or-ai-help-us-expand-or-kcura?a\u003dHHebaMvXiUg",
    "title": "Like machine learning or A.I.? Help us expand or product\u0027s analytical features!! at kCura (Reston, VA) (allows remote)",
    "content": "kCura is a global company with team members who are driven by our customers to \u003cbr /\u003ebuild exceptional software for them to use every day. Our product, called \u003cbr /\u003eRelativity, handles large volumes of data and helps corporations, law firms, \u003cbr /\u003eand government agencies solve their own unique data problems.\u003cbr /\u003e\u003cbr /\u003e• Work with your team and other stakeholders to define, design, implement, \u003cbr /\u003etest, document, and deliver quality software products in a fast paced \u003cbr /\u003eenvironment utilizing Java, Scala, and other technologies as needed.\u003cbr /\u003e\u003cbr /\u003e• Utilize sound engineering practices to deliver functional, reliable, secure, \u003cbr /\u003etested and maintainable software that satisfies stakeholders requirements.\u003cbr /\u003e\u003cbr /\u003e• Work with the team to improve the scalability and performance of existing \u003cbr /\u003eproducts.\u003cbr /\u003e\u003cbr /\u003e• Positively contribute to the culture, well-being, and growth of each team \u003cbr /\u003emember and the company at large by being a helpful and considerate team member \u003cbr /\u003eand by adhering to the company’s core values.\u003cbr /\u003e\u003cbr /\u003eThe way we work together is centered on our core values of collaborating, \u003cbr /\u003ecommunicating, pushing to exceed expectations (even our own), being humble, and \u003cbr /\u003ehaving fun while we do it. We enjoy ourselves,give back \u003cbr /\u003e\u003chttps://www.kcura.com/about-us/kcura-gives/\u003e, and work (and play) hard \u003cbr /\u003etogether. If this sounds like the place for you, check out the details of this \u003cbr /\u003eposition below.\u003cbr /\u003e\u003cbr /\u003eAs a Advanced Software Engineer and member of the Conceptual Analytics team \u003cbr /\u003eyou will share responsibility for the design, development, automated tests and \u003cbr /\u003edelivery of the company’s core analytics technologies.  You must have a passion \u003cbr /\u003efor solving problems while delivering reliable, highly scalable, highly \u003cbr /\u003eperformant systems that kCura’s customers use on a daily basis.\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003e * 3+ years of experience creating backend / server / algorithmic software \u003cbr /\u003eutilizing Java and other languages that run on the JVM, but not including J2EE \u003cbr /\u003e/ JEE applications. \u003cbr /\u003e * Ability to decompose complex problems, troubleshoot issues and communicate \u003cbr /\u003esolutions to the team and other stakeholders. \u003cbr /\u003e * Demonstrated self-motivation to work independently as well as part of a \u003cbr /\u003ehigh performing, diverse team \u003cbr /\u003e * Excellent written and verbal communication skils \u003cbr /\u003e * Experience developing and maintaining distributed, elastic micro-service \u003cbr /\u003eapplications that self-heal in the event of failures. \u003cbr /\u003e * Experience creating large-scale services and applications in distributed \u003cbr /\u003eenvironments such as Azure and Amazon AWS \u003cbr /\u003e * Experience in utilizing Docker to simplify deployment and development \u003cbr /\u003e * Skilled in developing software for the JVM using Java, Scala and other JVM \u003cbr /\u003ebased languages \u003cbr /\u003e * Proficiency on Linux, Git, REST, Akka, and CI tools (Jenkins, Bamboo) \u003cbr /\u003e About kCura \u003cbr /\u003e\u003cbr /\u003eFounded in 2001, kCura \u003chttps://kcura.com/corporate\u003e are the developers of \u003cbr /\u003eRelativity, software for managing and analyzing electronic data during \u003cbr /\u003elitigation and investigations. Headquartered in downtown Chicago with \u003cbr /\u003eadditional global locations, we focus on providing the best software we can, \u003cbr /\u003estriving to always improve our products and the experience of our customer \u003cbr /\u003ebase, which includes the U.S. Department of Justice and more than 190 of the \u003cbr /\u003etop 200 law firms in the United States. kCura has been ranked the 175th \u003cbr /\u003efastest-growing technology company in North America by Deloitte\u0027s Technology \u003cbr /\u003eFast 500Deloitte/us/Documents \u003cbr /\u003e\u003chttps://www2.deloitte.com/content/dam/Deloitte/us/Documents/technology-media-telecommunications/us-tmt-fast500-2014-ranking-list.pdf\u003e\u003cbr /\u003e, as well as one of Chicago Tribune\u0027s Top WorkplacesTopworkplaces \u003cbr /\u003e\u003chttp://www.topworkplaces.com/frontend.php/regional-list/company/chicagotribune/kcura-corporation\u003e\u003cbr /\u003e. Our team of driven, passionate, and talented individuals works \u003cbr /\u003ecollaboratively to provide a positive client experience and build a reputable \u003cbr /\u003ename in a booming industry. We commit to hiring people who value collaboration, \u003cbr /\u003ecommunication, and accountability as much as we do. To learn more about kCura, \u003cbr /\u003echeck out our videocorporate/careers \u003cbr /\u003e\u003chttps://kcura.com/corporate/careers/kcura-culture\u003e on kCura\u0027s unique culture.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 12 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? External URL  apply now  \u003cbr /\u003e\u003chttps://careers-kcura.icims.com/jobs/2147/advanced-software-engineer/job\u003e  \u003cbr /\u003emore jobs at kCura \u003c\u003e \u003cbr /\u003eJoin us at kCura\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003e18 days PTO upon hire Generous health insurance Retirement plans with matching \u003cbr /\u003econtributions Gym membership discounts Free fruit, coffee, and soda Monthly \u003cbr /\u003ehappy hours Multiple-monitor setups \u0026 standing desks Holiday break of 5 days \u003cbr /\u003ePre-tax transit benefits Training \u0026 educational opportunities \u003cbr /\u003eLearn more about kCura \u003c\u003e more jobs at kCura \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/kcura?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2/java",
      "TECH2/scala",
      "TECH2/azure",
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100",
      "TECH2/rest"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/131734/data-science-bootcamp-mentor-thinkful-inc?a\u003dIb7ZnszmKRO",
    "title": "Data Science Bootcamp Mentor at Thinkful Inc. () (allows remote)",
    "content": "Mentor aspiring Data Scientists enrolled in Thinkful\u0027s Data Science School!\u003cbr /\u003e\u003cbr /\u003eThe intensive, 4-6 month course helps students become self-sufficient data \u003cbr /\u003escientists  capable of advancing their skills as they grow in their careers for \u003cbr /\u003eyears to come. As a Mentor, you will support students while they build projects \u003cbr /\u003eas they master data science fundamentals. Ultimately, share best practices with \u003cbr /\u003ethe next generation of developers and teach them how to think like a data \u003cbr /\u003escientists so that they can continue their growth beyond the program.\u003cbr /\u003e\u003cbr /\u003eThinkful mentors work remotely and set their own hours. The role is a great \u003cbr /\u003efit for experts who genuinely love their work and want to share their \u003cbr /\u003eexpertise, experience, and themselves with awesome students and fellow mentors \u003cbr /\u003efrom around the globe!\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003e * Proficiency in Python is Required \u003cbr /\u003e * Experienced with Python Data Science Toolkit (Panda, NumPy, Matplotlib, \u003cbr /\u003eScikit-Learn, Beautiful Soup) \u003cbr /\u003e * Experience with machine learning, Hadoop, Hive, Pig, Spark, MapReduce, \u003cbr /\u003edistributed computing, and AWS \u003cbr /\u003e * Professional experience in a field that utilizes modern day data science \u003cbr /\u003etools and methodologies \u003cbr /\u003e * Able to explain mathematical concepts involved in statistics, probability \u003cbr /\u003eand linear algebra \u003cbr /\u003e * Experience with Git and GitHub \u003cbr /\u003e * Involvement in local community (i.e. meet-ups) a plus \u003cbr /\u003e * A desire to keep your skills sharp by teaching others \u003cbr /\u003e * A passion for sharing best practices \u003cbr /\u003e * Excellent communication skills \u003cbr /\u003e * Infectious enthusiasm for development and sharing your craft with others \u003cbr /\u003e * Previous corporate training or teaching experience a plus  \u003cbr /\u003e About Thinkful Inc. \u003cbr /\u003e\u003cbr /\u003eAt Thinkful relationships drive learning. We advance careers by pairing \u003cbr /\u003estudents with a 1-on-1 mentors who pair program and teach best practices as \u003cbr /\u003estudents learn through a project-driven curriculum. Thinkful was recently \u003cbr /\u003eranked the best coding school by Course Report, the industry\u0027s leading \u003cbr /\u003epublication. While we claimed the top spot in all five of their categories, \u003cbr /\u003ewhat excites me most is that we have the #1 instructor team. A team comprised \u003cbr /\u003eof 300 data scientists programmers and designers in over 35 countries.\u003cbr /\u003e\u003cbr /\u003eRead what one of our awesome mentors says about mentoring with Thinkful, here: \u003cbr /\u003ehttps://www.coursereport.com/schools/thinkful#/news/mentor-spotlight-jason-humphrey-of-thinkful\u003cbr /\u003e \u003cbr /\u003e\u003chttps://www.coursereport.com/schools/thinkful#/news/mentor-spotlight-jason-humphrey-of-thinkful\u003e\u003cbr /\u003eExternal URL  apply now  \u003chttps://www.thinkful.com/apply/\u003e  more jobs at \u003cbr /\u003eThinkful \u003c\u003e \u003cbr /\u003eJoin us at Thinkful Inc.\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eJoin team of 300 developers mentoring the developers of the future Access to \u003cbr /\u003etop rated curriculum Paid position Flexible Schedule and Hours \u003cbr /\u003eLearn more about Thinkful \u003c\u003e more jobs at Thinkful \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/thinkful-inc?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2/machine-learning",
      "TECH2/pandas",
      "REMOTE2/America",
      "TECH2/data-science",
      "TECH2/statistics",
      "TITLE1/data",
      "TECH2/python",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/121380/enterprise-data-architect-engineer-critical-mix?a\u003dEHQ2Jz9RrjO",
    "title": "Enterprise Data Architect / Engineer at Critical Mix (Perrysburg, OH) (allows remote)",
    "content": "Provides expertise in the definition, adoption and adherence to enterprise \u003cbr /\u003ebusiness intelligence and information architecture strategies, processes and \u003cbr /\u003estandards. Responsible for delivering enterprise information architecture and \u003cbr /\u003etechnical / infrastructure architecture solutions for the enterprise data \u003cbr /\u003ewarehouse and end user reporting tools. This position provides technology \u003cbr /\u003edirection, assistance and training to teams performing BI-related activities, \u003cbr /\u003eboth inside and outside IT Services. Will Support the development of the global \u003cbr /\u003eBI strategic road map by conducting market analysis and technology reviews, and \u003cbr /\u003eestablishing strong partnerships with key vendors to enable road map \u003cbr /\u003eimplementation.\u003cbr /\u003e\u003cbr /\u003eOffice Locations\u003cbr /\u003e\u003cbr /\u003e Perrysburg, Oh -  Dallas, Tx - Warwick, RI - San Francisco, CA\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eResponsible for designing and maintaining complete data systems architecture \u003cbr /\u003efor the Critical Mix organization on enterprise levels\u003cbr /\u003e\u003cbr /\u003e * Develop and Implement road maps and phased plans that gradually increases \u003cbr /\u003ethe enterprise data architecture maturity level of Critical Mix over a \u003cbr /\u003emulti-year period and support both current \u0026 future state business processes \u003cbr /\u003e * Sets the overall direction, policies and guidelines for the Enterprise Data \u003cbr /\u003eArchitecture function \u003cbr /\u003e * Maintains an ongoing partnership with the business to apply in-depth \u003cbr /\u003eknowledge of the business operations, strategies, priorities and information \u003cbr /\u003erequirements to establish the technical direction at an enterprise view \u003cbr /\u003e * Promotion and delivery of shared infrastructure and applications to reduce \u003cbr /\u003ecosts and improve information flows \u003cbr /\u003e * Defines the system, technical, and application architectures, and in some \u003cbr /\u003einstances the business systems/process architecture for major areas of \u003cbr /\u003edevelopment \u003cbr /\u003e * Creates processes and standards to develop, maintain and integrate \u003cbr /\u003eenterprise architectures within the process of strategy development and \u003cbr /\u003etechnology planning \u003cbr /\u003e * Ensures appropriate technical standards, procedures, and governance are \u003cbr /\u003edefined and followed \u003cbr /\u003e * Ensures enterprise solutions are scalable and adoptable according to \u003cbr /\u003echanging business needs \u003cbr /\u003e * Maintains close working relationships with executive and business \u003cbr /\u003emanagement to understand the Critical Mix strategy and requirements \u003cbr /\u003e * Keep up to date with new technologies and actively implement innovative \u003cbr /\u003esolutions \u003cbr /\u003eRequirements\u003cbr /\u003e\u003cbr /\u003e * Bachelor\u0027s degree required; preferably in MIS \u003cbr /\u003e * 8+ years experience in IT including experience with systems architecture \u003cbr /\u003emethodologies \u003cbr /\u003e * 3+ years of hands-on development experience in more than one of these \u003cbr /\u003etechnologies: Oracle, SQL Server, NoSQL, Big Data Technologies like Hadoop, \u003cbr /\u003eRedshift, Snowflake or other DW storage architecture, Chartio or similar, \u003cbr /\u003eInformatica or similar. \u003cbr /\u003e * Dimensional data modeling principles (star and snowflake schemas, \u003cbr /\u003edenormalized data structures, slowly changing dimensions, etc.) \u003cbr /\u003e * Physical data architectures: data warehouses, independent data marts \u003cbr /\u003e * Data integration tools: ETL (extract, transform, load), CDC (change data \u003cbr /\u003ecapture) \u003cbr /\u003e * Data quality, master data management, metadata management, collaboration \u003cbr /\u003eand business process management Bachelors or above degree in Computer Science, \u003cbr /\u003eor related discipline, or equivalent experience. \u003cbr /\u003e About Critical Mix \u003cbr /\u003e\u003cbr /\u003eCritical Mix provides easy access to highly-targeted global survey \u003cbr /\u003erespondents, survey programming and data visualization services for market \u003cbr /\u003eresearch and consulting firms. Driven by a passion for simplifying data \u003cbr /\u003ecollection, the team at Critical Mix is personally invested in giving clients \u003cbr /\u003ethe ultimate customer service experience.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 12 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? apply now \u003c\u003e  more jobs at Critical Mix\u003cbr /\u003e \u003c\u003e \u003cbr /\u003eJoin us at Critical Mix\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eHealth benefits Flexible schedule Great work/life integration Empowerment \u003cbr /\u003eUnlimited vacation policy Competitive compensation Remote location Gym \u003cbr /\u003ememberships \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eGuillermo Sandoval \u003cbr /\u003ec++ java php c \u003cbr /\u003eview profile \u003c\u003e Skylar Sommers \u003cbr /\u003ejava gwt spring spring-mvc \u003cbr /\u003eview profile \u003c\u003e Joshua Jones \u003cbr /\u003ego java c# c++ \u003cbr /\u003eview profile \u003c\u003e Cameron Schuette \u003cbr /\u003ephp c++ \u003cbr /\u003eview profile \u003c\u003e Paul Hudson \u003cbr /\u003ebigdata oracle \u003cbr /\u003eview profile \u003c\u003e Gino Trombetti \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Christopher Hiller \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Learn more about Critical Mix \u003c\u003e more jobs at Critical Mix \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/critical-mix?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2/artificial-intelligence",
      "TECH2/amazon-web-services",
      "TECH2/bigdata",
      "TECH2/analytics",
      "TITLE1/data",
      "REMOTE2/locals-only",
      "REMOTE1/100",
      "TECH2/business-intelligence"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/128568/senior-data-engineer-restless-bandit?a\u003dH7ivTUmalXi",
    "title": "Senior Data Engineer at Restless Bandit (San Francisco, CA) (allows remote)",
    "content": "As a Senior Data Engineer you will collaborate with other engineers and data \u003cbr /\u003escientists to develop and maintain the machine learning (ML) data pipeline \u003cbr /\u003epowering Restless Bandit\u0027s talent-rediscovery products. Your days will involve \u003cbr /\u003earchitecting, improving, and customizing Restless Bandit\u0027s ML infrastructure \u003cbr /\u003ebased on well-established data-processing systems like Hadoop or  while also \u003cbr /\u003estaying on top of the latest developments in big-data computation platforms.\u003cbr /\u003e\u003cbr /\u003eCulture:\u003cbr /\u003e\u003cbr /\u003eWe work hard, but at the same time we have a laid-back, fun work environment. \u003cbr /\u003eSome of the values that are important to us are:\u003cbr /\u003e\u003cbr /\u003e - Helpfulness: we appreciate receiving help as well as giving it, and \u003cbr /\u003elearning from each other as well as sharing knowledge and opinions.\u003cbr /\u003e\u003cbr /\u003e- Professionalism: we trust each other and assume independence and autonomy \u003cbr /\u003ealong with responsibility.\u003cbr /\u003e\u003cbr /\u003e- Curiosity: we’re interested in new ideas and alternative viewpoints; we \u003cbr /\u003eprefer having our minds’ changed by a discussion to ‘winning’ a debate.\u003cbr /\u003e\u003cbr /\u003e- Relaxedness: we believe that consistent unhurried problem-solving produces \u003cbr /\u003ebetter solutions than frantic ‘fire drills.’\u003cbr /\u003e\u003cbr /\u003e- Fun: we\u0027re thick as thieves. We have lunch together every day, host regular \u003cbr /\u003e(and spontaneous)  happy hours, and participate in professional meet-ups.\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eAn ideal candidate has:\u003cbr /\u003e\u003cbr /\u003e- 3+ years\u0027 experience building high-performance, large-scale, distributed \u003cbr /\u003eserver applications and reliable software.\u003cbr /\u003e\u003cbr /\u003e- 2+ years\u0027 experience with distributed computing frameworks (Spark, Hadoop, \u003cbr /\u003eStorm)\u003cbr /\u003e\u003cbr /\u003e- 2+ years\u0027 experience with a compiled language (Go, C, C++, Java)\u003cbr /\u003e\u003cbr /\u003e- 1+ years\u0027 experience writing production Python code\u003cbr /\u003e\u003cbr /\u003e- 2+ years\u0027 experience writing effective unit tests against production code\u003cbr /\u003e\u003cbr /\u003e- strong opinions about programming best practices coupled with flexibility in \u003cbr /\u003ethe face of cogent opposing opinions\u003cbr /\u003e\u003cbr /\u003e- appreciation for data munging and the dirty aspects of the world of data \u003cbr /\u003eprocessing.\u003cbr /\u003e\u003cbr /\u003e About Restless Bandit \u003cbr /\u003e\u003cbr /\u003eRestless Bandit is a well-funded San Francisco startup focused on helping \u003cbr /\u003ecompanies identify and retain the best people in the exploding \"war-for-talent\" \u003cbr /\u003espace. This is an exciting, near ground floor opportunity with a group of \u003cbr /\u003epeople with extensive experience in HR tech. Our founders were executives at \u003cbr /\u003eBright, an HR tech company acquired last year by LinkedIn for $130M and our \u003cbr /\u003edata scientists and engineers come from Bright, LinkedIn, and Google, and have \u003cbr /\u003eextensive experience applying big-data methods to the hiring domain.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 10 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? apply now \u003c\u003e  more jobs at Restless \u003cbr /\u003eBandit \u003c\u003e \u003cbr /\u003eJoin us at Restless Bandit\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eDaily Lunches Medical, Dental, \u0026 Vision Coverage Unlimited Vacation Commuter \u003cbr /\u003eBenefits Program Open, collaborative workspaces Weekly Happy Hours and Whiskey \u003cbr /\u003eFridays Fitness Reimbursement Program Fully Stocked Kitchen with Snacks \u0026 \u003cbr /\u003eAlcohol \u003cbr /\u003eLearn more about Restless Bandit \u003c\u003e more jobs at Restless Bandit \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/restlessbandit?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2/spark",
      "TECH2/amazon-web-services",
      "REMOTE2/America",
      "TECH2/elasticsearch",
      "TITLE1/data",
      "TECH2/python",
      "TECH2/hadoop",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/111857/research-engineer-machine-learning-for-elastic-elastic?a\u003dBvPo6N3UY12",
    "title": "Research Engineer- Machine Learning- for Elastic (Elasticsearch) at Elastic (Mountain View, CA) (allows remote)",
    "content": "Machine Learning at Elastic\u003cbr /\u003e\u003cbr /\u003eWith the recent addition of Prelert to Elastic, we now have a fully dedicated \u003cbr /\u003eMachine Learning team in house. Our goal is to further expand our capabilities \u003cbr /\u003ein developing technologies that allow users to better understand the behavior \u003cbr /\u003eof their data. Our team has developed an unsupervised machine learning engine \u003cbr /\u003ethat can plow through large amounts of data and automatically find those \u003cbr /\u003einsights our users today have been proactively finding using search. Current \u003cbr /\u003euse cases include finding anomalies within transactions / operational metrics, \u003cbr /\u003edetecting uncharacteristic user behavior, finding a population of attacking IP \u003cbr /\u003eaddresses but we are looking forward to expanding our capabilities to many more \u003cbr /\u003ein the future.  And in order to get there, our team is looking to hire an \u003cbr /\u003eexceptional Research Engineer to join them. This is an amazing opportunity to \u003cbr /\u003ejoin a small, highly experienced team where you can make an immediate impact \u003cbr /\u003eand contribution to the core of our new machine learning offering. \u003cbr /\u003e\u003cbr /\u003eYour role:\u003cbr /\u003e\u003cbr /\u003eAs a Research Engineer - Machine Learning you will be a pivotal part of our \u003cbr /\u003ePrelert team and will contribute to the further development of our Machine \u003cbr /\u003eLearning focussed projects by being a subject matter expert and resource to the \u003cbr /\u003esoftware design and development process.  \u003cbr /\u003e\u003cbr /\u003eOur Research team at Elastic focuses on developing and applying techniques \u003cbr /\u003efrom Machine Learning, statistics and data mining, including but not limited to \u003cbr /\u003eBayesian modelling, counterfactual reasoning, feature learning and data stream \u003cbr /\u003eprocessing. Our goal is to build powerful and robust solutions such as anomaly \u003cbr /\u003edetection, categorisation and recommendation, enabling customers to gain \u003cbr /\u003einsight from their data.\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eYour background\u003cbr /\u003e\u003cbr /\u003e * BS, MS or PhD in an applied data science discipline such as Mathematics, \u003cbr /\u003ePhysics, Neuroscience, Machine Learning or similar. \u003cbr /\u003e * Industry experience as a Research Engineer in Machine Learning / \u003cbr /\u003eStatistical Analysis / Big Data \u003cbr /\u003e * Experience in algorithm design and development \u003cbr /\u003e * Experience in C++ programming is advantageous \u003cbr /\u003e * Experience in data visualization is advantageous \u003cbr /\u003e * Ability to independently research technologies, algorithms and tools \u003cbr /\u003e * Ability to work on a distributed team: work in a structured disciplined \u003cbr /\u003emanner and document data and results effectively \u003cbr /\u003e * Able to work collaboratively, good communication skills, personable \u003cbr /\u003e * Passion for Big Data Analytics \u003cbr /\u003e About Elastic \u003cbr /\u003e\u003cbr /\u003eWe believe getting immediate, actionable insight from data matters. As the \u003cbr /\u003ecompany behind the three open source projects — Elasticsearch, Logstash, and \u003cbr /\u003eKibana — designed to take data from any source and search, analyze, and \u003cbr /\u003evisualize it in real time, we are helping people make sense of data. From stock \u003cbr /\u003equotes to Twitter streams, Apache logs to WordPress blogs, our products are \u003cbr /\u003eextending what\u0027s possible with data, delivering on the promise that good things \u003cbr /\u003ecome from connecting the dots.\u003cbr /\u003e\u003cbr /\u003eAdditional Information\u003cbr /\u003e\u003cbr /\u003e * Extremely competitive pay, medical, dental, vision, disability, benefits \u003cbr /\u003e * Stock options \u003cbr /\u003e * Catered lunches, snacks, and beverages in most offices \u003cbr /\u003e * An environment in which you can balance great work with a great life \u003cbr /\u003e * Passionate people building great products \u003cbr /\u003e * Employees with a wide variety of interests \u003cbr /\u003e * Your age is only a number. It doesn\u0027t matter if you\u0027re just out of college \u003cbr /\u003eor your children are; we need you for what you can do. \u003cbr /\u003e * Distributed-first company with employees in over 23 countries, spread \u003cbr /\u003eacross 18 time zones, and speaking over 30 languages! Some even fly south for \u003cbr /\u003ethe winter :) \u003cbr /\u003eElastic is an Equal Employment employer committed to the principles of equal \u003cbr /\u003eemployment opportunity and affirmative action for all applicants and employees. \u003cbr /\u003eQualified applicants will receive consideration for employment without regard \u003cbr /\u003eto race, color, religion, sex, sexual orientation, gender perception or \u003cbr /\u003eidentity, national origin, age, marital status, protected veteran status, or \u003cbr /\u003edisability status or any other basis protected by federal, state or local law, \u003cbr /\u003eordinance or regulation. Elastic also makes reasonable accommodations for \u003cbr /\u003edisabled employees consistent with applicable law.\u003cbr /\u003eExternal URL  apply now  \u003cbr /\u003e\u003chttps://www.elastic.co/about/careers/engineering/jobs/aHv624HYar5QRFeMg-44q7\u003e  \u003cbr /\u003emore jobs at Elastic \u003c\u003e \u003cbr /\u003eJoin us at Elastic\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003e401k Matching Up to 6 % Health Care Insurance \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eNicolas Bevacqua \u003cbr /\u003ejavascript node.js mongodb websocket \u003cbr /\u003eview profile \u003c\u003e David Pilato \u003cbr /\u003eelasticsearch \u003cbr /\u003eview profile \u003c\u003e Luca Cavanna \u003cbr /\u003ejava spring elasticsearch lucene \u003cbr /\u003eview profile \u003c\u003e Russ Cam \u003cbr /\u003ec# javascript f# elasticsearch \u003cbr /\u003eview profile \u003c\u003e Daniel Mitterdorfer \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Tanguy \u003cbr /\u003ejava perf elasticsearch \u003cbr /\u003eview profile \u003c\u003e Jason Tedor \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Learn more about Elastic \u003c\u003e more jobs at Elastic \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/elastic?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2/machine-learning",
      "TECH2/algorithm",
      "REMOTE2/America",
      "TECH2/statistics",
      "TITLE1/data",
      "TECH2/c++",
      "TECH2/hadoop",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/53502/machine-learning-researcher-sports-at-stratagem-technologies-ltd/",
    "title": "Machine Learning Researcher - Sports",
    "content": "*THE ROLE*\u003cbr /\u003e\u003cbr /\u003eWe are looking for *Masters/PhD level computational statisticians and data scientists* to join our Quantitative Research team. Successful candidates will work on interesting Machine Learning problems in order to help us achieve our mission, which is to establish sports betting as an alternative asset class for sophisticated investors.\u003cbr /\u003e\u003cbr /\u003eOur Quantitative Research Team works to develop and implement statistical and Machine Learning models for analysing and predicting the outcome of sporting events. We use the signals generated by these models to inform sports betting by professional traders. *We currently model football, tennis and basketball and we are looking to extend our range to cricket, golf, American football and ice hockey.*\u003cbr /\u003e\u003cbr /\u003eWe have positions for candidates who have achieved a Masters and/or PhD in a subject that heavily utilises computational statistical modelling or data science. Candidates with in-depth machine learning knowledge, experience of modelling sporting events or experience in financial quantitative analysis are particularly encouraged to apply.\u003cbr /\u003e\u003cbr /\u003e*THE COMPANY*\u003cbr /\u003e\u003cbr /\u003eStratagem was founded in 2012 and represents the culmination of knowledge and expertise derived from a wealth of experience in both the financial markets and the sports betting industry. In 2015 the company was named one of the 20 Most Promising Sports Technology Solutions Providers by CIO Review.\u003cbr /\u003e\u003cbr /\u003e*YOUR PROFILE*\u003cbr /\u003e\u003cbr /\u003eWe are seeking talented and motivated data scientists with a background or experience in machine learning. You should be excited by intellectual challenges and confident enough to contribute ideas and challenge assumptions from your first day. You will work in group of high-achieving quantitative researchers who love sport and who love solving difficult problems. You will be able to demonstrate your abilities through tangible work and discrete projects, with constant feedback from real world events.\u003cbr /\u003e\u003cbr /\u003e* Developing and prototyping new algorithms for machine learning training and inference\u003cbr /\u003e* Applying these algorithms autonomous trading systems and predictive sports models\u003cbr /\u003e* Collaborating with machine learning researchers in leading universities and research labs. We have formal partnerships with 4 universities in the UK\u003cbr /\u003e* As a research scientist, you will lead and participate in research projects involving a small team, collaborating in a friendly work environment.\u003cbr /\u003e\u003cbr /\u003e*REQUIREMENTS*\u003cbr /\u003e\u003cbr /\u003e* Masters or PhD (preferred) in statistics, computer science, engineering or related field\u003cbr /\u003e* 2+ years experience in working with large data sets in a related field (demonstrable)\u003cbr /\u003e* Experience with a wide range of machine learning and statistical methods\u003cbr /\u003e* Excellent written and oral presentation skills\u003cbr /\u003e* Record of publishing in peer-reviewed journals\u003cbr /\u003e* Strong familiarity with Python (preferred), R, Matlab or C/C++\u003cbr /\u003e* Familiarity with Theano, Torch, Caffe, TensorFlow or similar is a plus\u003cbr /\u003e* Excellent knowledge of, 3 or more years of experience in Optimization, Machine Learning, or Computational statistics\u003cbr /\u003e\u003cbr /\u003e*HOW TO APPLY*\u003cbr /\u003e\u003cbr /\u003eTo apply for the role please submit your CV and a covering letter (with the job title Machine Learning Researcher’ in the subject.\u003cbr /\u003e\u003cbr /\u003eTell us why you would be a good fit for the Stratagem team and how working for Stratagem will help achieve our goals and yours. Shortlisted candidates will be invited for interview and will be required to demonstrate proficiency by completing a technical exercise.\u003cbr /\u003e\u003cbr /\u003eWe respectfully note that we will not be retaining recruitment consultant for this position and\u003cbr /\u003ewill simply not reply to unsolicited applications or enquiries from such parties.",
    "urlFetchPending": false,
    "published": "Jan 20, 2017 2:18:20 PM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/53499/reinforcement-learning-research-engineer-at-stratagem-technologies-ltd/",
    "title": "Reinforcement Learning Research Engineer",
    "content": "*THE ROLE*\u003cbr /\u003e\u003cbr /\u003eWe are looking for *Masters/PhD level computational statisticians and data scientists* to join our Quantitative Research team. Successful candidates will work on interesting Reinforcement Learning problems in order to help us achieve our mission, which is to establish sports betting as an alternative asset class for sophisticated\u003cbr /\u003einvestors.\u003cbr /\u003e\u003cbr /\u003eOur Quantitative Research Team works to develop and implement statistical models for analysing and predicting the outcome of sporting events. We use the signals generated by these models to inform sports betting by professional traders. We currently model football and tennis and we are looking to extend our range to golf, cricket, basketball, American football and ice hockey.\u003cbr /\u003e\u003cbr /\u003eWe have positions for candidates who have achieved a Masters and/or PhD in a subject that heavily utilises data science and machine learning. Candidates should have a Deep theoretical knowledge of Reinforcement Learning and practical experience of building Reinforcement Learning Systems.\u003cbr /\u003e\u003cbr /\u003e*THE COMPANY*\u003cbr /\u003e\u003cbr /\u003eStratagem was founded in 2012 and represents the culmination of knowledge and expertise derived from a wealth of experience in both the financial markets and the sports betting industry. In 2015 the company was named one of the 20 Most Promising Sports Technology Solutions Providers by CIO Review.\u003cbr /\u003e\u003cbr /\u003e*YOUR PROFILE*\u003cbr /\u003e\u003cbr /\u003eWe are seeking talented and motivated data scientists with a background or experience in reinforcement learning. You should have a good foundation of programming experience in a modelling / data analysis context, ideally in a production environment. You should be excited by intellectual challenges and confident enough to\u003cbr /\u003econtribute ideas and challenge assumptions from your first day. You will work in group of high-achieving quantitative researchers who love sport and who love solving difficult problems. You will be able to demonstrate your abilities through tangible work and discrete projects, with constant feedback from real world events.\u003cbr /\u003e\u003cbr /\u003e* Developing and prototyping new automated trading strategies via Reinforcement Learning\u003cbr /\u003e* Collaborating with researchers in leading universities and research labs. We have formal partnerships with several universities in the UK\u003cbr /\u003e* As a research scientist, you will be part of a small team conducting research in applying Reinforcement Learning to the sports betting markets.\u003cbr /\u003e\u003cbr /\u003e*REQUIREMENTS*\u003cbr /\u003e\u003cbr /\u003eRequired:\u003cbr /\u003e* Masters or PhD (preferred) in statistics, computer science, engineering or related field\u003cbr /\u003e* 2+ years experience in working with large data sets in a related field (demonstrable)\u003cbr /\u003e* Excellent theoretical knowledge and practical experience in Reinforcement Learning\u003cbr /\u003e* Very strong familiarity with Python (preferred), R, Matlab, C/C++ or Java\u003cbr /\u003e* Excellent written and oral presentation skills\u003cbr /\u003e\u003cbr /\u003eDesirable:\u003cbr /\u003e* Working knowledge of limit order books\u003cbr /\u003e* Development of automated trading systems\u003cbr /\u003e* Experience with market making in financial and/or sports betting markets.\u003cbr /\u003e* Record of publishing in peer-reviewed journals\u003cbr /\u003e\u003cbr /\u003e*HOW TO APPLY*\u003cbr /\u003e\u003cbr /\u003eTo apply for the role please submit your CV and a covering letter (with the job title Machine Learning Researcher’ in the subject)\u003cbr /\u003e\u003cbr /\u003eTell us why you would be a good fit for the Stratagem team and how working for Stratagem will help achieve our goals and yours. Shortlisted candidates will be invited for interview and will be required to demonstrate proficiency by completing a technical exercise.\u003cbr /\u003e\u003cbr /\u003eWe respectfully note that we will not be retaining recruitment consultant for this position and will simply not reply to unsolicited applications or enquiries from such parties",
    "urlFetchPending": false,
    "published": "Jan 20, 2017 2:11:50 PM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/53284/data-scientist-at-checkrecipient/",
    "title": "Data Scientist",
    "content": "CHECKRECIPIENT\u003cbr /\u003e\u003cbr /\u003eAt CheckRecipient, we have the ambitious goal of protecting enterprise networks against new and intelligent cyber threats, making it impossible for sensitive information to end up in the wrong hands.\u003cbr /\u003e\u003cbr /\u003eThrough advanced machine learning and natural language processing (NLP), CheckRecipient prevents breaches in real-time, outsmarting traditional rule-based, admin-intensive approaches which can only report a breach after it has occurred.\u003cbr /\u003e\u003cbr /\u003eFounded by a team of Imperial College engineers, we’re backed by some of the world’s leading technology investors. We work with international clients in the financial, legal and professional services sectors who trust us to find the most intelligent ways to keep their data secure.\u003cbr /\u003e\u003cbr /\u003eWe’re looking to work with the brightest minds to help us accomplish our goal and tackle the biggest cybersecurity problems.\u003cbr /\u003e\u003cbr /\u003eENGINEERING AT CHECKRECIPIENT\u003cbr /\u003e\u003cbr /\u003eDealing with massive datasets at scale requires ingenuity and strong analytical skills. Our agnostic approach to problem solving means we favour hiring engineers who pride themselves on the ability to learn new skills, their comfort with the unknown and their willingness to experiment.\u003cbr /\u003e\u003cbr /\u003eAt CheckRecipient you’ll be growing your skill-set on an ongoing basis; regular and continuous development is something we believe in and as an employee we will seek to create opportunities for you to evolve.\u003cbr /\u003e\u003cbr /\u003eWe build quickly and follow both agile and continuous delivery paradigms. As a member of the CheckRecipient engineering team, you will have the autonomy to work on your own projects, and be part of our regular round tables to bounce ideas around as a team on how to tackle our biggest challenges.\u003cbr /\u003e\u003cbr /\u003eHere are some of the technologies we’re working with / interested in:\u003cbr /\u003e- Python, Ruby, Go\u003cbr /\u003e- Kubernetes, Rancher, Docker\u003cbr /\u003e- Kafka\u003cbr /\u003e- Postgres, DynamoDB, Cassandra\u003cbr /\u003e- Redshift\u003cbr /\u003e- AWS\u003cbr /\u003e- Microservices architecture\u003cbr /\u003e\u003cbr /\u003eREQUIREMENTS\u003cbr /\u003e\u003cbr /\u003eYou should apply if you:\u003cbr /\u003e-want to join a fun and fast growing company\u003cbr /\u003e-are a great problem solver who takes pride in their work\u003cbr /\u003e-also believe that data scientists are most effective when they are responsible for getting ideas into production \u003cbr /\u003e-you’re happy getting your hands dirty data munging and working with unstructured data\u003cbr /\u003e-aren’t afraid by the unknown; there is little prior research for the problems we are tackling\u003cbr /\u003e-have strong SQL and python skills\u003cbr /\u003e-are comfortable working with big data technologies e.g. Redshift, Spark, or similar\u003cbr /\u003e-are happy to drive projects from idea to production without much guidance\u003cbr /\u003e-have a strong background in statistical analysis\u003cbr /\u003e\u003cbr /\u003eBonus:\u003cbr /\u003e-you have deployed machine learning into the wild, rather than for purely academic research\u003cbr /\u003e-you have experience working with NLP (extra special bonus: in document classification)\u003cbr /\u003e-you\u0027re interested in using deep learning with big datasets\u003cbr /\u003e\u003cbr /\u003eOther Requirements\u003cbr /\u003e-Must be eligible to work in the UK\u003cbr /\u003e\u003cbr /\u003eBENEFITS\u003cbr /\u003e\u003cbr /\u003e-Competitive salary and meaningful equity options\u003cbr /\u003e-Choose your own kit\u003cbr /\u003e-Central London office location\u003cbr /\u003e-Regular team socials and activities\u003cbr /\u003e\u003cbr /\u003eHow to apply\u003cbr /\u003e\u003cbr /\u003ePlease attach your résumé and take the time to write a quick cover letter about why you’d like to work at CheckRecipient and specifically what attracts you to this role.\u003cbr /\u003e\u003cbr /\u003eWe look forward to hearing from you!\u003cbr /\u003e\u003cbr /\u003eImportant Notices\u003cbr /\u003e\u003cbr /\u003e-Please note that we do not accept applications or résumés from recruiters unless we have specifically asked a given recruiter to submit candidates for this role\u003cbr /\u003e-Please note that we can only accept applications from people who currently have the right to work in the UK. We are unable to sponsor someone to work in the UK who does not currently have the right to do so",
    "urlFetchPending": false,
    "published": "Jan 13, 2017 5:31:11 PM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/53101/data-scientist-at-adzuna/",
    "title": "Data Scientist",
    "content": "We’re looking for a Data Scientist to help us make job search better using the power of data. This is a rare and exciting opportunity to join one of the UK’s most dynamic and fastest-growing startups, reporting to the Head of Data Science and playing a key part in Adzuna’s current and future data science projects. Do you want to make a difference in a young company or be a small cog in a large corporation?\u003cbr /\u003eThe role requires somebody keen to work in a team solving interesting and complex data science challenges such as accurately matching jobs with candidates. It will involve working with massive datasets, natural language processing, and designing and implementing models using advanced machine learning techniques.\u003cbr /\u003eAs well as the ability to work independently on new products, the role also requires somebody keen and willing to undertake ad-hoc data analyses and help improve and maintain our existing data-driven products such as Jobsworth and ValueMyCV.\u003cbr /\u003eWe offer a fun and supportive working environment, with an emphasis on team-working, mentoring and training. Adzuna is an exciting high-growth business where you can make a huge difference, with a market competitive package including significant stock options.\u003cbr /\u003e\u003cbr /\u003eMandatory skills/qualifications\u003cbr /\u003e●    Direct experience of building models using machine-learning techniques. This experience may have been acquired solely in academia or industry (or in combination)\u003cbr /\u003e●    A technical degree at 2.1 or better (or equivalent) from a top university, with a background in a relevant discipline such as computer science, engineering, economics, or maths\u003cbr /\u003e●    Advanced proficiency (and min. 2 years’ experience) with R and/or Python\u003cbr /\u003e●    Experience with natural language processing, text mining, ontologies\u003cbr /\u003e●    Experience with extracting, parsing and wrangling large volumes of data in a range of different formats (such as csv, JSON, and XML)\u003cbr /\u003e●    Knowledge of statistics and probability theory - including AB testing and Bayesian stats \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eNice-to-have experience\u003cbr /\u003e●    PhD in a relevant field of machine-learning\u003cbr /\u003e●    Knowledge of advanced neural network methods: eg deep multi-layer networks\u003cbr /\u003e●    Ability to rapid prototype web interfaces to demonstrate/test models (eg Shiny) and/or create simple APIs to interface models\u003cbr /\u003e●    Experience of utilising distributed storage and processing technologies (eg Hadoop / Spark / Presto) and/or open source libraries like TensorFlow.\u003cbr /\u003e●    Designing or building recommendation engines \u003cbr /\u003e●    Working in online classified advertising or with job advert and/or CV data (eg HR-XML)\u003cbr /\u003e●    Intermediate/advanced SQL skills\u003cbr /\u003e●    Foreign-language skills (Adzuna operates in 11 countries)\u003cbr /\u003e●    Successful participation in machine learning competitions such as Kaggle\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eAbout Adzuna\u003cbr /\u003eAdzuna is a search engine for job ads used by over 9 million visitors per month that aims to list every job, everywhere. We search thousands of websites so our users don’t have to, bringing together millions of ads in one place. By providing smarter search options and powerful data about the job market, we give jobseekers the information they need to take control of their careers.\u003cbr /\u003e\u003cbr /\u003eAdzuna.co.uk was founded in 2011 by Andrew Hunter and Doug Monro, formerly of eBay, Gumtree, Qype and Zoopla and is backed by leading Venture Capital firms Passion Capital, The Accelerator Group and Index Ventures. Adzuna has also been selected to be part of the Government’s Future Fifty programme.\u003cbr /\u003e\u003cbr /\u003eAdzuna’s mission is to be the best place to start looking for a job. We love using the awesome power of technology to help match people to better, more fulfilling jobs and keep Britain working.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e",
    "urlFetchPending": false,
    "published": "Jan 9, 2017 3:20:12 PM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/52490/computer-vision-engineer-at-a-machine-learning-company-at-ryelore/",
    "title": "Computer vision engineer at a machine learning company",
    "content": "We are a six person machine learning company founded two years ago. We released a publishing e-commerce product earlier this year. Currently, we are building a new product for the finance industry. The team comprises of four engineers, one designer and one business developer. We’re an experienced team with post-graduates from leading universities and prior experience in established companies.\u003cbr /\u003e\u003cbr /\u003eWe’re looking for someone with computer vision and optionally machine learning or python skills to work with us. We welcome people who can work remotely and part-time.\u003cbr /\u003e\u003cbr /\u003ePlease get in touch if this interests you.",
    "urlFetchPending": false,
    "published": "Dec 11, 2016 11:36:20 AM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/52489/python-developer-at-a-machine-learning-company-at-ryelore/",
    "title": "Python developer at a machine learning company",
    "content": "We are a six person machine learning company founded two years ago. We released a publishing e-commerce product earlier this year. Currently, we are building a new product for the finance industry. The team comprises of four engineers, one designer and one business developer. We’re an experienced team with post-graduates from leading universities and prior experience in established companies.\u003cbr /\u003e\u003cbr /\u003eWe’re looking for someone with python and optionally machine learning or computer vision skills to work with us. We welcome people who can work remotely and part-time.\u003cbr /\u003e\u003cbr /\u003ePlease get in touch if this interests you.",
    "urlFetchPending": false,
    "published": "Dec 11, 2016 11:12:06 AM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "workinstartups-testers",
    "url": "http://workinstartups.com/job-board/job/53224/junior-data-scientist-at-street-team/",
    "title": "Junior Data Scientist",
    "content": "Junior Data Scientist Performance Profile\u003cbr /\u003e\u003cbr /\u003eWe need a Junior Data Scientist to help our community managers understand what makes ambassadors tick and help our customer success managers ensure our clients love us! We want you to dive into our data and discover patterns that we didn’t even know exist, helping us make better decisions more quickly!\u003cbr /\u003e\u003cbr /\u003eRequirements\u003cbr /\u003e\u003cbr /\u003eParticipate and assist a team of client and ambassador facing staff to provide insight and measurement of activity on the product, providing critical information and helping to make good decisions.\u003cbr /\u003e\u003cbr /\u003eIn the next 12 months you will:\u003cbr /\u003e\u003cbr /\u003eDirectly query our reporting databases, helping to inform future data and product decisions\u003cbr /\u003eDesign and produce insightful reporting that helps our clients understand the power of their ambassador programmes\u003cbr /\u003eHelp us understand ambassador patterns that we didn’t even know were there to enable us to drive more revenue for our clients \u003cbr /\u003eProvide business intelligence to the organisation, enhancing and contributing to our current BI solution\u003cbr /\u003ePromote and champion a culture of making better decisions through data\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWhat’s in it for you?\u003cbr /\u003e\u003cbr /\u003eYou’ll be joining the company at an exciting time. Having just closed a major round of funding, we\u0027re building our London based engineering team from the ground up and you’ll have an opportunity to be one of the first people to join a growing team of highly experienced engineers where you’ll share in the business’ continued growth.\u003cbr /\u003e\u003cbr /\u003eStreetTeam believes in freedom and ownership with the focus entirely on the value you create– there are no set hours, meetings are optional and you can take as much holiday as you need. We only care about the results you deliver. We are free-thinking, fast learners who want to inspire change. Are you?\u003cbr /\u003e\u003cbr /\u003eStreetTeam care deeply about helping the tech industry become a more inclusive and diverse place and we work hard to lead by example. We are committed to Equal Employment Opportunity through attracting and retaining a complementary team of employees and building an inclusive environment for all.",
    "urlFetchPending": false,
    "published": "Jan 12, 2017 11:01:27 AM",
    "tags": [
      "TITLE1/data",
      "REMOTE2/locals-only",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "jobs.remotive.io",
    "url": "https://www.mysliderule.com/join-us#data-science-course-mentor",
    "title": "Data Science Course Mentor  at My Slide Rule, Online \u0026 Self-paced, education",
    "content": "Join Springboard to Build the Future of Education \u003cimg height\u003d\"1\" width\u003d\"1\" \u003cbr /\u003estyle\u003d\"display:none\" \u003cbr /\u003esrc\u003d\"https://www.facebook.com/tr?id\u003d986855681343301\u0026amp;ev\u003dPageView\u0026amp;noscript\u003d1\"\u003e\u003cbr /\u003eToggle navigation  \u003c\u003e ×  \u003c\u003e \u003cbr /\u003e * New! Programs  \u003c\u003e \u003cbr /\u003e * New! Career Tracks \u003cbr /\u003e * \u003cbr /\u003e * Data Science Career Track \u003c\u003e \u003cbr /\u003e * Workshops \u003cbr /\u003e * \u003cbr /\u003e * Data Analytics for Business \u003c\u003e \u003cbr /\u003e * Foundations of Data Science \u003c\u003e \u003cbr /\u003e * Data Science Intensive \u003c\u003e \u003cbr /\u003e * UX Design \u003c\u003e \u003cbr /\u003e * Alumni \u003c\u003e \u003cbr /\u003e * Resources  \u003c\u003e \u003cbr /\u003e * Learning Paths \u003cbr /\u003e * \u003cbr /\u003e *  Data Analysis  \u003c\u003e \u003cbr /\u003e *  UX Design  \u003c\u003e \u003cbr /\u003e *  Android App Development  \u003c\u003e \u003cbr /\u003e *  Web Development with Python  \u003c\u003e \u003cbr /\u003e *  Browse All  \u003c\u003e \u003cbr /\u003e * Guides \u0026 email resources \u003cbr /\u003e * \u003cbr /\u003e *  Guide to Data Science Interviews  \u003c\u003e \u003cbr /\u003e *  Data Podcasts \u0026 Newsletters  \u003c\u003e \u003cbr /\u003e *  Data Science Process Email Course  \u003cbr /\u003e\u003chttps://www.springboard.com/resources/data-science-process/\u003e \u003cbr /\u003e *  Guide to Data Science Jobs  \u003cbr /\u003e\u003chttps://www.springboard.com/resources/guide-to-data-science-jobs/\u003e \u003cbr /\u003e * Datacamp + Springboard\u0027s Course on R \u003cbr /\u003e\u003chttps://www.datacamp.com/courses/r-yelp-and-the-search-for-good-indian-food\u003e \u003cbr /\u003e *  Guide to UX Design Careers  \u003c\u003e \u003cbr /\u003e * Course Finder \u003c\u003e \u003cbr /\u003e * Blog \u003c\u003e \u003cbr /\u003e * Login \u003c\u003e × \u003c\u003e \u003cbr /\u003eEverything you want to learn, online. Sign up to track your learning and save \u003cbr /\u003eyour favorites.\u003cbr /\u003eSIGN UP WITH Facebook \u003c\u003e Sign Up with Google \u003c\u003e Sign Up with LinkedIn \u003c\u003e \u003cbr /\u003eRecommended. We will never post anything without your permission\u003cbr /\u003e\u003cbr /\u003eSign up with Email\u003cbr /\u003eEmail address Password \u003cbr /\u003eCaps lock is On\u003cbr /\u003e\u003cbr /\u003eAlready a Member? Log in \u003c\u003e\u003cbr /\u003e\u003cbr /\u003eLog Into Springboard\u003cbr /\u003e× \u003c\u003e Login using Facebook \u003c\u003e Login using Google \u003c\u003e Login using LinkedIn \u003c\u003e \u003cbr /\u003e Log In with Email \u003cbr /\u003eEmail address Password \u003cbr /\u003eCaps lock is On\u003cbr /\u003e Remember Me \u003cbr /\u003eForgot Password? \u003c\u003e \u003cbr /\u003e\u003cbr /\u003eNeed an account? Sign Up \u003c\u003e\u003cbr /\u003e\u003cbr /\u003eJoin us to Build the Future of Education\u003cbr /\u003e\u003cbr /\u003eWe are a fast-growing startup with a big vision for transforming education \u003cbr /\u003eusing open, online learning. Our mission is to bridge the skills gap by \u003cbr /\u003edelivering high-quality, affordable education in subjects most relevant in \u003cbr /\u003etoday’s economy.\u003cbr /\u003e\u003cbr /\u003eWe’ve been written about in Lifehacker, Venturebeat, TechCrunch, YourStory \u003cbr /\u003eamong other publications, and have been on the front page of HackerNews and \u003cbr /\u003eReddit multiple times. We are backed by some phenomenal angel investors.\u003cbr /\u003e\u003cbr /\u003eThis is just the beginning, and we can do much better with you! As an early \u003cbr /\u003emember of a small team, you can have the opportunity to make tremendous impact \u003cbr /\u003eon the company’s roadmap.\u003cbr /\u003e\u003cbr /\u003eJob Perks\u003cbr /\u003e\u003cbr /\u003e * Awesome Location: We’re in the heart of the city in San Francisco and \u003cbr /\u003eBangalore. \u003cbr /\u003e * Fun: We love to go out to the best microbreweries, movies, and music gigs \u003cbr /\u003ein town. \u003cbr /\u003e * Free Food: Team lunches, trips to the farmer’s market, free coffee and beer!\u003cbr /\u003e * Learning: A sweet stipend for learning (anything, from Japanese to \u003cbr /\u003ephotography!). \u003cbr /\u003e * Healthcare: Fully covered medical, dental and vision plans. \u003cbr /\u003e * Wellness: Flexible work hours and vacation policy. \u003cbr /\u003eTechnology\u003cbr /\u003e\u003cbr /\u003e * Front-end Developer \u003cbr /\u003eBangalore \u003cbr /\u003eRole:\u003cbr /\u003e\u003cbr /\u003eSpringboard website is a beautiful responsive website with Python/Django as \u003cbr /\u003eprimary technology stack. We are looking to add a great front-end developer to \u003cbr /\u003eour team. We have a lot of fantastic features planned in coming months; our \u003cbr /\u003eproduct is continuously being improved and you will take on a huge chunk of \u003cbr /\u003eresponsibility to build these features and contribute to a platform that\u0027s \u003cbr /\u003erobust and scalable.\u003cbr /\u003e\u003cbr /\u003eYou:\u003cbr /\u003e\u003cbr /\u003e * You love building things, and have built some web applications in the past. \u003cbr /\u003e * You have a sound understanding of data structures and algorithms. \u003cbr /\u003e * You are an expert in HTML, CSS, JavaScript and jQuery. \u003cbr /\u003e * Familiarity with new-age frameworks like React, AngularJS or Angular 2 \u003cbr /\u003ewould be a plus. \u003cbr /\u003e * You understand how website front-end interacts with backend. \u003cbr /\u003e * You can guess RGB value of any color correctly. ;) \u003cbr /\u003e * You are familiar with Photoshop (not mandatory). \u003cbr /\u003e * You are analytical, and are curious about technology, and interested in \u003cbr /\u003estartups. \u003cbr /\u003e * When you don\u0027t know, you ask questions or look for answers on the internet. \u003cbr /\u003e * You are not afraid to express your opinion. \u003cbr /\u003e * You are fanatical about the quality of your work; you finish what you start.\u003cbr /\u003e * You have strong English comprehension and communication skills; you can \u003cbr /\u003earticulate your ideas clearly. \u003cbr /\u003eApply now \u003cbr /\u003e\u003cmailto:tech-jobs@springboard.com?subject\u003dJob%20Application%3A%20Front-end%20Developer\u003e\u003cbr /\u003eOperations \u0026 Marketing\u003cbr /\u003e\u003cbr /\u003e * Growth / Marketing Lead \u003cbr /\u003eSan Francisco \u003cbr /\u003eRole:\u003cbr /\u003e\u003cbr /\u003eSpringboard has seen incredible revenue growth, driven by a talented yet small \u003cbr /\u003egrowth team. We are now looking for a Head of Growth Marketing to scale the \u003cbr /\u003eteam and revenues, while championing our brand. The ideal person is a \u003cbr /\u003edata-driven, user-focused marketer, who can both think strategically and dive \u003cbr /\u003einto details.\u003cbr /\u003e\u003cbr /\u003eYou will be responsible for leading our marketing team, and growing revenue. \u003cbr /\u003eYou will own aggressive growth goals, set the strategy, and hire, mentor and \u003cbr /\u003emanage a high-performing team. You will also roll up your sleeves, a lot. This \u003cbr /\u003eis NOT simply a “manager“ role.\u003cbr /\u003e\u003cbr /\u003eYou will work on the leadership team directly with the founders and leaders of \u003cbr /\u003eother teams within the company. You’ll bring the best growth marketing and \u003cbr /\u003emanagement practices together, and foster an environment where the team \u003cbr /\u003econtinues to love working together.\u003cbr /\u003e\u003cbr /\u003eThis position has a path towards growing to be the VP of Marketing as the team \u003cbr /\u003egrows.\u003cbr /\u003e\u003cbr /\u003eResponsibilities:\u003cbr /\u003e\u003cbr /\u003e * Own the company’s revenue goals, along with the co-founders \u003cbr /\u003e * Build and own the company’s growth model to plan our growth to 3x, 10x, and \u003cbr /\u003e50x our current scale \u003cbr /\u003e * Develop a deep understanding of our (prospective) users, their motivations, \u003cbr /\u003eand why they choose Springboard \u003cbr /\u003e * Become an expert on our customer acquisition channels, funnels and \u003cbr /\u003emarketing stack \u003cbr /\u003e * Own the marketing budget, and allocate optimally across tools and channels \u003cbr /\u003eIdentify and prioritize growth experiments -- e.g. optimize existing channels, \u003cbr /\u003eand discover new ones \u003cbr /\u003e * Establish a growth habit and culture of experimentation. Work with the team \u003cbr /\u003eto prioritize and implement growth experiments \u003cbr /\u003e * Lead the charge on building a data-driven culture, including \u003cbr /\u003einstrumentation and attribution \u003cbr /\u003e * Work closely with the product team to refine refine UX, copy, and messaging \u003cbr /\u003e * Steward the Springboard brand and voice; ensure consistency in all our \u003cbr /\u003ecommunication \u003cbr /\u003e * Manage and continue to build out the growth/marketing team \u003cbr /\u003eYou:\u003cbr /\u003e\u003cbr /\u003e * You have 4+ years of growth/marketing experience with experience mentoring \u003cbr /\u003eand managing high-performers \u003cbr /\u003e * You have a track record of success in growth / user acquisition, ideally on \u003cbr /\u003ea startup team when it scaled from Series A to Series B \u003cbr /\u003e * You bring a solid understanding of free and paid user acquisition channels, \u003cbr /\u003ewith deep expertise scaling at least one channel \u003cbr /\u003e * You think from first principles, by putting yourself in the shoes of the \u003cbr /\u003euser \u003cbr /\u003e * You are willing to bet on bold experiments, with a strong ability to \u003cbr /\u003eprioritize \u003cbr /\u003e * You are very analytical, and communicate clearly \u003cbr /\u003e * You’re comfortable getting your hands dirty and implementing your own ideas \u003cbr /\u003e * You are passionate about improving education and seriously committed to \u003cbr /\u003ehelping build an organization from ground up, even though it means things won’t \u003cbr /\u003ealways be easy. \u003cbr /\u003eApply now \u003chttps://springboardeducation.recruiterbox.com/jobs/fk06a9f\u003e \u003cbr /\u003e * Mentor Relationship Manager \u003cbr /\u003eSan Francisco \u003cbr /\u003eRole:\u003cbr /\u003e\u003cbr /\u003eThe greatest strength of Springboard’s model of education is the mentorship \u003cbr /\u003efrom our unmatched community of industry experts, which includes designers, \u003cbr /\u003eanalysts and data scientists at premier consulting firms, Fortune 500 companies \u003cbr /\u003eand top-notch startups (e.g. AirBnb, Uber, McKinsey, Apple, Capital One). As \u003cbr /\u003eour first Mentor Relationship Manager, your job will be to deliver a fantastic \u003cbr /\u003eexperience for our mentors and grow their engagement with Springboard.\u003cbr /\u003e\u003cbr /\u003eWhen mentors have questions, you’ll be there to help. You will develop \u003cbr /\u003erelationships, empathize and build trust, and advocate for mentors. And as an \u003cbr /\u003eearly member of our team, you’ll have opportunities to significantly shape the \u003cbr /\u003edevelopment of policy, operations, and our platform.\u003cbr /\u003e\u003cbr /\u003eResponsibilities:\u003cbr /\u003e\u003cbr /\u003eYour typical day may include\u003cbr /\u003e\u003cbr /\u003e * Jumping on a call with a mentor to discuss student feedback \u003cbr /\u003e * Answering questions posted in our online mentor community \u003cbr /\u003e * Recording a fun video congratulating a mentor on their student graduating \u003cbr /\u003e * Proactively contacting mentors with struggling students to share best \u003cbr /\u003epractices \u003cbr /\u003e * Crushing your email inbox by quickly helping each mentor sort things out \u003cbr /\u003eand alerting the engineering team to any bugs they need to investigate \u003cbr /\u003eYou:\u003cbr /\u003e\u003cbr /\u003e * You are excited about the opportunity to collaborate with talented people \u003cbr /\u003eand solve problems together! \u003cbr /\u003e * You love learning and want to work on a team that will invest in your \u003cbr /\u003epersonal/professional development \u003cbr /\u003e * You can deliver excellent customer service (written and verbal) and delight \u003cbr /\u003ementors on every interaction \u003cbr /\u003e * You are super meticulous and detail-oriented. You have a system for \u003cbr /\u003eeverything. Your books are organized in alphabetical order. (Okay, got a little \u003cbr /\u003ecarried away there) \u003cbr /\u003e * You are resourceful and like to figure stuff out \u003cbr /\u003e \u003cbr /\u003e\u003cbr /\u003eBonus points for\u003cbr /\u003e\u003cbr /\u003e * 2-4 years experience in Account/Relationship Management or Customer Service \u003cbr /\u003eRoles \u003cbr /\u003e * Experience teaching, mentoring or training others \u003cbr /\u003e * Strong analytical and reasoning skills \u003cbr /\u003eApply now \u003chttps://springboardeducation.recruiterbox.com/jobs/fk064wn\u003e \u003cbr /\u003e * SEO Specialist (contract) \u003cbr /\u003eRemote \u003cbr /\u003eRole:\u003cbr /\u003e\u003cbr /\u003eSpringboard has seen incredible revenue growth, driven by a talented yet small \u003cbr /\u003egrowth team. We offer mentored workshops in data analytics, data science and UX \u003cbr /\u003edesign, with personalized instruction from industry experts. We are now looking \u003cbr /\u003efor a SEO specialist who can help us elevate our presence in search engines, \u003cbr /\u003eespecially for our critical revenue-generating workshop pages. \u003cbr /\u003e\u003cbr /\u003eYou will own getting pages such as our Data Analytics for Business course \u003cbr /\u003e\u003chttps://www.springboard.com/workshops/analytics\u003e to the top keyword ranking \u003cbr /\u003efor search terms that prospective students, looking for data analysis courses, \u003cbr /\u003ewill search. \u003cbr /\u003e\u003cbr /\u003eResponsibilities:\u003cbr /\u003e\u003cbr /\u003e * Design and create innovative link-building strategies \u003cbr /\u003e * Make content recommendations \u003cbr /\u003e * Iterate on a SEO plan with the Springboard team \u003cbr /\u003e * Report back on key metrics and performance indicators  \u003cbr /\u003eYou:\u003cbr /\u003e\u003cbr /\u003e * Are relentlessly entrepreneurial \u003cbr /\u003e * Great with managing many relationships at once \u003cbr /\u003e * Know how to persuade people to action \u003cbr /\u003e * Have an established track record ranking for high-volume keywords \u003cbr /\u003e * Ideally, you own your own blog or website and can show traffic generation \u003cbr /\u003eskills with them \u003cbr /\u003e * Good with both content and analytics  \u003cbr /\u003eApply now \u003chttps://springboardeducation.recruiterbox.com/jobs/fk065um\u003e \u003cbr /\u003eEducators\u003cbr /\u003e\u003cbr /\u003e * Data Science Course Mentor \u003cbr /\u003eRemote \u003cbr /\u003eRole:\u003cbr /\u003e\u003cbr /\u003eWe run online, self-paced Data Science workshops where participants learn with \u003cbr /\u003ethe help of a curated curriculum and 1-1 guidance from an expert mentor.\u003cbr /\u003e\u003cbr /\u003eOur mentor community - the biggest strength of our programs - has some of the \u003cbr /\u003ebest experts from the field. If you are as passionate about mentoring as you \u003cbr /\u003eare about Data Science, and can give a few hours per week in return for an \u003cbr /\u003ehonorarium, we would love to hear from you.\u003cbr /\u003e\u003cbr /\u003ePlease find more details about the program below.\u003cbr /\u003e\u003cbr /\u003e * Completely online and self-paced. Coursework is ~100 hours and on average, \u003cbr /\u003estudents finish it in 3 months. \u003cbr /\u003e * Participants in this course are working professionals and college students \u003cbr /\u003efrom all over the world, interested in getting started with Data Science. \u003cbr /\u003e * Participants learn about Data Science with the help of a curated online \u003cbr /\u003ecurriculum, many projects and a personal mentor. \u003cbr /\u003eResponsibilities:\u003cbr /\u003e\u003cbr /\u003e * Be proficient in the curriculum topics of the workshop you are mentoring \u003cbr /\u003efor. \u003cbr /\u003e * Weekly, 30-minute video check-ins with students to help them set and \u003cbr /\u003eachieve learning goals, answer subject matter questions, provide feedback on \u003cbr /\u003eprojects, and career advice. \u003cbr /\u003e * You can do the calls at a time of your convenience, and take as many \u003cbr /\u003ementees as your schedule permits. \u003cbr /\u003eYou:\u003cbr /\u003e\u003cbr /\u003e * You are as passionate about teaching Data Science as about Data Science \u003cbr /\u003eitself. \u003cbr /\u003e * You are that rare combination of programming, statistics and storytelling \u003cbr /\u003eskills. \u003cbr /\u003e * You are proficient in the curriculum topics of at least one of our \u003cbr /\u003eFoundations \u003chttps://www.mysliderule.com/workshops/data-science\u003e or Intensive \u003cbr /\u003e\u003chttps://www.mysliderule.com/workshops/data-science-intensive\u003e workshops. \u003cbr /\u003e * You have at least 2 years of experience solving real-life data science \u003cbr /\u003eproblems, and are comfortable working with large data sets. \u003cbr /\u003e * You are empathetic and have excellent communication skills. \u003cbr /\u003eApply now \u003cbr /\u003e\u003chttps://springboardeducation.recruiterbox.com/jobs/fk06qfx/?source\u003dSpringboard\u003e\u003cbr /\u003e * UX Design Course Mentor \u003cbr /\u003eRemote \u003cbr /\u003eRole:\u003cbr /\u003e\u003cbr /\u003eWe run online, self-paced UX Design \u003cbr /\u003e\u003chttps://www.springboard.com/workshops/ux-design\u003e workshops where participants \u003cbr /\u003elearn with the help of a curated curriculum and 1-1 guidance from an expert \u003cbr /\u003ementor.\u003cbr /\u003e\u003cbr /\u003eOur mentor community - the biggest strength of our programs - has some of the \u003cbr /\u003ebest experts from the field. If you are as passionate about mentoring as you \u003cbr /\u003eare about UX Design and can give a few hours per week in return for an \u003cbr /\u003ehonorarium, we would love to hear from you.\u003cbr /\u003e\u003cbr /\u003ePlease find more details about the program below.\u003cbr /\u003e\u003cbr /\u003e * Completely online and self-paced. Coursework is ~100 hours and on average, \u003cbr /\u003estudents finish it in 3 months. \u003cbr /\u003e * Participants in this course are working professionals and college students \u003cbr /\u003efrom all over the world, interested in UX careers. \u003cbr /\u003e * Participants learn about UX Design with the help of a curated online \u003cbr /\u003ecurriculum, many projects and a personal mentor. \u003cbr /\u003eResponsibilities:\u003cbr /\u003e\u003cbr /\u003e * Be proficient in the curriculum topics covered in the workshop. \u003cbr /\u003e * Weekly, 30-minute video check-ins with students to help them set and \u003cbr /\u003eachieve learning goals, answer subject matter questions, provide feedback on \u003cbr /\u003eprojects, and career advice. \u003cbr /\u003e * You can do the calls at a time of your convenience, and take as many \u003cbr /\u003ementees as your schedule permits. \u003cbr /\u003eYou:\u003cbr /\u003e\u003cbr /\u003e * You are as passionate about teaching Design as about Design itself. \u003cbr /\u003e * You are proficient in the topics covered in our UX Design \u003cbr /\u003e\u003chttps://www.mysliderule.com/workshops/ux-design\u003e workshop. \u003cbr /\u003e * You have at least 2 years of relevant work experience, and a handsome \u003cbr /\u003eportfolio to show for it. \u003cbr /\u003e * You are empathetic and have excellent communication skills. \u003cbr /\u003eApply now \u003cbr /\u003e\u003chttps://springboardeducation.recruiterbox.com/jobs/fk06ux7/?source\u003dSpringboard\u003e\u003cbr /\u003e * Data Analytics for Business Course Mentor \u003cbr /\u003eRemote \u003cbr /\u003eRole:\u003cbr /\u003e\u003cbr /\u003eWe run an online Data Analytics for Business workshop where participants learn \u003cbr /\u003ewith the help of a case study based curriculum and 1-1 guidance from an expert \u003cbr /\u003ementor.Our mentor community - the biggest strength of our programs - has \u003cbr /\u003eexperts from the best organizations in the world. If you are as passionate \u003cbr /\u003eabout mentoring as you are about Data Analytics, and can give a few hours per \u003cbr /\u003eweek in return for an honorarium, we would love to hear from you.Our \u003cbr /\u003ementors are business analysts, data analysts and analytics experts at top \u003cbr /\u003econsulting firms, Fortune 500 companies and top-notch startups (e.g. Capital \u003cbr /\u003eOne, Lyft, McKinsey, Square).Please find more details about the program below.\u003cbr /\u003e\u003cbr /\u003e * 12-week online course that takes students through 5 real-world business \u003cbr /\u003ecases \u003cbr /\u003e * Course participants are working professionals and college students \u003cbr /\u003e * Participants learn about Data Analytics with the help of an online \u003cbr /\u003ecurriculum and a personal mentor. They go through the curriculum on their own \u003cbr /\u003eand have a weekly 45-minute video call with their mentor to discuss questions, \u003cbr /\u003eprojects, and career advice \u003cbr /\u003eResponsibilities:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBe proficient in the curriculum topics covered in the workshop.\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eWeekly, 45-minute video check-ins with students to help them set and achieve \u003cbr /\u003elearning goals, answer subject matter questions, provide feedback on projects, \u003cbr /\u003eand career advice.\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou can do the calls at a time of your convenience, and take as many mentees \u003cbr /\u003eas your schedule permits.\u003cbr /\u003e\u003cbr /\u003eYou:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou are as passionate about teaching Data Analytics as about Data \u003cbr /\u003eAnalytics itself.\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou are proficient in the topics covered in our curriculum \u003cbr /\u003e\u003chttps://www.springboard.com/workshops/analytics#workshop-curriculum-ctn\u003e, \u003cbr /\u003eincluding Excel, SQL and Tableau\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou have an excellent understanding of data visualization, data storytelling, \u003cbr /\u003eand how to think about data problems in a business context. \u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou are as passionate about teaching Data Analytics as about Data \u003cbr /\u003eAnalytics itself.\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou are proficient in the topics covered in our curriculum \u003cbr /\u003e\u003chttps://www.springboard.com/workshops/analytics#workshop-curriculum-ctn\u003e, \u003cbr /\u003eincluding Excel, SQL and Tableau\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou have an excellent understanding of data visualization, data storytelling, \u003cbr /\u003eand how to think about data problems in a business context. \u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou are available for weekly, 45-minute video check-ins with students to help \u003cbr /\u003ethem set and achieve learning goals, answer subject matter questions, provide \u003cbr /\u003efeedback on projects, and career advice.\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou have at least 2 years of experience solving real-life data \u003cbr /\u003eanalytics problems, and are comfortable working with large data sets.\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou are empathetic and have excellent communication skills\u003cbr /\u003e\u003cbr /\u003eApply now \u003chttps://springboardeducation.recruiterbox.com/jobs/fk06os7/\u003e \u003cbr /\u003eStay in the know!\u003cbr /\u003ePlease select one option from below list I want to learn... \u003cbr /\u003e * UX Design \u003c\u003e \u003cbr /\u003e * Data Science Basics \u003c\u003e \u003cbr /\u003e * Advanced Data Science \u003c\u003e \u003cbr /\u003e * Data Analytics \u003c\u003e Get Updates \u003cbr /\u003e *  \u003chttps://www.facebook.com/springboard/\u003e \u003cbr /\u003e *  \u003chttps://twitter.com/springboard\u003e Programs  \u003c\u003e \u003cbr /\u003e * Data Science Career Track \u003c\u003e \u003cbr /\u003e * Data Analytics for Business \u003c\u003e \u003cbr /\u003e * Foundations of Data Science \u003c\u003e \u003cbr /\u003e * Data Science Intensive \u003c\u003e \u003cbr /\u003e * UX Design School \u003c\u003e Resources  \u003c\u003e \u003cbr /\u003e * Data Analysis \u003c\u003e \u003cbr /\u003e * UX Design \u003c\u003e \u003cbr /\u003e * Web Dev with Python \u003c\u003e \u003cbr /\u003e * View all resources \u003c\u003e \u003cbr /\u003e * Company  \u003c\u003e \u003cbr /\u003e * About \u003c\u003e \u003cbr /\u003e * We\u0027re Hiring \u003c\u003e \u003cbr /\u003e * Contact \u003c\u003e \u003cbr /\u003e * Blog \u003c\u003e \u003cbr /\u003e * Mentors \u003c\u003e \u003cbr /\u003e * Become A Mentor \u003c\u003e \u003cbr /\u003e * Corporate Training \u003chttps://learn.springboard.com/corporate-training\u003e  © \u003cbr /\u003e2017 SlideRule Labs Inc. All rights reserved. Terms \u003c\u003e | Privacy \u003c\u003e \u003cbr /\u003e *  \u003chttps://www.facebook.com/springboard/\u003e \u003cbr /\u003e *  \u003chttps://twitter.com/springboard\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13544553",
    "title": "Semantic Machines | Software Engineers and Machine Learning Engineers | Boston, MA and SF Bay Area, CA (Berkeley) | http://www.semanticmachines.com/careers/ Semantic ...",
    "content": "Semantic Machines | Software Engineers and Machine Learning Engineers | Boston, \u003cbr /\u003eMA and SF Bay Area, CA (Berkeley) |http://www.semanticmachines.com/careers/ \u003cbr /\u003e\u003chttp://www.semanticmachines.com/careers/\u003e\u003cbr /\u003eSemantic Machines is developing technology to power the next generation of \u003cbr /\u003econversational artificial intelligence: AIs that you can actually have a \u003cbr /\u003econversation with. Think Google Assistant or Alexa or Siri, but without having \u003cbr /\u003eto carefully craft commands like you\u0027re talking to a Bash shell.\u003cbr /\u003e\u003cbr /\u003eOur team has built much of the core technology underlying Siri and Google Now, \u003cbr /\u003eand our founders (including both the former Chief Speech Scientist for Siri and \u003cbr /\u003ethe head of UC Berkeley\u0027s Natural Language Processing group) have multiple \u003cbr /\u003e\u003e$100 million exits under their belt.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking to hire a few talented software engineers and machine learning \u003cbr /\u003eengineers to help build out technology, by expanding our core NLP \u003cbr /\u003einfrastructure, data processing pipelines, neural net clusters, and backend \u003cbr /\u003eservices.\u003cbr /\u003e\u003cbr /\u003eExperience with natural language processing systems is a plus, as is \u003cbr /\u003eexperience with the JVM (especially Scala), but we\u0027re mainly interested in \u003cbr /\u003epassionate engineers who can learn quickly and work effectively in complex \u003cbr /\u003esystems.\u003cbr /\u003e\u003cbr /\u003ePlease reach out to me directly or email info@semanticmachines.com. Thanks! \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 10:09:05 PM",
    "tags": [
      "REMOTE2/America/West",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13542556",
    "title": "Sniply | Software Developer, Machine Learning Engineer | Vancouver, BC | http://snip.ly",
    "content": "Sniply | Software Developer, Machine Learning Engineer | Vancouver, BC | \u003cbr /\u003ehttp://snip.ly \u003chttp://snip.ly\u003e\u003cbr /\u003eSniply is a small startup (4 people so far), that makes a saas marketing tool. \u003cbr /\u003eWe\u0027re hiring for two new positions:\u003cbr /\u003e\u003cbr /\u003e1) Intermediate Software Developer: a fullstack web developer, the core skill \u003cbr /\u003eis javascript (we use react), but we also use python a lot (django, DRF)\u003cbr /\u003e\u003cbr /\u003e2) Machine Learning Engineer: we are working on a lot of NLP problems, \u003cbr /\u003especifically with document summarization.\u003cbr /\u003e\u003cbr /\u003eIf you\u0027re interested, check out our postings: https://angel.co/sniply-1/jobs \u003cbr /\u003e\u003chttps://angel.co/sniply-1/jobs\u003e \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 7:14:04 PM",
    "tags": [
      "TITLE1/data",
      "REMOTE1/100",
      "REMOTE2/America/East"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13542282",
    "title": "Zoomi Inc | Software and Machine Learning Engineer | Malvern, PA | Full-time, REMOTE",
    "content": "Zoomi Inc | Software and Machine Learning Engineer | Malvern, PA | Full-time, \u003cbr /\u003eREMOTE\u003cbr /\u003eZoomi is an analytics company that uses proprietary artificial intelligence to \u003cbr /\u003ediscover, interpret and communicate insights from learning interventions to \u003cbr /\u003eoptimize individual and business performance – Analyze massive amounts of data \u003cbr /\u003ecollected both natively and/or through our API\u003cbr /\u003e\u003cbr /\u003e– Identification of individual cognitive, behavioral and affective preferences \u003cbr /\u003eand performance to understand unique learning strategies\u003cbr /\u003e\u003cbr /\u003e– Proprietary artificial intelligence including machine learning, deep \u003cbr /\u003elearning, data mining, and natural language processing methods\u003cbr /\u003e\u003cbr /\u003e– AI-informed learning analytics (descriptive, predictive, prescriptive) \u003cbr /\u003ederived from data combinations between learning and business metrics allowing \u003cbr /\u003ecalculation of ROI\u003cbr /\u003e\u003cbr /\u003e– Dashboard visualization and real-time, automated AI-based personalization of \u003cbr /\u003econtent for an individualized learning experience\u003cbr /\u003e\u003cbr /\u003e– AI-based optimization of social learning\u003cbr /\u003e\u003cbr /\u003e– Productivity, Efficiency, and Compliance Improvements\u003cbr /\u003e\u003cbr /\u003eYou can find job postings here: http://zoomiinc.com/careers/ \u003cbr /\u003e\u003chttp://zoomiinc.com/careers/\u003e\u003cbr /\u003e\u003cbr /\u003eFor the Data Scientist role, we are looking for specifically for a candidate \u003cbr /\u003ewith a deep understanding of machine learning, preferably an advanced degree in \u003cbr /\u003ethe subject.\u003cbr /\u003e\u003cbr /\u003eAlthough not currently posted, we are also looking for Python and JavaScript \u003cbr /\u003edevelopers to work on our product development. Keep an eye out for these \u003cbr /\u003epostings soon or feel free to reach out to learn more before they are posted. \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 6:48:04 PM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13542284",
    "title": "Factual | Engineers and data lovers | Los Angeles, San Francisco, Shanghai | www.factual.com/jobs#openings",
    "content": "Factual | Engineers and data lovers | Los Angeles, San Francisco, Shanghai | \u003cbr /\u003ewww.factual.com/jobs#openings\u003cbr /\u003eFactual is currently hiring engineers and data lovers of all levels in the SF \u003cbr /\u003eBay Area, Los Angeles, and Shanghai.\u003cbr /\u003e\u003cbr /\u003eFactual’s location platform enriches mobile location signals with definitive \u003cbr /\u003eglobal data, enabling personalized and contextually relevant mobile \u003cbr /\u003eexperiences. Built from billions of inputs, the data is constantly updated by \u003cbr /\u003eFactual’s real-time data stack. We were named one of \"50 Disruptive Companies \u003cbr /\u003ein 2013\" by MIT Technology Review. We have a terrific team that is still fairly \u003cbr /\u003esmall and an incredible CEO who was previously the co-founder of Applied \u003cbr /\u003eSemantics (which was bought by Google and became AdSense). Factual has venture \u003cbr /\u003efunding from Andreessen-Horowitz and our partners/customers include Bing, \u003cbr /\u003eApple, Facebook and Groupon.\u003cbr /\u003e\u003cbr /\u003eThere are many challenging problems to work on at all layers of the stack: \u003cbr /\u003edata cleaning and canonicalization, storage, deduping, serving, APIs, improving \u003cbr /\u003edata using machine learning, etc. A great example is one of our most recent \u003cbr /\u003eproducts, Geopulse Audience, which stands at the intersection of high quality \u003cbr /\u003eplaces data and large scale analysis of user geo-data:\u003cbr /\u003ehttp://www.factual.com/products/geopulse-audience \u003cbr /\u003e\u003chttp://www.factual.com/products/geopulse-audience\u003e . If you love data, Factual \u003cbr /\u003eis the place to be. Our main criteria are that you\u0027re smart and get things \u003cbr /\u003edone, but you\u0027ll get bonus points for experience with Clojure (\u003cbr /\u003ehttp://www.factual.com/jobs/clojure \u003chttp://www.factual.com/jobs/clojure\u003e), \u003cbr /\u003emachine learning, NLP, algorithm design, or Hadoop/Spark.\u003cbr /\u003e\u003cbr /\u003eYou can email me personally at alexr@factual.com, or view our job postings \u003cbr /\u003ehere:https://www.factual.com/jobs#openings \u003cbr /\u003e\u003chttps://www.factual.com/jobs#openings\u003e \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 6:48:04 PM",
    "tags": [
      "TITLE1/data",
      "REMOTE2/locals-only",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13542596",
    "title": "Dia\u0026Co | New York City or REMOTE | Software Engineer, Product Manager, Data Scientist, and Data Analyst | Full-time",
    "content": "Dia\u0026Co | New York City or REMOTE | Software Engineer, Product Manager, Data \u003cbr /\u003eScientist, and Data Analyst | Full-time\u003cbr /\u003eDia\u0026Co is the premier personal styling service for plus-size women. We’re \u003cbr /\u003elooking for engineers, product, and data people to help create our suite of \u003cbr /\u003elarge consumer-facing and internal products that are transforming both \u003cbr /\u003eoperational efficiency and consumer e-commerce. We work with Ruby on Rails on \u003cbr /\u003ethe engineering side and Python on the data science side.\u003cbr /\u003e\u003cbr /\u003ePlease check out our tech blog to get an idea of what we think about and value:\u003cbr /\u003ehttps://making.dia.com/ \u003chttps://making.dia.com/\u003e\u003cbr /\u003e\u003cbr /\u003eThe interview process is a phone screen, a take home coding challenge, and \u003cbr /\u003efinally an on-site interview. Apply here, and let us know that you found us on \u003cbr /\u003eHacker News:https://www.dia.co/careers \u003chttps://www.dia.co/careers\u003e \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 7:18:04 PM",
    "tags": [
      "TITLE1/data",
      "REMOTE2/locals-only",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13541765",
    "title": "Powerley | Data Scientist, Android Developer, iOS Developer, NodeJS Engineer | Royal Oak, MI | Full-time | http://www.powerley.com/ Powerley is connecting ...",
    "content": "Powerley | Data Scientist, Android Developer, iOS Developer, NodeJS Engineer | \u003cbr /\u003eRoyal Oak, MI | Full-time |http://www.powerley.com/ \u003chttp://www.powerley.com/\u003e\u003cbr /\u003ePowerley is connecting the smart grid to the smart home and building the next \u003cbr /\u003egeneration of home energy management.\u003cbr /\u003e\u003cbr /\u003eHere are some of the things we do:\u003cbr /\u003e\u003cbr /\u003e- Real-time energy use visualization and personalized feedback\u003cbr /\u003e\u003cbr /\u003e- Energy signal disaggregation to understand of how individual appliances \u003cbr /\u003edrive aggregate usage in the home\u003cbr /\u003e\u003cbr /\u003e- Home automation and control using key smart home protocols (ZigBee, Z-Wave, \u003cbr /\u003eWi-Fi, Bluetooth and Thread)\u003cbr /\u003e\u003cbr /\u003e- Identify problems with appliances before they occur\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for experienced Data Scientists, Android \u0026 iOS Developers, and \u003cbr /\u003eNodeJS Engineers to help us build the platform that provides both the utility \u003cbr /\u003eand the homeowner a new level of connectivity and intelligence.\u003cbr /\u003e\u003cbr /\u003eIf you have any questions feel free to send me a PM or comment. You can apply \u003cbr /\u003eathttp://www.powerley.com/about/careers/ \u003cbr /\u003e\u003chttp://www.powerley.com/about/careers/\u003e\u003cbr /\u003e\u003cbr /\u003eRecent new articles\u003cbr /\u003e\u003cbr /\u003e[1] http://www.businesswire.com/news/home/20170131006068/en/Powe... \u003cbr /\u003e\u003chttp://www.businesswire.com/news/home/20170131006068/en/Powerley-Unveils-Energy-Driven-Smart-Home-Experience\u003e\u003cbr /\u003e [2]https://techcrunch.com/video/detroit-hustle-with-tome-powerl... \u003cbr /\u003e\u003chttps://techcrunch.com/video/detroit-hustle-with-tome-powerley-and-irule/587013a7c4d21f6c543e9beb/\u003e\u003cbr /\u003e [3]http://www.einnews.com/pr_news/361508874/parks-associates-dt... \u003cbr /\u003e\u003chttp://www.einnews.com/pr_news/361508874/parks-associates-dte-and-powerley-to-keynote-smart-energy-summit-engaging-consumers\u003e\u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "*********** chetankabra8 ***********\nHey, Can I get any reference for applying. \nreply \u003c\u003e",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 6:08:03 PM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13543078",
    "title": "EMAILAGE | Multiple Positions (Engineering, Software, Data Science) | Chandler, AZ, USA | ONSITE Prefered | Fulltime | https://emailage.com/ I ...",
    "content": "EMAILAGE | Multiple Positions (Engineering, Software, Data Science) | Chandler, \u003cbr /\u003eAZ, USA | ONSITE Prefered | Fulltime |https://emailage.com/ \u003cbr /\u003e\u003chttps://emailage.com/\u003e\u003cbr /\u003eI mention onsite above, but we do have remote team members. I\u0027ve only been \u003cbr /\u003ehere about a month so far, and it\u0027s been a nice place to work. Also, although \u003cbr /\u003ethe software engineer position mentions .Net (as most of our existing codebase \u003cbr /\u003eis C#), we do have development in other languages (Java, Node, etc).\u003cbr /\u003e\u003cbr /\u003eWe provide risk analysis based on email addresses and other information for \u003cbr /\u003emajor financial institutions, airlines and other industries.\u003cbr /\u003e\u003cbr /\u003eMore information: https://blog.emailage.com/jobs/ \u003cbr /\u003e\u003chttps://blog.emailage.com/jobs/\u003e \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 7:57:04 PM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13545914",
    "title": "rebaze - http://rebaze.com | \"Developer Advocate as a Service\" - Type of Engineer | Hannover, Germany | REMOTE + ONSITE in Germany | Fulltime Hey there, We develop tools, principles and products for enterprise engineering teams so they can have startup-like fun, too. We create rockstar tools, coach teams on new techs and reimagine existing software products. We are \"Developer Advocates as a Service\" for our clients. You are a software remodelling enthusiast! You love to refactor dusty codebases, simplify processes and removing obsolete stuff all DAY. You need to live in Germany or at least be able to travel to Germany 3 days/week. You should have a deep background in at least 2 of the following technical areas: - OSGi - Gradle - Machine Learning - Jetbrains MPS - Eclipse Platform (Plugins) - Devops Expert: Docker, Git, Jenkins Pipelines You should have fun working remotely (anywhere in the world) but willing to travel to clients (usually Germany) on a weekly basis. Our interview process begins with a video-call, followed by a coffee or beer either in Hannover, Frankfurt or Cologne. Find out more on https://github.com/rebaze/hr/blob/master/hire_junior_consult... Contact me at toni@rebaze.com or on Twitter @rebazeio Cheers, Toni reply ...",
    "content": "rebaze - http://rebaze.com \u003chttp://rebaze.com\u003e | \"Developer Advocate as a \u003cbr /\u003eService\" - Type of Engineer | Hannover, Germany | REMOTE + ONSITE in Germany | \u003cbr /\u003eFulltime\u003cbr /\u003eHey there, We develop tools, principles and products for enterprise \u003cbr /\u003eengineering teams so they can have startup-like fun, too. We create rockstar \u003cbr /\u003etools, coach teams on new techs and reimagine existing software products.\u003cbr /\u003e\u003cbr /\u003eWe are \"Developer Advocates as a Service\" for our clients.\u003cbr /\u003e\u003cbr /\u003eYou are a software remodelling enthusiast! You love to refactor dusty \u003cbr /\u003ecodebases, simplify processes and removing obsolete stuff all DAY.\u003cbr /\u003e\u003cbr /\u003eYou need to live in Germany or at least be able to travel to Germany 3 \u003cbr /\u003edays/week.\u003cbr /\u003e\u003cbr /\u003eYou should have a deep background in at least 2 of the following technical \u003cbr /\u003eareas: - OSGi - Gradle - Machine Learning - Jetbrains MPS - Eclipse Platform \u003cbr /\u003e(Plugins) - Devops Expert: Docker, Git, Jenkins Pipelines\u003cbr /\u003e\u003cbr /\u003eYou should have fun working remotely (anywhere in the world) but willing to \u003cbr /\u003etravel to clients (usually Germany) on a weekly basis.\u003cbr /\u003e\u003cbr /\u003eOur interview process begins with a video-call, followed by a coffee or beer \u003cbr /\u003eeither in Hannover, Frankfurt or Cologne.\u003cbr /\u003e\u003cbr /\u003eFind out more on \u003cbr /\u003ehttps://github.com/rebaze/hr/blob/master/hire_junior_consult... \u003cbr /\u003e\u003chttps://github.com/rebaze/hr/blob/master/hire_junior_consultant.md\u003e\u003cbr /\u003e\u003cbr /\u003eContact me at toni@rebaze.com or on Twitter @rebazeio\u003cbr /\u003e\u003cbr /\u003eCheers, Toni \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 2, 2017 12:15:05 AM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "craigslist-java-sfbay",
    "url": "http://sfbay.craigslist.org/pen/sof/5955824644.html",
    "title": "Seeking engineer for an exciting Machine Learning/NLP project",
    "content": "Seeking engineer for an exciting Machine Learning/NLP \u003cbr /\u003eproject hide this posting  unhide \u003cbr /\u003e\u003cbr /\u003ecompensation: Negotiable, guaranteed to be competitive.\u003cbr /\u003eemployment type: employee\u0027s choice\u003cbr /\u003einternship\u003cbr /\u003etelecommuting okay\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eQR Code Link to This Post\u003cbr /\u003e A startup is seeking a talented engineer experienced in machine learning, \u003cbr /\u003enatural language processing and big data systems, to work on an exciting and \u003cbr /\u003edisruptive problem. You can choose the number of hours that you\u0027d like to work \u003cbr /\u003eand are welcome to work remotely as well. Salary will be competitive and can be \u003cbr /\u003enegotiated.\u003cbr /\u003e\u003cbr /\u003e Interested applicants should send a resume and/or a cover letter.\u003cbr /\u003e\u003cbr /\u003e Required Skills/Qualification:\u003cbr /\u003e\u003cbr /\u003e * BS/MS or in Computer Science (current students welcome to apply)\u003cbr /\u003e * Proficient in Java or Python\u003cbr /\u003e * Familiar with Github, Maven, AWS services\u003cbr /\u003e * Comfortable working with large data sets\u003cbr /\u003e * Experienced in Machine Learning, AI and Natural Language Processing\u003cbr /\u003e * Excellent oral and written communication skills\u003cbr /\u003e * Reliable and responsive \u003cbr /\u003e * Principals only. Recruiters, please don\u0027t contact this job poster. \u003cbr /\u003e * do NOT contact us with unsolicited services or offers \u003cbr /\u003e * OK to highlight this job opening for persons with disabilities",
    "urlFetchPending": false,
    "published": "Jan 12, 2017 11:27:47 AM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/job/Data-Engineer-at-Trust-In-Soda-in-Home-Based-b8b79dc810589183",
    "title": "Data Engineer - Trust In Soda Ltd - Home Based",
    "content": "\u003c\u003e Data Engineer \u003cbr /\u003eTrust In Soda Ltd - Home Based \u003cbr /\u003e Permanent \u003cbr /\u003eSpark, Java, Scala \u003cbr /\u003e\u003cbr /\u003e Remote work possible but you must be eligible to work in Germany since you \u003cbr /\u003ewill be required to be in the Berlin office for 5 days a month, the rest of the \u003cbr /\u003etime its fully remote.\u003cbr /\u003e\u003cbr /\u003eLocation: Berlin \u003cbr /\u003e\u003cbr /\u003e  50,000 -  75,000 \u003cbr /\u003e\u003cbr /\u003e Our client is an innovative internet company who are part of a world class \u003cbr /\u003eleading technology solution provider. They are currently 80 people in Berlin \u003cbr /\u003ewith 50 across engineering including product and BI. This company are \u003cbr /\u003egenerating 40 terabytes of data per day.\u003cbr /\u003e\u003cbr /\u003e We\u0027re looking for a talented Data Engineer to join this stellar team of \u003cbr /\u003einternational experts.\u003cbr /\u003e\u003cbr /\u003e The Role \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e * Being a member of the data-team, you will be working in a cross-discipline, \u003cbr /\u003efull stack delivery team focused on one of many core business objectives. \u003cbr /\u003e * Gather and process raw data at scale (including writing programs \u0026 scripts, \u003cbr /\u003eweb scraping, calling APIs, write SQL queries, etc.). \u003cbr /\u003e * Work closely with other engineers and data scientists to integrate \u003cbr /\u003ealgorithms into their production systems. \u003cbr /\u003e * Process unstructured data into a form suitable for analysis, automate the \u003cbr /\u003eanalysis and make the results available. \u003cbr /\u003e * They use Spark, so experience with the ecosystem will help you hit the \u003cbr /\u003eground running.  Required Skills \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e * You find creative solutions to tough problems. You are an architect, who is \u003cbr /\u003enot afraid to pave the way for bigger and better things. \u003cbr /\u003e * Very strong programming and architectural experience, ideally in Python, Go \u003cbr /\u003eor Java, but we are open to other experience if you\u0027re willing to learn the \u003cbr /\u003elanguages we use. \u003cbr /\u003e * Automate testing, scaling, maintenance and configuration. \u003cbr /\u003e * Strong experience building data pipelines using the Lambda architecture. \u003cbr /\u003e * Experience with real-time processing of large amounts of structured and \u003cbr /\u003eunstructured data. \u003cbr /\u003e * Enough programming knowledge to clean and scrub noisy datasets. \u003cbr /\u003e * Strong experience working with ETL using MapReduce and data streaming \u003cbr /\u003eframeworks such as Spark and Storm is a plus as well as messaging queues. \u003cbr /\u003e * Working with data mining, machine learning, natural language processing, or \u003cbr /\u003einformation retrieval is a plus  This is the chance to work for an awesome \u003cbr /\u003ecompany with people who are \"Smart\" and \"Get things done\". They care about \u003cbr /\u003eproducing absolute quality work and using the right tools and methodologies to \u003cbr /\u003eachieve that. There is genuine rapid career progression available and this is \u003cbr /\u003ethe chance to work in Berlin, offering culture, diversity, fun and low living \u003cbr /\u003ecosts! : -)\u003cbr /\u003e\u003cbr /\u003e Please apply for more information\u003cbr /\u003eJobsite UK - 22 hours ago",
    "urlFetchPending": false,
    "published": "Feb 8, 2017 1:34:36 AM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/data",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/128299/senior-distributed-database-engineer-stardog-union?a\u003dH1HJjJyDrcA",
    "title": "Senior Distributed Database Engineer at Stardog Union (Arlington, VA) (allows remote)",
    "content": "Stardog is an enterprise data unification platform built on smart graph \u003cbr /\u003etechnology: query, search, inference, and data virtualization.\u003cbr /\u003e\u003cbr /\u003eThe future has always been distributed and the future is arriving now. If you \u003cbr /\u003eknow that Raft isn\u0027t just a flotation device, then you could be a great fit for \u003cbr /\u003eStardog.\u003cbr /\u003e\u003cbr /\u003eResponsibilities:\u003cbr /\u003e\u003cbr /\u003e * Help design and build storage and query evaluation over a large \u003cbr /\u003edistributed database \u003cbr /\u003e * Develop and implement algorithms for distributed transactions over very \u003cbr /\u003elarge clusters \u003cbr /\u003e * Implement and optimize graph algorithms over distributed indexes  \u003cbr /\u003e * Work on integration with DCOS frameworks like Mesos \u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003e * 5+ years programming experience, ideally in Java \u003cbr /\u003e * Strong computer science fundamentals, with advanced knowledge of data \u003cbr /\u003estructures, \u2028algorithms and software design \u003cbr /\u003e * Experience building distributed databases and service-oriented architectures\u003cbr /\u003e * Knowledge of Spark, Storm, Flink, DCOS frameworks like Mesos \u003cbr /\u003e * Ability to work in a distributed team mainly communicating over email, \u003cbr /\u003echat, and phone \u003cbr /\u003e * Experience with graph technologies or databases is a plus \u003cbr /\u003e About Stardog Union \u003cbr /\u003e\u003cbr /\u003eOur culture is based on engineering excellence, mutual respect, collegiality \u003cbr /\u003ein all things, rigor in design, research, implementation, and testing. We care \u003cbr /\u003edeeply about work-life balance and productivity in the short and long run. In \u003cbr /\u003esum, if you remove the unnecessary, the distracting, and the tedious, what \u003cbr /\u003eyou\u0027re left with is a healthy 40 hour week full of wins\u003cbr /\u003e\u003cbr /\u003eWe are committed to creating a diverse environment and are proud to be an \u003cbr /\u003eequal opportunity employer. All qualified applicants will receive consideration \u003cbr /\u003efor employment without regard to race, color, religion, gender, gender identity \u003cbr /\u003eor expression, sexual orientation, national origin, genetics, disability, age, \u003cbr /\u003eor veteran status.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 11 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? External URL  apply now  \u003cbr /\u003e\u003chttps://stardog.recruiterbox.com/jobs/33402bc5dd88455ba4d5123ba632cf81\u003e  more \u003cbr /\u003ejobs at Stardog Union \u003c\u003e \u003cbr /\u003eJoin us at Stardog Union\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003ehealth care including dental \u0026 vision 401k 3 weeks vacation remote work \u003cbr /\u003eavailable for qualified candidates \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eMichael \u003cbr /\u003ejava rdf semantic-web owl \u003cbr /\u003eview profile \u003c\u003e Learn more about Stardog Union \u003c\u003e more jobs at Stardog Union \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/Stardog-Union?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2/dcos",
      "REMOTE2/America",
      "TECH2/distributed-computing",
      "TECH2/apache-spark",
      "REMOTE1/50",
      "TITLE1/data",
      "TECH2/distributed-database",
      "TECH2/apache-flink"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/131151/senior-machine-learning-engineer-knock?a\u003dHZ0psuKuf8A",
    "title": "Senior Machine Learning Engineer at Knock () (allows remote)",
    "content": "We’re seeking a Senior Machine Learning Engineer to join us in building our \u003cbr /\u003epredictive models and our data science team. You will get to work with some of \u003cbr /\u003ethe most interesting data sets and have the freedom and responsibility to help \u003cbr /\u003eshape our core products from initial data exploration to production models. You \u003cbr /\u003ewill design and implement the foundation of our predictive models and work \u003cbr /\u003eclosely with other team members to test the accuracy in local markets.\u003cbr /\u003e\u003cbr /\u003eAs a Senior Machine Learning Engineer you will:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eDesign, code, train, test, deploy and iterate on large scale machine learning \u003cbr /\u003esystems.\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eDevelop model training platform and reusable data infrastructure components to \u003cbr /\u003eenable rapid prototyping by our data scientists.\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eDesign and build customized learning systems and integrate it with our \u003cbr /\u003eexisting products.\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBuild predictive services to price residential real-estate.\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAssessing the impact of using new data sources on data quality and precision \u003cbr /\u003eof our price predictions\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eWe’re looking for teammates who have:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eStrong desire to work at a rapidly growing startup and make it a success.\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003ePassion for taking on complex real world datasets, understanding them and \u003cbr /\u003ebuilding useful applications\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to rigorous analysis and model validation\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eThorough knowledge of machine learning, statistics, graph algorithms, linear \u003cbr /\u003ealgebra, and numerical optimization\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003ePassion for Deep Learning and Machine Learning\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003e5+ years full lifecycle software engineering experience including: coding, \u003cbr /\u003etesting, troubleshooting and deployment using general-purpose languages such \u003cbr /\u003eas: R, Scala, Java, Go, Python, and C++\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003e2+ years experience with building production end-to-end machine learning \u003cbr /\u003emodels at scale using distributed platforms such as Hadoop or Spark\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAdvanced degree in computer science, statistics, mathematics, or similar fields\u003cbr /\u003e\u003cbr /\u003e About Knock \u003cbr /\u003e\u003cbr /\u003eOur home is our largest purchase and most valuable asset, but it is also the \u003cbr /\u003emost difficult to buy and sell. Knock is a radical new way to buy or sell a \u003cbr /\u003ehome quickly without risk, stress and uncertainty. We guarantee homeowners that \u003cbr /\u003ewe can sell their home in 6 weeks or less or we buy it for market price. We \u003cbr /\u003eguarantee buyers that our homes are rock solid with our 200-point \u003cbr /\u003ehome-inspection, certification and extended warranty. Started by founding team \u003cbr /\u003emembers of Trulia.com (acquired by Zillow for $2.5B), Knock is an online home \u003cbr /\u003eselling platform that uses data science to price homes accurately, technology \u003cbr /\u003eto sell them quickly and a dedicated team of professionals to guide you every \u003cbr /\u003estep of the way.\u003cbr /\u003e\u003cbr /\u003eBenefits\u003cbr /\u003e\u003cbr /\u003eThis is an amazing opportunity to be an integral part of building a big brand \u003cbr /\u003efrom scratch in an industry that is long overdue for a new way of doing things. \u003cbr /\u003eYou will be working with a team that believes in the power of data and \u003cbr /\u003eanalytical decision making and desire to disrupt the status quo.\u003cbr /\u003e\u003cbr /\u003eWe offer competitive cash and stock compensation, full medical, dental, vision \u003cbr /\u003ebenefits, unlimited vacation and sick time and are open to where you live and \u003cbr /\u003ework.\u003cbr /\u003e\u003cbr /\u003eKnock is an Equal Opportunity Employer. Please no recruitment firm or agency \u003cbr /\u003einquiries.\u003cbr /\u003eExternal URL  apply now  \u003cbr /\u003e\u003chttps://knock.breezy.hr/p/f9b6577d298f-machine-learning-engineer/apply\u003e  more \u003cbr /\u003ejobs at Knock Homes \u003c\u003e \u003cbr /\u003eJoin us at Knock Homes \u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eFully distributed team, open to where you live and work. Unlimited vacation \u003cbr /\u003eand sick time Competitive cash and stock compensation Full medical, dental and \u003cbr /\u003evision benefits \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eRafaan Anvari \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Learn more about Knock Homes \u003c\u003e more jobs at Knock Homes \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/knock-homes?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2/java",
      "TECH2/machine-learning",
      "TECH2/r",
      "REMOTE2/America",
      "REMOTE1/50",
      "TITLE1/data",
      "TECH2/python",
      "TECH2/c++"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/130699/senior-data-science-engineer-zapier?a\u003dHPBI5hrz5Kg",
    "title": "Senior Data Science Engineer at Zapier () (allows remote)",
    "content": "Hello! I\u0027m Mike Knoop with the Product Team at Zapier \u003chttps://zapier.com/\u003e. \u003cbr /\u003eWe\u0027re looking for someone to join our Data Team who can help us maintain, \u003cbr /\u003edesign and launch new data pipelines for our product that helps 1.5 million \u003cbr /\u003eusers (and growing) automate their tedious, everyday tasks so they spend less \u003cbr /\u003etime working extra hours and more time enjoying what matters to them.  You’ll \u003cbr /\u003edesign and improve our data operations and you’ll get to work in the main \u003cbr /\u003eZapier code base as well as the Data Team’s R code base. You’ll have the \u003cbr /\u003eopportunity to learn and work with Airflow, Kafka, Spark, Secor, Kubernetes, \u003cbr /\u003eDocker, Redis, Redshift, MySQL, AWS and more.  If that sounds exciting to you, \u003cbr /\u003ekeep reading!\u003cbr /\u003e\u003cbr /\u003eWe\u0027re a widespread remote team of 62 people, located in eleven countries, that \u003cbr /\u003ethink computers should do more work. The Data Team currently has team members \u003cbr /\u003ein Texas and Alabama. You don\u0027t have to be located in the USA, you just have to \u003cbr /\u003ebe talented!\u003cbr /\u003e\u003cbr /\u003eWe get together 2-3 per year for a company retreat (next one in is January), \u003cbr /\u003eand benefits include great healthcare, dental and vision coverage, 401k \u003cbr /\u003eretirement plan with company match, profit sharing and 14 weeks paid leave for \u003cbr /\u003enew parents.\u003cbr /\u003e\u003cbr /\u003eIf you\u0027re interested in learning more about our Senior Data Engineer Role \u003cbr /\u003e\u003chttps://goo.gl/WnDstV\u003e, visit the Jobs @ Zapier site \u003chttps://goo.gl/WnDstV\u003e.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re not accepting applications from agencies.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 11 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? External URL  apply now  \u003cbr /\u003e\u003chttps://goo.gl/p498WR\u003e  more jobs at Zapier  \u003c\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2/redshift",
      "TECH2/airflow",
      "REMOTE2/America",
      "TECH2/apache-spark",
      "REMOTE1/50",
      "TECH2/apache-kafka",
      "TITLE1/data",
      "TECH2/ansible"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/132018/senior-data-science-engineer-adroll?a\u003dIh26Svrvems",
    "title": "Senior Data Science Engineer at AdRoll (San Francisco, CA) (allows remote)",
    "content": "About the Role:\u003cbr /\u003e\u003cbr /\u003eThe Data Science Engineering team writes the math and software that sit at the \u003cbr /\u003eheart of AdRoll’s real-time bidding technology, our core product.  Our software \u003cbr /\u003eruns over hundreds of terabytes of data daily to produce its models, which are \u003cbr /\u003ethen subsequently queried billions of times by hundreds of servers.\u003cbr /\u003e\u003cbr /\u003eCurrent members of Data Science Engineering have a passion for not only \u003cbr /\u003emathematics, but also technology. If you join our team, you will have the \u003cbr /\u003eopportunity to stay on the cutting edge of research and then to put this \u003cbr /\u003eresearch to practical use by building your own software and infrastructure \u003cbr /\u003esystems. When you push out your code, you will be able to see the results of \u003cbr /\u003eyour efforts ripple throughout our systems in real-time.\u003cbr /\u003e\u003cbr /\u003eMoreover, AdRoll Engineering is broken out into small teams that have \u003cbr /\u003esignificant autonomy. We like to think of Data Science Engineering as a \u003cbr /\u003e\"startup within AdRoll.\" You will design your systems as you see fit, own your \u003cbr /\u003ecode, and your work will have a very direct, measurable impact on AdRoll\u0027s core \u003cbr /\u003emetrics.\u003cbr /\u003e\u003cbr /\u003eData Science Engineering is a small team with a variety of concurrent \u003cbr /\u003eprojects. Your interests dictate what projects you will tackle. The common \u003cbr /\u003ethread among all projects is that they require a high level of mathematical \u003cbr /\u003esophistication and engineering prowess, due to the scale of our data.\u003cbr /\u003e\u003cbr /\u003eCurrent projects include:\u003cbr /\u003e\u003cbr /\u003e * Enhancing our machine learning software with the latest in machine learning \u003cbr /\u003ealgorithms \u003cbr /\u003e * Employing machine learning and statistical modeling over our petabytes of \u003cbr /\u003edata to generate new features to feed into our bid-time predictions \u003cbr /\u003e * Creating systems that monitor inputs and performance on a real-time basis \u003cbr /\u003eto inform engineers when unexpected changes arise. \u003cbr /\u003e * Performing automated market analyses to dynamically react to changing \u003cbr /\u003emarket conditions \u003cbr /\u003eResponsibilities:\u003cbr /\u003e\u003cbr /\u003e * Discover new predictive insights in our dataset \u003cbr /\u003e * Design systems that regularly compute new predictive models \u003cbr /\u003e * Read and conduct research to develop mathematical solutions to our most \u003cbr /\u003epressing problems \u003cbr /\u003e * Engineer to put your research into practice \u003cbr /\u003e * Ownership of a system that is the core of our intelligence products \u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eQualifications:\u003cbr /\u003e\u003cbr /\u003e * BS or MS in Computer Science, Computer Engineering, Mathematics. Strength \u003cbr /\u003ein both fields is necessary; double majors are a big plus. \u003cbr /\u003e * 3+ years experience with C, C++, or Java \u003cbr /\u003e * Proven ability at architecting scalable, high performance systems \u003cbr /\u003e * Experience translating math into efficient code \u003cbr /\u003e * Enthusiasm to work in a fast-paced engineering team \u003cbr /\u003eBonus Points:\u003cbr /\u003e\u003cbr /\u003e * Prior experience with machine learning algorithms and their implementations \u003cbr /\u003e * Experience with manipulating large data sets \u003cbr /\u003e * Understanding of online ad industry \u003cbr /\u003e * Humor. Old school video games. Robots. \u003cbr /\u003e About AdRoll \u003cbr /\u003e\u003cbr /\u003eCompensation:\u003cbr /\u003e\u003cbr /\u003e * Competitive salary and equity \u003cbr /\u003e * Medical / Dental / Vision benefits \u003cbr /\u003e * Paid time off and generous holiday schedule \u003cbr /\u003e * The opportunity to win the coveted Golden Bagel award \u003cbr /\u003eAbout AdRoll:\u003cbr /\u003e\u003cbr /\u003eAdRoll is the largest independent retargeting and prospecting platform with \u003cbr /\u003eover 25,000 clients worldwide. It specializes in performance marketing for \u003cbr /\u003eseveral verticals including e-commerce, b2b, finance, travel, education, and \u003cbr /\u003emedia, and analyzes data on over 1 billion digital profiles across desktop, \u003cbr /\u003emobile, and tablet devices through its proprietary technology. Partnering with \u003cbr /\u003etop media and tech companies including Google, Facebook, Twitter, Instagram, \u003cbr /\u003eand Apple, along with millions of websites and mobile apps, the company is home \u003cbr /\u003eto the world\u0027s largest opt-in advertiser data co-op. AdRoll’s goal is to map \u003cbr /\u003ethe world’s intent data and put it to work for every advertiser on the planet.\u003cbr /\u003e\u003cbr /\u003eAdRoll is headquartered in San Francisco, with offices in New York, Tokyo, \u003cbr /\u003eLondon, Dublin, and Sydney. It is backed by Foundation Capital, IVP, Accel \u003cbr /\u003ePartners, Merus Capital, Peter Thiel, and other leading investors. Learn more at\u003cbr /\u003e www.adroll.com \u003chttp://www.adroll.com/\u003e.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eAdRoll is committed to creating diverse teams of “Rollers” and is proud to be \u003cbr /\u003ean equal opportunity employer. All qualified applicants will receive \u003cbr /\u003econsideration without regard to race, color, ancestry, sex, religion, gender, \u003cbr /\u003egender identity or expression, sexual orientation, marital status, national \u003cbr /\u003eorigin, citizenship, genetics, disability, age, veteran status or other \u003cbr /\u003echaracteristics.\u003cbr /\u003eExternal URL  apply now  \u003chttp://grnh.se/nk4exa1\u003e  more jobs at AdRoll  \u003c\u003e \u003cbr /\u003eJoin us at AdRoll\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eTasty snacks, on tap beer/wine, weekly dinners, bagel Wednesdays Wellness \u003cbr /\u003eclasses (yoga, meditation, etc.) and monthly health subsidy PTO and holiday \u003cbr /\u003eschedule that allows for plenty of you time Commuter benefits for public \u003cbr /\u003etransit, parking, and bike repair Competitive medical, dental, and vision \u003cbr /\u003ebenefits Work environment centered on collaboration, impact, and agility \u003cbr /\u003eLearn more about AdRoll \u003c\u003e more jobs at AdRoll \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/adroll?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2/java",
      "TECH2/probability",
      "REMOTE2/America",
      "REMOTE1/50",
      "TITLE1/data",
      "TECH2/c++",
      "TECH2/math"
    ]
  },
  {
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/job/Online-Tutor-at-Brainfuse-in-Work-at-Home-8b9fee0eae5f5ca7",
    "title": "Online Tutor - Computer Science, Statistics, Business, and more! (Remote) - Brainfuse - Work at Home",
    "content": "\u003c\u003e Online Tutor - Computer Science, Statistics, Business, and more! (Remote) \u003cbr /\u003eBrainfuse 15 reviews \u003c\u003e - Work at Home \u003cbr /\u003e$10 - $15 an hour - Contract \u003cbr /\u003e\u003cbr /\u003eWho We Are\u003cbr /\u003e\u003cbr /\u003eBrainfuse (www.brainfuse.com) is a nationally recognized eLearning \u003cbr /\u003ecorporation. Founded in 1999, Brainfuse is one of the nation\u0027s leading online \u003cbr /\u003eeducation providers, serving a diverse client base of libraries, school \u003cbr /\u003edistricts, workforce centers, and universities.\u003cbr /\u003e\u003cbr /\u003eWho We Are Looking For\u003cbr /\u003e\u003cbr /\u003eBrainfuse is hiring tutors in all subjects. There are day and evening shifts \u003cbr /\u003eavailable. Since this is an online tutoring position, applicants will need to \u003cbr /\u003ehave their own computers and a stable Internet connection.\u003cbr /\u003e\u003cbr /\u003eSubjects that we are hiring for: \u003cbr /\u003e\u003cbr /\u003e * Science: Biology, Microbiology, Chemistry, Organic Chemistry, Physics, \u003cbr /\u003eEarth, and more.\u003cbr /\u003e * Math: Algebra, Geometry, Trigonometry, Precalculus, Calculus, Statistics, \u003cbr /\u003eand more.\u003cbr /\u003e * Business: Accounting, Economics, and Finance.\u003cbr /\u003e * Computer: Java, JavaScript, Cloud Computing, PHP/MySQL, PERL/CGI, Advanced \u003cbr /\u003eVisual Basic, C++, HTML, Information Technology, A+, Security +, CCNA, CCNA \u003cbr /\u003eSecurity, Linux+, Excel, PowerPoint, and Access.\u003cbr /\u003e * Nursing: Medical Technology, Pharmacology Pathology, Nutrition, Health \u003cbr /\u003eInformation Management, Medical Assisting, Nursing Administration, Nursing Care \u003cbr /\u003ePlans, Medical-Surgical, Womens Health Nursing, Pediatric Nursing, Oncology, \u003cbr /\u003ePsychiatric-Mental Health Nursing, Adult-Gerontological Nursing, Emergency \u003cbr /\u003eNursing Care, Nursing Pathophysiology, Dosage and Calculation of Medication, \u003cbr /\u003eand Advanced Pharmacy Calculations.\u003cbr /\u003e * Health Science: Dental Hygiene and Assisting, Ultrasound (Sonography), \u003cbr /\u003eEmergency Medical Services, Nuclear Medicine, Physical Therapist Assisting, \u003cbr /\u003eRadiation Therapy, Respiratory Care, Radiography, Vision Care, Pharmacy \u003cbr /\u003eTechnician, Paramedic, and more.\u003cbr /\u003eHow It Works\u003cbr /\u003e\u003cbr /\u003eYou can work from your own home or anywhere with an internet connection. Live \u003cbr /\u003etutoring is done through a virtual whiteboard and chat box so no webcam or mic \u003cbr /\u003eis required. For more information on how it works, please visit \u003cbr /\u003ewww.brainfuse.com.\u003cbr /\u003e\u003cbr /\u003eWe are looking to schedule tutors immediately. Scheduling is flexible, and you \u003cbr /\u003echoose your own hours. There are also opportunities for advancement. If \u003cbr /\u003einterested, please reply to this ad with your resume attached and the subject \u003cbr /\u003eline - \"Indeed Applicant - Online Tutor\". Mention which subjects you are \u003cbr /\u003eapplying for.\u003cbr /\u003e\u003cbr /\u003eJob Type: Contract\u003cbr /\u003e\u003cbr /\u003eSalary: $10.00 to $15.00 /hour\u003cbr /\u003e\u003cbr /\u003eRequired education:\u003cbr /\u003e\u003cbr /\u003e * Bachelor\u0027s\u003cbr /\u003e3 days ago",
    "urlFetchPending": false,
    "published": "Feb 4, 2017 12:02:28 AM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/50",
      "TITLE1/data"
    ]
  },
  {
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/job/Online-Tutor-at-Brainfuse-in-Work-at-Home-14d6ee67cbfc7a2d",
    "title": "Online Tutor - Math, Science, and more! (Remote) - Brainfuse - Work at Home",
    "content": "\u003c\u003e Online Tutor - Math, Science, and more! (Remote) \u003cbr /\u003eBrainfuse 15 reviews \u003c\u003e - Work at Home \u003cbr /\u003e$10 - $15 an hour - Contract \u003cbr /\u003e\u003cbr /\u003eWho We Are\u003cbr /\u003e\u003cbr /\u003eBrainfuse (www.brainfuse.com) is a nationally recognized eLearning \u003cbr /\u003ecorporation. Founded in 1999, Brainfuse is one of the nation\u0027s leading online \u003cbr /\u003eeducation providers, serving a diverse client base of libraries, school \u003cbr /\u003edistricts, workforce centers, and universities.\u003cbr /\u003e\u003cbr /\u003eWho We Are Looking For\u003cbr /\u003e\u003cbr /\u003eBrainfuse is hiring tutors in all subjects. Since this is an online tutoring \u003cbr /\u003eposition, applicants will need to have their own computers and a stable \u003cbr /\u003eInternet connection.\u003cbr /\u003e\u003cbr /\u003eSubjects that we are hiring for: \u003cbr /\u003e\u003cbr /\u003e * Science: Biology, Microbiology, Chemistry , Organic Chemistry , Physics , \u003cbr /\u003eEarth, and more.\u003cbr /\u003e * Math: Algebra, Geometry, Trigonometry, Precalculus, Calculus , Statistics , \u003cbr /\u003eand more.\u003cbr /\u003e * Social Studies: History, Government,Canadian Social Studies.\u003cbr /\u003e * Business: Accounting , Economics , and Finance .\u003cbr /\u003e * Computer: Java, JavaScript, Cloud Computing, PHP/MySQL, PERL/CGI, Advanced \u003cbr /\u003eVisual Basic, C++, HTML, Information Technology, A+, Security +, CCNA, CCNA \u003cbr /\u003eSecurity, Linux+, Excel, PowerPoint, and Access.\u003cbr /\u003e * Nursing: Medical Technology, Pharmacology Pathology, Nutrition, Health \u003cbr /\u003eInformation Management, Medical Assisting, Nursing Administration, Nursing Care \u003cbr /\u003ePlans, Medical-Surgical, Womens Health Nursing, Pediatric Nursing, Oncology, \u003cbr /\u003ePsychiatric-Mental Health Nursing, Adult-Gerontological Nursing, Emergency \u003cbr /\u003eNursing Care, Nursing Pathophysiology, Dosage and Calculation of Medication, \u003cbr /\u003eand Advanced Pharmacy Calculations.\u003cbr /\u003e * Health Science: Dental Hygiene and Assisting, Ultrasound (Sonography), \u003cbr /\u003eEmergency Medical Services, Nuclear Medicine, Physical Therapist Assisting, \u003cbr /\u003eRadiation Therapy, Respiratory Care, Radiography, Vision Care, Pharmacy \u003cbr /\u003eTechnician, Paramedic, and more.\u003cbr /\u003eHow It Works\u003cbr /\u003e\u003cbr /\u003eYou can work from your own home or anywhere with an internet connection. Live \u003cbr /\u003etutoring is done through a virtual whiteboard and chat box so no webcam or mic \u003cbr /\u003eis required. For more information on how it works, please visit \u003cbr /\u003ewww.brainfuse.com.\u003cbr /\u003e\u003cbr /\u003eWe are looking to schedule tutors immediately! Scheduling is flexible, and you \u003cbr /\u003echoose your own hours. There are also opportunities for advancement. *If \u003cbr /\u003einterested, please reply to this ad with your resume attached and the subject \u003cbr /\u003eline - \"Indeed Applicant - Online Tutor\". Mention which subjects you are \u003cbr /\u003eapplying for.\u003cbr /\u003e\u003cbr /\u003eJob Type: Contract\u003cbr /\u003e\u003cbr /\u003eSalary: $10.00 to $15.00 /hour\u003cbr /\u003e\u003cbr /\u003eRequired education:\u003cbr /\u003e\u003cbr /\u003e * Bachelor\u0027s\u003cbr /\u003e3 days ago",
    "urlFetchPending": false,
    "published": "Feb 4, 2017 12:00:25 AM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/50",
      "TITLE1/data"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13541885",
    "title": "Apple, Inc. | Cupertino Apple’s Siri is looking for exceptional engineers, designers, and project managers well versed in machine ...",
    "content": "Apple, Inc. | Cupertino\u003cbr /\u003eApple’s Siri is looking for exceptional engineers, designers, and project \u003cbr /\u003emanagers well versed in machine learning, natural language, speech recognition, \u003cbr /\u003eserver automation, and/or mobile software development. Siri is used on \u003cbr /\u003ecountless iOS, tvOS and watchOS devices and handles over a billion requests per \u003cbr /\u003eweek.\u003cbr /\u003e\u003cbr /\u003eIf you’re passionate about media, home automation, automated testing, building \u003cbr /\u003etools, or one of a variety of our open positions, you’ll be right at home!\u003cbr /\u003e\u003cbr /\u003eApply online or send a resume and a feature request to brittanyd@apple.com. \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 6:15:04 PM",
    "tags": [
      "REMOTE1/50",
      "TITLE1/data",
      "REMOTE2/locals-only"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13542165",
    "title": "Cognii | Boston, MA or remote 2016 Innovation of the Year EdTech Winner 2015 Best Learning Assessment Innovation of the Year ...",
    "content": "Cognii | Boston, MA or remote\u003cbr /\u003e2016 Innovation of the Year EdTech Winner\u003cbr /\u003e\u003cbr /\u003e2015 Best Learning Assessment Innovation of the Year\u003cbr /\u003e\u003cbr /\u003e2016-2020 Leading vendor for exponentially growing AI market in education - \u003cbr /\u003eTechnavio\u003cbr /\u003e\u003cbr /\u003eCognii brings the power of Artificial Intelligence technology to Education \u0026 \u003cbr /\u003eTraining market. Join us to participate in our growth, advance your career and \u003cbr /\u003eget rewarded with generous stock options. We are looking for entrepreneurial \u003cbr /\u003ecandidates in the following areas:\u003cbr /\u003e\u003cbr /\u003e1. AI and NLP Research Engineers (Senior, Junior)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e - natural language processing - statistical machine learning - syntactic and \u003cbr /\u003esemantic analysis - linguistically process text corpora - information extraction\u003cbr /\u003e 2. App Developer\u003cbr /\u003e\u003cbr /\u003e - Mobile App development - Front End design  3. System Architect\u003cbr /\u003e\u003cbr /\u003e - Back-end development - Experience with Ruby on Rails based scalable \u003cbr /\u003earchitecture - DevOps and manage the scalable web platform Please send your \u003cbr /\u003eapplication and resume to jobs@cognii.com \u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 6:38:04 PM",
    "tags": [
      "REMOTE1/50",
      "TITLE1/data",
      "REMOTE2/locals-only"
    ]
  }
]
}
