{
  "items": [
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/131747/interactive-designer-ui-designer-alliance-reservations-network?a\u003dIboKrhzdYru",
    "title": "Interactive Designer / UI Designer at Alliance Reservations Network (Phoenix, AZ) (allows remote)",
    "content": "Do not apply if you do not live in the United States. Direct hires only, no \u003cbr /\u003eagencies. Do not apply if you are a programmer who can do some design, we want \u003cbr /\u003esomeone who specializes in interaction design.\u003cbr /\u003e\u003cbr /\u003eOur internet-based technology company based in Phoenix and Orlando is looking \u003cbr /\u003efor a full time U/I and U/X designer with strong CSS/JavaScript skills and an \u003cbr /\u003every strong eye towards modern interactive design to help us create a better \u003cbr /\u003euser experience for our existing application.\u003cbr /\u003e\u003cbr /\u003eQualified candidates must understand and care deeply about the purpose of our \u003cbr /\u003eproprietary application and various types of users that utilize this valuable \u003cbr /\u003etool. Each screen must be designed with the specific user and their needs and \u003cbr /\u003ecapabilities in mind, not in the candidate\u0027s own personal design aptitude. \u003cbr /\u003eCandidates must be able to express a Zen sense of minimalism that considers the \u003cbr /\u003enecessity of every element on a page to determine whether each element directly \u003cbr /\u003econtributes to achieving the goal of the page.\u003cbr /\u003e\u003cbr /\u003eCandidates must push management to simplify the application versus management \u003cbr /\u003epushing them.\u003cbr /\u003e\u003cbr /\u003eCandidates must be able to create usable interfaces for both experienced and \u003cbr /\u003eone-time users and understand their needs are vastly different. Also, \u003cbr /\u003ecandidates must be able to build a U/I a user can use without little of no \u003cbr /\u003einstruction and without confusion. Candidates must want to step-up and take \u003cbr /\u003eownership of the user interface and take pride in its successes and be willing \u003cbr /\u003eto take responsibility for its weaknesses understanding the design will \u003cbr /\u003econstantly evolve and must always improve.\u003cbr /\u003e\u003cbr /\u003eOur company is looking to take our application to the \"next level\" and we want \u003cbr /\u003ea candidate who is self-managed and always pushing for progress without the \u003cbr /\u003eneed for constant supervision. As a leader of the design of this application, \u003cbr /\u003ethe candidate we select will be joining a team with two backend developers and \u003cbr /\u003ea small sales staff. This candidate must be able to balance the requests from \u003cbr /\u003esales with the programmers ability to deliver features and functions that do \u003cbr /\u003enot negatively impact the user experience.\u003cbr /\u003e\u003cbr /\u003eLastly, the ideal candidate should be the kind of person who could name famous \u003cbr /\u003edesigners in your field that you follow or want to emulate rather than the type \u003cbr /\u003ewho lives in a bubble of his own personal design ego. During the interview \u003cbr /\u003eprocess, the candidates should be able to discuss their inspirational leaders \u003cbr /\u003eand discuss what I is about them that impresses you most.\u003cbr /\u003e\u003cbr /\u003eIf you feel you have the requisite skills and experience for the position, and \u003cbr /\u003ehave a portfolio of work you would like to share, please email us\u003cbr /\u003ejobs@allresnet.com \u003cmailto:jobs@allresnet.com\u003e. We will contact you only if \u003cbr /\u003ewe\u0027re interested, make sure your work is easily visible.\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003e * CSS \u003cbr /\u003e * jQuery \u003cbr /\u003e * HTML \u003cbr /\u003e * Javascript \u003cbr /\u003e * Zen like taste for simplicity \u003cbr /\u003e About Alliance Reservations Network \u003cbr /\u003e\u003cbr /\u003eAlliance Reservations Network has been building hotel booking engine \u003cbr /\u003etechnology since our inception. What makes us better is our ability to \u003cbr /\u003econsolidate inventory from around the world, ensuring our partners always have \u003cbr /\u003eaccess to the most comprehensive and competitive rates in the industry.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 10 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? Email  apply now  \u003c\u003e  more jobs at \u003cbr /\u003eAlliance… \u003c\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2/blueprint",
      "REMOTE2/America",
      "TECH2/jquery",
      "TECH2/javascript",
      "TECH2/css",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/134707/ux-designer-bookingcom?a\u003dJaWEMITrdjq",
    "title": "UX Designer at Booking.com (Amsterdam, Netherlands) (allows remote)",
    "content": "Booking.com BV (the company behind Booking.com™, the market leading online \u003cbr /\u003eaccommodation reservation service in the world) is looking for the world’s \u003cbr /\u003esmartest designers. As a member of our Front End team you’ll be given the \u003cbr /\u003efreedom to make meaningful and measurable improvements impacting millions of \u003cbr /\u003epeople. You’ll join us at our beautiful Amsterdam HQ and work with some of our \u003cbr /\u003eindustry’s smartest people.\u003cbr /\u003e\u003cbr /\u003eB.responsible\u003cbr /\u003e\u003cbr /\u003eOur guiding principle is that by helping our users we help our business. As a \u003cbr /\u003edesigner in our Front End team you’ll be a key part of the idea generation \u003cbr /\u003eprocess, working in a small startup-like group which takes full ownership of \u003cbr /\u003etheir part of our platform. You’ll work with developers, product owners, \u003cbr /\u003ecopywriters and user researchers to conceive, analyse, hand code \u0026 test your \u003cbr /\u003eideas.\u003cbr /\u003e\u003cbr /\u003eB.creative\u003cbr /\u003e\u003cbr /\u003e‘Designer’ is just what it says on your CV – you’d be just as happy to be \u003cbr /\u003elabeled an Engineer, or Analyst; a Builder, Hacker or Maker. Because what you \u003cbr /\u003ereally do, what you live for, is solving problems. Your portfolio isn’t a \u003cbr /\u003eseries of beautiful but generic templates – it’s a collection of stories that \u003cbr /\u003eyou can discuss with enthusiasm, and regret … because you’re always getting \u003cbr /\u003ebetter at what you do and you’re never satisfied with ‘good enough.’. You’re \u003cbr /\u003eequally comfortable discussing colour theory, user psychology, or the semantic \u003cbr /\u003eimplications of the DIV tag, you’re a writer of excellent HTML \u0026 CSS. You’re \u003cbr /\u003eexcited about the endless potential of the web, and being able to build things \u003cbr /\u003ethat millions of people can use every day.\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eB.skilled\u003cbr /\u003e\u003cbr /\u003eYour core responsibility will be in combining your knowledge and expertise \u003cbr /\u003ewith the goals of our business to deliver a world-class user experience to our \u003cbr /\u003ediverse, loyal user-base. You’ll be comfortable taking a data-led approach to \u003cbr /\u003edesign. You will be a passionate advocate for the user, dedicated to the craft \u003cbr /\u003eof design and excited about working in an agile, collaborative environment.\u003cbr /\u003e\u003cbr /\u003e * Experience: You have at least two years of relevant experience \u003cbr /\u003e * Simplicity: Good design is invisible. \u003cbr /\u003e * Collaboration: You’ll be working alongside developers and copywriters to \u003cbr /\u003ecreate elegant user experiences; you should thrive on feedback, critique and \u003cbr /\u003eiteration. \u003cbr /\u003e * Visual Design: Photoshop, Fireworks, Keynote, MS Paint – whatever works for \u003cbr /\u003eyou. Your process is your own; you get to decide which tools you use. \u003cbr /\u003e * HTML/CSS: You’ll be given full ownership of your ideas, and so you’ll be \u003cbr /\u003erequired to both create beautiful mockups/wireframes/prototypes – and implement \u003cbr /\u003ethem. \u003cbr /\u003e * Data: You are a successful Designer, but you like to measure your success \u003cbr /\u003ewith data and learn from it every day \u003cbr /\u003e * E-Commerce: You understand the challenges and the opportunities that a \u003cbr /\u003elarge e-commerce website has to offer \u003cbr /\u003e * You’re excited to learn how to work with our templating and version control \u003cbr /\u003esystems. \u003cbr /\u003e About Booking.com \u003cbr /\u003e\u003cbr /\u003eB.offered\u003cbr /\u003e\u003cbr /\u003eThis position is open to worldwide candidates and in the case of relocation, \u003cbr /\u003ewe will assist you with a generous relocation package, ensuring a smooth \u003cbr /\u003etransition to working and living in Amsterdam.  We have successfully relocated \u003cbr /\u003e300+ Technology professionals to Amsterdam in the last year!\u003cbr /\u003e\u003cbr /\u003eThe hiring company Booking.com BV is the company behind Booking.com™, the \u003cbr /\u003emarket leading online accommodation reservation service in the world. \u003cbr /\u003eBooking.com BV is looking for a Sr. UX Designer (HTML/CSS) in Amsterdam, the \u003cbr /\u003eNetherlands. All references to “Booking.com\" refer to Booking.com BV.\u003cbr /\u003eExternal URL  apply now  \u003chttp://grnh.se/2mwqj81\u003e  more jobs at Booking.com  \u003c\u003e\u003cbr /\u003eJoin us at Booking.com\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003e26 Vacation Days + Hotel Discounts Freedom in your development environment \u003cbr /\u003eMedical/Dental Insurance Discounts Gym Membership Discount Daily Catered Lunch \u003cbr /\u003eFlex Time Commuting Costs Coffeebar with Amazing Amsterdam views! Freaky \u003cbr /\u003eFridays! (Monthly Happy Hours) Salary + Bonus and Stock Potential \u003cbr /\u003eLearn more about Booking.com \u003c\u003e more jobs at Booking.com \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/booking-com?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "REMOTE2/America",
      "TECH2/html",
      "TECH2/css",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28791?r\u003drss2",
    "title": "Ad Hoc: Designer",
    "content": "Full-time\u003cbr /\u003e\u003cbr /\u003e(Anywhere) \u003cbr /\u003e\u003cbr /\u003eWe are looking for designers with experience in creating well-crafted user \u003cbr /\u003eexperiences. You will work with our team of researchers, developers, and \u003cbr /\u003esoftware engineers to build software that is usable and accessible for the \u003cbr /\u003ewidest possible audience.\u003cbr /\u003e\u003cbr /\u003eYou will work with a small team to design, develop, and deliver web-based \u003cbr /\u003eapplications and services. You\u0027ll work with our government partners to better \u003cbr /\u003eunderstand and translate policy and business requirements into good design. \u003cbr /\u003eYour work will impact the lives of millions of Americans.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Feb 6, 2017 9:39:18 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28684?r\u003drss2",
    "title": "Chromatic: Front-end Designer / Developer",
    "content": "Full-time\u003cbr /\u003e\u003cbr /\u003e(Anywhere) \u003cbr /\u003e\u003cbr /\u003eChromatic in a Nutshell\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eChromatic is a world-class digital agency focused on web design, development, \u003cbr /\u003eprocess, and training. We have over 10 years experience helping some of the \u003cbr /\u003eweb\u0027s biggest brands solve their content problems using Drupal and other open \u003cbr /\u003esource technologies. Our team is completely distributed, and while we may be \u003cbr /\u003espread across the globe, our culture keeps us close together.\u003cbr /\u003e\u003cbr /\u003eRole Summary\u003cbr /\u003e\u003cbr /\u003eChromatic is looking for an outgoing and motivated front-end \u003cbr /\u003edesigner/developer with strong communication skills who would be energized to \u003cbr /\u003ework with a talented and strongly bound team.\u003cbr /\u003e\u003cbr /\u003eResponsibilities\u003cbr /\u003e\u003cbr /\u003e * Work closely with clients to deliver exceptional designs, code, consulting, \u003cbr /\u003eand advice.\u003cbr /\u003e * Participate in and contribute to peer design/code reviews and project \u003cbr /\u003estand-ups.\u003cbr /\u003e * Evangelize design/development best practices to Chromatic’s clients and the \u003cbr /\u003ecommunity.\u003cbr /\u003e * Engage with the open-source community via code contributions, projects, \u003cbr /\u003epresentations, blog posts, etc.\u003cbr /\u003eWhat We Are Looking For\u003cbr /\u003e\u003cbr /\u003eExperience with the following is required:\u003cbr /\u003e\u003cbr /\u003e * Proficient in designing and delivering assets via HTML/CSS.\u003cbr /\u003e * Strong proficiency in core front-end development technologies (HTML5, CSS3, \u003cbr /\u003eJavaScript/jQuery).\u003cbr /\u003e * CSS preprocessors.\u003cbr /\u003e * Task runners.\u003cbr /\u003e * Web content management systems.\u003cbr /\u003e * Developing responsive web and/or mobile applications.\u003cbr /\u003e * Creation of and adherence to best practices.\u003cbr /\u003eExperience with the following is a plus:\u003cbr /\u003e\u003cbr /\u003e * ES6.\u003cbr /\u003e * HTML5 APIs.\u003cbr /\u003e * Object-oriented patterns.\u003cbr /\u003e * Drupal theming.\u003cbr /\u003e * Agile project management methodologies.\u003cbr /\u003e * Git and GitHub pull request/code review workflows.\u003cbr /\u003e * Designing, developing and maintaining front-end component libraries or \u003cbr /\u003estyle guides.\u003cbr /\u003eSome Other Important Traits\u003cbr /\u003e\u003cbr /\u003e * Chromatic is a distributed team, so strong communication skills, both \u003cbr /\u003everbal and written, are of the utmost importance.\u003cbr /\u003e * The ability to brainstorm ideas, do research, remain current with industry \u003cbr /\u003etrends and best practices.\u003cbr /\u003e * Enthusiasm, personality, teamwork and a positive attitude count \u003cbr /\u003etremendously.\u003cbr /\u003eWhat sets Chromatic apart from a typical job?\u003cbr /\u003e\u003cbr /\u003e * Work from wherever you want, whenever you want - Our office is completely \u003cbr /\u003edistributed, you may work from wherever is most effective for you. We encourage \u003cbr /\u003eour team members to work when it is convenient for them, when they’ll do their \u003cbr /\u003ebest work.\u003cbr /\u003e * Reasonable Bookings - We book our team members with a max of 30-35 hours \u003cbr /\u003eper week for project work. We believe more than that is asking too much. The \u003cbr /\u003eother 5-10 hours is reserved for team meetings, community contribution, and \u003cbr /\u003eprofessional/skill development.\u003cbr /\u003e * Vacation - Chromatic does not set rigid vacation limits. We encourage our \u003cbr /\u003epeople to take vacation when they want/need it. So long as it doesn’t interfere \u003cbr /\u003ewith existing contracts or compromise project deadlines, we’re all for it.\u003cbr /\u003e * Health Insurance - Chromatic provides competitive medical/dental/vision \u003cbr /\u003einsurance.\u003cbr /\u003e * 401(k) - Chromatic provides employees a 401k plan along with a 3% employer \u003cbr /\u003econtribution.\u003cbr /\u003e * Disability Insurance - Chromatic provides both short and long term \u003cbr /\u003edisability insurance.\u003cbr /\u003e * Life Insurance - All employees are provided with a term life insurance \u003cbr /\u003epolicy.\u003cbr /\u003e * Hardware - Chromatic is primarily an Apple-based company, but we allow our \u003cbr /\u003eteam members to choose their own hardware and we ensure everyone has up-to-date \u003cbr /\u003eequipment and software.\u003cbr /\u003e * Exciting Projects - Chromatic consistently participates in projects with \u003cbr /\u003eexciting, high-profile brands and some of the most highly trafficked sites on \u003cbr /\u003ethe web; some of which include Martha Stewart, NBC / MSNBC, Shape, Parents, \u003cbr /\u003eCasper, State Farm, Emeril Brands, Adobe.\u003cbr /\u003e * Conferences - Chromatic frequently sends team members to attend and speak \u003cbr /\u003eat industry conferences, including Drupalcon.\u003cbr /\u003e * Company Retreat - Once a year, we gather the entire company to spend \u003cbr /\u003equality time together away from our desks.\u003cbr /\u003e * Spotify Subscription - Music is important to us; we provide for a Spotify \u003cbr /\u003esubscription (or equivalent) for all of our employees.\u003cbr /\u003e * Drupalize.me Membership - Want to spend your extra hours improving your \u003cbr /\u003eDrupal skills? We have a Drupalize.me membership at the ready.\u003cbr /\u003e * UrbanSitter Membership - For our team members with child care needs.\u003cbr /\u003e * Workflow - We firmly believe in a strong, consistent deployment workflow. \u003cbr /\u003eWe insist on proper code reviews on all of our projects. This not only ensures \u003cbr /\u003eour code quality but more so, makes us better developers.\u003cbr /\u003e * Team \u0026 Culture - We work and support each other as a team. We make an \u003cbr /\u003eeffort to get together numerous times per year and support each other \u003cbr /\u003epersonally and professionally at every opportunity.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Jan 20, 2017 2:04:47 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28673?r\u003drss2",
    "title": "Craft \u0026 Communicate: Freelance Designer",
    "content": "Freelance\u003cbr /\u003e\u003cbr /\u003e(Remote) \u003cbr /\u003e\u003cbr /\u003eCraft \u0026 Communicate is a small print and digital agency that values \u003cbr /\u003ecraftsmanship over volume. We are seeking a junior level designer to assist \u003cbr /\u003ewith logo, web and collateral design for new and future clients. This is a \u003cbr /\u003efreelance remote position, that will be roughly 5-8 hours a week, which will \u003cbr /\u003ework with our lead designer as well as our ownership in creating custom print \u003cbr /\u003eand web designs.\u003cbr /\u003e\u003cbr /\u003ePlease briefly answer the following questions.\u003cbr /\u003e\u003cbr /\u003e * Experience \u003cbr /\u003e * Most productive time of day \u003cbr /\u003e * Hourly rate \u003cbr /\u003e * List a designer and an artist that have influenced you. \u003cbr /\u003e * What is a typical design cycle like for you? \u003cbr /\u003e * Briefly describe your work environment like (software, hardware, grids, \u003cbr /\u003eplugins, paint, brushes, etc) \u003cbr /\u003e * From 1-5 (5 being the highest) what is your level of proficiency in \u003cbr /\u003e * Photoshop \u003cbr /\u003e * Illustrator \u003cbr /\u003e * Indesign \u003cbr /\u003e * Other (please list) \u003cbr /\u003e * What medium do you feel most comfortable in, print or digital? \u003cbr /\u003e * Do you enjoy creating logos and the process behind it? If so, please list a \u003cbr /\u003ecouple examples and explain your process. \u003cbr /\u003e * What do you do for fun? \u003cbr /\u003e * Wine, Beer, Coffee and/or Tea?\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Jan 19, 2017 5:20:14 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28624?r\u003drss2",
    "title": "kohactive: Interaction Designer",
    "content": "Full-time\u003cbr /\u003e\u003cbr /\u003e(Chicago, IL) \u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for an experienced designer to join our growing team. As a \u003cbr /\u003edesigner at kohactive, you\u0027ll work with a small team to turn a client\u0027s idea \u003cbr /\u003einto web and mobile products. Working with developers, you\u0027ll be responsible \u003cbr /\u003efor leading the user experience and visual design of the project.\u003cbr /\u003e\u003cbr /\u003eRequirements\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for somebody that is fully capable of creating great visual \u003cbr /\u003edesigns for products. You\u0027ll need to be able to work with clients to understand \u003cbr /\u003etheir needs and propose solutions. You\u0027ll be responsible for product design and \u003cbr /\u003euser experience, and then implementing the designs with HTML and CSS \u003cbr /\u003e(Sass/Scss).\u003cbr /\u003e\u003cbr /\u003eVery well-qualified candidates will also have experience with consulting, and \u003cbr /\u003ehave a proven track record of attracting potential customers.\u003cbr /\u003e\u003cbr /\u003eAll persons hired will be required to verify identity and eligibility to work \u003cbr /\u003ein the United States and to complete the required employment eligibility \u003cbr /\u003everification upon hire.\u003cbr /\u003e\u003cbr /\u003eBenefits\u003cbr /\u003e\u003cbr /\u003eWe enjoy working. We have plenty of vacation time and a fun and casual work \u003cbr /\u003eenvironment. If you\u0027re in Chicago then we have a fully stocked fridge and some \u003cbr /\u003ecomfy spots to work. If you need a change of scenery, you can work from home.\u003cbr /\u003e\u003cbr /\u003eThis is a full-time position with a competitive salary, paid time off, private \u003cbr /\u003ehealth insurance and a 401k coming in 2017.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWe also enjoy learning. We have lunch and learns and encourage everybody to \u003cbr /\u003eshare articles, new technologies and their knowledge.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eJob Perks: - 100% cover of health and dental insurance - 4 weeks of PTO - \u003cbr /\u003eUnlimited sick and personal days - Stocked fridge - Monthly team outings\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Jan 11, 2017 11:32:35 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28615?r\u003drss2",
    "title": "Hotjar: Product Designer (Europe)",
    "content": "Full-time\u003cbr /\u003e\u003cbr /\u003e(Europe) \u003cbr /\u003e\u003cbr /\u003eWe are looking for an ambitious and driven product designer who is passionate \u003cbr /\u003eabout creating engaging, consistent and memorable experiences. Hotjar is a \u003cbr /\u003erapidly growing startup that is giving thousands of website owners the tools \u003cbr /\u003eneeded to discover how their visitors are really using their website. In this \u003cbr /\u003erole you will be iteratively improving the Hotjar user experience and helping \u003cbr /\u003eus shape the product and company whilst growing with us.\u003cbr /\u003e\u003cbr /\u003eThis is an excellent remote career opportunity to join a fast growing startup \u003cbr /\u003ein a key position and make a difference in the UX community and industry.\u003cbr /\u003e\u003cbr /\u003eAs a Product Designer, you will:\u003cbr /\u003e\u003cbr /\u003e * Create thoughtful and appropriate solutions to design challenges of all \u003cbr /\u003esizes by translating research insights into beautiful and engaging user \u003cbr /\u003einterfaces which satisfy user needs, business requirements and technical \u003cbr /\u003econstraints.\u003cbr /\u003e * Work in one of our multi­disciplinary product teams and collaborate with \u003cbr /\u003eour Director of Design, stakeholders and engineers in an iterative, transparent \u003cbr /\u003eand feedback driven process.\u003cbr /\u003e * Produce engaging experiences using sketches, storyboards, information \u003cbr /\u003earchitecture blueprints and prototypes to collect feedback and iteratively \u003cbr /\u003eimprove and support the design process.\u003cbr /\u003e * Translate wireframes and experiences into highly-polished visual composites \u003cbr /\u003ewith attention to interaction design whilst following style and brand \u003cbr /\u003eguidelines.\u003cbr /\u003eRequirements\u003cbr /\u003e\u003cbr /\u003e * A minimum of 3 years experience designing experiences for interfaces and \u003cbr /\u003edigital SaaS products.\u003cbr /\u003e * Experience designing experiences for desktops, tablets and phones.\u003cbr /\u003e * Demonstrated ability creating deliverables in the research, user experience \u003cbr /\u003eand visual design stages on the design process.\u003cbr /\u003e * A passion for detail and a care for great usability and aesthetics.\u003cbr /\u003e * Ability to prototype ideas quickly and iterate as many times as needed.\u003cbr /\u003e * Excellent self-starter who always thinks MVP first with the ability to work \u003cbr /\u003ein a small, startup-style, agile and fast-paced team.\u003cbr /\u003e * Fluent in English with excellent written and verbal communication skills.\u003cbr /\u003e * Confident in your work without becoming too attached to your designs when \u003cbr /\u003econstructive team and user feedback is put forward.\u003cbr /\u003e * A strong portfolio featuring relevant work examples.\u003cbr /\u003e * Must submit to a background check confidentially processed by our third \u003cbr /\u003eparty.\u003cbr /\u003e * Assets: Experience using Sketch, HTML / CSS / JS development, experience \u003cbr /\u003eworking embedded in a team of developers, experience working remotely.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Jan 10, 2017 6:51:11 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28614?r\u003drss2",
    "title": "Hotjar: User Interface Designer (Europe)",
    "content": "Full-time\u003cbr /\u003e\u003cbr /\u003e(Europe) \u003cbr /\u003e\u003cbr /\u003eWe are looking for an ambitious and driven user interface designer who is \u003cbr /\u003epassionate about creating engaging, consistent and memorable experiences. \u003cbr /\u003eHotjar is a rapidly growing startup that is giving thousands of website owners \u003cbr /\u003ethe tools needed to discover how their visitors are really using their website. \u003cbr /\u003eIn this role you will be iteratively improving the Hotjar user experience and \u003cbr /\u003ehelping us shape the product and company whilst growing with us.\u003cbr /\u003e\u003cbr /\u003eThis is an excellent remote career opportunity to join a fast growing startup \u003cbr /\u003ein a key position and make a difference in the design community and industry.\u003cbr /\u003e\u003cbr /\u003eAs a User Interface Designer, you will:\u003cbr /\u003e\u003cbr /\u003e * Create thoughtful and appropriate solutions to design challenges of all \u003cbr /\u003esizes as you design and build beautiful and engaging user interfaces according \u003cbr /\u003eto user needs, business requirements and technical constraints.\u003cbr /\u003e * Work in one of our multi­disciplinary product teams and collaborate with \u003cbr /\u003eour Director of Design, stakeholders, engineers and other designers in an \u003cbr /\u003eiterative, transparent and feedback driven process.\u003cbr /\u003e * Translate wireframes and experiences into highly-polished visual composites \u003cbr /\u003ewith a user-centered design methodology.\u003cbr /\u003e * Build browser-tested user interfaces using HTML, CSS and basic JavaScript \u003cbr /\u003ewhilst following best practices and Hotjar’s code, style and brand guidelines.\u003cbr /\u003eRequirements\u003cbr /\u003e\u003cbr /\u003e * A minimum of 3 years experience designing and building interfaces and \u003cbr /\u003edigital SaaS products.\u003cbr /\u003e * Experience designing interfaces for desktops, tablets and phones.\u003cbr /\u003e * Experience in front-end development (HTML, CSS, basic JavaScript).\u003cbr /\u003e * Demonstrated ability creating deliverables in the visual design and \u003cbr /\u003ebuilding stages.\u003cbr /\u003e * A passion for detail and a care for great usability and aesthetics.\u003cbr /\u003e * Excellent self-starter who always thinks MVP first with the ability to work \u003cbr /\u003ein a small, startup-style, agile and fast-paced team.\u003cbr /\u003e * Fluent in English with excellent written and verbal communication skills.\u003cbr /\u003e * Confident in your work without becoming too attached to your designs when \u003cbr /\u003econstructive team and user feedback is put forward.\u003cbr /\u003e * A strong portfolio featuring relevant work examples.\u003cbr /\u003e * Must submit to a background check confidentially processed by our third \u003cbr /\u003eparty.\u003cbr /\u003e * Assets: Experience in UX research, wireframing and prototyping, experience \u003cbr /\u003eworking embedded in a team of developers, experience working remotely.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Jan 10, 2017 6:51:11 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28532?r\u003drss2",
    "title": "Help Scout: Designer",
    "content": "Full-time\u003cbr /\u003e\u003cbr /\u003e(anywhere) \u003cbr /\u003e\u003cbr /\u003eDesigners at Help Scout are responsible for the brand, and for creating an \u003cbr /\u003eexceptional product experience. Everything customer-facing passes through the \u003cbr /\u003edesign team in some way. You’ll be making things that are seen and/or used by \u003cbr /\u003eseveral hundred thousand people every month.\u003cbr /\u003e\u003cbr /\u003eAbout the role\u003cbr /\u003e\u003cbr /\u003e * You\u0027ll be part of our 5-person design team, and you’ll report to Jared, one \u003cbr /\u003eof Help Scout’s co-founders. Each designer brings a unique set of skills to the \u003cbr /\u003egroup and makes their colleagues better.\u003cbr /\u003e * You’ll be working on our website, which sees just under half a million \u003cbr /\u003eunique visitors every month. In addition to designing, coding and deploying new \u003cbr /\u003ework for the site, you’ll help us push into new formats: video, podcast, new \u003cbr /\u003emedia and other experiments. We’ll look to you to raise the creative bar on \u003cbr /\u003ethese efforts.\u003cbr /\u003e * You\u0027ll be working in a design-led company, with people that give you the \u003cbr /\u003etime to do excellent work. But we also hold you to high standards, which means \u003cbr /\u003eyou must be incredibly persistent, open to feedback/debate and always willing \u003cbr /\u003eto experiment with new ideas.\u003cbr /\u003eWho you\u0027ll work with\u003cbr /\u003e\u003cbr /\u003e * Jared McDaniel, Co-founder \u0026 Designer - Jared brings a great deal of \u003cbr /\u003eknowledge and experience to our brand, our products, and our marketing site.\u003cbr /\u003e * Stephen Murrill, Illustrator \u0026 Visual Designer - Stephen’s expertise and \u003cbr /\u003evision helps guide our brand, ensuring that Help Scout is presented \u003cbr /\u003econsistently and beautifully across-the-board.\u003cbr /\u003e * Eli Overbey, Growth Engineer - Eli manages our paid channels, SEO, and data \u003cbr /\u003eanalytics. In addition, you’ll work with him to continually improve our \u003cbr /\u003epre-signup user experience.\u003cbr /\u003e * Nadia Basil, Head of Product Marketing - Nadia is a master of words. You’ll \u003cbr /\u003ework with her to craft every last word on our marketing pages, and within the \u003cbr /\u003eproduct.\u003cbr /\u003eREQUIREMENTS\u003cbr /\u003e\u003cbr /\u003eAbout you\u003cbr /\u003e\u003cbr /\u003e * You love shipping new things. Working alongside our Growth team means \u003cbr /\u003eyou’ll be moving quickly on a number of projects and experiments. Once we know \u003cbr /\u003ehow an experiment plays out, there’s time to polish and improve your work.\u003cbr /\u003e * You can write beautiful html and css, and have a good sense for interaction \u003cbr /\u003edesign principles. Javascript skills are a bonus, but not required to be \u003cbr /\u003esuccessful in this position.\u003cbr /\u003e * Most of your creative work starts in Sketch or Photoshop. Visual design is \u003cbr /\u003ea skill that you’re passionate about.\u003cbr /\u003e * You never stop working on your craft. When looking at your work over the \u003cbr /\u003eyears, it\u0027s clear you\u0027ve never stopped improving.\u003cbr /\u003e * You are a great communicator. You have no trouble keeping your teammates in \u003cbr /\u003ethe loop and getting work done in the time allotted for it.\u003cbr /\u003eAbout us\u003cbr /\u003e\u003cbr /\u003e * Help Scout is a remote team with employees in eleven countries (eight \u003cbr /\u003epeople in the Boston office). We optimize for excellence over geography and \u003cbr /\u003eovercome remote challenges through transparency, trust, chat and video \u003cbr /\u003econferencing.\u003cbr /\u003e * We’re a customer-driven company and always will be. Everything follows the \u003cbr /\u003ecustomer experience, no exceptions.\u003cbr /\u003e * Our company is growing and has aspirations of helping millions of people \u003cbr /\u003earound the world. Accomplishing our goals will present countless challenges and \u003cbr /\u003erequire you to excel in every aspect of the position. It’s hard work, but the \u003cbr /\u003epeople we’re looking for love exploring and solving hard problems.\u003cbr /\u003e * This is not the typical startup “rocket ship.” We’ll never compromise \u003cbr /\u003ecustomers or the experience in favor of growth. Our purpose is to build a \u003cbr /\u003eprofitable company that small businesses love and sustain it. We optimize your \u003cbr /\u003ecareer at Help Scout for the long term as well, so keeping a healthy work/life \u003cbr /\u003ebalance is an important priority.\u003cbr /\u003e * We are an equal opportunity employer and value diversity at our company. We \u003cbr /\u003edo not discriminate on the basis of race, religion, color, national origin, \u003cbr /\u003egender, gender identity or expression, sexual orientation, age, marital status, \u003cbr /\u003eveteran status, or disability status.\u003cbr /\u003eBENEFITS\u003cbr /\u003e\u003cbr /\u003e * Competitive Salary - We pay at or above market salary in most cases and \u003cbr /\u003eevaluate a lot of research to make sure everyone is paid well. The formula we \u003cbr /\u003euse to calculate all salaries is public to employees and is improved upon \u003cbr /\u003eregularly.\u003cbr /\u003e * Work anywhere - Work from our office in Boston or anywhere else, provided \u003cbr /\u003eyou have 4 hours of overlap with the team. We’ll even buy your home office \u003cbr /\u003efurniture or help you pay for a co-working space.\u003cbr /\u003e * Health and dental insurance - We cover you and your family\u0027s health/dental \u003cbr /\u003einsurance 100%. If you are based in the US, we\u0027ll cover you on our Harvard \u003cbr /\u003ePilgrim HMO or PPO policies.\u003cbr /\u003e * Long-term/Short-term Disability Insurance \u0026 Life Insurance - we cover 100% \u003cbr /\u003eof the premiums for LT/ST Disability insurance and base Life Insurance. You \u003cbr /\u003ealso have the option to purchase supplementary life insurance through our \u003cbr /\u003eprovider.\u003cbr /\u003e * International Benefit Stipend - If you’re based outside the US, you’ll \u003cbr /\u003ereceive a monthly stipend that goes towards covering medical insurance, long \u003cbr /\u003eand short-term disability, and accountant costs.\u003cbr /\u003e * Flexible vacation - Take time off when you need it, we trust you.\u003cbr /\u003e * Paid parental leave, including adoption - 12 weeks if you have or adopt a \u003cbr /\u003ebaby, 4 weeks if your partner has a baby.\u003cbr /\u003e * 401k with 1% match- 1% Retirement Plan matching for both US and \u003cbr /\u003eInternational Employees\u003cbr /\u003e * Personal development stipend - Up to $1,800 per year to improve your craft\u003cbr /\u003e * Great tools - Each employee receives a Mac laptop and 27\u0027\u0027 display (or \u003cbr /\u003eequivalent). We’ll also purchase any of the software or hardware you need as \u003cbr /\u003ewell as high-end furniture to get your home office started\u003cbr /\u003e * Complete transparency - Everyone has full access to business metrics and \u003cbr /\u003efinancial information about the company.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Dec 22, 2016 6:58:40 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "smashingmagazine.com",
    "url": "http://jobs.smashingmagazine.com/j/Web-Designer-Developer/2434083",
    "title": "Web Designer / Developer - Gardner Design - (Wichita, KS) - FullTime",
    "content": "Web Designer / Developer\u003cbr /\u003e\u003cbr /\u003e *  Gardner Design  \u003c\u003e (Wichita, KS) \u003cbr /\u003e * Oct 10, 2016 \u003cbr /\u003e *  Fulltime Job \u003cbr /\u003e * Tweet \u003chttps://twitter.com/share\u003e \u003cbr /\u003eGardner Design is looking for an interactive developer that has a strong eye \u003cbr /\u003efor and love of great design. If you thrive in collaborative settings, but also \u003cbr /\u003eare self-motivated and have success managing your own projects, we want to talk \u003cbr /\u003eto you!\u003cbr /\u003e\u003cbr /\u003eSpecifically, we’re looking for an individual with the following talents and \u003cbr /\u003eskills:\u003cbr /\u003e\u003cbr /\u003e— Able to develop high-level websites, apps, content management systems, HTML \u003cbr /\u003eemails and more utilizing HTML5/HTML, CSS3/CSS, JavaScript, WordPress, PHP and \u003cbr /\u003eMySQL\u003cbr /\u003e\u003cbr /\u003e— Proficient in using design programs, as well as converting existing designs \u003cbr /\u003eto be web-ready\u003cbr /\u003e\u003cbr /\u003e— Must be proficient in responsive web design\u003cbr /\u003e\u003cbr /\u003e— Build information architectures and wireframes\u003cbr /\u003e\u003cbr /\u003e— Experience in branding preferred\u003cbr /\u003e\u003cbr /\u003e— Contribute to the enhancement of branding and marketing plans with \u003cbr /\u003einteractive elements\u003cbr /\u003e\u003cbr /\u003e— Comfortable presenting to clients\u003cbr /\u003e\u003cbr /\u003e—Able to anticipate interactive needs and make recommendations based on goals \u003cbr /\u003eand industry trends\u003cbr /\u003e\u003cbr /\u003e— A bachelor’s degree and at least three years of related experienced \u003cbr /\u003epreferred.\u003cbr /\u003e\u003cbr /\u003eThis is a full-time position. Salary is commensurate with experience and \u003cbr /\u003eduties. Benefits include health and dental, 401k, and paid time away.\u003cbr /\u003e\u003cbr /\u003eHow to apply\u003cbr /\u003e Visit http://gardnerdesign.com/job/interactive-developer/ \u003cbr /\u003e\u003chttp://gardnerdesign.com/job/interactive-developer/\u003e to learn more and apply.",
    "urlFetchPending": false,
    "published": "Oct 10, 2016 6:22:21 PM",
    "tags": [
      "TECH2/Programming",
      "REMOTE2/locals-only",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "wfh.io-design",
    "url": "https://www.wfh.io/jobs/3451-lead-graphic-designer-bonfire",
    "title": "Lead Graphic Designer",
    "content": "Bonfire is transforming the way people buy and sell high-quality custom \u003cbr /\u003eshirts. As a leading custom apparel platform, we’ve helped thousands of people \u003cbr /\u003eand organizations raise millions of dollars by selling their own custom shirts \u003cbr /\u003e– and we’re just getting started.\u003cbr /\u003e\u003cbr /\u003eDo you walk the line between graphic design and illustration? Are you \u003cbr /\u003econstantly filling up Moleskins with drafts of new ideas? Have you checked \u003cbr /\u003eInstagram and Dribbble today? Do you love typography – both digital and hand \u003cbr /\u003edrawn? We\u0027re hiring an experienced, creative Lead Graphic Designer to develop \u003cbr /\u003eand manage t-shirt designs, illustrations and brand creatives.\u003cbr /\u003e\u003cbr /\u003eWhat you\u0027ll be doing:\u003cbr /\u003e\u003cbr /\u003eThe Lead Graphic Designer will be using their creative design skills to make \u003cbr /\u003eoriginal graphics that reflect the design aesthetic of our seller’s brands and \u003cbr /\u003ecauses. This designer will be responsible for forecasting trends in typography \u003cbr /\u003e\u0026 illustration styles and interpreting this information through to Bonfire’s \u003cbr /\u003ecommunity of sellers, specifically owning t-shirt design development from \u003cbr /\u003einitial concept through our production phases.\u003cbr /\u003e\u003cbr /\u003eHow you\u0027ll make a difference:\u003cbr /\u003e\u003cbr /\u003e * Create apparel graphics from conception through final production-ready art \u003cbr /\u003e * Act as internal champion of the full design cycle of t-shirt designs and \u003cbr /\u003eevergreen art templates \u003cbr /\u003e * Communicate a clear design point of view for Bonfire t-shirt designs based \u003cbr /\u003eon consumer insights, competitive analysis, and marketplace trends \u003cbr /\u003e * Meet with account managers or clients to determine the scope of a project \u003cbr /\u003e * Collaborate with Marketing to develop and execute seasonal deliverables \u003cbr /\u003e * Create designs to meet or exceed funding needs for client \u003cbr /\u003e * Create and maintain all art files and transfer information to cross \u003cbr /\u003efunctional teams \u003cbr /\u003e * Present the design to account managers or design leads and make necessary \u003cbr /\u003echanges to design based on feedback \u003cbr /\u003e * Advise clients on strategies to reach a particular audience \u003cbr /\u003e * Inspire and motivate graphics team and maintain accountability for quality \u003cbr /\u003eof work \u003cbr /\u003e * Build and sustain effective partnerships with operations, product teams to \u003cbr /\u003ekeep team informed of development status, graphic techniques, and applications \u003cbr /\u003ebeing used \u003cbr /\u003e * Exhibit the ability to manage multiple and competing work priorities, \u003cbr /\u003edemands, and changes \u003cbr /\u003e * Manage timely approvals and meet deadlines \u003cbr /\u003eWhat we\u0027re looking for:\u003cbr /\u003e\u003cbr /\u003e * 3-5 years of progressive graphic design experience; may be substituted for \u003cbr /\u003eproven skills based on examples \u003cbr /\u003e * Illustration skills required \u003cbr /\u003e * Expert knowledge in Illustrator, InDesign, and Photoshop/Sketch \u003cbr /\u003e * Stunning design portfolio \u003cbr /\u003e * Excellent verbal, written communication and interpersonal skills \u003cbr /\u003e * Keen attention to detail in planning, organization and execution of tasks, \u003cbr /\u003ewhile still seeing the big picture — even in a fast-paced environment \u003cbr /\u003e * Passion in cause and community activities a plus – or the ability to \u003cbr /\u003eempathize with our community \u003cbr /\u003e * Welcome and live the Bonfire values \u003cbr /\u003eWow factor:\u003cbr /\u003e\u003cbr /\u003e * Photography and video direction experience \u003cbr /\u003e * Degree in graphic design or a related field \u003cbr /\u003eYou’re in good company (with a good company). We offer:\u003cbr /\u003e\u003cbr /\u003e * Competitive compensation with excellent insurance benefits \u003cbr /\u003e * Unlimited paid vacation \u003cbr /\u003e * Remote position - work from anywhere \u003cbr /\u003e * An amazing workplace culture \u003cbr /\u003e * An environment to grow your skills, learn new technologies and tools, and \u003cbr /\u003eto challenge yourself (and have a lot of fun) \u003cbr /\u003e * The chance to make a real impact in the company’s growth and history \u003cbr /\u003e * An opportunity to help make a difference in thousands of people’s lives \u003cbr /\u003eMore about Bonfire:\u003cbr /\u003e\u003cbr /\u003eBonfire is a team of passionate people working to make a difference by \u003cbr /\u003ebuilding strong creative community to enable brands, causes, and individuals to \u003cbr /\u003eraise awareness and grow their business. We have a shared focused on our \u003cbr /\u003emission to strengthen and inspire communities. Through art, technology, \u003cbr /\u003eauthenticity and human connection, we obsess over delivering the best way to \u003cbr /\u003esell custom apparel on the planet. We are committed to making great products, \u003cbr /\u003ecreating incredible e-commerce experiences, and having fun in the process. Be a \u003cbr /\u003epart of Bonfire!",
    "urlFetchPending": false,
    "published": "Jan 13, 2017 6:41:43 AM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "remoteok.io-dev",
    "url": "https://remoteok.io/jobs/21088",
    "title": "Front end Drupal Developer Designer Extraordinaire",
    "content": "Here’s the corporate dribble HR made us put at the top of this ad listing: \u003cbr /\u003eAcro Media is looking for a Front-end Drupal Developer \u0026 Designer to build our \u003cbr /\u003ecorporate website \u0026 help develop our marketing initiatives. This is a full time \u003cbr /\u003eremote position.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThat’s done. Now here’s what we really want. We need a Front-End Drupal \u003cbr /\u003eDeveloper \u0026 Designer willing to bleed Acro Media orange. Acro Media is growing \u003cbr /\u003efast and our position in the Drupal community and Ecommerce marketplace is \u003cbr /\u003eintegral for our continued success. We need the right person to join our \u003cbr /\u003emarketing team to help design \u0026 develop our corporate website, product \u003cbr /\u003eofferings, and sales \u0026 marketing materials that will propel us to Drupal \u003cbr /\u003eCommerce greatness!",
    "urlFetchPending": false,
    "published": "Jan 20, 2017 12:50:22 AM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "remoteok.io-mobile",
    "url": "https://remoteok.io/jobs/20838",
    "title": "Ninja UX Goal Setting, Messaging and Team Collaboration Mobile App Designer",
    "content": "NOTE 1:  This job can be done remotely from anywhere, but we prefer candidates \u003cbr /\u003efrom U.S., Canada, Western Europe and Australia.\u003cbr /\u003eNOTE 2:This is a FREELANCE / Project based position.  We are NOT seeking a \u003cbr /\u003efull-time, dedicated Mobile UX App designer.  We ARE seeking \u003cbr /\u003eProject Brief:\u003cbr /\u003eWe seek a world class Enterprise mobile app UX designer who has PROVEN skills \u003cbr /\u003eand success exploiting the latest UX, Behavioral, and neuroscience research to \u003cbr /\u003edesign simple, profoundly engaging experiences.  The scope of the app we seek \u003cbr /\u003eto design is focused on mediating daily and weekly interactions of a team \u003cbr /\u003efocused on capturing breakthrough learning insights as well as acting as a tool \u003cbr /\u003efor doing real-time group estimating and forecasting.  A great example of a \u003cbr /\u003eteam based, \"real time\" mobile collaboration app is Agile Planning Poker. \u003cbr /\u003e Another great feature set is that of Facebook messenger.\u003cbr /\u003e\u003cbr /\u003eThe Ideal UX App Designer:\u003cbr /\u003eYou will have a portfolio of successful Enterprise mobile app design products \u003cbr /\u003ethat have successfully engendered user engagement, and ultimately behavior \u003cbr /\u003echange. Additionally you will be someone who has keen insight into how to make \u003cbr /\u003ea Mobile app compelling and effective.\u003cbr /\u003e\u003cbr /\u003eTo apply: brad.murphy@gearstream.com \u003cbr /\u003e\u003cmailto:%62%72%61%64.%6d%75%72%70%68%79@%67%65%61%72%73%74%72%65%61%6d.%63%6f%6d\u003e",
    "urlFetchPending": false,
    "published": "Jan 19, 2017 4:50:47 AM",
    "tags": [
      "REMOTE2/Europe",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53991/uxui-designer-at-joyride/",
    "title": "UX/UI Designer",
    "content": "*About Joyride:*\u003cbr /\u003eOur aim is to make cycling safer and become the go-to name in urban cycling data. With our innovative sensors, Joyride helps bicycle fleet managers, city planners, and community advocates get the data they need to build sustainable and healthy cycling programs and infrastructure. \u003cbr /\u003e\u003cbr /\u003e*Role description:*\u003cbr /\u003eAre you obsessed with urban planning and design? Do you have a love of cartography and playing with OpenStreetMaps? Do you get excited by data viz and cycling?\u003cbr /\u003e\u003cbr /\u003eForget what you know about traditional admin dashboards and control panels. Let’s start from scratch. \u003cbr /\u003e\u003cbr /\u003eWe are looking for someone who can design mockups of what the next generation of cycling analytics for cities looks like. Something more creative than contemporary; something bold and risky. \u003cbr /\u003e\u003cbr /\u003eYou can work from anywhere; however, you are welcome to work out of our London office if you enjoy company and free coffee.\u003cbr /\u003e\u003cbr /\u003eThe ideal candidate will have\u003cbr /\u003e* An understanding or interest in city planning/decision making\u003cbr /\u003e* Previously worked on a project related to transit or urban mobility\u003cbr /\u003e* Strong skills in Sketch or other design tools\u003cbr /\u003e* Experience with prototyping software such as Principle and/or Invision\u003cbr /\u003e* Excellent typography skills\u003cbr /\u003e* Portfolio showcasing high-end digital design skills\u003cbr /\u003e* Animation motion graphic skills and knowledge of HTML5/CSS would be a nice to have\u003cbr /\u003e* Strong proven graphic design skills with thorough knowledge of digital media\u003cbr /\u003e* A user centric approach to design with a meticulous eye for detail\u003cbr /\u003e\u003cbr /\u003e*Application deadline:* February 20th, 2017\u003cbr /\u003e\u003cbr /\u003e*How to apply:* Please send us a link to your portfolio and an application \u003cbr /\u003e\u003cbr /\u003eFind out more at \"www.Joyride.city\":http://www.joyride.city or follow us at @JoyrideCity",
    "urlFetchPending": false,
    "published": "Feb 3, 2017 7:00:56 PM",
    "tags": [
      "REMOTE2/locals-only",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53984/junior-digital-designer-at-bridebook/",
    "title": "Junior Digital Designer",
    "content": "Bridebook.co.uk is revolutionising the wedding industry and looking for a junior digital designer to join their small, charismatic, influential team. Working closely with the lead designer on design across the site. You’ll be designing for our responsive website as well as have opportunities to design for our social media channels, app design and supporting digital marketing creative campaigns. \u003cbr /\u003e\u003cbr /\u003eYou will be responsible for a key part of our mission to make wedding planning as easy, fun and beautiful as it should be. Since launching in February 14th, 2016, more than 30,000 brides have begun planning their weddings with Bridebook.  \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eYour profile: \u003cbr /\u003e\u003cbr /\u003e-    You have designed websites or worked on UI\u003cbr /\u003e\u003cbr /\u003e-    Proficiency in Sketch and/or Photoshop is required \u003cbr /\u003e\u003cbr /\u003e-    Interested in learning UX and applying it to your workflow \u003cbr /\u003e\u003cbr /\u003e-    You are tech-savvy and enjoy working within a fast-paced startup\u003cbr /\u003e\u003cbr /\u003e-    A collaborative attitude and strong communication skills \u003cbr /\u003e\u003cbr /\u003e-    Experience with responsive and cross-device usability is preferred, but not required\u003cbr /\u003e\u003cbr /\u003e-    An understanding of Agile methodologies is preferred, but not required\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eAbout the company: \u003cbr /\u003e\u003cbr /\u003e-    Startup based by Marble Arch/Edgware Road\u003cbr /\u003e\u003cbr /\u003e-    Work with a very smart, experienced, enjoyable group of people who love to love what they do!\u003cbr /\u003e\u003cbr /\u003e-    There is no hierarchy within the team, and especially no hand-holding\u003cbr /\u003e\u003cbr /\u003e-    Friday lunches, occasional pub excursions, trips, events and a fun, casual environment\u003cbr /\u003e\u003cbr /\u003e-    We are a small team, and all work in one large room along a central island, so very collaborative\u003cbr /\u003e\u003cbr /\u003eIf this opportunity excites you, get in touch!",
    "urlFetchPending": false,
    "published": "Feb 3, 2017 6:00:11 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53965/graphic-designer-at-undecidedcom/",
    "title": "Graphic Designer",
    "content": "​Straight out of Los Angeles, Undecided is a video decision app, endorsed by leading Youtubers and Instagrammers.\u003cbr /\u003e\u003cbr /\u003eWHAT\u0027S UNDECIDED? \u003cbr /\u003eUsers post their video questions, advise each other on all types of decisions and can become Experts in pre-defined categories (fashion, beauty, etc). We have deals with leading brands and media in the beauty/fashion space\u003cbr /\u003e\u003cbr /\u003eOur target market is teen/ young women. You can already download the app on the App Store: UNDECIDED\u003cbr /\u003e\u003cbr /\u003eWHAT WE EXPECT FROM YOU:\u003cbr /\u003eThe main tasks are to create graphics and design for email newsletters and social media accounts.\u003cbr /\u003e\u003cbr /\u003eCandidates should be available to start ASAP and work with a flexible schedule. \u003cbr /\u003e\u003cbr /\u003eCandidates should come to the role with:\u003cbr /\u003eExperience creating graphics for banner ads, GIF, newsletters and websites and a solid grasp of design concepts\u003cbr /\u003eAble to draw - we need sweet and fun icons for the app\u003cbr /\u003eA total understanding of visuals (instagram, fashion, etc) targeted towards the teen / young woman market\u003cbr /\u003eComfort working in Adobe Creative Suite, including Photoshop, InDesign, and Illustrator\u003cbr /\u003eLove the task at hand - please download the Undecided app to check your work would be \u0027on brand\u0027\u003cbr /\u003e\u003cbr /\u003eApplication:\u003cbr /\u003e\u003cbr /\u003eSend us your CV, cover letter along with some samples of your past work. We look forward to hearing from you!",
    "urlFetchPending": false,
    "published": "Feb 3, 2017 12:29:57 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53888/creative-graphic-designer-at-airtime-rewards/",
    "title": "Creative Graphic Designer",
    "content": "Our Business\u003cbr /\u003eAirtime Rewards is a revolutionary new retail rewards program, changing the way 10’s of thousands of users in the UK fund the cost of their smartphones. Our users are able to reduce their phone bill, simply by spending with major high street retailers. We’re working alongside all the major mobile networks in the UK to offer retailers a totally new way to reward their customers. \u003cbr /\u003e\u003cbr /\u003eThe Team \u0026 Role\u003cbr /\u003eWe’re a small, young \u0026 agile team, looking to recruit a creative graphic designer to join our growing team in London. The role would include taking creative lead on all design elements within our business from our mobile applications to our content marketing strategy. We’re looking for an experienced designer comfortable creating engaging UX / UI across both web and mobile. \u003cbr /\u003e\u003cbr /\u003eWhat will you get out of the internship?\u003cbr /\u003eYou’ll be joining the team based in O2 Telefonica’s acceleration process, WAYRA. An intense 8 month process designed to accelerate our growth using investment \u0026 guidance from O2 Telefonica. You’ll be based in Telefonica HQ in Piccadilly Circus and exposed to a wide range of key employees within the business. \u003cbr /\u003e\u003cbr /\u003eThe Role\u003cbr /\u003e- Design the user interface of our both our corporate and consumer web platforms \u003cbr /\u003e- Review the current UX / UI smartphone applications, suggesting improvements \u003cbr /\u003e- Lead ongoing UX / UI design of both iOS \u0026 Android smartphone applications \u003cbr /\u003e- Design and deliver creative for marketing campaigns: work with CMO to design our Facebook, Instagram, Display and Email campaigns.\u003cbr /\u003e- Lead AR brand development \u003cbr /\u003e\u003cbr /\u003eSkills \u003cbr /\u003e- Fully proficient with Adobe Creative suite of products (photoshop \u0026 illustrator) \u003cbr /\u003e- At least 2 years design experience \u003cbr /\u003e- Experience of both web and mobile UX / UI design \u003cbr /\u003e\u003cbr /\u003eAbout you\u003cbr /\u003e- Keen eye for detail\u003cbr /\u003e- Love start-ups \u003cbr /\u003e- Focus on meeting deadlines \u003cbr /\u003e\u003cbr /\u003eWhere - O2 Telefonica’s office, Piccadilly Circus, London\u003cbr /\u003eThis is a paid freelance position, with the option of turning into a full time position.\u003cbr /\u003eextra benefits - Friday drinks, cool central London office, Free coffee\u003cbr /\u003e\u003cbr /\u003e",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 11:06:46 AM",
    "tags": [
      "REMOTE2/Europe",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53815/magazine-designer-at-beer52/",
    "title": "Magazine Designer",
    "content": "About the Role\u003cbr /\u003e\u003cbr /\u003eWorking day-to-day with our Editor, Richard, and Commercial Manager, David, you will help ensure that the magazine is produced on time – liaising with the team, contributors and advertisers to create layouts.  \u003cbr /\u003e\u003cbr /\u003eIn charge of creating beautiful and engaging spreads, your role will primarily be design-based, spending most of your time in Adobe InDesign. Outside of working on Ferment, you will have the opportunity to influence Beer52’s overall design, by working on brochures, print ads, inserts and other print design projects.\u003cbr /\u003e\u003cbr /\u003eAbout You \u003cbr /\u003e\u003cbr /\u003eThis role covers a diverse range of tasks, so we require someone who is open to being a part of a fast-moving magazine startup. You must have a flair for designing eye-catching layouts (of course) and be knowledgeable and experienced in the full suite of Adobe software (particularly InDesign but also Photoshop and ideally Illustrator). As part of a small but dynamic production team, you must also be willing to pitch in on other areas, and seize the opportunity to develop your skills in activities including photography, subediting and production management.\u003cbr /\u003e\u003cbr /\u003eWe are a startup in an extremely competitive market, so there is pressure to achieve our goals – your role and organization skills will be key to our success. You must enjoy this type of pressure and be passionate about improving our processes, completing admin and supporting the rest of the team with sometimes time-sensitive design work.\u003cbr /\u003e\u003cbr /\u003eYou must have significant experience in a similar prior role. \u003cbr /\u003e\u003cbr /\u003eAbout Beer52 / Ferment Magazine\u003cbr /\u003e\u003cbr /\u003eWe are a super-passionate, young team, focused on turning the world’s most popular craft beer club into a leading force in craft beer retail. \u003cbr /\u003e\u003cbr /\u003eBeer52 is the UK’s largest and fastest-growing independent craft beer retailer, working with more than 300 of the world’s best microbreweries. We deliver a monthly case of craft beers to our 15,000+ members’ doors, along with our award-winning magazine, Ferment. \u003cbr /\u003e\u003cbr /\u003eEvery month, the magazine focuses on a different theme; for example, Denmark, Scotland or Colorado. We interview the most pioneering people within beer and spirits. Recent features include Brewdog’s James Watt on his plans for spirits and Mikkel Borg Bjergso on his ‘Walter White’ stories from creating more than 600 iconic beers. \u003cbr /\u003e\u003cbr /\u003eWe work with around 20 great contributors, including beer and spirit writers Matt Curtis, Melissa Cole, Pete Brown and Mark Dredge.  The magazine has 50,000 readers and is available in 2,000 locations, making it the No. 1 craft alcohol title in the UK.\u003cbr /\u003e\u003cbr /\u003eOther perks of the job:\u003cbr /\u003e\u003cbr /\u003eIt helps if you are interested in craft beer, but don’t worry if you’re not an expert!  We hold a weekly Beer School, where you’ll get the chance to learn all about our product!\u003cbr /\u003e\u003cbr /\u003eThere may be opportunities to travel to visit breweries in other countries, write for Ferment and speak about our business at trade events.\u003cbr /\u003e\u003cbr /\u003eFree beer, free fruit, phone insurance, TasteCard and other perks. \u003cbr /\u003e\u003cbr /\u003ePlease send us your CV, your past experience and information about your personal passion for craft beer. A brief outline of what excites you about our company and what ideas you might have for delivering a better experience to our customers would be greatly appreciated.",
    "urlFetchPending": false,
    "published": "Jan 30, 2017 4:50:26 PM",
    "tags": [
      "REMOTE2/Europe",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53707/junior-graphic-designer-artworker-at-myshowcase/",
    "title": "Junior Graphic Designer \u0026 Artworker",
    "content": "MyShowcase is one of the UK’s fastest-growing startups. We have a team of 27 in our HQ team, over 1,500 Stylists around the UK and in 2016, we turned over £3.2m in revenue.\u003cbr /\u003e\u003cbr /\u003eWe’ve been named as one of The Sunday Times ‘Top 15 fastest-growing startups’, named #2 best online beauty retailer by The Independent and won the 2016 DSA Excellence “Best Company” award.\u003cbr /\u003e\u003cbr /\u003eSo what do we do? In a nutshell, we’re an award-winning, multi-brand, multi-channel personal beauty advisory service that helps women to discover and buy beauty products from a curated range of the most innovative independent beauty brands around.\u003cbr /\u003e\u003cbr /\u003eWhilst we operate within the beauty space, we’re really a tech-enabled and multi-channel eCommerce business at heart. We’re looking for folks with startup experience who know what it takes to grow and scale a business. In 2017, we plan to double the size of our business and we’d love you to be a part of it!\u003cbr /\u003e\u003cbr /\u003e*The Team*\u003cbr /\u003e\u003cbr /\u003eAs a startup, we work fast and we get sh*t done. We’re a small, passionate and driven bunch. We’re also an open and honest team, we succeed and fail together and support each other in that. We’re don\u0027t clock watch, we work hard to go the extra mile when we need to - after all, that’s where the magic happens.\u003cbr /\u003e\u003cbr /\u003eWe’re always looking to improve, grow and develop, whether that’s our people, our roles or our product. It really is a great bunch of people behind MyShowcase.\u003cbr /\u003e\u003cbr /\u003e*Who are we looking for?*\u003cbr /\u003e\u003cbr /\u003eWe’re on the lookout for an ambitious and talented Junior Graphic Designer and Artworker within our marketing team in London HQ. \u003cbr /\u003e\u003cbr /\u003eWe need a skilled and passionate graphic designer and artworker with creative flair and an eye for detail to be responsible for crafting creative assets for use in online and offline marketing channels - everything from email and digital marketing to print books and even MyShowcase merchandise. \u003cbr /\u003e\u003cbr /\u003e*Responsibilities:*\u003cbr /\u003e\u003cbr /\u003e* Working with your manager, help shape and define MyShowcase’s visual identity \u003cbr /\u003e* Respond to design briefs to deliver graphic / illustration work \u003cbr /\u003e* Work closely with the project owner to produce concepts that meet the brief\u003cbr /\u003e* Effectively manage delivery and timelines of creative output for project owners\u003cbr /\u003e* Responsible for print-ready and digital artwork for marketing campaigns \u003cbr /\u003e* Craft online marketing materials (e.g. banners, email artwork and blog images, Stylist assets for social media, infographics)\u003cbr /\u003e* Develop print layouts for marketing materials (e.g. flyers, event collateral, merchandise) \u003cbr /\u003e* Manage and organise the graphic and photography file storage \u003cbr /\u003e* Meet stringent deadlines while having the ability to adapt quickly to changing priorities \u003cbr /\u003e* Retouching product images as we bring on new brands and product SKUs\u003cbr /\u003e\u003cbr /\u003e*About You:*\u003cbr /\u003e\u003cbr /\u003e* A love of startups - you’ll be passionate about MyShowcase and up for a big challenge \u003cbr /\u003e*A jack of all design trades...and a master of most of them too \u003cbr /\u003e* Nothing gets by you - you have a ‘no stone left unturned’ approach to every last detail \u003cbr /\u003e* You thrive on feedback. You’re thick skinned and ready to learn\u003cbr /\u003e* You’re happy to get your hands dirty\u003cbr /\u003e* You understand the commercial side of design. We want things to look great but also work hard to deliver too\u003cbr /\u003e* Ambition to succeed and proactively look to find new (and smarter) ways of doing things\u003cbr /\u003e* Deadlines are never an issue, chore or bore, and you hate to miss them\u003cbr /\u003e* You’re a professional plate juggler – having multiple projects on-the-go is the kind of thing that gets you out of bed in the morning\u003cbr /\u003e\u003cbr /\u003e*A bit about your background:*\u003cbr /\u003e\u003cbr /\u003e* 1+ years of graphic design experience (either client side or agency)\u003cbr /\u003e* Expert working knowledge of basic design and typography principles\u003cbr /\u003e* Fully proficient with the Adobe Creative suite of products (e.g. Photoshop, Illustrator) and Microsoft PowerPoint]\u003cbr /\u003e\u003cbr /\u003e*The benefits, biscuits and beers:*\u003cbr /\u003e\u003cbr /\u003e* Competitive salary \u003cbr /\u003e* A role that you can help shape, define and grow\u003cbr /\u003e* The chance to work in one of the UK’s fastest growing companies\u003cbr /\u003e* All the tea and coffee you can drink\u003cbr /\u003e* Breakfast and lunches included; think toast, bagels and snacks galore\u003cbr /\u003e* Beer, wine and pizza time. The real deal clinchers. We work hard, but we’re also a really friendly startup who love a laugh and a beer down the pub.\u003cbr /\u003e \u003cbr /\u003eIf this sounds like the role for you, get in touch!",
    "urlFetchPending": false,
    "published": "Jan 26, 2017 4:16:27 PM",
    "tags": [
      "REMOTE2/locals-only",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53646/product-designer-at-hero/",
    "title": "Product Designer",
    "content": "The role:\u003cbr /\u003e\u003cbr /\u003eWe’re seeking a brilliant and highly-motivated Product Designer to help us lead design and create industry-defining work within the field of LIVE Shopping and e-commerce. Reporting to the Head of Design, you’ll make an impact from day one, working closely with the founder, a dedicated team of engineers, marketers and product management. Focused on designing products to be used by millions of online shoppers and thousands of in-store associates across the globe, you’ll be a creative force comfortable looking at the bigger picture while focusing on detailed product design execution.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWho we are:\u003cbr /\u003e\u003cbr /\u003eHero is powering LIVE Shopping for many of the world\u0027s fastest-growing retailers. Described by Business Insider as like \"WhatsApp for shopping\"​, Hero uses messaging, live video + AI to connect online shoppers with associates in-store. \u003cbr /\u003eOur team of engineers, product designers, and thought leaders are on a mission to humanise ecommerce and enable ambitious retailers to grow.\u003cbr /\u003eHeadquartered in London’s Fitzrovia, Hero was founded in 2015 by the pioneers of app commerce and is privately-funded by global retail and technology investors. It has been featured by Apple, WGSN and The Times.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eREQUIREMENTS\u003cbr /\u003e\u003cbr /\u003eWhat we’re looking for:\u003cbr /\u003e\u003cbr /\u003e* Driven by a purpose, you have a desire to build something meaningful and innovative.\u003cbr /\u003e* You’re a talented designer with experience in designing + iterating customer facing digital products, especially across mobile and tablet platforms.\u003cbr /\u003e* 2 - 4 years experience of design in a commercial environment, ideally at a startup or tier-1 digital agency.\u003cbr /\u003e* You\u0027re passionate about communication through design and the vital role of brand in user experience.\u003cbr /\u003e* You have a strong command of both aesthetic design languages and the concrete logic of user thinking.\u003cbr /\u003e* Someone who excels when working with engineering teams, and lives and breathes the latest in design trends and UI conventions.\u003cbr /\u003e* You’re a pro when it comes to understanding a design brief, extracting meaningful insights from real users and analysing data to inform product design decisions.\u003cbr /\u003e* You can operate in an an agile environment with a small team, whilst also helping to shape process as the company grows.\u003cbr /\u003e* The sort of personality who thrives in a fast moving environment.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eBENEFITS\u003cbr /\u003e\u003cbr /\u003e* Make an impact in a rapidly growing start-up\u003cbr /\u003e* Work with a talented team of people who love what they do\u003cbr /\u003e* A competitive salary + options in the company\u003cbr /\u003e* A shiny new MacBook Pro + all the software you need\u003cbr /\u003e* A chance to work in a vibrant, creative environment (we’re in the loft of a beautiful Georgian townhouse) with plenty of team lunches, social events and weekly yoga\u003cbr /\u003e* All the coffee and tea you can drink. Even darjeeling\u003cbr /\u003e\u003cbr /\u003ePlease send CVs along with your portfolio (either attached or online). Applications without a portfolio will unfortunately not be reviewed. \u003cbr /\u003e\u003cbr /\u003eStrictly no recruitment agencies please.",
    "urlFetchPending": false,
    "published": "Jan 25, 2017 11:31:31 AM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53623/product-designer-at-supercarers/",
    "title": "Product Designer",
    "content": "*Overview*\u003cbr /\u003e\u003cbr /\u003eSuperCarers is an online platform where families can find trusted local carers for the people they love. We provide families with simple digital tools to manage the scheduling, logistics and payment of care directly with a carer, bypassing the high overhead costs of agency middlemen. We are backed by a great set of investors, including the founders of Innocent Smoothie via their JamJar Investment Fund.\u003cbr /\u003e\u003cbr /\u003e*The Role*\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for an amazing Product Designer to join our talented team and help drive our product vision.\u003cbr /\u003e\u003cbr /\u003eYou\u0027ll be responsible for taking a deep dive into our current product and helping us reshape it in a way that is not only visually beautiful but a joy to use.\u003cbr /\u003e\u003cbr /\u003eWe’re a growing team that hugely values the importance of design and usability.\u003cbr /\u003e\u003cbr /\u003eExcellent design will be core to us creating a product that truly revolutionises care, particularly as our user base are often middle-aged parents and not Shoreditch hipsters.\u003cbr /\u003e\u003cbr /\u003eYou\u0027ll be responsible for:\u003cbr /\u003e\u003cbr /\u003e* Helping to define product strategy and how features should be implemented from a user experience perspective.\u003cbr /\u003e* Enhancing our existing platform to give it an industry leading level of polish.\u003cbr /\u003e* Leading initial design thinking on our upcoming mobile apps, both from a customer and carer perspective.\u003cbr /\u003e* Drawing upon customer and carer feedback to provide informed design solutions across a number of applications.\u003cbr /\u003e* Working with members of the company across departments to ascertain needs and educate on how good design can help them.\u003cbr /\u003e\u003cbr /\u003e*Requirements* \u003cbr /\u003e\u003cbr /\u003eWe’re after someone who is passionate about making a product truly excellent through smart design thinking.\u003cbr /\u003e\u003cbr /\u003e* 3+ years of experience as a Product Designer or similar.\u003cbr /\u003e* Excellent interface design skills.\u003cbr /\u003e* Firm grasp of UX and UI principles and the ability to translate them into robust design solutions.\u003cbr /\u003e* Able to work closely with a development team in order to rapidly prototype potential solutions and communicate visual design requirements.\u003cbr /\u003e* The ability to clearly communicate design choices as to how they reflect customer requirements and business needs.\u003cbr /\u003e* An eye for detail and an appreciation for craftsmanship.\u003cbr /\u003e\u003cbr /\u003e*Benefits*\u003cbr /\u003e\u003cbr /\u003e* Competitive salary and stock options in fast-growing tech business.\u003cbr /\u003e* 25 days holiday, plus public holidays.\u003cbr /\u003e* Work with a talented, passionate and fun team.\u003cbr /\u003e* Office in Old Street.\u003cbr /\u003e* Work remotely for 1-week per year - remember that great coffee shop in Paris you loved!?",
    "urlFetchPending": false,
    "published": "Jan 24, 2017 5:11:57 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53560/junior-graphic-designer-at-thesquare/",
    "title": "Junior Graphic Designer",
    "content": "*About thesqua.re:*\u003cbr /\u003e\u003cbr /\u003eThesqua.re is leading technology driven hospitality company that provides 4 star corporate accommodation in key metropolitan destinations across the world. Seven years into the business with three awards for product excellence, the company is now embarking on an ambitious strategy to become a category leader in our businesses across multiple markets in Europe and Asia Pacific.\u003cbr /\u003e\u003cbr /\u003eOur office has an engaging and unique culture – where openness, collaboration and intellectual curiosity is fostered in a collegiate environment. We are located in Fenchurch Street, the vibrant heart of London’s financial centre – minutes from Bank tube station.\u003cbr /\u003e\u003cbr /\u003e*Purpose of Role:*\u003cbr /\u003e\u003cbr /\u003eYou will be able to see things from our customers’ perspective and create fresh and thought provoking visual experiences using traditional and digital channels.\u003cbr /\u003e\u003cbr /\u003eYou will be a pivotal part of thesqua.re, providing the marketing team with all customer facing materials as well as working on improving our website’s look, feel and journey. This is a chance to help visually shape a new brand, So our ideal person will need to combine visual design and user experience skills.\u003cbr /\u003e\u003cbr /\u003e*Responsibilities:*\u003cbr /\u003e\u003cbr /\u003e*Graphic design:*\u003cbr /\u003e* Work alongside marketing to create various online \u0026 offline marketing visuals in support of our campaigns. This could range from designing flyers, newsletter images, social media images, booklets right through to business cards\u003cbr /\u003e* Design marketing glossies and traditional materials, logos, etc.\u003cbr /\u003e* Work with tech teams to create stunning website layouts\u003cbr /\u003e\u003cbr /\u003e*User experience:*\u003cbr /\u003e* Design the interactions and flows with our website and applications so that customers can achieve their goals and objectives.\u003cbr /\u003e* Research and test user interactions with our website and applications to quantitatively understand what improvements we need to make.\u003cbr /\u003e* Work with our technologists and developers to implement the user experiences and designs.\u003cbr /\u003e\u003cbr /\u003e*The candidate:*\u003cbr /\u003e* Uber creative\u003cbr /\u003e* Experienced on Photoshop, indesign, illustrator and Experience design (preferable)\u003cbr /\u003e* Constantly looking at competitors and seeking out inspiration\u003cbr /\u003e* At home working to print just as much as digital\u003cbr /\u003e* Enjoys the idea of starting completely from scratch",
    "urlFetchPending": false,
    "published": "Jan 23, 2017 3:37:28 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53553/ui-designer-at-peak/",
    "title": "UI Designer",
    "content": "DESCRIPTION\u003cbr /\u003eLaunched in 2014, Peak is a brain training app developed with the help of neuroscientists that offers fun and challenging games to help improve and assess cognitive skills. Peak is based in central London and was founded by entrepreneurs from Google, Amazon, Playfish/EA and academia with a mission to revolutionise education through mobile, games and science.\u003cbr /\u003e\u003cbr /\u003eWe were named one of the “Best Apps Of the Year” by Apple in 24 countries and we’re a Google Play “Editors’ Choice” App. We recently raised $10 million in VC funding, in part from Spotify-backers Creandum, and currently have millions of users around the world playing our games.\u003cbr /\u003e\u003cbr /\u003eAs a UI/UX designer you\u0027ll use your skills to define and develop brand new features and improve already existing ones, working shoulder-to-shoulder with our close team of designers, scientists and engineers to delight millions of users across the world.\u003cbr /\u003e\u003cbr /\u003eYou’ll work closely with our Product Managers to help design new features and iterate on existing ones, having a chance to make a meaningful impact on our product.\u003cbr /\u003e\u003cbr /\u003eYou\u0027ll also support our marketing team, creating engaging and compelling materials to properly communicate our product.\u003cbr /\u003e\u003cbr /\u003eESSENTIAL SKILLS\u003cbr /\u003eAbility to create great UIs on mobile and tablets for both iOS and Android platforms • Flexible in handling requests and able to switch taks quickly if needed\u003cbr /\u003eKnowledgeable of latest design trends and able to adapt to different styles\u003cbr /\u003eGood eye for layout and colour\u003cbr /\u003eGood eye for detail and consistency; no detail is too small or insignificant • Organised and able to deal with large quantity of art assets\u003cbr /\u003eExcellent collaboration skills\u003cbr /\u003eKnowledge of animation and motion design\u003cbr /\u003eProficient with Photoshop, Illustrator, After Effects and Sketch • Basic HTML + CSS knowledge\u003cbr /\u003eInterest for games a plus\u003cbr /\u003eEligible to work in the UK\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWHY YOU SHOULD JOIN US\u003cbr /\u003eWe set our hiring bar really high - you will be working with the best.\u003cbr /\u003eThe company is growing fast; you\u0027ll have a lot of opportunity to make a real impact on our app and our brand, and learn loads from day one!\u003cbr /\u003eCompetitive salary and loads of perks including healthy snacks all day long, gym membership, your choice of hardware and a fun and friendly working environment.",
    "urlFetchPending": false,
    "published": "Jan 23, 2017 2:25:44 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53423/ui-designer-at-zephyr/",
    "title": "UI Designer",
    "content": "**About the Company**\u003cbr /\u003e\u003cbr /\u003eZephyr is a digital agency based in the heart of Shoreditch that helps startups and businesses grow. We work with a wide range of companies to create innovative products, develop impactful growth strategies and build websites and apps.\u003cbr /\u003e\u003cbr /\u003eOur current client roster includes multi-national companies such as Warner Music, an insurtech startup using chatbots and London’s leading electric bike retailer. Following a successful 2016, we have exciting plans for 2017.\u003cbr /\u003e\u003cbr /\u003e**About the Role**\u003cbr /\u003e\u003cbr /\u003eThis is a key hire at a critical and exciting stage for Zephyr.  Over the next 12 months we are looking to scale quickly with a view to working with even more interesting and innovative clients from around the world  \u003cbr /\u003e\u003cbr /\u003eWe require a highly talented and ambitious junior designer who is keen to work closely with Xan and Nick (Zephyr’s co-founders) to create compelling and beautiful UIs for websites/ apps and generate powerful marketing content for a range of clients.  The position has the potential to develop into a managerial role in the future. \u003cbr /\u003e\u003cbr /\u003e**Essential skills Include**\u003cbr /\u003e\u003cbr /\u003e*Proficient in illustrator, photoshop and sketch\u003cbr /\u003e*A full understanding of responsive web design \u003cbr /\u003e*Strong communication skills \u003cbr /\u003e*Solid attention to detail (pixel perfect design, typography and colour choice)\u003cbr /\u003e*Wireframing skills (including knowledge of tools such as Balsamiq or In Vision)\u003cbr /\u003e*Video editing (including knowledge of Premiere Pro or Final Cut) \u003cbr /\u003e\u003cbr /\u003e**Desirable Skills**\u003cbr /\u003e\u003cbr /\u003e*Knowledge of HTML, CSS \u003cbr /\u003e*Previous experience working in a UI/UX role \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eZephyr is incubated by the innovation agency Fearlessly Frank, so the successful applicant will become part of a thriving and dynamic office culture situated in the middle of Shoreditch.\u003cbr /\u003e\u003cbr /\u003eLook forward to hearing from everyone!",
    "urlFetchPending": false,
    "published": "Jan 18, 2017 3:14:19 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53372/ux-designer-at-sam-labs/",
    "title": "UX Designer",
    "content": " We\u0027re on the hunt for a passionate User Experience Designer to join our tight-knit team of developers and designers in an award-winning digital startup in East London. You will be responsible for prototyping and user testing interactive digital and real world experiences.\u003cbr /\u003e\u003cbr /\u003eResponsibilities\u003cbr /\u003eTake broad, conceptual ideas and turn them into something useful and valuable for our users\u003cbr /\u003eDesign flows and experiences that are incredibly simple and elegant\u003cbr /\u003eDesign studies that address both user behavior and attitudes\u003cbr /\u003eConduct research using a wide variety of qualitative methods and a subset of quantitative methods, such as surveys\u003cbr /\u003eGenerate insights that both fuel ideation and evaluate designs\u003cbr /\u003eWork closely with the product team to identify research topics\u003cbr /\u003eCommunicate results and illustrate suggestions in compelling and creative ways\u003cbr /\u003eSkills\u003cbr /\u003eExcellent communication skills to clearly articulate design decisions\u003cbr /\u003eExperience in designing, gathering, analysing and presenting data from user testing\u003cbr /\u003eExperience in building and shipping applications, software or hardware\u003cbr /\u003eExperience with Application Design, Visual Design, and Interaction Design\u003cbr /\u003eDemonstrated experience with end-to-end (hybrid UX and UI) product design\u003cbr /\u003ePortfolio featuring examples of interaction design work\u003cbr /\u003eBonus Points\u003cbr /\u003eExperience in developing hardware and digital products\u003cbr /\u003eExperience in toys and gaming\u003cbr /\u003e\u003cbr /\u003eSalary\u003cbr /\u003e£30,000 to £40,000 mid level\u003cbr /\u003e\u003cbr /\u003eWe work pretty hard and your thoughts and ideas are likely to be challenged by everyone in the team, including Eukene in design, Michael in software, Cyrille in operations, and Joachim in execution. At the same time, Tak will get you doing sports, Tim will make sure you can have a go at board games and Giulio \u0026 Morten will give us plenty of new music to listen to.\u003cbr /\u003e\u003cbr /\u003eAs a young company, the best way to fare here will be by forming bonds with other employees (who come from completely different disciplines to yours), take initiative to pursue your instincts and ideas, and to drive the company forward.\u003cbr /\u003e\u003cbr /\u003eWe value optimism, collaboration, sense of ownership, the ability to embrace ambiguity, talk-less-do-more attitude, learning from failure, and making the team successful. If you identify with our values and want to contribute to our company, we’d love to have you in. \u003cbr /\u003e\u003cbr /\u003eFor extra credit, send us a sample of something that’s good, and send us a sample of something that’s great. Not something you created, and no explanation needed.\u003cbr /\u003e\u003cbr /\u003eGet more information and follow SAMlabs on:\u003cbr /\u003e\u003cbr /\u003ewww.samlabs.com\u003cbr /\u003e\u003cbr /\u003eYoutube: bit.ly/1r3JDh4\u003cbr /\u003e\u003cbr /\u003eFB: facebook.com/samlabs\u003cbr /\u003e\u003cbr /\u003eTw: @Samlabs",
    "urlFetchPending": false,
    "published": "Jan 17, 2017 1:27:59 PM",
    "tags": [
      "REMOTE2/locals-only",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53293/digital-designer-partner-at-start4me-digital-innovation/",
    "title": "Digital Designer Partner",
    "content": "Start4me is a global online incubator founded by an ex-Googler and an ex- Banking Consultant to turn global entrepreneurs\u0027 dreams into reality. We provide strategic advisory at all stages and our in-house team of web \u0026 app developers, consultants and testers build high quality and scalable apps. Our team of mentors, legal, accounting and investment partners pitch in with sector specific services at the right moments and we are on our way to become the world\u0027s best online incubator.\u003cbr /\u003e\u003cbr /\u003eThe Symbiosis Initiative:\u003cbr /\u003eThe Symbiosis Initiative is a business accelerator program specifically tailored for freelance designers and creative design agencies looking to increase their sales and revenues. We provide high quality tech development and sales assistance to help grow their business exponentially. In short, it is an accelerator for designers.\u003cbr /\u003e\u003cbr /\u003eWe are looking for freelance digital designers and creative agencies without tech development teams to be a part of the programme. It\u0027s absolutely free to join. Interested to know more? Check out our website and please apply",
    "urlFetchPending": false,
    "published": "Jan 14, 2017 10:29:15 AM",
    "tags": [
      "REMOTE2/locals-only",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53244/graphic-ui-ux-designer-needed-junior-applicants-welcome-at-joeywears/",
    "title": "Graphic / UI / UX Designer Needed - Junior Applicants Welcome",
    "content": "We’re a lifestyle brand devoted to self-expression and creating the best men\u0027s essential wears in the world, ensuring the range of basic wear doesn\u0027t compromise on comfort or style. We couldn’t be more excited to write this job spec, because it will be this person that helps bring our vision to life. We are looking for someone hungry to own the show and lead as the chief visual architect of our brand - from graphic design to videography, you name it!\u003cbr /\u003e\u003cbr /\u003eThis is a huge opportunity to completely own creative production for an fast-growing apparel brand. Your role will be varied as you will the be first in-house designer, so expect to pick up a lot of new skills very quickly. You will have flexibility to design and own your creativity. So if you\u0027re a self-starter with a go-to attitude, a hustler with plenty of initiative to create a world-class lifestyle brand, read on!\u003cbr /\u003e\u003cbr /\u003eYour responsibilities will be: \u003cbr /\u003e\u003cbr /\u003e* Design the User Experience and User Interface of our website\u003cbr /\u003e* Design and deliver creative for marketing campaigns: work with CMO to design our upcoming kickstarter campaign, disruptive Facebook, Instagram, Display and email campaigns. \u003cbr /\u003e* Develop new pattern design with our team for our next collection.\u003cbr /\u003e* Design our offline marketing materials: from our premium packaging, gift cards, \u003cbr /\u003e* Design and develop product launches, and all carryover styles and colors by delivery\u003cbr /\u003e* And make sure we don’t look basic in our basics\u003cbr /\u003e\u003cbr /\u003e*If* you are a junior designer or recent graduate, don’t hold back! We’re looking for someone with vision and hungry to prove themselves - and we’ll be happy to mentor you early on. \u003cbr /\u003e\u003cbr /\u003e_Note_: Position will begin as a contractor / freelancer, with opportunity to be full-time later on.",
    "urlFetchPending": false,
    "published": "Jan 12, 2017 3:15:24 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53152/graphic-design-intern-at-cupthemarket/",
    "title": "Graphic Design Intern",
    "content": "CupTheMarket, is a revolutionary concept acting as a bridge between brands and students. We fill the gap of inefficient marketing mediums reaching students by providing advertisement on Take-away Coffee cups within university campuses and cool and trendy cafés in central London. Students have 1-5 coffees a day, with each taking on average 30min to consume, making cup advertising the most impactful marketing medium available in the market. The cups are seen by average of 6 more people from the point of sales to disposal, making cups the ambassadors of brands acting as 1,000s of mini billboards across the campus maximising brand awareness and exposure. Furthermore, the effect of caffeine heightens alertness and the warm sensation effects the body; that places consumers mind in a more receptive and positive state to accept advertising.\u003cbr /\u003e\u003cbr /\u003eWe have combined cup advertising medium with cup recycling within universities to offer an ethical and environmentally friendly solution to the catastrophic pile of waste generated by cups. Advertising with us means brands support a pioneering scheme of Cup recycling as well as associating their brand with recycling which generates a positive image. The UK consumes 2.5 billion cups a year hence advertising with us means you prevent these cups from being dumped in landfills as they need to be segregated into different bins to be collected and recycled into new products.\u003cbr /\u003e\u003cbr /\u003eThis is a great opportunity for anyone who wants to get a real feel and experience of a startup, dealing and negotiating with global brands, if you have the passion and motivation to face and work with some of the biggest brands especially mobile apps and tech companies, then you will enjoy your Journey at CupTheMarket. \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003ePosition:\u003cbr /\u003e\u003cbr /\u003eYou should have experience with design of both icons and websites, other aspects such as user interface and illustration design being a great bonus. Solid skills in the Adobe Creative Suite or equivalents is a definite requirement. Given the right candidate, we are offering the chance to:\u003cbr /\u003e\u003cbr /\u003e-Develop and create designs and proposals for leading global brands, illustrations and logos explaining our services and define our values.\u003cbr /\u003e\u003cbr /\u003e-Constantly engaging with clients and to provide creative solutions for each individual campaigns and launches\u003cbr /\u003e\u003cbr /\u003e-Enjoy creating and designing interface and solutions through Graphic designs for potential clients.\u003cbr /\u003e\u003cbr /\u003eThis is a fantastic opportunity for young Talents to get direct exposure of real work experience by cooperating with global brands and applications. If you want to know a little more about us before applying, please let us know, and we will be in touch.",
    "urlFetchPending": false,
    "published": "Jan 10, 2017 2:21:12 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53004/senior-uxui-designer-at-brolly/",
    "title": "Senior UX/UI Designer",
    "content": "We’re looking for an experienced Senior UX/UI Designer who can take full ownership of building our brand into something unique, captivating and beautiful. Design goes to the heart of what we’re doing at Brolly, so that we can make the experience of insurance actually feel pleasant and dynamic. Your mission is to bring this to life!\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e*Your role*\u003cbr /\u003e\u003cbr /\u003e* Being the design lead for all UI \u0026 UX across the app, website, brand and marketing\u003cbr /\u003e* Working closely with the CEO and CTO, and also with the engineers, marketing and customer success teams\u003cbr /\u003e* Transforming the goals of the business into beautiful and clear interfaces, and iterating quickly based on customer feedback\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e*You should be*\u003cbr /\u003e\u003cbr /\u003e* 5+ years of design experience with both UI \u0026 UX\u003cbr /\u003e* Excited about getting your hands dirty with the entire scope of creating, implementing and overseeing our design\u003cbr /\u003e* Resourceful, dependable, proactive and an excellent communicator\u003cbr /\u003e* Very advanced in your understanding of typography, leading, grids and visual layout and design systems \u003cbr /\u003e* A problem solver who can interpret the complicated and manual tasks that exist around insurance today, making it easy for people to understand the risks they face, organise their policies, and automate how they insure themselves\u003cbr /\u003e* Able to show off a comprehensive online portfolio of your design work\u003cbr /\u003e* Well versed with HTML/CSS and have an good understanding of technology\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e*It excites us if you*\u003cbr /\u003e\u003cbr /\u003e* Have lead the design at a startup previously\u003cbr /\u003e* Have your own side projects\u003cbr /\u003e* Believe that insurtech startups should be winning design awards!\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWe love engineering. We love design. And we love insurance - or what we know it should be.\u003cbr /\u003e\u003cbr /\u003eAt Brolly we\u0027re obsessed with creating an entirely new concept of personal insurance, and a product that customers love.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re a small team that\u0027s growing fast. Our team is enthusiastic, friendly, and respectful. We love the things that make you different, and we love solving hard problems.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for determined, passionate big thinkers to join us on our ambitious undertaking to build the future of the insurance industry.",
    "urlFetchPending": false,
    "published": "Jan 5, 2017 2:49:54 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/52935/lead-uidigital-designer-at-auto1com-gmbh/",
    "title": "Lead UI/Digital Designer",
    "content": "What you will do:\u003cbr /\u003e•    Create coherent user experiences for internal and external systems\u003cbr /\u003e•    Use your analytical mind to guide the user through our platforms\u003cbr /\u003e•    Conceptualise user interfaces and experiences for both web and (iOS / Android) mobile platforms based on data and business specifications\u003cbr /\u003e•    Lead, mentor and motivate a group of talented designers\u003cbr /\u003e•    Organise an efficient workflow for the product design team under time constraints based on business goals\u003cbr /\u003e•    Work closely with product managers, business managers and engineering to realise business and customer objectives with a common goal of creating a sophisticated and intuitive product.\u003cbr /\u003e•    Be up to date with industry standards both in design and tech\u003cbr /\u003e•    Use your creativity to innovate and produce designs from basic prototypes to pixel-perfect designs\u003cbr /\u003e•    Help produce consistent assets adhering to our brand guidelines\u003cbr /\u003e\u003cbr /\u003eWhat you will learn\u003cbr /\u003e•    You will be able to further your skills in design management\u003cbr /\u003e•    How it feels to work in a can-do-environment where your input directly influences the company\u0027s success\u003cbr /\u003e•    How to use cutting-edge technology as a competitive advantage\u003cbr /\u003e\u003cbr /\u003eWhat you should bring:\u003cbr /\u003e•    4+ years of UI/ Digital design experience with a strong and diverse portfolio\u003cbr /\u003e•    Ability to transform business needs into clear, intuitive and creative solutions\u003cbr /\u003e•    Hands-on experience with digital design tools such as Adobe Photoshop, Illustrator, Sketch, InVision and/or other equivalents\u003cbr /\u003e•    You have a good understanding of usability requirements for web and mobile\u003cbr /\u003e•    Knowledge of HTML5 and CSS3 beneficial\u003cbr /\u003e•    Knowledge of common UI patterns and UX flows\u003cbr /\u003e•    Experience and passion to mentor and motivate the team\u003cbr /\u003e•    Great team worker with excellent communication skills\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWhat you will get:\u003cbr /\u003e•    Technical excellence - You will join a high profile and fun engineering team surrounded by technology \u003cbr /\u003e•    Innovative culture - You will work on previously unsolved challenges and experiment with new technologies \u003cbr /\u003e•    Real impact - Your work will enable our business success and disrupt the car industry\u003cbr /\u003e•    Benefits package - You will take advantage of our employee pension scheme, tandem partner program, dis-counts on different services (gym, public transport, leisure activities...), regular team-events (international nights, bowling, karaoke...)\u003cbr /\u003e•    Smooth start in Berlin - You will receive relocation support that includes assistance with visa, apartment search, moving costs and help with German bureaucracy\u003cbr /\u003e",
    "urlFetchPending": false,
    "published": "Jan 3, 2017 4:40:36 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/52793/freelance-ux-designer-at-truly/",
    "title": "Freelance UX Designer",
    "content": "*FOR PEOPLE WHO COLLECT MEMORIES, NOT STUFF.*\u003cbr /\u003e\u003cbr /\u003eCome and help us on our journey to become the leading marketplace for amazing memories and shared experiences!\u003cbr /\u003e\u003cbr /\u003e* Winner: Luxury Website of the Year\u003cbr /\u003e* Winner: Online Retailer of the Year \u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for an enthusiastic UX Designer to work with us in creating a super-smooth booking process for our remarkable experiences. We\u0027ve got ambitions to radically reduce our cost-to-serve through innovative automation that will also improve the customer experience. The challenge will be in incorporating the needs and desires of our customers as well as our suppliers of all kinds of experiences around the world.\u003cbr /\u003e\u003cbr /\u003eSkills you\u0027ll use:\u003cbr /\u003e\u003cbr /\u003e* Design thinking\u003cbr /\u003e* User research\u003cbr /\u003e* Ideation\u003cbr /\u003e* Wireframing\u003cbr /\u003e* Prototyping, testing and analysis\u003cbr /\u003e* Service mapping/documenting\u003cbr /\u003e\u003cbr /\u003eNote:  Start as contract / freelance, with opportunity to go full-time later on.",
    "urlFetchPending": false,
    "published": "Dec 23, 2016 3:01:13 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/52790/senior-product-designer-at-peopleperhour/",
    "title": "Senior Product Designer",
    "content": "If you’re a passionate innovator, a creative person with deep obsession with designing customer experiences end-to-end, across different media and platforms, this is your dream job. \u003cbr /\u003e\u003cbr /\u003eWe are looking for a Senior Product Designer with a strong background in UX/UI but who’s also been involved in designing customer experiences in a more extended sense. You don’t just stop at making things look pretty, you obsess about how you trigger the right emotions in the customer throughout their experience, how you make a product more functional but also more engaging. \u003cbr /\u003e\u003cbr /\u003eYou will be working closely with the CEO and CTO to conceive, prototype and design new products at a high level pre-production, as part of a core rapid innovation team.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWill must have \u003cbr /\u003e\u003cbr /\u003eStrong UX/UI background (5+ years)\u003cbr /\u003eMastery of Adobe Illustrator, Photoshop and other tools such as Sketch and Keynote\u003cbr /\u003eProficiency in prototyping tools such as Flinto, Principal and InVision\u003cbr /\u003eExperience with motion and interactive design\u003cbr /\u003eTrack record of designing features/products that WOW customers \u003cbr /\u003eStrong obsession with customer flow \u0026 experience\u003cbr /\u003eExperience in user testing and optimisation \u003cbr /\u003eWorked with C-level execs in designing new products \u003cbr /\u003eWorked with or understand analytics to optimise the design process\u003cbr /\u003eCreative thinking\u003cbr /\u003eStrong design sense and taste \u003cbr /\u003ePassion and drive for innovation \u003cbr /\u003eExcellent communication and team-work skills \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eLocation: Based in Soho, London.  \u003cbr /\u003e\u003cbr /\u003eRemuneration:Competitive base  + Stock options \u003cbr /\u003e\u003cbr /\u003eAbout Us\u003cbr /\u003eFounded in 2008, PeoplePerHour.com is a mature startup serving the burgeoning on-demand/ freelance economy globally. With offices in Athens and London, we are a savvy team of ca. 50 and growing, serving a community of over 1.5million users around the world. \u003cbr /\u003eWe’ve raised over $10m in our lifetime but that’s the part we care the least about.  What gets us out of bed is the mission and purpose we serve, which is to empower people the world over to seek their dreams of being financially independent.  \u003cbr /\u003eWe love building products, we hate fundraising, we remain independent, profitable, growing and proud to be part of a movement that is undoubtedly the future. \u003cbr /\u003eWe are now building a core Innovation team, headed by our CEO and CTO for new products, whose goal is to utilise the assets we’ve built over the past 10 years to develop new products in the burgeoning on-demand economy. You will be an integral part of this.\u003cbr /\u003e",
    "urlFetchPending": false,
    "published": "Dec 23, 2016 1:42:12 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/52758/ux-designer-bristol-at-the-social-learning-network-ltd/",
    "title": "UX Designer (Bristol)",
    "content": "Designed and co-developed with educators, Spiral is a suite of apps that can be used on any internet-connected device in a classroom. Each app is designed to mirror a specific classroom practice and can be used across all subjects and age ranges.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for a UX designer to work with us either part time or full time at our Bristol office, because we want to do this well.\u003cbr /\u003e\u003cbr /\u003eThe role of UX designer will give you full ownership of your work. You will be responsible for solving challenges of user interaction between students and teachers in a classroom setting via apps that replicate known teaching practices. This will require a high level of creativity and original thinking because you will be solving problems that haven\u0027t been solved before.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for someone who:\u003cbr /\u003e\u003cbr /\u003e•    Works well in small, agile teams.\u003cbr /\u003e•    Can handle a high level of ambiguity and deliver well thought out solutions that are the best fit.\u003cbr /\u003e•    Can communicate well with stakeholders such as teachers, headmasters, investors, and the product team.\u003cbr /\u003e•    Ability to work directly with a lead developer and a graphic designer.\u003cbr /\u003e•    Exceptional written and oral communication skills. Can work with different nationalities in different locations.\u003cbr /\u003e•    Passionate about technology, willingness to learn and try new things.\u003cbr /\u003e•    Coding skills not necessary but an understanding of how coders work is highly desired.\u003cbr /\u003e\u003cbr /\u003ePerks:\u003cbr /\u003e•    Flexible office hours with an option to work from home if required.\u003cbr /\u003e•    Competitive Salary.",
    "urlFetchPending": false,
    "published": "Dec 22, 2016 4:55:53 AM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/52664/senior-designer-at-street-team/",
    "title": "Senior Designer",
    "content": "StreetTeam is looking for an experienced digital product designer; someone who can design beautiful visuals whilst ensuring a delightful experience for our users. We’re designing across a portfolio of products, for a broad range of users and across multiple platforms as well as defining and refining our own brand.\u003cbr /\u003eThis is a hands-on design position. If you share our real passion for crafting elegant designs that solve real problems for users then you could be just what we need!\u003cbr /\u003e\u003cbr /\u003eWhat you will do in the next 12 months:\u003cbr /\u003e-Work with the Head of Design to define the design language of multiple digital products\u003cbr /\u003e-Work in a cross-functional team of developers, product owners and other designers, contributing both to the overall strategy as well as the small details\u003cbr /\u003e-Design experiences and flows that offer real value and solve problems for our users\u003cbr /\u003e-Respond to our research and user testing learnings and make improvements based on what we find out\u003cbr /\u003e-Suggest and action improvements to the design creation process\u003cbr /\u003e-Help reimagine and build the StreetTeam brand\u003cbr /\u003e\u003cbr /\u003eWho you are:\u003cbr /\u003e-You love design; from the big picture flows through to the pixel details.\u003cbr /\u003e-You care deeply about what you create and seeing people use it gets you excited\u003cbr /\u003e-You integrate your own best practice design knowledge with findings from data and user testing to design the -best possible solution to a problem\u003cbr /\u003e-You have excellent typography, colour and layout skills\u003cbr /\u003e-You’re comfortable working on projects from brainstorming and concepts through to polished designs, and then working with our developers to make them real\u003cbr /\u003e-You’re experienced and comfortable designing for native mobile apps and responsive web\u003cbr /\u003eStreetTeam is building a global network of advocates that brands can work with to sell their products and services. \u003cbr /\u003e\u003cbr /\u003eWe have established a beachhead in live entertainment working with some of the biggest music events in the world. You’ll be joining the company at an exciting time. Having just closed a major round of funding, we\u0027re building our London based product, design and engineering team from the ground up.\u003cbr /\u003e\u003cbr /\u003eStreetTeam believes in freedom and ownership with the focus entirely on the value you create – there are no set hours, meetings are optional and you can take as much holiday as you need. We only care about the results you deliver. We are free-thinking, fast learners who want to inspire change. Are you?",
    "urlFetchPending": false,
    "published": "Dec 19, 2016 12:10:46 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/52581/midweight-graphic-designer-at-yellowball/",
    "title": "Midweight Graphic Designer",
    "content": "We’re looking for a seriously talented Designer to join Yellowball, our fast-growing marketing agency to get stuck into a variety of exciting live projects. As an Integrated Designer you will be undertaking the design and artwork of digital and print based collateral as well as website design. As a Yellowball designer you will be working on a variety of projects so adaptability is key!\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e*WHO ARE WE?*\u003cbr /\u003e\u003cbr /\u003eYellowball is an award-winning creative agency working with clients ranging from start ups through to larger blue chips across London, the UK and internationally. As a full service agency we operate across the marketing mix with our core services including: \u003cbr /\u003e\u003cbr /\u003e* Web Design and development \u003cbr /\u003e* On and offline creative design across all platforms and mediums \u003cbr /\u003e* Branding\u003cbr /\u003e* Search Engine Optimisation\u003cbr /\u003e* Social Media\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e*SO, WHAT DOES YOUR DAY LOOK LIKE AT YELLOWBALL?*\u003cbr /\u003e\u003cbr /\u003eStart your day in our new office near London Bridge. Get stuck in to whatever’s on your plate. The role will be challenging, require creativity and attention to detail as well as a strong cup coffee and a chat with one of the team. The good news is that you’ll be surrounded by a creative and talented group of people who are all in the same boat as you and willing to help. \u003cbr /\u003e\u003cbr /\u003eIt might be a new brand concept or website design, creating an editorial page for one of our client’s publications or helping someone tweak a design and get a presentation out. We’re a small team and everyone just mucks in and gets on with it whatever the challenge. \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e*WHAT WOULD YOU BE DOING?*\u003cbr /\u003e\u003cbr /\u003e* Developing innovative concepts and bringing fresh design perspectives\u003cbr /\u003e* Managing multiple deadlines and ensuring all stages of design work are completed in sufficient time for production processes. \u003cbr /\u003e* Managing multiple briefs and communicate progress accurately to your team and clients\u003cbr /\u003e* Keeping abreast of the latest design trends\u003cbr /\u003e* Liaising directly with the clients on a daily basis\u003cbr /\u003e* You will be working on both digital and print based projects including website design, social imagery, branding, digital banners, leaflets, flyers, brochures and more\u003cbr /\u003e* You will produce final files for print, press and digital to required standards\u003cbr /\u003e* Delivering powerful but elegant creative solutions that help create delightful product experiences\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e*WE WOULD LOVE YOU TO:*\u003cbr /\u003e\u003cbr /\u003e* Be experienced in working in an in-house design or agency environment preferably 2+ years\u003cbr /\u003e* Have strong typographic and layout skills\u003cbr /\u003e* Have the ability to work well under pressure and in a fast paced environment \u003cbr /\u003e* Have expert knowledge in Adobe Creative Suite – particularly InDesign, Illustrator and Photoshop\u003cbr /\u003e* Be able to communicate ideas quickly and efficiently to colleagues and clients \u003cbr /\u003e* Have a portfolio demonstrating strong conceptual thinking across a range of work\u003cbr /\u003e* Be enthusiastic and use initiative\u003cbr /\u003e* Have Coding and development experience too (but don’t worry – this isn’t vital)  \u003cbr /\u003e* Work on own initiative whilst being a team player\u003cbr /\u003e* Have a meticulous eye for detail to ensure consistencies\u003cbr /\u003e* Oh, and we have an office dog.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e*GREAT, HOW DO I APPLY?*\u003cbr /\u003e\u003cbr /\u003eWe’d love to hear from you. And we’d love to see your work too. So initially, please drop a brief (but engaging) message, together with a link or PDF attached of your best and most recent work, your CV, plus anything else you think will impress us like links to your blogs or other sites. If we think there’s a match, we’ll invite you in for an interview, followed by a live 90 minute project in the studio. ",
    "urlFetchPending": false,
    "published": "Dec 14, 2016 11:04:11 AM",
    "tags": [
      "REMOTE2/locals-only",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/52510/graphic-design-internship-at-cinnamon-bridge/",
    "title": "Graphic Design Internship",
    "content": "COMPANY\u003cbr /\u003e\u003cbr /\u003eCinnamon Bridge - Food \u0026 Drinks Accelerator\u003cbr /\u003e\u003cbr /\u003eCinnamon Bridge is a platform for brave new food ideas to be discovered, launched, funded \u0026 nourished. We work with a handful of exceptional food industry talents for 3 months and we follow our unique \u0026 proven methodology in order to provide them with competitive advantage \u0026 all the necessary tools and resources. \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eROLE\u003cbr /\u003e\u003cbr /\u003eGraphic Design Intern:\u003cbr /\u003e\u003cbr /\u003eWe are looking for a motivated, highly organised and creative person who would like to work with a bunch of exciting new food and drink brands and learn all about branding, packaging design, marketing and business development.\u003cbr /\u003e\u003cbr /\u003eYou will be part of the creation of various graphic and promotional material, visual assets, brand identity design elements and layouts for use across the business. The right candidate will be able to create graphics and visuals that can transfer the branding values and personality, and has a strong understanding of graphic and communication design.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eRESPONSIBILITIES\u003cbr /\u003e\u003cbr /\u003eYou will be responsible for:\u003cbr /\u003e\u003cbr /\u003e• Assisting in design of presentations, business pitches, infographics, packaging design, digital ads, marketing email, websites, etc. \u003cbr /\u003e• Contributing to development of branding briefs and creative concepts, being able to adapt their style to different brands’ guidelines and needs. \u003cbr /\u003e• Work closely with the Senior Designer to ensure designs are seamlessly in line with client and team expectations.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eSKILLS required:\u003cbr /\u003e\u003cbr /\u003e* Adobe Photoshop, Illustrator, InDesign skills\u003cbr /\u003e* Attention to details and efficiency\u003cbr /\u003e* Analytical + Creative approach to problem solving \u003cbr /\u003e* Must be able to follow given instructions as well as work independently when required\u003cbr /\u003e* Knowledge of print production and requirements is a bonus\u003cbr /\u003e* Approachability and ability to handle criticism\u003cbr /\u003e* Ability to work with tight deadlines and manage multiple, competing priorities simultaneously\u003cbr /\u003e* A Can-do Attitude and a craving for excellence and great work!\u003cbr /\u003e* Passion for food is a must!\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThis position is open from mid January.\u003cbr /\u003eThis internship is for minimum 3 months with an intention to turn it into permanent role.\u003cbr /\u003eEmail us your CV, portfolio and a cover letter. ",
    "urlFetchPending": false,
    "published": "Dec 12, 2016 12:35:42 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/52509/product-designer-at-the-app-business/",
    "title": "Product Designer",
    "content": "As a Product Designer, your objective will be to craft great mobile products and services with users at the heart. You’ll be able to confidently contribute to a project’s design activities from kickoff through to delivery. This role will give you the opportunity to conduct crucial research data analysis; producing deliverables to highlight exciting insights for the team and stakeholders. You’ll be ambitious and passionate about design’s role in product development and its potential to solve real-world problems!\u003cbr /\u003e\u003cbr /\u003eAs part of the wider Design team, you’ll be working on products and services for some of the world’s biggest brands including the likes of TFL, Unilever, Ford. You’ll be involved in the entire cycle; from planning through to execution becoming an ever-present advocate for the user. Your interest and focus will be in human-centred visual design, supported by a broad knowledge of common user interface design patterns, iconography, typography and colour theory.\u003cbr /\u003e\u003cbr /\u003eYou will be:\u003cbr /\u003e\u003cbr /\u003e- Contributing to a project’s design workstream end-to-end, such as planning and participating in research activities with help from the wider team.\u003cbr /\u003e- Speaking to the product’s end users (through interviews or contextual research) to understand their needs and goals.\u003cbr /\u003e- Attending end-of-sprint reviews with the team and presenting your work to clients.\u003cbr /\u003e- Working collaboratively with brilliant Designers, Engineers, Strategists and other specialists to iterate and improve your designs.\u003cbr /\u003e- Delivering high quality work on time, setting your own work agenda and helping others on your team to do the same.\u003cbr /\u003e- Contributing to the Design team by helping identify and interview great new team mates\u003cbr /\u003e- Actively involved within the Design community; interest in reading books, articles and attending meetups.\u003cbr /\u003e\u003cbr /\u003eYou must have:\u003cbr /\u003e\u003cbr /\u003e- Product Design and client-facing industry experience, ideally within an agency setting.\u003cbr /\u003e- An inquisitive mind and a keen problem solver who likes taking on challenging problems and conflicting objectives, and working collaboratively to find a solution.\u003cbr /\u003e- A strong portfolio of work demonstrating a variety of tools and the problem \u0026 approach taken, not just visuals.\u003cbr /\u003e- Knowledge or ideally experience of working within an agile, software development environment.\u003cbr /\u003e- Experience using Adobe CC Suite, Sketch, Keynote and prototyping tools of your choice.\u003cbr /\u003e- An eagerness to continuously improve and learn; either through books, articles, meetups etc.",
    "urlFetchPending": false,
    "published": "Dec 12, 2016 12:32:34 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/52508/lead-experience-designer-at-the-app-business/",
    "title": "Lead Experience Designer",
    "content": "As a Lead Experience Designer at TAB, your objective will be to define the products of tomorrow and shape and drive our Design team’s capabilities, as we continue to scale at pace. You’ll be developing products for some of the world’s biggest brands, including TFL, Ford, Met Office and Unilever; providing guidance to the teams and pushing all our Designers to produce work of exceptional quality. You’ll be ambitious and passionate about Design’s role in product development; shaping our approach and becoming instrumental in scaling the team to enable great work!\u003cbr /\u003e\u003cbr /\u003eReporting into the Head of Design, you’ll be working on products and services across a wide variety of industries, helping our ambitious organisations to become more mobile and agile. You’ll be involved in the entire cycle; from planning through to execution, becoming an ever-present advocate for the user. You’ll help your team to make informed design decisions, placing the needs of the user and the business at the very heart of your work. \u003cbr /\u003e\u003cbr /\u003eYou will be:\u003cbr /\u003e\u003cbr /\u003e- Working with the Head of Design to shape the strategic direction of the Design team.\u003cbr /\u003e- Setting the agenda and driving the weekly and monthly cadence for the whole Design team.\u003cbr /\u003e- Coaching Design team members to rapidly progress their careers and contribution to TAB.\u003cbr /\u003e- Establishing innovative ways of creating exciting ideas, bringing them to life and presenting them.\u003cbr /\u003e- Having full visibility and responsibility over client and customer context for design decisions.\u003cbr /\u003e- Actively involved in growing the Design team by finding and attracting the best Design talent.\u003cbr /\u003e- Understanding the needs of the live products and how they work, and matching them with the right Design team skills.\u003cbr /\u003e\u003cbr /\u003eYou must have:\u003cbr /\u003e\u003cbr /\u003e- Significant experience at a Lead level, ideally within an agency setting.\u003cbr /\u003e- Strong experience shaping design approaches for multi-£million, client-facing projects.\u003cbr /\u003e- Worked within multidisciplinary teams and feel comfortable in a fast-paced agile environment.\u003cbr /\u003e- Extensive involvement in planning and conducting design research, and identifying patterns and insights from the research to inform and shape your product’s strategy.\u003cbr /\u003e- Adept at knowing when and how to use a range of deliverables (eg. user journeys, task models) to convey your arguments and support design decisions\u003cbr /\u003e- Extensive experience using Adobe CC Suite, Sketch, Keynote and prototyping tools of your choice.\u003cbr /\u003e- Ideally a keen interest and active involvement within the Design community (through meetups, talks articles etc).\u003cbr /\u003e\u003cbr /\u003eAbout The App Business\u003cbr /\u003e\u003cbr /\u003eFounded in 2009, The App Business runs fast and lean, creating awesome products and services for ambitious clients ready to rethink their business around mobile-enabled users. Based in the heart of London’s thriving King’s Cross, we work in an environment built to help us - and our clients - excel. We invest heavily in this vision, placing the support and development of our teams, as well as our culture, at the heart of everything we do.\u003cbr /\u003eAs a company, we know it is important to acknowledge the effort our people put in - which is why we have a great range of benefits in place, which increase as people grow and develop within TAB. It is one of the many ways we ensure we say thank you, and has lead to us ranking as \u0027Outstanding\u0027 in the independent Best Companies Index.\u003cbr /\u003eIf this sounds like the kind of place you want to work, apply now!\u003cbr /\u003e",
    "urlFetchPending": false,
    "published": "Dec 12, 2016 12:27:52 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "jobs.remotive.io",
    "url": "https://docs.google.com/forms/d/1CDsoS0pqwrMYn1yS9PuQIqpvQYUUtlBMJBOb0ZC4NME/viewform",
    "title": "Web Designer \u0026 Developer at Edgar, Anywhere - USA, engineering",
    "content": "Web Designer \u0026 Developer \u003cbr /\u003eWeb Designer \u0026 Developer\u003cbr /\u003e\u003cbr /\u003eABOUT THE ROLE\u003cbr /\u003eWe\u0027re Edgar (http://MeetEdgar.com \u003cbr /\u003e\u003chttps://www.google.com/url?q\u003dhttp://MeetEdgar.com\u0026sa\u003dD\u0026ust\u003d1486505655498000\u0026usg\u003dAFQjCNGJ7-8Kv0LwOvl9B0uZyDOLsY6_eA\u003e\u003cbr /\u003e), a new social media SaaS tool for small businesses.\u003cbr /\u003e\u003cbr /\u003eYou’ll be our dedicated web designer, with some branding and interface design \u003cbr /\u003ework as well. You\u0027ll also be our primary web developer. Your focus will be on \u003cbr /\u003edesigning marketing sites, assets, and landing pages for both sides of our \u003cbr /\u003ebusiness, with an emphasis on making sure your creations fit in well with our \u003cbr /\u003eexisting designs. While we have already established our brand identity for \u003cbr /\u003eEdgar, you will have room to grow, reinvent, and evolve our brand.\u003cbr /\u003e\u003cbr /\u003eThat means:\u003cbr /\u003e\u003cbr /\u003e- creating websites and landing pages- making all of our sites functional and \u003cbr /\u003ebeautiful on mobile/tablet\u003cbr /\u003e- designing worksheets, keynotes, and other content marketing materials\u003cbr /\u003e- ensuring all materials and web properties are consistent with our existing \u003cbr /\u003evisual identity and on-brand\u003cbr /\u003e- turning your designs into well-coded HTML/CSS/PHP and pushing them live \u003cbr /\u003e- testing the website and identifying technical problems (and fixing them!)\u003cbr /\u003e- split testing different design options to find the highest conversion\u003cbr /\u003e- creating shareable images to complement our blog posts \u003cbr /\u003e- creating ad images and other marketing assets\u003cbr /\u003e- performing routine site maintenance, updates, and site backups\u003cbr /\u003e\u003cbr /\u003eThis is the right fit for someone who loves creating their own projects top to \u003cbr /\u003ebottom. You’ll be proactively overseeing the look of everything that our \u003cbr /\u003ecompany produces - everything from fixing up poorly aligned text to creating \u003cbr /\u003einnovative, high-converting landing pages. You\u0027ll work alongside a \u003cbr /\u003esuper-talented marketing and content team, but when it comes to design and \u003cbr /\u003edevelopment, you\u0027ll own your own projects from start to finish.\u003cbr /\u003e\u003cbr /\u003eYou’ll spot opportunities for large and small-scale improvements and will push \u003cbr /\u003eus to make them. This is not a boring role and you’ll work at the micro and \u003cbr /\u003emacro levels - being both our creative director and button-maker!\u003cbr /\u003e\u003cbr /\u003eABOUT YOU\u003cbr /\u003e\u003cbr /\u003eYou are fast on your feet, dedicated to your craft, fun to be around and of \u003cbr /\u003ecourse . . . an incredibly talented web designer AND developer. You dream of \u003cbr /\u003ehelping to define the design of an entire company, from home or anywhere else \u003cbr /\u003eyou want. That’s why you’re perfect for this gig!\u003cbr /\u003e\u003cbr /\u003eBeyond being a j’mazing designer/developer, you can identify with our users \u003cbr /\u003eand create the best possible experience for them as they interact with our \u003cbr /\u003ecompany. This means that you’ll follow every step a visitor will take as they \u003cbr /\u003echeck out our blogs and resources, learn about our products (ranging from our \u003cbr /\u003esocial media training courses to our software product, Edgar), make purchases, \u003cbr /\u003eand in and begin interacting with our products. Everything from opting in to \u003cbr /\u003easking us questions will be enjoyable and simple because you’ve designed it \u003cbr /\u003ethat way.\u003cbr /\u003e\u003cbr /\u003eOur sites are in WordPress. You must be experienced with Twitter Bootstrap. \u003cbr /\u003eYou will be expected to make your own designs live on our sites! If you have \u003cbr /\u003eexperience with version control systems like Git or Mercurial, that\u0027s a HUGE \u003cbr /\u003eplus. Here are some designs we love - if your style isn’t similar, we aren’t a \u003cbr /\u003egood fit:http://pinterest.com/lkrsocialmedia/design-we-love/ \u003cbr /\u003e\u003chttps://www.google.com/url?q\u003dhttp://pinterest.com/lkrsocialmedia/design-we-love/\u0026sa\u003dD\u0026ust\u003d1486505655498000\u0026usg\u003dAFQjCNGcA-OheuJXCLLPMloB6wAPstjk3Q\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eABOUT US \u003cbr /\u003e\u003cbr /\u003eWe are a small but mighty 10-person team, and we all work from our own homes \u003cbr /\u003eall over the country. You’ll do the same. That means you need to be super-human \u003cbr /\u003eat time management - organizing your own projects and completing them on time.\u003cbr /\u003e\u003cbr /\u003eWe’re NOT your typical startup. We don’t work weekends or nights (for real) \u003cbr /\u003eand we don’t expect you to, either. That being said, we love our work and take \u003cbr /\u003ehuge pride in creating experiences for our customers that are fun, useful, and \u003cbr /\u003erewarding. The work environment you’ll be a part of is casual, open, and \u003cbr /\u003erelaxed. Two of our core values are “dorkiness” and “whimsility”. (Yes, we made \u003cbr /\u003ethat second one up.) You can read more about us and how we work at\u003cbr /\u003ehttp://meetedgar.com/careers \u003cbr /\u003e\u003chttps://www.google.com/url?q\u003dhttp://meetedgar.com/careers\u0026sa\u003dD\u0026ust\u003d1486505655498000\u0026usg\u003dAFQjCNHMt_Xi95PgQZkf4yG0GMfVYZrG-A\u003e\u003cbr /\u003e.\u003cbr /\u003e\u003cbr /\u003eYou\u0027ll be working during normal US business hours, Monday through Friday. This \u003cbr /\u003eis a stable job and we\u0027re looking for someone to grow with us long term. Please \u003cbr /\u003edo not apply unless this sounds like your DREAM JOB. We’ll get back to you if \u003cbr /\u003ewe think you might be our DREAM designer-developer-wizard combo!\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eName Відповідь на це запитання обов’язкова Email Відповідь на це запитання \u003cbr /\u003eобов’язкова Phone number Відповідь на це запитання обов’язкова Location (North \u003cbr /\u003eAmerican applicants only, please!) Відповідь на це запитання обов’язкова Link \u003cbr /\u003eto your portfolio Відповідь на це запитання обов’язкова What applications do \u003cbr /\u003eyou use daily in your work? Відповідь на це запитання обов’язкова What are a \u003cbr /\u003efew of your favorite development tools and why? Відповідь на це запитання \u003cbr /\u003eобов’язкова Link to a design that you\u0027ve created (screenshots are ok!) that you \u003cbr /\u003ethink matches our style, and tell us why: Відповідь на це запитання обов’язкова \u003cbr /\u003eLink to a page on our company\u0027s website that you can\u0027t WAIT to get your hands \u003cbr /\u003eon to redesign. What would you change? Why? Відповідь на це запитання \u003cbr /\u003eобов’язкова Why are you the best person EVER for this job? Відповідь на це \u003cbr /\u003eзапитання обов’язкова Salary Requirement Відповідь на це запитання обов’язкова \u003cbr /\u003eНіколи не вказуйте паролі в Google Формах. Технології Google Форми \u003cbr /\u003e\u003chttps://www.google.com/forms/about/?utm_source\u003dproduct\u0026utm_medium\u003dforms_logo\u0026utm_campaign\u003dforms\u003e\u003cbr /\u003eЦю форму створено в домені MeetEdgar. \u003cbr /\u003eПовідомити про порушення \u003cbr /\u003e\u003chttps://docs.google.com/forms/d/e/1FAIpQLSdfndC4YqPjQ63zTJpKvDZCcph2D96MTGlQlnWFyYGnj1t81w/reportabuse?source\u003dhttps://docs.google.com/forms/d/e/1FAIpQLSdfndC4YqPjQ63zTJpKvDZCcph2D96MTGlQlnWFyYGnj1t81w/viewform\u003e\u003cbr /\u003e -Умови надання служби \u003chttp://www.google.com/accounts/TOS\u003e - Додаткові \u003cbr /\u003eположення \u003chttp://www.google.com/google-d-s/terms.html\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "jobs.remotive.io",
    "url": "http://www.aha.io/company/careers/current-openings/ux_designer_us",
    "title": "UX Designer at Aha, Anywhere (U.S.), product",
    "content": "UX Designer | Aha!  \u003c\u003e  Log in \u003chttps://secure.aha.io/session/new\u003e  \u003c\u003e \u003cbr /\u003e * PRODUCT \u003c\u003e \u003cbr /\u003e * Benefits \u003c\u003e \u003cbr /\u003e * Features \u003c\u003e \u003cbr /\u003e * Integrations \u003c\u003e \u003cbr /\u003e * Where Aha! fits \u003c\u003e \u003cbr /\u003e * ROADMAPS \u003c\u003e \u003cbr /\u003e * Product roadmap \u003c\u003e \u003cbr /\u003e * Technology roadmap \u003c\u003e \u003cbr /\u003e * Consulting roadmap \u003c\u003e \u003cbr /\u003e * Manufacturing roadmap \u003c\u003e \u003cbr /\u003e * Marketing roadmap \u003c\u003e \u003cbr /\u003e * PRICING \u003c\u003e \u003cbr /\u003e * CUSTOMERS \u003c\u003e \u003cbr /\u003e * Success stories \u003c\u003e \u003cbr /\u003e * Love \u003c\u003e \u003cbr /\u003e * CAREERS \u003c\u003e \u003cbr /\u003e * Love your job \u003c\u003e \u003cbr /\u003e * Culture \u003c\u003e \u003cbr /\u003e * Current openings \u003c\u003e \u003cbr /\u003e * About us \u003c\u003e \u003cbr /\u003e * Company history \u003c\u003e \u003cbr /\u003e * Responsive method \u003c\u003e \u003cbr /\u003e * Blog \u003chttp://blog.aha.io/\u003e \u003cbr /\u003e * Forum \u003chttps://www.roadmap.com/?ref\u003dnav\u003e \u003cbr /\u003e * Ideas \u003chttps://big.ideas.aha.io/\u003e \u003cbr /\u003e * Support \u003chttp://support.aha.io/\u003e Start a FREE Trial \u003c\u003e  Log in \u003cbr /\u003e\u003chttps://secure.aha.io/session/new\u003e \u003cbr /\u003eUX Designer\u003cbr /\u003e\u003cbr /\u003eAnywhere in the United States\u003cbr /\u003e\u003cbr /\u003eProduct\u003cbr /\u003e\u003cbr /\u003eAre you a user experience star looking to revolutionize the way people \u003cbr /\u003einnovate and build software? Do you want to help design something that is \u003cbr /\u003echanging the way people think about innovation? We are looking for a high \u003cbr /\u003eenergy, hands on UX designer who is looking to take a huge career leap forward \u003cbr /\u003e– and jump on a rocket. If this is you, we want to hear from you!\u003cbr /\u003e\u003cbr /\u003eAs a UX Designer, you will have an excellent opportunity to join a \u003cbr /\u003ebreakthrough and profitable company that is growing fast. Aha! was founded by a \u003cbr /\u003eproven team of Silicon Valley veterans whose last two companies were acquired \u003cbr /\u003eby Aruba Networks [ARUN] and Citrix [CTXS] respectively. Over 50,000 users \u003cbr /\u003etrust Aha! for their product strategy and roadmaps.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for someone who: \u003cbr /\u003e\u003cbr /\u003e * Is experienced in UX design for SaaS applications \u003cbr /\u003e * Enjoys crossing back and forth between UX and graphic design \u003cbr /\u003e * Understands product management and can understand user behaviors and \u003cbr /\u003emotivations \u003cbr /\u003e * Loves to create wireframes and mockups and refine them based on team input \u003cbr /\u003e * Wants to have ownership and responsibility of key work and measure the \u003cbr /\u003esuccess of new designs \u003cbr /\u003eWe are committed to being great, and we want someone who: \u003cbr /\u003e\u003cbr /\u003e * Can work at a fast-paced company where the feedback cycle is measured in \u003cbr /\u003ehours rather than weeks \u003cbr /\u003e * Has a \"get it done\" attitude and a background of delivering beautiful work \u003cbr /\u003eagain and again \u003cbr /\u003e * Is seeking a career-defining opportunity and a proven, results-oriented \u003cbr /\u003eteam which has sold multiple software companies \u003cbr /\u003e We are building a distributed team and you can work from anywhere in the \u003cbr /\u003eUnited States for this role. We offer generous salary, equity, benefits, and a \u003cbr /\u003eprofit sharing program to the right candidates. \u003cbr /\u003e\u003cbr /\u003eFor immediate consideration, please follow these helpful guidelines \u003cbr /\u003e\u003chttp://blog.aha.io/index.php/use-these-cover-letters-that-ceos-read/\u003e and \u003cbr /\u003econtact us atamy@aha.io \u003cmailto:amy@aha.io\u003e. If you have the right background \u003cbr /\u003ewe will quickly follow up with you. We are not working with recruiters or third \u003cbr /\u003eparty agencies.\u003cbr /\u003e\u003cbr /\u003e« Back to all job listings \u003c\u003e\u003cbr /\u003e\u003cbr /\u003e * Product \u003c\u003e \u003cbr /\u003e * Benefits \u003c\u003e \u003cbr /\u003e * Features \u003c\u003e \u003cbr /\u003e * Pricing \u003c\u003e \u003cbr /\u003e * Security \u003c\u003e \u003cbr /\u003e * Roadmapping software \u003c\u003e \u003cbr /\u003e * Where Aha! fits \u003c\u003e \u003cbr /\u003e * Product lovability tool \u003c\u003e \u003cbr /\u003e * Product management guide \u003c\u003e \u003cbr /\u003e * Careers \u003c\u003e \u003cbr /\u003e * About \u003c\u003e \u003cbr /\u003e * History \u003c\u003e \u003cbr /\u003e * Support \u003chttp://support.aha.io/\u003e \u003cbr /\u003e * Blog \u003chttp://blog.aha.io/\u003e \u003cbr /\u003eCONTACT US\u003cbr /\u003e\u003cbr /\u003e * Contact form \u003c\u003e \u003cbr /\u003e *   support@aha.io \u003cmailto:support@aha.io\u003e \u003cbr /\u003e *   1-888-926-2240 \u003c\u003e \u003cbr /\u003eCONNECT\u003cbr /\u003eFollow @aha_io \u003chttps://twitter.com/aha_io\u003e © 2017 Aha! Labs Inc. All rights \u003cbr /\u003ereserved Developer API \u003c\u003e  /  Privacy policy \u003c\u003e  /  Terms of service \u003c\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "jobs.remotive.io",
    "url": "http://www.aha.io/company/careers/current-openings/graphic_designer_us",
    "title": "Graphic Designer at Aha, Anywhere (U.S.), product",
    "content": "Graphic Designer | Aha!  \u003c\u003e  Log in \u003chttps://secure.aha.io/session/new\u003e  \u003c\u003e \u003cbr /\u003e * PRODUCT \u003c\u003e \u003cbr /\u003e * Benefits \u003c\u003e \u003cbr /\u003e * Features \u003c\u003e \u003cbr /\u003e * Integrations \u003c\u003e \u003cbr /\u003e * Where Aha! fits \u003c\u003e \u003cbr /\u003e * ROADMAPS \u003c\u003e \u003cbr /\u003e * Product roadmap \u003c\u003e \u003cbr /\u003e * Technology roadmap \u003c\u003e \u003cbr /\u003e * Consulting roadmap \u003c\u003e \u003cbr /\u003e * Manufacturing roadmap \u003c\u003e \u003cbr /\u003e * Marketing roadmap \u003c\u003e \u003cbr /\u003e * PRICING \u003c\u003e \u003cbr /\u003e * CUSTOMERS \u003c\u003e \u003cbr /\u003e * Success stories \u003c\u003e \u003cbr /\u003e * Love \u003c\u003e \u003cbr /\u003e * CAREERS \u003c\u003e \u003cbr /\u003e * Love your job \u003c\u003e \u003cbr /\u003e * Culture \u003c\u003e \u003cbr /\u003e * Current openings \u003c\u003e \u003cbr /\u003e * About us \u003c\u003e \u003cbr /\u003e * Company history \u003c\u003e \u003cbr /\u003e * Responsive method \u003c\u003e \u003cbr /\u003e * Blog \u003chttp://blog.aha.io/\u003e \u003cbr /\u003e * Forum \u003chttps://www.roadmap.com/?ref\u003dnav\u003e \u003cbr /\u003e * Ideas \u003chttps://big.ideas.aha.io/\u003e \u003cbr /\u003e * Support \u003chttp://support.aha.io/\u003e Start a FREE Trial \u003c\u003e  Log in \u003cbr /\u003e\u003chttps://secure.aha.io/session/new\u003e \u003cbr /\u003eGraphic Designer\u003cbr /\u003e\u003cbr /\u003eAnywhere in the United States\u003cbr /\u003e\u003cbr /\u003eProduct\u003cbr /\u003e\u003cbr /\u003eDo you want to help design software that is changing the way people innovate \u003cbr /\u003eand build products? We are looking for a high-energy, hands-on graphic designer \u003cbr /\u003ewho is ready to take a huge career leap forward -- and jump on a rocket. If \u003cbr /\u003ethis is you, we want to hear from you!\u003cbr /\u003e\u003cbr /\u003eAs a Graphic Designer, you will have an excellent opportunity to join a \u003cbr /\u003ebreakthrough and profitable company that is growing fast. Aha! was founded by a \u003cbr /\u003eproven team of Silicon Valley veterans whose last two companies were acquired \u003cbr /\u003eby Aruba Networks [ARUN] and Citrix [CTXS] respectively. Over 50,000 users \u003cbr /\u003etrust Aha! for their product strategy and roadmaps.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for someone who: \u003cbr /\u003e\u003cbr /\u003e * Likely has a degree in art or design \u003cbr /\u003e * Is exceptionally motivated and creative \u003cbr /\u003e * Has experience working with B2B software businesses \u003cbr /\u003e * Loves to create wireframes and mockups and refine them based on team input \u003cbr /\u003e * Enjoys crossing back and forth between graphic design and UX \u003cbr /\u003e * Aims for pixel-perfect final designs every time \u003cbr /\u003eThe graphic designer will be responsible for: \u003cbr /\u003e\u003cbr /\u003e * Concept development and ideation of visual designs \u003cbr /\u003e * Website layouts across desktop and mobile devices \u003cbr /\u003e * Digital and social media branding campaigns \u003cbr /\u003e * Creation of designs for advertising banners and email marketing \u003cbr /\u003eWe are committed to being great, and we want someone who: \u003cbr /\u003e\u003cbr /\u003e * Can work at a fast-paced company where the feedback cycle is measured in \u003cbr /\u003ehours rather than weeks \u003cbr /\u003e * Has a \"get it done\" attitude and a background of delivering superb work \u003cbr /\u003eagain and again \u003cbr /\u003e * Is seeking a career-defining opportunity and a proven, results-oriented \u003cbr /\u003eteam which has sold multiple software companies \u003cbr /\u003e We are building a distributed team and you can work from anywhere in the \u003cbr /\u003eUnited States for this role. We offer generous salary, equity, benefits, and a \u003cbr /\u003eprofit sharing program to the right candidates. \u003cbr /\u003e\u003cbr /\u003eFor immediate consideration, please follow these helpful guidelines \u003cbr /\u003e\u003chttp://blog.aha.io/index.php/use-these-cover-letters-that-ceos-read/\u003e and \u003cbr /\u003econtact us atamy@aha.io \u003cmailto:amy@aha.io\u003e. If you have the right background \u003cbr /\u003ewe will quickly follow up with you. We are not working with recruiters or third \u003cbr /\u003eparty agencies.\u003cbr /\u003e\u003cbr /\u003e« Back to all job listings \u003c\u003e\u003cbr /\u003e\u003cbr /\u003e * Product \u003c\u003e \u003cbr /\u003e * Benefits \u003c\u003e \u003cbr /\u003e * Features \u003c\u003e \u003cbr /\u003e * Pricing \u003c\u003e \u003cbr /\u003e * Security \u003c\u003e \u003cbr /\u003e * Roadmapping software \u003c\u003e \u003cbr /\u003e * Where Aha! fits \u003c\u003e \u003cbr /\u003e * Product lovability tool \u003c\u003e \u003cbr /\u003e * Product management guide \u003c\u003e \u003cbr /\u003e * Careers \u003c\u003e \u003cbr /\u003e * About \u003c\u003e \u003cbr /\u003e * History \u003c\u003e \u003cbr /\u003e * Support \u003chttp://support.aha.io/\u003e \u003cbr /\u003e * Blog \u003chttp://blog.aha.io/\u003e \u003cbr /\u003eCONTACT US\u003cbr /\u003e\u003cbr /\u003e * Contact form \u003c\u003e \u003cbr /\u003e *   support@aha.io \u003cmailto:support@aha.io\u003e \u003cbr /\u003e *   1-888-926-2240 \u003c\u003e \u003cbr /\u003eCONNECT\u003cbr /\u003eFollow @aha_io \u003chttps://twitter.com/aha_io\u003e © 2017 Aha! Labs Inc. All rights \u003cbr /\u003ereserved Developer API \u003c\u003e  /  Privacy policy \u003c\u003e  /  Terms of service \u003c\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "jobs.remotive.io",
    "url": "https://www.knackhq.com/jobs/#home/apply/5420897dd3385df425055419",
    "title": "Front-end Dev/Designer at Knack, US remote, product",
    "content": "Knack Careers Knack - easy online database \u003c\u003e \u003cbr /\u003e * FEATURES \u003c\u003e \u003cbr /\u003e * TEMPLATES \u003c\u003e \u003cbr /\u003e * CUSTOMERS \u003c\u003e \u003cbr /\u003e * PLANS \u003c\u003e \u003cbr /\u003e * FREE TRIAL \u003chttps://builder.knack.com/#register\u003e \u003cbr /\u003e * About Knack \u003c\u003e \u003cbr /\u003e * Contact \u003c\u003e \u003cbr /\u003e * Support \u003chttps://support.knack.com/\u003e \u003cbr /\u003e * Blog \u003c\u003e \u003cbr /\u003e * User Login \u003chttps://builder.knack.com\u003e \u003cbr /\u003e Online Database Software for Easy Database Creation  \u003c\u003e \u003cbr /\u003e\u003cbr /\u003e * Features \u003c\u003e \u003cbr /\u003e * Templates \u003c\u003e \u003cbr /\u003e * Customers \u003c\u003e \u003cbr /\u003e * Plans \u003c\u003e \u003cbr /\u003e * Free Trial \u003chttps://builder.knack.com/#register\u003e \u003cbr /\u003eJoin the Knack Team\u003cbr /\u003e Please check all that apply:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e * I want to have a major impact.\u003cbr /\u003e * I want to work in a fun, remote environment with a great team of genuinely \u003cbr /\u003enice people.\u003cbr /\u003e * I want to help build an exciting product loved by thousands of users.\u003cbr /\u003e * I want to go as far as my ambition will let me.4 for 4? Then you\u0027re exactly \u003cbr /\u003ewho we want to talk to. Apply below and join us!\u003cbr /\u003e\u003cbr /\u003eLoading Jobs... \u003cbr /\u003eJobs \u003c\u003e\u003cbr /\u003e\u003cbr /\u003e * Senior Developer \u003cbr /\u003e\u003chttps://www.knack.com/jobs/#home/apply/54207f67d3385df425054caa/\u003e \u003cbr /\u003e * Systems Engineer \u003cbr /\u003e\u003chttps://www.knack.com/jobs/#home/apply/542082c0d3385df425054ce0\u003e \u003cbr /\u003e * Front-end Designer/Developer \u003cbr /\u003e\u003chttps://www.knack.com/jobs/#home/apply/5420897dd3385df425055419\u003e \u003cbr /\u003e * Customer Success \u003cbr /\u003e\u003chttps://www.knack.com/jobs/#home/apply/5420864cd3385df425054e8c\u003e \u003cbr /\u003e * Junior Developer \u003cbr /\u003e\u003chttps://www.knack.com/jobs/#home/apply/5788efd51f4a9d9947f3e818\u003e \u003cbr /\u003e * Product \u003cbr /\u003e * Feature Tour \u003c\u003e \u003cbr /\u003e * Example Apps \u003c\u003e \u003cbr /\u003e * Pricing \u003c\u003e \u003cbr /\u003e * Security \u0026 Infrastructure \u003c\u003e \u003cbr /\u003e * Online Database Features \u003c\u003e \u003cbr /\u003e * Knack \u003cbr /\u003e * About Us \u003c\u003e \u003cbr /\u003e * Careers \u003c\u003e \u003cbr /\u003e * Testimonials \u003c\u003e \u003cbr /\u003e * Solutions \u003c\u003e \u003cbr /\u003e * Partner with Knack \u003c\u003e \u003cbr /\u003e * Who Uses Knack \u003c\u003e \u003cbr /\u003e * For Customers \u003cbr /\u003e * Log In \u003chttps://builder.knack.com/\u003e \u003cbr /\u003e * Knowledge Base \u003chttps://support.knack.com\u003e \u003cbr /\u003e * Community Forum \u003chttps://support.knack.com/hc/en-us/community/topics\u003e \u003cbr /\u003e * Builder Network \u003c\u003e \u003cbr /\u003e * API Documentation \u003chttps://docs.knack.com\u003e \u003cbr /\u003e * Legal \u003cbr /\u003e * Terms Of Service \u003c\u003e \u003cbr /\u003e * Privacy Statement \u003c\u003e \u003cbr /\u003e * Terms Of Use \u003c\u003e \u003cbr /\u003e * Acceptable Use Policy \u003c\u003e \u003cbr /\u003e * Safe Harbor \u003c\u003e \u003cbr /\u003e * Connect \u003cbr /\u003e * Contact Us \u003c\u003e \u003cbr /\u003e * Newsletter Sign Up \u003cbr /\u003e\u003chttp://knackhq.us5.list-manage.com/subscribe?u\u003d456f4cc6ab895fbaa65374b3e\u0026id\u003df842f7811d\u003e\u003cbr /\u003e * Blog \u003c\u003e \u003cbr /\u003e * Twitter \u003chttps://twitter.com/knackhq/\u003e \u003cbr /\u003e * \u003cbr /\u003e * the simple online database and web app builder.\u003cbr /\u003e * © 2017, all rights reserved Try a totally free 14-day trial. No credit card \u003cbr /\u003erequired.Get Started \u003c\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13542099",
    "title": "Namely | Senior Product Designer | New York, NY - Full Time",
    "content": "Namely | Senior Product Designer | New York, NY - Full Time\u003cbr /\u003eAs Senior Product Designer, you will work collaboratively with engineers, \u003cbr /\u003eproduct managers, stakeholders, and other designers. You’ll have direct impact \u003cbr /\u003eon Namely’s business through design ownership of every aspect of Namely’s \u003cbr /\u003eplatform (think payroll, benefits, performance, mobile, social, and many more \u003cbr /\u003eways to build a better HR platform). You will be integral in solving problems \u003cbr /\u003eand building tools for our clients that innovate and improve the user \u003cbr /\u003eexperience on our platform.\u003cbr /\u003e\u003cbr /\u003eResponsibilities: * Collaborate with Product Managers, engineers, and other \u003cbr /\u003emembers of the design team to create user-centered design solutions for \u003cbr /\u003eNamely’s products * Conduct user research, testing, analysis to drive design \u003cbr /\u003edecisionsOwn the end-to-end design process, from wireframes to high-fidelity \u003cbr /\u003emockups, and the implementation of those designs with front-end engineers * \u003cbr /\u003eExecute simple and beautiful design that combines intuitive UX with fine visual \u003cbr /\u003edetails into a cohesive product that’s so good, you can’t help but brag about \u003cbr /\u003eit (even though you’re typically a pretty humble person) * Help define and \u003cbr /\u003eexecute a style guide for the entire platform’s UI * Demonstrate and \u003cbr /\u003ecommunicate designs across departments and stakeholders with clarity and \u003cbr /\u003econviction. And other cool words that start with “C.” * Grow your design chops \u003cbr /\u003ein a collaborative team bursting with talented product designers\u003cbr /\u003e\u003cbr /\u003eRequirements: * A strong understanding of user-centered design methods and \u003cbr /\u003eprinciples * Ability to prioritize and work effectively on multiple projects in \u003cbr /\u003ea collaborative team of designers, product managers, and developers * Fluency \u003cbr /\u003ein Sketch, Zeplin, and prototyping with a tool such as Invision * 3-5 years of \u003cbr /\u003eexperience as a user experience designer, interaction designer, or similar \u003cbr /\u003eUX-related role with accompanying experience in visual/graphic design * Strong \u003cbr /\u003eability to communicate your design vision through verbal and written \u003cbr /\u003eexplanation, sketching, or quick mock ups to small or large groups, from \u003cbr /\u003edesigners to executives * A tendency to roll your eyes when job descriptions \u003cbr /\u003euse words like \"rock star designer\", \"intuitive design sensibility”, or \"expert \u003cbr /\u003ein Photoshop\" since, you know, duh\u003cbr /\u003e\u003cbr /\u003eNice to Have: * Experience working on SAAS products, or products in the HR \u003cbr /\u003espace * Experience designing analytical dashboards and/or data visualizations\u003cbr /\u003e\u003cbr /\u003eIf you have a natural inclination to simplify and bring order to complex data \u003cbr /\u003esets this is your chance.\u003cbr /\u003e\u003cbr /\u003ePlease feel free to reach out to me directly at john@grayscalable.com\u003cbr /\u003e\u003cbr /\u003ehttps://www.namely.com/jobs/?gh_jid\u003d564142 \u003cbr /\u003e\u003chttps://www.namely.com/jobs/?gh_jid\u003d564142\u003e \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 6:33:04 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/54134/design-genius-at-myrecovery/",
    "title": "Design Genius",
    "content": "At myrecovery we solve real-world problems and build technology that will transform the delivery of surgery on a global scale.\u003cbr /\u003e\u003cbr /\u003eMaking it safe, sustainable and universally accessible, through empowering patients, unleashing the power of mobile apps, data science and machine learning.\u003cbr /\u003e\u003cbr /\u003eWe work with patients, leading surgeons, hospitals, academic institutions and elite-level physiotherapists across the UK, Europe and the US.\u003cbr /\u003e\u003cbr /\u003eWe have previously been working with a design agency to help us build out our mobile app (native iOS, Android) and web products. We now want to hire a multi-talented designer who can contribute to product design, UX/UI, graphic design and branding. We are open to all levels of seniority in terms of years’ experience – ability and spark are most important. You would have a very degree of ownership of the design function across the company.\u003cbr /\u003e\u003cbr /\u003eThe designer will have the following responsibilities:\u003cbr /\u003e\u003cbr /\u003e* Ownership of the UX and UI design of all myrecovery products, mobile and web\u003cbr /\u003e* Working closely with the co-founders and CTO to validate product ideas \u003cbr /\u003e* Working with leading surgeons and expert pateints\u003cbr /\u003e* Delivery of wireframes, mockups and production assets for mobile and web\u003cbr /\u003e* Championing the user at all times\u003cbr /\u003e\u003cbr /\u003eThe following skills/experience are required:\u003cbr /\u003e\u003cbr /\u003e* Strong understanding of product design process\u003cbr /\u003e* Strong experience of native mobile UX (iOS, Android)\u003cbr /\u003e* Strong experience of responsive web UX\u003cbr /\u003e* Skilled in modern design tools to deliver wireframes, mockups and production assets for mobile and web\u003cbr /\u003e\u003cbr /\u003eSalary: Very competitive, depending on experience.\u003cbr /\u003e\u003cbr /\u003eBenefits:\u003cbr /\u003e\u003cbr /\u003e* 25 days paid holiday\u003cbr /\u003e* Employee share options\u003cbr /\u003e* Great working environment in our modern, private Highbury office\u003cbr /\u003e* Annual budget for learning and development\u003cbr /\u003e\u003cbr /\u003ePLEASE NOTE THAT WE CAN ONLY PURSUE AN INTERVIEW PROCESS WITH APPLICANTS ALREADY RESIDENT IN THE UK. IF YOU ARE NOT RESIDENT IN THE UK PLEASE DO NOT APPLY, AS WE WILL NOT BE ABLE TO PROCESS YOUR APPLICATION.",
    "urlFetchPending": false,
    "published": "Feb 8, 2017 2:23:08 PM",
    "tags": [
      "REMOTE2/locals-only",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/54106/lead-designer-at-carcela/",
    "title": "Lead Designer",
    "content": "Carcela is a peer-to-peer serviced marketplace for used vehicles. An evolution of the car buying and selling experience.\u003cbr /\u003e\u003cbr /\u003eCarcela will disrupt the £50 billion UK used car market, currently dominated by dealers making massive margins at the expense of the consumer. \u003cbr /\u003eBuying and selling privately is an alternative but few people have the time, and the hassle is unequivocal. \u003cbr /\u003eCarcela is to rejuvenate the industry, changing the way individuals buy and sell cars. \u003cbr /\u003eOut with the old, and in with the new as the removal of the car salesmen is replaced with a simple, transparent and trustworthy process that offers a better price and a better service to buyers and sellers by cutting out the middleman. \u003cbr /\u003eThis is a unique opportunity to be involved, from inception, in one of the most exciting and ambitious peer-to-peer marketplaces to date.\u003cbr /\u003e\u003cbr /\u003eWe’re seeking a Lead Designer to create and deliver this vision for disrupting the used car market. You’ll be great at making, experimenting and testing, and you’ll get a kick when you see things go live and people using your product. Most importantly, you’re someone who enjoys working in small, energetic teams to create products and services that people love to use.\u003cbr /\u003e\u003cbr /\u003eREQUIREMENTS\u003cbr /\u003e\u003cbr /\u003eWho you are:\u003cbr /\u003e\u003cbr /\u003eAn audacious avid designer with a background in research and interaction design, but competent helping out across other disciplines. Mastery is not expected, but strategic initiative and competence are an obligation of a lead designer.\u003cbr /\u003eWe expect you to bring a breadth of skills. \u003cbr /\u003eAs we build out the team over the next year, you will help cultivate the type of individuals we bring in to build an awesome product team.\u003cbr /\u003e\u003cbr /\u003eYou might have worked at agencies, start-ups or even big, scaled products, and you\u0027re great at taking an idea or insight and capitalising and converting it into a new product, service or feature. You’re comfortable working closely with developers, and you love seeing the output of your work in the hands of users, even better when it’s on a big scale.\u003cbr /\u003e\u003cbr /\u003eYou’re experienced enough to work across a broad set of design disciplines and help shape and define our processes, but enthusiastic enough to roll your sleeves up and spend your time in the trenches of your time designing.\u003cbr /\u003e\u003cbr /\u003eWhat you’ll do\u003cbr /\u003e\u003cbr /\u003eYou’ll be responsible (initially at least) for all areas of the Carcela\u0027s experience. This is an interesting design challenge that spans multiple touch-points including web, mobile, customer service and physical car delivery/collection. We’re a small team and we’ll be applying a very lean, ‘just enough’ mentality; just enough research to inform the design, just enough design to make something, just enough of a product to test…\u003cbr /\u003e\u003cbr /\u003eWe’ll be running a pilot in Q2 this year which you’ll be actively involved in. You’ll develop a deep understanding of who our customers are and what they need through customer interviews and usability testing. You’ll be responsible for conceptualising, testing and implementing new features. One week you might be looking at what mental models people have when they search for cars, and how this translates to product navigation. Another week you might be looking at how we integrate an insurance offering into the service or seeing how we can remove pain points associated with car delivery to maintain our streamlined, semi-automated systems.\u003cbr /\u003e\u003cbr /\u003eTl;dr\u003cbr /\u003e\u003cbr /\u003e-An opportunity to join a well-backed start-up, lead by renowned, and accomplished personnel.\u003cbr /\u003e-It’s a brilliant customer proposition that offers better value and service to the consumer\u003cbr /\u003e-We’re looking for an all-round designer that is looking to create and simultaneously shape our team and processes.\u003cbr /\u003e-You will be making key decisions related to the product - there is no client or Creative Director to answer to. You are the head-honcho!\u003cbr /\u003e-This is a mass-market service that your friends and family will use\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eBENEFITS\u003cbr /\u003e-Fast paced start-up experience at a company looking to disrupt a massive market\u003cbr /\u003e-Work with a small high-performance team who will fight beside you to accomplish the amazing\u003cbr /\u003e-Opportunity to have a say in the business direction from the very start\u003cbr /\u003e-Competitive salary with equity in the business on offer",
    "urlFetchPending": false,
    "published": "Feb 8, 2017 2:41:17 AM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/54185/ui-ux-asset-creation-projects-at-orderella/",
    "title": "UI / UX Asset Creation Projects",
    "content": "Orderella is a mobile ordering and payment platform. We basically let you order drinks + food from various pubs + restaurants in the UK, Ireland, Singapore and New Zealand. Soon to also be expanding to more locations. \u003cbr /\u003e\u003cbr /\u003eWe are in need for a creative designer to work on creating specified mobile app assets \u0026 marketing material. This is a unique opportunity to make a quick and real impact on the business. \u003cbr /\u003e\u003cbr /\u003eWe are a small team on Goodge Street, but the work can be done anywhere you feel comfortable... At home, in the office or both! Although it would be ideal to have infrequent briefs in person.  As the work is not really fulltime, the right candidate could potentially use this opportunity to increase their income / portfolio. \u003cbr /\u003e\u003cbr /\u003eExperience / knowledge of : \u003cbr /\u003e\u003cbr /\u003e- Photoshop / preferred design tool\u003cbr /\u003e- Understanding of mobile design practices. ie iOS asset sizes for retina displays etc / iOS screen\u003cbr /\u003e- An eye for beautiful interfaces / app design  \u003cbr /\u003e- creating banners / posters / marketing campaign material \u003cbr /\u003e- Able to work fast and efficiently \u003cbr /\u003e\u003cbr /\u003eBenefits / Perks \u003cbr /\u003e- Free drinks in central london using our app! \u003cbr /\u003e- Independent working environment - with lots of freedom and creative control. \u003cbr /\u003e- Quick frequent work - potential to develop an ongoing relationship for future projects / missions. \u003cbr /\u003e- Be part of a streamlined / efficient team that can make decisions quickly.  ",
    "urlFetchPending": false,
    "published": "Feb 9, 2017 3:26:34 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/100",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/131278/software-designer-business-analyst-fresnel-software?a\u003dI1E8i96WV8Y",
    "title": "Software Designer/Business Analyst at Fresnel Software (Calgary, AB, Canada) (allows remote)",
    "content": "We are looking for experienced software developers that are passionate about \u003cbr /\u003edeveloping great software and have experience working with GIS and/or CAD \u003cbr /\u003esystems. This position is open to remote or on site working locations.\u003cbr /\u003e\u003cbr /\u003eThings you will do: \u003cbr /\u003e\u003cbr /\u003e• Develop intuitive, usable, and engaging interactions and visual designs for \u003cbr /\u003emobile and the web\u003cbr /\u003e\u003cbr /\u003e• Participate in the development process from definition, through design, \u003cbr /\u003ebuild, test, release, and maintenance\u003cbr /\u003e\u003cbr /\u003e• Contribute to the design of an engineering web application\u003cbr /\u003e\u003cbr /\u003e• Contribute to connecting the world with high speed fiber networks\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eThings you should know: \u003cbr /\u003e\u003cbr /\u003e• Design of complex task driven workflow software\u003cbr /\u003e\u003cbr /\u003e• Recognize and predict use-cases and user interaction, including happy path, \u003cbr /\u003eedge and corner cases, and incorporate them into designs\u003cbr /\u003e\u003cbr /\u003e• UI patterns for effective user experiences on the web and mobile devices\u003cbr /\u003e\u003cbr /\u003e• Break any design problem down into viable actionable chunks and solve them \u003cbr /\u003ewith clarity and precision\u003cbr /\u003e\u003cbr /\u003e• Human centered design\u003cbr /\u003e\u003cbr /\u003e• Flowcharting application workflows\u003cbr /\u003e\u003cbr /\u003e• Rapid mockup design\u003cbr /\u003e\u003cbr /\u003eWould be great if you knew something about: \u003cbr /\u003e\u003cbr /\u003e• Graphic design, typography, intuitive layouts and palate development\u003cbr /\u003e\u003cbr /\u003e• HTML 5, javascript and CSS \u003cbr /\u003e\u003cbr /\u003e• CAD systems\u003cbr /\u003e\u003cbr /\u003e• GIS systems\u003cbr /\u003e\u003cbr /\u003e About Fresnel Software \u003cbr /\u003e\u003cbr /\u003eWe are already writing the first chapters of our book (including a \"title\" \u003cbr /\u003echange as we work through international trademark strategy--look for the new \u003cbr /\u003ename in early 2017), and we know we are going to have an amazing story. As a \u003cbr /\u003ebrand new startup, our web page is little more than a brochure for now, but our \u003cbr /\u003eonline, first impression will improve. Seed funding is in place and we will \u003cbr /\u003ehave completed our first round capital raise by the first quarter of 2017.\u003cbr /\u003e\u003cbr /\u003e Our development team is being built with great developers, designers and QA\u0027s \u003cbr /\u003ewho are passionate about building great software.  Our goal is to have 4 to 5 \u003cbr /\u003eteams of developers, and the priority we place on quality will be realized by a \u003cbr /\u003edeveloper to QA ratio of 3:1. \u003cbr /\u003e\u003cbr /\u003eWhat we offer:\u003cbr /\u003e\u003cbr /\u003e * Vibrant, dynamic and fast moving work environment, where you will be able \u003cbr /\u003eto grow as we grow \u003cbr /\u003e * Flexibility to set your own way of working and schedules \u003cbr /\u003e * Small, interesting and inspiring team working in a Values-based culture. \u003cbr /\u003e * The chance to make an impact on the way this amazing technology is \u003cbr /\u003edeveloping \u003cbr /\u003e * Comprehensive employee salary and benefits package \u003cbr /\u003eJoel Test score: 10 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? apply now \u003c\u003e  more jobs at Fresnel \u003cbr /\u003eSoftware \u003c\u003e \u003cbr /\u003eJoin us at Fresnel Software\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eEmployee Life Insurance Dependent Life Insurance Long Term Disability Extended \u003cbr /\u003eHealth Dental Care \u003cbr /\u003eLearn more about Fresnel Software \u003c\u003e more jobs at Fresnel Software \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/fresnel-software?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "REMOTE2/America",
      "TECH2/gis",
      "TECH2/angular2",
      "REMOTE1/50",
      "TECH2/html5",
      "TITLE1/designer",
      "TECH2/wireframe",
      "TECH2/design"
    ]
  },
  {
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28676?r\u003drss2",
    "title": "Fulcrum Mobile Solutions: Web/ Front End Designer",
    "content": "Full-time\u003cbr /\u003e\u003cbr /\u003e(St. Petersburg, FL) \u003cbr /\u003e\u003cbr /\u003eThis position requires you to work well with others, think creatively yet \u003cbr /\u003eremain practical, handle criticism with grace, and stand your ground when your \u003cbr /\u003eideas are worth fighting for. We take pride in being an industry leader in both \u003cbr /\u003edesign aesthetics and user experience, and every designer we hire must strive \u003cbr /\u003eto continue in that tradition. While maintaining brand integrity is important, \u003cbr /\u003ecreative freedom and exploration is highly encouraged. Your skills should be \u003cbr /\u003epolished but don’t have to be perfect. Personal character and commitment to \u003cbr /\u003eimprovement are top priorities in our neck of the woods.\u003cbr /\u003e\u003cbr /\u003eRoles \u0026 Responsibilities\u003cbr /\u003e\u003cbr /\u003e * Create original designs for marketing materials such as websites, logos, \u003cbr /\u003ebrochures, business cards, and large format trade show banners \u0026 pull-ups\u003cbr /\u003e * Design ad units for web and social advertising campaigns\u003cbr /\u003e * Create custom graphics for blog posts, newsletters, and customer success \u003cbr /\u003ecampaigns, adding to library of reusable assets\u003cbr /\u003e * Maintain the look and feel of company branding\u003cbr /\u003e * Apply user-centered design process to create high quality user experiences \u003cbr /\u003efor mobile and web products\u003cbr /\u003e * Contribute to the Fulcrum Blog whenever possible\u003cbr /\u003e * Assist in copywriting for marketing materials when needed \u0026 copy editing \u003cbr /\u003eproduct marketing materials and blog posts\u003cbr /\u003e * Stay up-to-date on the latest design trends, tools, and technologies (e.g. \u003cbr /\u003eGitHub Pages, Flexbox, etc).\u003cbr /\u003e * Stay in continuous contact with product, marketing, engineering, and \u003cbr /\u003eintegration teams to gather design requirements for time management purposes\u003cbr /\u003e * Work with engineering team on design UI / UX for mobile applications \u003cbr /\u003e(Android, iOS)\u003cbr /\u003eQualifications\u003cbr /\u003e\u003cbr /\u003e * 1-3+ years experience in web design, preferably within a startup environment\u003cbr /\u003e * Professional-grade competency with Adobe suite tools (Photoshop, \u003cbr /\u003eIllustrator, InDesign)\u003cbr /\u003e * Knowledge of GitHub and version control\u003cbr /\u003e * Solid web language proficiency — HTML, CSS, sass, javascript\u003cbr /\u003e * Knowledge of CMS systems (preferably static sites)\u003cbr /\u003e * Rock-solid communication skills to make sure everybody is on the same page\u003cbr /\u003eQualities we\u0027re looking for\u003cbr /\u003e\u003cbr /\u003e * Awesome communication skills. You should be a great writer and speaker -- \u003cbr /\u003eyou\u0027ll be writing content, and talking constantly with new prospects, existing \u003cbr /\u003ecustomers, and our own team.\u003cbr /\u003e * A GTD attitude. Identify next actions, communicate intent, and execute. \u003cbr /\u003eWe\u0027re a fast-paced team, and this role covers a wide area, so a results-driven \u003cbr /\u003ementality is critical.\u003cbr /\u003e * Ownership thinking. Have the ability to take ownership and make decisions. \u003cbr /\u003ePassion and self-motivation is key. We don\u0027t micromanage, you\u0027ll be expected to \u003cbr /\u003eown and deliver.\u003cbr /\u003e * Desire to build something great and bring technical solutions to people to \u003cbr /\u003esolve their problems.\u003cbr /\u003e * Bonus: You {love coffee, love software + products, have a good sense of \u003cbr /\u003ehumor}\u003cbr /\u003eWe offer an opportunity to make daily impacts in support of our aggressive \u003cbr /\u003estrategic growth plans as well as experience professional and personal growth \u003cbr /\u003eas an integral part of a high-tempo, unique culture. Candidates must be able to \u003cbr /\u003edemonstrate US Citizenship or existing authorization to work for any US \u003cbr /\u003eemployer. Successful candidate will be subject to reference checks, business \u003cbr /\u003edue diligence verification and drug screening. For more information please \u003cbr /\u003evisit www.fulcrumapp.com.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eJob Perks: 100% company paid premiums on all medical plans. 100% company match \u003cbr /\u003eon 401(k) contributions. Flexible work schedules. Four weeks personal time off \u003cbr /\u003e+ eight company paid holidays upon start. Performance based bonuses, and more. \u003cbr /\u003eYou won\u0027t be disappointed.\u003cbr /\u003e\u003cbr /\u003eApply: Please visit our company web page to learn more about what we do and \u003cbr /\u003ewhere you fit.",
    "urlFetchPending": false,
    "published": "Jan 19, 2017 7:16:04 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/50",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/job/Ux-Designer-at-Executec-Recruiters-in-Work-at-Home-46899d5ba6715bb4",
    "title": "UX Designer - Executec Recruiters, Inc. - Work at Home",
    "content": "\u003c\u003e UX Designer \u003cbr /\u003eExecutec Recruiters, Inc. - Work at Home \u003cbr /\u003e Other \u003cbr /\u003eSURGE Forward is looking for smart, self-motivated, experienced, senior-level \u003cbr /\u003esoftware designers and engineers who enjoy the freedom of telecommuting and \u003cbr /\u003eflexible schedules, to work as long-term, consistent (40 hrs/week) independent \u003cbr /\u003econtractors (no W2) on a variety of software development projects.\u003cbr /\u003e\u003cbr /\u003e ** NO Offshore candidates. Only people living in the US and Canada can be \u003cbr /\u003econsidered at this time. Sorry, NO VISAS. And, NO Recruiters- Please do not \u003cbr /\u003esend your consultants.**\u003cbr /\u003e\u003cbr /\u003eSkills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003e To apply, you must have 6+ years of professional experience designing and \u003cbr /\u003egood knowledge of the following listed below.\u003cbr /\u003e\u003cbr /\u003e Business Analysis experience - creating workflows, user stories, personas, \u003cbr /\u003esite maps\u003cbr /\u003e\u003cbr /\u003e UX experience - including wireframes, prototypes, A/B testing. \u003cbr /\u003e\u003cbr /\u003e UI experience - UI layouts, color schemes, typography, understanding of CSS. \u003cbr /\u003e\u003cbr /\u003e Toolbox: Adobe Suite, Axure, InVision, HTML, CSS, Java Script \u003cbr /\u003e\u003cbr /\u003e For immediate consideration, email resume to: dsanderson@surgeforward.com\u003cbr /\u003e21 hours ago",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 1:24:34 AM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/50",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "wfh.io-design",
    "url": "https://www.wfh.io/jobs/3488-product-designer-ion-interactive",
    "title": "Product Designer",
    "content": "Product Designer\u003cbr /\u003e\u003cbr /\u003eMarketers use our web-based SaaS platform to create and publish interactive \u003cbr /\u003econtent experiences: quizzes, assessments, calculators, configurators, solution \u003cbr /\u003ebuilders, interactive white papers, interactive infographics, and more! We want \u003cbr /\u003eto make their job as easy and fun as possible. But behind the scenes, it’s a \u003cbr /\u003ecomplex endeavour. That’s why we’re reimagining the UX of our platform -- to \u003cbr /\u003emake it as simple as possible for anyone to create interactive content. That’s \u003cbr /\u003ewhere you come in. If you’re up to the challenge of turning a complex system \u003cbr /\u003einto an easy to use interface, read on!\u003cbr /\u003e\u003cbr /\u003eCurious, but want to learn more? Explore product design at ion \u003cbr /\u003e\u003chttps://paths.ioninteractive.com/product-design\u003e.\u003cbr /\u003e\u003cbr /\u003eYour Role\u003cbr /\u003e\u003cbr /\u003eYou’ll be a core contributor to all parts of our lean and agile design \u003cbr /\u003eprocess. For example, you will be responsible for creating interactive \u003cbr /\u003eprototypes, using tools like Sketch and invision. Using your prototypes, you’ll \u003cbr /\u003ehelp to conduct usability tests. Part of your job will be to build and maintain \u003cbr /\u003estyle guides and UI patterns (based off a front-end framework like Bootstrap) \u003cbr /\u003eto enable development of our product. Finally, and importantly, you’ll be up to \u003cbr /\u003ethe challenge of distilling complex problems into usable interfaces.\u003cbr /\u003e\u003cbr /\u003eWe work cross-functionally, and use processes like design sprints and design \u003cbr /\u003estudios to generate ideas and design direction. Bonus points if you know what \u003cbr /\u003ethose are!\u003cbr /\u003e\u003cbr /\u003eAbout You\u003cbr /\u003e\u003cbr /\u003eIn addition to the above, you have the following:\u003cbr /\u003e\u003cbr /\u003e * A strong portfolio featuring real world examples of interaction design work \u003cbr /\u003e(the more we can click around, the better) \u003cbr /\u003e * Solid UI design skills \u003cbr /\u003e * Experience writing HTML and CSS (cutting edge CSS skills a bonus) \u003cbr /\u003e * Comfort with an agile \u0026 iterative design process \u003cbr /\u003e * Excellent communication skills--you’ll need to communicate clearly and \u003cbr /\u003eeffectively on a cross-functional team \u003cbr /\u003eEven Better\u003cbr /\u003e\u003cbr /\u003e * You’re a great writer \u003cbr /\u003e * You’ve launched your own product or have a side project that you’re proud of\u003cbr /\u003eThis is a full-time position for our office in Cambridge, MA. Local and remote \u003cbr /\u003ecandidates will be considered.\u003cbr /\u003e\u003cbr /\u003eAbout ion\u003cbr /\u003e\u003cbr /\u003eWe\u0027re a growing, innovative software company that\u0027s disrupting the $1 trillion \u003cbr /\u003emarketing industry. Our mission: every click through in marketing should lead \u003cbr /\u003eto a great user experience. We\u0027ve built a state-of-the-art SaaS platform for \u003cbr /\u003ecreating and testing web and mobile experiences at the intersection of paid and \u003cbr /\u003eowned media. Our customers include leading companies such as Dell, DHL, HP, \u003cbr /\u003eGeneral Mills, Iron Mountain, Salesforce, Symantec and more.\u003cbr /\u003e\u003cbr /\u003eWe offer highly competitive compensation and a great benefits package. Our \u003cbr /\u003eoffices are a groovy space in the heart of Kendall Square, and our team \u003cbr /\u003econsists of friendly, passionate, talented and good-humored people who love \u003cbr /\u003ebuilding things that make an impact.\u003cbr /\u003e\u003cbr /\u003eLearn more about us at www.ioninteractive.com \u003chttp://www.ioninteractive.com\u003e \u003cbr /\u003eand follow us@ioninteractive \u003chttps://twitter.com/ioninteractive\u003e.",
    "urlFetchPending": false,
    "published": "Feb 3, 2017 5:11:09 AM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/50",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "remoteok.io-dev",
    "url": "https://remoteok.io/jobs/21275",
    "title": "Software Designer Business Analyst",
    "content": "We are looking for experienced software developers that are passionate about \u003cbr /\u003edeveloping great software and have experience working with GIS and/or CAD \u003cbr /\u003esystems. This position is open to remote or on site working locations.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThings you will do: \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e• Develop intuitive, usable, and engaging interactions and visual designs for \u003cbr /\u003emobile and the web\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e• Participate in the development process from definition, through design, \u003cbr /\u003ebuild, test, release, and maintenance\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e• Contribute to the design of an engineering web application\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e• Contribute to connecting the world with high speed fiber networks",
    "urlFetchPending": false,
    "published": "Jan 18, 2017 11:23:02 PM",
    "tags": [
      "REMOTE1/50",
      "REMOTE2/locals-only",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53916/ux-designer-at-curve/",
    "title": "UX Designer",
    "content": "*UX Designer*\u003cbr /\u003e*_~Bridging the gap between technology \u0026...behaviour, behaviour, behaviour~_*\u003cbr /\u003eShoreditch, London\u003cbr /\u003eSalary + Equity\u003cbr /\u003e\u003cbr /\u003e*Curve is growing - join our adventurous startup!*\u003cbr /\u003eWe believe that the next generation of banking will be a single mobile platform that enables payment anywhere with any card from any account, and connects people in a simple way with the best technologies and financial offers - putting them back in control of their finances.\u003cbr /\u003e\u003cbr /\u003eOur award winning team of entrepreneurs, product-builders and customer-focused marketers are developing a ground-breaking product with the customer at the core. To start with, we’ve taken the humble bank card and injected it with a whole load of innovation. Technical complexity, scalability, security and real-time transactions are all part of the day-to-day challenges.\u003cbr /\u003e\u003cbr /\u003eWith funding from the Who’s Who in angel investors and an experienced and ambitious founding team, we are at the forefront of London FinTech.\u003cbr /\u003e\u003cbr /\u003eIf you like to be intellectually stretched, your capabilities tested and want an opportunity to have a real voice, input and impactful contribution, then we’re offering that in abundance.\u003cbr /\u003e\u003cbr /\u003e*_You bring your expertise; we’ll give you the platform to flex your talent!_*\u003cbr /\u003e\u003cbr /\u003e*Role Overview:*\u003cbr /\u003eWe’re looking for an outstanding UX Designer to be responsible for conceiving and conducting user research, interviews and surveys, and translating them into sitemaps, wireframes and prototypes. You will also contribute to the design the overall functionality of the product and iterate upon it to ensure a great user experience. We’re looking for someone who can help us make complex digital user experience problems simpler.\u003cbr /\u003e\u003cbr /\u003e*Responsibilities will include:*\u003cbr /\u003e* Translating concepts into wireframes and mockups that lead to intuitive user experiences\u003cbr /\u003e* Facilitating product visions by researching, conceiving, wireframing, sketching, prototyping, and mocking up user experiences\u003cbr /\u003e* Designing and delivering wireframes, user stories, user journeys, and mockups optimised for mobile \u0026 web\u003cbr /\u003e* Identifying design problems and devising elegant solutions\u003cbr /\u003e* Making strategic design and user-experience decisions relating to core, and new functions and features\u003cbr /\u003e* Understanding our user’s needs, pain points and the jobs they need to get done; design a great experience of the end-to-end user journey\u003cbr /\u003e* Constantly looking through the existing product and features to improve the user experience\u003cbr /\u003e* Taking a user-centred design approach and rapidly testing and iterating your designs\u003cbr /\u003e* Collaborating with other team members, including; Engineering, Product, Marketing\u003cbr /\u003e* Taking smart risks and championing new ideas\u003cbr /\u003e\u003cbr /\u003e*The expertise we need:*\u003cbr /\u003e* Exceptional design thinking approach\u003cbr /\u003e* An ability to distinguish between “good” and “great” work, with an ability to articulate the difference\u003cbr /\u003e* Comfortable with trial and error; you should have experience prototyping and experimenting at different levels of fidelity\u003cbr /\u003e* Experience with various user research \u0026 insight gathering methods\u003cbr /\u003e* Broad world-view that understands and strike the balance between viability and feasibility, while putting experience and design at the forefront\u003cbr /\u003e* Solid experience of user interface design patterns and standard UCD methodologies\u003cbr /\u003e* Ability to provide valuable insights and points of view at the intersection of brand, business and interaction design\u003cbr /\u003e* Design experience across different segmentation of users\u003cbr /\u003e* Strong UX and interaction design experience on both mobile and web, experience in different patterns across platforms and OS\u003cbr /\u003e* Ability to convey concepts through wireframes, flows and mockups\u003cbr /\u003e* Fluent in design tools, such as Sketch, Photoshop and Illustrator\u003cbr /\u003e* Previous experience working in an Agile environment (startups would be great, but not mandatory)\u003cbr /\u003e* Ability to create quick and dirty prototypes (for example, animations with AfterEffects, wireframe with Balsamiq, interactive prototypes with Flintos, Axure, Marvel, etc.)\u003cbr /\u003e* Coding for web and/or mobile app experience (JavaScript/CSS/HTML, Objective-C, etc.)\u003cbr /\u003e\u003cbr /\u003e*What gets us excited*\u003cbr /\u003e* You’re great at understanding human behavior and turning insights and needs into real concepts\u003cbr /\u003e* You are obsessed with what design and technology could do for people\u003cbr /\u003e* You have a great balance with both design and systems thinking; you can logically visualize complex systems, user interaction flows and beautiful user interface\u003cbr /\u003e* You read behavioural economics in your free time\u003cbr /\u003e* You love solving big, hairy problems!\u003cbr /\u003e* You are passionate about building, prototyping, and continually evolving digital products throughout the product life cycle\u003cbr /\u003e* You can articulate the value of design through verbal and visual presentation\u003cbr /\u003e* You love collaborating with others\u003cbr /\u003e* You have the ability to learn new tools and do self-guided work within a fast-paced environment.\u003cbr /\u003e* You’re a designer at your core, and you see bringing products to market as an important part of your design passion\u003cbr /\u003e\u003cbr /\u003e*About us*\u003cbr /\u003eWe’re a team of 25, who work closely together to turn dreams into realities. With a flat hierarchy and an ability to make decisions quickly, we’re based in a great office in Shoreditch, close to Old Street – the heart of the vibrant tech centre of London. We build entrepreneurs, and we invest time in coaching and teaching each other, never settling for anything but the best.\u003cbr /\u003e\u003cbr /\u003eOur user base is growing daily and we have exceptional user retention. We have funding from the leading names in tech investment, and a founder who wants everyone who joins this remarkable adventure, to have the autonomy to exercise and develop their expertise.\u003cbr /\u003e\u003cbr /\u003e*Our recruitment philosophy*\u003cbr /\u003eWe’re committed to building a product that people want, and we can’t do it without having a talented team with a meaningful stake in the business. Everyone who joins us and contributes to Curve’s success is rewarded with equity.\u003cbr /\u003e\u003cbr /\u003e*How we aim to look after you*\u003cbr /\u003e* Monthly health \u0026 wellbeing budget for gym, etc.\u003cbr /\u003e* If you work late, we make sure you have supper and a taxi home\u003cbr /\u003e* Team Lunch Fridays\u003cbr /\u003e* Infinite stream of fruit \u0026 snacks and great coffee\u003cbr /\u003e* Generous holiday allowance\u003cbr /\u003e\u003cbr /\u003e*Getting in touch:*\u003cbr /\u003eStart a conversation by sending us as much information as possible about you, your achievements, your philosophy, ambitions \u0026 portfolio and why Curve is of interest to you.\u003cbr /\u003e\u003cbr /\u003e_The successful applicant will be required to undertake DBS checks in accordance with regulation._",
    "urlFetchPending": false,
    "published": "Feb 2, 2017 10:34:56 AM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/50",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53520/ui-designer-for-fit-link-app-at-fit-link-app/",
    "title": "UI Designer for Fit Link App",
    "content": "*PLEASE, NOTE*\u003cbr /\u003e\u003cbr /\u003e1. No recruiters, please\u003cbr /\u003e2. This is an unpaid / sweat equity role\u003cbr /\u003e\u003cbr /\u003e*Welcome to Fit Link*\u003cbr /\u003e\u003cbr /\u003eFit Link App is a global fitness community powered by wearable tech and fitness trackers. Users download the iOS app, log in with Facebook or email and connect their RunKeeper, Strava or Apple Health to the app. Their activity data is then used to compete with like-minded athletes in private or public leagues, users can exchange tracked miles for fitness rewards (like air miles) and users can follow or be followed to see each other\u0027s activities.\u003cbr /\u003e\u003cbr /\u003e*The story so far...*\u003cbr /\u003e\u003cbr /\u003e2015\u003cbr /\u003e\u003cbr /\u003e* Jan to May: idea to MVP\u003cbr /\u003e* Jun: Live in the app store. No marketing or promotion as beta launch\u003cbr /\u003e* Jul: Improvements and bug fixes from user feedback\u003cbr /\u003e* Aug: Improvements from user feedback\u003cbr /\u003e* Oct: Additional functionality (Apple Health) \u003cbr /\u003e* Nov: Apple Health bug fixes\u003cbr /\u003e\u003cbr /\u003e2016\u003cbr /\u003e\u003cbr /\u003e* Jan: Additional functionality, improvements and bug fixes and UX and UI improvements\u003cbr /\u003e* Oct to Dec: User research and feedback, backend migration, web version build started\u003cbr /\u003e\u003cbr /\u003e*The next chapter...*\u003cbr /\u003e\u003cbr /\u003e2017\u003cbr /\u003e\u003cbr /\u003e* Jan: Build founding team, grow product\u003cbr /\u003e* Jul: Seed round\u003cbr /\u003e* Aug: Take over the world\u003cbr /\u003e\u003cbr /\u003e*About me...*\u003cbr /\u003e\u003cbr /\u003eI’m a serial entrepreneur with multiple start-ups resulting in sales and/or fails. I have a passion for business, embrace lean startup methodology and love solving real problems with technology. Fit Link is a solution to a problem I experienced and I spent a few months researching before deciding to start Fit Link.\u003cbr /\u003e\u003cbr /\u003e*About you...*\u003cbr /\u003e\u003cbr /\u003eA designer with experience across the web, iOS and Android (so a wide spectrum to cover). The idea is to build up a library of UI elements which can be used across all platforms that align to the main Fit Link App brand identity. You\u0027ll have full reign to own the design direction for everything at Fit Link. \u003cbr /\u003e\u003cbr /\u003eStart-up experience plus health \u0026 fitness industry experience is preferred but not necessary. If you run or ride and use an activity tracker then you are potentially a user, so even better!\u003cbr /\u003e\u003cbr /\u003eI need passionate, driven, motivated, and talented people to join me in building a cool and successful product. I want you to believe in the product, see its potential and help shape its future.\u003cbr /\u003e\u003cbr /\u003eRemote work is ok but regular weekly face-to-face meetups in London and Norwich are key. \u003cbr /\u003e\u003cbr /\u003eTools used include Hangouts, Slack, Google Docs, Gmail and Bitbucket. \u003cbr /\u003e\u003cbr /\u003e*Money...*\u003cbr /\u003e\u003cbr /\u003ePre-seed this is a sweat equity deal so it’s a side project gig. I\u0027ve self-funded and bootstrapped to this point and that will continue for the next 4 to 6 months until seed investment. Shares will be allocated to founding members based on the amount of time they can commit to Fit Link. After seed investment then this becomes a paid role (full and/or part-time).\u003cbr /\u003e\u003cbr /\u003e*Contact/apply...*\u003cbr /\u003e\u003cbr /\u003eGet in contact for further information and send me your profile/cv/twitter/linkedin/instagram etc",
    "urlFetchPending": false,
    "published": "Jan 21, 2017 8:19:20 AM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/50",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "jobs.remotive.io",
    "url": "https://boards.greenhouse.io/khanacademy/jobs/15871#.VMEHci7F_HM",
    "title": "Product Designer at Khan Academy, Mountain View, CA / Remote work a possibility , product",
    "content": "Job Application for Product Designer at Khan Academy  Apply Now  \u003c\u003e \u003cbr /\u003eProduct Designer\u003cbr /\u003e at Khan Academy  Mountain View, CA \u003cbr /\u003eKhan Academy is looking for product designers who are passionate about great \u003cbr /\u003edesign and have an ability to achieve it. Join us on our mission to provide a \u003cbr /\u003efree, world-class education for anyone, anywhere!\u003cbr /\u003e\u003cbr /\u003eWe’re fun, quirky people at heart that come from a wide variety of \u003cbr /\u003ebackgrounds. Our team includes industry leaders from companies such as Apple, \u003cbr /\u003eGoogle, Facebook, tiny startups, games, and education, including people with \u003cbr /\u003enon-traditional backgrounds who didn’t graduate from college. Together, we’re a \u003cbr /\u003esmall but elite group. We’re deeply invested in your future: we have high \u003cbr /\u003eexpectations of you, and consider deeply how to support you to achieve them.\u003cbr /\u003e\u003cbr /\u003eThe design team is a small, super diverse group of people; each member has a \u003cbr /\u003elot of impact and makes huge contributions across the board. As a good \u003cbr /\u003ecandidate, you will have a great portfolio with a string of successful projects \u003cbr /\u003ein your wake. Your friends and coworkers think of you as the go-to person for \u003cbr /\u003eat least two of these:\u003cbr /\u003e\u003cbr /\u003e * Interaction design \u003cbr /\u003e * Visual design \u003cbr /\u003e * Prototyping skills \u003cbr /\u003e * Information architecture \u003cbr /\u003e * User research and testing \u003cbr /\u003eWe expect our designers to have solid technical skills. You should have a set \u003cbr /\u003eof tools that you love to use when designing. You’re able to show us how you\u0027ve \u003cbr /\u003eused them in the past to make great products, and you can walk us through your \u003cbr /\u003edesign reasoning. You can demonstrate that you’re invested in working well with \u003cbr /\u003eyour peers and other disciplines, such as engineering and PM, throughout your \u003cbr /\u003ecareer – because we’re dedicated toboth great quality design and great quality \u003cbr /\u003ecollaboration.\u003cbr /\u003e\u003cbr /\u003e \u003cbr /\u003e\u003cbr /\u003eYOU NEED\u003cbr /\u003e\u003cbr /\u003e * A passion for designing engaging learning experiences, as well as a desire \u003cbr /\u003eto make the world a better place \u003cbr /\u003e * Excitement to contribute culturally and technically to the growth of those \u003cbr /\u003earound you, as well as a drive to keep learning new things yourself \u003cbr /\u003e * Introspection, humility, maturity, excellent communication skills, and \u003cbr /\u003estrong systematic problem solving ability \u003cbr /\u003e \u003cbr /\u003e\u003cbr /\u003eWE OFFER THE FOLLOWING BENEFITS\u003cbr /\u003e\u003cbr /\u003eWe may be a non-profit, but we reward our talented team well!\u003cbr /\u003e\u003cbr /\u003e * Competitive salaries and annual bonuses \u003cbr /\u003e * Ample paid time off as needed \u003cbr /\u003e * A fun, high-caliber team that believes in the importance of having a great \u003cbr /\u003eday-to-day experience \u003cbr /\u003e * Delicious catered lunch daily plus tons of snacks and beverages \u003cbr /\u003e * Walking distance to Caltrain and downtown Mountain View, flexibility to \u003cbr /\u003ework from other locations \u003cbr /\u003e * The opportunity to work on software and programs that are already impacting \u003cbr /\u003ethe future of learning \u003cbr /\u003e * The ability to improve real lives and put your talents toward a deeply \u003cbr /\u003emeaningful mission \u003cbr /\u003e * The possibility of helping empower more problem solvers to improve the world\u003cbr /\u003e * Oh, and we offer all those other typical benefits as well: 401(k) + 4% \u003cbr /\u003ematching \u0026 comprehensive insurance including medical, dental, vision, and life \u003cbr /\u003e \u003cbr /\u003e\u003cbr /\u003eHOW TO APPLY\u003cbr /\u003e\u003cbr /\u003e * Attach your resume below \u003cbr /\u003e * Address the following prompt in the space provided below: At Khan Academy, \u003cbr /\u003ewe believe that reaching all learners requires an engineering team that is \u003cbr /\u003ediverse in every respect, and we are looking for individuals who will help us \u003cbr /\u003efulfill our mission by adding to the diversity of our team\u0027s experiences, \u003cbr /\u003eperspectives, and mindsets. With that in mind, tell us briefly how your \u003cbr /\u003eexperiences and perspectives— whether personal, professional, academic, or \u003cbr /\u003eotherwise— could contribute to the diversity of our team. \u003cbr /\u003e \u003cbr /\u003e\u003cbr /\u003eLEARN MORE\u003cbr /\u003e\u003cbr /\u003e * A talk by our Design Director, May-Li \u003chttps://vimeo.com/151277883\u003e \u003cbr /\u003e * Sal’s TED talk \u003cbr /\u003e\u003chttp://www.ted.com/talks/salman_khan_let_s_use_video_to_reinvent_education.html\u003e\u003cbr /\u003e * Our team \u003chttp://www.khanacademy.org/about/the-team\u003e \u003cbr /\u003eWe are committed to equal employment opportunity regardless of race, color, \u003cbr /\u003eancestry, religion, sex, national origin, sexual orientation, age, citizenship, \u003cbr /\u003emarital status, disability, or Veteran status.\u003cbr /\u003e \u003c\u003e Apply for this Job * Required First Name * Last Name * Email * Phone * \u003cbr /\u003eResume/CV*  Drop files here     \u003c\u003e Attach \u003c\u003e Dropbox \u003c\u003e Google Drive \u003c\u003e Paste \u003c\u003e\u003cbr /\u003e \u003c\u003e Cover Letter  Drop files here     \u003c\u003e Attach \u003c\u003e Dropbox \u003c\u003e Google Drive \u003c\u003e \u003cbr /\u003ePaste \u003c\u003e  \u003c\u003e Skype ID * \u003cbr /\u003eAre you available to work full-time from our office in Mountain View, \u003cbr /\u003eCalifornia? * \u003cbr /\u003e-- Yes No In addition to your resume, did you include all the other \u003cbr /\u003erequirements requested? * \u003cbr /\u003e-- Yes No Have you used Khan Academy before? * \u003cbr /\u003e-- Yes No Portfolio * \u003cbr /\u003ePersonal website / Links to projects / Blog / Github \u003cbr /\u003eHow did you hear about this job? \u003cbr /\u003eWill you now, or in the future, require sponsorship to work in the U.S.? * \u003cbr /\u003e-- Yes No If you answered \u0027Yes\u0027 above, please provide additional details. \u003cbr /\u003eAt Khan Academy, we believe that reaching all learners requires a Design team \u003cbr /\u003ethat is diverse in every respect, and we are looking for individuals who will \u003cbr /\u003ehelp us fulfill our mission by adding to the diversity of our team\u0027s \u003cbr /\u003eexperiences, perspectives, and mindsets. With that in mind, tell us briefly how \u003cbr /\u003eyour experiences and perspectives— whether personal, professional, academic, or \u003cbr /\u003eotherwise— could contribute to the diversity of our team. * \u003cbr /\u003eIs there anything else you\u0027d like us to know about you? \u003cbr /\u003eU.S. Equal Opportunity Employment Information (Completion is voluntary) \u003cbr /\u003e Individuals seeking employment at Khan Academy are considered without regards \u003cbr /\u003eto race, color, religion, national origin, age, sex, marital status, ancestry, \u003cbr /\u003ephysical or mental disability, veteran status, gender identity, or sexual \u003cbr /\u003eorientation. You are being given the opportunity to provide the following \u003cbr /\u003einformation in order to help us comply with federal and state Equal Employment \u003cbr /\u003eOpportunity/Affirmative Action record keeping, reporting, and other legal \u003cbr /\u003erequirements.\u003cbr /\u003e\u003cbr /\u003e Completion of the form is entirely voluntary. Whatever your decision, it will \u003cbr /\u003enot be considered in the hiring process or thereafter. Any information that you \u003cbr /\u003edo provide will be recorded and maintained in a confidential file.\u003cbr /\u003eGender Please selectMale Female Decline To Self Identify Are you \u003cbr /\u003eHispanic/Latino? Please selectYes No Decline To Self Identify Please identify \u003cbr /\u003eyour race Please selectAmerican Indian or Alaskan Native Asian Black or African \u003cbr /\u003eAmerican Hispanic or Latino White Native Hawaiian or Other Pacific Islander Two \u003cbr /\u003eor More Races Decline To Self Identify  Race \u0026 Ethnicity Definitions  \u003cbr /\u003e\u003chttps://boards-cdn.greenhouse.io/docs/RaceEthnicityDefinitions.pdf\u003e \u003cbr /\u003e If you believe you belong to any of the categories of protected veterans \u003cbr /\u003elisted below, please indicate by making the appropriate selection. As a \u003cbr /\u003egovernment contractor subject to Vietnam Era Veterans Readjustment Assistance \u003cbr /\u003eAct (VEVRAA), we request this information in order to measure the effectiveness \u003cbr /\u003eof the outreach and positive recruitment efforts we undertake pursuant to \u003cbr /\u003eVEVRAA. Classification of protected categories is as follows:\u003cbr /\u003e\u003cbr /\u003e A \"disabled veteran\" is one of the following: a veteran of the U.S. military, \u003cbr /\u003eground, naval or air service who is entitled to compensation (or who but for \u003cbr /\u003ethe receipt of military retired pay would be entitled to compensation) under \u003cbr /\u003elaws administered by the Secretary of Veterans Affairs; or a person who was \u003cbr /\u003edischarged or released from active duty because of a service-connected \u003cbr /\u003edisability.\u003cbr /\u003e\u003cbr /\u003e A \"recently separated veteran\" means any veteran during the three-year period \u003cbr /\u003ebeginning on the date of such veteran\u0027s discharge or release from active duty \u003cbr /\u003ein the U.S. military, ground, naval, or air service.\u003cbr /\u003e\u003cbr /\u003e An \"active duty wartime or campaign badge veteran\" means a veteran who served \u003cbr /\u003eon active duty in the U.S. military, ground, naval or air service during a war, \u003cbr /\u003eor in a campaign or expedition for which a campaign badge has been authorized \u003cbr /\u003eunder the laws administered by the Department of Defense.\u003cbr /\u003e\u003cbr /\u003e An \"Armed forces service medal veteran\" means a veteran who, while serving on \u003cbr /\u003eactive duty in the U.S. military, ground, naval or air service, participated in \u003cbr /\u003ea United States military operation for which an Armed Forces service medal was \u003cbr /\u003eawarded pursuant to Executive Order 12985.\u003cbr /\u003eVeteran Status Please selectI am not a protected veteran I identify as one or \u003cbr /\u003emore of the classifications of a protected veteran I don\u0027t wish to answer \u003cbr /\u003eForm CC-305\u003cbr /\u003e\u003cbr /\u003eOMB Control Number 1250-0005\u003cbr /\u003e\u003cbr /\u003eExpires 1/31/2020\u003cbr /\u003e\u003cbr /\u003eVoluntary Self-Identification of Disability\u003cbr /\u003eWhy are you being asked to complete this form? \u003cbr /\u003e Because we do business with the government, we must reach out to, hire, and \u003cbr /\u003eprovide equal opportunity to qualified people with disabilities1. To help us \u003cbr /\u003emeasure how well we are doing, we are asking you to tell us if you have a \u003cbr /\u003edisability or if you ever had a disability. Completing this form is voluntary, \u003cbr /\u003ebut we hope that you will choose to fill it out. If you are applying for a job, \u003cbr /\u003eany answer you give will be kept private and will not be used against you in \u003cbr /\u003eany way.\u003cbr /\u003e\u003cbr /\u003e If you already work for us, your answer will not be used against you in any \u003cbr /\u003eway. Because a person may become disabled at any time, we are required to ask \u003cbr /\u003eall of our employees to update their information every five years. You may \u003cbr /\u003evoluntarily self-identify as having a disability on this form without fear of \u003cbr /\u003eany punishment because you did not identify as having a disability earlier.\u003cbr /\u003eHow do I know if I have a disability? \u003cbr /\u003e You are considered to have a disability if you have a physical or mental \u003cbr /\u003eimpairment or medical condition that substantially limits a major life \u003cbr /\u003eactivity, or if you have a history or record of such an impairment or medical \u003cbr /\u003econdition.\u003cbr /\u003e\u003cbr /\u003eDisabilities include, but are not limited to:\u003cbr /\u003e\u003cbr /\u003e * Blindness \u003cbr /\u003e * Deafness \u003cbr /\u003e * Cancer \u003cbr /\u003e * Diabetes \u003cbr /\u003e * Epilepsy \u003cbr /\u003e * Autism \u003cbr /\u003e * Cerebral palsy \u003cbr /\u003e * HIV/AIDS \u003cbr /\u003e * Schizophrenia \u003cbr /\u003e * Muscular dystrophy \u003cbr /\u003e * Bipolar disorder \u003cbr /\u003e * Major depression \u003cbr /\u003e * Multiple sclerosis (MS) \u003cbr /\u003e * Missing limbs or partially missing limbs \u003cbr /\u003e * Post-traumatic stress disorder (PTSD) \u003cbr /\u003e * Obsessive compulsive disorder \u003cbr /\u003e * Impairments requiring the use of a wheelchair \u003cbr /\u003e * Intellectual disability (previously called mental retardation) Disability \u003cbr /\u003eStatus Please selectYes, I have a disability (or previously had a disability) \u003cbr /\u003eNo, I don\u0027t have a disability I don\u0027t wish to answer Reasonable Accommodation \u003cbr /\u003eNotice \u003cbr /\u003e Federal law requires employers to provide reasonable accommodation to \u003cbr /\u003equalified individuals with disabilities. Please tell us if you require a \u003cbr /\u003ereasonable accommodation to apply for a job or to perform your job. Examples of \u003cbr /\u003ereasonable accommodation include making a change to the application process or \u003cbr /\u003ework procedures, providing documents in an alternate format, using a sign \u003cbr /\u003elanguage interpreter, or using specialized equipment.\u003cbr /\u003e\u003cbr /\u003e1Section 503 of the Rehabilitation Act of 1973, as amended. For more \u003cbr /\u003einformation about this form or the equal employment obligations of Federal \u003cbr /\u003econtractors, visit the U.S. Department of Labor\u0027s Office of Federal Contract \u003cbr /\u003eCompliance Programs (OFCCP) website atwww.dol.gov/ofccp \u003cbr /\u003e\u003chttp://www.dol.gov/ofccp\u003e. \u003cbr /\u003e\u003cbr /\u003e PUBLIC BURDEN STATEMENT: According to the Paperwork Reduction Act of 1995 no \u003cbr /\u003epersons are required to respond to a collection of information unless such \u003cbr /\u003ecollection displays a valid OMB control number. This survey should take about 5 \u003cbr /\u003eminutes to complete.\u003cbr /\u003eShare this job:    \u003c\u003e  \u003c\u003e  \u003c\u003e  \u003c\u003e  \u003c\u003e  \u003c\u003e Powered by   \u003cbr /\u003e\u003chttp://www.greenhouse.io/\u003e  Read our Privacy Policy \u003cbr /\u003e\u003chttp://www.greenhouse.io/privacy-policy\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/50",
      "TITLE1/designer"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13547255",
    "title": "SEEKING FREELANCER - REMOTE London based Additive Manufacturing startup is looking for a frontend dev/designer. Initial work is targetted around ...",
    "content": "SEEKING FREELANCER - REMOTE\u003cbr /\u003eLondon based Additive Manufacturing startup is looking for a frontend \u003cbr /\u003edev/designer.\u003cbr /\u003e\u003cbr /\u003eInitial work is targetted around improving the mobile responsiveness of some \u003cbr /\u003esites. Stack includes sass, webpack, bootstrap, and jQuery.\u003cbr /\u003e\u003cbr /\u003eExperience with python, jinja2, and docker helpful, but not required.\u003cbr /\u003e\u003cbr /\u003ePlease email be at hn (AT) s1devops.com with any recent links to code, \u003cbr /\u003equestions, and your rate. \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 2, 2017 4:00:03 AM",
    "tags": [
      "REMOTE2/America",
      "REMOTE1/50",
      "TITLE1/designer"
    ]
  }
]
}
