{
  "items": [
  {
    "id": "sqiXjeGxRBavf4JDzpms-g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/77045/product-designer-ui-ux-fbs?a=pPZcR4fWW9a",
    "title": "Product Designer (UI/UX) at FBS (Fargo, ND) (allows remote)",
    "content": "<div>        <div>                <div>            <div>                                    <div>                    <div>                        <div>                            <h2><a rel=&quot;nofollow&quot;>Product Designer (UI/UX)</a>                            </h2>                                <span>                                    Equity                                </span>                        </div><a rel=&quot;nofollow&quot;>FBS</a>                    </div>                </div>                <div>                    <div>                                                        </div>                </div>                <div></div>            </div>        </div>                        </div>        <div>            <h3>                Job Description            </h3>            <div><p>Product Designers take Flexmls’s most innovative product concepts and bring them to life.</p><p>As a Product Designer, you’ll weave together strong interaction design, visual design, and technical skills. You’ll partner with researchers, product managers, developers, and fellow product designers to define and deliver new features, translate concepts into living, breathing prototypes, and iterate on interactions, animations, and details to deliver pixel-perfect experiences. You’ll be joining a small team of product experts who take design thinking seriously and have experience at some of the biggest firms in tech. <br><br></p>            </div>        </div>            <h3>                Skills &amp; Requirements            </h3>            <div><p>Responsibilities</p><ul><li>Explore product concepts to find promising directions that address both human and business needs.</li><li>Collaborate with your fellow designers to constantly refine and evolve the Flexmls design system</li><li>Distill complexity into a clear and coherent experience from start to finish</li><li>Build prototypes to assist in user research, using low- to high-fidelity techniques</li><li>Collaborate daily with product designers, researchers, product managers, and developers.</li><li>Support multiple projects simultaneously while meeting tight deadlines.</li><li>Advise front-end engineers on design system implementation best practices.</li></ul><p>Qualifications</p><ul><li>Obsessive about beautiful design, details, and strong usability</li><li>You possess excellent verbal and written communication skills (you should be able to clearly articulate your design decisions)</li><li>Some experience with front-end programming (HTML, CSS, JavaScript) (you should be able to code up a simple web site and/or application)</li><li>The ability to think at a high level about product strategy and vision (not just “how it should look” but “what we should build”)</li><li>Experience creating, implementing, and evolving design systems and UI component libraries.</li><li>Experience designing, building, and shipping responsive web applications</li><li>Experience working with remote teams</li><li>Body of design work demonstrating strong design process, including both interaction and visual design skills</li></ul>            </div>            <h3>                About FBS            </h3>            <div><p>FBS is the creator of real estate software Flexmls, used worldwide by hundreds of thousands of real estate professionals and millions of their customers. We’re headquartered in Fargo, but our team is spread out across the US. Everyone at FBS is free to live and work in the places they thrive. We’re people-first and 100% employee owned, so as a co-owner you’ll share in the company’s growth and success. At FBS, you get entrepreneurial energy, innovation, big thinking, and the opportunity to meaningfully shape the future of company and its products. Collectively, we’ve run a profitable and popular business for 30+ years and we’re excited about the road ahead.</p>            </div>                        </div>",
    "urlFetchPending": false,
    "published": "Apr 29, 2017 1:04:38 PM",
    "tags": [
      "TECH2_user-interface",
      "TITLE1_designer",
      "TECH2_responsive-design",
      "TECH2_interaction",
      "REMOTE1_100",
      "TECH2_design",
      "TECH2_product-design",
      "REMOTE2_America"
    ]
  },
  {
    "id": "HkpKpVkrSyu0xIfrRkUXrw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29221?r=rss2",
    "title": "Inman: Contract Designer",
    "content": "<p>Contract</p><p><strong>(Anywhere)</strong> </p><p>The real estate community around the world turns to Inman News first for accurate, innovative and timely information about the industry. Known for its award-winning journalism, cutting-edge technology coverage and forward-thinking events, Inman is the industry’s leading source of professional real estate information.</p><p>Our creative team is looking for a freelance designer specializing in user experience, digital,  and events. This is a contract, remote position working on a variety of web-based projects and event design. We are looking for freelancers anywhere in the US with availability for up to 40 hours a month. <br></p><p>Key Responsibilities</p><ul><li>Concept, design and art direct landing pages, websites and digital marketing assets for Inman events, digital products and our sales team</li><li>Concept and design logos, graphics and visuals for event signage and event structures</li><li>Select colors, images, text style, and layout to be used and introduce them to designs in a way that works with an existing branding toolkit -- while remaining imaginative</li><li>Digital production, including preparing files for web development team and designing social media graphics</li><li>Basic print production, including building print-ready files</li></ul><p>Key Skills</p><ul><li>3+ years’ experience, with a portfolio demonstrating proficiency in UX design, landing page and website design and mobile/responsive design</li><li>3+ years’ experience designing to brand style guides experience conceptualizing individual marketing campaigns. </li><li>Experience in digital publishing preferred; multimedia (email, websites, landing pages, video, infographics) experience a plus</li><li>An eye for typography, whitespace, and other details that occur at the intersection of design and code</li><li>User experience design for digital interfaces, both web, mobile, email</li><li>Must have solid production skills with Adobe Creative Suite and Sketch</li><li>Responsiveness and ability to self-start and be highly productive in remote setting</li><li>Ability to communicate clearly and articulate concepts and ideas</li><li>Thick skin and a true self-starter who can act decisively in complex environments</li><li>Brings energy and passion to everything they do, and will not be afraid to roll-up his/her sleeves to tackle projects both big and small</li></ul><p>Inman is an equal opportunity employer committed to building an inclusive workplace environment.</p><p>This is a contract, remote position.</p><p>To apply, please send a résumé, cover letter, a link to a robust online portfolio and your level of involvement in each concept/deliverable. </p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Apr 28, 2017 6:50:57 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "gtL18vNeSqibQiIRkeXQaw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29216?r=rss2",
    "title": "PRI: Senior Designer",
    "content": "<p>Contract</p><p><strong>(Manalapan,NJ)</strong> </p><p>PRI is seeking an experienced, highly-skilled Senior Designer for one of its key clients MUTTS. The position is a full time six month contract position with a potential to hire full time after six months at which time company benefits will be available (health insurance, 401k, paid holidays and PTO).</p><p>MUTTS is a brand with followers so loyal they tattoo us on their skin — literally! Drawn by award-winning cartoonist Patrick McDonnell, the MUTTS comic strip appears in over 700 newspapers in 20 countries. MUTTS has been described by Peanuts creator Charles Schulz as “One of the best comic strips of all time.”</p><p>We’re looking for an energetic, fun-loving Senior Designer to join our team in overhauling the MUTTS.com website and creating various branded product collections from start to finish for our accompanying ecommerce site.</p><p>The ideal candidate will be a Jane- or Jack-of-all-trades type of designer with high skill levels in both product design and UI/UX website design. The Senior Designer should be able to combine user experience principles and visual design to build intuitive and attractive websites, mobile applications, and other digital experiences. This person will also execute the seasonal design development process from concept to delivery by creating original, trend-appropriate design concepts that are on-brand, meet audience needs, and drive sales — and ensure the timely execution of each stage in the development process.</p><p>UI/UX Responsibilities</p><ul><li>Evaluate/audit user experience flows and provide actionable suggestions for optimization.</li><li>Design web-based interfaces for our brand website — which includes an ecommerce site — and mobile sites, taking into consideration all aspects of the user experience.</li><li>A deep understanding of how typography and images in design can be used to communicate clearly and create a specific user experience.</li><li>Possess a thorough understanding of how to best optimize and design interface elements (like buttons and dropdown lists) or navigation components (like search fields and tags) or informational items (like user response messages and progress bars).</li><li>Remain well-versed in best practices for usability and accessibility. Both areas require an eye for design and close attention to detail.</li></ul><p>Product Design Responsibilities</p><ul><li>Strategy &amp; Innovation<ul><li>Develop and maintain an understanding of our target customer and take into consideration competitors’ products and emerging trends; pull and review fabrics, design concepts, mood boards for meetings, mock-ups, color-ups.</li><li>Execute development of new products and design collections based on a theme that can be carried through an entire range of products.</li></ul></li><li>Operations &amp; Results<ul><li>Design according to style guide and sales needs; ensure timely execution of product development calendar.</li><li>Create Illustrator/Photoshop sketches; review specification sheets and line sheets; ensure maintenance of designs in task management system and/or shared drives.</li><li>Select and review raw materials and trims; ensure maintenance of fabric/trim library.</li><li>Approve lab dips and ensure consistency with color standards and licensor directives, where appropriate; review prints and graphics where appropriate and advise revisions; manage fit process.</li></ul></li><li>Customers &amp; Relationships<ul><li>Coordinate follow-up with internal and external vendors and partners, including technical design, production, and vendors; be accountable for interoffice communication regarding product design progress.</li><li>Build collaborative relationships with vendors and internal customers.</li></ul></li></ul><p>Requirements:</p><ul><li>Experience in designing and iterating on websites</li><li>Quantitative and user behavior analysis skills</li><li>Excellent written and verbal communication skills</li><li>Proficiency in Adobe Illustrator, Photoshop, and InDesign</li><li>Working knowledge of HTML, CSS, Javascript, and Bootstrap or equivalent framework</li><li>Passion for creating experiences in online environments</li><li>Excellent organizational and time management skills</li><li>Ability to multi-task and meet deadlines, highly detail-oriented</li><li>Creativity, technical capability, and sensibility for merchandising; ability to sketch</li><li>Bachelor’s Degree in Design (or portfolio demonstrating equivalent experience)</li><li>4+ years experience in UI/UX design with familiarity of fashion/product design (or vice versa)</li></ul><p>Other Desired Skills:</p><ul><li>Extensive knowledge of garment construction, pattern making, silhouettes, color ways, sewing techniques, fabrication and trim</li><li>Familiarity of print design and manufacturing</li></ul><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Apr 27, 2017 10:03:57 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_locals-only"
    ]
  },
  {
    "id": "8SMXzgu9Rqu_puiPCUPQ3w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29188?r=rss2",
    "title": "Creative Market: Product Designer",
    "content": "<p>Full-time</p><p><strong>(San Francisco, CA or U.S. Remote)</strong> </p><p><strong></strong><strong>Overview</strong></p><p>Creative Market is the platform where independent creators around the world buy and sell digital design assets. Our mission is to help creators around the world turn passion into opportunity. As a Product Designer, you will help make this mission a reality by building strategic growth initiatives within a cross-functional, data-driven product team. You will collaborate with engineers, designers, researchers, and analysts on the entire product lifecycle. You will produce both quick iterative tests and larger features aimed at increasing our MoM growth rate and improving user experience.</p><p><strong>Design Team Purpose</strong></p><p>As a Product Designer, you are the embodiment of the design team’s mission, vision, and principles. These should be reflected in all aspects of your work. You live &amp; breathe brilliant product design thinking and execution. You're passionate about a/b testing, conversion optimization, user experience design, and user research.</p><p><strong>Design Mission &amp; Vision</strong></p><p>Our mission is to create a unique, cohesive experience for our community through one unified design system. Our vision is to balance and improve long-term growth with great user experience across our products and brand.</p><p><strong>Design Principles</strong></p><p>1. Design For Everyone</p><p>2. People Over Pixels</p><p>4. One Brand To Rule Them All</p><p>5. The Details Are The Design</p><p>6. Design Is A Shared Responsibility</p><p>7. Creativity Fosters Community</p><h3>Responsibilities<br></h3><ul><li>Work close with your cross-functional product team to produce fast, effective cycles of product design work.</li><li>Discover, research, and validate opportunities that can make a big impact for our business and users.</li><li>Design clear and simple product design solutions. Navigate complex product system dynamics and user behaviors.</li><li>Write detailed scopes for your design work. Produce realistic timelines for each design cycle required for the project to be completed and successful.</li><li>Build a/b tests that iterate on our existing features and craft new features that are optimized for activation and retention by device.</li><li>Balance using our product design system's elements, patterns, and interactions with evolving them.</li><li>Recommend improvements to our design tools, process, and documentation.</li><li>Own your work. Work closely with the design director to ensure best results.</li></ul><h3>Who You Are</h3><ul><li>Communicative: You start with listening and empathy. You keep others updated on all aspects of your work. You proactively reach out before critical questions or roadblocks become an issue. You speak and write with clarity and brevity. You articulate your decisions clearly, explaining what problems they solve and why.</li><li>Collaborative: You honor and compliment the contributions of your peers. You value receiving and giving feedback. You believe great design is the result of good collaboration because design is a shared responsibility across the team.</li><li>Professional: You hold yourself to high standards of decorum. Your productive, perceptive, honest, supportive, transparent, compassionate and self-controlled. You lack ego and put the best interests of the company and team above your own.</li><li>Learner: You love learning and share what you discover with the team. You pursue tackling new challenges. You stay curious and open about what’s possible.</li><li>User-Focused: You always build things with the end-user in mind. You make sure the team is talking to the right users before, during, and after building product work. You take pride in removing friction at every point of the user journey in our product. You value the time and effort our users invest in our product.</li><li>Detail-Oriented: You sweat the details because you know that millions of people rely on what you’re designing. You balance big-picture thinking with polishing the tiny details. You ensure all details in the UX and UI design work are thorough before the build goes out the door.</li><li>Systematic Thinker: You understand how all components of the system fit together to create a unified experience. You see how new projects will impact the larger system and are able to clearly communicate these dynamics to the project team.</li><li>Passionate: You care about the creative and design communities. You take it to heart when you hear how your work helps our users achieve success or lessens their frustrations. It’s natural for you to over deliver. You want to elevate Creative Market to a highly competitive state in the industry.</li></ul><h3>Skills Required</h3><ul><li>You have a well-rounded knowledge of product systems, design thinking, and what’s possible to execute in code.</li><li>You set a very high bar for product design execution, process, and documentation. You hold the entire team to the same standard.</li><li>You deliver projects on time. You communicate well in advance if a due date needs to move and the reason. You are responsible for the efficiency and effectiveness of your work because the business depends on it.</li><li>You balance qualitative and quantitative data in order to identify and solve complex problems that benefit our business and users. You have experience and passion for using data to improve user experience.</li><li>You think deeply about product design decisions before delivering them to the team. You have a track record of being open to others solving design challenges alongside you. You mentor best practices in design thinking in the team.</li><li>You have a strong desire to grasp the entire site from all our users’ perspectives: shops, buyers, affiliates, and visitors. You're committed to developing an acute understanding of their desires, motivations, and problems.</li><li>You thrive in a fast-faced, dynamic environment. You work well in remote and office settings.</li><li>You are comfortable in Adobe CC, Sketch, and various prototyping tools.</li><li>You actively build relationships across the team.</li></ul><h3>Experiences Desired</h3><ul><li>You have 3+ years working on web and digital product design work. eCommerce and responsive design experience is preferred.</li><li>You have a B.A. or B.F.A. in Design with a focus in one of the following areas: web, UI/UX, product design(or an equivalent level of education).</li><li>You have experience working on a marketplace or eCommerce business.</li><li>You have experience working in a startup environment.</li></ul><h3>We're Offering</h3><ul><li>Location: San Francisco preferred. Remote(U.S. only) opportunities available.</li><li>Competitive compensation</li><li>Stock options</li><li>401(k) plan</li><li>Medical, dental, and vision benefits</li><li>Generous paid time off</li><li>New workstation</li></ul><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Apr 21, 2017 4:26:00 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_locals-only"
    ]
  },
  {
    "id": "zkAlj6ejSYGDSQE3PVnpJw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29173?r=rss2",
    "title": "Ushahidi: Lead UI/UX Designer",
    "content": "<p>Full-time</p><p><strong>(Remote)</strong> </p><p><strong>Description</strong></p><p>Ushahidi is looking for a designer to lead the direction of its users’ experience and design systems. As a designer, you’d work closely with product managers, engineers, and sales staff to develop solutions to users’ problems using primarily the web, iOS, and Android.</p><p>You’d be responsible for providing iterative design direction, including visual design (wireframes and mockups) user testing and detailed description of users’ workflow and interactions with Ushahidi.</p><p><br><strong>Responsibilities</strong></p><ul><li>Collaborate with product, engineering, and sales staff to scope, prototype, design, build, user test, and release software and communication material to users.</li><li>Communicate design direction for solving users’ problems from concept to implementation.</li><li>Lead the development and implementation of Ushahidi’s design systems, including those used in products and marketing collateral.</li><li>Lead user testing process, from low-fidelity testing early in the design process, to high-fidelity tests to improve already-built features.</li><li>Manage the brand and all creative assets of Ushahidi Inc.</li></ul><p><strong>Why you should apply</strong></p><p>You are a thoughtful, creative product designer with a few years of work experience and an interest in international development and social justice. After hacking away at your own projects and/or busting your chops for a while in the corporate world and startups, you’re looking to use your skills to develop software that has a tangible social good.</p><p>New cultures, people and experiences give you energy; you work effectively and efficiently on distributed teams with diverse experience across many time zones. Given the freedom to work anywhere, you are self-guided and can work autonomously. You bring empathy and effective communication to you day to day work. Chaos gives you joy, order is your satisfaction.</p><p>We strongly encourage people from traditionally underrepresented populations in tech - such as women, People of Color, People with Disabilities, and LGBTQ+ people, etc - to apply!</p><p><br></p><p><strong>Requirements</strong></p><p><br></p><p><strong>Minimum qualifications</strong></p><ul><li>A portfolio that demonstrates examples of thoughtful and well-executed product design.</li><li>Ability to present your work, as well as articulate and receive written and verbal feedback.</li><li>Experience with designing responsive web pages and adaptive iOS and Android applications.</li><li>Comfortable working in a global team committed to remote collaboration, across time zones.</li><li>Confident, productive, and comfortable working with autonomy.</li><li>Solid understanding of HTML and CSS (including Sass).</li><li>Experience with Git and GitHub workflows.</li><li>Experience doing UX studies and using user-centric design practices to design products</li><li>Experience with the design thinking process including effective ideation, prototyping, user feedback and implementation.</li></ul><p><strong>Preferred qualifications</strong></p><ul><li>Experience writing complex, custom JavaScript to support (and demonstrate) progressively-enhanced user interactions on the web.</li><li>Experience maintaining and extending a front-end design system or style guide.</li><li>Experience designing in an agile software development environment</li><li>Familiarity with AngularJS.</li><li>Background in graphic design or other visual design field</li></ul><p><br></p><p><strong>Benefits</strong></p><p><strong>About Ushahidi</strong></p><p>Ushahidi started as an ad-hoc group of Kenyan bloggers hammering out code in a couple of days from various locations, trying to figure out a way to gather more and better information about the 2008 post-election violence in Kenya. We have since grown to be a global organization with over 30 staff in seven different countries.</p><p>Ushahidi is a non-profit technology company that builds open source platforms to help citizens, journalists, organizations, governments, and others gather, manage, analyze, and visualize crowdsourced data. Our tools have been used by hundreds of thousands of individuals and organizations fighting for social causes in over 159 countries — whether for monitoring corruption in Zimbabwe, gathering real-time data on local poverty issues, or giving people a voice in the Syrian crisis.</p><p>Everyone at Ushahidi comes to work here because we know that every day people around the world use the tools we build to improve the lives of millions. In other words, in the fight for a better world we are the Q to the 007s out there.</p><p>Our team tends to think big and rewards creativity and an entrepreneurial attitude. Over the past six years, we have also built the iHub – the tech community hub in Nairobi, the BRCK – a redesign of connectivity for the developing world, and other projects like Savannah Fund, AfriLabs, and Crisis Mappers. Our ethos – we don’t just build products, we solve problems.</p><p><strong>Why You Might Be A Good Fit</strong></p><ul><li>Independence. The team agrees upon goals, but how they are accomplished is left largely up to the individuals. Nobody will be leaning over your shoulder telling you what to do everyday, we expect you to be able to do that yourself.</li><li>Team oriented. Desire to work with and support other developers in the team. We rely on team members to support each other, review each others code, and generally help each other keep winning.</li><li>Intrinsically motivated. Ushahidi came from Nairobi, but team members work all around the world. If all you need is a crazy a cool project, wifi, and coffee (or tea), then you’ll fit right in.</li><li>Ability to get things done and ship. We’d love you to write beautiful elegant code every time but getting things done matters. You’ll need to pick the right balance between doing it right and doing it fast.</li><li>Empathy and an interest in helping our user. A desire to work with the community and customers, dig into their use cases, and help them solve problems.</li></ul><p><strong>Why You Might Not Be A Good Fit</strong></p><ul><li>We pay competitively at Ushahidi, however, keep in mind that we are a mission driven non-profit.</li><li>You only want to wear one hat. Ushahidi is growing (25+ employees) but we take on the goals of much larger organizations. In practice this means that all Ushahidians end up wearing multiple hats and working on multiple projects. If that excites you, great! If you are set on never venturing out of your job title, you’re going to get frustrated fast.</li><li>You want to be in an office surrounded by colleagues. You will most likely be operating on your own unless you are based in Nairobi, where about half our team is based. If you need to come into an office and talk to your boss everyday to stay motivated, this job is not for you. Also, we give flexibility and also ask for flexibility to work with different time zones, so you'll need to be comfortable taking meetings at odd hours.</li></ul><p><strong>Why working at Ushahidi is awesome</strong></p><ul><li>Open culture: Ushahidi is a place where you can be your full self and contribute in the way that’s best for you. We distribute decisions to the people who do the work, so you own what you do. And our culture is constantly evolving, with self-defined teams deliberately readjusting four times a year.</li><li>We reward taking risks. Ushahidi works on the bleeding edge of technology for social change, that means taking risks with our efforts. We celebrate swinging for the fences, regardless of the outcome.</li><li>Our goal in hiring is to find great people first, great skills second.</li><li>We don’t care where you live. As long as you have Internet access, live wherever you want. Ushahidi team members currently live all over the world: from Japan and New Zealand, to Nairobi and San Francisco.</li><li>We don’t care when you work. There are no “business hours” at Ushahidi, we are milestone based, not a sit-in-your-chair from 9 to 5 company.</li><li>Quality of life. Ushahidi is a place you can be your full self. Ushahidi attracts workaholics, so we all work hard to make sure everyone has a work-life balance.</li><li>Benefits. Take what you want vacation policy (Minimum 25 days a year), parental leave, allowance for health insurance, allowance for a co-working space.</li><li>We use a transparent <a href=&quot;https://www.ushahidi.com/blog/2017/04/04/working-at-ushahidi-pay-equity-and-creating-a-process-of-transparency-and-inclusion&quot; rel=&quot;nofollow&quot;>pay calculator</a> to determine your salary and to be fair and unbiased.</li></ul><p></p><p><strong>Job Perks:</strong> Open culture Remote workFlexible hoursVacation: Flexible Healthcare providedInternational travel</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Apr 18, 2017 8:38:18 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "0_k33SP-TZyXsTlgdvsQCw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29146?r=rss2",
    "title": "Liaison Technologies, Inc.: UX Designer",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><p>UI/UX Designer</p><p>Location: 100% Remote</p><p>The UI/UX Designer (Interaction Designer) is responsible for creating engaging user interface concepts for various web based applications. You will be responsible for translating requirements into high quality designs that adhere to best practices and pattern consistency. The UI/UX designer will utilize various tools to create work-flows, wireframes, and prototypes with a strong focus on modular design. This role should also be considered a research-based role and requires interaction with stakeholders, product managers, and customers for continuous improvement of application experience(s).</p><p>Responsibilities and expectations</p><ul><li>3+ years of interaction design</li><li>Proficient in Adobe Creative Suite Applications such as Photoshop</li><li>Experience with wire framing / prototyping tools and can lead the effort in standardizing these processes</li><li>Ability to articulate design vision and defend design decisions</li><li>Familiarity with Material Design, Bootstrap, or other modern visual frameworks</li><li>Basic knowledge of front-end web development languages (HTML, CSS, and JavaScript)</li><li>Online portfolio of previous design work</li><li>Availability to travel</li></ul><p>Extra Points</p><ul><li>Has experience helping shape the direction and standardization of a new UX team</li><li>Enterprise-level application design</li><li>Previous development experience</li></ul><p>About Liaison Technologies </p><p>Liaison Technologies is a growing and energized global Integration and data management services company providing unique and high-value services to move, transform and manage business information in the cloud. With a comprehensive array of business-to-business and application-to-application integration and data transformation services, Liaison's practitioners implement data management infrastructures adapted to each client’s specific business requirements. Headquartered in Alpharetta, Liaison has additional offices in both the U.S. and Western Europe. For more information visit our corporate website at <a href=&quot;http://www.liaison.com&quot; rel=&quot;nofollow&quot;>www.liaison.com</a>    </p><p>Liaison Technologies offers competitive pay and a generous benefit package to all of our full time employees that include FREE medical, dental and vision plans, 401K matching, STD/LTD, wonderful PTO schedules, and 10 paid holidays per year. We also have a great work environment that includes a game room, free beverages, Bagel Fridays, and many fun events throughout the year.   Come join our team of talented and motivated employees!  </p><p> Liaison Technologies is an equal opportunity employer. It is the policy of Liaison technologies not to discriminate in hiring and employment on the basis of race, color, religion, national origin, sex, disability, age or any other protected class in accordance with all applicable federal, state and local laws.</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Apr 11, 2017 12:13:15 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE2_Europe",
      "REMOTE1_100"
    ]
  },
  {
    "id": "2JjsJoNSQnqBoElwnIUMYQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29137?r=rss2",
    "title": "Precision Nutrition: Interaction Designer",
    "content": "<p>Full-time</p><p><strong>(Remote from Canada)</strong> </p><p>At Precision Nutrition, we work remotely to allow our team to accomplish both their professional and personal ambitions, without trade offs. Want to travel the world and work with a brilliant team? You can. Want to spend time with your young children and work from home? You can do that too. This is how we live our lives at PN and we'd love to share that possibility with you.</p><h2>Who we're looking for</h2><p>We're looking for an interaction designer to join our team. But more importantly, we're looking for a very specific person.<br></p><ul><li>Someone with the capacity to listen, think, and consider what other people are saying to flesh out a broader understanding of hard, complex problems.</li><li>Someone who's willing to be open-minded, considerate, vocal, cool, and be able to reason your way through something.</li><li>Someone who happens to have an incredible ability to design beautiful products.</li></ul><h2>Who we're <em>not</em> looking for</h2><ul><li>Someone who wants to takes days to make the perfect version of a prototype.</li><li>Someone who values perfection over speed every time.</li><li>Someone who has years and years of experience, is brilliant — but does not have the willingness to be open-minded, considerate, vocal, cool, and reason their way through something.</li></ul><p>Check out our full description and learn more about us at -</p><p><a href=&quot;http://www.precisionnutrition.com/interaction-designer/&quot; rel=&quot;nofollow&quot;>http://www.precisionnutrition.com/interaction-designer/</a><br></p><p></p><p><strong>Job Perks:</strong> Work from home. A flexible schedule. 4 weeks of paid vacation time. Benefits in the US and Canada. Discounts and much more!</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Apr 7, 2017 8:15:21 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "2SqlZIgsQ72FtIl1Di_P-w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29132?r=rss2",
    "title": "Aha!: Visual / UX Designer",
    "content": "<p>Full-time</p><p><strong>(Anywhere in US)</strong> </p><p>Are you a user experience star looking to revolutionize the way people innovate and build software? Do you want to help design something that is changing the way people think about innovation? We are looking for a high energy, hands on UX designer who is looking to take a huge career leap forward – and jump on a rocket. If this is you, we want to hear from you!</p><p>As a UX Designer, you will have an excellent opportunity to join a breakthrough and profitable company that is growing fast. Aha! was founded by a proven team of Silicon Valley veterans whose last two companies were acquired by Aruba Networks [ARUN] and Citrix [CTXS] respectively. Over 100,000 users trust Aha! for their product strategy and roadmaps.</p>We're looking for someone who:<ul><li>Is experienced in UX design for SaaS applications</li><li>Enjoys crossing back and forth between UX and graphic design</li><li>Understands product management and can understand user behaviors and motivations</li><li>Loves to create wireframes and mockups and refine them based on team input</li><li>Wants to have ownership and responsibility of key work and measure the success of new designs</li></ul>We are committed to being great, and we want someone who:<ul><li>Can work at a fast-paced company where the feedback cycle is measured in hours rather than weeks</li><li>Has a &quot;get it done&quot; attitude and a background of delivering beautiful work again and again</li><li>Is seeking a career-defining opportunity and a proven, results-oriented team which has sold multiple software companies</li></ul><p><em>We are building a distributed team and you can work from anywhere in the United States for this role. We offer generous salary, equity, benefits, and a profit sharing program to the right candidates.</em></p><p><strong>For immediate consideration, please send you resume and portfolio in an email to: <a href=&quot;mailto:Design-jobs@aha.io&quot; rel=&quot;nofollow&quot;>Design-jobs@aha.io</a>. If you have the right background we will quickly follow up with you. We are not working with recruiters or third party agencies.</strong></p><p></p><p><strong>Apply:</strong> Please send your resume and portfolio directly to: Design-jobs@aha.io </p>",
    "urlFetchPending": false,
    "published": "Apr 7, 2017 12:35:12 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "qU7sTDCYTmemvwczxvGyIw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29100?r=rss2",
    "title": "Minds On Design Lab: Laravel and Vue.js Developer for Good",
    "content": "<p>Freelance</p><p><strong>(Anywhere (USA))</strong> </p><p>We need an experienced Laravel Developer with extensive Vue.js and single page application experience. You are a professional, able to work remotely, and during regular regular work ours (9am - 5pm Eastern) to produce high quality code for fantastic organizations.</p><p><strong>About MOD-Lab</strong></p><p>MOD-Lab specializes in working collaboratively with nonprofits to enhance their communication and program teams with senior design and web development resources.</p><p>The organizations we work for inspire us everyday with their commitment to doing good. We are a distributed team with a home base in Brooklyn, NY.</p><p><strong>General Requirements</strong></p><ul><li>Agency Experience (small or large)</li><li>Excellent communication skills</li><li>Must be available to work during normal business hours (9AM – 5PM EST) and set and adhere to a schedule reliably</li><li>Experience working remotely with a distributed team</li><li>Meticulous about quality, you test your own work</li></ul><p><strong>Specific Requirements</strong></p><ul><li>Expert knowledge of PHP and MySQL</li><li>Expert knowledge of JavaScript, Vue.js</li><li>Expert knowledge of Laravel</li><li>Experience building and converting Single Page Apps</li><li>Experience with Templating frameworks (Twig and Blade)</li><li>HTML5, CSS3, Sass (Bourbon suite, Foundation, ...)</li><li>Git &amp; Gitflow</li><li>Vagrant</li><li>Experience with LAMP server setup and administration (Unique technologies like Sphinx search)</li><li>You love the command line</li><li>Custom development for CMS platforms a plus (ExpressionEngine, Craft, Statamic, and/or Wordpress plugins/modules/addons)</li></ul><p><strong>Freelance Partner</strong> </p><p>We have a collection of project work with an expectation of about 15-20hrs per week through end of spring along with excellent potential to continue beyond that.</p><p><strong>Independent Candidates only! - No firms/agencies please.</strong></p><p>If interested in enhancing our team, please respond with what you feel is best to showcase your ability to address our needs. Please include your desired hourly rate and we welcome a resume, portfolio, or other details about your like kind work.<br></p><p></p><p><strong>Job Perks:</strong> - Remote work with a reliable commitment of hours- Professional and supportive team- Inspiring clients and projects</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Apr 3, 2017 9:57:39 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "jvgPxvkvT1-IxblaHoOxkA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29063?r=rss2",
    "title": "Teaching.com: Product Designer",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><p>Join the team at Teaching.com to build engaging products that make learning and teaching fun!</p><p>Are you passionate about applying your design skills, knowledge and expertise to help build the future of education online? Join our team at Teaching.com, where you’ll work on exciting and engaging educational products including Typing.com, EduTyping, iAcademy, Nitro Type and more!</p><p>As a product designer at Teaching.com, you will help make learning accessible to our growing community of more than 20 million students and teachers around the world. We are a lean, rapidly growing company that’s nimble like a startup, but established enough to skip the jitters and all nighters. As we continue to expand our product line, we’re looking for an all-around all-star Product Designer with strong skills in user interface design and front end development.</p><p>We’re a small team that values individual responsibility over imposed hierarchy. You’ll be required to manage your relationships with the founder, design director and developers as you take your early ideas, wireframes and prototypes and build them into fully functioning solutions in a timely fashion. Product designers are responsible for understanding project needs, providing expert direction and suggestion, executing tasks, managing expectations and timelines, and delivering expertly-crafted solutions. You will work collaboratively with our team to directly improve the learning experience for our end users: students and teachers.</p><p>We’re seeking a candidate with strong attention to detail and a proven track record of solving hard problems with simple and elegant solutions. We’re looking for someone who wants to join a growing team, and has the interest/capacity to lead other designers and front-end developers. You will have excellent communication skills, and be prepared to advocate for your work while balancing and incorporating feedback from colleagues and product users.</p><p>This is a remotely-based position.</p><p>Requirements</p><ul><li>A strong portfolio, specifically including product UI/UX design</li><li>A strong understanding of and capacity to write HTML/CSS from scratch</li><li>Passionate about education</li></ul><p>Bonus Skills</p><ul><li>Experience designing applications for young children</li><li>Experience designing applications for teachers</li></ul><p>Compensation, Benefits &amp; Perks:</p><ul><li>Competitive salary</li><li>Medical, dental &amp; vision healthcare benefits</li><li>Unlimited Paid Time Off</li><li>Remote office stipend and hardware assistance</li><li>Flexible office hours</li><li>Annual conference allowance</li><li>Annual company retreat</li></ul><p></p><p><strong>Job Perks:</strong> Competitive salaryMedical, dental &amp; vision healthcare benefitsUnlimited Paid Time OffRemote office stipend and hardware assistanceFlexible office hoursAnnual conference allowanceAnnual company retreat</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Mar 27, 2017 8:51:26 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "0Tn35OhCQ2GllIQjVZX8Dw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29006?r=rss2",
    "title": "Customer.io: Marketing Designer & Frontend Developer",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><p>Hey there! I’m Rachel from Customer.io! Over the next few weeks I’ll be introducing you to our company, more specifically the Marketing Team. We’re really excited to talk to you and hope to hear from you soon :)</p><p><br>-—————<br><br><em>Customer.io's mission is to help businesses communicate with their customers like human beings, through relevance and context.</em></p><p>Customer.io is a behavioral messaging platform that empowers internet businesses to send tailored email (and other types of messages), based on what users are (or aren’t) doing in their product, at scale.</p><p><strong>We’re looking for a new Ami to join the Marketing Team and own the visual design of Customer.io’s public-facing experience</strong> (outside of the product). We’d love our marketing design to exemplify this people-centric mission and amplify our product’s voice!</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Mar 18, 2017 12:58:32 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "5uSKbBRQTymARXL0idJivA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28981?r=rss2",
    "title": "Hotjar: User Interface Designer (Europe)",
    "content": "<p>Full-time</p><p><strong>(Remote)</strong> </p><p>We are looking for an ambitious and driven user interface designer who is passionate about creating engaging, consistent and memorable experiences. Hotjar is a rapidly growing startup that is giving thousands of website owners the tools needed to discover how their visitors are really using their website. In this role you will be iteratively improving the Hotjar user experience and helping us shape the product and company whilst growing with us.</p><p>This is an excellent remote career opportunity to join a fast growing startup in a key position and make a difference in the design community and industry.</p><p><strong>As a User Interface Designer, you will:</strong></p><ul><li>Create thoughtful and appropriate solutions to design challenges of all sizes as you design and build beautiful and engaging user interfaces according to user needs, business requirements and technical constraints.</li><li>Work in one of our multi­disciplinary product teams and collaborate with our Director of Design, stakeholders, engineers and other designers in an iterative, transparent and feedback driven process.</li><li>Translate wireframes and experiences into highly-polished visual composites with a user-centered design methodology.</li><li>Build browser-tested user interfaces using HTML, CSS and basic JavaScript whilst following best practices and Hotjar’s code, style and brand guidelines.</li></ul><h3>Requirements</h3><ul><li>A minimum of 3 years experience designing and building interfaces and digital SaaS products.</li><li>Experience designing interfaces for desktops, tablets and phones.</li><li>Experience in front-end development (HTML, CSS, basic JavaScript).</li><li>Demonstrated ability creating deliverables in the visual design and building stages.</li><li>A passion for detail and a care for great usability and aesthetics.</li><li>Excellent self-starter who always thinks MVP first with the ability to work in a small, startup-style, agile and fast-paced team.</li><li>Fluent in English with excellent written and verbal communication skills.</li><li>Confident in your work without becoming too attached to your designs when constructive team and user feedback is put forward.</li><li>A strong portfolio featuring relevant work examples.</li><li>Must submit to a background check confidentially processed by our third party.</li><li>Assets: Experience in UX research, wireframing and prototyping, experience working embedded in a team of developers, experience working remotely.</li></ul><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Mar 13, 2017 11:57:20 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "ZOXv7AWaQjmMFWFD3UGLgA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28980?r=rss2",
    "title": "Hotjar: Product Designer (Europe)",
    "content": "<p>Full-time</p><p><strong>(Remote)</strong> </p><p>We are looking for an ambitious and driven product designer who is passionate about creating engaging, consistent and memorable experiences. Hotjar is a rapidly growing startup that is giving thousands of website owners the tools needed to discover how their visitors are really using their website. In this role you will be iteratively improving the Hotjar user experience and helping us shape the product and company whilst growing with us.</p><p>This is an excellent remote career opportunity to join a fast growing startup in a key position and make a difference in the UX community and industry.</p><p><strong>As a Product Designer, you will:</strong></p><ul><li>Create thoughtful and appropriate solutions to design challenges of all sizes by translating research insights into beautiful and engaging user interfaces which satisfy user needs, business requirements and technical constraints.</li><li>Work in one of our multi­disciplinary product teams and collaborate with our Director of Design, stakeholders and engineers in an iterative, transparent and feedback driven process.</li><li>Produce engaging experiences using sketches, storyboards, information architecture blueprints and prototypes to collect feedback and iteratively improve and support the design process.</li><li>Translate wireframes and experiences into highly-polished visual composites with attention to interaction design whilst following style and brand guidelines.</li></ul><h3>Requirements</h3><ul><li>A minimum of 3 years experience designing experiences for interfaces and digital SaaS products.</li><li>Experience designing experiences for desktops, tablets and phones.</li><li>Demonstrated ability creating deliverables in the research, user experience and visual design stages on the design process.</li><li>A passion for detail and a care for great usability and aesthetics.</li><li>Ability to prototype ideas quickly and iterate as many times as needed.</li><li>Excellent self-starter who always thinks MVP first with the ability to work in a small, startup-style, agile and fast-paced team.</li><li>Fluent in English with excellent written and verbal communication skills.</li><li>Confident in your work without becoming too attached to your designs when constructive team and user feedback is put forward.</li><li>A strong portfolio featuring relevant work examples.</li><li>Must submit to a background check confidentially processed by our third party.</li><li>Assets: Experience using Sketch, HTML / CSS / JS development, experience working embedded in a team of developers, experience working remotely.</li></ul><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Mar 13, 2017 11:57:20 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "xNMK6UIES2-i4hqmHKlWRg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28939?r=rss2",
    "title": "DramaFever: UX Designer",
    "content": "<p>Full-time</p><p><strong>(New York, NY)</strong> </p><p>What you'll do</p><ul><li>Define and implement design strategy while working with cross-functional teams.</li><li>Contribute to a variety of projects, from strategy to implementation, exercising a wide range of design skills.</li><li>Conduct research, collect insights, and communicate findings to stakeholders.</li><li>Communicate ideas through flows, wireframes, and prototypes.</li><li>Help evolve our design process to adapt to the needs of a fast-growing team.<br></li></ul><p>We’d love if you are</p><ul><li>Opinionated but flexible. You're confident in your approach but able to adapt your methods and skills to the needs of a project.</li><li>Hungry to grow. You have a willingness to learn and embrace new challenges. You seek out opportunities to solve problems.</li><li>Eager to share your knowledge and push others to grow.</li><li>Curious. You don't take things at face value, you dig deeper and discover areas of opportunity.<br></li></ul><p>What we offer</p><ul><li>An incredible team of smart and supportive people.</li><li>Strong support towards career development. We subsidize continuing education, online courses, conferences, and workshops.</li><li>Competitive salaries, 401(k) matching, and flexible paid time off.</li><li>Health, vision, and dental benefits.</li><li>Catered lunches, game consoles, endless snacks, beer and cold brew on tap.<br></li></ul><p><em><br>Please include a link to your portfolio and portfolio password if required. </em></p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Mar 6, 2017 10:43:25 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "lKpnhxJrRXmSr85YbbcVPg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28934?r=rss2",
    "title": "Bandzoogle: Front end designer",
    "content": "<p>Full-time</p><p><strong>(Anywhere (we're in Montreal))</strong> </p><p>Bandzoogle builds tools that help bands succeed online. Our app powers tens of thousands of artist websites and helps them make a living by selling their music and growing their fan base. We've been &quot;bootstrapped, profitable, and proud&quot; since 2003 and are growing fast.</p><p>We're looking for a &quot;designer who can code&quot;. Someone as adept in Photoshop and Sketch as they are in HTML/CSS.</p><p>In this role, you'll be responsible for the look and feel of 30k musician websites. You'll design and build new themes from scratch, manage external designers who are building on our platform, and work closely with the dev team to help improve our theming engine. There are tons of other interesting design challenges in the queue as well (revamping Bandzoogle.com, building out new products), and you'll play a key role in addressing them.</p><h2>Requirements</h2><ul><li>A strong portfolio of live URLs that demonstrates your ability to create modern, responsive web designs.</li><li>Expert level HTML5/CSS.</li><li>Experience with SASS or LESS.</li><li>Experience using Git.</li><li>Productive in a distributed team environment. Our 20 member team is spread across Canada, Europe and the US; we work where we love to be.</li></ul><p></p><p><strong>Job Perks:</strong> - Work on fun projects that empower musicians.- A startup atmosphere, with the stability of a 14 year old profitable company.- Family friendly, flexible schedule.- 100% health insurance coverage.- Reimbursement of home office and co-working spaces.- Reimbursement of learning materials (conferences, etc).- Meetups in fun locations, family included https://www.youtube.com/watch?v=Agpj10Gm-Us</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Mar 4, 2017 5:23:25 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "9L5uUM5oQ_m5rHU5ldNyIA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28915?r=rss2",
    "title": "GatherContent: Designer",
    "content": "<p>Full-time</p><p><strong>(Anywhere in the UK)</strong> </p><p>We’re looking for an experienced, motivated designer with front-end development skills who is excited by the thought of joining a remote-working and growing startup based in the UK.</p><p>We're a SaaS platform which helps teams organise and produce lots of website content. </p><p>You’ll be joining as the first dedicated designer for our marketing team, working alongside our other designer who works on our product. You’ll be responsible for developing our brand style, evolving our marketing website, designing physical things, supporting internal communications, designing display ads, graphics for our social channels, our resources and more. You’ll work closely with others in both our marketing and product teams.</p><p>What we can offer you:</p><ul><li>Remote working- work from anywhere within the UK.</li><li>Family friendly- family always comes first, supported by our flexible outlook.</li><li>Work/life balance- we work a 35 hour week and encourage downtime and a healthy lifestyle. It’s about quality over quantity (one of our values is wellness!)</li><li>32 days annual leave.</li><li>The chance to make a real impact on our business- We’re a small team of 17, so there is a huge opportunity for everyone to contribute, collaborate and make their mark.</li><li>Fun times - Even though most of us work remotely, it’s important we find time to have fun as a team. We get together at the London office every four months for a team day. Past activities include: volunteering on a city farm, mental health workshops, festive wreath making, food tours, yoga, pilates, pizza making (with a rocket scientist), cocktail making,  3D printing workshop, art and clay making workshop, chocolate truffle making, knitting workshop, bowling and wine tasting. There’s a definite eating theme!</li><li>Competitive salary, stock options and pension.</li></ul><p>What we need in return:</p><ul><li>Your undivided passion, energy, focus and enthusiasm for both the role and our business.</li><li>A self-starter attitude with experience managing and prioritising your own workload.</li><li>An ability to get things done quickly (whilst maintaining quality); working to a pace.</li><li>A team-player who works as well with others as well as individually.</li><li>Strong opinions, loosely held - you have no fear when it comes to contributing ideas and participating in discussions with the team. You’re also happy to take critique, self-improve and move forward fast.</li><li>Innovation - you need to be open and willing to adopt new ways of working. Our processes are constantly evolving and we always look to take a lean approach.</li><li>Customer focus - You should always be thinking, “What can I be doing to deliver more value to our customers?”</li><li>Leave your ego at the door. We make decisions based on what’s right for the company, no exceptions. If you can’t work this way, please don’t apply.</li><li>Integrity- you do the right thing and know how to set expectations</li><li>Direct feedback- you’re comfortable giving and receiving feedback</li><li>Continuous improvement- you’re always looking for ways to better yourself and company processes</li><li>Wellness- you live a balanced routine and avoid heroism and burnout</li></ul><p>We’re looking for someone who:</p><ul><li>Has lots of experience in designing across different platforms, from digital to print.</li><li>Has a strong portfolio that demonstrates your experience.</li><li>Is a stickler for detail and consistency, who can balance solving for now and thinking about the bigger picture.</li><li>Has strong visual design skills, but can strike a perfect balance between beautiful and usable.</li><li>Has illustration skills and is actively looking to improve them.</li><li>Has the ability to quickly create prototypes to communicate thoughts and ideas.</li><li>Has the ability to distill complex problems down into thoughtful solutions.</li><li>Has experience with building what they dream up in HTML, CSS and JavaScript  (we also have a fantastic team who would be pleased to help here).</li><li>Has experience testing, iterating and improving their designs using real data.</li></ul><p>Bonus points if you have experience:</p><ul><li>Working in a marketing team for a SaaS or online product business.</li><li>Working in an in-house B2B product marketing team.</li><li>Working as part of an agile team.</li><li>With simple animation, video, photography, copywriting.</li></ul><p>Responsibilities:</p><ul><li>Working with the marketing team to plan and deliver design work for our website or any campaigns we have running</li><li>Working with our Product Designer to develop our company style guide and drive visual strategy, as well as ensuring design consistency across the entire business</li><li>Managing your own workload from a backlog of tasks.</li><li>Help us turn design into a competitive advantage.</li></ul><p>Finer details:</p><ul><li>Start date - as soon as possible (note, our hiring process can take up to two months).</li><li>Pay - dependent on your experience.</li><li>Full-time role (35 hours a week).</li><li>Based anywhere in the UK. This is a remote position.</li></ul><p>Please be aware that although the position is remote, we may need you to travel to London during the interview process and will need you to come in for a team day every four months, if you’re successful. We’ll cover the costs of your travel.</p><p>Think you’re the person we’re looking for? Here’s how to apply: </p><p>Submit a cover letter with answers to the following questions;</p><ul><li>Why do you want to work at GatherContent?</li><li>Can you share a piece of work that you’re proud of, or that you think represents an important part of your philosophy?</li><li>Can you tell us about a problem you’ve had to solve, and how you went about solving it?</li><li>Can you give us a brief description of your background (NOT a resume or CV)?</li></ul><p>You also need to include the word ‘pomegranate’ in your cover letter to show that you’ve read the job role (this helps us weed out time wasters!)</p><p>We look forward to seeing your application.</p><p><strong>What happens next?</strong></p><p>We're closing applications for this position on March 30th 2017 and the interview process will then take around a month.</p><p>We review all of the initial applications, screen for technical ability, attention to detail and general suitability.</p><p>Applicants who submit successful cover letters will go through to a remote values interview. Following that, the next round involves a remote skills interview. Applicants who get through these stages will be assigned a paid homework project. If the homework assignment is successful you may then need to meet our founders in London for lunch and a chat. We’ll cover any travel expenses and are happy to fit this in around your schedule if you currently have a job.</p><p>Lastly, we will then be in touch to let you know if you are successful :)</p><p><strong>What is GatherContent?</strong></p><p>GatherContent is a SaaS platform which helps teams organise and produce lots of website content. The platform enhances content development workflow, saving our customers time and money.</p><p>We launched in 2012 and have bootstrapped our way to profitability.</p><p>GatherContent is used by thousands of customers all over the world including Intel, Ogilvy, JWT, Spotify and Harvard University.</p><p>GatherContent has a small office presence in London but we are remote by default. The team works from up and down the UK.</p><p><br><br></p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Mar 2, 2017 1:54:23 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_locals-only"
    ]
  },
  {
    "id": "LW1boEDlTCCw2-R5NUSpyg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "indeed.com-1",
    "url": "http://www.indeed.com/job/Senior-Embedded-Software-Designer-at-Schneider-Electric-in-Andover,-MA-2baade2957bca75b",
    "title": "Senior Embedded Software Designer - Embedded Data Analytics - Schneider Electric - Andover, MA",
    "content": "<div><b>Senior Embedded Software Designer - Embedded Data Analytics</b><br><span>Schneider Electric</span>     -<span>Andover, MA</span>    </div><span>Senior Embedded Software Designer - Embedded Data Analytics-003GWV<br>Join Schneider Electric and power your career!<br><br>Discover the opportunity to join an international, dynamic, and responsible company that fosters the development of all its people around the world. Every day, we empower employees to achieve more and experience exciting careers. Find out how our values and unique position make Schneider Electric the employer of choice.<br><br>Schneider Electric is connecting millions of smart devices from buildings, data centers, industrial plants and infrastructure to the Cloud to provide innovative solutions to address sustainability, remote operations and analytics. To do this Schneider Electric is innovating with cutting edge technologies in the Internet of Things (IoT) space. As part of the Schneider IoT &amp; Digital Transformation / Embedded Device intelligence platform, we are looking for a Senior Embedded Software Architect/Developer to join our team.<br><br>In this role, you will participate in experimentation and proof of concepts around embedded analytics and machine learning. The goal is to identify the HW and SW components that are required to address Schneider use cases in this area and provide input for the next generation of embedded platforms.<br><br><b>Responsibilities</b><br><ul><li>Participate in the different phases of proof of concepts related to embedded analytics and machine learning :<ul><li>Exploration: collect data about HW or SW platforms that provide solutions for embedded analytics as well as use cases related to Schneider business.</li><li>Definition: Formalize the architecture and features to be implemented in those proof of concepts</li><li>Implementation</li><li>Documentation and reporting: Create reports and documentation to ease transfer to the platform if the technology is selected</li></ul></li><li>Participate in other mockups activities related to the platform: Connectivity, interoperability , runtime environments and much more!</li><li>Participate in the support activities for internal clients</li></ul><br>Qualifications<br><b>Desired Skills &amp; Experience</b><br><ul><li>BA or MS in Computer Science or Computer Engineering (or equivalent)</li><li>10+ years of experience in embedded software development and Architecture</li><li>Experience with C/C++, Java and Python</li><li>Experience in IoT platforms with focus on the embedded side</li><li>Experience with analytics, data bases, algorithmic</li><li>Knowledge of hardware acceleration and parallel processing on GPU and FPGA through OpenCL and/or CUDA or equivalent</li><li>Good communication skills written and verbal</li><li>Experience in embedded software architecture on Linux</li><li>Experience in Network and communication in embedded applications</li></ul><b>Additional qualities we desire include the following:</b><br><ul><li>Knowledge in machine learning frameworks : TensorFlow, Caffe …</li><li>Knowledge in machine learning in industrial applications</li><li>Knowledge of Real time operating systems and ARM processors</li><li>Autonomous and self learner</li><li>Ability to work in a multi-site and international environment</li></ul><br>Care. Connect. Challenge. Commit.<br>Our values define our company. Who we are, our customer approach, how we do business, what it’s like to work here, and the kind of people we want to attract and retain. We care for our planet, our customers, our company, our team, and ourselves. We connect to customers and colleagues; we are open and respectful. We challenge others and embrace challenges ourselves. We commit to change by leading the change.<br><br>At Schneider Electric, because we value our employees, we offer a competitive benefits package that includes medical, dental and vision, matching 401(k), training and development opportunities and much more. Join Schneider Electric and together, let’s make the most of your energy.<br><br>Schneider Electricis an Equal Opportunity Employer Minorities/Women/Veterans/Disabled.<br><br>Primary Location:United States-Massachusetts-Andover<br><br>Schedule:Full-time<br>Unposting Date:Ongoing</span>",
    "urlFetchPending": false,
    "published": "Apr 24, 2017 10:32:37 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "qy7CbozRSRC6a0z19EgoFA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Visual-UX-Designer/2482815",
    "title": "Visual UX Designer - Océ - (Venlo, The Netherlands) - FullTime",
    "content": "<li>          <a rel=&quot;nofollow&quot;>                 Océ</a>              (Venlo, The Netherlands)          </li><li>                  Fulltime Job        </li><h2>Visual UX Designer</h2><p><i>Do you have a proven passion for visual designs? Do you think user experience is key? Get in touch with us! </i></p><p><br><br><b>Visual UX Designer</b></p><p><br><br><i>Designing high quality products creating appealing user experiences for our customers worldwide</i> </p><p></p><b>Your job as Visual UX Designer </b><p><br><br>As a member of the Visual UX team you have the responsibility for the visual designs in our products by creating an attractive unified user experience that delivers a seamless flow to our customers and users.<br><br><br><br>You work intensively with Interaction Designers on the development of concepts for the user interface of our software products and devices. You create appealing graphics, dynamic transitions and translate designs into a style guide or a specification. Moreover, you make sure all concepts are aligned over all products and devices. Together with (external) developers you make sure your designs are correctly implemented. <br><br><br><br>You are sensitive to ‘the latest and greatest’ in the world, translating trends into an inspiring vision for future development of visualizations and user experience. You push the visual style forward and create patterns within brand standards. This position is based in Venlo, the Netherlands, and you report to Manager Océ Design. <br><br><br><br><b>What do we have to offer you? </b><br><br>We offer you a job in an open and creative environment within an international organization, where you work with other designers and developers on usability and interaction for products and devices. Your contribution is essential for building an appealing user experience and you work on a variety of projects within product development. <br><br><br><br><b>And there is more….</b><br><br></p><ul><li>A competitive salary, thirteenth month payment and holiday allowance<br><br>38 vacation days<br><br></li><li>A 40-hour week with flexible hours and the option of partially working from home<br><br></li><li>A company laptop and mobile phone<br><br></li><li>Commuting allowance</li></ul><br><p> <br><br><b>Who are we looking for?</b><br><br></p><ul><li>Bachelor or Master degree in a relevant field with focus on Visual User Experience design.<br><br></li><li>Preferably have 3-5years relevant working experience, or you are graduated recently and are looking for a job within product development with a focus on visual user experience.<br><br></li><li>A portfolio showing your proven passion for developing high quality products with optimal visual designs and user experience.<br><br></li><li>Proven skills with design tools such as Adobe Creative Suite (Photoshop, Illustrator, InDesign) and with programming in HTML5 and <span>CSS</span>.<br><br></li><li>You are a team player, take initiative, strive for quality and you are able to set the priorities right and can deal with uncertainty.<br><br></li><li>You have strong communication skills and like to work in cross-functional teams. Fluent in English, verbal and written. Profound knowledge of Dutch is a plus.<br><br></li><li>Eligible to work in the Netherlands.</li></ul><b>Context of the position </b><br><br><br><b>About Océ </b><br><br><br><b>Request further information or apply now </b><br><span>EXTERNAL</span><b>Apply’ </b><br><br><b>1 May 2017.</b><br><br><b><i>Agency calls are not appreciated.</i></b><p><span>INTERNAL</span>: For more information about this position, contact Carlijn Compen, Manager Océ Design, T +31 (0)77 359 2285 or Richard Scheijde, HR Manager, T 5194. Or you can apply directly by sending your letter of motivation and curriculum vitae via the<b> ‘Apply’ </b>button.</p><p>The referral hiring program is applicable to this position.</p><p>Please submit your application before <b>1 May 2017</b>.</p><i>Keywords: Jobvacancy, Full-time, Helmond, Limburg, Canon, Visual design, User experience, UX, software development, usability</i><h3>How to apply</h3><a href=&quot;https://oce.redirect.your-jobresponse.com/v/142601/V1114/apply&quot; rel=&quot;nofollow&quot;>https://oce.redirect.your-jobresponse.com/v/142601/V1114/apply</a>",
    "urlFetchPending": false,
    "published": "Apr 11, 2017 12:55:33 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America",
      "TECH2_Design"
    ]
  },
  {
    "id": "KO5S65LkQYmDPo0Sd99ZIQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Mobile-UIUX-Motion-designer/2479252",
    "title": "Mobile UIUX/Motion designer - Touchlab - (New York) - FullTime",
    "content": "<li>          <a rel=&quot;nofollow&quot;>                 Touchlab</a>              (New York)          </li><li>                  Fulltime Job        </li><h2>Mobile UIUX/Motion designer</h2><div><div>At touchlab we build engaging, brilliant experiences for devices you watch, touch, and wear with enterprise, brand, civic, and startup partners. Over the last year we have grown from our &quot;100% Android” roots to bring the same excellence across platforms.</div><div><br></div><div>As an experienced <span>UIUX</span>/Motion designer, you have a deep understanding of mobile design patterns and you’re fluent in the design languages of both Android and iOS. You know the rules and know how to break them to create amazing interfaces centered around the user.</div><div><br></div><div>Your relationship with developers is seamless, and you can communicate design thinking effectively with a keen awareness of unique platform boundaries and capabilities.<br><br></div><div><strong>Responsibilities</strong></div><ul><li>Create and develop design assets including but not limited to wireframes, user flows, iconography, and high-fidelity mockups</li><li>Communicate design intent and rationale across internal and external teams</li><li>Collaborate in a variety of contexts with external developers, designers, and researchers</li><li>Help develop test plans and user research practices</li><p></p></ul><div><br></div><div><strong>Qualifications</strong></div><ul><li>3+ years experience in <span>UIUX</span> design</li><li>Examples of your work in live products</li><li>Examples of in-production motion design</li><li>Ability to clearly and consistently communicate design intent and rationale</li></ul></div><h3>How to apply</h3><a href=&quot;https://goo.gl/E9XGdg&quot; rel=&quot;nofollow&quot;>https://goo.gl/E9XGdg</a>",
    "urlFetchPending": false,
    "published": "Mar 28, 2017 9:06:58 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America",
      "TECH2_Design"
    ]
  },
  {
    "id": "fFXNt3ozShKXEnpaRDRbAQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Freelance-Designer-Needed-for-Various-Projects/2477247",
    "title": "Freelance Designer Needed for Various Projects - Digital Elite - (Europe) - Freelance",
    "content": "<li>          <a rel=&quot;nofollow&quot;>                 Digital Elite</a>              (Europe)          </li><li>                  Freelance Job        </li><h2>Freelance Designer Needed for Various Projects</h2><p>We’ll keep this short.</p><p>Here’s why people love being part of the Digital Elite team:</p><ul><li>Work from anywhere, any hours (we just care that your deadlines are met)<br></li><li>Quick and easy to get started, with online contract signing<br></li><li>Fast payment, usually within 7 days<br></li><li>Build relationships directly with our clients<br></li><li>Plenty of repeat business (we have never worked with a contractor for a single project)</li></ul><p>We are looking to add a designer to our team to help with various projects and work, your skills should include some or all of the following:</p><ul><li>Digital Design<br></li><li>Graphic Design<br></li><li>Illustrator<br></li><li>Photoshop<br></li><li>InDesign<br></li><li>PowerPoint<br></li><li>Sketch</li></ul><p>You love turning complex ideas and concepts into simple, clean, graphical representations. Here are some words from our clients brand books – clean, pure, simple, minimalist, fresh, cool, white.</p><p>You value openness, transparency, honesty, attention to detail and no bullshit. You’re comfortable working remotely, with steady, ongoing part-time availability.</p><p>Our average day rate for contractors is between £300/day and £350/day. Please note that you <strong>must</strong> be based in Europe.</p><p>More about us here https://www.digitalelite.co.uk/about/about-us.</p><h3>How to apply</h3><a href=&quot;https://www.digitalelite.co.uk/contractors/join-us/&quot; rel=&quot;nofollow&quot;>https://www.digitalelite.co.uk/contractors/join-us/</a>",
    "urlFetchPending": false,
    "published": "Mar 17, 2017 9:06:08 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America",
      "TECH2_Design"
    ]
  },
  {
    "id": "zg5v-JEgSnakIaoKMi_Ymw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Front-end-designer/2476617",
    "title": "Front-end designer - We Make Websites - (London) - FullTime",
    "content": "<li>          <a rel=&quot;nofollow&quot;>                 We Make Websites</a>              (London)          </li><li>                  Fulltime Job        </li><h2>Front-end designer</h2><p>We Make Websites make the best fashion and e-commerce websites on the internet and we are looking to expand our in-house talent to match client demand.</p><p>We work with extraordinary brands such as Skinnydip London, Finisterre, Condor Cycles, Penguin Books, National Portrait Gallery and The Economist. We are a small, notorious team that make a big impact in the e-commerce industry.</p><p>We are looking for a talented and dynamic front-end designer to help us build beautiful e-commerce websites for fashion forward brands. Someone who really cares about the client journey and final result, not just getting the job finished on time. We are the world’s most trusted Shopify Plus agency, so we looking for people that can design polished e-commerce experiences that are visually stunning on all screen sizes.</p><p>As a front-end designer, you’ll primarily be designing and building Shopify e-commerce stores. What we’re looking for is a creative person with a great eye for design and a can-do attitude.</p><p>What are we looking for?<br><br>- An awesome portfolio of work (please send a link to your portfolio when you apply).<br><br>- Someone passionate about design concepts, typography, and delivering beautiful projects.<br><br>- The ability to deliver designs that adhere to brand and design guidelines.<br><br>- Experience working with Sketch, Photoshop and Illustrator. <br><br>- Excellent visual and user-focused design skills with an eye for detail.<br><br>- A good awareness of industry trends that can help us produce better work.<br><br>- Ability to communicate with clients.<br><br>- A good understanding of usability and design patterns.<br><br>- Excellent communication, organisation and time management skills.<br><br>- Great responsive <span>HTML</span>/<span>SASS</span> skills.</p><p>What you’ll be doing…<br><br>- Designing professional e-commerce stores for a wide range of retail brands.<br><br>- Producing prototypes using Invision and communicating directly with clients about your ideas.<br><br>- Creating wireframes and high-fidelity website designs.<br><br>- Bringing design concepts to life using <span>HTML</span>/<span>SASS</span>/JavaScript (jQuery).<br><br>- Working closely with the project and account managers to deliver projects that are the best in the industry.<br><br>- Collaborating and share ideas with the rest of the design and development team.</p><p>Desirable skills<br><br>- Experience with Shopify.<br><br>- Experience designing e-commerce websites.<br><br>- Knowledge of <span>SASS</span> and <span>LIQUID</span> (Shopify’s templating language).<br><br>- Relevant experience in an agency or in-house and/or a degree in digital media design (or similar)</p><p>Benefits<br><br>- 28 days paid holiday per year + your birthday off. Office closed Christmas to New Years; work from home or take as holiday.<br><br>- Fun, challenging projects for interesting, creative clients.<br><br>- An inspiring, comfortable and social office on Leather Lane market in Farringdon – in house bake off competitions, work lunches and nights out are commonplace. Also, don’t worry, we don’t do fancy dress.<br><br>- Add great achievements to your CV, we’re a small team and your influence will be direct with some big and well-known brands. Last year alone we doubled in size and you’ll have the chance to shape how we grow this year and beyond.<br><br>- Free coffee, fruit and snacks at your disposal via our weekly Amazon drone order.<br><br>- Company pension scheme to see you into old age.<br><br>- We invest in our team and aim to provide anything you need to expand and nurture your skills including courses, equipment and training.<br><br>- Add great achievements to your CV, we are a small team and directly influence well-known brands e-commerce success.</p><p>Job Type: Full-time salary: £24k – £45k /year (based on experience).</p><h3>How to apply</h3>",
    "urlFetchPending": false,
    "published": "Mar 15, 2017 1:04:14 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America",
      "TECH2_Design"
    ]
  },
  {
    "id": "pNJbB-J9T06N4xmojezDJA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Web-Designer/2475394",
    "title": "Web Designer - U.S. News & World Report - (Washington) - FullTime",
    "content": "<li>          <a rel=&quot;nofollow&quot;>                 U.S. News &amp; World Report</a>              (Washington)          </li><li>                  Fulltime Job        </li><h2>Web Designer</h2><p>U.S. News &amp; World Report has an immediate opening for a Web Designer. This position requires an excellent eye for design, coupled with a keen ability to understand user needs, behaviors, and motivations. You should have strong Photoshop/Illustrator skills and be comfortable with <span>HTML</span>/<span>CSS</span>. Strong organizational and communication skills, attention to detail, and ability to meet deadlines are also required.</p><p>Duties Include:</p><p>*Participate in the requirements definition process with Product Management, Tech, and other key stakeholders<br><br>*Work with engineering counterparts as needed to clarify requirements and solve design challenges<br><br>*Create wireframes, high-fidelity mock-ups, usage scenarios, specifications, navigation maps, and other UI design documents<br><br>*Work with sales and marketing to create banner ads, microsites and other sales collateral<br><br>Assist in user research and requirements gathering</p><p>Qualifications:</p><p>*Excellent graphic design skills (Illustrator, Photoshop)<br><br>*Proficient with <span>HTML</span> and <span>CSS</span><br><br>*Experience with Javascript, <span>SCSS</span> is a plus<br><br>*Comfortable working on multiple projects simultaneously<br><br>*An online portfolio of your work</p><p>Why you want this job…</p><p>*Your work matters. The design work you do here will have a direct impact on our bottom line and your opinions will help shape products used by thousands of people every day.<br><br>*Variety. U.S. News has dozens of products. One week you could be working on our college rankings and the next week creating an ad campaign for a Fortune 500 company.<br><br>*Exposure. We have a high traffic site and each month your work will be seen by millions of people.<br><br>*Great work environment. You will have talented co-workers to learn from, keep sane hours, and have interesting projects to work on.</p><p>Work will be done on-site at our offices in the Georgetown area of Washington, DC.</p><p>The U.S. News UX/Design team plays a lead role in product development across the company. We take pride and ownership in our work and are passionate about creating solid, user-centered design. Our ideal candidate will be able to contribute immediately and will both learn from us and teach us a few new things.</p><p>Compensation based on experience.</p><p>We are offering a competitive salary and comprehensive benefits package that includes healthcare, dental, vision and 401(k) plan. Please submit a resume, cover letter and your portfolio to be considered.</p><p><span>EOE</span></p><p>M/F/D/V</p><h3>How to apply</h3><a href=&quot;https://usnews.clearcompany.com/careers/jobs/5b044274-d8e2-e6a0-1cf3-ef9678d84e4c/apply?source=517432-CS-15401&quot; rel=&quot;nofollow&quot;>https://usnews.clearcompany.com/careers/jobs/5b044274-d8e2-e6a0-1cf3-ef9678d84e4c/apply?source=517432-CS-15401</a>",
    "urlFetchPending": false,
    "published": "Mar 10, 2017 9:59:57 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America",
      "TECH2_Design"
    ]
  },
  {
    "id": "wedOj7EnTtupjvBPypRC1A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Graphic-Designer-Full-Time-/2475392",
    "title": "Graphic Designer (Full-Time) - Loloi Rugs - (Dallas, Texas ) - FullTime",
    "content": "<li>          <a rel=&quot;nofollow&quot;>                 Loloi Rugs</a>              (Dallas, Texas )          </li><li>                  Fulltime Job        </li><h2>Graphic Designer (Full-Time) </h2><p>Over the last several years, Loloi Rugs has emerged as one of the most engaging and soulful brands within the rug industry. Graphic design plays an integral role in building our brand, communicating our identity, and engaging our customer. We’re currently seeking a full-time Graphic Designer with experience and passion for creating strong visual communication within a close-knit creative team. Our driven marketing department includes a Marketing Director, Art Director, Director of Photography, two Photographers, two Graphic Designers, and a Production Artist.</p><p>The work includes an exciting range of creative projects: print catalogs, advertisements, brand identity, website UI/UX, environmental design, and more—no two days are quite the same. We work from 9am-6pm, Monday-Friday, with some overtime as needed during busier periods.</p><p>If you’re a passionate Graphic Designer that enjoys a variety of creative challenges and being a part of a growing brand, this is an ideal position for you.</p><p>The Role</p><p>—Create the visual communication for our catalogs, email campaigns, editorial, advertising, product labeling, brand identity, packaging, and more with thoughtful intention behind every design decision.<br><br>—Collaborate regularly with the team on brand strategy and projects. <br><br>—Own the cross-departmental and vendor communications for your assignments. <br><br>—Learn about the business and industry at large to inform better design decisions. <br><br>—Meet deadlines within a fast-paced, always-on work environment.</p><p>Qualifications</p><p>—BFA in Graphic Design or equivalent with at least 1-2 years of agency or in-house experience. <br><br>—No personal ego; just a drive to create inspiring visual communications through thoughtful and on-brand design. <br><br>—A sincere passion for graphic design and brand building. This is what you live for. <br><br>—Positive, upbeat attitude. <br><br>—Expert proficiency in Adobe CS Suite, Photoshop, Illustrator, InDesign and Lightroom. <br><br>—Willingness to work overtime as needed.</p><p>About Loloi Rugs</p><p>Founded in 2004, Loloi Rugs is a fast-growing family-owned company that designs rugs, pillows and throws for the trade market. For more information, visit loloirugs.com.</p><p>View the story behind our craft here: www.loloiexploresindia.com. And view our most recent print catalog here: http://www.coroflot.com/jobs/76200/Graphic-Designer-Full-Time?ref=hp_text</p><h3>How to apply</h3>",
    "urlFetchPending": false,
    "published": "Mar 10, 2017 9:31:02 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_locals-only",
      "TECH2_Design"
    ]
  },
  {
    "id": "-3CJTS0QREu-IjGJCLkrEw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Web-Specialist-Designer/2470978",
    "title": "Web Specialist/Designer - Union College - (Schenectady, NY) - FullTime",
    "content": "<li>          <a rel=&quot;nofollow&quot;>                 Union College</a>              (Schenectady, NY)          </li><li>                  Fulltime Job        </li><h2>Web Specialist/Designer </h2><p>Web Specialist/Designer <br><br>Communications<br><br>FT-Benefit Eligible</p><p>Summary:<br><br>The Web Specialist/Designer is an active member of the Web Working Group whose responsibilities include overseeing the College’s web redesign project and advising on web policy, is the primary designer and content manager for Union’s external website (www.union.edu). The selected candidate will serve as the office’s in-house Drupal and web design expert, and play a significant role in the redesign of the Union College website and the College’s transition to the Drupal content management system. Responsibilities will include optimizing Drupal to improve the quality, presentation and functionality of online content that supports the College’s strategic internal and external communications, assisting campus clients with management of web content, working with the Associate Director to ensure optimal <span>SEO</span> and security of website, and working with the Director on creation and execution of web content strategy.</p><p>Qualifications:<br><br>The position requires a Bachelor’s degree and minimum of three years of professional web experience in a Drupal environment (experience with Acquia is a plus), hands-on experience in the following technologies: JavaScript, JQuery, CSS3, HTML5, responsive frameworks (e.g., Bootstrap, Foundation), <span>PHP</span>, Sass or Less, experience with various Google applications including Analytics, Calendar, Docs, and Drive, and extensive knowledge of digital design methodologies and information architecture best practices across multiple platforms, including email and mobile, and higher education web best practices, including use of diagnostic services to monitor and improve <span>SEO</span>, performance and compliance with <span>WCAG</span> 2.0 accessibility guidelines. Preferred is familiarity with digital asset management systems, including experience managing a consistent taxonomy and metadata, a history of producing and optimizing content for digital vehicles (e-newsletters,  websites and social media), solid writing skills, competency in multimedia applications such as Adobe Photoshop and Final Cut Pro video editing software, a working knowledge of WordPress and knowledge of Search Engine Optimization (<span>SEO</span>) including schema tags and performance optimization. Must be safety conscious and able to work with a diverse group of individuals.</p><p>Union College, founded in 1795, is a highly-selective, independent college. Located in the Capital District of New York State, Union is known for its distinctive blend of the liberal arts and technology. Union College offers its full-time employees an exceptional benefits package that includes medical, dental, and vision insurance, life and disability coverage, a generous retirement plan and tuition remission.</p><p>Diversity at Union College</p><p>Union College is an equal opportunity employer and strongly committed to student and workforce diversity. Increasing diversity on campus is a critical priority for Union, one that is integral to our mission of preparing students for a globally interconnected world. Union provides a blend of intellectual, social and cultural opportunities to facilitate the integrated academic, social and personal development of a diverse community. We value and are committed to a host of diverse populations and cultures including, but not limited to, those based on race, religion, disability, ethnicity, sexual orientation, gender, gender identity, national origin and veteran status. Union College is committed to providing access and will provide reasonable accommodation in its application process to individuals with disabilities that request such accommodations.</p><h3>How to apply</h3>",
    "urlFetchPending": false,
    "published": "Feb 23, 2017 5:06:52 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America",
      "TECH2_Design"
    ]
  },
  {
    "id": "SmTUsm5NSXmmUGHj-vPf2A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Voice-UX-Design-Course-Writer-freelance-/2470684",
    "title": "Voice UX Design Course Writer (freelance) - CareerFoundry GmbH - (Remote) - Freelance",
    "content": "<li>          <a rel=&quot;nofollow&quot;>                 CareerFoundry GmbH</a>              (Remote)          </li><li>                  Freelance Job        </li><h2>Voice UX Design Course Writer (freelance)</h2><h3>About CareerFoundry:</h3><p>CareerFoundry is a young, well-funded, and quickly growing Online Education Startup based in Berlin, Germany. We offer eager learners from all over the world the chance to hone their tech skills and jump into a new career in the Tech Industry. Since opening our digital doors in March of 2014, thousands of students from over 50 countries have come to us to kickstart their new careers.</p><p>CareerFoundry offers online courses in web development, UX design, UI design, and iOS Swift. Through our in-depth online courses, and by connecting our students with mentors who are experts actively working in the industry, we aim to transform complete beginners into tech professionals in just 6-9 months.</p><h3>About the Course Writer Role:</h3><p>You’ll be contracted for 3 months to write a specialized voice design course with a focus on designing and building skills for Amazon Alexa. The course will be for design professionals with an interest in designing for voice interfaces. With the support of our curriculum team, you’ll work to deliver an engaging, challenging, and project-based online course which will turn students into competent voice designers.</p><p>The specialization course will take a part-time student 2 months to complete and a full-time student 1 month to complete. It will consist of approximately 15 text-based lessons supported by images, hands-on tasks, bite-sized video tutorials, and links to additional resources or further learning.</p><h3>What we’re looking for:</h3><p>The course writer we’re looking for is a subject matter expert in UX design, and…</p><ul><li>a native-level or fluent English speaker</li>  <li>an experienced writer with a strong interest in instructional writing </li>  <li>has classroom and/or online teaching experience</li>  <li>has experience collaborating with a remote team</li>  <li>a current UX designer with an up-to-date design portfolio and at least 3 years of experience in the tech industry</li>  <li>has specific expertise in voice design</li>  <li>has experience designing skills for Amazon Alexa</li></ul><h3>What you’ll be doing:</h3><p>With the support of the CF curriculum team, you’ll…</p><ul><li>collaborate with another course writer to author the course content, project prompts for student portfolios, rubrics, and related tasks</li>  <li>participate in the production of video tutorials</li>  <li>work closely with our curriculum team to ensure quality and engagement</li></ul><h3>What’s in it for you:</h3><p>Apart from the sheer joy of working independently and remotely, there’s also…</p><ul><li>generous compensation and flexible working hours</li>  <li>the thrill of helping people around the world change their lives and cultivate a career they love</li>  <li>the addition of course writer to your CV and ongoing professional networking opportunities</li>  <li>a possible rolling contract on course updates and development</li></ul><h3>How to apply</h3><a href=&quot;https://goo.gl/forms/JAhrfQfPO2LxyIO53&quot; rel=&quot;nofollow&quot;>https://goo.gl/forms/JAhrfQfPO2LxyIO53</a>",
    "urlFetchPending": false,
    "published": "Feb 22, 2017 1:31:19 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America",
      "TECH2_Design"
    ]
  },
  {
    "id": "6BF6S2MjT7qOog75SKR2ig",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Part-Time-UX-Designer/2470255",
    "title": "Part Time UX Designer - C4Media Inc - (Sibiu Romania) - Freelance",
    "content": "<li>          <a rel=&quot;nofollow&quot;>                 C4Media Inc</a>              (Sibiu Romania)          </li><li>                  Freelance Job        </li><h2>Part Time UX Designer</h2><p>C4Media is on the hunt for a part-time Junior Web Designer. We’re looking for someone who has a strong understanding ofon how UI design translates to the web and has the ability to work closely with our front-end developers to make it happen.<br><br>As a junior designer at C4Media you will work on products aimed at helping software professionals further improve their skills: from designing new, innovative web experiences to maintaining design consistency across our products.<br><br>You’ll have the opportunity to work on You’re expected to be able to work on designing solutions (layouts, navigation patterns) based on feedback. You’ll also based on received feedback, prepare the required assets required and work closely with front-end developers to help implement them.<br><br>Your work will be seen by over 1 million early adaptor developers people a month, a very which is a tough but very rewarding opportunity. responsability.<br><br>You’ll be:<br><br>Prototyping solutions to visual problems (mockups)<br><br>Shipping high fidelity designs of existing and new features<br><br>Revising your designs based on UX research and feedback<br><br>Contributing to our growing design system in an effort to cultivate a coherent look and feel across our entire C4Media range of products</p><p>Our company has two products: InfoQ.com which serves professional software developers and has more than 1 million unique visitors per month and QCon a line of conferences that serve the same community and take place every year in SF, NY, London, China, Brazil and Japan.</p><p>You’ll need to have:<br><br>Proficiency with current design tools including Sketch (preferred), Photoshop, and Invision<br><br>Good understanding of standard UX practices and responsive design principles.<br><br>Basic understanding of concepts like: wireframing, prototyping, personas<br><br>Empathy for the user. Design withhaving usability and accessibility in mind<br><br>Passion for solving tough problems through design.<br><br>You pride yourself on impeccable visual design, attention to detail and always push yourself to find better solutions thru simpler design<br><br>UI abilities displayed in a portfolio (live projects preferred)<br><br>Good communication skills that enables you to present your ideas and concepts to the rest of the team.<br><br>As this is Since it’s a remote position, strong good work ethic, and self-motivation, and an ability to provide regular status updates is necessary<br><br>“Someone who wants to improve their skills and become a ‘world class designer;”<br><br>Good to have, but not required<br><br>Basic knowledge of <span>HTML</span>/<span>CSS</span><br><br>Basic knowledge of print design<br><br>A rare opportunity to support a young, global, highly successful company that aims to accelerate the software side of human technological progress!</p><h3>How to apply</h3><a href=&quot;https://c4media.workable.com/j/50260D7BFD&quot; rel=&quot;nofollow&quot;>https://c4media.workable.com/j/50260D7BFD</a>",
    "urlFetchPending": false,
    "published": "Feb 20, 2017 3:39:11 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America",
      "TECH2_Design"
    ]
  },
  {
    "id": "lftoxOPqRI2lJO33OmcPGA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Digital-Development-Design-Specialist/2464524",
    "title": "Digital Development & Design Specialist - ReedExhibitions - (Norwalk, CT) - FullTime",
    "content": "<li>          <a rel=&quot;nofollow&quot;>                 ReedExhibitions</a>              (Norwalk, CT)          </li><li>                  Fulltime Job        </li><h2>Digital Development &amp; Design Specialist</h2><p>The Digital Development &amp; Design Specialist is a front-end web designer/developer that is responsible for the design, layout, usability, coding, and the day-to-day maintenance of a portfolio of tradeshow and conference websites using an internal content management system.</p><p>Primary responsibilities:</p><p>·         Developing strategic new design concepts and maintaining content for each site in their web portfolio.</p><p>·         Analyze business requirements and objectives to determine best placement and layout of new content.</p><p>·         Update website using <span>CMS</span>.</p><p>·         Working with business stakeholders across the company and internal Digital team members, coordinating with Corporate IT and other departments as needed.</p><p>·         Proactively conduct outreach to ensure all web sites are updates are timely.</p><p>·         Maintain internal documentation outlining what information is available on each site, account manager for the site, when various pieces of information need to be updated for each site and other key details.</p><p>·         Manage queue of assigned requests ensuring all website maintenance is released within <span>SLA</span> guidelines.</p><p>·         Brainstorm creative ways to leverage existing and new features and functionality, research Internet concepts, technologies and industry trends.</p><p>·         The Digital Development &amp; Design Specialist supports the Digital team on multiple projects simultaneously, including Search Engine Optimization (<span>SEO</span>).</p><h3>How to apply</h3>",
    "urlFetchPending": false,
    "published": "Jan 18, 2017 11:25:50 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America",
      "TECH2_Design"
    ]
  },
  {
    "id": "5cd_OFz7S5Wngyr5WEs1Sw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Senior-Product-Designer/2462907",
    "title": "Senior Product Designer - GetYourGuide - (Berlin, Germany) - FullTime",
    "content": "<li>          <a rel=&quot;nofollow&quot;>                 GetYourGuide</a>              (Berlin, Germany)          </li><li>                  Fulltime Job        </li><h2>Senior Product Designer</h2><p>GetYourGuide is busy revolutionizing the tours and activities space, fundamentally changing how people discover and book things to do in their destination. We come to work everyday because we are passionate about turning our customers’ trips into amazing experiences. Design is a critical part of this mission.</p><p>Never content with where we are, we are seeking a Senior Product Designer who can see beyond what GetYourGuide is today and can execute on a vision for how it can better serve travelers around the world.</p><p>What you’ll do:</p><p>- Work in a cross-functional team of developers, product managers and other designers dedicated to a specific Customer mission, contributing both to the broader picture as well as the details, ensuring quality every step of the way.<br><br>- Take broad, conceptual ideas and turn them into something useful and valuable for the millions of users on our platform.<br><br>- Design experiences and flows that are incredibly simple and elegant.<br><br>- Contribute to high-level strategic decisions with the rest of the product and executive teams.<br><br>- Give and solicit feedback from other designers in order to continually raise our bar for quality.</p><p>What you should bring:</p><p>- You are an excellent communicator and collaborator (we work in an agile and dynamic environment in which openness and humility are key).<br><br>- You have exceptional visual and interaction design skills proven by shipping great products over your 5+ years of experience.<br><br>- You are user-centric and  believe understanding users is an essential tool in your design process.<br><br>- You are results and data driven,  validating your assumptions by A/B testing and comfortable looking at dashboards and KPIs to interpreting them into Customer interactions, problems and opportunities.<br><br>- You can quickly bring ideas to life using prototyping tools like InVision and turn them to high-quality designs and final assets in Sketch.<br><br>- You are versed in designing for an array of devices and platforms and familiar with current web and mobile standards.<br><br>- You are self-motivated and comfortable working in ambiguity. We are a growing startup and much of your work will be self-directed.</p><p>It would be outstanding if:</p><p>- You have worked in eCommerce, travel or on a data-driven product development team.<br><br>- You are familiar with UX techniques such as Personas or Journey Maps and user research.</p><p>At GetYourGuide, we value exploring and learning quickly, succeeding and failing as we go. Our work is never finished, and that applies to developing ourselves and our skills.</p><p>Become a member of our Berlin team, full of co-workers from all over the world, that love to learn and laugh together.</p><p>We aim to make your life as comfortable as possible with free breakfast, coffee, beers and pizza. As well as assist you with your relocation and integration in form of German lessons.</p><p>Our compensation is competitive and includes a Virtual Stock Option program.</p><p>It goes without saying, that you’ll be able to test and try our products first hand with GetYourGuide activity vouchers.</p><p>Curious?</p><p>Do you think you can rock the job?  Then, we’re looking forward to hearing from you!</p><p>Be sure to find out more about our Product team: read Spotlight on Product Design on our blog. If you have any further questions please do not hesitate to contact us via jobs@getyourguide.com.</p><h3>How to apply</h3><a href=&quot;https://careers.getyourguide.com/positions/262339/&quot; rel=&quot;nofollow&quot;>https://careers.getyourguide.com/positions/262339/</a>",
    "urlFetchPending": false,
    "published": "Jan 11, 2017 5:16:18 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America",
      "TECH2_Design"
    ]
  },
  {
    "id": "Nu1lWiDCTC-9k_fvew04wQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3578-senior-front-end-ui-designer-web-bigscreen",
    "title": "Senior Front-end UI Designer - Web @ Bigscreen",
    "content": "<h2>              Senior Front-end UI Designer - Web<small> @ Bigscreen</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-03-17 01:53</p></dd>          <dt><span>Description</span></dt>          <dd><p>Bigscreen is powered by a traditional web tech stack. In fact, the Bigscreen UI is actually built with HTML, CSS, and Javascript (here's an example of the Bigscreen VR UI) using frameworks like Bootstrap and jQuery. If you've worked on web front-ends, you’ll feel right at home at Bigscreen.</p><p>As a front-end developer, you'll work on both 2D user interfaces as well as cutting-edge VR user interfaces. Much of the VR interface reuses these HTML UI components, but some are native UI elements built in Unity.</p><p>We're looking for front-end web developers with strong programming skills and a strong design background.</p><p><strong><em>Prior experience with VR and Unity3D is not required.</em></strong></p><p><strong>About Bigscreen</strong></p><p>Founded in 2014, Bigscreen is a California-based technology company creating an immersive virtual reality telepresence platform that aims to revolutionize the way people work, play, hangout, and collaborate. Since its beta launch in March 2016, it has become one of the most popular and highly rated VR apps. Power users spend 20-30 hours per week in Bigscreen, making it one of the most widely used &quot;killer apps&quot; in the industry.</p><p>Join us and help design the future of computing and collaboration.</p><p><strong>Responsibilities</strong></p><ul><li>Prototype, design, and develop front-end UI (HTML/CSS/JS) for new features in the Bigscreen app</li><li>Prototype and iterate on new VR UI (Unity, C#) in order to make Bigscreen the best collaborative, productive, and immersive computing application</li><li>Work on user-facing web, mobile, and desktop apps to allow users on more platforms to interact and communicate with others in Bigscreen, just as Slack/Skype/Discord have apps on every major platform</li></ul><p><strong>Required Skills</strong></p><ul><li>Several years of experience designing and developing web or mobile products</li><li>Strong background in UI/mobile/web design and development</li><li>Several years of experience with front-end development (HTML, CSS, Javascript) using Bootstrap, jQuery and/or React</li><li>Several years of experience with design tools (Photoshop, Sketch, etc.)</li><li>Experience with web backends, HTTP REST APIs, and real time &amp; reactive web apps</li><li>Good communication skills in English</li><li>Good project management skills</li><li>Great at working independently and collaboratively on small teams</li></ul><p><strong>Bonus Skills</strong></p><ul><li>Experience building and designing VR apps, games, and interaction design</li><li>Experience designing and developing in Unity and C#</li><li>Some experience building and designing Android apps</li></ul><p><strong>Location is Remote</strong></p><p>We're currently in Berkeley, California (UTC-8) so ideally you live in North America or South America. We prefer if you live in a timezone that is less than 4 hours different from UTC-8 / Pacific Time.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>We're currently in Berkeley, California (UTC-8) so ideally you live in North America or South America. We prefer if you live in a timezone that is less than 4 hours different from UTC-8 / Pacific Time.</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Mar 17, 2017 3:53:31 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_locals-only"
    ]
  },
  {
    "id": "qONv6xE5T2OTR9bD_1rbAQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/23138",
    "title": "Product Designer",
    "content": "<p>Product Designers take Flexmls’s most innovative product concepts and bring them to life.</p><br><p>As a Product Designer, you’ll weave together strong interaction design, visual design, and technical skills. You’ll partner with researchers, product managers, developers, and fellow product designers to define and deliver new features, translate concepts into living, breathing prototypes, and iterate on interactions, animations, and details to deliver pixel-perfect experiences. You’ll be joining a small team of product experts who take design thinking seriously and have experience at some of the biggest firms in tech. <br><br></p>",
    "urlFetchPending": false,
    "published": "Apr 20, 2017 10:14:40 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "UUpKXxS1SxOA3M_TPkrLxA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/23055",
    "title": "Visual / UX Designer",
    "content": "<div>Are you a user experience star looking to revolutionize the way people innovate and build software? Do you want to help design something that is changing the way people think about innovation? We are looking for a high energy, hands on UX designer who is looking to take a huge career leap forward Ã¢Â Â  and jump on a rocket. If this is you, we want to hear from you!</div><div><br></div><div>As a UX Designer at Aha! you will have an excellent opportunity to join a breakthrough and profitable company that is growing fast. Aha! was founded by a proven team of Silicon Valley veterans whose last two companies were acquired by well-known public companies. More than 100,000 users trust Aha! to link their brilliant strategy to their team's work and create visual roadmaps.</div><div><br></div><div><h4>We're looking for someone who:</h4></div><ul><li>Is experienced in UX design for SaaS applications</li><li>Enjoys crossing back and forth between UX and graphic design</li><li>Understands product management and can understand user behaviors and motivations</li><li>Loves to create wireframes and mockups and refine them based on team input</li><li>Wants to have ownership and responsibility of key work and measure the success of new designs</li></ul><div><h4>We are committed to being great, and we want someone who:</h4></div><ul><li>Can work at a fast-paced company where the feedback cycle is measured in hours rather than weeks</li><li>Has a 'get it done' attitude and a background of delivering beautiful work again and again</li><li>Is seeking a career-defining opportunity and a proven, results-oriented team which has sold multiple software companies</li></ul><div><br></div><div><i>We are building a distributed team and you can work from anywhere in the United States for this role. We offer generous salary, equity, benefits, and a profit sharing program to the right candidates.</i></div><div><br></div><p><strong>To apply:</strong> Please send resume and portfolio to: <a href=&quot;mailto:%44%65%73%69%67%6e-%6a%6f%62%73@%61%68%61.%69%6f&quot; rel=&quot;nofollow&quot;>Design-jobs@aha.io</a> </p>",
    "urlFetchPending": false,
    "published": "Apr 14, 2017 7:41:07 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "qC_fqE04QxmR-FeKKoSQCw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/23017",
    "title": "QA Designer",
    "content": "<div>Flinto is looking for someone with an interest in design tools and a knack for organization to help us perfect our Mac app. You will help test our app, log issues and manage our issue tracking.</div><div><br></div><div>We need someone with a good knowledge of design tools, who can test the app by designing real-word prototypes in Flinto for Mac. YouÃ¢Â Â ll also need to be detailed, patient and organized. We will expect you to maintain a test plan, log issues with descriptions, images and video in our issue tracker, and verify them when they have been addressed.</div><div><br></div><div>If youÃ¢Â Â ve used an iPhone, youÃ¢Â Â ve almost certainly used an app that was designed with the help of Flinto for Mac. Flinto for Mac is a next-generation UI design tool that makes prototyping animated transitions and behaviors easy for designers.</div><div><br></div><div>Flinto is a small, profitable business with no outside funding that was founded in 2013. We only answer to our customers. We offer a flexible, easy-going work environment, and interesting projects. WeÃ¢Â Â re based in San Francisco, but you can be anywhere.</div><div><br></div><div>We'd like to talk to you if you have:</div><div><br></div><ul><li>Familiarity with UI design tools and techniques<br></li><li>Familiarity with development tools and techniques<br></li><li>An appreciation for well-designed software<br></li><li>Experience QA testing software<br></li><li>An exceptional ability to work independently<br></li><li>A patient, detailed and organized mindset<br></li><li>Experience using Github Issues or similar issue tracking software</li></ul><div><br></div><p><strong>To apply:</strong> Tell us about yourself and your projects. You can reach us at <a href=&quot;mailto:%6a%6f%62%73@%66%6c%69%6e%74%6f.%63%6f%6d&quot; rel=&quot;nofollow&quot;>jobs@flinto.com</a></p>",
    "urlFetchPending": false,
    "published": "Apr 12, 2017 10:32:49 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "3qkL7phXQb-esr89MflMtA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/22899",
    "title": "Skilled Motion Graphics Designer - Europe",
    "content": "<div>Real Audience is a Swedish tech company within the field of video advertising automation.</div><div><br></div><div>Now we are looking to strengthen our remote team with a skilled Motion Graphics Designer. As we work in the same time zone span and meet regularly, we look for people that live in Central or Eastern European countries.</div><div><br></div><div>Your main responsibility will be to produce video commercials and video commercial templates for advertisers across Europe, using Adobe After Effects. You will also contribute to, and produce, other video material, such as promotional material for the company, animated infographics and similar.</div><div><br></div><div><strong>You should have a sense for:</strong></div><ul><li>Adobe After Effects nuts and bolts</li></ul><ul><li>Beautiful motion graphics</li><li>Video editing</li><li>2D and 3D tracking</li><li>Common technologies such as keying, rotoscoping, lighting and color correction</li><li>Animation</li></ul><ul><li>Adopting and adjusting to customers brand identity guidelines</li><li>Working from home in a remote team</li></ul><div><br></div><div><strong>Ideally, you should:</strong><br></div><ul><li>Have amazing motion graphics skills</li><li>Have a firm grasp on color correction and grading</li><li>Have experience designing storyboards for commercials</li><li>Have the ability to conceptualize creative vision</li><li>Be proficient in graphic design software such as Photoshop and Illustrator</li><li>Have a well-rounded sensibility and knowledge of typography</li></ul><div><br></div><div><strong>Additionally, you:</strong><br></div><ul><li>Seek to understand the business strategy and needs of our customers</li><li>Inspire your colleagues with your thirst for mastering the things you work with</li><li>Are a passionate designer, proud of the quality of your work</li><li>Are an independent worker and self-starter, as the job is fully remote</li><li>Are able to communicate well in spoken and written English</li><li>Are willing to travel to Sweden, Poland, Norway and/or other european countries for occasional in-person meetings with the team</li><li>Live within the CEE-area (for example Poland, Hungary, Bulgaria etc.) - time zones between UTC+1 and UTC+4</li></ul><div><br></div><div><strong>Bonus points for:</strong><br></div><ul><li>Experience creating video commercials</li><li>A university degree in fine arts, graphic design, or other relevant areas</li></ul><div><br></div><div><strong>We offer:</strong><br></div><ul><li>An opportunity for you to work with, and create, motion graphics for use in cutting edge technology</li><li>Stable company with a Scandinavian client base, with the intent to expand to the rest of the world</li><li>A great and experienced remote team</li><li>A permanent full time contract, with a fixed monthly payment (on invoice)</li><li>Salary range Ã¢Â Â¬2000 - Ã¢Â Â¬3000</li></ul><p><strong>To apply:</strong> Please send your application together with CV and relevant links (portfolio, public projects, samples etc.) to Real Audience AB. Please also state clearly in which country you reside and will work from. Email address for applications: <a href=&quot;mailto:%6a%6f%62%73@%72%65%61%6c%61%75%64%69%65%6e%63%65.%73%65&quot; rel=&quot;nofollow&quot;>jobs@realaudience.se</a></p>",
    "urlFetchPending": false,
    "published": "Apr 6, 2017 7:31:43 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "_BGNX-ygQmebP8JOhowLiA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/22875",
    "title": "Skilled Motion Graphics Designer (advertising) - Europe",
    "content": "<div>Real Audience is a Swedish tech company within the field of video advertising automation.</div><div><br></div><div>Now we are looking to strengthen our remote team with a skilled Motion Graphics Designer. As we work in the same time zone span and meet regularly, we look for people that live in Central or Eastern European countries.</div><div><br></div><div>Your main responsibility will be to produce video commercials and video commercial templates for advertisers across Europe, using Adobe After Effects. You will also contribute to, and produce, other video material, such as promotional material for the company, animated infographics and similar.</div><div><br></div><div><strong>You should have a sense for:</strong></div><ul><li>Adobe After Effects nuts and bolts</li></ul><ul><li>Beautiful motion graphics</li><li>Video editing</li><li>2D and 3D tracking</li><li>Common technologies such as keying, rotoscoping, lighting and color correction</li><li>Animation</li></ul><ul><li>Adopting and adjusting to customers brand identity guidelines</li><li>Working from home in a remote team</li></ul><div><br></div><div><strong>Ideally, you should:</strong><br></div><ul><li>Have amazing motion graphics skills</li><li>Have a firm grasp on color correction and grading</li><li>Have experience designing storyboards for commercials</li><li>Have the ability to conceptualize creative vision</li><li>Be proficient in graphic design software such as Photoshop and Illustrator</li><li>Have a well-rounded sensibility and knowledge of typography</li></ul><div><br></div><div><strong>Additionally, you:</strong><br></div><ul><li>Seek to understand the business strategy and needs of our customers</li><li>Inspire your colleagues with your thirst for mastering the things you work with</li><li>Are a passionate designer, proud of the quality of your work</li><li>Are an independent worker and self-starter, as the job is fully remote</li><li>Are able to communicate well in spoken and written English</li><li>Are willing to travel to Sweden, Poland, Norway and/or other european countries for occasional in-person meetings with the team</li><li>Live within the CEE-area (for example Poland, Hungary, Bulgaria etc.) - time zones between UTC+1 and UTC+4</li></ul><div><br></div><div><strong>Bonus points for:</strong><br></div><ul><li>Experience creating video commercials</li><li>A university degree in fine arts, graphic design, or other relevant areas</li></ul><div><br></div><div><strong>We offer:</strong><br></div><ul><li>An opportunity for you to work with, and create, motion graphics for use in cutting edge technology</li><li>Stable company with a Scandinavian client base, with the intent to expand to the rest of the world</li><li>A great and experienced remote team</li><li>A permanent full time contract, with a fixed monthly payment (on invoice)</li><li>Salary range Ã¢Â Â¬2000 - Ã¢Â Â¬3000</li></ul><p><strong>To apply:</strong> Please send your application together with CV and relevant links (portfolio, public projects, samples etc.) to Real Audience AB. Please also state clearly in which country you reside and will work from. Email address for applications: <a href=&quot;mailto:%6a%6f%62%73@%72%65%61%6c%61%75%64%69%65%6e%63%65.%73%65&quot; rel=&quot;nofollow&quot;>jobs@realaudience.se</a></p>",
    "urlFetchPending": false,
    "published": "Apr 6, 2017 7:31:43 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "B-6XqXBRTAiBWctHjLSl0Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/22855",
    "title": "Designer For TV Collaboration Software",
    "content": "<p>Scripto makes the collaborative TV writing and production software that <a href=&quot;http://scripto.cc/&quot; rel=&quot;nofollow&quot;>some of your favorite shows</a> rely on every day.&nbsp;</p><br><p>As we expand our client base and begin new experiments, we're looking for a designer who can develop the visual language of our products, generate compelling wireframes and mockups, and streamline the user experience for TV professionals in demanding environments.</p><br><p>This is a full-time position with flexible hours, health and dental benefits, and no location requirements. You'll work with great people who have lives outside the job and <a href=&quot;https://github.com/toddself&quot; rel=&quot;nofollow&quot;>lots</a> of <a href=&quot;https://twitter.com/robdubbin/lists/bot-zoo/members&quot; rel=&quot;nofollow&quot;>oddball</a>&nbsp;<a href=&quot;https://github.com/lrlna&quot; rel=&quot;nofollow&quot;>side</a> <a href=&quot;https://tinyletter.com/todayintabs&quot; rel=&quot;nofollow&quot;>projects</a>.</p>",
    "urlFetchPending": false,
    "published": "Apr 6, 2017 12:17:26 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "oPqSn_HqRlW-17IWF_ZAnQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/22806",
    "title": "UX UI Mobile Web Designer",
    "content": "<p><strong>100% Remote Opportunity; Must be a US Citizen and live in the United States</strong></p><br><p><strong>Position Summary:</strong> Sevatec, Inc. is looking for&nbsp;a talented mid-level User Experience User Interface (UX/UI) mobile-first Web Designer to add to their dynamic team supporting a highly visible federal contract. The objective of User Experience/User Interface support is to provide a clean intuitive user-centric design to internal and external web and mobile applications across a myriad of devices. The UI and UX shall be in compliance with standards as identified by the Government.</p><br><p><strong>Responsibilities:</strong></p><br><ul><br><li>Provide consultation and support services for developing all DID(IT) applications following a mobile-first development strategy using Responsive Web Design best practices.</li><br><li>Ensure the design meets Section 508 Accessibility standards as required by the Federal</li><br><li>Government, the Department of Homeland Security, and the United States Citizenship &amp; Immigration Service.</li><br><li>Develop UI/UX designs in accordance with the USCIS design template and coordinate design strategies with developers and business lines for systems planning and implementation for all new and legacy applications.</li><br><li>Work with information architects, content strategists, technologists, design team and other UX/web design experts to create clean page layouts and intuitive interfaces providing extraordinary user experiences.</li><br><li>Participate in the development of strategies and tactics for projects including websites, intranets, mobile applications etc.</li><br><li>Participate in the creation of client-facing deliverables including user personas, sitemaps, wireframes, usability audits, heuristic evaluations, usability testing reports, user scenarios, flows, and prototypes.</li><br><li>Create compelling interactions and experiences that support desired user behaviors.</li><br><li>Create intuitive administrative user experiences that enable clients to easily update and maintain web content using a CMS back-end.</li><br></ul>",
    "urlFetchPending": false,
    "published": "Apr 4, 2017 4:24:51 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "NXSDO_36TZWV1551aYJekw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/22753",
    "title": "Lead Curriculum Designer",
    "content": "<p><strong>Job Description:</strong></p><br><p>Are a you seasoned UI-UX designer looking for a new challenge? Do you enjoy teaching, mentoring, and sharing your expertise with others? Then this may be the position for you!</p><br><p>At Trilogy Education Services, we’re creating innovative programs to train new audiences for careers in the digital economy.We’re looking to develop a new program in UI-UX and are seeking experienced individuals to join our team. If you have extensive experience in UI-UX design and/or front-end engineering then we want to speak with you!</p>",
    "urlFetchPending": false,
    "published": "Apr 3, 2017 6:52:02 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "6TU6RVEfQFmMQwsNR49adA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/55632/freelance-frontend-designerdeveloper-shopifye-commerce-at-untethered-collective-ltd/",
    "title": "Freelance Frontend Designer/Developer (Shopify/E-Commerce)",
    "content": "We’re looking for a UK-based (ideally London or Brighton) Frontend Designer/Developer to help us design and build e-commerce Shopify stores. <br /><br />*Please note: no recruitment agencies at this time.*<br /><br />About us:<br /><br />We're a small team currently based in London but have plans over the forthcoming months to expand and set up a Brighton office. We pride ourselves on producing beautiful and minimal stores as well as giving our clients a friendly and personalised service.<br /><br />About the position:<br /><br />Work from anywhere<br />Work your own hours/at your own speed<br />Temporary freelance position with a view to becoming permanent<br />Opportunity to have a huge input in growing the company<br />Friendly and supportive environment<br /><br />Essential skills:<br /><br />Photoshop/Illustrator experience<br />HTML/CSS/SASS/Javascript<br />Ability to create polished design mockups<br />Ability to code responsively and incorporate best practice techniques<br />To have good organisational and communication skills<br /><br />Bonus skills:<br /><br />Shopify e-commerce experience<br />Grunt/version control<br /><br />How to apply:<br /><br />If you'd like to know more, get in touch with a link to your portfolio/CV and details of your day rate so we can arrange a chat.",
    "urlFetchPending": false,
    "published": "Mar 22, 2017 8:40:46 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE2_Europe",
      "REMOTE1_100"
    ]
  },
  {
    "id": "wu_kFyMQSqKkBuu2coHSgg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56842/visual-designer-at-checkoutcom/",
    "title": "Visual Designer",
    "content": "About us<br />Founded in 2010, Checkout.com is an international FinTech company providing end-to-end ecommerce solutions for payments on the Internet. Built on 100% proprietary technology Checkout.com’s online platform offers all credit and debit cards as well as alternative and local payment methods through a single integration. With clients such as Deliveroo, Virgin, Adidas and many more, Checkout.com’s 120+ talented team members serve a list of true tier one global retailers and leading mobile applications from its London, Dubai, Singapore and Mauritius offices.<br /><br />At Checkout.com we strive to create a unique working environment where each of our employees are empowered to take their responsibilities, solve complex puzzles and deliver value accretive solutions for the Company. We believe an individual maximum yield can only be achieved through a dynamic culture that focuses on personal growth and fully tailored career development paths.<br /><br />This experience is offered in a fast paced and innovation-focused office space ideally located in the heart of London.<br /><br />About the role <br />Checkout.com is actively looking for a talented and imaginative Visual Designer to help define, craft and expand our Design language and brand identity. <br /><br />Reporting to the VP of Marketing and collaborating with cross-functional teams, you will bring your fresh and user-centered Design perspectives to produce high-quality visuals across many mediums (print and web) to inspire, engage and excite our audiences.<br /><br />Joining one of the most promising FinTech Company at a turning point of its global expansion, you will have the opportunity to  influence, bring emerging trends and engage through your Designs to shape the future of our brand.<br /><br />Your will be responsible for: <br />- Taking the creative control in a variety of projects to build UI that are innovative, inventive and aligned with Checkout.com creative excellence<br />- Collaborating with Sales and Marketing to deliver compelling collateral to engage with our audiences, both web and print<br />- Partnering with our VP of Product and UX/UI Designer to influence the entire Product Design process<br />- Influencing Checkout.com brand identity by consistently keeping up to date with Design best practices<br />- Improving Design processes and tools to measurably and enhance productivity<br /><br />About you<br />- 2 years Graphic/Visual Design experience, in-house or agency <br />- Proficient with industry standard Design tools (e.g. Photoshop, Illustrator, Sketch) <br />- Good understanding of Web technologies such as CSS and HTML is a plus<br />- Comfortable working in a fast-paced environment under tight deadlines <br />- Great portfolio showcasing your skills <br />- BSc or MSc in Digital Media Design, Graphic Design or similar <br />- Fluency in English<br /><br /><br />Checkout.com is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience, skills and personality. We welcome applications from all members of society irrespective of age, sex, disability, sexual orientation, race, religion or belief.<br />Due to the numerous amount of application received, only the ones corresponding to this job profile will be contacted. If you have not been contacted within 3 weeks please deem your application as unsuccessful.",
    "urlFetchPending": false,
    "published": "Apr 27, 2017 5:54:26 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "J9GL_4-zTAKeA47efqtJXw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56807/service-designer-at-provenance/",
    "title": "Service Designer",
    "content": "Location: London<br />Reporting to: CTO<br />Contract: Full time starting before June 2017 (freelance or permanent)<br />Rate: Depending on experience <br />Equal opportunities: Provenance is dedicated to creating a diverse environment and is proud to be an equal opportunity employer.<br /><br />About us: <br />Provenance empowers brands to increase trust, using revolutionary technologies for greater supply chain transparency. Our software lets brands bring the origin and histories of products to the point of sale. At Provenance, we envision a future where every great product comes with accessible, verifiable information about its history and creation, helping us all make positive choices about the things we buy.<br /><br />Our culture: <br />We are a social enterprise and our mission to make product supply chains more transparent strengthening honest business as a force for good is important to each of us. We are committed to growing a diverse team with equal opportunities for all. A handful of us work remote from within the UK, and from other cities in Europe. The product team is a multi-disciplinary team of designers and developers working in sprints, and in close collaboration with the rest of the company. <br />Overview: <br />We are looking for a Service Designer with experience working on digital services to join our Product team. Working as part of a mixed team of designers and developers you will oversee the end-to-end experience of all of our different user types across our suite of tools and interactions. <br /><br />In addition to working on the core product, you will spend a significant amount of your time working on external client and partner projects, overseeing user research activities and using service prototypes to test ways in which the product could extend to meet those users’ needs.<br /><br />Your work will inform the further development of the Provenance software service working closely with our core clients (food and drinks brands and retailers), their supply chain (e.g. farms) and their customers (shoppers of food and drinks). You will also work with our valued partners e.g. product certifiers and NGOs. <br /><br />This is a brilliant opportunity for the right person to join an innovative startup in London, where you’ll be contributing to building a business with a strong social mission. <br /><br />The Role: <br />Own the end-to-end experience of the Provenance platform across all touch points<br />Communicate service concepts and ideas effectively in a digital format<br />Working with the team to understand the needs of our customers and end consumers<br />Creating and iterating simple prototypes to test hypotheses about how Provenance can address those needs<br />Manage the planning, scheduling and tracking of project timelines and milestones, ensuring project activities are performed on time and project outcomes are achieved<br /><br />Who we’re looking for: <br />4+ years experience delivering the full end to end service design experience for various clients as well as strong leadership experience. <br />Experience working on services with strong digital (web and mobile) components.<br />Experience working closely with user researchers to interpret findings and translate into clear service propositions.<br />Capable of incorporating technical concepts such as smart tags and blockchains<br />As you'll be reporting to the CTO and working closely with our designers and developers, you’ll be comfortable working both autonomously and as part of a team.<br />Someone who is just as happy hacking something to test an idea as they are crafting a difficult solution that will provide users with the best possible experience<br />Someone who shares our mission and is passionate about the same things we are.<br />Someone collaborative and pragmatic in their approach. Getting stuck in to projects and keen to offer up knowledge and skills to other team members is a must.<br />A lean approach to product development, prioritising experiments to help learning over blindly adding features <br />Someone who keeps abreast of tech, creative and current trends in the market and is thinking of how to apply these for the benefit of our product and our customers<br /><br />Benefits:<br />Work in a fast-moving, startup environment with a smart, motivated team<br />Exciting clients and a strong mission for social good<br />Competitive salary<br />Flexible working options (both location and times)<br />Team workshops and social events<br />Travel opportunities depending on projects <br />Training and development opportunities <br />",
    "urlFetchPending": false,
    "published": "Apr 26, 2017 5:41:01 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "8_eD8FrWTgO4WLkdTID4Vg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56694/freelance-designer-at-adludio/",
    "title": "Freelance Designer",
    "content": "Adludio is a the leading Programmatic Sensory Advertising platform, offering a unique portfolio of next gen mobile-first ad formats.We are developing a self-serve user platform, to allow any person to design and create amazing ads, and to deliver them via programmatic solutions that best meet their needs.We aim to marry intuitive touch-screen user experiences and creative excellence, and make that the norm for mainstream mobile advertising.<br /><br />Adludio are experts in sensory advertising; we don't produce the standard static boring ads you see all over the web, we specialise in engagement led units involving clear and un-accidental user actions. This means we're measured on our creatives; how good they look, and also how well they work in getting users to interact with the product. This always makes for a challenging and interesting design process!<br /><br />-Job brief :<br /><br />Adludio has several great opportunities for freelance designers (and small design teams) to work with us on a regular basis. The projects will be quick turnaround ad units for high profile clients. We are also looking for freelancers who would be interested in testing our in-house software currently in development. This software is designed to greatly increase the efficiency of the ad unit building process. So, we would love you to get involved with beta testing and helping us shape the products that you will then use to work on campaigns.<br /><br />-Responsibilities :<br /><br />We will of course guide you through the best practices for producing this type of advertising, but we are looking for candidates with the following experience:<br /><br />* Must be proficient in Photoshop<br />* A knowledge of After Effects would be a nice to have but not essential<br />* Experience in digital advertising would be fantastic<br />* Some experience in layout in general is essential<br />* Able to work to quick turnarounds (generally we spend 1/2 day to 1 day on mocks)<br />* Able to work to tight deadlines (we often receive briefs with 24 hour deadlines)<br /><br />If you feel you want to join us please send us your CV and your portfolio link!",
    "urlFetchPending": false,
    "published": "Apr 24, 2017 11:33:42 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "1kTJssKqSCq-Y206JijPbQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56613/digital-designer-at-minicabit/",
    "title": "Digital Designer",
    "content": "Backed by O2, the mobile operator and recently seen on BBC TV’s Dragons’ Den, minicabit is a leading web & mobile platform that enables customer transport for the UK’s biggest travel & leisure websites, including concert arenas and airports.<br /><br />To support our fast-paced growth, we are looking for a placement at our base by Piccadilly Circus, central London, to help generate creative assets for all areas of the company. It is initially a 3 month placement but has the potential to be expanded to a full time position.<br /><br />The role will mainly see you working with our marketing team to come up with creative campaign ideas and deliver marketing assets for each customer-facing channel. This could include social media content, email campaigns, display ads and blogs etc.<br /><br />There is also potential to help our product team with UI/UX design and other prototyping.<br /><br />Essential:<br />• Degree-level experience who is fluent in spoken & written English<br />• Highly enthusiastic with great vision and attention to detail<br />• Previous experience designing marketing assets with an impressive portfolio<br />• Excellent Photoshop / Illustrator skills<br />• Has own laptop<br />• Immediately available.<br /><br />Desirable:<br />• Previous Experience of UI/UX design<br />• Cross-over skills would be great – Including HTML/CSS knowledge<br />• Experience writing creative copy<br />• Knowledge of UK travel & leisure sector<br />• Experience of working within a UK SME<br />• Understanding of web, mobile web and apps.<br /><br />Day To Day Tasks:<br />Client-side graphic design<br />Assist in designing ads<br />Write creative copy for consumer facing content<br />Assist with designing UI and product prototypes",
    "urlFetchPending": false,
    "published": "Apr 20, 2017 5:24:56 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_locals-only"
    ]
  },
  {
    "id": "5aFJH_hJQyKvGxWRA--MZw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56300/in-house-designer-photographer-at-west-base-electronics-ltd/",
    "title": "In-House Designer & Photographer",
    "content": "West Base Electronics Ltd has been serving imaging markets since 1992.  Formerly a retail business based on Regent Street; we now operate an online business model trading through www.CameraKing.co.uk, Amazon and eBay.  In 2013 we launched an in-house brand, Phot-R.<br /><br />Phot-R is a well-established Photographic Accessory brand (www.Phot-R.com). We are looking for a results focused, commercially driven Designer & Photographer to help us drive the brand forwards and bring new and innovating ideas to the table, with suggested listing improvements and persistence for results.<br /><br />Job Requirements:<br /><br />Improving packaging and logo placement on products<br />Product Instructions for nearly 500 items<br />Product photos for use on all Sales channels (Ecommerce)<br />Keen Photography/Studio product knowledge is essential<br />Detailed images (with zoom-ins of USPs)<br />Social Channel images<br /><br />Key Skills and Experience:<br /><br />Adobe Photoshop, Illustrator & inDesign experience is a must.<br />Excellent photography skills required to showcase our range of products online.<br />Proactive, self-starter and a team player who can manage multiple tasks and suggest new ideas.<br />Ability to handle/juggle multiple priorities & effectively deliver results with a strong reporting ability.<br />Ability to collate data from different sources & competition, analyse and recommend way forward<br />Excellent communication skills<br />Strong verbal and numerical reasoning skills (able to analyse and draw conclusions quickly from data)<br />This role comes with a competitive salary and a range of flexible benefits.<br /><br />We are a growing brand only established in 2013, we aim to attend Photographic events which can increase Brand exposure and demand. Our recent attendance at The Photography Show in Birmingham NEC; saw us exhibit alongside major players in the industry. With a substantial stand size of 60sq.m and sponsorship of 18,500 guest badge lanyards, we aim to be a new force in the Photographic industry.",
    "urlFetchPending": false,
    "published": "Apr 11, 2017 4:57:16 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "n6hI65HmTgGvSoZ5l_cMjQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56274/rockstar-front-end-designer-developer-at-flavourly-ltd/",
    "title": "Rockstar Front End Designer / Developer",
    "content": "About Flavourly:<br /><br />We are the UK’s leading online craft beer discovery club. We’re helping our 50,000 strong community of consumers to discover exceptional craft drinks through data, technology and partnering with the great craftsmen and women who make them.<br /><br />We are entering an exciting new phase of growth in 2017, where we are expanding into other discovery clubs, including gin and whisky, and building the best one-stop shop to discover and buy all the best craft and premium beverages across all product categories.<br /><br />We are growing fast and are looking for an ambitious individual to join the party, based in our central offices in Edinburgh and working closely with our in-house back end developer. <br /><br />Initially, this will be a 3-6 month project with the view to continue ongoing after that. <br /><br />Who we are looking for:<br /><br />Someone who:<br /><br />> is creative and loves to design beautiful websites and keeps and eye on the latest trends in web design, development and user experience. <br />> would embrace a great opportunity to ‘make their mark’ in designing / developing a ground breaking new premium drinks retailer.<br />> has experience in web design and development across mobile and desktop.<br />> is really flexible, hands-on in approach and willing to go the extra mile for the Flavourly team!<br />> Enjoys problem solving (when it arrises). <br /><br />The essentials:<br />> HTML / XHTML + CSS (HTML5 and CSS3). <br />> Excellent attention to detail with a creative approach to aesthetics of web design. <br />> Bootstrap 3 <br />> Responsive + mobile design. <br />> Working knowledge of Adobe Photoshop, and/or illustrator. <br />> Javascript / jQuery <br /><br />Icing on the cake: <br />> LESS or SASS (SCSS)<br />> Experience with templating engines e.g. Django, Smarty. <br />> a good understanding of UX design & conversion rate optimization. <br /><br />Send your CV and a covering letter.<br /><br />Check us out at www.Flavourly.com<br /><br />NO AGENCIES PLEASE",
    "urlFetchPending": false,
    "published": "Apr 11, 2017 10:08:13 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE2_Europe",
      "REMOTE1_100"
    ]
  },
  {
    "id": "QK0iJgATTZeC2eCEbUv1sg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56249/freelance-designer-at-blackbx/",
    "title": "Freelance Designer",
    "content": "BLACKBX is a startup company providing value-added WiFi to businesses around the world. Our software product enables any customer facing business to understand their customer by collecting data on customers, via a WiFi network.<br /><br />We are a small, dynamic team across support, sales and software development based in Leith, Edinburgh, and as our user base is growing at an exponential rate, it is an exciting time to get involved with us.<br /><br />We are looking for a freelance graphic designer to work 15 hours a week based out of our Edinburgh offices. <br /><br />You will be working on design assets for print, digital and adverts.<br /><br />Send a cover letter along with a copy of your portfolio, keep it simple.",
    "urlFetchPending": false,
    "published": "Apr 10, 2017 2:36:10 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "2Ser9Fu0RjGIzhR3UstQHg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56210/awesome-uiux-branding-designer-at-perfocal/",
    "title": "Awesome UI/UX & Branding Designer",
    "content": "We’re a startup creating an online marketplace for on-demand photography services. Feel free to check out: *Perfocal.com*. Keywords: #Marketplace #SharingEconomy #OnDemand #Photography #DesignMatters<br /><br />In our culture we see design as a core value and gives full attention to details. So after successfully validated the market we're now looking for a talented designer to help us optimising user experience and achieving full P/M fit in next step. Style-wise we like to keep up with the latest UI trend and appreciate clean and minimal designs. <br /><br />Tasks may include: <br />* Branding consultancy, including  designs of new logo and overall design codes; <br />* Storyboard & user flow consultancy, revising wireframes and help deciding the final plan;<br />* UX optimisation and design of the version 2.0, visualising to pixel level prototypes; <br />* Front-end codes where possible / necessary; <br /><br />Estimated hours: 20-40hrs, with potential for long-term collaboration<br /><br />We look to kick-start the work asap and will offer competitive day rates (negotiable). If interested please apply with a few lines about your experience plus your portfolio of recent works. Thanks. ",
    "urlFetchPending": false,
    "published": "Apr 8, 2017 10:45:21 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "r3B1y-n_TI6gskyTPwox3g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56104/design-director-at-lad-bible-group/",
    "title": "Design Director",
    "content": "About Us<br /><br />We are TheLADbible Group. We offer so much more than the latest viral and trending news and stories - we offer a community for over 30 million followers, a way of life for our audience and a movement which our audience and employees are proud to be part of. This is brought together through a shared love of relevant and relatable content.<br /><br />Whether the purpose is to inform, entertain, educate, capture hearts and minds, inspire or interact, we strive to build meaningful and emotional connections with our followers, employees and content contributors.  Our success is not defined by “likes” but by provoking audience engagement, creating movement, setting trends and disrupting the market on a global scale. Everyone who works at TheLADbible is passionate about keeping that connection alive. <br /><br />The Role - Design Director <br /><br />TheLADbible group is in the midst of redefining LAD and becoming the disruptors in the pop culture, and we are looking for a Head of Design to help drive TheLADbible 2.0.  <br /><br />Managing a team of designers and reporting into the Head of Marketing and Brand, you will drive the visual identity of TheLADbible group properties including TheLADbible, The Sport Bible and develop new brands we are bringing into the pop culture space.  You will be a key part of the visual shift that will take the UK’s number one youth brand into a new aspirational space. <br /><br />Specifically, you’ll be required to:<br /> <br />Combine your cultural awareness and commercial knowledge to produce successful design solutions for prospective and existing brand partners<br />Drive commercial and agency briefs from a design perspective, ensuring that all briefs are taken, answered and delivered within set time frames and within budget<br />Create and design visual assets for Video, Editorial, Sales, Digital (media display etc), Marketing as well as any additional requests as required by TheLADbible group or internal creative agency<br />Be responsible for clearly communicating and upholding the integrity of your design work both internally and externally presenting to clients<br />Manage other members of the design team including a senior designer and another designer, and this is set to grow<br />Deliver quality design work in a fast-paced, often high pressure environment<br />Adapt and respond to the flexibility and demands of the working environment and new and existing trends<br />Support the department with new business opportunities<br />Work closely with all other departments in the company (particularly sales, marketing, production, and tech), as part of our creative team<br />Build a positive, strong rapport with the wider teams to support their objectives through editorial delivery<br />Continually drive to shape and develop TheLADbible Group media brand using visual elements to move the brand forward <br />Continually grow an external network of freelancers and illustrators to draw on to further support/enhance any projects for TheLADbible Group.<br /> <br />The right person will:<br /><br />Have a track-record in producing amazing design work and have experience within a similar role at a publisher or creative agency<br />Have a passion for youth culture and a broad understanding of social media and the entertainment industries<br />Strong aesthetic appreciation and the ability to articulate ideas powerfully through design<br />Understand current design trends<br />Have great knowledge of the company’s market position, brand and overall style<br />Have a flexible and adaptable approach to work<br />Have an abundance of creative talent, passion and energy<br />Have the ability to naturally build a positive, strong rapport with the wider teams and a love for working collaboratively<br />Strong aesthetic appreciation and the ability to articulate ideas powerfully in visual form<br />A keen sense of humour<br />Genuine passion about TheLADbible brand<br />Ambition to really add value to the company<br /> <br /><br />Overview: <br /><br />TheLADbible Group is at the forefront of digital publishing and social entertainment. With over 110 staff across our Manchester and London offices. Our people communicate with over 42M followers publishing over 5k pieces of content per month. We are the 2nd largest publisher of video online in the world ahead of Disney and Time Warner.<br /><br /> TheLADbible Group builds communities across multiple channels including our websites, Facebook, Instagram, Snapchat, Vine, Twitter, YouTube, AppleTV and our apps. We understand our audience and are on their side. Our community brings people together and we try to use our influence for good. We are the forefront of digital publishing and social entertainment. With over 110 staff across two key locations, Manchester and London, our brands include TheLADbible, TheSPORTbible, TheODDSbible, TheLENSbible, TheCONTENTbible, TheGAMINGbible, TheFOODbible, TheLADbibleOZ and Pretty52.",
    "urlFetchPending": false,
    "published": "Apr 5, 2017 1:00:27 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_locals-only"
    ]
  },
  {
    "id": "6ftwutvRSM6_f3qq3Yx_pg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56090/uxproduct-designer-at-clickmechanic/",
    "title": "UX/Product Designer",
    "content": "ClickMechanic is looking for an experienced and versatile UX/Product designer to join the our team.<br />As a UX/Product Designer, you will be responsible for designing new features and interactions for our website, building prototypes and working with the Product and Tech teams to launch them. You’re an exceptional designer with experience in UX research to support your design development. You’ll value delivering an engaging and highly functional site experience with excellent design and aesthetic standards. You’ll be the owner of our digital style guide, developing and improving our digital identity across all digital touch-points (digital marketing, site experience etc.)<br /><br />The preferred candidate will have significant experience of UX/UI design. You’ll be able to understand customer problems, research industry best practice and create designs to improve the customer experience that and enhance the ClickMechanic brand. You’ll have a proven track record of collaborating with stakeholders across the Product and Tech team to bring your designs to life.<br /><br />Responsibilities<br />UX design - Design and development of new features and feature improvements with the Product Manager<br />Prototyping - Develop and test prototypes to ensure high quality of feature development<br />Design implementation - You’ll work with the tech team to implement your designs<br />Style guide - You’ll own our digital style guide and ongoing development and improvement<br />UX Research - Use of UX research tools and best practice to inform your designs<br /><br />Skills and experience<br />Strong digital design experience, possibly with a degree in related discipline<br />Experience in tools such as Sketch, InVision, Balsamiq, and/or Photoshop<br />Experience in icon design<br />Extensive portfolio across range of clients and industries of digital UX work across range of clients<br />Intellectually curious with an ability to understand complex problem and develop creative solutions<br />Experience working with tech teams to bring your designs to life<br />Designing mobile-first experiences<br />",
    "urlFetchPending": false,
    "published": "Apr 5, 2017 10:17:39 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "UJ8-s5oGSn-YHSBs7YdqBA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56003/graphic-designer-for-shoreditch-high-growth-b2b-tech-company-at-qudini/",
    "title": "Graphic Designer for Shoreditch high-growth B2B Tech company",
    "content": "Junior Graphic Designer for Shoreditch based high-growth B2B Technology company <br /><br /><br />Starting Salary: £18,000 – 22,000 Dependent on Experience<br /><br />We are a fast-growing technology company that offer an innovative B2B Customer Experience SaaS solution. We work primarily with the enterprise retail market, but also have clients in: health care, local government, hospitality and entertainment/leisure. We work with significant global brands, including O2, Telefonica global and House of Fraser.<br /><br />We are growing our energetic and ambitious team, and looking for individuals who are driven, dynamic and keen to make an impact within a small business. We value people with a high-growth mind-set and innovative vision, individuals who are also analytical in their approach and keen to learn and be challenged.<br /><br />We are hiring a graphic design to add value to a variety of teams across the business.<br /><br />The ideal candidate will be able to use key graphic design tools and will be looking to use their position at Qudini to kick start a career within Graphic Design, Marketing or UI design.<br /><br /><br />•    Creation of marketing material and presentations - Work with our CEO, Marketing & Project Management team to design and create PowerPoint presentations, proposals, posters, website, flyers, case studies, brochures, social media sharing, the company website and more<br />•    Image creation – Create photo mock-ups, icons and other images for marketing content, articles, blogs presentations and more<br />•    Product UI design - Create Product Wireframes and UI designs for, working with our UI designer and Product Manager<br />•    PowerPoint finalisation - In charge of formatting and branding all PowerPoint presentations before they are sent out and creating own PowerPoint presentations<br />•    Wireframing – Wireframing web and app designs to visualise new functionality or web-layouts before design<br />•    Web-design - Design new webpages and image content for the company website and work with web-developers to ensure final content looks like the website<br />•    Marketing support – Generally supporting the marketing team with their marketing projects and campaigns – from ideation, planning to execution, including: blogs, events <br />•    Creative problem solving - Helping to come up with and visualise technology solutions/Features that help our clients to solve challenges in their stores  <br />•    Photography - Take photographs as the business needs <br />•    Video editing – work with project management and marketing to create and edit videos for case study content, training and general marketing use <br />•    Landing page design – use our simple to use landing page tool to create visually compelling landing pages<br />•    Editing pre-formatted HTML/CSS content – to change the colours, logos and written content <br /><br /><br />Other tasks<br />•    Help to manage our website CMS platform to post new content and blogs <br />•    Review the company product and feedback on User Experience, create screenshots and packs to overview new functionality <br />•    Work across the business to generally add value <br /><br />Essential skills<br />•    Microsoft PowerPoint <br />•    Adobe Photoshop <br />•    Use of Adobe illustrator and/or Sketch <br />•    Use of basic video editing tools: iMovie <br />•    Can be trained on the job: Use of wireframing tools<br /><br />Please send in links to your online portfolio <br /><br />Additional High value skills:<br />•    Basic ability of HTML & CSS<br /><br /><br />Skills profile:<br />•    Strong sense of design with an eye for detail and quality <br />•    A creative thinker and problem solver<br /><br /><br />Where this role might take you…<br />This role will help you to develop a variety of skills within a small business that can lead to career opportunities in: Graphic design, Web-design, Marketing, UI/UX design, Product Management <br /><br /><br /><br /><br />",
    "urlFetchPending": false,
    "published": "Apr 3, 2017 12:33:26 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "XP-h9OMjTp2B87hCvSxGsg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/55999/junior-graphic-designer-fm-at-divimove-gmbh/",
    "title": "(Junior) Graphic Designer (f/m)",
    "content": "*About Us*<br /><br />Divimove is Europe’s industry leader in the online video world, a media company that is part of FremantleMedia and belongs to the RTL Group. Founded in 2012, our international team of more than 60 people creates innovative online content for leading international brands and manages Europe’s largest social influencer network with over 1,200 partners. At Divimove we collaborate as a team to shape the future of online video. We develop sustainable entertainment careers and help social influencers to become an own brand across all digital platforms, such as YouTube, Facebook, Instagram and Snapchat. Our in-house online video creative agency ‘brandboost’ enables brands to boost their business with the power of online video.<br /><br />(Junior) Graphic Designer (f/m)<br /><br />You have already gained experience in delivering striking and clickable graphics for social media? You can work independently but enjoy teamwork in the same breath? You are not only able to adapt to existing branding guidelines, but you have vision to develop them further, you enjoy experimenting, and are happy to learn new skills? Then you could be the perfect fit. <br /><br />As a (Junior) Graphic Designer you shape the visual identity of Divimove on a long-term basis. Your everyday work includes among other things the design of graphics for our internal as well as external social media channels, the design of pitch presentations to help depict creative concepts to our clients, and the design of branding elements for Divimove and the influencers we work with.<br /><br />*Your Profile*<br /><br />* First relevant working experience in Graphic Design.<br />* In-depth knowledge of Adobe Illustrator, InDesign, and Photoshop.<br />* Strong skills in the fields of branding, illustration, and web design.<br />* Clear and strong style of visual thinking and the ability to execute your ideas in a contemporary and powerful style of design.<br />* Excellent eye for typography, colors, and composition.<br />* Preferably experience in prototyping tools like InVision and applications like Webflow.<br />* Excellent English language skills.<br /><br />*What you can expect*<br /><br />* An exciting challenge in an extraordinary multicultural work environment.<br />* Be part of Europe’s industry leader in the online video world.<br />* The chance to develop your own ideas and bring them to life.<br />* Unique projects and working with great and highly demanded products such as online video.<br /><br />*Does this job profile sound exciting to you?*<br /><br />Then we are looking forward to your complete application documents, including your portfolio, and information on your earliest possible start date and your salary expectation. Anna Schuller will take care of your application.",
    "urlFetchPending": false,
    "published": "Apr 3, 2017 11:22:20 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "nX4X0gm1T4G2uXflsHt0wg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/55685/ux-ui-designer-at-checkoutcom/",
    "title": "UX / UI Designer",
    "content": "<br />About us <br />Founded in 2010, Checkout.com is an international FinTech company providing end-to-end ecommerce solutions for payments on the Internet. Built on 100% proprietary technology Checkout.com’s online platform offers all credit and debit cards as well as alternative and local payment methods through a single integration. With clients such as Deliveroo, Virgin, Adidas and many more, Checkout.com’s 120+ talented team members serve a list of true tier one global retailers and leading mobile applications from its London, Dubai, Singapore and Mauritius offices. <br />At Checkout.com we strive to create a unique working environment where each of our employees are empowered to take their responsibilities, solve complex puzzles and deliver value accretive solutions for the Company. We believe an individual maximum yield can only be achieved through a dynamic culture that focuses on personal growth and fully tailored career development paths. <br />This experience is offered in a fast paced and innovation-focused office space ideally located in the heart of London.<br /><br />About the role <br />Checkout.com is actively looking for a passionate and forward-thinking UX/UI Designer to join our Product & Innovation team. If you love to crack complex design puzzles and would love to shape the future of payments, whether it is web or mobile this could be the role for you!<br /><br />Working side by side with our VP of Products you will own the design remit whilst crafting great UX/UI for our products and shaping our brand with consistency and creative expression. With a hand in each stage of the Design process, you will collaborate with our talented Engineering teams bringing the prototypes to life. You will embrace the creative process as a contact sport to build products that are innovative, inventive delivering first class UI.<br /><br />Your will be responsible for: <br />•    Collaborate with VP of Products to define high level requirements and elaborate those as process flows and interaction paradigms <br />•    Define the creative vision and drive concepts to craft innovative interactive experiences <br />•    Quickly move from abstract idea to conceptual sketches based on business objectives and merchant needs <br />•    Deliver artifacts including wireframes, system maps, prototypes (paper or interactive) up to the completed visual Design <br />•    Create pixel-perfect and conversion-focused UI <br />•    Champion UX for a variety of projects across Checkout.com <br />•    Act as the user advocate to ensure that product functionalities deliver the user needs for simplicity <br />•    Keep up to date with UX/UI best practices and developments, and pro-actively share knowledge and examples across the business<br /><br />About you <br />•    5+ years UX/UI Design experience, solving complex UX problems and delivering first-class UI across a variety of interfaces and devices <br />•    Passion for elegant and pixel perfect UI <br />•    Excellent understanding of outputs from user insights and transforming them into consistent UX systems <br />•    Ability to rationalize Design decisions through research or other means <br />•    Expert with Adobe Creative Suite (Photoshop and Illustrator mainly) and other tools for wire framing and sketching <br />•    Good knowledge of Web technologies such as CSS and HTML is a definite plus <br />•    Roust understanding of how available technologies impact Design decisions <br />•    BSc in HCI, information science, or any Design-related discipline <br />•    Fluency in English<br /><br />Checkout.com is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience, skills and personality. We welcome applications from all members of society irrespective of age, sex, disability, sexual orientation, race, religion or belief. <br />Due to the numerous amount of application received, only the ones corresponding to this job profile will be contacted. If you have not been contacted within 3 weeks please deem your application as unsuccessful.",
    "urlFetchPending": false,
    "published": "Mar 24, 2017 1:38:50 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "qkfTDH4_TrqJWg25MrYONg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/55388/industrial-product-designer-at-hoofprints-technologies-ltd/",
    "title": "Industrial & Product Designer",
    "content": "At Hoofprints, we are on a mission to transform the way food is produced globally, starting with meat production in the UK. We are developing a range of connected products and services to catalyse the adoption of technology into the livestock farming industry.<br /><br />We recently won an Innovate UK grant to support our ambitious project. We are collaborating with prominent agricultural bodies that provide us with access to their animal science expertise and network of industry partners. <br /><br />Livestock farmers in the extensive systems face lamb losses of up to 20% every year, resulting in considerable economic and productivity inefficiencies. Due to the nature of the industry, farmers are often required to spend up to two hours everyday locating their animals.<br /><br />We have developed an ultra efficient device that enables farmers to remotely track and monitor what their animals are up to. Using a combination of low powered sensors, wide area networks and energy harvesting methods, we are uniquely positioned to deliver a seamless customer experience. Currently, we are actively tracking sheep and cattle at a remote hill farm in Scotland.<br /><br />We are looking to recruit an Industrial Designer with a keen interest in our industry and a passion for creativity and user centered design.<br />We are not looking for years of design experience (it’s a bonus if you do!) but we do expect you to be self motivated, proactive and demonstrate a willingness to take ownership of our product design.<br /><br />What you’ll be doing:<br />* Work with our network of early adopters to understand their product requirements<br />* Wireframe designs and early prototypes, develop looks-like-prototypes<br />* Work with the team to take the engineering prototype along the various hardware design phases (EVT -> DVT -> PVT -> Mass production)<br /><br />What you’ll need;<br />* A degree in Industrial and / or Product Design.<br />* Knowledge of injection moulding, 3D printing<br />* Strong analytical, creative and visual design skills with proficiency in a CAD tool (Inventor, Solidworks, etc)<br /><br />What we offer:<br />* An opportunity for you to influence and improve the way food is produced globally<br />* A flexible startup working environment<br />* A competitive salary with equity package<br /><br />Please note, we are only looking for applicants *eligible* to work in the UK. Unfortunately the company is unable to provide visa sponsorships.",
    "urlFetchPending": false,
    "published": "Mar 16, 2017 3:53:17 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "S89YJ5HYSUmfNkdwGOJVGg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/55354/ui-ux-product-designer-to-transform-healthcare-and-improve-health-outcomes-at-healum/",
    "title": "UI / UX Product Designer to transform healthcare and improve health outcomes",
    "content": "*We are Healum* - a well funded digital health company on a mission to improve and save 100 million lives across the globe. We believe that everyone should have access to better personalised preventative healthcare and healthcare professionals should be empowered to deliver this experience to their patients. Digital solutions can make this a reality.  We build digital products to enable patients to monitor and understand their health, and software that empowers health professionals to achieve better outcomes with their patients. Our single aim is to maximise people’s engagement with their health by delighting them with products that make them feel confident, supported and motivated.<br /><br />*We are looking for* the best UI/UX product designer in London. Our customers and users play the  most important role in building our products. Are you someone who believes in working collaboratively to build magical user experiences involving our customers and users at every step? Do you embrace change and experiment? Are you excited about applying principles of psychology and behavioural science to inspire and motivate users? Do you value user's feedback above all else? Would you be willing to give your life to create brilliant UX? - okay that's a bit too much but you get the idea. The most important characteristic is that you can wear many hats across the product lifecycle - you’ll love getting your hands dirty with great UX / UI design and you’ll have a passion for playing a lead role in envisioning our product roadmap and strategy. You will work closely with the founders to combine service design and user experience to design customer journeys that genuinely enrich people's lives. If you happen to love insights data from user testing, then we LOVE you. <br /><br /><br />*You have*<br />* Expansive thinking and user centric design principles to deliver delightful and empowering products for healthcare professionals and patients through different screen formats<br />* Vision - and lots of it. You can see what healthcare could look like in 50 years time and what we could contribute to that.<br />* Passion to build products that enable sustainable behaviour change based on user insights derived from the power of big data <br />* Ambition to successfully create products that are famous for delighting users and driving patient engagement <br />* Wizardry to seamlessly weave iconography, typography, colour, motion and texture into the products to delight, inspire, engage and excite users<br />* Crazy attention to detail - sleepless nights because a pixel in your design was out of place.<br /><br />*You also have*<br />* Previous startup experience - you thrive in conditions of uncertainty and pressure<br />* Experience in designing experiences and products that engage users in changing or replacing their behaviour using behaviour science and psychology<br />* Experience working with remote teams of designers and developers<br />* High value for openness, humility, flexibility, collaboration, diversity and empathy<br />* Experience in leading a team of designers to plan, cost and communicate design tasks<br />* High value for diversity of thought and experience, and can effectively communicate and challenge ideas. <br /><br />*As one of our first team members, a typical day might include some of the following:*<br />* Work with the founders to evolve Healum’s proposition and its product roadmap through user research, key user insights and user centered design principles.<br />* Work with our customers on the user profiles and UX journeys, to identify and uncover user pain points and needs; delivering sitemaps, information architecture, user journey maps, interaction and content strategy as a result.<br />* Work with the development team on visual design of the UX / UI for our mobile and web apps and interactive elements of all the features; as part of our agile product & technology roadmap<br />* Gain fast user feedback with static and interactive wireframes via platforms such as Flinto or InVision<br />* Develop and infuse our brand identity, brand colours, typography, iconography into our products, website, sales and marketing materials<br />* Inspire us with latest design and innovation trends especially in digital health and create some of your own. <br /><br />*To land this EPIC gig, you need...*<br />Quality experience in product design, a degree related to product design or Visual Arts, insane knowledge of Illustrator, Sketch and one other tool of your choice, a mouth watering portfolio of doodles, case studies and past work, working knowledge of HTML, CSS, standard web design principles, mobile design principles for Android and iOS platforms and huge scale thinking!<br /><br />Would you like to make a lasting impact in people’s lives and change them for better? Then send us some of your doodles and case studies, right away.",
    "urlFetchPending": false,
    "published": "Mar 16, 2017 8:14:50 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "85f9LTHdRr2HID86Gwemhg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/55351/designer-htmlphp-at-rich-media-ltd/",
    "title": "Designer HTML/PHP",
    "content": "We are looking for an enthusiastic designer, to design high quality/converting websites in a wide range of different verticals.<br /><br />ABOUT US<br />We are a fast growing media company who own multiple-international  sites and social media accounts . We are looking to expand further into new markets, and need high converting website designs – that’s where you come in :)<br /><br />The type of sites we will need designs for include hotels,  voucher codes and other type sites,<br /><br />ABOUT YOU<br />You are a confident designer will a good eye for good,high converting designs.  You are comfortable with being given a task and working until completion and will be excited to show your entrepreneurial flair by providing new ideas and insights.<br /><br />Experience is not necessarily required as we will train you in all the tools and tricks we use. The key is that you are ambitious, work hard and want to be part of something great!<br /><br />BENEFITS<br />We will provide expenses throughout the internship, and there will be the opportunity for a full time position if it is a success. You work from home.",
    "urlFetchPending": false,
    "published": "Mar 15, 2017 7:58:53 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "xhJizNepSZSNhdtB9UrLqA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/55344/lead-designer-at-catapult-at-catapult/",
    "title": "Lead Designer at Catapult",
    "content": "At Catapult we're building a better way for people to find casual work. Whether it's working in a bar, hotel or stadium, our candidates receive jobs through our app and are free to choose exactly who they work for and when. With Catapult, the casual workforce now has complete control and ownership of their working life.<br /><br />We work with some of the best known hotels, stadiums, retails, bars and restaurants in the UK. We've been growing incredibly fast and are looking for a hands on designer to join us for the next stage of our journey.<br /><br />*About the role*<br /><br />Your first task will be to review our existing - fairly ad-hoc - branding and design and help to develop a plan for bringing all of this together across web, mobile, email and offline.<br /><br />You'll then be working closely with the product team to shape everything from our candidate mobile app to our employer tablet and web application. You'll work with the product owner to understand new features, develop user journeys, rapidly iterate on wireframes and mockups before creating final designs to be implemented by the development team.<br /><br />As our first designer you'll have the opportunity to have a real impact on the design and UX of our product as well as the overall product roadmap.<br /><br />*About You*<br /><br />* You think in terms of users and how design makes it easier for them to achieve their goals<br />* You have an impressive portfolio of existing work, ideally some of it with early stage startups<br />* You like taking ownership of problems and projects and seek out responsibility<br />* You have strong visual design skills, you keep up to date with the latest iOS and Android guidelines as well as best * practices and industry trends<br />* You're comfortable working with user stories, sketching and iterating on wireframes, mockups and prototypes<br />* You care equally about aesthetics and user experience, you aim for solutions which incorporate both<br />* You're confident using the Adobe CC Suite, Sketch etc<br />* You're a fan of incorporating data into your decision making process and will actively seek out data which isn't immediately available<br />* You're confident presenting your ideas to a team and leading discussions on them<br /><br />Please include a portfolio (or link to one) in your application and some information about why you'd like to work with Catapult specifically.",
    "urlFetchPending": false,
    "published": "Mar 15, 2017 6:49:23 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "j2o-IgGCTeW7ZjN7Uv19HQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/55201/junior-ui-designer-at-neutral-digital/",
    "title": "Junior UI Designer",
    "content": "*The Company*<br />We are Neutral Digital, a design and software consultancy at the cutting edge of immersive interactive solutions, we create exquisite context-aware user experiences, from visualisation tools for architects to user interfaces for the world’s leading airlines, enabling our clients to capitalise on new technology and strengthen their brands and products.<br /><br />*Role*<br />We are looking for a Junior UI Designer to join our team in London. You will be focused on designing apps, games, tools and experiences across aviation, architecture, automotive and military. You’ll share our passion for solving problems, striving to create simple and elegant solutions utilising a full range of mediums and design tools. This is an exciting opportunity to work on some amazing projects using some of the latest AR/VR technology including the HTC Vive and Microsoft HoloLens.<br /><br />*Responsibilities*<br />* Conceive and create high-quality designs for mobile, tablet, desktop and web<br />* Develop sketches, wireframes and flows<br />* Collaborate to create clean and intuitive prototypes<br />* Learn about emerging design trends, standards and technology<br /><br />*Skills & Requirements*<br />* A clean, functional design aesthetic and visually compelling portfolio<br />* A good understanding of grid systems, composition and colour<br />* A keen eye for typography, and meticulous attention to detail<br />* Proficiency with Adobe Creative Suite (Photoshop, Illustrator)<br />* Ability to communicate effectively in English<br />* UK work permit or EU/EEA/Swiss/UK citizenship",
    "urlFetchPending": false,
    "published": "Mar 10, 2017 7:13:39 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "Ts78iYJZQcuvzvRusurMQQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/55200/senior-ui-designer-at-neutral-digital/",
    "title": "Senior UI Designer",
    "content": "*The Company*<br />We are Neutral Digital, a design and software consultancy at the cutting edge of immersive interactive solutions, we create exquisite context-aware user experiences, from visualisation tools for architects to user interfaces for the world’s leading airlines, enabling our clients to capitalise on new technology and strengthen their brands and products.<br /><br />*Role*<br />We are looking for a Senior UI Designer to join our team in London. You will be focused on designing apps, games, tools and experiences across aviation, architecture, automotive and military. You will be responsible for a small team of designers working closely with the creative director and share our passion for solving problems, striving to create simple and elegant solutions utilising a full range of mediums and design tools. This is an exciting opportunity to work on some amazing projects using some of the latest AR/VR technology including the HTC Vive and Microsoft HoloLens.<br /><br />*Responsibilities*<br />* Conceive and create high-quality designs for mobile, tablet, desktop and web<br />* Develop sketches, wireframes and flows<br />* Collaborate to create clean and intuitive prototypes<br />* Learn about emerging design trends, standards and technology<br /><br />*Skills & Requirements*<br />* BA or MA level design degree or equivalent<br />* 5+ years of UI design experience<br />* A clean, functional design aesthetic and visually compelling portfolio<br />* A good understanding of grid systems, composition and colour<br />* A keen eye for typography, and meticulous attention to detail<br />* Proficiency with Adobe Creative Suite (Photoshop, Illustrator)<br />* Strong communication and storyteller<br />* Able to define creative direction and execution<br />* A passion for seeking highly creative solutions for clients and users<br />* Ability to communicate effectively in English<br />* UK work permit or EU/EEA/Swiss/UK citizenship",
    "urlFetchPending": false,
    "published": "Mar 10, 2017 7:09:04 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "CqcK44UhRz2Z3gDg2zIhbQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/54891/digitalproduct-designer-internship-at-festicket/",
    "title": "Digital/Product Designer (Internship)",
    "content": "DESCRIPTION<br /><br />ABOUT US<br /><br />Festicket is transforming the way music fans discover and book tickets and travel packages for festivals around the world. Our platform revolutionises the music festival industry by offering an end-to-end experience for music travellers through an efficient two-sided marketplace for 500+ music festivals across 40 different countries! In three short years, we have become Europe's largest music festival platform.<br /><br />Furthermore, we've announced Series B funding - https://techcrunch.com/2016/06/30/festicket-let-it... - and now we're looking to grow the Festicket Family!<br /><br />YOUR ROLE<br /><br />Festicket is looking for a talented Product/Digital Design Intern to join our growing design team for a period of 3-6 months, you will be responsible for maintaining the admin for the team, whilst working closely/shadowing other Senior members of the team.<br /><br />DAY TO DAY TASKS<br /><br />Collaborate with internal stakeholders (mainly marketing) to understand business goals and maintain a consistent message across all media.<br />Take broad, conceptual ideas and turn them into something useful and valuable for our advertisers & publishers.<br />Design flows and experiences that are incredibly simple and elegant<br />Contribute to high-level strategic decisions with the rest of the product and executive teams<br />Be willing to work as product designer and solve design problems that impact on million of users<br />Be among the best at what you do and be ready to be challenged by your peers.<br />Help to establish a design culture in the company as a whole.<br /><br />REQUIREMENTS<br /><br />* Fluent English (written/spoken).<br />* A student studying a degree, in either a UK based higher education institute or an EU University.<br />* A passion for design and beautiful digital products.<br />* Excellent creative and visual skills with a strong attention to details.<br />* Proficiency with Photoshop, Sketch, Illustrator and After Effects or any other video editing software.<br />* Ability to solve problems creatively and effectively.<br />* Able to work independently & as part of a team.<br />* Confident verbal and written communication skills.<br />* Ability to multi-task.<br /><br />BENEFITS<br /><br />We’re a team of 70 located in an amazing converted piano factory in Camden (NW1 8LH) a short stroll from Camden market and Primrose Hill. By joining us you will be part of one of the fastest growing music / travel start-up companies in Europe, where you will have ample opportunity for career progression as we continue to grow.<br /><br />We have a company culture which is very idea orientated and driven but also very social. It's entirely normal at 6pm on a Friday for half the company to be drinking together in the office and then planning to head out for a night out.<br /><br />",
    "urlFetchPending": false,
    "published": "Mar 2, 2017 11:07:47 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_locals-only"
    ]
  },
  {
    "id": "VPxQDjXGQO-AazXccj_BuQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/54841/junior-mid-product-designer-uiux-at-pay4later/",
    "title": "Junior-Mid Product Designer (UI/UX)",
    "content": "A bit about us<br />Pay4Later provide a number of financial products for high street retail. We are in a unique position to provide a choice of lenders to the regular high street shopper giving them the best offer on finance the items they want to buy. By connecting retailers and their customers with the correct lender we take on no risk but provide a fast and seamless digital service that is sitting right at the forefront of the FinTech sector. 2017 spells a shift in the business and with the planned release of a number of features and products we are looking to expand our design team.<br /><br /><br />A bit about the role<br />With a rapidly growing business, we are in need of a savvy and switched on designer to help with the day-to-day research. Aspects of our system are complex and making them feel simple and intuitive to use is no easy task. The role encompasses everything required of today’s designer in a startup-shaped community: UX, UI, Hackathons, Design Sprints, presentations, interviewing, field work, testing, questioning, autonomous and team work, agile workflow, sketching, chin scratching, talking, helping and being the driving force behind the power of design thinking. The work created will have a direct impact on the business therefore articulation and delivery to the senior members of the company will be required.<br /><br /><br />A bit about you<br />1-2 years experience. A head for user-centred solutions, an eye for modern, cutting edge design and creative mind for unique micro-interactions and UI patterns. A mobile-first thought path and a desire to learn on the go and think on your feet. UX is the big acronym for this position but you will touch on multiple aspects of the process as well as discuss ideas with product managers, engineers and other members of the business. You will also be involved in the marketing side of things when required to help shape how we talk about our products to a wider audience. You do not need a huge amount of experience but a desire to learn and enjoy yourself. <br /><br />This is a great opportunity to be involved in a business that is growing and not yet established, to shape the future of our products and be exposed to the exciting and diverse financial sector. It’s time to shake up and challenge the old way of thinking and do something completely new.<br /><br />The tools we use are Balsamiq, Sketch, Keynote, Postit’s, paper and pen.<br /><br />No recruiters please",
    "urlFetchPending": false,
    "published": "Mar 1, 2017 12:32:24 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "JHfyVd-KTyKhNfFAxmdNnw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/55302/uxui-designer-for-dateplay-at-dateplay/",
    "title": "UX/UI Designer for DatePlay",
    "content": "We’re looking for an enthusiastic UX Designer to work with us in improving our super cool dating app, DatePlay.  DatePlay is a dating app that was featured on The Apprentice on BBC1 in Dec 2015. Our website: www.dateplay.com. The idea is simple: you play games to meet your match. :-D<br /><br />So, what stage are we at? We are live on iOS and launching on Android soon. We launched Feb 14 on Valentines Day and have gotten great feedback since then. We have lots of information from users about where they would like to see improvements, so you would be in charge of figuring out how to best implement those changes!<br /><br />Skills you’ll use:<br />Design thinking<br />User research<br />Ideation<br />Wireframing<br />Prototyping, testing and analysis<br />Service mapping/documenting<br /><br />Note: Start as contract / freelance, with opportunity to go full-time later on.<br /><br />Please include a cover letter and CV in your application! Thanks :) ",
    "urlFetchPending": false,
    "published": "Mar 14, 2017 7:12:33 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "jZHhClyrSCaJiKdX4aineA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=14096300",
    "title": "180heartbeats + JUNG v MATT Warsaw, Poland. Full time on location in an experimental lab of three people. ## Interaction designer with ...",
    "content": "<div>                  <span>180heartbeats + JUNG v MATT<p>Warsaw, Poland. Full time on location in an experimental lab of three people.</p><p>## Interaction designer with front-end skills</p><p>* Research-first, up to date with trends and topics in the industry and in general</p><p>* You have your own way of looking at things</p><p>* Experience with interactive prototypes (Framer, Atomic, Proto, Pixate, Processing)</p><p>* Experience with basic front end (landing pages, layouts, CSS dirty tricks)</p><p>* Nice to have - UX knowledge or knowing a bit about data visualization and a brush with graphic design</p><p>## Creative technologist</p><p>* You're a tech generalist/hacker kind of person</p><p>* You get things done with any mix of technologies</p><p>* Built more prototypes than finished products</p><p>* Balanced between hardware and software</p><p>* Can carry out feasibility research on your own</p><p>* Ordered electronic parts from suppliers before</p><p>* Familiar with any of: NodeJS, Python, Ruby</p><p>* Acquainted with popular SBC like Arduino, Raspberry Pi and their derivatives</p><p>* Preferably leaning towards UNIX</p><p>More details here: <a href=&quot;http://lab.180hb.com/opportunities/&quot; rel=&quot;nofollow&quot;>http://lab.180hb.com/opportunities/</a><span>              </span></p><div>        <p>                        </p></div></span></div>",
    "content2": "",
    "urlFetchPending": false,
    "published": "Apr 12, 2017 2:00:05 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "ejKsDGnDQ4u82_nMVs-9gw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=14077807",
    "title": "Measurence | Designer | NYC, Milan (Italy) | Full time, remote",
    "content": "<div>                  <span>Measurence | Designer | NYC, Milan (Italy) | Full time, remote<p>------</p><p>Our vision</p><p>90% of the economy lives offline but we know very little of what happens there. Our vision is to quantify and understand the physical world around us to improve business decision making. We analyze people behavior in physical spaces by collecting millions of data points with our simple, plug&amp;play WiFi sensor and we build algorithms that delivers actionable analytics from the physical world.</p><p>------</p><p>Who we are</p><p>We are a committed to creating a strong culture based on the values we live by: Transparency, Honesty, Autonomy, Curiosity, Commitment, Approachability, Creativity, Collaborativity, Frugality, Ownership, Focus.We believe that while implementation experience is essential, enthusiasm and interest can trump experience: we are willing to take a chance on someone who wants to step up!</p><p>------</p><p>We need a designer with mobile experience that can do branding and visual + interaction design for our dashboard – think Google Analytics but with real world data and more actionable.We are a startup so... we will need help with other &quot;design stuff&quot; :)</p><p>Requirements- Available 20+ hours / week- Location can be anywhere, NYC or Milan (Italy) preferred</p><p>------</p><p>To apply, email your LinkedIn Url (like: www.linkedin.com/in/alessandroprioni) AND the link of this thread (<a href=&quot;https://news.ycombinator.com/item?id=14023198&quot; rel=&quot;nofollow&quot;>https://news.ycombinator.com/item?id=14023198</a>) to aprioni@measurence.com cc’ing recruiting-designer@measurence.com<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "content2": "",
    "urlFetchPending": false,
    "published": "Apr 10, 2017 3:15:05 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_locals-only"
    ]
  },
  {
    "id": "DPc8ZWBjQBGGFxrOIEo89w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=14028354",
    "title": "Grailed | Engineering and Design positions | New York, NY | https://www.grailed.com",
    "content": "<div>                  <span>Grailed | Engineering and Design positions | New York, NY | <a href=&quot;https://www.grailed.com&quot; rel=&quot;nofollow&quot;>https://www.grailed.com</a><p>Grailed is a small team that has a vision to build a company that creates second hard marketplaces for enthusiasts of luxury products. We've had a lot of traction building out grailed.com - a menswear focused site and are currently building a similar site for womenswear. We have quite a few more ideas for marketplaces after that.</p><p>We like to work on things we ourselves have a deep interest in and care a lot about building things we're proud of. Currently we're looking to expand our current engineering team of 8 people with either generalists or specialists. Our product and design team of 2 - is also looking out for experienced designers.</p><p>Hit us up at jobs@grailed.com if you have any questions or have an interest in applying.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "content2": "",
    "urlFetchPending": false,
    "published": "Apr 4, 2017 3:00:04 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "REMOTE2_America"
    ]
  },
  {
    "id": "NLlT_8C5SgOGDsBxiQPy2g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Web-Designer-m-f-/2470416",
    "title": "Web Designer (m/f) - Savings United GmbH - (Hamburg) - FullTime",
    "content": "<li>          <a rel=&quot;nofollow&quot;>                 Savings United GmbH</a>              (Hamburg)          </li><li>                  Fulltime Job        </li><h2>Web Designer (m/f)</h2><p>Savings United is an international network of digital coupon marketplaces. We provide online coupons and shopping deals to millions of consumers around the globe. Our fast-growing internet startup is located right at the famous river Elbe in Hamburg, Germany. It’s our objective and our drive to provide millions of international internet users with the best online coupon codes of more than 1000 eCommerce stores. Our network in several countries consists of strong websites and for our mission to become the leading coupon provider. We are searching for a highly ambitious and motivated Web Designer (m/f). You have collected first experiences of coding and designing and feel encouraged to support us during this extremely exciting and challenging journey? We are more than looking forward to receive your convincing and creative application.</p><p>Responsibilities:</p><p>● Responsibility: You are responsible for different online projects <br><br>● Innovation: You design, develop and implement creative layouts and content for different internet sides <br><br>● Scalability: You work autonomously on scalable, high-availability websites <br><br>● Big picture: You keep the big picture in mind in everything you do <br><br>● Interface function: You are vital link to other departments as well as our management</p><p>Requirements:</p><p>● You have first practical experiences in web design <br><br>● You are experienced with UI/UX Design and Corporate Design <br><br>● You are familiar with the Adobe Family as well as with Scetch, HTML5, CSS3, Responsive Design, <span>SVN</span>/Git <br><br>● A plus but not a must have: you have practical experience with Apps, Ruby on Rails, jQuery, Ajax and Print <br><br>● The motivation to learn and improve development processes <br><br>● A positive mind-set and the people skills to work with various international people in various positions <br><br>● Fluent English skills</p><p>What we offer:</p><p>● Enjoy a responsible function within an exciting entrepreneurial environment <br><br>● A high scope of action and creative leeway <br><br>● Flexible working hours <br><br>● A high-end notebook at your choice, free drinks and team events <br><br>● A dynamic, young team in a loft-like office</p><p>Did we inspire your curiosity? Can’t wait to meet us personally and impress us with your drive?<br><br>Please apply at our online form on http://www.savings-united.com/career. Your contact is Antonia Feldhaus.</p><p>If you want to learn more about the company, please visit www.savings-united.com.</p><h3>How to apply</h3><a href=&quot;http://www.savings-united.com/career&quot; rel=&quot;nofollow&quot;>http://www.savings-united.com/career</a><a href=&quot;http://www.savings-united.com&quot; rel=&quot;nofollow&quot;>www.savings-united.com</a>",
    "urlFetchPending": false,
    "published": "Feb 21, 2017 4:26:15 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_50",
      "REMOTE2_America",
      "TECH2_Design"
    ]
  },
  {
    "id": "Jy8qEPjoQfW5sZoIFiTQOQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/22980",
    "title": "Front end Designer Developer",
    "content": "<p>Here’s the corporate dribble HR made us put at the top of this ad listing: Acro Media is looking for a Front-end Designer &amp; Developer to drive our client’s dynamic &amp; interactive web sites. While this role will ideally based from&nbsp;our Kelowna office, we are also open to <strong>qualified</strong> remote candidates.</p><br><p>That’s done. Now here’s what we really want. Some cool individual, who loves design, UX, cutting it up, and making it work. Someone who’s a great team player, but can zone out with the headphones on. A person that can figure it out, or if they can’t they can ask for help instead of saying it can’t be done. An individual who knows that good enough isn’t good enough.</p>",
    "urlFetchPending": false,
    "published": "Apr 11, 2017 8:53:57 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_50",
      "REMOTE2_America"
    ]
  },
  {
    "id": "bTErygs-Qxe2Wxulk_5XKg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/22912",
    "title": "Interaction Designer",
    "content": "Precision Nutrition is hiring an Interaction Designer in Remote (Canada)",
    "urlFetchPending": false,
    "published": "Apr 7, 2017 9:04:24 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_50",
      "REMOTE2_America"
    ]
  },
  {
    "id": "XWU5lO3GSpiEXezyRW3Tpg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/22868",
    "title": "Product Designer",
    "content": "Hotjar is hiring a Product Designer (Europe) in Remote",
    "urlFetchPending": false,
    "published": "Apr 6, 2017 12:08:34 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_50",
      "REMOTE2_America"
    ]
  },
  {
    "id": "eO245kdTR3OBHta-54k7yA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56846/frontend-designer-developer-at-key2crm/",
    "title": "Frontend Designer / Developer",
    "content": "We are looking for Frontend Designer / Developer to come in and joining our rapidly growing team. A Frontend designer / developer to come in alongside the designers and back-end developers to be involved in a really exciting project, to start as soon as possible.<br /><br />Required Skills:<br />1. HTML5, CSS3<br />2. JavaScript – Angular 1.5 – 2.0 and D3.JS.<br />3. Experience in building large JavaScript / Web applications<br />4. Ability to take psd, illustrator designs and slice them up in to responsive html and css layouts<br />5. Understanding and belief in Agile<br />6. PHP and Node.js Skills are a bonus<br />7. Must be in the UK and eligible to work in the UK.<br /><br />Must have a portfolio of work to demonstrate the relevant skills (ideally Data Visualisation examples).<br /><br />If you feel you have the correct credentials or are eager to learn, please apply. (No recruiters please!!!)",
    "urlFetchPending": false,
    "published": "Apr 27, 2017 9:51:37 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_50",
      "REMOTE2_America"
    ]
  }
]
}
