{
  "items": [
  {
    "id": "sqEb7IfwSmeNCOd6dbB8Yw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/139759/technical-project-lead-integrated-data-services-ids?a=KRZu84jtxfi",
    "title": "Technical Project Lead at Integrated Data Services (IDS) (Los Angeles, CA) (allows remote)",
    "content": "<div>        <div>                <div>            <div>                                    <div>                    <div>                        <div>                            <h2><a rel=&quot;nofollow&quot;>Technical Project Lead</a>                            </h2>                        </div><a rel=&quot;nofollow&quot;>Integrated Data Services (IDS)</a>                    </div>                </div>                <div>                    <div>                                                        </div>                </div>                <div></div>            </div>        </div>                        </div>        <div>            <h3>                Job Description            </h3>            <div><p><strong>Technical Project Lead <br></strong>Boston, MA – Washington, DC – Dayton, OH – El Segundo, CA</p><p><strong>Company Overview: </strong></p><p>Integrated Data Services, Inc. (IDS) is a leading provider of custom software products and Government financial management services. IDS was founded in 1997 in El Segundo, CA, and since that time has seen tremendous growth and success. Currently IDS has offices supporting customers nationwide. By providing customers with fast, efficient and reliable information systems and support services, IDS has become a preferred provider of financial and programmatic systems, services, and solutions across a wide variety of Government agencies.</p><p><strong>Job description</strong>:</p><p>IDS is seeking an ambitious self-starter to lead software development projects. The position requires proven analytical capabilities, strong persuasive writing skills, and the tenacity to develop ideas independently and thrive in a fast-paced environment. The position will work with teams leveraging numerous technologies with an emphasis on new-build web applications, data integration and system interfaces.</p><p><strong>Responsibilities include, but are not limited to, the following: </strong></p><ul><li>Work with customers, stakeholders and subject matter experts to gain a deep understanding of the software requirements and underlying business processes.</li><li>Actively participate in the software development process to include requirements analysis, user interface design, data modeling, design document preparation, testing, demonstrating and training.</li><li>Leverage functional expertise and problem solving skills to guide and support software development teams.</li><li>Prioritize software development efforts and utilize development team resources to deliver high quality software applications and interfaces.</li><li>Present status of software projects and identify options and solutions to resolve issues.</li><li>Elicit customer feedback to discover new feature requests and identify product improvements.</li><li>Demonstrate software applications and new capabilities to customers.</li><li>Demonstrate software applications and train team members on new capabilities.</li><li>When needed, provide functional support to customers and resolve issues with current functionality in a timely manner.</li></ul><p><strong>Knowledge and Skills:</strong></p><ul><li>At least 5 years of experience supporting software applications or working with software development teams.</li><li>Ability to interface effectively with team members from all functional disciplines as well as senior management.</li><li>Ability to collaborate and communicate with customers and the software end-users.</li><li>Exceptional problem solving skills and the ability to rapidly analyze complex technology and business scenarios.</li><li>Exceptional interpersonal skills focused on the ability to guide interdisciplinary teams through software projects.</li><li>Critical thinker, expected to speak out and defend views.</li><li>Experience with our existing software applications and systems: CCaR™, Executive CCaR™ and PMRT; is desired.</li><li>Experience with Department of Defense (DoD) finance, contracting, acquisition and logistics systems is desired.</li><li>Experience with Atlassian JIRA and Confluence a plus.</li></ul><p><strong>Education and Work Experience:</strong></p><p>This position requires a minimum of a 4-year degree from an accredited college or university in business management, information technology, computer science, or other related discipline.</p><p><strong>Certificates and Licenses:</strong></p><p>Applicants selected for employment will be subject to a Federal background investigation and must meet additional eligibility requirements for access to classified information or materials.</p><p><strong>Travel:</strong></p><p>Some travel may be required.</p><p><strong>Hours:</strong></p><p>Normal work schedule will be 8:00 A.M. to 5:00 P.M., Monday through Friday.&nbsp; May be required to work additional hours and/or weekends, as needed, to meet deadlines or to fulfill travel obligations.</p><p><strong>Salary Range:</strong></p><p>Commensurate with experience.</p><p>Company offers full-benefits package including health, dental, vision and 401K plans.&nbsp; IDS is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regards to race, creed, age, sex, gender, physical or mental disability, sexual orientation, gender identity, gender expression, ancestry, pregnancy, perceived pregnancy, medical condition, marital status, familial status, color, religion, uniformed services, veteran status, national origin, genetic information, or any other characteristic protected under local, state or Federal law.&nbsp; A submission of a resume is an expression of interest and not considered an application.&nbsp;</p><p>For more information, visit <a href=&quot;http://www.get-integrated.com&quot; rel=&quot;nofollow&quot;>www.get-integrated.com</a>. To apply, please send a resume and cover letter to <a href=&quot;mailto:jobs@get-integrated.com&quot; rel=&quot;nofollow&quot;>jobs@get-integrated.com</a> and reference code: IDS-TPL-VL.</p><p><strong>**U.S. citizenship and/or green card is required; H1-B visas and other visas are not being sponsored. Relocation expenses are NOT compensated. All jobs are employer paid; no fees to candidates. Third parties or agencies inquiries are not being accepted.**</strong></p>            </div>        </div>                        </div>",
    "urlFetchPending": false,
    "published": "Apr 29, 2017 1:04:38 PM",
    "tags": [
      "TECH2_software-design",
      "TECH2_build",
      "TECH2_jira",
      "TECH2_confluence",
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_integration"
    ]
  },
  {
    "id": "pVAAwYjPRrWxpXFENchjzg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/139758/senior-ui-developer-integrated-data-services-ids?a=KRYccxM6mFa",
    "title": "Senior UI Developer at Integrated Data Services (IDS) (Washington, DC) (allows remote)",
    "content": "<div>        <div>                <div>            <div>                                    <div>                    <div>                        <div>                            <h2><a rel=&quot;nofollow&quot;>Senior UI Developer</a>                            </h2>                        </div><a rel=&quot;nofollow&quot;>Integrated Data Services (IDS)</a>                    </div>                </div>                <div>                    <div>                                                        </div>                </div>                <div></div>            </div>        </div>                        </div>        <div>            <h3>                Job Description            </h3>            <div><p><strong>Senior UI Developer</strong></p><p>Los Angeles, CA; Washington D.C.; Rochester, NY; Dayton, OH</p><p><strong>Company Overview:</strong></p><p>Integrated Data Services, Inc. (IDS) is a leading provider of custom software products and Government financial management services. IDS was founded in 1997 in El Segundo, CA, and since that time has seen tremendous growth and success. Currently IDS has offices supporting customers nationwide. By providing customers with fast, efficient and reliable information systems and support services, IDS has become a preferred provider of financial and programmatic systems, services, and solutions across a wide variety of Government agencies.</p><p><strong>Position Description:</strong></p><p>IDS is seeking a Senior UI Developer with an expert understanding of UI design. You will be responsible for the design and development of web applications using AngularJS. In addition to writing front-end code, you must be able to work with others to take a design concept and develop it into a production ready product. We’re looking for somebody who is a confident problem solver and who proactively challenges traditional solutions.</p><p><strong>Responsibilities include, but are not limited to:</strong></p><ul><li>Write client-side code for web-based applications, create fast, easy-to-use, high volume production applications, and develop prototypes quickly.</li><li>Contribute in the design and implementation of UI changes across our product base.</li><li>Develop detailed technical analysis and design specifications based on functional requirements.</li><li>Collaborate heavily with fellow developers, designers and analysts to solve problems.</li><li>Develop complete front-end stack of projects using HTML/CSS/SASS, AngularJS and JavaScript.</li><li>Create and improve existing reusable components.</li><li>Integrate front-end UI with backend services.</li><li>Optimize web applications to maximize speed and scale</li><li>Set and follow coding standards.</li></ul><p><strong>Knowledge and Skills:</strong></p><ul><li>5+ years of experience developing dynamic, highly interactive user interfaces for the web.</li><li>1+ years using AngularJS.</li><li>Must be fluent in front-end technologies including, but not limited to, JavaScript, AJAX, HTML, CSS, SASS, XML, and familiar with one or more JavaScript libraries (jQuery, D3, and Backbone).</li><li>Good understanding of the current state of modern web development.</li><li>Disciplined approach to testing and quality assurance.</li></ul><p><strong>Education and Work Experience:</strong></p><p>This position requires a minimum of a 4-year degree from an accredited college or university in engineering, information technology, computer science, or other related disciplines. Equivalent work experience may be acceptable in lieu of a degree.</p><p><strong>Certificates and Licenses:</strong></p><p>Applicants selected for employment will be subject to a Federal background investigation and must meet additional eligibility requirements for access to classified information or materials.</p><p><strong>Travel:</strong></p><p>Some travel may be required.</p><p><strong>Hours:</strong></p><p>Normal work schedule will be 8:00 A.M. to 5:00 P.M., Monday through Friday.&nbsp; May be required to work additional hours and/or weekends, as needed, to meet deadlines or to fulfill travel obligations.</p><p><strong>Salary Range:</strong></p><p>Commensurate with experience.</p><p>Company offers full-benefits package including health, dental, vision and 401K plans.&nbsp; IDS is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regards to race, creed, age, sex, gender, physical or mental disability, sexual orientation, gender identity, gender expression, ancestry, pregnancy perceived pregnancy, medical condition, marital status, familial status, color, religion, uniformed services, veteran status, national origin, genetic information, or any other characteristic protected under local, state or Federal law.&nbsp; A submission of a resume is an expression of interest and not considered an application.</p><p>For more information, visit <a href=&quot;http://www.get-integrated.com/&quot; rel=&quot;nofollow&quot;>www.get-integrated.com</a>. To apply, please send a resume and cover letter to <a href=&quot;mailto:jobs@get-integrated.com&quot; rel=&quot;nofollow&quot;>jobs@get-integrated.com</a> and reference code: IDS-UD-VL.</p><p><strong>**U.S. citizenship and/or green card is required; H1-B visas and other visas are not being sponsored. Relocation expenses are NOT compensated.&nbsp; All jobs are employer paid; no fees to candidates. Third parties or agencies inquiries are not being accepted.**</strong></p>            </div>        </div>                        </div>",
    "urlFetchPending": false,
    "published": "Apr 29, 2017 1:04:38 PM",
    "tags": [
      "TECH2_ui-design",
      "TECH2_angularjs",
      "TECH2_html",
      "TECH2_javascript",
      "REMOTE1_100",
      "REMOTE2_America",
      "TECH2_sass",
      "TITLE1_integration"
    ]
  },
  {
    "id": "KgsWESJ8T1iqwBiTz0Od_w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/82881/frontend-integration-engineer-clicktripz?a=rNkJBRGZ4Wc",
    "title": "Frontend Integration Engineer at Clicktripz (Manhattan Beach, CA) (allows remote)",
    "content": "<div>        <div>                <div>            <div>                                    <div>                    <div>                        <div>                            <h2><a rel=&quot;nofollow&quot;>Frontend Integration Engineer</a>                            </h2>                        </div><a rel=&quot;nofollow&quot;>Clicktripz</a>                    </div>                </div>                <div>                    <div>                                                        </div>                </div>                <div></div>            </div>        </div>                        </div>        <div>            <h3>                Job Description            </h3>            <div><p>Clicktripz is looking for a talented front-end developer. This is a full-time position and the developer would be able to work remotely while communicating with our office in Manhattan Beach, California.</p><p>The ideal candidate is a motivated self-starter who can work creating flexible solutions that reach the goals and business needs of our customers. This person must be comfortable assuming ownership of projects and be able to adapt to changing requirements.&nbsp;</p><p><strong>Please do not apply if you are not located in the United States</strong></p><p><strong>Responsibilities</strong></p><ul><li>Integrate ClickTripz products onto some of the largest travel websites in the world.</li><li>Maintain on-going partner integrations.</li><li>Spec and implement new JS products for the Clicktripz 3rd party suite.</li><li>Kill 10 Mudbelly boards and bring me their pelts... but don't hurt yourself now!</li><li>Troubleshoot any issues regarding front-end solutions, thinking creatively on how to implement solutions.</li></ul>            </div>        </div>            <h3>                Skills &amp; Requirements            </h3>            <div><ul><li>You have a strong software development fundamentals through your Bachelor's Degree in CS or have a related degree or experience.</li><li>You have experience building production-level websites, and you have a solid understanding of the web stack.</li><li>You have an intimate understanding of how browsers work, and have experience building cross browser functionality.</li><li>You preferably have experience building 3rd party javascript solutions.</li><li>You have great attention to detail, with a meticulous mindset.</li><li>Great communication skills. We are a remote-based company.&nbsp;</li><li>Sample of code or products you have worked on. Github profile is a plus.</li></ul>            </div>            <h3>                About Clicktripz            </h3>            <div><p>Clicktripz believes in an advertising network that’s a win for all parties involved. Publishers can monetize their website using a fully customizable ad-widget and receive the highest revenue share in the industry. Live metric data is freely given and easily accessible through a reporting site. Advertisers have access to metrics and fine grained targeting. This allows them to find and purchase the traffic that works best for them. On top of all this, the Clicktripz team provides support to its customers. This support helps them be their best, and ensures the network works for them. Clicktripz is a growing company that started in 2010 with 3 people, today the team has grown to 45&nbsp;members and is still expanding. The technological back-end runs on a large scale, serving millions of advertisements per day. The growing workload and potential business means Clicktripz needs your help. Clicktripz does all work remotely with a small office in Manhattan Beach, CA. This is a great environment if you communicate well with the team, are self-driven, and manage your own time. The combination of a small development team and the steady addition of new features provides a lot of room to learn and grow.</p>            </div>                        <p><em>                    The <a href=&quot;http://www.joelonsoftware.com/articles/fog0000000043.html&quot; rel=&quot;nofollow&quot;>Joel Test</a> is a twelve-question measure of the quality of a software team.                </em>            </p>                                    </div>",
    "urlFetchPending": false,
    "published": "Apr 29, 2017 1:04:38 PM",
    "tags": [
      "TECH2_css",
      "TECH2_html",
      "TECH2_javascript",
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_integration"
    ]
  },
  {
    "id": "rihQYZBTQ_WiUdVWvdiP4w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/job/Implementation-Engineer-at-Inspired-in-Remote-c3e5ed4bee89c474",
    "title": "Implementation Engineers (Sr. and Staff) - Inspired - Remote",
    "content": "<div><b>Implementation Engineers (Sr. and Staff)</b><br><span>Inspired</span>     -<span>Remote</span>    </div><span><p><b>Position Summary</b></p><p>Enjoy working with the latest technology and leveraging it to solve real world problems? Are you someone he speaks code and business? As an Implementation Engineer on our Professional Services Team, you’ll get to work with brilliant engineers solving complex business problems through leading technology and an advanced open architecture. You will work with our customers to implement our Content Management Platform to solve diverse business problems. As an expert, you will work with the customer team to design and implement the Platform to meet rigorous business and technology goals. Working both at the keyboard coding and shoulder-to-shoulder with customers evaluating and architectural choices, you will help bridge the gap between business and technology.</p><p><b>Primary Responsibilities</b></p><ul><li>Participate in and lead requirements elaboration and architectural design sessions with customers</li></ul><ul><li>Assess business, functional and technical requirements and develop implementation designs using our Content Management Platform</li></ul><ul><li>Develop integrations and add-ons to the platform</li></ul><ul><li>Enhance the platform for customer-specific use cases</li></ul><ul><li>Provide design recommendations for functional and technical requirements using the Platform</li></ul><ul><li>Development of client deliverables (e.g. specifications and test cases)</li></ul><ul><li>Participate in the development and delivery of training for customers</li></ul><ul><li>Relay new product feature requests to product management * Must be able to travel within the US up to 50% of the time</li></ul><p><b>Required Skills</b></p><ul><li>Experience implementing enterprise software projects utilizing Agile delivery techniques</li></ul><ul><li>Dedication to quality code and doing things the “right way&quot;</li></ul><ul><li>Analytical thinker with the ability to translate complex business needs into feasible technical solutions</li></ul><ul><li>Experienced technologist familiar with software implementation best practices and software architectural principles</li></ul><ul><li>Experience with continuous integration frameworks (e.g. Jenkins, Maven)</li></ul><ul><li>Strong knowledge of Java or JavaScript</li></ul><ul><li>Solid experience with Groovy, HTML/XML</li></ul><ul><li>Excellent interpersonal skills</li></ul><ul><li>Strong organizational skills with a proven track record of consistently meeting project deadlines</li></ul><ul><li>Demonstrated history of building effective relationships with a strong customer service focus</li></ul><ul><li>Rigorous attention to detail</li></ul><ul><li>English fluency</li></ul><ul><li>Bachelor Degree from an accredited institution or equivalent certifications and experience is required.</li></ul><ul><li>3-5 years of consulting/professional services experience in a technical delivery role</li></ul><p><b>Preferred Skills</b></p><ul><li>Understanding of the enterprise landscape and business challenges around integrated collaboration services</li></ul><p>Job Type: Full-time</p><p>Required education:</p><ul><li>Bachelor's</li></ul><p>Required experience:</p><ul><li>Agile: 3 years</li><li>Java OR JavaScript: 7 years</li><li>Jenkins or Maven: 4 years</li><li>Client Service: 3 years</li></ul><p>Required language:</p><ul><li>Fluent English/have excellent client-facing comm skills</li></ul><p>Job Type: Full-time</p><p>Required education:</p><ul><li>Bachelor's</li></ul><p>Required experience:</p><ul><li>Jenkins and/or Maven: 2 years</li><li>Client-Facing Consulting: 2 years</li><li>Java and JavaScript: 4 years</li></ul><p>Required language:</p><ul><li>Fluent English/have excellent client-facing comm skills</li></ul></span>",
    "urlFetchPending": false,
    "published": "Apr 25, 2017 3:37:39 AM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_integration"
    ]
  },
  {
    "id": "tLtWY7HTTtq9EXZbSdha1g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/job/Presale-Engineer-Digital-Integration-at-Axway-in-Remote-520f6b688a89cd3d",
    "title": "Presales Engineer Digital Integration - Axway - Remote",
    "content": "<div><b>Presales Engineer Digital Integration</b><br><span>Axway</span>     -<span>Remote</span>    </div><span>Axway is seeking a senior pre-sales solutions engineer to join our North American sales team to assist supporting all elements of the pre-sales process.<br><br>The candidate will work in concert with the sales team responsible for eliciting and analyzing customer requirements and mapping those needs to Axway solution sets. The engineer will take ownership of the technical sales strategy and activities. The role requires strong presentation skills and must be capable of demonstrating the proposed solutions to prospects as well as internally to the presales organization and product group. The engineer will be specifically focusing on Axway’s solutions for B2B and Managed File Transfer as well as leveraging broader capabilities for API Lifecycle Management (FLAM) to create broader value proposition and more differentiating value for prospects.<br><br>This position consists of approximately 50% travel and working with clients throughout North America. The rest of the time individual will work remotely and can be located in any major metropolitan area in North America.<br><br><b>Responsibilities</b><ul><li>Prepares and delivers presentations of the company’s solutions to all levels in the prospects organization. </li><li>Leads discovery workshop sessions to gather customer requirements and critical business challenges. </li><li>Creates solution vision and evangelize how solution addresses technical and business outcomes. </li><li>Develops customer facing assessment reports documenting current state and future state recommendations. </li><li>Manage and coordinate proof of concepts (POC’s). Develop POC plans with agreed use cases. Work with presales support teams to execute on the POC. </li><li>Responsible for delivering technical content for RFP responses. </li><li>Handles technical presentations at trade shows and conferences. </li><li>Stays current on the latest technology and contributes to the technical direction of the company while keeping a customer-centric approach. </li><li>Works with the sales team to define a technical sales strategy for each prospect. </li><li>Ensures proactive communication with customers to ensure customer satisfaction. </li><li>Acts as a mentor and may lead a team of pre-sales consultants on complex opportunities. </li><li>Communicates with sales and product management teams regarding customer initiatives. </li><li>Takes the lead in working with Solution Architects to define the complete customer solution. </li><li>Engages with customer’s senior IT and business managers to understand their requirements. </li><li>Safeguard Axway and Axway customer data through compliance with Axway policies and the appropriate use of Axway equipment and facilities.</li></ul><br><b>Qualifications</b><ul><li>Ability to work in matrixed and multicultural teams. </li><li>Strong organizational and communication skills both written and verbal. </li><li>Highly motivated to learn new technologies and stay current with the product portfolio and industry trends. </li><li>Community influencer. </li><li>Thought leader in the Business Line domain. </li><li>Compelling &amp; comprehensive content producer. </li><li>Adept at mapping customer requirements to a solution approach. </li><li>Broad understanding of B2B integration patterns, EBS’s, mobile, cloud, on premise, and hybrid solutions. </li><li>Experience with EAI (Enterprise Application Integration), ESB (Enterprise Service Bus) and SOA (Service Oriented Architecture). </li><li>Experience with networking protocols and technology: TCP/IP, SMTP, FTP, HTTP, DNS, WAN, LAN, VPN, LDAP, Internet, Intranet, Extranet. </li><li>Vast knowledge around enterprise security, identity management, and best practices minimally including PKI, CA, SSL, S/MIME, AuthN, AuthZ, SSO, SAML, LDAP, OpenID, Multifactor, and OAuth. </li><li>Programming Language experience: PHP, Python, Ruby, NET/C#, C, Java, Perl, JavaScript, PowerShell, Bash, SQL.</li></ul><b>Desired Skills (Nice to have): </b><br><ul><li>Experience in pre-sales or post-sale middleware implementation projects in financial services, healthcare, supply chain, or federal space. </li><li>Presales or delivery experience with other vendor B2B/MFT solutions such as Mulesoft, Tibco, IBM, GXS or Seeburger a plus.</li></ul><b>Required Experience: </b><br><ul><li>Minimally 3-5 years of work experience in similar roles most likely with a software/solutions vendor. </li><li>Experience with solutions deployment and/or presales in one or more of the following disciplines: </li></ul><ul><li>B2B Gateway or ESB implementations using products like Tibco ESB, Seeburger, IBM Gateway’s. </li><li>Application Program Interface (API) Strategy’s using products like Mulesoft, Apigee, and Layer 7 etc.</li></ul><b><em>Axway is an EEO and AA Employer</em></b></span>",
    "urlFetchPending": false,
    "published": "Apr 24, 2017 10:52:11 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_integration"
    ]
  },
  {
    "id": "LNm-BSxtTi-guf6OZomyDQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/56608/data-integration-engineer-at-concirrus/",
    "title": "Data Integration Engineer",
    "content": "Concirrus creates revolutionary software products that are disrupting and transforming the Insurance industry. We are entering an exciting period of growth and are looking to hire a Data Integration Engineer to focus on solutions for our Insurtech customers and products.<br /><br />Our company is growing, grow with us.<br /><br />The Role:  <br />The Data Integration Engineer will be responsible for integrating a wide variety of data mediums, real-time, time-series, transactional, scraped and batch into our content ecosystem and make ready for advanced data mining and analytics.  Using best of breed tools and methods you will process this data efficiently, consistently and securely working in our London office alongside our data science team, customers and content providers.  This is an exciting and rewarding role requiring a smart and expedient approach to data integration and ETL.<br /><br />The Candidate: <br />You will be an experienced software engineer who has developed and implemented advanced data integration solutions in a commercial environment previously.  Having worked in customer-facing roles you will have the proven ability to collaborate, to participate in the development of and confidently execute data integration/transformation solutions. The right candidate will also enjoy taking the initiative and performing to a high standard within a fast paced & cutting edge environment.<br /><br />Key Responsibilities: <br /><br />●      Engage directly with customers and content providers to participate in design and development of data integration/transformation solution according to functional requirements<br />●  Create and implement advanced data integration solutions and environment. <br />●  Clean and transform batch, time-series and real-time data into Lambda architecture. <br />●  Support, monitor, execute production application jobs and processes. <br />●  Perform debugging, troubleshooting, modifications and unit testing of integration solutions <br />●  Participate in the development of documentation, technical procedures and user support guides. <br />    <br />Experience: <br /><br />*3+ years solid commercial experience with system/data integration, development or implementation of enterprise and/or cloud software. <br /><br />*Technically savvy with major implementation technologies including Web services, enterprise data integration and ETL tools. <br /><br />*Experience with relational and nonrelational databases (any vendor).<br /><br />*Software house experience, comfortable taking the initiative and getting a high quality job done within tight (agreed) timeframes <br />    <br />The important skills: <br /><br />            *Languages: Java, Python <br /><br />            *Integration: Apache NiFi, Postman, REST, Spring Boot. <br /><br />            *Stack: Apache Kibana / Elasticsearch, Spark. <br /><br />            *Database: SQL, Cassandra, RedShift, MongoDB, Postgre. <br />    <br />The skills we are also interested in:<br /><br />            *Experience of data integration with RStudio and ML models. <br /><br />            *Insurance Enterprise Systems: Guidewire, SAS, Transactor, PolicyWriter. <br /><br />            *Experience of GIS data. <br /><br />            *Comprehensive automated testing experience, continuous integration. <br />    <br />What we can offer you:<br /><br />As well as the opportunity to work on projects that you enjoy in an environment you’ll love, we like to look after our team members at Concirrus. We offer equity and performance based bonuses, regular lunch and learn meetings where the food is on us, great coffee, annual Concirrus Birthday & social events, season ticket loan scheme etc.  As a company we are always looking for creative ways to look after our employees and actively encourage them to come to us when they have an idea or need.<br /><br />About Concirrus Ltd<br /><br />Concirrus. Intelligent Insurance Solutions for a Connected World.<br /><br />We are Concirrus. Our Insurtech software brings the world’s information to life by making it useful and accessible to insurers.  Every day more and more devices are being connected and managed online (otherwise known as the Internet of Things). This is generating huge amounts of information and represents an enormous opportunity. Yet businesses and people have been unable to utilise this information in any meaningful way and opportunities for progress and efficiency are being lost.<br /><br />At Concirrus, we create a unique software product to help insurance organisations take advantage of this information. By helping them to harmonise their existing data structures with live information from devices in the physical world, we revolutionise the way they think and act.<br /><br />With a new set of DNA at their core, and with a revolutionary approach to information processing, machine intelligence and decision making, we are redefining the boundaries of what insurers can achieve.<br /><br />We hope you can join us.<br /><br />Concirrus Ltd can only accept applications from candidates who have a valid legal permit or right to work in the United Kingdom. Potential candidates who do not have this right or permit, or are pending an application to obtain this right or permit should not apply as your details will not be processed.",
    "urlFetchPending": false,
    "published": "Apr 20, 2017 4:38:40 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_integration"
    ]
  },
  {
    "id": "IWu93On1RhiTXbkgcI2zlg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/jobs/4632-pos-integration-developer",
    "title": "Omnivore.io: POS Integration Developer",
    "content": "<div>  <div>    <h2>POS Integration Developer</h2>      <h4>Posted Apr 21</h4>    <h3>      <span>Omnivore.io</span><br>      <span>Headquarters: San Francisco Bay Area</span><br>        <a href=&quot;http://omnivore.io/&quot; rel=&quot;nofollow&quot;>http://omnivore.io/</a>    </h3>  </div>    </div>  <div>    <div><b>About Omnivore&nbsp;</b></div><div><b><br></b></div><div>Omnivore provides a universal REST API for restaurant point of sale (POS) integration. Data and functionality is normalized across major POS systems into a single interface, allowing developers to integrate once and run everywhere.</div><div><br></div><div><b>Working at Omnivore&nbsp;</b><br></div><div><b><br></b></div><div>Work in a fast-paced, growing, and distributed startup focused on providing the best restaurant development platform in the world. Omnivore's API is the backbone for hundreds of applications solving problems around online ordering, payment, instant gift redemption, deep restaurant analytics, and more. Our world class team provides these apps with the tools, functionality, knowledge, and stability they need go from concept to production, and allow them to deploy with support for many POS back-ends while only integrating once.</div><div><br></div><div>You'll do well here if you:</div><div><br></div><ul><li>Enjoy working with a variety of technologies<br></li><li>Have strong attention to detail<br></li><li>Are passionate about quality (both code and product)<br></li><li>Communicate well in a distributed team environment<br></li><li>Are self-motivated and driven</li></ul><div><br></div><div>We hire for culture, passion, and the ability to learn quickly above specific experience or previous knowledge.</div><div><br></div><div><b>Job Specifics&nbsp;</b></div><div><b><br></b></div><div>Work with our Integration Team to build and maintain integrations with various POS systems. Work with a wide variety of technologies across multiple POS systems on a daily basis. No previous experience with POS systems necessary.</div><div><br></div><div><b>Required</b></div><div><br></div><ul><li>3+ years professional development experience<br></li><li>Comfortable working with multiple programming languages<br></li><li>Strong foundation in Object Oriented design</li></ul><div><br></div><div><b>Recommended (more is better)</b></div><div><br></div><ul><li>Previous success in a remote work environment<br></li><li>Previous full-stack development experience<br></li><li>Experience with Python on Windows<br></li><li>Comfortable with git<br></li><li>Working knowledge of one or more RDBMS (mySQL, SQL Server, etc)<br></li><li>Previous integration experience with one or more POS systems<br></li><li>BS or better in Computer Science<br></li><li>Self-taught individuals with strong work experience are still welcome to apply</li></ul><div><br></div><div><span><b>Benefits</b></span></div><div><br></div><ul><li>Medical<br></li><li>Dental<br></li><li>401k<br></li><li>Stock options<br></li><li>Untracked PTO plan<br></li><li>Coworking subsidy<br></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>US residents apply here: <a href=&quot;http://jobs.omnivore.io/apply/aD7Ovh/Integration-Developer&quot; rel=&quot;nofollow&quot;>http://jobs.omnivore.io/apply/aD7Ovh/Integration-Developer</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 21, 2017 7:01:02 PM",
    "tags": [
      "REMOTE1_50",
      "REMOTE2_America",
      "TITLE1_integration"
    ]
  },
  {
    "id": "Ja_7t7vrTYal-TzZa0x-AA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/129559/iterative-integration-engineer-christian-care-ministry?a=HrU4mZNwvra",
    "title": "Iterative Integration Engineer at Christian Care Ministry (Melbourne, FL) (allows remote)",
    "content": "<div>        <div>                <div>            <div>                <div>                    <div>                        <div>                            <h2><a rel=&quot;nofollow&quot;>Iterative Integration Engineer</a>                            </h2>                        </div><a href=&quot;http://mychristiancare.org&quot; rel=&quot;nofollow&quot;>Christian Care Ministry</a>                    </div>                </div>                <div>                    <div>                                                        </div>                </div>                <div></div>            </div>        </div>                        </div>        <div>            <h3>                Job Description            </h3>            <div><p>Christian Care Ministry is committed to serving the Lord and our membership with excellence. Christian Care Ministry is a community of believers committed to connecting and equipping Christian’s to share their lives, faith, talents and resources with others, much like the early church did in Acts (Acts 2:42-47).<br><br>This position serves on the New Product Engineering Team. That small sub-department of our IT team (under 10 people) is mostly remote.&nbsp; Their main focus has been making some dreams of the leadership team come true [well, at least the problems that can be solved with code ;-) ].&nbsp;<br><br>The ideal candidate either has a college degree in computer science, or if not, 2+ years of recent, solid professional programming experience. Our especially ideal candidate has experience in writing tests, specifically front end test JS libraries like Mocha, Jasmine, Jest, or Cucumber. Extra bounty for experience using Selenium. &nbsp;<br><br>Our stack contains a very healthy Isomorphic JavaScript client utilizing Heroku, NodeJS, ReactJS, and a few others.&nbsp; For our mobile apps we’re using React Native, because, well, basically, it’s awesome (and we really think our philosophies of “API First” and “Learn Once, Code Everywhere” are going to be the norm in the near future).&nbsp; Our backend and API servers use Ruby on Rails, PostgreSQL, Redis and, again, a few others.</p>            </div>        </div>            <h3>                Skills &amp; Requirements            </h3>            <div><p><strong>&nbsp;Essential Duties:</strong></p><ul><li>Write and maintain automated regression tests</li><li>Validate the other, non-automated areas that need testing work as expected</li><li>Regularly complete agreed upon workload in agreed upon timeframe</li><li>Skills we’re looking for:</li><li>Appreciate non-precise requirements, even if that means re-work</li><li>Because of our team dynamics, equally enjoy both working independently or cooperatively</li><li>Transparency with “work in progress” and time tracking</li><li>Enjoy writing self-documenting code</li><li>A very thorough person, who enjoys writing tests</li></ul><p><strong>PERKS:</strong></p><ul><li>Work alongside believers who are passionate about serving one another with the gifts and talents God has given to us.</li><li>Prayer. As an employee of CCM, you’ll have many opportunities to pray with fellow co-workers and members. Prayer is a vital part of the ministry here at CCM (James 5:13-16), and each employee must be comfortable participating in or leading prayer on a regular basis.</li></ul><p><strong>States we employ in:</strong></p><ul><li>Alabama</li><li>Colorado</li><li>Florida</li><li>Georgia</li><li>Illinois</li><li>Indiana</li><li>Kentucky</li><li>Ohio</li><li>Tennessee</li><li>Texas</li><li>Virginia</li><li>Washington</li><li>West Virginia</li></ul>            </div>                        <p><em>                    The <a href=&quot;http://www.joelonsoftware.com/articles/fog0000000043.html&quot; rel=&quot;nofollow&quot;>Joel Test</a> is a twelve-question measure of the quality of a software team.                </em>            </p>                                    </div>",
    "urlFetchPending": false,
    "published": "Apr 29, 2017 1:04:38 PM",
    "tags": [
      "TECH2_reactjs",
      "TECH2_node.js",
      "REMOTE1_50",
      "TECH2_javascript",
      "TECH2_mocha",
      "REMOTE2_America",
      "TITLE1_integration",
      "TECH2_selenium"
    ]
  },
  {
    "id": "jo4xh5EATrSf3rFTYFJs6g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/23158",
    "title": "POS Integration Developer",
    "content": "<div><b>About Omnivore&nbsp;</b></div><div><b><br></b></div><div>Omnivore provides a universal REST API for restaurant point of sale (POS) integration. Data and functionality is normalized across major POS systems into a single interface, allowing developers to integrate once and run everywhere.</div><div><br></div><div><b>Working at Omnivore&nbsp;</b><br></div><div><b><br></b></div><div>Work in a fast-paced, growing, and distributed startup focused on providing the best restaurant development platform in the world. Omnivore's API is the backbone for hundreds of applications solving problems around online ordering, payment, instant gift redemption, deep restaurant analytics, and more. Our world class team provides these apps with the tools, functionality, knowledge, and stability they need go from concept to production, and allow them to deploy with support for many POS back-ends while only integrating once.</div><div><br></div><div>You'll do well here if you:</div><div><br></div><ul><li>Enjoy working with a variety of technologies<br></li><li>Have strong attention to detail<br></li><li>Are passionate about quality (both code and product)<br></li><li>Communicate well in a distributed team environment<br></li><li>Are self-motivated and driven</li></ul><div><br></div><div>We hire for culture, passion, and the ability to learn quickly above specific experience or previous knowledge.</div><div><br></div><div><b>Job Specifics&nbsp;</b></div><div><b><br></b></div><div>Work with our Integration Team to build and maintain integrations with various POS systems. Work with a wide variety of technologies across multiple POS systems on a daily basis. No previous experience with POS systems necessary.</div><div><br></div><div><b>Required</b></div><div><br></div><ul><li>3+ years professional development experience<br></li><li>Comfortable working with multiple programming languages<br></li><li>Strong foundation in Object Oriented design</li></ul><div><br></div><div><b>Recommended (more is better)</b></div><div><br></div><ul><li>Previous success in a remote work environment<br></li><li>Previous full-stack development experience<br></li><li>Experience with Python on Windows<br></li><li>Comfortable with git<br></li><li>Working knowledge of one or more RDBMS (mySQL, SQL Server, etc)<br></li><li>Previous integration experience with one or more POS systems<br></li><li>BS or better in Computer Science<br></li><li>Self-taught individuals with strong work experience are still welcome to apply</li></ul><div><br></div><div><span><b>Benefits</b></span></div><div><br></div><ul><li>Medical<br></li><li>Dental<br></li><li>401k<br></li><li>Stock options<br></li><li>Untracked PTO plan<br></li><li>Coworking subsidy<br></li></ul><p><strong>To apply:</strong> US residents apply here: <a href=&quot;http://jobs.omnivore.io/apply/aD7Ovh/Integration-Developer&quot; rel=&quot;nofollow&quot;>http://jobs.omnivore.io/apply/aD7Ovh/Integration-Developer</a></p>",
    "urlFetchPending": false,
    "published": "Apr 21, 2017 7:01:02 PM",
    "tags": [
      "REMOTE1_50",
      "REMOTE2_America",
      "TITLE1_integration"
    ]
  }
]
}
