{
  "items": [
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/82881/front-end-integration-engineer-clicktripz?a\u003drNkJBRGZ4Wc",
    "title": "Front-End Integration Engineer at Clicktripz (Manhattan Beach, CA) (allows remote)",
    "content": "Clicktripz is looking for a talented front-end developer. This is a full-time \u003cbr /\u003eposition and the developer would be able to work remotely while communicating \u003cbr /\u003ewith our office in Manhattan Beach, California.\u003cbr /\u003e\u003cbr /\u003eThe ideal candidate is a motivated self-starter who can work creating flexible \u003cbr /\u003esolutions that reach the goals and business needs of our customers. This person \u003cbr /\u003emust be comfortable assuming ownership of projects and be able to adapt to \u003cbr /\u003echanging requirements. \u003cbr /\u003e\u003cbr /\u003ePlease do not apply if you are not located in the United States\u003cbr /\u003e\u003cbr /\u003eResponsibilities\u003cbr /\u003e\u003cbr /\u003e * Integrate ClickTripz products onto some of the largest travel websites in \u003cbr /\u003ethe world. \u003cbr /\u003e * Maintain on-going partner integrations. \u003cbr /\u003e * Spec and implement new JS products for the Clicktripz 3rd party suite. \u003cbr /\u003e * Kill 10 Mudbelly boards and bring me their pelts... but don\u0027t hurt yourself \u003cbr /\u003enow! \u003cbr /\u003e * Troubleshoot any issues regarding front-end solutions, thinking creatively \u003cbr /\u003eon how to implement solutions. \u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003e * You have a strong software development fundamentals through your Bachelor\u0027s \u003cbr /\u003eDegree in CS or have a related degree or experience. \u003cbr /\u003e * You have experience building production-level websites, and you have a \u003cbr /\u003esolid understanding of the web stack. \u003cbr /\u003e * You have an intimate understanding of how browsers work, and have \u003cbr /\u003eexperience building cross browser functionality. \u003cbr /\u003e * You preferably have experience building 3rd party javascript solutions. \u003cbr /\u003e * You have great attention to detail, with a meticulous mindset. \u003cbr /\u003e * Great communication skills. We are a remote-based company.  \u003cbr /\u003e * Sample of code or products you have worked on. Github profile is a plus. \u003cbr /\u003e About Clicktripz \u003cbr /\u003e\u003cbr /\u003eClicktripz believes in an advertising network that’s a win for all parties \u003cbr /\u003einvolved. Publishers can monetize their website using a fully customizable \u003cbr /\u003ead-widget and receive the highest revenue share in the industry. Live metric \u003cbr /\u003edata is freely given and easily accessible through a reporting site. \u003cbr /\u003eAdvertisers have access to metrics and fine grained targeting. This allows them \u003cbr /\u003eto find and purchase the traffic that works best for them. On top of all this, \u003cbr /\u003ethe Clicktripz team provides support to its customers. This support helps them \u003cbr /\u003ebe their best, and ensures the network works for them. Clicktripz is a growing \u003cbr /\u003ecompany that started in 2010 with 3 people, today the team has grown to \u003cbr /\u003e45 members and is still expanding. The technological back-end runs on a large \u003cbr /\u003escale, serving millions of advertisements per day. The growing workload and \u003cbr /\u003epotential business means Clicktripz needs your help. Clicktripz does all work \u003cbr /\u003eremotely with a small office in Manhattan Beach, CA. This is a great \u003cbr /\u003eenvironment if you communicate well with the team, are self-driven, and manage \u003cbr /\u003eyour own time. The combination of a small development team and the steady \u003cbr /\u003eaddition of new features provides a lot of room to learn and grow.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 12 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? apply now \u003c\u003e  more jobs at Clicktripz  \u003cbr /\u003e\u003c\u003e \u003cbr /\u003eJoin us at Clicktripz\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eHealth Insurance 401k Unlimited Vacation Policy Your choice of Computer \u003cbr /\u003eEquipment (Laptop + External Monitor) Remote Based Team Company Retreat \u003cbr /\u003eLearn more about Clicktripz \u003c\u003e more jobs at Clicktripz \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/clicktripz?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "REMOTE2/America",
      "TECH2/javascript",
      "TECH2/html",
      "TITLE1/integration",
      "TECH2/css",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/job/Integration-Consultant-at-Kronos-in-Home-Based-4c82b248d2126a62",
    "title": "Integration Consultant - Kronos Incorporated - Home Based",
    "content": "\u003c\u003e Integration Consultant \u003cbr /\u003eKronos Incorporated 63 reviews \u003c\u003e - Home Based \u003cbr /\u003eKronos is the global leader in workforce management solutions that enable \u003cbr /\u003eorganizations to control labor costs, minimize compliance risk, and improve \u003cbr /\u003eworkforce productivity. Tens of thousands of organizations in 100 countries – \u003cbr /\u003eincluding more than half the Fortune 1000® - use Kronos time and attendance, \u003cbr /\u003escheduling, absence management, HR and payroll, hiring, and labor analytics \u003cbr /\u003eapplications. Kronos customers include enterprises large and small across \u003cbr /\u003ediverse industries worldwide including retail, hospitality, healthcare, \u003cbr /\u003emanufacturing, public sector, services, and distribution.\u003cbr /\u003e\u003cbr /\u003e Kronos is a privately held company and was founded in 1977. Headquartered in \u003cbr /\u003eChelmsford, Massachusetts, Kronos employs more than 4,000 people worldwide.\u003cbr /\u003e\u003cbr /\u003e Kronos is proud to be an equal opportunity employer and is committed to \u003cbr /\u003emaintaining a diverse and inclusive work environment. All qualified applicants \u003cbr /\u003ewill receive consideration for employment without regard to race, color, \u003cbr /\u003ereligion, gender, gender identity or expression, sexual orientation, national \u003cbr /\u003eorigin, physical or mental disability, age, or veteran status or any other \u003cbr /\u003ebasis protected by federal, state, or local law.\u003cbr /\u003e\u003cbr /\u003eResponsibilities: \u003cbr /\u003e\u003cbr /\u003e As part of Global Integration Team you will work with implementation teams \u003cbr /\u003eand the integration team to provide support around integration requirements for \u003cbr /\u003eKronos Full Suite.\u003cbr /\u003e\u003cbr /\u003e * Resources will have to be able to communicate clearly and consult with \u003cbr /\u003ecustomers while collectioning and documenting design requirements.\u003cbr /\u003e * Work closely with Project Managers and Integration Consultants, \u003cbr /\u003ecommunicating and understanding goals required to complete required tasks on \u003cbr /\u003etime and budget.\u003cbr /\u003e * Support Customers thru Developement, UAT and Go-Live \u003cbr /\u003e * Design, develop, modify, debug and evaluate tools developed to aid the \u003cbr /\u003eProfessional Service Teams\u003cbr /\u003e * Support development with tools and applications in other parts the \u003cbr /\u003eprofessional services organization .\u003cbr /\u003e * Exposure to some fairly complex technology environments requiring a \u003cbr /\u003emulti-product solution, as well as product integration, solutions.\u003cbr /\u003e * Must be comfortable linking database values to our integration module \u003cbr /\u003e * Must be comfortable working customers in both a on-premise and cloud based \u003cbr /\u003eenvironments\u003cbr /\u003eQualifications: \u003cbr /\u003e\u003cbr /\u003e To perform this job successfully, an individual must be able to perform each \u003cbr /\u003eessential duty satisfactorily. The requirements listed below are representative \u003cbr /\u003eof the knowledge, skills and/or ability required.\u003cbr /\u003e\u003cbr /\u003e * 3 to 5 years\u0027 experience in a development environment \u003cbr /\u003e * Experience utilizing PC application software (MS Office) \u003cbr /\u003e * Be self-sufficient/motivated but be able to work as part of a team \u003cbr /\u003e * Ability to translate requirements into working solutions \u003cbr /\u003e * Demonstrated communication skills – written and verbal (internal and \u003cbr /\u003eexternal facing)\u003cbr /\u003e * Bachelor\u0027s degree or equivalent in Computer Science or related field \u003cbr /\u003erequired\u003cbr /\u003e * Travel up to 50% \u003cbr /\u003e * Office enviroment, Team focused to foster collaboration between team members\u003cbr /\u003e Additional knowledge preferred but not required: \u003cbr /\u003e\u003cbr /\u003e * SQL and/or Oracle Databases \u003cbr /\u003e * Development languages (.NET, JAVA, VB, C++, C#, PHP) \u003cbr /\u003e * Development tools (for example source control, defect tracking tools, etc.) \u003cbr /\u003e * Dell Boomi \u003cbr /\u003e * Web Services Development \u003cbr /\u003e * Kronos Connect or WIM \u003cbr /\u003e #LI-PM1\u003cbr /\u003e4 days ago",
    "urlFetchPending": false,
    "published": "Feb 3, 2017 11:00:21 PM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/integration",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/53814/merchant-integration-specialist-at-checkoutcom/",
    "title": "Merchant Integration Specialist",
    "content": "\u003cbr /\u003eAbout us\u003cbr /\u003eFounded in 2010, Checkout.com is an international FinTech company providing end to end e-commerce solutions for payments on the Internet. Built on 100% proprietary technology Checkout.com’s online platform offers all credit and debit cards as well as alternative and local payment methods through a single integration. With clients such as Deliveroo, Virgin, Adidas and many more, Checkout.com’s 120+ talented team members serve a list of true tier one global retailers and leading mobile applications from its London, Dubai, Singapore and Mauritius offices.\u003cbr /\u003e\u003cbr /\u003eAt Checkout.com we strive to create a unique working environment where each of our employees are empowered to take their responsibilities, solve complex puzzles and deliver value accretive solutions for the Company. We believe an individual maximum yield can only be achieved through a dynamic corporate culture that focuses on personal growth and exciting career development paths. \u003cbr /\u003e\u003cbr /\u003eThis experience is offered in a fast paced and innovation-focused office space ideally located in the heart of London. \u003cbr /\u003e\u003cbr /\u003eSummary\u003cbr /\u003eCheckout.com is actively looking for a dynamic \u0026 motivated Merchant Integration Specialist responsible for providing our merchants and business partners with a world class first and second line support.\u003cbr /\u003e\u003cbr /\u003eThe Integration Support Specialist will play a critical role in maintaining the trust of our customers, ensuring that any technical queries that arise during the integration process are answered and escalated when required. Working directly with our customers’ technical teams to resolve issues, a successful candidate will also collaborate closely with various internal stakeholders across Technology and Business to contribute towards consolidating Checkout.com’s position as a leading online payment solutions provider in the region.\u003cbr /\u003e\u003cbr /\u003eThe ideal candidate must be customer-driven with strong critical thinking, problem solving abilities and eager to join a dynamic, agile and fast growing environment.\u003cbr /\u003e\u003cbr /\u003eKey Responsibilities          \u003cbr /\u003e- Provide first and second line support to merchants during their implementation of Checkout payment processing technology\u003cbr /\u003e- Answer all merchants’ integration related questions, including but not limited to configuration, debugging, documentation, testing, and go live support\u003cbr /\u003e- Manage incidents as related to the integration (investigation, troubleshooting, escalation, resolution, reporting, time tracking and analysis of incidents)\u003cbr /\u003e- Partner internally with Business Support, Sales, Software and Web\u003cbr /\u003e- Development to resolve issues that arise during customer trials, integrations, or post implementation support\u003cbr /\u003e- Advise Management on support issues which impact customer satisfaction and provide recommendations for appropriate actions\u003cbr /\u003e- Maintain/update existing libraries/plugins used in integrations\u003cbr /\u003e\u003cbr /\u003eSkills \u0026 Experience\u003cbr /\u003e- 2-4 years’ experience in FinTech preferred\u003cbr /\u003e- Understanding of PHP, JavaScript and .NET appreciated\u003cbr /\u003e- Knowledge of WAMP/LAMP stacks\u003cbr /\u003e- Experience with Git\u003cbr /\u003e- Familiarity of Android and iOS is a plus\u003cbr /\u003e- Excellent communication skills, able to build and maintain strong relationships\u003cbr /\u003e- Ability to work in a customer focused and target driven environment\u003cbr /\u003e- BSc in IT or related fields\u003cbr /\u003e- Fluency in English\u003cbr /\u003e\u003cbr /\u003e",
    "urlFetchPending": false,
    "published": "Jan 30, 2017 4:26:23 PM",
    "tags": [
      "REMOTE2/America",
      "TITLE1/integration",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/82881/frontend-integration-engineer-clicktripz?a\u003drNkJBRGZ4Wc",
    "title": "Frontend Integration Engineer at Clicktripz (Manhattan Beach, CA) (allows remote)",
    "content": "Clicktripz is looking for a talented front-end developer. This is a full-time \u003cbr /\u003eposition and the developer would be able to work remotely while communicating \u003cbr /\u003ewith our office in Manhattan Beach, California.\u003cbr /\u003e\u003cbr /\u003eThe ideal candidate is a motivated self-starter who can work creating flexible \u003cbr /\u003esolutions that reach the goals and business needs of our customers. This person \u003cbr /\u003emust be comfortable assuming ownership of projects and be able to adapt to \u003cbr /\u003echanging requirements. \u003cbr /\u003e\u003cbr /\u003ePlease do not apply if you are not located in the United States\u003cbr /\u003e\u003cbr /\u003eResponsibilities\u003cbr /\u003e\u003cbr /\u003e * Integrate ClickTripz products onto some of the largest travel websites in \u003cbr /\u003ethe world. \u003cbr /\u003e * Maintain on-going partner integrations. \u003cbr /\u003e * Spec and implement new JS products for the Clicktripz 3rd party suite. \u003cbr /\u003e * Kill 10 Mudbelly boards and bring me their pelts... but don\u0027t hurt yourself \u003cbr /\u003enow! \u003cbr /\u003e * Troubleshoot any issues regarding front-end solutions, thinking creatively \u003cbr /\u003eon how to implement solutions. \u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003e * You have a strong software development fundamentals through your Bachelor\u0027s \u003cbr /\u003eDegree in CS or have a related degree or experience. \u003cbr /\u003e * You have experience building production-level websites, and you have a \u003cbr /\u003esolid understanding of the web stack. \u003cbr /\u003e * You have an intimate understanding of how browsers work, and have \u003cbr /\u003eexperience building cross browser functionality. \u003cbr /\u003e * You preferably have experience building 3rd party javascript solutions. \u003cbr /\u003e * You have great attention to detail, with a meticulous mindset. \u003cbr /\u003e * Great communication skills. We are a remote-based company.  \u003cbr /\u003e * Sample of code or products you have worked on. Github profile is a plus. \u003cbr /\u003e About Clicktripz \u003cbr /\u003e\u003cbr /\u003eClicktripz believes in an advertising network that’s a win for all parties \u003cbr /\u003einvolved. Publishers can monetize their website using a fully customizable \u003cbr /\u003ead-widget and receive the highest revenue share in the industry. Live metric \u003cbr /\u003edata is freely given and easily accessible through a reporting site. \u003cbr /\u003eAdvertisers have access to metrics and fine grained targeting. This allows them \u003cbr /\u003eto find and purchase the traffic that works best for them. On top of all this, \u003cbr /\u003ethe Clicktripz team provides support to its customers. This support helps them \u003cbr /\u003ebe their best, and ensures the network works for them. Clicktripz is a growing \u003cbr /\u003ecompany that started in 2010 with 3 people, today the team has grown to \u003cbr /\u003e45 members and is still expanding. The technological back-end runs on a large \u003cbr /\u003escale, serving millions of advertisements per day. The growing workload and \u003cbr /\u003epotential business means Clicktripz needs your help. Clicktripz does all work \u003cbr /\u003eremotely with a small office in Manhattan Beach, CA. This is a great \u003cbr /\u003eenvironment if you communicate well with the team, are self-driven, and manage \u003cbr /\u003eyour own time. The combination of a small development team and the steady \u003cbr /\u003eaddition of new features provides a lot of room to learn and grow.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 12 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? apply now \u003c\u003e  more jobs at Clicktripz  \u003cbr /\u003e\u003c\u003e \u003cbr /\u003eJoin us at Clicktripz\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eHealth Insurance 401k Unlimited Vacation Policy Your choice of Computer \u003cbr /\u003eEquipment (Laptop + External Monitor) Remote Based Team Company Retreat \u003cbr /\u003eLearn more about Clicktripz \u003c\u003e more jobs at Clicktripz \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/clicktripz?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 9, 2017 12:23:03 AM",
    "tags": [
      "REMOTE2/America",
      "TECH2/javascript",
      "TECH2/html",
      "TITLE1/integration",
      "TECH2/css",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/129362/build-release-engineer-open-robotics?a\u003dHnO6ABKTSDK",
    "title": "Build/Release Engineer at Open Robotics (Mountain View, CA) (allows remote)",
    "content": "Develop, extend, and support an extensive and complex build farm that \u003cbr /\u003econtinually handles thousands of build and test jobs on many architectures and \u003cbr /\u003eoperating systems. This position would involve close collaboration with \u003cbr /\u003esoftware and build engineers at OSRF and elsewhere to streamline the \u003cbr /\u003ebuild/release process and solve issues as they arise. Join the build/release \u003cbr /\u003eteam as we expand to bring the flexibility and power of open-source software to \u003cbr /\u003eas many computing platforms as possible, while also providing a convenient \u003cbr /\u003eend-user binary installation experience.\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eROLES AND RESPONSIBILITIES\u003cbr /\u003e\u003cbr /\u003e * Develop and support build/release automation on a large-scale build farm \u003cbr /\u003e * Manage buildfarm machines, both physical and cloud-based \u003cbr /\u003e * Develop and support continuous-integration processes on a variety of \u003cbr /\u003ehardware and software architectures \u003cbr /\u003eSKILLS / JOB REQUIREMENTS\u003cbr /\u003e\u003cbr /\u003e * Patience and empathy for both upstream software developers and downstream \u003cbr /\u003eusers, and the ability to effectively communicate this through electronic means \u003cbr /\u003e(email, tickets, etc.) \u003cbr /\u003e * Degree(s) in Computer Science or a related field, or equivalent industry \u003cbr /\u003eexperience \u003cbr /\u003e * Expert level skills in Ruby, Python, bash, CMake, and other scripting \u003cbr /\u003elanguages \u003cbr /\u003e * Extensive knowledge and experience with git, Mercurial, and other source \u003cbr /\u003ecode management tools \u003cbr /\u003e * Extensive knowledge and experience with Docker and Jenkins (or similar \u003cbr /\u003etools) \u003cbr /\u003e * Expert-level deployment experience on at least one platform \u003cbr /\u003e * Experience in test tools (automated tests, coverage, statistics) for C++, \u003cbr /\u003ePython, and/or Ruby \u003cbr /\u003eNICE TO HAVE\u0027S\u003cbr /\u003e\u003cbr /\u003e * Experience building and distributing large collections of open-source \u003cbr /\u003esoftware \u003cbr /\u003e * Experience in QA \u003cbr /\u003e * Cross-platform deployment experience on Linux, Mac OS X, and Windows \u003cbr /\u003e * System-administration experience \u003cbr /\u003e * Configuration management using puppet, chef, and similar tools \u003cbr /\u003e * Experience as a Linux maintainer \u003cbr /\u003eAPPLICATION MATERIAL\u003cbr /\u003e\u003cbr /\u003e * Cover letter, in which you introduce yourself and explain your interest in \u003cbr /\u003ejoining our team \u003cbr /\u003e * Resume / CV \u003cbr /\u003e * Link(s) to sample(s) of your work, ideally in a publicly-viewable location \u003cbr /\u003e * Two references and/or two letters of recommendation \u003cbr /\u003e About Open Robotics \u003cbr /\u003e\u003cbr /\u003eOpen Source Robotics is a subsidiary of the Open Source Robotics Foundation \u003cbr /\u003e\u003chttp://osrfoundation.org/\u003e located in Mountain View, California. We work with \u003cbr /\u003eindustry to support the development, distribution, and adoption of open source \u003cbr /\u003esoftware for use in robotics research, education, and product development.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 9 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? apply now \u003c\u003e  more jobs at Open \u003cbr /\u003eRobotics \u003c\u003e \u003cbr /\u003eJoin us at Open Robotics\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003e3-weeks vacation Paid maternity and paternity leave Health, dental, and vision \u003cbr /\u003e401k with matched contributions Flexible work schedule Personal laptop \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eNate Koenig \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Brian Gerkey \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Tully Foote \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Karsten K \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Carlos Agüero \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Steven Peters \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Ian Chen \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Learn more about Open Robotics \u003c\u003e more jobs at Open Robotics \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/open-robotics?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "REMOTE2/America",
      "TECH2/ruby",
      "TECH2/jenkins",
      "REMOTE1/50",
      "TECH2/chef",
      "TITLE1/integration",
      "TECH2/python",
      "TECH2/puppet"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/126312/automation-dev-cloud-exp-needed-asap-intergraph-uk-ltd-hostsure?a\u003dGmoaJVZ3hkc",
    "title": "Automation Dev (Cloud exp) needed asap at Intergraph UK Ltd - Hostsure (Dublin, Ireland) (allows remote)",
    "content": "The Automation Developer is an integral member of the SmartPlant Cloud \u003cbr /\u003eAutomation team and key to ensuring on time and quality project delivery. \u003cbr /\u003eSupporting the other team members and management, the individual will work on a \u003cbr /\u003evariety of projects including setup, configuration and testing of automation \u003cbr /\u003eframework components, PowerShell module scripting, Workflow analysis and \u003cbr /\u003edesign, Workflow Scripting as well as assisting in Research and Development \u003cbr /\u003eefforts during Proof of Concept phases designed to enhance the Automation \u003cbr /\u003eframework. Additionally, the Developer will help coach non-developer team \u003cbr /\u003emembers to improve their PowerShell Coding and module creation where possible \u003cbr /\u003ewith a focus on code quality and adherence to team standards.\u003cbr /\u003e\u003cbr /\u003eIt is expected that the role will be developed to the individual’s strength’s \u003cbr /\u003eand become more specialised over time, particularly where a natural aptitude or \u003cbr /\u003edesire is shown towards a specific area or application.\u003cbr /\u003e\u003cbr /\u003eResponsibilities:\u003cbr /\u003e\u003cbr /\u003e * Develop required PowerShell Modules and Azure Automation Runbooks in \u003cbr /\u003eaccordance with best practices. \u003cbr /\u003e * Produce documentation supporting the development lifecycle. \u003cbr /\u003e * Contribute to the automation framework and methodology development. \u003cbr /\u003e * Support and learn from automation engineers and developers in a variety of \u003cbr /\u003eautomation workflows. \u003cbr /\u003e * Coach non-developer team members in development methodologies and best \u003cbr /\u003epractices. \u003cbr /\u003e * Attend regular project, team and customer meetings where required. \u003cbr /\u003e * Liaise with Microsoft Azure Teams when required to help deploy new features \u003cbr /\u003eand enhancements released on the Azure Automation platform. \u003cbr /\u003e * Participate in R\u0026D efforts to improve methods, toolsets and processes used \u003cbr /\u003eby the automation team. \u003cbr /\u003e * Support Automation Workflows and code throughout its lifecycle from \u003cbr /\u003eDevelopment to Test/Integration and then into the Production environment. \u003cbr /\u003eIntergraph Process, Power \u0026 Marine (PP\u0026M) offers challenging work and a global \u003cbr /\u003eteam environment where your opinion counts. We also offer a competitive \u003cbr /\u003ecompensation and benefits package including opportunities for professional \u003cbr /\u003edevelopment and learning. To learn more about our company visit\u003cbr /\u003ehttp://www.intergraph.com \u003chttp://www.intergraph.com\u003e. To view all of our EMIA \u003cbr /\u003eregion employment opportunities or to apply for this job visit\u003cbr /\u003ehttp://www.intergraph.com/careers/emia/default.aspx \u003cbr /\u003e\u003chttp://www.intergraph.com/careers/emia/default.aspx\u003e\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eQualifications:\u003cbr /\u003e\u003cbr /\u003eEducated to degree level or equivalent you will have:\u003cbr /\u003e\u003cbr /\u003e * Previous experience in a DevOps or Automation Development role. \u003cbr /\u003e * Ability to develop in a variety of scripting languages \u003cbr /\u003e * Knowledge of automation and configuration management technologies (e.g. \u003cbr /\u003eAzure Automation, DSC, Chef, Puppet) \u003cbr /\u003e * Knowledge of application packaging technologies (e.g. Chocolatey, NuGet) \u003cbr /\u003e * Knowledge of Hybrid and Public Cloud infrastructure and technologies. \u003cbr /\u003e * Knowledge of Smartplant Applications \u003cbr /\u003e * Customer focused with desire for excellent service delivery \u003cbr /\u003e * Ability to self-manage and motivate and deliver projects to agreed deadlines\u003cbr /\u003e * Flexible working hours. \u003cbr /\u003e * Ability to analyse data and make decisions based upon findings. \u003cbr /\u003e * Ability to report accurately and succinctly \u003cbr /\u003e * An eye for detail and accuracy \u003cbr /\u003e * Ability to fit in to a team yet also work alone with minimum supervision. \u003cbr /\u003e * Positive outlook and attitude \u003cbr /\u003e About Intergraph UK Ltd - Hostsure \u003cbr /\u003e\u003cbr /\u003eIntergraph Process, Power \u0026 Marine (PP\u0026M) is the world’s leading provider of \u003cbr /\u003eenterprise engineering software enabling smarter design and operation of \u003cbr /\u003eplants, ships and offshore facilities.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eIntergraph is part of Hexagon (Nasdaq Stockholm: HEXA B; hexagon.com), a \u003cbr /\u003eleading global provider of information technologies that drive productivity and \u003cbr /\u003equality across industrial and geospatial applications.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 9 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? apply now \u003c\u003e  more jobs at Intergraph \u003cbr /\u003eUK \u003c\u003e \u003cbr /\u003eJoin us at Intergraph UK Ltd\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003estanding desks healthcare for employee and family incentive plans pension life \u003cbr /\u003eassurance reward programme \u003cbr /\u003eLearn more about Intergraph UK \u003c\u003e more jobs at Intergraph UK \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/intergraph-uk-ltd?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:35:44 PM",
    "tags": [
      "TECH2/azure",
      "REMOTE2/America",
      "REMOTE1/50",
      "TECH2/cloud",
      "TECH2/dsc",
      "TITLE1/integration",
      "TECH2/.net",
      "TECH2/powershell"
    ]
  }
]
}
