{
  "items": [
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/132588/engineering-manager-toptal?a\u003dIsSVJEgwww0",
    "title": "Engineering Manager at Toptal () (allows remote)",
    "content": "As an Engineering Manager at Toptal you will work with engineers, designers, \u003cbr /\u003eproduct managers, our VP of Engineering, and CTO to deliver the highest quality \u003cbr /\u003eproducts into the market.\u003cbr /\u003e\u003cbr /\u003eThis is a remote position that can be done from anywhere; however, we do \u003cbr /\u003ethings likerent out hotels in Africa or mansions in Thailand \u003cbr /\u003e\u003chttps://www.toptal.com/remote/the-ultimate-remote-culture\u003e, and you will \u003cbr /\u003ecertainly be invited to come work with us.\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eResponsibilities:\u003cbr /\u003e\u003cbr /\u003e * Lead and work across multiple engineering teams to improve workflow and \u003cbr /\u003edelivery. \u003cbr /\u003e * Drive engineering excellence and ensure teams are delivering high-value \u003cbr /\u003eresults. \u003cbr /\u003e * Anticipate, plan, and effectively work to resolve future challenges. \u003cbr /\u003e * Help guide and direct the technical and product strategy. \u003cbr /\u003e * Drive consensus and results across teams. \u003cbr /\u003e * Grow, develop, and manage the teams. \u003cbr /\u003e * Oversee the implementation of engineering best practices. \u003cbr /\u003e * Identify and eliminate distractions to the teams. \u003cbr /\u003e * Create and provide regular feedback loops. \u003cbr /\u003e * Provide thought leadership, strategic insight, and clear communication \u003cbr /\u003e(written and verbal) to team members. \u003cbr /\u003e * Be in constant communication with team members via Slack, Skype and other \u003cbr /\u003ecommunication channels. \u003cbr /\u003eRequirements:\u003cbr /\u003e\u003cbr /\u003e * Previous experience managing multiple engineering teams. \u003cbr /\u003e * Web development of large scale applications. \u003cbr /\u003e * Track record of delivering successful products as an engineer and a team \u003cbr /\u003elead. \u003cbr /\u003e * Experience guiding continuous improvement of process and technology. \u003cbr /\u003e * Take smart risks and champion new ideas. \u003cbr /\u003e * You must have excellent written and oral communication skills. \u003cbr /\u003e * You must be a world-class individual contributor to thrive at Toptal. You \u003cbr /\u003ewill not be here just to tell other people what to do. \u003cbr /\u003e About Toptal \u003cbr /\u003e\u003cbr /\u003eToptal is one of the most innovative and rapidly expanding tech start-ups from \u003cbr /\u003eSilicon Valley. With backing from investors such as Andreessen Horowitz and \u003cbr /\u003eAdam D’Angelo, our platform is the fastest growing labor marketplace in the \u003cbr /\u003ehistory of the Internet—connecting thousands of elite engineers all over the \u003cbr /\u003eworld. In the last five years, Toptal has become the #1 choice for tech \u003cbr /\u003ecompanies requiring top-tier engineering talent and for thetop 3% \u003cbr /\u003e\u003chttps://www.toptal.com/top-3-percent\u003e of freelancers looking for their next \u003cbr /\u003echallenge.\u003cbr /\u003e\u003cbr /\u003eWhile we’re primarily focused on bringing quality and value to our clients, \u003cbr /\u003ewe’re also committed to creating aworld-class environment \u003cbr /\u003e\u003chttps://www.toptal.com/careers\u003e for our employees. We are a completely \u003cbr /\u003edistributed company with thousands of core and network team members locatedall \u003cbr /\u003eover the world \u003chttps://www.toptal.com/careers#remote-team\u003e, and we take the \u003cbr /\u003ebest elements of virtual teams and combine them with a support structure that \u003cbr /\u003eencourages innovation, social interaction, and fun. We take an \u003cbr /\u003eall-hands-on-deck approach to our work, taking pride in being collaborative, \u003cbr /\u003ecreative, and flexible.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 12 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? External URL  apply now  \u003cbr /\u003e\u003chttps://www.toptal.com/careers/engineering-manager\u003e  more jobs at Toptal  \u003c\u003e \u003cbr /\u003eJoin us at Toptal\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eRemote Competitive Compensation Unlimited Vacation Days No Mandatory Hours \u003cbr /\u003eMentorship Travel Any Time, Anywhere No Office Politics New Laptop \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eSergey Kuznetsov \u003cbr /\u003eruby scala ruby-on-rails postgresql \u003cbr /\u003eview profile \u003c\u003e Artem Pyanykh \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Błażej \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Bozhidar Batsov \u003cbr /\u003ejava scala clojure common-lisp \u003cbr /\u003eview profile \u003c\u003e Alvaro Augusto Montenegro de Oliveira \u003cbr /\u003ejavascript web node.js reactjs \u003cbr /\u003eview profile \u003c\u003e Damir Zekic \u003cbr /\u003eruby javascript c# rdbms \u003cbr /\u003eview profile \u003c\u003e Marko Dumić \u003cbr /\u003ejavascript jquery extjs linux \u003cbr /\u003eview profile \u003c\u003e Learn more about Toptal \u003c\u003e more jobs at Toptal \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/toptal?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2/communication",
      "TITLE1/manager",
      "REMOTE2/America",
      "TECH2/ruby-on-rails",
      "TECH2/javascript",
      "TECH2/slack",
      "TECH2/python",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/133261/director-of-security-wikimedia-foundation?a\u003dIGSx9Qx2oGQ",
    "title": "Director of Security at Wikimedia Foundation (San Francisco, CA) (allows remote)",
    "content": "Summary\u003cbr /\u003e\u003cbr /\u003eThe Wikimedia Foundation is looking for a Director of Security to ensure that \u003cbr /\u003erapid evolution of the Wikimedia software continues to preserve the security of \u003cbr /\u003ethe sites and the privacy of our users. We are looking for someone who is \u003cbr /\u003epassionate about Wikimedia\u0027s mission to bring free knowledge to every person on \u003cbr /\u003ethe planet, and who will strive to help Wikimedia software developers learn to \u003cbr /\u003eincorporate secure thinking into their development practice.\u003cbr /\u003e\u003cbr /\u003eThe Director of Security will join the other Engineering Directors at \u003cbr /\u003eWikimedia who support engineers and designers building features, products, and \u003cbr /\u003eservices used by hundreds of millions of people around the world. This is an \u003cbr /\u003eopportunity to do good while improving the security, stability, scalability, \u003cbr /\u003eand maintainability of one of the best known sites in the world.\u003cbr /\u003e\u003cbr /\u003eYOU ARE ... a smart, experienced security professional that understands all \u003cbr /\u003easpects of security in a top web property. You have significant software \u003cbr /\u003esecurity experience in large scale systems. You understand and enjoy running \u003cbr /\u003esecurity operations. You know how to create and operate incident response \u003cbr /\u003esystems. You have experience counseling engineering and non-engineering teams \u003cbr /\u003eabout the privacy and security implications of their projects and data \u003cbr /\u003ereleases, are familiar with the benefits and vulnerabilities of different \u003cbr /\u003eanonymization techniques, and can swiftly and effectively manage security \u003cbr /\u003eincidents. You understand the importance of testing and documentation, and \u003cbr /\u003ecommon pitfalls in developing secure web applications. You know how to build \u003cbr /\u003esoftware correctly and hold others to the same high standards. You understand \u003cbr /\u003ethe principles of open source software development and the importance of \u003cbr /\u003ecommunity building. You have experience with and enjoy building and mentoring \u003cbr /\u003esecurity teams. You enjoy being part of a large, vibrant, passionate and \u003cbr /\u003einvolved community.\u003cbr /\u003e\u003cbr /\u003eYou will be leading a team responsible for ensuring the security and integrity \u003cbr /\u003eof applications written in PHP, Python, JavaScript (Node.js) among others, \u003cbr /\u003eusing both relational and key-value data storage mechanisms.\u003cbr /\u003e\u003cbr /\u003eAs a Director of Security, we’d like you to do these things:\u003cbr /\u003e\u003cbr /\u003e * Develop a threat model for the Wikimedia Foundation and all our projects \u003cbr /\u003eand define the right security profile in collaboration with your peer group and \u003cbr /\u003eour IT department. \u003cbr /\u003e * Run day-to-day security operations for the Wikimedia Foundation, including \u003cbr /\u003eour community-facing and enterprise systems. \u003cbr /\u003e * Design incident response policies and execute incident response processes. \u003cbr /\u003e * Design and deploy account and content abuse detection mechanisms. \u003cbr /\u003e * Refine and improve access controls and audits. \u003cbr /\u003e * Lead security and privacy incident handling and response. \u003cbr /\u003e * Manage external security audits and pen tests and implement mitigation \u003cbr /\u003estrategies to address discovered vulnerabilities. \u003cbr /\u003e * Serve as a subject matter expert on application security, communicating its \u003cbr /\u003eimpact on security, risk, and compliance decisions. \u003cbr /\u003e * Manage a team of up to six members, leading performance reviews, hiring, \u003cbr /\u003egoal-setting, compensation planning, and career development. \u003cbr /\u003e * Design and develop security-centric enhancements of Wikimedia systems. \u003cbr /\u003e * Conduct security reviews of software designs and implementations. \u003cbr /\u003e * Deploy security patches to Wikimedia websites. \u003cbr /\u003e * Prepare periodic security releases of MediaWiki software. \u003cbr /\u003e * Define and manage department budget. \u003cbr /\u003e * Work with peer groups such as Legal, Office IT, Finance, Advancement and \u003cbr /\u003eothers  in the Foundation to define: \u003cbr /\u003e * Strategies for addressing security and privacy concerns; \u003cbr /\u003e * Initiatives to maintain security as related to software design, \u003cbr /\u003edevelopment, documentation, and release; and \u003cbr /\u003e * Practices to ensure the privacy, security, and integrity of data throughout \u003cbr /\u003ethe collection, access, analysis, release, and retention processes. \u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eWe’d like you to have these skills:\u003cbr /\u003e\u003cbr /\u003e * CISPP certification is highly desirable \u003cbr /\u003e * Bachelor’s degree and 12 yrs of related experience; or 8 yrs and a Master’s \u003cbr /\u003edegree; or equivalent experience \u003cbr /\u003e * 5+ years of leadership experience in the Internet industry \u003cbr /\u003e * 5+ years of experience building web applications \u003cbr /\u003e * 3+ years of experience managing a software or security engineering team \u003cbr /\u003ewith a minimum of 5 direct reports \u003cbr /\u003e * Expert knowledge of common web application vulnerabilities (OWASP Top 10 / \u003cbr /\u003eCWE Top 25) \u003cbr /\u003e * Experience with threat modeling and risk assessment \u003cbr /\u003e * Good understanding of privacy technologies, such as anonymization \u003cbr /\u003e * Experience integrating secure development life cycle processes \u003cbr /\u003e * Extensive experience building and maintaining large-scale server \u003cbr /\u003eapplications \u003cbr /\u003e * Proven record of finding and fixing software vulnerabilities \u003cbr /\u003e * Expert knowledge developing and debugging in Linux (LAMP) environments \u003cbr /\u003e * Excellent knowledge of PHP \u003cbr /\u003e * Experience with Linux system administration and automation using shell \u003cbr /\u003escripting (bash, ZSH, etc.) \u003cbr /\u003e * Excellent verbal and written communication skills \u003cbr /\u003eAnd it would be even more awesome if you have this:\u003cbr /\u003e\u003cbr /\u003e * Experience working on a large, mature open source project \u003cbr /\u003e * Experience as a contributor in the Wikipedia or Wikimedia project \u003cbr /\u003ecommunities \u003cbr /\u003e * Experience with traditional information security concepts, including host- \u003cbr /\u003eand network-based intrusion detection/prevention, host- and network-based \u003cbr /\u003efirewalls, and application segmentation \u003cbr /\u003e * Experience with mobile application security for iOS and Android platforms \u003cbr /\u003e * Experience with PCI DSS audit and compliance more generally \u003cbr /\u003e * Experience managing an external security audit \u003cbr /\u003e * Experience with static analysis tools such as Veracode, pfff, PHP-sat and \u003cbr /\u003ePHP_CodeSniffer \u003cbr /\u003e * Experience with C/C++ debugging using open source tools like gdb and \u003cbr /\u003eValgrind a major plus \u003cbr /\u003e * Experience with operating system internals, filesystems, programming \u003cbr /\u003elanguage design, compilers, distributed systems, or server architectures \u003cbr /\u003ePlease provide URLs to any existing free software work you may have done (your \u003cbr /\u003eown software or patches to other packages) if possible – we\u0027d love to see what \u003cbr /\u003eyou can do!\u003cbr /\u003e\u003cbr /\u003e About Wikimedia Foundation \u003cbr /\u003e\u003cbr /\u003eAbout the Wikimedia Foundation\u003cbr /\u003e\u003cbr /\u003eThe Wikimedia Foundation is the non-profit organization that operates \u003cbr /\u003eWikipedia, the free encyclopedia. Wikimedia projects receive more than 500 \u003cbr /\u003emillion page views per day [1] and reach more than 700 million unique devices \u003cbr /\u003emonthly. Wikipedia, the largest project the Wikimedia foundation hosts, \u003cbr /\u003econtains more than 40 million articles [3] in 238 languages [4] contributed by \u003cbr /\u003emore than 70,000 Active Wikipedians [5].\u003cbr /\u003e\u003cbr /\u003e[1] \u003cbr /\u003ehttps://analytics.wikimedia.org/dashboards/vital-signs/#projects\u003dall/metrics\u003dPageviews\u003cbr /\u003e \u003cbr /\u003e\u003chttps://analytics.wikimedia.org/dashboards/vital-signs/#projects\u003dall/metrics\u003dPageviews\u003e\u003cbr /\u003e\u003cbr /\u003e[2] https://analytics.wikimedia.org/dashboards/vital-signs/… \u003cbr /\u003e\u003chttps://analytics.wikimedia.org/dashboards/vital-signs/#projects\u003deswiki,itwiki,enwiki,jawiki,dewiki,frwiki/metrics\u003dMonthlyUniqueDevices\u003e\u003cbr /\u003e\u003cbr /\u003e[3] https://stats.wikimedia.org/EN/TablesArticlesTotal.htm \u003cbr /\u003e\u003chttps://stats.wikimedia.org/EN/TablesArticlesTotal.htm\u003e\u003cbr /\u003e\u003cbr /\u003e[4] https://stats.wikimedia.org/EN/Sitemap.htm \u003cbr /\u003e\u003chttps://stats.wikimedia.org/EN/Sitemap.htm\u003e\u003cbr /\u003e\u003cbr /\u003eBenefits \u0026 Perks *\u003cbr /\u003e\u003cbr /\u003e * Fully paid medical, dental, and vision coverage for employees and their \u003cbr /\u003eeligible families (yes, fully paid premiums!) \u003cbr /\u003e * The Wellness Program provides reimbursement for mind, body, and soul \u003cbr /\u003eactivities such as fitness memberships, massages, cooking classes, and much more\u003cbr /\u003e * The 401(k) retirement plan offers matched contributions at 4% of annual \u003cbr /\u003esalary \u003cbr /\u003e * Flexible and generous time off - vacation, sick, and volunteer days \u003cbr /\u003e * Pre-tax savings plans for health care, child care, elder care, public \u003cbr /\u003etransportation, and parking expenses \u003cbr /\u003e * For those emergency moments - long and short term disability, life \u003cbr /\u003einsurance (2x salary), and an employee assistance program \u003cbr /\u003e * Telecommuting and flexible work schedules available \u003cbr /\u003e * Appropriate fuel for thinking and coding (aka, a pantry full of treats) and \u003cbr /\u003emonthly massages to help staff relax \u003cbr /\u003e * Great colleagues - international staff speaking dozens of languages from \u003cbr /\u003earound the world, fantastic intellectual discourse, mission-driven, and \u003cbr /\u003eintensely passionate people \u003cbr /\u003e* for benefits eligible staff, benefits may vary by location\u003cbr /\u003e\u003cbr /\u003eMore Information\u003cbr /\u003e\u003cbr /\u003ehttp://wikimediafoundation.org \u003chttp://wikimediafoundation.org\u003e\u003cbr /\u003e\u003cbr /\u003ehttp://blog.wikimedia.org \u003chttp://blog.wikimedia.org\u003e\u003cbr /\u003eExternal URL  apply now  \u003chttp://grnh.se/hc5efu1\u003e  more jobs at Wikimedia \u003cbr /\u003eFoundation \u003c\u003e \u003cbr /\u003eJoin us at Wikimedia Foundation, Inc.\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eFully paid premiums for medical, dental \u0026 vision 401(k) Retirement Plan Short \u003cbr /\u003eand Long Term Disability Insurance Life and AD\u0026D Insurance Flexible Spending \u003cbr /\u003eTransportation \u0026 Parking Plan Parental Support Wellness Program ($1800/a year) \u003cbr /\u003eEmployee Assistance Program (EAP) Flexible Spending Account Plan Personal \u003cbr /\u003edevelopment/education \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eMatthew Flaschen \u003cbr /\u003ejava python c mysql \u003cbr /\u003eview profile \u003c\u003e Dmitry Brant \u003cbr /\u003e.net c# c++ c \u003cbr /\u003eview profile \u003c\u003e Monte Hurd \u003cbr /\u003eobject-oriented-design rdbms sql opengl-es \u003cbr /\u003eview profile \u003c\u003e Yuri Astrakhan \u003cbr /\u003ec# resharper async .net \u003cbr /\u003eview profile \u003c\u003e Arthur Richards \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Learn more about Wikimedia Foundation \u003c\u003e more jobs at \u003cbr /\u003eWikimedia Foundation \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/wikimedia-foundation-inc?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TITLE1/manager",
      "TECH2/linux",
      "REMOTE2/locals-only",
      "TECH2/c++",
      "TECH2/c",
      "REMOTE1/100",
      "TECH2/php"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/113584/vp-engineering-chief-architect-critical-mix?a\u003dC5JLs8GkKnS",
    "title": "VP Engineering, Chief Architect at Critical Mix (Dallas, TX) (allows remote)",
    "content": "As Vice President of Engineering, you will lead our software engineering \u003cbr /\u003eorganization in architecting and building our mobile first consumer facing \u003cbr /\u003eproducts ranging from highly responsive and engaging e-commerce web sites to \u003cbr /\u003ecustom mobile applications. You will be responsible for translating the \u003cbr /\u003eCritical Mix product strategy into best in class application services. It is \u003cbr /\u003eessential and required to provide career mentoring, coaching and development of \u003cbr /\u003ea talented group of engineers, while creating and fostering the right culture \u003cbr /\u003eto attract and retain diverse technical talent.\u003cbr /\u003e\u003cbr /\u003eYou will coordinate and drive the evaluation, conceptualization, design, and \u003cbr /\u003eintegration of major new capabilities into the product line, ensuring that \u003cbr /\u003eproduct design and technology choices anticipate future needs, while \u003cbr /\u003eefficiently satisfying short term customer requirements.\u003cbr /\u003e\u003cbr /\u003eThis is a fantastic opportunity to work with massive real-time data ingestion, \u003cbr /\u003epipeline, and enrichment services leveraging modern API architectures. \u003cbr /\u003ePredictive analytics and machine learning technologies are and will be at the \u003cbr /\u003ecore of how these services are delivered at scale.\u003cbr /\u003e\u003cbr /\u003ePreferred Locations, but will consider remote for the perfect candidate.\u003cbr /\u003e\u003cbr /\u003ePerrysburg, OH - Dallas, TX - San Franciso or LA, CA\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eResponsibilities and success metrics\u003cbr /\u003e\u003cbr /\u003e * Lead and inspire the entire team from software engineers to product \u003cbr /\u003emanagers. \u003cbr /\u003e * Optimize, adapt, and grow an Agile environment that encourages \u003cbr /\u003ecollaboration, innovation, and high-quality standards \u003cbr /\u003e * Work with the product teams and other executives to ensure the team has a \u003cbr /\u003eclear and actionable product roadmap. \u003cbr /\u003e * Develop and execute a strategic technology roadmap in alignment with \u003cbr /\u003eenterprise business goals. Provide the strategic leadership, collaborate \u003cbr /\u003ecoordination, and creative problem solving necessary to manage and advance new \u003cbr /\u003eand existing opportunities across the business \u003cbr /\u003e * Evaluate and implement new technologies as well as make recommendations for \u003cbr /\u003efuture and existing products. \u003cbr /\u003e * Extend the innovation boundaries of current in-house capabilities and \u003cbr /\u003e“know-how” \u003cbr /\u003e * Lead key projects from concept through planning to development, launch, and \u003cbr /\u003epost-launch support. \u003cbr /\u003e * Conduct customer research, market and competitor analysis. \u003cbr /\u003eQualifications:\u003cbr /\u003e\u003cbr /\u003e * 10+ years of experience in software development \u003cbr /\u003e * 5+ years of experience in complex systems and/or web-based enterprise \u003cbr /\u003eapplications product architecture and design \u003cbr /\u003e * 4+ years of experience managing a multi-functional software engineering \u003cbr /\u003eteam building highly-scalable systems. \u003cbr /\u003e * Significant experience with cloud based service options and emerging \u003cbr /\u003eservice trends such as application gateways and DevOps tools. Preferably AWS \u003cbr /\u003eservices. \u003cbr /\u003e * Experience in LAMP stack development environments. \u003cbr /\u003e * Familiarity with IT security and regulatory compliance. \u003cbr /\u003e * Possess a broad understanding of current and emerging technical \u003cbr /\u003earchitecture and trends relevant to machine learning and AI. \u003cbr /\u003e * Significant professional experience in Agile development practices \u003cbr /\u003eincluding daily SCRUM stand-ups and issue tracking. \u003cbr /\u003e * Exceptional verbal and written communication skills. \u003cbr /\u003e * Exceptional energy and passion for developing great engineers, teams, and \u003cbr /\u003eproducts. \u003cbr /\u003e * Bachelor’s degree in a Computer Science, MIS or related field and/or \u003cbr /\u003eequivalent years of experience required. \u003cbr /\u003eThis job description is not designed to contain a comprehensive listing of \u003cbr /\u003eactivities, duties, or responsibilities that are required. Nothing in this job \u003cbr /\u003edescription restricts management\u0027s right to assign or reassign duties and \u003cbr /\u003eresponsibilities at any time.\u003cbr /\u003e\u003cbr /\u003e About Critical Mix \u003cbr /\u003e\u003cbr /\u003eCritical Mix provides easy access to highly-targeted global survey \u003cbr /\u003erespondents, survey programming and data visualization services for market \u003cbr /\u003eresearch and consulting firms. Driven by a passion for simplifying data \u003cbr /\u003ecollection, the team at Critical Mix is personally invested in giving clients \u003cbr /\u003ethe ultimate customer service experience.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 12 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? apply now \u003c\u003e  more jobs at Critical Mix\u003cbr /\u003e \u003c\u003e \u003cbr /\u003eJoin us at Critical Mix\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eHealth benefits Flexible schedule Great work/life integration Empowerment \u003cbr /\u003eUnlimited vacation policy Competitive compensation Remote location Gym \u003cbr /\u003ememberships \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eGuillermo Sandoval \u003cbr /\u003ec++ java php c \u003cbr /\u003eview profile \u003c\u003e Skylar Sommers \u003cbr /\u003ejava gwt spring spring-mvc \u003cbr /\u003eview profile \u003c\u003e Joshua Jones \u003cbr /\u003ego java c# c++ \u003cbr /\u003eview profile \u003c\u003e Cameron Schuette \u003cbr /\u003ephp c++ \u003cbr /\u003eview profile \u003c\u003e Paul Hudson \u003cbr /\u003ebigdata oracle \u003cbr /\u003eview profile \u003c\u003e Gino Trombetti \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Christopher Hiller \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Learn more about Critical Mix \u003c\u003e more jobs at Critical Mix \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/critical-mix?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TITLE1/manager",
      "TECH2/amazon-web-services",
      "TECH2/api-design",
      "REMOTE2/America",
      "TECH2/jira",
      "TECH2/bigdata",
      "REMOTE1/100",
      "TECH2/php"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/117687/platform-engineering-developer-appsec-remote-datapipe?a\u003dDt3birgI5ji",
    "title": "Platform Engineering Developer - AppSec Remote Opportunity within the US at Datapipe (Jersey City, NJ) (allows remote)",
    "content": "WHO YOU ARE\u003cbr /\u003e\u003cbr /\u003eDo you enjoy simplifying challenging, technical solutions to solve multiple \u003cbr /\u003eneeds? \u003cbr /\u003e\u003cbr /\u003eAre you a technology evangelist, connecting people who have problems with the \u003cbr /\u003eright solutions, technology, and knowledge they need to succeed? \u003cbr /\u003e\u003cbr /\u003eDo you possess a skill to effectively educate resources of the technical and \u003cbr /\u003enon-technical benefits that drive next-generation infrastructure? \u003cbr /\u003e\u003cbr /\u003eWHAT YOU WILL DO\u003cbr /\u003e\u003cbr /\u003eAt Datapipe, our Platform Engineering Team supports our global team of \u003cbr /\u003eCustomer Delivery Engineering, Product Engineering, and Support and Operations \u003cbr /\u003eto:\u003cbr /\u003e\u003cbr /\u003e * Eradicate duplicative effort and create consistency in software wherever \u003cbr /\u003epossible through: \u003cbr /\u003e * Automation design, templating, common library development \u003cbr /\u003e * Process engineering, best practices development \u003cbr /\u003e * Platform evangelism to build up support for a given technology \u003cbr /\u003e * Be actively involved in strategizing how to leverage automation and DevOps \u003cbr /\u003efor Datapipe’s clients \u003cbr /\u003e * Contribute to refining and improving Datapipe’s processes around \u003cbr /\u003eaward-winning customer service, development and deployments \u003cbr /\u003e * Stay current on technology advancements to evaluate new technology, \u003cbr /\u003etechniques and tools to improve the overall Datapipe engineering platform  \u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eWHAT WE’RE LOOKING FOR IN YOU:\u003cbr /\u003e\u003cbr /\u003e * Three or more years’ developing systems / application deployment / \u003cbr /\u003econfiguration processes emphasis \u003cbr /\u003e * Three or more years managing, diagnosing and debugging matrixed problems \u003cbr /\u003eacross multiple disciplines: \u003cbr /\u003e * Applications \u003cbr /\u003e * Infrastructure \u003cbr /\u003e * Databases \u003cbr /\u003e * Expertise in leveraging in Automation / DevOps principles, experience with \u003cbr /\u003eoperational tools, and able to apply best practices for infrastructure and \u003cbr /\u003esoftware deployment: \u003cbr /\u003e * Ansible \u003cbr /\u003e * Puppet \u003cbr /\u003e * Chef \u003cbr /\u003e * Saltstack \u003cbr /\u003e * Proficiency in IaaS platforms, AWS preferred. Azure, Google, and VMWare a \u003cbr /\u003eplus \u003cbr /\u003e * Expertise with one or more configuration management tools \u003cbr /\u003e * Able to investigate, test, and deploy new technologies where little \u003cbr /\u003edocumentation exists \u003cbr /\u003e About Datapipe \u003cbr /\u003e\u003cbr /\u003eWHAT WE DO\u003cbr /\u003e\u003cbr /\u003eDatapipe’s Professional Services engage in next generation cloud solutions for \u003cbr /\u003eclients and are dedicated to strong success for the client and its \u003cbr /\u003ecustomers. As an integral part of the Delivery Engineering team, you will \u003cbr /\u003eenable our clients to design systems that are purpose-built and well suited to \u003cbr /\u003etheir target infrastructure. \u003cbr /\u003e\u003cbr /\u003eOffer packages\u003cbr /\u003e\u003cbr /\u003e * Competitive salaries \u003cbr /\u003e * Personal time off \u003cbr /\u003e * Medical, dental, and vision insurance \u003cbr /\u003e * 401k, life insurance, and disability benefits \u003cbr /\u003e * Annual training and career development \u003cbr /\u003e * Company-provided equipment, including cell phones \u003cbr /\u003e * Weekly catered lunch in the office  \u003cbr /\u003eHOW WE DO IT \u003cbr /\u003e\u003cbr /\u003eA next generation MSP, Datapipe is recognized as the pioneer of managed \u003cbr /\u003eservices for public cloud platforms. Datapipe has unique expertise in \u003cbr /\u003earchitecting, migrating, managing and securing public cloud, private cloud, \u003cbr /\u003ehybrid IT and traditional IT around the globe. \u003cbr /\u003e\u003cbr /\u003eBacked by a global team of experienced professionals and world-class \u003cbr /\u003einterconnected data centers, Datapipe provides comprehensive cloud, compliance, \u003cbr /\u003esecurity, governance, automation and DevOps solutions. Gartner named Datapipe a \u003cbr /\u003eleader in the Magic Quadrant for Cloud-Enabled Managed Hosting.\u003cbr /\u003e\u003cbr /\u003eWhat we do and how we do it matters. Datapipe’s culture reflects who are and \u003cbr /\u003ewhat we stand for as a company. We measure our success by the success of our \u003cbr /\u003eclients.\u003cbr /\u003e\u003cbr /\u003eInnovative and Collaborative\u003cbr /\u003e\u003cbr /\u003eTechnology equals change. We embrace the challenge of continual improvement \u003cbr /\u003eand work together, across teams and around the world. Our teams are always \u003cbr /\u003eseeking to learn, test, prove, and adopt best of breed technologies, processes \u003cbr /\u003eand services to enable the success of our clients. \u003cbr /\u003e\u003cbr /\u003eConfident and Empathetic\u003cbr /\u003e\u003cbr /\u003eDatapipe is recognized as an industry leader. We are trusted with solving \u003cbr /\u003ecomplex, mission critical problems for the world’s most recognized brands. We \u003cbr /\u003edevelop a deep understanding of our clients\u0027 business challenges and \u003cbr /\u003eobjectives, taking a personal interest in helping them achieve their goals.\u003cbr /\u003eapply now \u003c\u003e  more jobs at Datapipe  \u003c\u003e \u003cbr /\u003eJoin us at Datapipe\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eCompetitive salaries PTO Medical, dental, and vision insurance 401k, life \u003cbr /\u003einsurance, and disability benefits Annual training and career development \u003cbr /\u003eCompany-provided equipment, including cell phones Weekly catered lunch in the \u003cbr /\u003eoffice \u003cbr /\u003eLearn more about Datapipe \u003c\u003e more jobs at Datapipe \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/datapipe?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TITLE1/manager",
      "TECH2/java",
      "REMOTE2/America",
      "TECH2/chef",
      "TECH2/ruby-on-rails",
      "TECH2/ansible",
      "REMOTE1/100",
      "TECH2/puppet"
    ]
  },
  {
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28784?r\u003drss2",
    "title": "MeetEdgar: Marketing Director",
    "content": "Full-time\u003cbr /\u003e\u003cbr /\u003e(Anywhere) \u003cbr /\u003e\u003cbr /\u003eWe’re a SaaS company with 25 employees, half a dozen dogs, 7000 customers, and \u003cbr /\u003ea new social media update sent out every 15 seconds.\u003cbr /\u003e\u003cbr /\u003eWhat we’re looking for now is YOU - our next director of marketing, who can \u003cbr /\u003eguide our strategy and take our growth to the next level!\u003cbr /\u003e\u003cbr /\u003eWe’re bootstrapped and profitable, and are now doing $4 million ARR two and a \u003cbr /\u003ehalf years after launch. This is a large-scale online marketing position, not \u003cbr /\u003esales - so if you know how to rock trade shows but don’t know how to build a \u003cbr /\u003efunnel, this isn’t the right fit for you. If you want to lead our intrepid team \u003cbr /\u003eof writers, developers, and data research-y people with a solid strategic \u003cbr /\u003evision, though, keep on reading!\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eJob Perks: - Work from home (or wherever there’s strong wifi) - 4 weeks paid \u003cbr /\u003evacation (Shazam! And yes, everyone actually uses all 4 weeks) - Monthly \u003cbr /\u003ecleaning service for your home - not that we don\u0027t have total faith in you - \u003cbr /\u003ePaid home Internet service - Check ‘em out in even more detail here (you know \u003cbr /\u003eyou’re curious) https://goo.gl/5DjyyD\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Feb 6, 2017 7:44:35 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28659?r\u003drss2",
    "title": "We Are Mammoth: Senior Project Manager",
    "content": "Full-time\u003cbr /\u003e\u003cbr /\u003e(Anywhere) \u003cbr /\u003e\u003cbr /\u003eDESCRIPTION\u003cbr /\u003e\u003cbr /\u003eWe’re looking for a Senior Project Manager to interface directly with our \u003cbr /\u003eproduction team and clients. You\u0027ll be empowered to make a real difference in \u003cbr /\u003eprojects from scoping all the way through deployment and post-launch support. \u003cbr /\u003eThis is for a full-time position either at our Chicago office or from a remote \u003cbr /\u003eworkplace.\u003cbr /\u003e\u003cbr /\u003eMore than just a task master, as Senior Project Manager you\u0027re expected to \u003cbr /\u003elead projects forward. You\u0027ll be the definitive knowledge keeper of project \u003cbr /\u003efeatures, deliverables, budgets, and timelines - communicating concisely and \u003cbr /\u003epolitely to client stakeholders and production peers.\u003cbr /\u003e\u003cbr /\u003eAt We Are Mammoth, we believe the gateway to a successful business is an \u003cbr /\u003eefficient, empowered, and productive workplace. We Are Mammoth builds web \u003cbr /\u003eapplications that help companies around the world do a better job \u003cbr /\u003ecommunicating, organizing, and conducting business.\u003cbr /\u003e\u003cbr /\u003eWhat you\u0027ll be doing\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e * Ongoing commitment to evolving duties and responsibilities to best match \u003cbr /\u003ethe needs of the production and business teams.\u003cbr /\u003e * Diligently create and manage timelines, budgets, and overages with our \u003cbr /\u003eclients with tact and transparency.\u003cbr /\u003e * Manage content documents, programming manuals, and content assets as well \u003cbr /\u003eas train and assist client partners in using content management systems.\u003cbr /\u003e * Maintain clear and constant lines of communications with all client \u003cbr /\u003estakeholders.\u003cbr /\u003e * Serve as primary internal knowledge holder as it relates to project \u003cbr /\u003edeliverables, features, due dates, contacts, and budgets\u003cbr /\u003e * Along with your lead developer, lead the project forward in pre-production, \u003cbr /\u003eproduction, and post-launch life cycles.\u003cbr /\u003e * Perform multiple cycles of internal testing and issue resolution with the \u003cbr /\u003eprogramming team.\u003cbr /\u003e * Work to maintain a sense of fairness as it pertains to project scope.\u003cbr /\u003eREQUIREMENTS\u003cbr /\u003e\u003cbr /\u003e * BA or BS degree or equivalent experience.\u003cbr /\u003e * Scrum Master certification is a plus.\u003cbr /\u003e * PMP certification is a plus.\u003cbr /\u003e * Sound understanding of web technologies including HTML/CSS, JavaScript; \u003cbr /\u003emiddleware technologies such as PHP and .NET; and server and security \u003cbr /\u003einfrastructure.\u003cbr /\u003e * Successful history of requirements gathering sessions to understand project \u003cbr /\u003eobjectives and expectations including business requirements documentation, use \u003cbr /\u003ecases, QA testing, and training plans.\u003cbr /\u003e * Former experience in development, design, or experience planning strongly \u003cbr /\u003epreferred.\u003cbr /\u003e * 5+ years in digital or software project management.\u003cbr /\u003e * Exceptional written and verbal communication skills.\u003cbr /\u003e * Experience in leading cross-platform projects from mobile to desktop and \u003cbr /\u003eeven the occasional email campaign.\u003cbr /\u003e * Ability to manage multiple projects with minimal direction. You bring \u003cbr /\u003eclarity to ambiguity.\u003cbr /\u003e * Ability to work and communicate with a diverse range of people.\u003cbr /\u003eBENEFITS\u003cbr /\u003e\u003cbr /\u003eWorking at We Are Mammoth:\u003cbr /\u003e\u003cbr /\u003eWe Are Mammoth is a closely-knit, distributed team of software developers, \u003cbr /\u003edesigners, digital project managers, and support staff. We strive to maintain a \u003cbr /\u003emeaningful work/life balance.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e * Competitive benefits package including medical/dental/vision coverage, life \u003cbr /\u003einsurance, short- and long-term disability programs, paid time off (PTO), and \u003cbr /\u003ean employer-matched retirement plan with company matching up to 3%.\u003cbr /\u003e * Everyone starts with 15 days of paid vacation. Each year, you\u0027ll get 5 more \u003cbr /\u003euntil you have 25 paid vacation days.\u003cbr /\u003e * We have a beautiful office in Chicago\u0027s Fulton Market. It\u0027s like a home, a \u003cbr /\u003elibrary, and a gallery mashed into one. If you live in Chicago, we\u0027ll pay for a \u003cbr /\u003eparking space or public transportation so you can get to the office easily. If \u003cbr /\u003eyou work remotely, you’ll still get to join us in Chicago a few times a year.\u003cbr /\u003e * We do annual compensation reviews on your anniversary, quarterly \u003cbr /\u003ehow-things-are-going reviews with your manager, and have an employee \u003cbr /\u003eequity-sharing plan.\u003cbr /\u003e * All new team members at We Are Mammoth are paired with a mentor who \u003cbr /\u003eprovides advice, guidance, and support.\u003cbr /\u003eThis is a full-time, remote, project manager position. We Are Mammoth promotes \u003cbr /\u003ea workplace that actively seeks to include, welcome, and value unique \u003cbr /\u003econtributions of all people. We encourage all qualified US Citizens to apply \u003cbr /\u003efor this job.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eNo recruiters please! No phone calls please!\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Jan 17, 2017 6:24:43 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28657?r\u003drss2",
    "title": "pri: Digital Project Manager",
    "content": "Full-time\u003cbr /\u003e\u003cbr /\u003e(Manalapan, NJ) \u003cbr /\u003e\u003cbr /\u003ePRI, a digital agency is looking for a Digital Project Manager to serve as \u003cbr /\u003elead consultant and project coordinator for projects. A bridge between our \u003cbr /\u003eClient Strategy and Creative teams, the Digital Project Manager will handle \u003cbr /\u003etasking, day-to-day communication, and run projects from start to finish.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eProject/Practice Management\u003cbr /\u003e\u003cbr /\u003e * Ability to think critically, analyze, and document business problems to \u003cbr /\u003eassist the project team in defining a project approach that best suits our \u003cbr /\u003eclients’ needs\u003cbr /\u003e * Creating and managing business requirements and technical specifications, \u003cbr /\u003eas necessary to define project scope and manage the iterative nature of digital \u003cbr /\u003eprojects\u003cbr /\u003e * Creating and executing project plans, and revising them as appropriate to \u003cbr /\u003emeet changing needs and requirements\u003cbr /\u003e * Ability to define resource needs, then communicate and collaborate those \u003cbr /\u003eproject needs to other project managers to determine resource assignments \u003cbr /\u003eacross all active projects\u003cbr /\u003e * Ability to identify risks and resolve them pro-actively with consideration \u003cbr /\u003efor short and long term project impact\u003cbr /\u003e * Managing day-to-day operational aspects of assigned projects and scope\u003cbr /\u003e * Carefully reviewing and contributing to deliverables prepared by team \u003cbr /\u003ebefore passing to client\u003cbr /\u003e * Ability to document project meetings, including stakeholder or user \u003cbr /\u003einterviews\u003cbr /\u003e * Ability to facilitate user research using active and passive research \u003cbr /\u003emethods\u003cbr /\u003e * Manage cross functional team responsible for pilot deliverables\u003cbr /\u003eClient Management\u003cbr /\u003e\u003cbr /\u003e * Managing day-to-day client interaction\u003cbr /\u003e * Setting and managing client expectations\u003cbr /\u003e * Identifying needs and evaluating alternative solutions\u003cbr /\u003e * Building a knowledge base of each client\u0027s business, organization, and \u003cbr /\u003eobjectives\u003cbr /\u003e * Seeking opportunities to increase customer satisfaction and deepen client \u003cbr /\u003erelationships\u003cbr /\u003e * Ensuring the project team confirms the direction of its approach and \u003cbr /\u003edelivers on its stated promises\u003cbr /\u003e * Serves as first point of contact for clients with new website/marketing \u003cbr /\u003eprojects as well as websites/projects in maintenance and/or maintenance \u003cbr /\u003erequests.\u003cbr /\u003eProject Accounting\u003cbr /\u003e\u003cbr /\u003e * Tracking and managing team hours, by project, on a weekly basis\u003cbr /\u003e * Managing project budgets \u0026 expenses\u003cbr /\u003e * Working with the PRI General Manager to prepare and distribute client \u003cbr /\u003einvoices and ensure their timely payment\u003cbr /\u003eCommunication\u003cbr /\u003e\u003cbr /\u003e * Facilitating team and client meetings\u003cbr /\u003e * Preparing regular status reports and leading status meetings with clients\u003cbr /\u003e * Keeping project teams well-informed\u003cbr /\u003e * Delivering engaging, informative, well-organized presentations as needed\u003cbr /\u003e * Understanding how to communicate difficult/sensitive information tactfully\u003cbr /\u003e * Resolving and/or escalating issues in a timely fashion\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Jan 17, 2017 3:32:55 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "indeed.com-1",
    "url": "http://www.indeed.com/job/Manager-at-Scholastic-in-New-York,-NY-80c7118c0c184412",
    "title": "Manager, Performance Engineering - Scholastic - New York, NY",
    "content": "\u003c\u003e Manager, Performance Engineering \u003cbr /\u003eScholastic 287 reviews \u003c\u003e - New York, NY \u003cbr /\u003eTHE OPPORTUNITY \u003cbr /\u003e\u003cbr /\u003e The Manager, Performance Engineering will be responsible to manage a team of \u003cbr /\u003eperformance engineers who deliver application performance tests across several \u003cbr /\u003edifferent software teams. Leveraging strong knowledge of technology and \u003cbr /\u003ebusiness domains, the PE Manager will help create and nurture a team of first \u003cbr /\u003eclass, Performance engineers who validate that we deliver consistently \u003cbr /\u003ehigh-performing applications to Scholastic customers and other end users.\u003cbr /\u003e\u003cbr /\u003e YOUR RESPONSIBILITIES \u003cbr /\u003e\u003cbr /\u003eThe PE Manager will:\u003cbr /\u003e\u003cbr /\u003e * Be responsible to recruit and maintain a team of performance engineers with \u003cbr /\u003ea mix of full-time, contractors as well as college-hires \u003cbr /\u003e * Serve as a direct manager of FTE performance test engineers. Address their \u003cbr /\u003eonboarding, performance, career goals and growth through a mix of appropriate \u003cbr /\u003eassignments, work review, coaching and training \u003cbr /\u003e * Serve as manager of remote/on-site consultant performance test engineers. \u003cbr /\u003eAddress their onboarding, performance, and effective engagement on teams \u003cbr /\u003e * Be responsible to keep up-to-date with the latest performance testing tools \u003cbr /\u003eand technologies so as to serve as an expert. Be aware of vendor-alternatives \u003cbr /\u003eto address spaces where open source toolset does not provide sufficient coverage\u003cbr /\u003e * Be responsible to clearly communicate performance test strategy to the \u003cbr /\u003eperformance engineers as well as other stakeholders. Serve as an evangelist for \u003cbr /\u003ePerformance engineering. Clearly communicate the benefits, costs and \u003cbr /\u003elimitations of performance testing \u003cbr /\u003e * Be responsible to setup and setup reporting of KPIs for the performance \u003cbr /\u003etest team, and take action on the data \u003cbr /\u003e * Ensure via validation, or via inspection, that all application changes do \u003cbr /\u003enot have a negative impact on performance \u003cbr /\u003e * Be responsible to ensure that performance tests are conducted in an \u003cbr /\u003eefficient manner to guarantee application performance, at optimal cost  WHO WE \u003cbr /\u003eARE\u003cbr /\u003e\u003cbr /\u003eScholastic Corporation (NASDAQ: SCHL) is the world\u0027s largest publisher and \u003cbr /\u003edistributor of children\u0027s books, a leading provider of print and digital \u003cbr /\u003einstructional materials for pre-K to grade 12, and a producer of educational \u003cbr /\u003eand entertaining children\u0027s media. The Company creates quality books and \u003cbr /\u003eebooks, print and technology-based learning programs, classroom magazines and \u003cbr /\u003eother products that, in combination, offer schools customized solutions to \u003cbr /\u003esupport children\u0027s learning both at school and at home. The Company also makes \u003cbr /\u003equality, affordable books available to all children through school-based book \u003cbr /\u003eclubs and book fairs. With a 96 year history of service to schools and \u003cbr /\u003efamilies, Scholastic continues to carry out its commitment to \"Open a World of \u003cbr /\u003ePossible\" for all children. Learn more at www.scholastic.com.\u003cbr /\u003e\u003cbr /\u003eSome benefits that we offer:\u003cbr /\u003e\u003cbr /\u003e * 100% vested of 401(k) Retirement Plan after 5 years employment \u003cbr /\u003e * Up to 1M worth of supplemental Life Insurance \u003cbr /\u003e * Tuition Reimbursement \u003cbr /\u003e * Purchase Scholastic stock at a 15% discount  Thank you for your \u003cbr /\u003econsideration in choosing Scholastic.\u003cbr /\u003e\u003cbr /\u003e Qualifications \u003cbr /\u003e\u003cbr /\u003e HOW YOU CAN FIT \u003cbr /\u003e\u003cbr /\u003e Managerial competence, which supports team organization and management \u003cbr /\u003eDay-to-day management of 6-8 performance engineers \u003cbr /\u003e\u003cbr /\u003e Supervision of contractors or offshore engineers as part of extended team \u003cbr /\u003eDefines STS performance engineering best practices and coaches team to \u003cbr /\u003eeffectively apply them\u003cbr /\u003e\u003cbr /\u003e Reviews technology stack in use by project teams and reviews for fit with \u003cbr /\u003eperformance test tools in use\u003cbr /\u003e\u003cbr /\u003e Engages with architects, development managers and leads and other leaders to \u003cbr /\u003eupdate performance test tooling and practices\u003cbr /\u003e\u003cbr /\u003e Uses a combination of internal and external training resources to keep team \u003cbr /\u003eabreast of the technologies selected for performance testing\u003cbr /\u003e\u003cbr /\u003e Applies metrics to monitor performance of performance engineers, and pushes \u003cbr /\u003efor demonstrable continuous improvement\u003cbr /\u003e\u003cbr /\u003e Technical competence, which supports Performance Testing \u003cbr /\u003eSolid scripting in Beanshell programming expertise with Jmeter and/or \u003cbr /\u003ehttp/html web, Java, Oracle NCA and web services protocols of LoadRunner\u003cbr /\u003eJenkins, Maven, and Jmeter CI experience \u003cbr /\u003e\u003cbr /\u003e Expert Level programming skills in Beanshell and C \u003cbr /\u003e\u003cbr /\u003e Very strong Linux Skills. \u003cbr /\u003e\u003cbr /\u003e Diagnostic Tools like New Relic or App Dynamics is needed. \u003cbr /\u003e\u003cbr /\u003e Good Knowledge of JBoss app server tuning , AWS systems, Cloud watch, Load \u003cbr /\u003eBalancers in AWS\u003cbr /\u003e\u003cbr /\u003e Ability to setup complex test scenarios to model production workloads. \u003cbr /\u003e\u003cbr /\u003e Ability to monitor JVMs, analyze heap dumps, analyze queries, analyze logs \u003cbr /\u003eand memory profiling.\u003cbr /\u003e\u003cbr /\u003e Ability to monitor and collect result data, analyze and pinpoint bottlenecks \u003cbr /\u003eand guide developers and other in fixing performance issues.\u003cbr /\u003e\u003cbr /\u003e Experience diagnosing and debugging performance bottlenecks by interpreting \u003cbr /\u003etest results and analyzing metrics gathered using tools\u003cbr /\u003e\u003cbr /\u003e Database knowledge, indexes, and SQL optimization techniques. \u003cbr /\u003ePlan, design, execute and maintain different types of performance tests like \u003cbr /\u003eload, stress, endurance, spike, capacity etc.\u003cbr /\u003e\u003cbr /\u003e Other competence, which supports Quality \u003cbr /\u003e\u003cbr /\u003e Good team player with the ability to handle multiple concurrent priorities in \u003cbr /\u003ea fast paced environment.\u003cbr /\u003e\u003cbr /\u003e Strong interpersonal, written and oral communication skills. \u003cbr /\u003e\u003cbr /\u003e Strong adherent to Agile principles in letter as well as in spirit. Knows and \u003cbr /\u003efollows Agile convention, but importantly internalizes the Agile spirit\u003cbr /\u003e\u003cbr /\u003e Strong communicator – able to work closely with counterparts in a \u003cbr /\u003ecross-functional, Agile team setting, to understand product needs and implement \u003cbr /\u003ethe right performance tests\u003cbr /\u003e\u003cbr /\u003e Understands the importance of data insofar as to analyze reported issues, \u003cbr /\u003einform severity of defects, inform the priority of tests\u003cbr /\u003e\u003cbr /\u003e Understands the importance of metrics in the modern software organization and \u003cbr /\u003esupports the automated generation of such metrics as an outcome of normal work. \u003cbr /\u003eObserves patterns in the metrics and takes appropriate action\u003cbr /\u003e\u003cbr /\u003e Can enforce process and best practices to team members as well as teams that \u003cbr /\u003eengage performance test engineers\u003cbr /\u003e3 days ago",
    "urlFetchPending": false,
    "published": "Feb 4, 2017 12:40:32 AM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "remoteok.io-dev",
    "url": "https://remoteok.io/jobs/21361",
    "title": "UWP Software Engineering Manager",
    "content": "If you are an elite Software Engineering Manager with Universal Windows \u003cbr /\u003ePlatform expertise eager to gain unprecedented visibility to the top technology \u003cbr /\u003ecompanies throughout the globe, employ your technical and managerial skills to \u003cbr /\u003eoversee cutting-edge software in a high-intensity environment, and earn \u003cbr /\u003e$140,000 USD per year while working from virtually anywhere on the planet, this \u003cbr /\u003ejob is for you.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThe Company:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Crossover is a well-funded startup that has developed a unique way to find, \u003cbr /\u003ecurate and manage the top 1% of global talent and connect them to medium and \u003cbr /\u003elarge businesses. We are experiencing rapid growth within the companies we \u003cbr /\u003ecurrently serve and are increasing our staff to expand our business.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Brick and mortar offices are history. The future of our global workforce will \u003cbr /\u003econsist of teams collaborating from every corner of the world. Our platform \u003cbr /\u003econnects customers to the worlds best talent for both technical and \u003cbr /\u003enon-technical contracting. But we dont just find the best; we also provide the \u003cbr /\u003esoftware tools, training, and expert management to ensure success for long-term \u003cbr /\u003egrowth.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eJob Description:\u003cbr /\u003e\u003cbr /\u003eCrossover is looking for Software Engineering Managers with UWP experience who \u003cbr /\u003edemonstrate outstanding managerial skills as well as the technical background \u003cbr /\u003eto deeply understand the code their teams are developing. You will be expected \u003cbr /\u003eto demonstrate both a mastery of the technical skills associated with the \u003cbr /\u003eprojects at hand, as well as the managerial ability to motivate, build, and \u003cbr /\u003emonitor your team. Specifically, you will be responsible for overseeing from 4 \u003cbr /\u003eto 6 teams of 3 to 4 individuals. You will own the process of breaking \u003cbr /\u003especifications created by the product management team into clear tasks and \u003cbr /\u003etimelines, as well as assembling the results into high value, reusable \u003cbr /\u003ecomponents. Under your leadership, we expect to see consistent improvement in \u003cbr /\u003eboth static code quality metrics and weekly production.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualities:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eRuthless commitment to impeccable code quality\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eDeep understanding of a wide range of the latest technologies and \u003cbr /\u003earchitectural approaches\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAdvanced proficiency in C# programming language, related frameworks and best \u003cbr /\u003epractices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eThe ability to make appropriate technical decisions, review design and code, \u003cbr /\u003eand ensure best technical practices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to hands-on engagement as an individual within the team, despite \u003cbr /\u003emanagerial status\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eWillingness to embrace iterative development as the means for building \u003cbr /\u003eseamless products\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003ePerfectionism: knowing how a job should be done and not stop until its done \u003cbr /\u003ecorrectly\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExceptional ability to effectively motivate and manage teams of individuals\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to increasing efficiency in the workplace by continuously \u003cbr /\u003eautomating parts of the software engineering process\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExcellent remote management skills (you will be using Skype, GoToMeeting, \u003cbr /\u003eGoogle Docs, etc.)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eRequired Skills and Experience:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualifications:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBachelor\u0027s degree in Computer Science, Computer Engineering, or Electrical \u003cbr /\u003eEngineering\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProven managerial skills with at least 8 years of experience\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003e2 years of experience in hands-on UWP (Universal Windows Platform) application \u003cbr /\u003edevelopment\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience with Cloud architecture and DevOps\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAt least 5 years of experience in managing .NET application development teams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in Agile, SDLC, or SLA\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in AWS and TDD is desired but not mandatory\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eOutstanding English communication skills\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eTotal compensation: $70/hr for 40 productive hours per week\u003cbr /\u003e\u003cbr /\u003eLocation: Global (remote)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWere one of the few legitimate companies offering high-paying jobs that are \u003cbr /\u003e100% remote, work from home. You never have to fight traffic to the office \u003cbr /\u003eagain and you have the freedom to choose when and where you put in your 40 \u003cbr /\u003ehours to be most effective each week.",
    "urlFetchPending": false,
    "published": "Jan 28, 2017 5:34:52 AM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "remoteok.io-dev",
    "url": "https://remoteok.io/jobs/20993",
    "title": "UWP Software Engineering Manager",
    "content": "If you are an elite Software Engineering Manager with Universal Windows \u003cbr /\u003ePlatform expertise eager to gain unprecedented visibility to the top technology \u003cbr /\u003ecompanies throughout the globe, employ your technical and managerial skills to \u003cbr /\u003eoversee cutting-edge software in a high-intensity environment, and earn \u003cbr /\u003e$140,000 USD per year while working from virtually anywhere on the planet, this \u003cbr /\u003ejob is for you.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThe Company:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Crossover is a well-funded startup that has developed a unique way to find, \u003cbr /\u003ecurate and manage the top 1% of global talent and connect them to medium and \u003cbr /\u003elarge businesses. We are experiencing rapid growth within the companies we \u003cbr /\u003ecurrently serve and are increasing our staff to expand our business.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Brick and mortar offices are history. The future of our global workforce will \u003cbr /\u003econsist of teams collaborating from every corner of the world. Our platform \u003cbr /\u003econnects customers to the worlds best talent for both technical and \u003cbr /\u003enon-technical contracting. But we dont just find the best; we also provide the \u003cbr /\u003esoftware tools, training, and expert management to ensure success for long-term \u003cbr /\u003egrowth.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eJob Description:\u003cbr /\u003e\u003cbr /\u003eCrossover is looking for Software Engineering Managers with UWP experience who \u003cbr /\u003edemonstrate outstanding managerial skills as well as the technical background \u003cbr /\u003eto deeply understand the code their teams are developing. You will be expected \u003cbr /\u003eto demonstrate both a mastery of the technical skills associated with the \u003cbr /\u003eprojects at hand, as well as the managerial ability to motivate, build, and \u003cbr /\u003emonitor your team. Specifically, you will be responsible for overseeing from 4 \u003cbr /\u003eto 6 teams of 3 to 4 individuals. You will own the process of breaking \u003cbr /\u003especifications created by the product management team into clear tasks and \u003cbr /\u003etimelines, as well as assembling the results into high value, reusable \u003cbr /\u003ecomponents. Under your leadership, we expect to see consistent improvement in \u003cbr /\u003eboth static code quality metrics and weekly production.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualities:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eRuthless commitment to impeccable code quality\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eDeep understanding of a wide range of the latest technologies and \u003cbr /\u003earchitectural approaches\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAdvanced proficiency in C# programming language, related frameworks and best \u003cbr /\u003epractices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eThe ability to make appropriate technical decisions, review design and code, \u003cbr /\u003eand ensure best technical practices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to hands-on engagement as an individual within the team, despite \u003cbr /\u003emanagerial status\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eWillingness to embrace iterative development as the means for building \u003cbr /\u003eseamless products\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003ePerfectionism: knowing how a job should be done and not stop until its done \u003cbr /\u003ecorrectly\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExceptional ability to effectively motivate and manage teams of individuals\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to increasing efficiency in the workplace by continuously \u003cbr /\u003eautomating parts of the software engineering process\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExcellent remote management skills (you will be using Skype, GoToMeeting, \u003cbr /\u003eGoogle Docs, etc.)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eRequired Skills and Experience:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualifications:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBachelor\u0027s degree in Computer Science, Computer Engineering, or Electrical \u003cbr /\u003eEngineering\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProven managerial skills with at least 8 years of experience\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003e2 years of experience in hands-on UWP (Universal Windows Platform) application \u003cbr /\u003edevelopment\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience with Cloud architecture and DevOps\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAt least 5 years of experience in managing .NET application development teams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in Agile, SDLC, or SLA\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in AWS and TDD is desired but not mandatory\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eOutstanding English communication skills\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eTotal compensation: $70/hr for 40 productive hours per week\u003cbr /\u003e\u003cbr /\u003eLocation: Global (remote)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWere one of the few legitimate companies offering high-paying jobs that are \u003cbr /\u003e100% remote, work from home. You never have to fight traffic to the office \u003cbr /\u003eagain and you have the freedom to choose when and where you put in your 40 \u003cbr /\u003ehours to be most effective each week.",
    "urlFetchPending": false,
    "published": "Jan 28, 2017 5:34:52 AM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "remoteok.io-dev",
    "url": "https://remoteok.io/jobs/21370",
    "title": "Software Engineering Manager",
    "content": "If you are an elite Software Engineering Manager with Universal Windows \u003cbr /\u003ePlatform expertise eager to gain unprecedented visibility to the top technology \u003cbr /\u003ecompanies throughout the globe, employ your technical and managerial skills to \u003cbr /\u003eoversee cutting-edge software in a high-intensity environment, and earn \u003cbr /\u003e$140,000 USD per year while working from virtually anywhere on the planet, this \u003cbr /\u003ejob is for you.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThe Company:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Crossover is a well-funded startup that has developed a unique way to find, \u003cbr /\u003ecurate and manage the top 1% of global talent and connect them to medium and \u003cbr /\u003elarge businesses. We are experiencing rapid growth within the companies we \u003cbr /\u003ecurrently serve and are increasing our staff to expand our business.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Brick and mortar offices are history. The future of our global workforce will \u003cbr /\u003econsist of teams collaborating from every corner of the world. Our platform \u003cbr /\u003econnects customers to the worlds best talent for both technical and \u003cbr /\u003enon-technical contracting. But we dont just find the best; we also provide the \u003cbr /\u003esoftware tools, training, and expert management to ensure success for long-term \u003cbr /\u003egrowth.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eJob Description:\u003cbr /\u003e\u003cbr /\u003eCrossover is looking for Software Engineering Managers with UWP experience who \u003cbr /\u003edemonstrate outstanding managerial skills as well as the technical background \u003cbr /\u003eto deeply understand the code their teams are developing. You will be expected \u003cbr /\u003eto demonstrate both a mastery of the technical skills associated with the \u003cbr /\u003eprojects at hand, as well as the managerial ability to motivate, build, and \u003cbr /\u003emonitor your team. Specifically, you will be responsible for overseeing from 4 \u003cbr /\u003eto 6 teams of 3 to 4 individuals. You will own the process of breaking \u003cbr /\u003especifications created by the product management team into clear tasks and \u003cbr /\u003etimelines, as well as assembling the results into high value, reusable \u003cbr /\u003ecomponents. Under your leadership, we expect to see consistent improvement in \u003cbr /\u003eboth static code quality metrics and weekly production.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualities:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eRuthless commitment to impeccable code quality\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eDeep understanding of a wide range of the latest technologies and \u003cbr /\u003earchitectural approaches\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAdvanced proficiency in C# programming language, related frameworks and best \u003cbr /\u003epractices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eThe ability to make appropriate technical decisions, review design and code, \u003cbr /\u003eand ensure best technical practices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to hands-on engagement as an individual within the team, despite \u003cbr /\u003emanagerial status\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eWillingness to embrace iterative development as the means for building \u003cbr /\u003eseamless products\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003ePerfectionism: knowing how a job should be done and not stop until its done \u003cbr /\u003ecorrectly\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExceptional ability to effectively motivate and manage teams of individuals\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to increasing efficiency in the workplace by continuously \u003cbr /\u003eautomating parts of the software engineering process\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExcellent remote management skills (you will be using Skype, GoToMeeting, \u003cbr /\u003eGoogle Docs, etc.)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eRequired Skills and Experience:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualifications:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBachelor\u0027s degree in Computer Science, Computer Engineering, or Electrical \u003cbr /\u003eEngineering\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProven managerial skills with at least 8 years of experience\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003e2 years of experience in hands-on UWP (Universal Windows Platform) application \u003cbr /\u003edevelopment\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience with Cloud architecture and DevOps\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAt least 5 years of experience in managing .NET application development teams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in Agile, SDLC, or SLA\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in AWS and TDD is desired but not mandatory\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eOutstanding English communication skills\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eTotal compensation: $70/hr for 40 productive hours per week\u003cbr /\u003e\u003cbr /\u003eLocation: Global (remote)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWere one of the few legitimate companies offering high-paying jobs that are \u003cbr /\u003e100% remote, work from home. You never have to fight traffic to the office \u003cbr /\u003eagain and you have the freedom to choose when and where you put in your 40 \u003cbr /\u003ehours to be most effective each week.",
    "urlFetchPending": false,
    "published": "Jan 19, 2017 3:10:45 AM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "remoteok.io-dev",
    "url": "https://remoteok.io/jobs/20944",
    "title": "Software Engineering Manager",
    "content": "If you are an elite Software Engineering Manager with Universal Windows \u003cbr /\u003ePlatform expertise eager to gain unprecedented visibility to the top technology \u003cbr /\u003ecompanies throughout the globe, employ your technical and managerial skills to \u003cbr /\u003eoversee cutting-edge software in a high-intensity environment, and earn \u003cbr /\u003e$140,000 USD per year while working from virtually anywhere on the planet, this \u003cbr /\u003ejob is for you.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThe Company:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Crossover is a well-funded startup that has developed a unique way to find, \u003cbr /\u003ecurate and manage the top 1% of global talent and connect them to medium and \u003cbr /\u003elarge businesses. We are experiencing rapid growth within the companies we \u003cbr /\u003ecurrently serve and are increasing our staff to expand our business.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Brick and mortar offices are history. The future of our global workforce will \u003cbr /\u003econsist of teams collaborating from every corner of the world. Our platform \u003cbr /\u003econnects customers to the worlds best talent for both technical and \u003cbr /\u003enon-technical contracting. But we dont just find the best; we also provide the \u003cbr /\u003esoftware tools, training, and expert management to ensure success for long-term \u003cbr /\u003egrowth.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eJob Description:\u003cbr /\u003e\u003cbr /\u003eCrossover is looking for Software Engineering Managers with UWP experience who \u003cbr /\u003edemonstrate outstanding managerial skills as well as the technical background \u003cbr /\u003eto deeply understand the code their teams are developing. You will be expected \u003cbr /\u003eto demonstrate both a mastery of the technical skills associated with the \u003cbr /\u003eprojects at hand, as well as the managerial ability to motivate, build, and \u003cbr /\u003emonitor your team. Specifically, you will be responsible for overseeing from 4 \u003cbr /\u003eto 6 teams of 3 to 4 individuals. You will own the process of breaking \u003cbr /\u003especifications created by the product management team into clear tasks and \u003cbr /\u003etimelines, as well as assembling the results into high value, reusable \u003cbr /\u003ecomponents. Under your leadership, we expect to see consistent improvement in \u003cbr /\u003eboth static code quality metrics and weekly production.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualities:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eRuthless commitment to impeccable code quality\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eDeep understanding of a wide range of the latest technologies and \u003cbr /\u003earchitectural approaches\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAdvanced proficiency in C# programming language, related frameworks and best \u003cbr /\u003epractices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eThe ability to make appropriate technical decisions, review design and code, \u003cbr /\u003eand ensure best technical practices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to hands-on engagement as an individual within the team, despite \u003cbr /\u003emanagerial status\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eWillingness to embrace iterative development as the means for building \u003cbr /\u003eseamless products\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003ePerfectionism: knowing how a job should be done and not stop until its done \u003cbr /\u003ecorrectly\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExceptional ability to effectively motivate and manage teams of individuals\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to increasing efficiency in the workplace by continuously \u003cbr /\u003eautomating parts of the software engineering process\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExcellent remote management skills (you will be using Skype, GoToMeeting, \u003cbr /\u003eGoogle Docs, etc.)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eRequired Skills and Experience:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualifications:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBachelor\u0027s degree in Computer Science, Computer Engineering, or Electrical \u003cbr /\u003eEngineering\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProven managerial skills with at least 8 years of experience\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003e2 years of experience in hands-on UWP (Universal Windows Platform) application \u003cbr /\u003edevelopment\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience with Cloud architecture and DevOps\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAt least 5 years of experience in managing .NET application development teams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in Agile, SDLC, or SLA\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in AWS and TDD is desired but not mandatory\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eOutstanding English communication skills\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eTotal compensation: $70/hr for 40 productive hours per week\u003cbr /\u003e\u003cbr /\u003eLocation: Global (remote)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWere one of the few legitimate companies offering high-paying jobs that are \u003cbr /\u003e100% remote, work from home. You never have to fight traffic to the office \u003cbr /\u003eagain and you have the freedom to choose when and where you put in your 40 \u003cbr /\u003ehours to be most effective each week.",
    "urlFetchPending": false,
    "published": "Jan 19, 2017 3:10:45 AM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/53675/uk-based-technical-director-online-travel-at-sploor/",
    "title": "UK Based Technical Director - Online Travel",
    "content": "We are Sploor, a new travel booking site for flights, hotels and package holidays on monthly payment plans. By spreading the cost of travel over time we are helping people to more comfortably manage the costs of a family trip, book their dream honeymoon, or take the adventure of a lifetime. \u003cbr /\u003e\u003cbr /\u003eWe are a funded, post revenue startup looking to bolster our team and seize the huge opportunity that lays ahead of us.\u003cbr /\u003e\u003cbr /\u003eWe are looking for a technical director to join our growing team in our London office and completely own the technical side of our business. We are offering £60k-£70k based on experience and stock options available after the initial period.\u003cbr /\u003e\u003cbr /\u003eOur future technical director will be passionate about startups and able to implement technical processes and best practises, as well leading technically in all areas of the business. You will be proficient in Python, working directly with our senior software developer to edit our existing codebase and write new code, and you will be an expert in at least one other major server side language, as well as HTML, CSS, AngularJS and Javascript. \u003cbr /\u003e\u003cbr /\u003eWe love self-starters who share our vision and are motivated by the excitement of building awesome tech and driving the business forward, seeing progress day by day. You will work closely with the our developers and cofounders, ensuring that we meet all technical deadlines and achieve key milestones to drive the business forward. \u003cbr /\u003e\u003cbr /\u003eYou have a minimum of 10 years experience working in web and are:\u003cbr /\u003e\u003cbr /\u003e* Well organised and run a tight ship\u003cbr /\u003e* Focussed and single minded in the pursuit of our goals\u003cbr /\u003e* Able to communicate effectively to stakeholders throughout the business \u003cbr /\u003e* A doer with a problem solving attitude\u003cbr /\u003e\u003cbr /\u003eWe are absolutely thrilled to be looking for the next great member of our team and look forward to receiving your applications!",
    "urlFetchPending": false,
    "published": "Jan 25, 2017 6:54:44 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/53150/vp-of-engineeringcto-at-pogoseat/",
    "title": "VP of Engineering/CTO",
    "content": "Description:\u003cbr /\u003eWe are looking for someone who can manage a growing team and associated technology. This person will have a clear understanding of how the various moving parts fit together, their dependencies, and be able to prioritise accordingly.\u003cbr /\u003e\u003cbr /\u003eWhy work with us?\u003cbr /\u003eWe\u0027re changing the world, one upgrade at a time! If you love sports, concerts, outstanding technology, smart and humble teammates, then this is the place for you. We\u0027re a meritocracy and we care about doing the right thing, learning everyday and enjoying the journey. Our vision is to help fans upgrade anywhere and anytime, be it a Giants game in San Francisco, a Manchester United game in England or a cricket match in India.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eResponsibilities:\u003cbr /\u003e•    Manage architecture across the stack, from database to native apps.\u003cbr /\u003e•    Manage the team sprints, employing agile best practices.\u003cbr /\u003e•    Work with external partners and vendors to align development and deliverables.\u003cbr /\u003e•    Work with product management, business development, and design to prioritise projects and tasks.\u003cbr /\u003e•    Work with engineering to monitor and maintain production stability, anticipating and planning for peak traffic spikes.\u003cbr /\u003e\u003cbr /\u003eRequirements:\u003cbr /\u003e•    Experience writing code-day-today (React, .NET)\u003cbr /\u003e•    Experience with LAMP stack (Apache, MySQL, PHP).\u003cbr /\u003e•    Experience with Memcached.\u003cbr /\u003e•    Experience with Redis.\u003cbr /\u003e•    Experience with Jenkins.\u003cbr /\u003e•    Experience with HTML5/CSS3/Javascript/SOAP\u003cbr /\u003e•    Experience working with large, scalable systems.\u003cbr /\u003e•    REST services and best practices.\u003cbr /\u003e•    B.S./M.S. CS or equivalent.\u003cbr /\u003e\u003cbr /\u003eNice to have:\u003cbr /\u003e•    Phonegap.\u003cbr /\u003e•    iOS/Android development.\u003cbr /\u003e•    Kohana PHP\u003cbr /\u003e•    Backbone JS\u003cbr /\u003e•    JQuery Mobile",
    "urlFetchPending": false,
    "published": "Jan 10, 2017 1:49:34 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "jobs.remotive.io",
    "url": "http://automattic.com/work-with-us/mobile-developer/",
    "title": "Mobile Developer at Automattic, Located Anywhere, engineering",
    "content": "Mobile Developer — Automattic \u003cbr /\u003eAutomattic \u003c\u003e\u003cbr /\u003e\u003cbr /\u003e * Home \u003c\u003e \u003cbr /\u003e * About Us \u003c\u003e \u003cbr /\u003e * News \u003c\u003e \u003cbr /\u003e * Work With Us \u003c\u003e \u003cbr /\u003eMobile Developer\u003cbr /\u003e\u003cbr /\u003eTake WordPress and other Automattic projects to phones and tablets by \u003cbr /\u003edeveloping Open Source mobile apps and the systems that power them. Work on \u003cbr /\u003efuture versions of WordPress, Simplenote, and other native apps for iOS and \u003cbr /\u003eAndroid. The kinds of people we’re looking for have:\u003cbr /\u003e\u003cbr /\u003e * Strong programming skills in Swift, Java, Objective-C, with deep knowledge \u003cbr /\u003eof development for iOS and/or Android. \u003cbr /\u003e * Substantial mobile experience developing user interfaces, low-level systems \u003cbr /\u003e(like storage and networking), or both. \u003cbr /\u003e * Experience developing and launching at least one high quality app. \u003cbr /\u003e * Familiarity with backend technologies and how to interface with \u003cbr /\u003ethem. Backend development experience is a plus. \u003cbr /\u003e * Opinionated about products, with good user experience instincts. \u003cbr /\u003eHow to Apply\u003cbr /\u003e Does this sound interesting? If yes, please send a short email to jobs @ this \u003cbr /\u003edomain telling us about yourself and attach a résumé. Let us know what you can \u003cbr /\u003econtribute to the team. Include the title of the position you’re applying for \u003cbr /\u003eand your name in the subject. Proofread! Make sure you spell and capitalize \u003cbr /\u003eWordPress and Automattic correctly. We are lucky to receive hundreds of \u003cbr /\u003eapplications for every position, so try to make your application stand out. If \u003cbr /\u003eyou apply for multiple positions or send multiple emails there will be one \u003cbr /\u003ereply. If you\u0027re reading this on a site other than automattic.com please make \u003cbr /\u003esure you visit automattic.com/work-with-us for the latest details on applying.\u003cbr /\u003e← Work With Us \u003c\u003e\u003cbr /\u003e\u003cbr /\u003eAll Jobs Require\u003cbr /\u003e\u003cbr /\u003e * Great communication skills. We’re a distributed company, so frequent and \u003cbr /\u003eclear written communication is a must. \u003cbr /\u003e * Self-driven work ethic. All our developers are experienced and work with \u003cbr /\u003eminimal supervision. You need to be a self-starter who loves taking initiative \u003cbr /\u003eand seeing things through to completion. \u003cbr /\u003e * Curiosity and the desire to learn. Our business is changing and growing \u003cbr /\u003efast. Flexibility is key. Contact Us \u003c\u003e Press \u003c\u003e Privacy Policy \u003c\u003e  \u003cbr /\u003e\u003chttps://twitter.com/automattic\u003e  \u003chttp://www.facebook.com/AutomatticInc\u003e  \u003cbr /\u003e\u003chttps://www.youtube.com/c/automattic\u003e \u003cbr /\u003e * Home \u003c\u003e \u003cbr /\u003e * About Us \u003c\u003e \u003cbr /\u003e * News \u003c\u003e \u003cbr /\u003e * Work With Us \u003c\u003e \u003cbr /\u003e© Automattic Inc., purveyors of fine blogging services since 2005. Thank you \u003cbr /\u003efor your time.",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "jobs.remotive.io",
    "url": "http://thegadgetflow.com/apply/",
    "title": "iOS Developer  at The Gadget Flow, Located anywhere, engineering",
    "content": "We Are Hiring » The Gadget Flow  \u003cbr /\u003e\u003chttps://plus.google.com/105544310191860439944?rel\u003dauthor\u003e  \u003cbr /\u003e\u003chttp://thegadgetflow.com/apply/\u003e \u003cbr /\u003eWe Are Hiring » The Gadget Flow\u003cbr /\u003e \u003chttp://thegadgetflow.com/apply/\u003e  \u003chttp://thegadgetflow.com\u003e \u003cbr /\u003e * Categories  \u003chttp://thegadgetflow.com/explore/\u003e \u003cbr /\u003e * Apple Accessories \u003c\u003e \u003cbr /\u003e * Apple Watch Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/apple-watch-accessories/\u003e \u003cbr /\u003e * iPhone 7 Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/iphone-accessories/iphone7-accessories/\u003e\u003cbr /\u003e * Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/iphone-accessories/iphone7-accessories/accessories-iphone7-accessories/\u003e\u003cbr /\u003e * Cases \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/iphone-accessories/iphone7-accessories/cases/\u003e\u003cbr /\u003e * iPhone 6/6s Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/iphone-6-accessories-cases-stands/\u003e\u003cbr /\u003e * Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/iphone-6-accessories-cases-stands/accessories/\u003e\u003cbr /\u003e * Cases \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/iphone-6-accessories-cases-stands/iphone-6-cases/\u003e\u003cbr /\u003e * iPhone SE/5s \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/iphone-accessories/iphone5-cases/\u003e \u003cbr /\u003e * iPad Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/ipad-accessories/\u003e \u003cbr /\u003e * iPad Cases \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/ipad-accessories/ipad-cases/\u003e \u003cbr /\u003e * iPad Mounts \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/ipad-accessories/ipad-mounts/\u003e \u003cbr /\u003e * iPad Stands \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/ipad-accessories/ipad-stands/\u003e \u003cbr /\u003e * Mac Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/mac-accessories/\u003e \u003cbr /\u003e * MacBook \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/mac-accessories/macbook/\u003e \u003cbr /\u003e * iMac \u003chttp://thegadgetflow.com/portfolio/category/mac-accessories/imac/\u003e \u003cbr /\u003e * Laptop Stickers \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/top-decals/laptop-stickers/\u003e \u003cbr /\u003e * Other \u003chttp://thegadgetflow.com/portfolio/category/mac-accessories/other/\u003e \u003cbr /\u003e * CES 2017 \u003chttp://thegadgetflow.com/portfolio/category/ces-2017/\u003e \u003cbr /\u003e * Crowdfunding Projects \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/crowdfunding-projects/\u003e \u003cbr /\u003e * For Men \u003chttp://thegadgetflow.com/portfolio/category/mens/\u003e \u003cbr /\u003e * Bags \u0026 Backpacks \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/bags-backpacks/\u003e \u003cbr /\u003e * Grooming \u003chttp://thegadgetflow.com/portfolio/category/mens/grooming/\u003e \u003cbr /\u003e * Wallets and Card Holders \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/wallets-card-holders/\u003e \u003cbr /\u003e * Watches for Him \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/fancy-watches/for-him/\u003e \u003cbr /\u003e * View All Products \u003chttp://thegadgetflow.com/portfolio/category/mens/\u003e \u003cbr /\u003e * For Women \u003chttp://thegadgetflow.com/portfolio/category/womans/\u003e \u003cbr /\u003e * Bags \u0026 Backpacks \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/bags-backpacks/\u003e \u003cbr /\u003e * Jewelry Corner \u003chttp://thegadgetflow.com/portfolio/category/jewelry-corner/\u003e\u003cbr /\u003e * Watches for Her \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/fancy-watches/for-her/\u003e \u003cbr /\u003e * View All Products \u003chttp://thegadgetflow.com/portfolio/category/womans/\u003e \u003cbr /\u003e * Geeky Gadgets \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/gadgets-for-geeks/\u003e \u003cbr /\u003e * Gamers Gadgets \u003chttp://thegadgetflow.com/portfolio/category/gamers-gadgets/\u003e\u003cbr /\u003e * Star Wars Goodies \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/star-wars-goodies/\u003e \u003cbr /\u003e * Superheroes \u003chttp://thegadgetflow.com/portfolio/category/superheroes/\u003e \u003cbr /\u003e * View All Products \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/gadgets-for-geeks/\u003e \u003cbr /\u003e * Home Accessories \u003chttp://thegadgetflow.com/portfolio/category/home/\u003e \u003cbr /\u003e * Bathing Must Haves \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/bathing-must-haves/\u003e \u003cbr /\u003e * Bedtime \u003chttp://thegadgetflow.com/portfolio/category/bedtime/\u003e \u003cbr /\u003e * Creative Bookcases \u003chttp://thegadgetflow.com/portfolio/category/bookcases/\u003e \u003cbr /\u003e * Creative Clocks \u003chttp://thegadgetflow.com/portfolio/category/clocks/\u003e \u003cbr /\u003e * Dining Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/dining-accessories/\u003e \u003cbr /\u003e * Eco-friendly \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/eco-friendly-necessities/\u003e \u003cbr /\u003e * Home Media \u003chttp://thegadgetflow.com/portfolio/category/home-media/\u003e \u003cbr /\u003e * Modern Furniture \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/modernistic-furniture/\u003e \u003cbr /\u003e * Party Must Haves \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/party-must-have-products/\u003e \u003cbr /\u003e * Pet Accessories \u003chttp://thegadgetflow.com/portfolio/category/for-pets/\u003e \u003cbr /\u003e * Prints and Posters \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/print-and-posters/\u003e \u003cbr /\u003e * Storage and Organization \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/storage-organization-products/\u003e \u003cbr /\u003e * Wall Decals \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/top-decals/wall-decals-top-decals/\u003e\u003cbr /\u003e * Wine Enthusiasts \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/wine-enthusiasts/\u003e \u003cbr /\u003e * Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/wine-enthusiasts/accessories-wine-enthusiasts/\u003e\u003cbr /\u003e * Decanters \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/wine-enthusiasts/decanters/\u003e \u003cbr /\u003e * Glasses \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/wine-enthusiasts/glasses/\u003e \u003cbr /\u003e * View All Products \u003chttp://thegadgetflow.com/portfolio/category/home/\u003e \u003cbr /\u003e * Kitchen Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/kitchen-gadgets/\u003e \u003cbr /\u003e * Baking Must Haves \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/baking-must-have-products/\u003e \u003cbr /\u003e * Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/baking-must-have-products/accessories-breakfast-club/\u003e\u003cbr /\u003e * Cutters \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/baking-must-have-products/cutters/\u003e\u003cbr /\u003e * Breakfast Club \u003chttp://thegadgetflow.com/portfolio/category/breakfast-club/\u003e\u003cbr /\u003e * Coffee Club \u003chttp://thegadgetflow.com/portfolio/category/coffee-club/\u003e \u003cbr /\u003e * Coffee Mugs \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/coffee-club/coffee-mugs/\u003e \u003cbr /\u003e * Tea Time Products \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/tea-time-products/\u003e \u003cbr /\u003e * Cups \u003chttp://thegadgetflow.com/portfolio/category/tea-time-products/cups/\u003e \u003cbr /\u003e * Infusers \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/tea-time-products/infusers/\u003e \u003cbr /\u003e * Tea Makers \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/tea-time-products/tea-makers/\u003e \u003cbr /\u003e * View All Products \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/kitchen-gadgets/\u003e \u003cbr /\u003e * Luxurious Products \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/luxurious-products/\u003e \u003cbr /\u003e * Music Enthusiasts \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/music-enthusiasts/\u003e \u003cbr /\u003e * Headphones \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/headphones-speakers-sound-gadgets/headphones/\u003e\u003cbr /\u003e * Speakers \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/headphones-speakers-sound-gadgets/speakers/\u003e\u003cbr /\u003e * View All Products \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/music-enthusiasts/\u003e \u003cbr /\u003e * Office Gadgets \u003chttp://thegadgetflow.com/portfolio/category/office/\u003e \u003cbr /\u003e * Bags \u0026 Backpacks \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/bags-backpacks/\u003e \u003cbr /\u003e * Corporate Gifts \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/corporate-gifts/\u003e \u003cbr /\u003e * Notebooks \u003chttp://thegadgetflow.com/portfolio/category/notebooks/\u003e \u003cbr /\u003e * USB Flash Drives \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/usb-flash-drives/\u003e \u003cbr /\u003e * Work Desks \u003chttp://thegadgetflow.com/portfolio/category/work-desks/\u003e \u003cbr /\u003e * Workspace Gadgets \u003chttp://thegadgetflow.com/portfolio/category/workspace/\u003e \u003cbr /\u003e * View All Products \u003chttp://thegadgetflow.com/portfolio/category/office/\u003e \u003cbr /\u003e * Photography Gadgets \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/photography-gadgets/\u003e \u003cbr /\u003e * DSLR Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/photography-gadgets/dslr-accessories/\u003e\u003cbr /\u003e * GoPro Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/photography-gadgets/gopro-accessories/\u003e\u003cbr /\u003e * iPhone Lens \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/photography-gadgets/iphone-lens/\u003e \u003cbr /\u003e * View All Products \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/photography-gadgets/\u003e \u003cbr /\u003e * Products for Parents \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/products-parents/\u003e \u003cbr /\u003e * Kids Corner \u003chttp://thegadgetflow.com/portfolio/category/gadgets-kids/\u003e \u003cbr /\u003e * View All Products \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/products-parents/\u003e \u003cbr /\u003e * Summer Must Haves \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/summer-must-haves/\u003e \u003cbr /\u003e * Fun at the Beach \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/fun-at-the-beach/\u003e \u003cbr /\u003e * Pool Stuff \u003chttp://thegadgetflow.com/portfolio/category/pool-stuff/\u003e \u003cbr /\u003e * View All Products \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/summer-must-haves/\u003e \u003cbr /\u003e * Sports \u0026 Outdoors \u003c\u003e \u003cbr /\u003e * BBQ Equipment \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/bbq-barbecue-equipment/\u003e \u003cbr /\u003e * Camping Gear \u003chttp://thegadgetflow.com/portfolio/category/camping-gear/\u003e \u003cbr /\u003e * Garden \u003chttp://thegadgetflow.com/portfolio/category/garden/\u003e \u003cbr /\u003e * Health \u003chttp://thegadgetflow.com/portfolio/category/health/\u003e \u003cbr /\u003e * Sports Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/sports-gadgets/\u003e \u003cbr /\u003e * Bike Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/bike-accessories/\u003e \u003cbr /\u003e * View All Products \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/sports-gadgets/\u003e \u003cbr /\u003e * Technology Products \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/all-things-tech/\u003e \u003cbr /\u003e * 3D Printing \u003chttp://thegadgetflow.com/portfolio/category/3d-printing/\u003e \u003cbr /\u003e * Printers \u003chttp://thegadgetflow.com/portfolio/category/3d-printing/printers/\u003e\u003cbr /\u003e * Prints \u003chttp://thegadgetflow.com/portfolio/category/3d-printing/prints/\u003e \u003cbr /\u003e * Drones \u003chttp://thegadgetflow.com/portfolio/category/drone/\u003e \u003cbr /\u003e * Power Banks \u003chttp://thegadgetflow.com/portfolio/category/power-banks/\u003e \u003cbr /\u003e * Samsung Accessories \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/samsung-accessories/\u003e \u003cbr /\u003e * Smart Home Products \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/smart-home/\u003e \u003cbr /\u003e * HomeKit Compatible \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/smart-home/homekit-compatible/\u003e \u003cbr /\u003e * Home Security \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/smart-home/home-security/\u003e \u003cbr /\u003e * Lights \u0026 Plugs \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/smart-home/lights-plugs/\u003e \u003cbr /\u003e * Smart Locks \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/smart-home/smart-locks/\u003e \u003cbr /\u003e * Thermostats \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/smart-home/thermostats/\u003e \u003cbr /\u003e * Smart Living \u003chttp://thegadgetflow.com/portfolio/category/smart-living/\u003e \u003cbr /\u003e * Robots \u003chttp://thegadgetflow.com/portfolio/category/robots/\u003e \u003cbr /\u003e * Vacuums \u003chttp://thegadgetflow.com/portfolio/category/robots/vacuums/\u003e \u003cbr /\u003e * Wearable Tech \u003chttp://thegadgetflow.com/portfolio/category/wearable-tech/\u003e \u003cbr /\u003e * Activity Trackers \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/wearable-tech/activity-trackers/\u003e \u003cbr /\u003e * Smartwatches \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/wearable-tech/smart-watches/\u003e \u003cbr /\u003e * Virtual Reality \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/wearable-tech/virtual-reality/\u003e \u003cbr /\u003e * View All Products \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/all-things-tech/\u003e \u003cbr /\u003e * Travel Must Haves \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/travel-musts/\u003e \u003cbr /\u003e * Suitcases \u003chttp://thegadgetflow.com/portfolio/category/suitcases/\u003e \u003cbr /\u003e * View All Products \u003cbr /\u003e\u003chttp://thegadgetflow.com/portfolio/category/travel-musts/\u003e \u003cbr /\u003e * View All Categories \u003chttp://thegadgetflow.com/explore/\u003e \u003cbr /\u003e * Products We  \u003chttp://thegadgetflow.com/portfolio/category/recommended/\u003e \u003cbr /\u003e * For You \u003chttp://thegadgetflow.com/create-your-feed/\u003e \u003cbr /\u003e * Discounts \u003chttp://thegadgetflow.com/discounts/\u003e \u003cbr /\u003e * More Discounts \u003chttp://thegadgetflow.com/discounts/\u003e Blog \u003cbr /\u003e\u003chttp://thegadgetflow.com/blog\u003e About Us \u003chttp://thegadgetflow.com/about-us/\u003e \u003cbr /\u003eContact Us \u003chttp://thegadgetflow.com/contact/\u003e Subscribe \u003cbr /\u003e\u003chttp://thegadgetflow.com/newsletter/\u003e Get the Apps \u003cbr /\u003e\u003chttp://thegadgetflow.com/ios-android-app/\u003e FAQ \u003cbr /\u003e\u003chttp://faq.thegadgetflow.com/getting-started/frequently-asked-questions\u003e Help \u003cbr /\u003eCenter \u003chttp://faq.thegadgetflow.com/\u003e Add My Product \u003cbr /\u003e\u003chttps://thegadgetflow.com/submit/\u003e We Are Hiring \u003cbr /\u003e\u003chttp://thegadgetflow.com/apply/\u003e Status \u003chttp://status.thegadgetflow.com\u003e \u003cbr /\u003ePress \u0026 Media \u003chttp://thegadgetflow.com/press/\u003e Terms of Use \u003cbr /\u003e\u003chttp://thegadgetflow.com/terms-of-use/\u003e \u003cbr /\u003e * Notification: THETA Icarus Automatic Watch Learn More \u003cbr /\u003e\u003chttp://gdfl.us/thetawatches\u003e.1 hour\u003cbr /\u003e * Notification: GearEye Gear Management System Learn More \u003cbr /\u003e\u003chttp://gdfl.us/GearEye\u003e.1 day\u003cbr /\u003e * Notification: Scollar Mini Smart Pet Collar Learn More \u003cbr /\u003e\u003chttp://gdfl.us/SmartCollar\u003e.5 days\u003cbr /\u003e * Notification: Firefly2 Luxury Vaporizer Learn More \u003chttp://gdfl.us/firefly\u003e.\u003cbr /\u003e6 days\u003cbr /\u003e * Notification: Justin Case Lightweight Kayak Learn More \u003cbr /\u003e\u003chttp://gdfl.us/jKayak\u003e.6 days\u003cbr /\u003e * Notification: Recon 15 Active Backpack Learn More \u003chttp://gdfl.us/recon\u003e.1 \u003cbr /\u003eweek\u003cbr /\u003e * Notification: Orsden Slope Ski Pants Learn More \u003chttp://gdfl.us/Orsden\u003e.1 \u003cbr /\u003eweek\u003cbr /\u003e * Notification: Manaslu Athletics Casual Activewear Learn More \u003cbr /\u003e\u003chttp://gdfl.us/Manaslu\u003e.2 weeks\u003cbr /\u003e * Notification: CELLO Smartphone Battery Stand Learn More \u003cbr /\u003e\u003chttp://gdfl.us/CELLO\u003e.2 weeks\u003cbr /\u003e * Notification: The Edge Desk Ergonomic Workspace Learn More \u003cbr /\u003e\u003chttp://gdfl.us/Edge\u003e.2 weeks\u003cbr /\u003e * Notification: NIFTYX Wearable Power Bank Learn More \u003chttp://gdfl.us/NIFTYX\u003e.\u003cbr /\u003e2 weeks\u003cbr /\u003e * Notification: Chameleon Pens Color Tops Learn More \u003cbr /\u003e\u003chttp://gdfl.us/Chameleon\u003e.2 weeks\u003cbr /\u003e * Notification: MAGQI Magnetic Qi Charger Learn More \u003chttp://gdfl.us/MAGQI\u003e.3 \u003cbr /\u003eweeks\u003cbr /\u003e * Notification: The GPSmyCity GPS-Enabled Travel Articles Makes Travel a \u003cbr /\u003eBreezeLearn More \u003chttp://gdfl.us/GPSmyCity\u003e.3 weeks\u003cbr /\u003e * Notification: babocush Newborn Comfort Cushion Learn More \u003cbr /\u003e\u003chttp://gdfl.us/babocush\u003e.3 weeks\u003cbr /\u003e * Notification: Spyn Decision Spinning Top Learn More \u003chttp://gdfl.us/spyn\u003e.4 \u003cbr /\u003eweeks\u003cbr /\u003e * Notification: Dr.MUSIC 3 Wireless TENS Massager Learn More \u003cbr /\u003e\u003chttp://gdfl.us/drmusic\u003e.4 weeks\u003cbr /\u003e * Notification: iGrow Hair Growth System Learn More \u003chttp://gdfl.us/iGrow\u003e.4 \u003cbr /\u003eweeks\u003cbr /\u003e * Notification: AuraGlow Home Teeth Whitening System Learn More \u003cbr /\u003e\u003chttp://gdfl.us/AuraGlow\u003e.4 weeks\u003cbr /\u003e * Notification: Moonlite - Bedtime Story Projector for Your Mobile Phone \u003cbr /\u003eLearn More \u003chttp://gdfl.us/Moonlite\u003e.4 weeks0 Sign In \u003cbr /\u003e * CALL US +1 (315) 401-4173  \u003chttp://thegadgetflow.com\u003e \u003cbr /\u003e * \u003cbr /\u003e * Sign In \u003cbr /\u003e\u003chttp://thegadgetflow.com/wp-login.php?redirect\u003dhttp://thegadgetflow.com/apply/\u003e\u003cbr /\u003e * Home \u003chttp://thegadgetflow.com\u003e \u003cbr /\u003e * Categories \u003chttp://thegadgetflow.com/explore/\u003e \u003cbr /\u003e * Products We Love \u003chttp://thegadgetflow.com/portfolio/category/recommended/\u003e \u003cbr /\u003e * For You \u003chttp://thegadgetflow.com/create-your-feed/\u003e \u003cbr /\u003e * Discounts \u003chttp://thegadgetflow.com/discounts/\u003e \u003cbr /\u003e * About Us \u003chttp://thegadgetflow.com/about-us/\u003e \u003cbr /\u003e * Contact Us \u003chttp://thegadgetflow.com/contact/\u003e \u003cbr /\u003e * Get the Apps \u003chttp://thegadgetflow.com/ios-android-app/\u003e \u003cbr /\u003e * Add My Product \u003chttps://thegadgetflow.com/submit/\u003e \u003cbr /\u003e * Blog \u003chttp://thegadgetflow.com/blog/\u003e \u003cbr /\u003e * Help Center \u003c\u003e \u003cbr /\u003e * We are Hiring \u003chttp://thegadgetflow.com/apply/\u003e Join Gadget Flow Today For \u003cbr /\u003eFree Login Login with facebook  \u003cbr /\u003e\u003chttp://thegadgetflow.com/wp-login.php?apsl_login_id\u003dfacebook_login\u0026state\u003dcmVkaXJlY3RfdG89aHR0cCUzQSUyRiUyRnRoZWdhZGdldGZsb3cuY29tJTJGYXBwbHklMkY\u003d\u003e\u003cbr /\u003eor Login \u003cbr /\u003eDon\u0027t have an Account? Register Here\u003cbr /\u003e\u003cbr /\u003eForgot Your Password? Click Here\u003cbr /\u003eSend New Password \u003cbr /\u003eDon\u0027t have an Account? Register Here\u003cbr /\u003e\u003cbr /\u003eGo back to Login\u003cbr /\u003eSign Up \u003cbr /\u003eAlready Have an Account? Login Here\u003cbr /\u003e\u003cbr /\u003eDiscover, Save and Buy Awesome Products\u003cbr /\u003e\u003cbr /\u003e * Exclusive Discounts \u003cbr /\u003e * Create Your Wish List \u003cbr /\u003e * Customized Feed \u003cbr /\u003e * Curated Marketplace x \u003cbr /\u003eWe Are Hiring\u003cbr /\u003eLaunched in 2012 and based in New York, we are growing with 200% rate every \u003cbr /\u003eyear! Be part of our journey. \u003cbr /\u003eHere\u0027s What\u0027s in for you\u003cbr /\u003e\u003cbr /\u003e * Flexible Work Schedule \u003cbr /\u003e * Loose Vacation policy \u003cbr /\u003e * Work from Anywhere \u003cbr /\u003e * Amazon and iTunes Gift Cards \u003cbr /\u003eHere\u0027s what we are looking for\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eHEAD OF SALES\u003cbr /\u003eType \u003cbr /\u003eFull-time\u003cbr /\u003eRequirements \u003cbr /\u003eBasic Knowledge of Crowdfunding\u003cbr /\u003e\u003cbr /\u003e2+ Years of Experience\u003cbr /\u003e\u003cbr /\u003eBased in US or Canada\u003cbr /\u003e\u003cbr /\u003eExperienced with CRM Platforms\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eLIVE VIDEO REVIEWER\u003cbr /\u003eType \u003cbr /\u003ePart-time\u003cbr /\u003eRequirements \u003cbr /\u003eActive in Social Media\u003cbr /\u003e\u003cbr /\u003eEnglish Native Speaker\u003cbr /\u003e\u003cbr /\u003e1+ Year of Experience\u003cbr /\u003e\u003cbr /\u003eExperienced with Online Reviews\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eEDITORS\u003cbr /\u003eType \u003cbr /\u003eFull-time/Part-time\u003cbr /\u003eRequirements \u003cbr /\u003eFamiliar with Ecommerce\u003cbr /\u003e\u003cbr /\u003e1 Year of Experience\u003cbr /\u003e\u003cbr /\u003ePortfolio of 50+ Articles\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eANDROID DEVELOPER\u003cbr /\u003eType \u003cbr /\u003eFull-time/Part-time\u003cbr /\u003eRequirements \u003cbr /\u003e2+ Years of Experience\u003cbr /\u003e\u003cbr /\u003eHigh Level English Diploma\u003cbr /\u003e\u003cbr /\u003eAndroid Studio, Java, C/C++\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCUSTOMER SUPPORT\u003cbr /\u003eType \u003cbr /\u003eFull-time/Part-time\u003cbr /\u003eRequirements \u003cbr /\u003eAny College Degree\u003cbr /\u003e\u003cbr /\u003eHigh Level English Diploma\u003cbr /\u003e\u003cbr /\u003e1+ Year of Experience\u003cbr /\u003e\u003cbr /\u003eAdvanced Internet User\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAD MANAGER\u003cbr /\u003eType \u003cbr /\u003eFull-time/Part-time\u003cbr /\u003eRequirements \u003cbr /\u003eBA Marketing\u003cbr /\u003e\u003cbr /\u003eHigh Level English Diploma\u003cbr /\u003e\u003cbr /\u003e1+ Year of Experience\u003cbr /\u003e\u003cbr /\u003eFacebook and Google Ads\u003cbr /\u003e\u003cbr /\u003eFound your Role? Let’s Talk \u003d)\u003cbr /\u003e\u003cbr /\u003eWe\u0027d love to hear from you! Email us with some thoughts on what you\u0027re \u003cbr /\u003epassionate about\u003cbr /\u003eAPPLY \u003cmailto:hello@thegadgetflow.com?Subject\u003d\u003e \u003cbr /\u003eAbout\u003cbr /\u003eWhat is Gadget Flow? \u003chttp://thegadgetflow.com/about-us/\u003e Meet the Team \u003cbr /\u003e\u003chttp://thegadgetflow.com/about-us#aboutus\u003e Help Center \u003cbr /\u003e\u003chttp://faq.thegadgetflow.com\u003e Press \u0026 Media \u003chttp://thegadgetflow.com/press/\u003e \u003cbr /\u003ePlatform\u003cbr /\u003eProducts We Love \u003chttp://thegadgetflow.com/portfolio/category/recommended/\u003e \u003cbr /\u003eDiscounts \u0026 Deals \u003chttp://thegadgetflow.com/discounts/\u003e For You \u003cbr /\u003e\u003chttp://thegadgetflow.com/create-your-feed/\u003e Status \u003cbr /\u003e\u003chttp://status.thegadgetflow.com\u003e \u003cbr /\u003eAdvertise\u003cbr /\u003eAdd Your Product \u003chttps://thegadgetflow.com/submit/\u003e Affiliate ProgramNew \u003cbr /\u003e\u003chttp://thegadgetflow.com/affiliate/\u003e Get the Media Kit \u003cbr /\u003e\u003chttp://mediakit.thegadgetflow.com\u003e Case Studies \u003cbr /\u003e\u003chttp://faq.thegadgetflow.com/submit-your-product/case-studies\u003e \u003cbr /\u003eMore\u003cbr /\u003eContact Us \u003chttp://thegadgetflow.com/contact/\u003e Get the Apps \u003cbr /\u003e\u003chttp://thegadgetflow.com/ios-android-app/\u003e We are Hiring \u003cbr /\u003e\u003chttp://thegadgetflow.com/apply/\u003e Subscribe \u003cbr /\u003e\u003chttp://thegadgetflow.com/newsletter/\u003e As Seen On \u003cbr /\u003e * \u003cbr /\u003e * \u003cbr /\u003e * \u003cbr /\u003e * \u003cbr /\u003e * Terms of Use \u003chttp://thegadgetflow.com/terms-of-use/\u003e Privacy Policy \u003cbr /\u003e\u003chttp://thegadgetflow.com/privacy-policy/\u003e Sign In \u003cbr /\u003e\u003chttp://thegadgetflow.com/wp-login.php\u003e Register \u003cbr /\u003e\u003chttp://thegadgetflow.com/wp-login.php?action\u003dregister\u003e Lost Password \u003cbr /\u003e\u003chttp://thegadgetflow.com/wp-login.php?action\u003dlostpassword\u003e \u003cbr /\u003eAll Rights Reserved 2017 Gadget Flow™ Inc +1 (315) 401-4173 / Merrick, 11566 - \u003cbr /\u003emade with ♥ in New York\u003cbr /\u003e \u003chttps://facebook.com/thegadgetflow\u003e  \u003chttp://instagram.com/thegadgetflow\u003e  \u003cbr /\u003e\u003chttp://pinterest.com/thegadgetflow\u003e  \u003chttp://thegadgetflowofficial.tumblr.com\u003e \u003cbr /\u003e \u003chttps://twitter.com/thegadgetflow\u003e  \u003cbr /\u003e\u003chttps://plus.google.com/113557559154779688169/posts\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "jobs.remotive.io",
    "url": "http://corgibytes.com/careers/",
    "title": "Senior Code Whisperer at Corgibytes, U.S Remote, engineering",
    "content": "Corgibytes - Corgibytes Careers | Corgibytes \u003cimg height\u003d\"1\" width\u003d\"1\" \u003cbr /\u003estyle\u003d\"display:none\" \u003cbr /\u003esrc\u003d\"https://www.facebook.com/tr?id\u003d217019342072292\u0026amp;ev\u003dPageView\u0026amp;noscript\u003d1\"\u003e\u003cbr /\u003eCorgibytes \u003c\u003e  \u003c\u003e  \u003c\u003e \u003cbr /\u003e * About \u003c\u003e \u003cbr /\u003e * Approach \u003c\u003e \u003cbr /\u003e * Blog \u003c\u003e \u003cbr /\u003e * Talks \u003c\u003e \u003cbr /\u003e * Careers \u003c\u003e \u003cbr /\u003e * Contact \u003c\u003e Join Our Team \u003cbr /\u003eFull stack polyglots wanted.\u003cbr /\u003e\u003cbr /\u003eWhat\u0027s in it for you?\u003cbr /\u003e\u003cbr /\u003eWe get it. Making a move to a new employer is a big decision. So here are some \u003cbr /\u003eof the things you can expect from us. Questions?Just ask. \u003cbr /\u003e\u003cmailto:jobs@corgibytes.com\u003e\u003cbr /\u003e\u003cbr /\u003eWork Where \u0026 When You Want\u003cbr /\u003e\u003cbr /\u003eCorgibytes is set up as a distributed team. Our focus is on results, not \u003cbr /\u003emicromanagement. We use collaboration tools such asSlack \u003chttps://slack.com\u003e, \u003cbr /\u003eGithub \u003chttps://github.com/\u003e, Waffle.io \u003chttps://waffle.io/\u003e (along with an \u003cbr /\u003einternal tool we built called Einbot) to stay connected and give each team \u003cbr /\u003emember a high degree of autonomy.\u003cbr /\u003e\u003cbr /\u003eFlexible Full-Time Options\u003cbr /\u003e\u003cbr /\u003eWe understand that a 40-hour work week might not be the preferred work \u003cbr /\u003escenario for everyone. To provide additional flexibility, employees have the \u003cbr /\u003eoption to work 30, 40, or 50 hours per week and receive all benefits associated \u003cbr /\u003ewith full-time employment at Corgibytes. Your salary is adjusted accordingly on \u003cbr /\u003ea straight scale and you can also fluctuate your hours up and down throughout \u003cbr /\u003ethe year.\u003cbr /\u003e\u003cbr /\u003ePaid Professional Development\u003cbr /\u003e\u003cbr /\u003eMastering your craft shouldn’t be relegated to just nights and weekends. \u003cbr /\u003eThat’s why we’ve set up 10% time to help you focus on regular professional \u003cbr /\u003edevelopment during working hours. At Corgibytes, you can expect to spend about \u003cbr /\u003ethirty six hours per week on client work and four hours per week learning \u003cbr /\u003esomething new, such as taking an online class, learning a new programming \u003cbr /\u003elanguage, contributing to an open source project, blogging about your \u003cbr /\u003eexperiences, or building something interesting.\u003cbr /\u003e\u003cbr /\u003eOpen Paid Time Off\u003cbr /\u003e\u003cbr /\u003eLife happens. That’s why we’ve implemented a flexible paid time off policy so \u003cbr /\u003ethat employees can observe holidays, go on vacation, take time off for illness, \u003cbr /\u003eand manage family obligations based on what works for each individual. On \u003cbr /\u003eaverage, our team members take five weeks per year off.\u003cbr /\u003e\u003cbr /\u003eFocus on Health\u003cbr /\u003e\u003cbr /\u003eYes, we offer health insurance. We also go beyond by focusing on a low-stress \u003cbr /\u003eenvironment that promotes healthy living. We encourage each other to get plenty \u003cbr /\u003eof rest (including mid-day naps if needed), exercise, and eat well. We even \u003cbr /\u003eoffer a virtual yoga class to help us stay mindful and keep carpal tunnel \u003cbr /\u003esyndrome at bay.\u003cbr /\u003e\u003cbr /\u003ePrefer Contract Work?\u003cbr /\u003e\u003cbr /\u003eLike your 1099 status? No problem. We can structure your work arrangement in a \u003cbr /\u003eway that works for you. While you won’t get access to health insurance and will \u003cbr /\u003ebe responsible for purchasing your own equipment, we recognize that being an \u003cbr /\u003eindependent contractor just works better for some folks.\u003cbr /\u003e\u003cbr /\u003ePositions we\u0027re scouting for.\u003cbr /\u003e\u003cbr /\u003eAs a bootstrapped company, we\u0027re hiring developers based on client demand. We \u003cbr /\u003ehave a bunch of good sales leads at any given time, but the timing of when \u003cbr /\u003ewe\u0027re hiring might not be immediate. If you feel like you\u0027re a good candidate \u003cbr /\u003efor any of the positions listed below, still reach out. We\u0027ll rely on folks who \u003cbr /\u003ehave gotten in touch with us first before we turn to recruiters.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eLead Code Whisperer\u003cbr /\u003e\u003cbr /\u003eDoes reconstructing a database from the binary files without any documentation \u003cbr /\u003eso you can integrate it with a modern framework sound like a fun challenge? If \u003cbr /\u003eso, you’ve got the right attitude! You’re a seasoned developer and this ain’t \u003cbr /\u003eyour first rodeo. You may have lost count of how many languages you code in \u003cbr /\u003ebecause you’re always eager to try something new and are confident you could \u003cbr /\u003epick up a new language in a week or two. In your career, you’ve been the person \u003cbr /\u003ewho other people naturally go to for help. You have a service-oriented \u003cbr /\u003eapproach, enjoy mentoring, and like the idea of solving problems as a team as \u003cbr /\u003eopposed to going off and doing your own thing. You’ve never really liked being \u003cbr /\u003ecalled a “ninja” or “rockstar”, even though you are one.\u003cbr /\u003e\u003cbr /\u003eCorgibytes doesn’t have project managers, so you’ll also be responsible for \u003cbr /\u003einteracting with clients to help run projects, discuss budget, and prioritize \u003cbr /\u003etasks. Good written and verbal communication skills are a must. You’re adaptive \u003cbr /\u003ebecause each client is different. Some run on two week sprints and are \u003cbr /\u003ecomfortable with Scrum. Others do well with Kanban and Continuous Deployment. \u003cbr /\u003eYou get that the methodology is less important than the results, and will be \u003cbr /\u003ediligent about collecting retrospectives so the executive team can stay \u003cbr /\u003einformed and involved.\u003cbr /\u003e\u003cbr /\u003eSenior Code Whisperer\u003cbr /\u003e\u003cbr /\u003eMany of our clients come to us with complex architectural problems. As a \u003cbr /\u003eSenior Code Whisperer, you are able to work directly with a client to help them \u003cbr /\u003emigrate platforms, address security vulnerabilities, integrate with obscure \u003cbr /\u003esystems, and more. You absolutely love a challenge and are able to understand \u003cbr /\u003eand articulate the business value of technical choices.\u003cbr /\u003e\u003cbr /\u003eAs a full-stack polyglot programmer, you are comfortable with a wide range of \u003cbr /\u003etech stacks. If a project requires a stack you haven’t used before, your \u003cbr /\u003einstinct is to become eager, not intimidated. You regularly practice writing \u003cbr /\u003eclean code with Test Driven Development and document your rationale. You stay \u003cbr /\u003eup-to-date with industry best practices and are starting to contribute your \u003cbr /\u003ethoughts through blogs, stack overflow, presentations, etc. You are a mentor \u003cbr /\u003ewho loves helping other developers grow in their careers. You enjoy pair \u003cbr /\u003eprogramming and providing feedback through pull requests and code reviews.\u003cbr /\u003e\u003cbr /\u003eWe get asked these questions a lot.\u003cbr /\u003e\u003cbr /\u003eHow much would I get paid?\u003cbr /\u003e\u003cbr /\u003eWhile autonomy and the ability to work on interesting problems with other \u003cbr /\u003ehumble and brilliant engineers are our biggest benefits, we know that money \u003cbr /\u003ematters, too. Senior Developers earn $90,000 per year and Lead Developers earn \u003cbr /\u003e$110,000 per year. Yes, you’d usually see a range here, but we’ve implemented \u003cbr /\u003epay bands to help level the playing field and ensure our salaries are gender \u003cbr /\u003ebalanced. We noticed that men consistently asked for way more than women when \u003cbr /\u003eapplying, so we decided to take the salary negotiations off the table to make \u003cbr /\u003eit easier for everyone. If you’d like to earn more, it is also an option to \u003cbr /\u003ework 50 hours per week and earn 125% of your base salary.\u003cbr /\u003e\u003cbr /\u003eIs there a particular skill or language you\u0027re looking for?\u003cbr /\u003e\u003cbr /\u003eAlmost all of our projects use JavaScript in some form or another and we’re \u003cbr /\u003eseeing a trend towards folks wanting those frameworks (Angular, Node.js, Ember, \u003cbr /\u003eBackbone, etc.). The most popular language/framework that we get asked to work \u003cbr /\u003eon is Ruby on Rails, but we also have current needs with Python, C#/.NET, \u003cbr /\u003eGrails, and PHP.\u003cbr /\u003e\u003cbr /\u003eI live outside the United States. Can I still apply?\u003cbr /\u003e\u003cbr /\u003eMost of our team is currently on Eastern Time. One of our teammates lived in \u003cbr /\u003eHong Kong for a month, and while it worked, we noticed there was a significant \u003cbr /\u003edelay in communication that isn’t ideal. Given that, we’re giving preference to \u003cbr /\u003epeople close to our timezone but are absolutely open to being convinced \u003cbr /\u003eotherwise.\u003cbr /\u003e\u003cbr /\u003eAre you hiring junior developers?\u003cbr /\u003e\u003cbr /\u003eAs a small team, we’re building our core leadership first. This means that for \u003cbr /\u003ethe foreseeable future, we’ll need developers with lots of experience. We do \u003cbr /\u003ehave it in our strategic plan to implement a training program for more junior \u003cbr /\u003edevelopers, but realistically, it won’t be implemented for a year or two.\u003cbr /\u003e\u003cbr /\u003eIf you’re looking to level up, we scout for developers who have worked on \u003cbr /\u003emultiple technologies in a production environment. We also look for big shifts. \u003cbr /\u003eFor example, moving from ASP.NET webforms to ASP.NET MVC isn’t as big of a \u003cbr /\u003eshift as moving from .NET to Ruby, Python, JavaScript, etc. We also look for \u003cbr /\u003epeople who have lots of integration experience, so getting API happy is a great \u003cbr /\u003eway to boost your skills.\u003cbr /\u003e\u003cbr /\u003eNice. I think I want to apply. Any tips?\u003cbr /\u003e\u003cbr /\u003eSure thing!\u003cbr /\u003e\u003cbr /\u003eKeep informed of when we’re hiring by subscribing to our opportunities mailing \u003cbr /\u003elist \u003chttp://eepurl.com/crSZ19\u003e.\u003cbr /\u003e\u003cbr /\u003eWhen we’re hiring, send us an email \u003cmailto:jobs@corgibytes.com\u003e with a cover \u003cbr /\u003eletter and your resume. We have loads of applicants contacting us, so here’s \u003cbr /\u003ehow you can help yourself stand out:\u003cbr /\u003e\u003cbr /\u003e * Show us your personality in your email. Good communication, especially \u003cbr /\u003ewritten skills, are essential and a quality we’ll be looking for. \u003cbr /\u003e * Our CEO and CTO are the ones who are reviewing applicants. Use our names in \u003cbr /\u003eyour greeting. They’re on our website. \u003cbr /\u003e * Links to projects where we can check out your code are super helpful. \u003cbr /\u003e * Read the article Good Naming Is a Process Not a Single Step \u003cbr /\u003e\u003chttp://arlobelshee.com/good-naming-is-a-process-not-a-single-step/\u003e by Arlo \u003cbr /\u003eBelshee and let us know your thoughts. \u003cbr /\u003e * Share an article or blog post that you find thought provoking. \u003cbr /\u003e * If you have typos in your cover letter or resume, we’ll assume you’re also \u003cbr /\u003eokay with typos in your code. We pitch our company based on quality, so details \u003cbr /\u003ematter. \u003cbr /\u003eWhat about diversity?\u003cbr /\u003e\u003cbr /\u003eIt’s awesome! We are an equal opportunity employer and value diversity. We do \u003cbr /\u003enot discriminate by race, religion, color, national origin, gender, sexual \u003cbr /\u003eorientation, age, marital status, veteran status, or disability status.\u003cbr /\u003e\u003cbr /\u003eSweet. I sent you an email. Now what?\u003cbr /\u003e\u003cbr /\u003eHead on over to our hiring process \u003c\u003e page and read all about what you can \u003cbr /\u003eexpect.\u003cbr /\u003e Richmond, VA ©2008–2017 Corgibytes, LLC. All rights reserved. \u003cbr /\u003e * Twitter \u003chttps://twitter.com/corgibytes\u003e \u003cbr /\u003e * Facebook \u003chttps://www.facebook.com/corgibytes\u003e \u003cbr /\u003e * Github \u003chttps://github.com/corgibytes\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "jobs.remotive.io",
    "url": "http://www.aha.io/company/careers/current-openings/sr_rails_engineer_us",
    "title": "Sr. Rails Engineer at Aha, Anywhere US, engineering",
    "content": "Sr. Rails Engineer | Aha!  \u003c\u003e  Log in \u003chttps://secure.aha.io/session/new\u003e  \u003c\u003e \u003cbr /\u003e * PRODUCT \u003c\u003e \u003cbr /\u003e * Benefits \u003c\u003e \u003cbr /\u003e * Features \u003c\u003e \u003cbr /\u003e * Integrations \u003c\u003e \u003cbr /\u003e * Where Aha! fits \u003c\u003e \u003cbr /\u003e * ROADMAPS \u003c\u003e \u003cbr /\u003e * Product roadmap \u003c\u003e \u003cbr /\u003e * Technology roadmap \u003c\u003e \u003cbr /\u003e * Consulting roadmap \u003c\u003e \u003cbr /\u003e * Manufacturing roadmap \u003c\u003e \u003cbr /\u003e * Marketing roadmap \u003c\u003e \u003cbr /\u003e * PRICING \u003c\u003e \u003cbr /\u003e * CUSTOMERS \u003c\u003e \u003cbr /\u003e * Success stories \u003c\u003e \u003cbr /\u003e * Love \u003c\u003e \u003cbr /\u003e * CAREERS \u003c\u003e \u003cbr /\u003e * Love your job \u003c\u003e \u003cbr /\u003e * Culture \u003c\u003e \u003cbr /\u003e * Current openings \u003c\u003e \u003cbr /\u003e * About us \u003c\u003e \u003cbr /\u003e * Company history \u003c\u003e \u003cbr /\u003e * Responsive method \u003c\u003e \u003cbr /\u003e * Blog \u003chttp://blog.aha.io/\u003e \u003cbr /\u003e * Forum \u003chttps://www.roadmap.com/?ref\u003dnav\u003e \u003cbr /\u003e * Ideas \u003chttps://big.ideas.aha.io/\u003e \u003cbr /\u003e * Support \u003chttp://support.aha.io/\u003e Start a FREE Trial \u003c\u003e  Log in \u003cbr /\u003e\u003chttps://secure.aha.io/session/new\u003e \u003cbr /\u003eSr. Rails Engineer\u003cbr /\u003e\u003cbr /\u003eAnywhere in the United States\u003cbr /\u003e\u003cbr /\u003eEngineering\u003cbr /\u003e\u003cbr /\u003eAre you an Engineer looking to revolutionize the way people innovate and build \u003cbr /\u003esoftware? Do you want to create something that will change the way people think \u003cbr /\u003eabout innovation, and work with cutting-edge visualization, collaboration, and \u003cbr /\u003esocial ideation technologies at the same time? We are looking for highly \u003cbr /\u003eambitious engineers who want to work on major aspects of the Aha! product — \u003cbr /\u003efrom the back-end through to the end user experience. If this is you, we want \u003cbr /\u003eto hear from you!\u003cbr /\u003e\u003cbr /\u003eAs a Senior Rails Engineer, you will have an excellent opportunity to join a \u003cbr /\u003ebreakthrough and profitable company that is growing fast. Aha! was founded by a \u003cbr /\u003eproven team of Silicon Valley veterans whose last two companies were acquired \u003cbr /\u003eby Aruba Networks [ARUN] and Citrix [CTXS] respectively. Over 50,000 users \u003cbr /\u003etrust Aha! for their product strategy and roadmaps.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for someone who: \u003cbr /\u003e\u003cbr /\u003e * Is experienced in Ruby-on-Rails \u003cbr /\u003e * Has worked on key functionality for a cloud-based product \u003cbr /\u003e * Wants to work on a major aspect of product functionality from back-end \u003cbr /\u003ealgorithms through to the user interface \u003cbr /\u003e * Wants to be great and work in a fast-moving, online environment where the \u003cbr /\u003eend-user is king \u003cbr /\u003eWe are committed to being great, and we want someone who: \u003cbr /\u003e\u003cbr /\u003e * Can work at a fast-paced company where the feedback cycle is measured in \u003cbr /\u003ehours rather than weeks \u003cbr /\u003e * Has a \"get it done\" attitude and a background of delivering superb work \u003cbr /\u003eagain and again \u003cbr /\u003e * Is seeking a career-defining opportunity and a proven, results-oriented \u003cbr /\u003eteam that has sold multiple software companies \u003cbr /\u003e We are building a distributed team and you can work from anywhere in the \u003cbr /\u003eUnited States for this role. We offer generous salary, equity, benefits, and a \u003cbr /\u003eprofit sharing program to the right candidates. \u003cbr /\u003e\u003cbr /\u003eFor immediate consideration, please follow these helpful guidelines \u003cbr /\u003e\u003chttp://blog.aha.io/index.php/use-these-cover-letters-that-ceos-read/\u003e and \u003cbr /\u003econtact us atamy@aha.io \u003cmailto:amy@aha.io\u003e. If you have the right background \u003cbr /\u003ewe will quickly follow up with you. We are not working with recruiters or third \u003cbr /\u003eparty agencies.\u003cbr /\u003e\u003cbr /\u003e« Back to all job listings \u003c\u003e\u003cbr /\u003e\u003cbr /\u003e * Product \u003c\u003e \u003cbr /\u003e * Benefits \u003c\u003e \u003cbr /\u003e * Features \u003c\u003e \u003cbr /\u003e * Pricing \u003c\u003e \u003cbr /\u003e * Security \u003c\u003e \u003cbr /\u003e * Roadmapping software \u003c\u003e \u003cbr /\u003e * Where Aha! fits \u003c\u003e \u003cbr /\u003e * Product lovability tool \u003c\u003e \u003cbr /\u003e * Product management guide \u003c\u003e \u003cbr /\u003e * Careers \u003c\u003e \u003cbr /\u003e * About \u003c\u003e \u003cbr /\u003e * History \u003c\u003e \u003cbr /\u003e * Support \u003chttp://support.aha.io/\u003e \u003cbr /\u003e * Blog \u003chttp://blog.aha.io/\u003e \u003cbr /\u003eCONTACT US\u003cbr /\u003e\u003cbr /\u003e * Contact form \u003c\u003e \u003cbr /\u003e *   support@aha.io \u003cmailto:support@aha.io\u003e \u003cbr /\u003e *   1-888-926-2240 \u003c\u003e \u003cbr /\u003eCONNECT\u003cbr /\u003eFollow @aha_io \u003chttps://twitter.com/aha_io\u003e © 2017 Aha! Labs Inc. All rights \u003cbr /\u003ereserved Developer API \u003c\u003e  /  Privacy policy \u003c\u003e  /  Terms of service \u003c\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "jobs.remotive.io",
    "url": "http://www.aha.io/company/careers/current-openings/rails_engineer_us",
    "title": "Rails Engineer at Aha, Anywhere US, engineering",
    "content": "Rails Engineer | Aha!  \u003c\u003e  Log in \u003chttps://secure.aha.io/session/new\u003e  \u003c\u003e \u003cbr /\u003e * PRODUCT \u003c\u003e \u003cbr /\u003e * Benefits \u003c\u003e \u003cbr /\u003e * Features \u003c\u003e \u003cbr /\u003e * Integrations \u003c\u003e \u003cbr /\u003e * Where Aha! fits \u003c\u003e \u003cbr /\u003e * ROADMAPS \u003c\u003e \u003cbr /\u003e * Product roadmap \u003c\u003e \u003cbr /\u003e * Technology roadmap \u003c\u003e \u003cbr /\u003e * Consulting roadmap \u003c\u003e \u003cbr /\u003e * Manufacturing roadmap \u003c\u003e \u003cbr /\u003e * Marketing roadmap \u003c\u003e \u003cbr /\u003e * PRICING \u003c\u003e \u003cbr /\u003e * CUSTOMERS \u003c\u003e \u003cbr /\u003e * Success stories \u003c\u003e \u003cbr /\u003e * Love \u003c\u003e \u003cbr /\u003e * CAREERS \u003c\u003e \u003cbr /\u003e * Love your job \u003c\u003e \u003cbr /\u003e * Culture \u003c\u003e \u003cbr /\u003e * Current openings \u003c\u003e \u003cbr /\u003e * About us \u003c\u003e \u003cbr /\u003e * Company history \u003c\u003e \u003cbr /\u003e * Responsive method \u003c\u003e \u003cbr /\u003e * Blog \u003chttp://blog.aha.io/\u003e \u003cbr /\u003e * Forum \u003chttps://www.roadmap.com/?ref\u003dnav\u003e \u003cbr /\u003e * Ideas \u003chttps://big.ideas.aha.io/\u003e \u003cbr /\u003e * Support \u003chttp://support.aha.io/\u003e Start a FREE Trial \u003c\u003e  Log in \u003cbr /\u003e\u003chttps://secure.aha.io/session/new\u003e \u003cbr /\u003eRails Engineer\u003cbr /\u003e\u003cbr /\u003eAnywhere in the United States\u003cbr /\u003e\u003cbr /\u003eEngineering\u003cbr /\u003e\u003cbr /\u003eAre you an Engineer looking to revolutionize the way people innovate and build \u003cbr /\u003esoftware? Do you want to create something that will change the way people think \u003cbr /\u003eabout innovation, and work with cutting-edge visualization, collaboration, and \u003cbr /\u003esocial ideation technologies at the same time? We are looking for highly \u003cbr /\u003eambitious engineers who want to work on major aspects of the Aha! product — \u003cbr /\u003efrom the back-end through to the end user experience. If this is you, we want \u003cbr /\u003eto hear from you!\u003cbr /\u003e\u003cbr /\u003eAs a Rails Engineer, you will have an excellent opportunity to join a \u003cbr /\u003ebreakthrough and profitable company that is growing fast. Aha! was founded by a \u003cbr /\u003eproven team of Silicon Valley veterans whose last two companies were acquired \u003cbr /\u003eby Aruba Networks [ARUN] and Citrix [CTXS] respectively. Over 50,000 users \u003cbr /\u003etrust Aha! for their product strategy and roadmaps.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for someone who:\u003cbr /\u003e\u003cbr /\u003e * Is experienced in Ruby-on-Rails \u003cbr /\u003e * Has a computer science degree \u003cbr /\u003e * Wants to work on a major aspect of product functionality from back-end \u003cbr /\u003ealgorithms through to the user interface \u003cbr /\u003e * Wants to be great and work in a fast-moving, online environment where the \u003cbr /\u003eend-user is king \u003cbr /\u003eWe are committed to being great, and we want someone who:\u003cbr /\u003e\u003cbr /\u003e * Can work at a fast-paced company where the feedback cycle is measured in \u003cbr /\u003ehours rather than weeks \u003cbr /\u003e * Has a \"get it done\" attitude and a background of delivering superb work \u003cbr /\u003eagain and again \u003cbr /\u003e * Is seeking a career-defining opportunity and a proven, results-oriented \u003cbr /\u003eteam that has sold multiple software companies \u003cbr /\u003e We are building a distributed team and you can work from anywhere in the \u003cbr /\u003eUnited States for this role. We offer generous salary, equity, benefits, and a \u003cbr /\u003eprofit sharing program to the right candidates. \u003cbr /\u003e\u003cbr /\u003eFor immediate consideration, please follow these helpful guidelines \u003cbr /\u003e\u003chttp://blog.aha.io/index.php/use-these-cover-letters-that-ceos-read/\u003e and \u003cbr /\u003econtact us atamy@aha.io \u003cmailto:amy@aha.io\u003e. If you have the right background \u003cbr /\u003ewe will quickly follow up with you. We are not working with recruiters or third \u003cbr /\u003eparty agencies.\u003cbr /\u003e\u003cbr /\u003e« Back to all job listings \u003c\u003e\u003cbr /\u003e\u003cbr /\u003e * Product \u003c\u003e \u003cbr /\u003e * Benefits \u003c\u003e \u003cbr /\u003e * Features \u003c\u003e \u003cbr /\u003e * Pricing \u003c\u003e \u003cbr /\u003e * Security \u003c\u003e \u003cbr /\u003e * Roadmapping software \u003c\u003e \u003cbr /\u003e * Where Aha! fits \u003c\u003e \u003cbr /\u003e * Product lovability tool \u003c\u003e \u003cbr /\u003e * Product management guide \u003c\u003e \u003cbr /\u003e * Careers \u003c\u003e \u003cbr /\u003e * About \u003c\u003e \u003cbr /\u003e * History \u003c\u003e \u003cbr /\u003e * Support \u003chttp://support.aha.io/\u003e \u003cbr /\u003e * Blog \u003chttp://blog.aha.io/\u003e \u003cbr /\u003eCONTACT US\u003cbr /\u003e\u003cbr /\u003e * Contact form \u003c\u003e \u003cbr /\u003e *   support@aha.io \u003cmailto:support@aha.io\u003e \u003cbr /\u003e *   1-888-926-2240 \u003c\u003e \u003cbr /\u003eCONNECT\u003cbr /\u003eFollow @aha_io \u003chttps://twitter.com/aha_io\u003e © 2017 Aha! Labs Inc. All rights \u003cbr /\u003ereserved Developer API \u003c\u003e  /  Privacy policy \u003c\u003e  /  Terms of service \u003c\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "jobs.remotive.io",
    "url": "http://www.aha.io/company/careers/current-openings/front_end_developer_us",
    "title": "Front End Developer at Aha, Anywhere US, engineering",
    "content": "Front End Developer | Aha!  \u003c\u003e  Log in \u003chttps://secure.aha.io/session/new\u003e  \u003c\u003e \u003cbr /\u003e * PRODUCT \u003c\u003e \u003cbr /\u003e * Benefits \u003c\u003e \u003cbr /\u003e * Features \u003c\u003e \u003cbr /\u003e * Integrations \u003c\u003e \u003cbr /\u003e * Where Aha! fits \u003c\u003e \u003cbr /\u003e * ROADMAPS \u003c\u003e \u003cbr /\u003e * Product roadmap \u003c\u003e \u003cbr /\u003e * Technology roadmap \u003c\u003e \u003cbr /\u003e * Consulting roadmap \u003c\u003e \u003cbr /\u003e * Manufacturing roadmap \u003c\u003e \u003cbr /\u003e * Marketing roadmap \u003c\u003e \u003cbr /\u003e * PRICING \u003c\u003e \u003cbr /\u003e * CUSTOMERS \u003c\u003e \u003cbr /\u003e * Success stories \u003c\u003e \u003cbr /\u003e * Love \u003c\u003e \u003cbr /\u003e * CAREERS \u003c\u003e \u003cbr /\u003e * Love your job \u003c\u003e \u003cbr /\u003e * Culture \u003c\u003e \u003cbr /\u003e * Current openings \u003c\u003e \u003cbr /\u003e * About us \u003c\u003e \u003cbr /\u003e * Company history \u003c\u003e \u003cbr /\u003e * Responsive method \u003c\u003e \u003cbr /\u003e * Blog \u003chttp://blog.aha.io/\u003e \u003cbr /\u003e * Forum \u003chttps://www.roadmap.com/?ref\u003dnav\u003e \u003cbr /\u003e * Ideas \u003chttps://big.ideas.aha.io/\u003e \u003cbr /\u003e * Support \u003chttp://support.aha.io/\u003e Start a FREE Trial \u003c\u003e  Log in \u003cbr /\u003e\u003chttps://secure.aha.io/session/new\u003e \u003cbr /\u003eFront End Developer\u003cbr /\u003e\u003cbr /\u003eAnywhere in the United States\u003cbr /\u003e\u003cbr /\u003eEngineering\u003cbr /\u003e\u003cbr /\u003eAre you a developer looking to revolutionize the way people innovate and build \u003cbr /\u003esoftware? Do you want to create something that will change the way people think \u003cbr /\u003eabout innovation, and work with cutting-edge visualization, collaboration, and \u003cbr /\u003esocial ideation technologies at the same time? We are looking for highly \u003cbr /\u003eambitious developers who want to own major aspects of the Aha! product – from \u003cbr /\u003efront-end work through to the end user experience. If this is you, we want to \u003cbr /\u003ehear from you!\u003cbr /\u003e\u003cbr /\u003eAs a Front End Developer, you will have an excellent opportunity to join a \u003cbr /\u003ebreakthrough and profitable company that is growing fast. Aha! was founded by a \u003cbr /\u003eproven team of Silicon Valley veterans whose last two companies were acquired \u003cbr /\u003eby Aruba Networks [ARUN] and Citrix [CTXS] respectively. Over 50,000 users \u003cbr /\u003etrust Aha! for their product strategy and roadmaps.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for someone who:\u003cbr /\u003e\u003cbr /\u003e * Is experienced in Ruby-on-Rails, HTML, CSS, and Javascript \u003cbr /\u003e * Has helped design and implement key functionality for a cloud-based product \u003cbr /\u003e * Wants to have ownership and responsibility for a major aspect of product \u003cbr /\u003efunctionality from front-end development through to the user interface \u003cbr /\u003e * Likes to think about how to tailor a user experience, but is also \u003cbr /\u003ecomfortable creating highly scalable infrastructures \u003cbr /\u003e * Wants to be great and work in a fast-moving, online environment where the \u003cbr /\u003eend-user is king \u003cbr /\u003eWe are committed to being great, and we want someone who:\u003cbr /\u003e\u003cbr /\u003e * Can work at a fast-paced company where the feedback cycle is measured in \u003cbr /\u003ehours rather than weeks \u003cbr /\u003e * Has a background of delivering superb work again and again \u003cbr /\u003e * Is seeking a career-defining opportunity and a proven, results-oriented \u003cbr /\u003eteam which has sold multiple software companies \u003cbr /\u003e * Has operations experience \u003cbr /\u003e * Is interested in helping less experienced engineers grow their skills and \u003cbr /\u003ecareer \u003cbr /\u003e We are building a distributed team and you can work from anywhere in the \u003cbr /\u003eUnited States for this role. We offer generous salary, equity, benefits, and a \u003cbr /\u003eprofit sharing program to the right candidates. \u003cbr /\u003e\u003cbr /\u003eFor immediate consideration, please follow these helpful guidelines \u003cbr /\u003e\u003chttp://blog.aha.io/index.php/use-these-cover-letters-that-ceos-read/\u003e and \u003cbr /\u003econtact us atamy@aha.io \u003cmailto:amy@aha.io\u003e. If you have the right background \u003cbr /\u003ewe will quickly follow up with you. We are not working with recruiters or third \u003cbr /\u003eparty agencies.\u003cbr /\u003e\u003cbr /\u003e« Back to all job listings \u003c\u003e\u003cbr /\u003e\u003cbr /\u003e * Product \u003c\u003e \u003cbr /\u003e * Benefits \u003c\u003e \u003cbr /\u003e * Features \u003c\u003e \u003cbr /\u003e * Pricing \u003c\u003e \u003cbr /\u003e * Security \u003c\u003e \u003cbr /\u003e * Roadmapping software \u003c\u003e \u003cbr /\u003e * Where Aha! fits \u003c\u003e \u003cbr /\u003e * Product lovability tool \u003c\u003e \u003cbr /\u003e * Product management guide \u003c\u003e \u003cbr /\u003e * Careers \u003c\u003e \u003cbr /\u003e * About \u003c\u003e \u003cbr /\u003e * History \u003c\u003e \u003cbr /\u003e * Support \u003chttp://support.aha.io/\u003e \u003cbr /\u003e * Blog \u003chttp://blog.aha.io/\u003e \u003cbr /\u003eCONTACT US\u003cbr /\u003e\u003cbr /\u003e * Contact form \u003c\u003e \u003cbr /\u003e *   support@aha.io \u003cmailto:support@aha.io\u003e \u003cbr /\u003e *   1-888-926-2240 \u003c\u003e \u003cbr /\u003eCONNECT\u003cbr /\u003eFollow @aha_io \u003chttps://twitter.com/aha_io\u003e © 2017 Aha! Labs Inc. All rights \u003cbr /\u003ereserved Developer API \u003c\u003e  /  Privacy policy \u003c\u003e  /  Terms of service \u003c\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13541998",
    "title": "GitLab | Remote Only | Hiring All Roles We\u0027re hiring VP of Engineering, production engineers, build engineers, Sr. Go + Ruby developers, ...",
    "content": "GitLab | Remote Only | Hiring All Roles\u003cbr /\u003eWe\u0027re hiring VP of Engineering, production engineers, build engineers, Sr. Go \u003cbr /\u003e+ Ruby developers, and more, seehttps://about.gitlab.com/jobs/ \u003cbr /\u003e\u003chttps://about.gitlab.com/jobs/\u003e We\u0027re a remote only company so everyone can \u003cbr /\u003eparticipate and contribute equally. GitLab Community Edition is an open-source \u003cbr /\u003eRuby on Rails project with over 1000 contributors. \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "*********** koolba ***********\nSomething tells me you\u0027re going to get quite a few responses this month :D \nreply \u003c\u003e \n\n*********** aardvarkit ***********\nFor the Ruby dev positions, be prepared with a few links to open source Ruby \nprojects you\u0027ve written on Github et al, or contributions to open source \nprojects. Not a hiring strategy I\u0027d agree with, but I guess that\u0027s what they\u0027ve \ndecided on.\nI asked if they\u0027d do a \u0027challenge\u0027 of some sort, but they didn\u0027t like that \napproach, and returned with \u0027Please look at our buglist and submit a patch \nthen\u0027. I find that quite an inventive way to get your defects looked at. \n\nreply \u003c\u003e \n\n*********** sashagitlab ***********\n@Koolba - We hope so! We\u0027ve had an amazing response from our awesome \ncommunity. We\u0027d hope that some of those people will submit their resumes! \nreply \u003c\u003e \n\n*********** alexbanks ***********\nWould it be alright if I PM\u0027d you? \nreply \u003c\u003e",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 6:24:04 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13542483",
    "title": "Executive Director, FUSE Coworking - Lincoln, NE - Full-Time Fuse Coworking is a shared workspace where Lincoln’s startups, freelancers, telecommuters ...",
    "content": "Executive Director, FUSE Coworking - Lincoln, NE - Full-Time Fuse Coworking is \u003cbr /\u003ea shared workspace where Lincoln’s startups, freelancers, telecommuters and \u003cbr /\u003ecorporate innovation teams work and collaborate. We have a thriving work \u003cbr /\u003ecommunity that contributes to our members’ productivity and happiness. Our core \u003cbr /\u003evalues are collaboration, community, inclusivity and sustainability. We are \u003cbr /\u003elocated in the Haymarket in Lincoln, Nebraska, in the midst of over 100 \u003cbr /\u003estartups within a four block area.\u003cbr /\u003eFuse is hiring for the position of Executive Director. This person will build \u003cbr /\u003eon the momentum that we have created and lead Fuse further forward in the areas \u003cbr /\u003eof coworking, entrepreneurial education and startup community leadership. The \u003cbr /\u003eExecutive Director will be responsible for managing all operations, culture and \u003cbr /\u003egrowth at Fuse.\u003cbr /\u003e\u003cbr /\u003eFor more info and to apply: \u003cbr /\u003ehttps://careers-nelnet.icims.com/jobs/4439/executive-directo... \u003cbr /\u003e\u003chttps://careers-nelnet.icims.com/jobs/4439/executive-director%2c-fuse-coworking/job?mode\u003dview\u0026mobile\u003dfalse\u0026width\u003d720\u0026height\u003d500\u0026bga\u003dtrue\u0026needsRedirect\u003dfalse\u0026jan1offset\u003d-360\u0026jun1offset\u003d-300\u003e\u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 7:08:04 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13546052",
    "title": "Los Angeles, CA -- Riot Games -- Esports/Merch Engineering Team",
    "content": "Los Angeles, CA -- Riot Games -- Esports/Merch Engineering Team\u003cbr /\u003eEngineering Manager - Merch Team Management experience: must have built at \u003cbr /\u003eleast one strong engineering team in the 5-10 range that has shipped + operated \u003cbr /\u003ea live client/server product.\u003cbr /\u003e\u003cbr /\u003eEngineering Manager - Esports Team Management experience: must have built at \u003cbr /\u003eleast one strong engineering team in the 5-10 range that has shipped + operated \u003cbr /\u003ea live client/server product.\u003cbr /\u003e\u003cbr /\u003eEngineering Manager + Tech Lead - Broadcast Innovation Passion around the \u003cbr /\u003eesports space with experience in streaming.\u003cbr /\u003e\u003cbr /\u003eSenior Software Engineer (Platform)- Design, written, shipped + operated \u003cbr /\u003eRESTful services at large scale (\u003e10,000,000 MUs, \u003e500 aQPS) Expert level in \u003cbr /\u003eJava or Go\u003cbr /\u003e\u003cbr /\u003eTech Lead/Senior Software Engineer (Mobile) Expertise in Android and iOS\u003cbr /\u003e\u003cbr /\u003eIf you\u0027re interested shoot me your resume to nclauss(AT)riotgames.com \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 2, 2017 12:34:04 AM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13550583",
    "title": "Technical Project Manager - REMOTE - Anywhere CodeMyViews Summary: www.codemyviews.com CMV exists to make software development better for everyone ...",
    "content": "Technical Project Manager - REMOTE - Anywhere\u003cbr /\u003eCodeMyViews Summary: www.codemyviews.com CMV exists to make software \u003cbr /\u003edevelopment better for everyone involved – developers included. We believe in a \u003cbr /\u003efully managed development process where our team handles the entire software \u003cbr /\u003edevelopment workflow from Project Management to Coding \u0026 Execution. Clients \u003cbr /\u003ework with us because they love our hands on approach, senior engineering team, \u003cbr /\u003eand get-it-done culture. Developers love us because when you work at CMV, every \u003cbr /\u003eproject you start on is fully spec’d out and defined in such a way that you can \u003cbr /\u003edo what you love – write code. We’re a fully remote team, so you can work \u003cbr /\u003eanywhere, anytime. We value smarts, hard work, and diversity which is why we \u003cbr /\u003ehire only the best from all over the world.\u003cbr /\u003e\u003cbr /\u003eJob Description:\u003cbr /\u003e\u003cbr /\u003eOur Technical Project Manager role at CMV means you will work with our great \u003cbr /\u003eteam of engineers, designers, product managers, and our CTO to deliver the best \u003cbr /\u003ecode for clients along with an amazing customer experience. Your day to day \u003cbr /\u003ewill primarily involve managing a variety of software projects, organizing \u003cbr /\u003eworkflows, interfacing with developers, managing clients, and being an overall \u003cbr /\u003ebadass that keeps operations moving smoothly. You will work closely with our \u003cbr /\u003eteam developers and VP of Engineering who will be doing the day to day coding \u003cbr /\u003eon the project.\u003cbr /\u003e\u003cbr /\u003eThis is a remote position that can be done from anywhere with a solid internet \u003cbr /\u003econnection, and we hope, some coffee. During the year we like to get together \u003cbr /\u003eas a team, like last year’s trip to Amsterdam \u0026 St. Petersburg. Join us soon – \u003cbr /\u003ewe’re thinking Indonesia this year!\u003cbr /\u003e\u003cbr /\u003eRequirements \u0026 Responsibilities:\u003cbr /\u003e\u003cbr /\u003eInsanely organized, but nice about it Experience working remote Experience \u003cbr /\u003emanaging large and small software projects Client service experience a plus \u003cbr /\u003eTechnical skill – you may not code every day, but you could if you needed to \u003cbr /\u003eCan move fast while maintaining highest quality Identify development issues and \u003cbr /\u003eblockers and devise smart solutions Help to mentor \u0026 onboard new team members \u003cbr /\u003eAt least 3 years of software project management experience You must be a top \u003cbr /\u003eindividual contributor to do great at CMV.\u003cbr /\u003e\u003cbr /\u003eTo apply: https://codemyviews.com/careers/technical-project-manager \u003cbr /\u003e\u003chttps://codemyviews.com/careers/technical-project-manager\u003e \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 2, 2017 4:16:04 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13543316",
    "title": "Full-Time Sales Director Position for San Francisco-based Revolutionary Ad-Tech Company. If you are passionate about the ...",
    "content": "Full-Time Sales Director Position for San Francisco-based Revolutionary Ad-Tech \u003cbr /\u003eCompany. If you are passionate about the science of human psychology, are first \u003cbr /\u003eto embrace revolutionary new technologies, and have a hunter mentality, then \u003cbr /\u003ethis is an opportunity that you can\u0027t miss. Please find more information and \u003cbr /\u003ejob description here:\u003cbr /\u003ehttps://drive.google.com/open?id\u003d0B08T5DhNKQ16dV81YnNiNkt6VE... \u003cbr /\u003e\u003chttps://drive.google.com/open?id\u003d0B08T5DhNKQ16dV81YnNiNkt6VEU\u003e \u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 8:19:04 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE2/America",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/134002/uwp-software-engineering-manager-140k-crossover?a\u003dIWhNFJoXSus",
    "title": "UWP Software Engineering Manager - $140K at Crossover () (allows remote)",
    "content": "If you are an elite Software Engineering Manager with Universal Windows \u003cbr /\u003ePlatform expertise eager to gain unprecedented visibility to the top technology \u003cbr /\u003ecompanies throughout the globe, employ your technical and managerial skills to \u003cbr /\u003eoversee cutting-edge software in a high-intensity environment, and earn \u003cbr /\u003e$140,000 USD per year while working from virtually anywhere on the planet, this \u003cbr /\u003ejob is for you.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThe Company:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Crossover is a well-funded startup that has developed a unique way to find, \u003cbr /\u003ecurate and manage the top 1% of global talent – and connect them to medium and \u003cbr /\u003elarge businesses. We are experiencing rapid growth within the companies we \u003cbr /\u003ecurrently serve and are increasing our staff to expand our business.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Brick and mortar offices are history. The future of our global workforce will \u003cbr /\u003econsist of teams collaborating from every corner of the world. Our platform \u003cbr /\u003econnects customers to the world’s best talent for both technical and \u003cbr /\u003enon-technical contracting. But we don’t just find the best; we also provide the \u003cbr /\u003esoftware tools, training, and expert management to ensure success for long-term \u003cbr /\u003egrowth.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eJob Description:\u003cbr /\u003e\u003cbr /\u003eCrossover is looking for Software Engineering Managers with UWP experience who \u003cbr /\u003edemonstrate outstanding managerial skills as well as the technical background \u003cbr /\u003eto deeply understand the code their teams are developing. You will be expected \u003cbr /\u003eto demonstrate both a mastery of the technical skills associated with the \u003cbr /\u003eprojects at hand, as well as the managerial ability to motivate, build, and \u003cbr /\u003emonitor your team. Specifically, you will be responsible for overseeing from 4 \u003cbr /\u003eto 6 teams of 3 to 4 individuals. You will own the process of breaking \u003cbr /\u003especifications created by the product management team into clear tasks and \u003cbr /\u003etimelines, as well as assembling the results into high value, reusable \u003cbr /\u003ecomponents. Under your leadership, we expect to see consistent improvement in \u003cbr /\u003eboth static code quality metrics and weekly production.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualities:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eRuthless commitment to impeccable code quality\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eDeep understanding of a wide range of the latest technologies and \u003cbr /\u003earchitectural approaches\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAdvanced proficiency in C# programming language, related frameworks and best \u003cbr /\u003epractices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eThe ability to make appropriate technical decisions, review design and code, \u003cbr /\u003eand ensure best technical practices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to hands-on engagement as an individual within the team, despite \u003cbr /\u003emanagerial status\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eWillingness to embrace iterative development as the means for building \u003cbr /\u003eseamless products\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003ePerfectionism: knowing how a job should be done and not stop until it’s done \u003cbr /\u003ecorrectly\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExceptional ability to effectively motivate and manage teams of individuals\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to increasing efficiency in the workplace by continuously \u003cbr /\u003eautomating parts of the software engineering process\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExcellent remote management skills (you will be using Skype, GoToMeeting, \u003cbr /\u003eGoogle Docs, etc.)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eRequired Skills and Experience:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualifications:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBachelor\u0027s degree in Computer Science, Computer Engineering, or Electrical \u003cbr /\u003eEngineering\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProven managerial skills with at least 8 years of experience\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003e2 years of experience in hands-on UWP (Universal Windows Platform) application \u003cbr /\u003edevelopment\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience with Cloud architecture and DevOps\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAt least 5 years of experience in managing .NET application development teams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in Agile, SDLC, or SLA\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in AWS and TDD is desired but not mandatory\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eOutstanding English communication skills\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eTotal compensation: $70/hr for 40 productive hours per week\u003cbr /\u003e\u003cbr /\u003eLocation: Global (remote)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWe’re one of the few legitimate companies offering high-paying jobs that are \u003cbr /\u003e100% remote, work from home. You never have to fight traffic to the office \u003cbr /\u003eagain and you have the freedom to choose when and where you put in your 40 \u003cbr /\u003ehours to be most effective each week.\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualifications:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBachelor\u0027s degree in Computer Science, Computer Engineering, or Electrical \u003cbr /\u003eEngineering\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProven managerial skills with at least 8 years of experience\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAt least 2 full implementations as a Lead for porting product / App to UWP \u003cbr /\u003eplatform (including scoping, sizing, team formation, costing, etc.)\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience with Cloud architecture and DevOps\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAt least 5 years of experience in managing .NET application development teams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in Agile, SDLC, or SLA\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in AWS and TDD is desired but not mandatory\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eOutstanding English communication skills\u003cbr /\u003e\u003cbr /\u003e About Crossover \u003cbr /\u003e Crossover is redefining the way people work. Brick and mortar offices are \u003cbr /\u003ehistory. The future of our global workforce will be built from teams \u003cbr /\u003ecollaborating from every corner of the world. We have embarked on an expedition \u003cbr /\u003eto find and engage with that talent. Crossover has developed a unique method of \u003cbr /\u003efinding, curating, and managing remote contractors. And now, as a fully \u003cbr /\u003edistributed company headquartered in Texas, United States we have more than 800 \u003cbr /\u003epeople working for us in over 50 countries. Our platform connects customers to \u003cbr /\u003ethe world\u0027s best talent for both technical and non-technical employment. But we \u003cbr /\u003edon’t just find the best, we also provide the tools, training, and relationship \u003cbr /\u003ebuilding support to ensure success for long term growth. External URL  apply now\u003cbr /\u003e \u003chttps://www.crossover.com/x/#/redirect/job/2358?utm_campaign\u003dJBzsto\u003e  more \u003cbr /\u003ejobs at Crossover \u003c\u003e \u003cbr /\u003eJoin us at Crossover\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eWork from anywhere Choose Your Own Hours Flat organization Work with talented, \u003cbr /\u003einteresting people. Committed to Diversity Competitive Compensation \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eMircea Strugaru \u003cbr /\u003ejava cloud \u003cbr /\u003eview profile \u003c\u003e William Huang \u003cbr /\u003ejavascript java scala domain-driven-design \u003cbr /\u003eview profile \u003c\u003e Luciano Bargmann \u003cbr /\u003ec# web-applications php cakephp \u003cbr /\u003eview profile \u003c\u003e Nagaraj Mandya \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Learn more about Crossover \u003c\u003e more jobs at Crossover \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/crossover?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:35:44 PM",
    "tags": [
      "TECH2/uwp",
      "TECH2/c#",
      "TITLE1/manager",
      "REMOTE2/America",
      "TECH2/cloud",
      "TECH2/.net",
      "TECH2/universal-windows-platfor",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/131292/software-engineering-manager-uwp-140k-crossover?a\u003dI1WbhuEbjiM",
    "title": "Software Engineering Manager (UWP) - $140K at Crossover () (allows remote)",
    "content": "If you are an elite Software Engineering Manager with Universal Windows \u003cbr /\u003ePlatform expertise eager to gain unprecedented visibility to the top technology \u003cbr /\u003ecompanies throughout the globe, employ your technical and managerial skills to \u003cbr /\u003eoversee cutting-edge software in a high-intensity environment, and earn \u003cbr /\u003e$140,000 USD per year while working from virtually anywhere on the planet, this \u003cbr /\u003ejob is for you.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThe Company:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Crossover is a well-funded startup that has developed a unique way to find, \u003cbr /\u003ecurate and manage the top 1% of global talent – and connect them to medium and \u003cbr /\u003elarge businesses. We are experiencing rapid growth within the companies we \u003cbr /\u003ecurrently serve and are increasing our staff to expand our business.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Brick and mortar offices are history. The future of our global workforce will \u003cbr /\u003econsist of teams collaborating from every corner of the world. Our platform \u003cbr /\u003econnects customers to the world’s best talent for both technical and \u003cbr /\u003enon-technical contracting. But we don’t just find the best; we also provide the \u003cbr /\u003esoftware tools, training, and expert management to ensure success for long-term \u003cbr /\u003egrowth.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eJob Description:\u003cbr /\u003e\u003cbr /\u003eCrossover is looking for Software Engineering Managers with UWP experience who \u003cbr /\u003edemonstrate outstanding managerial skills as well as the technical background \u003cbr /\u003eto deeply understand the code their teams are developing. You will be expected \u003cbr /\u003eto demonstrate both a mastery of the technical skills associated with the \u003cbr /\u003eprojects at hand, as well as the managerial ability to motivate, build, and \u003cbr /\u003emonitor your team. Specifically, you will be responsible for overseeing from 4 \u003cbr /\u003eto 6 teams of 3 to 4 individuals. You will own the process of breaking \u003cbr /\u003especifications created by the product management team into clear tasks and \u003cbr /\u003etimelines, as well as assembling the results into high value, reusable \u003cbr /\u003ecomponents. Under your leadership, we expect to see consistent improvement in \u003cbr /\u003eboth static code quality metrics and weekly production.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualities:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eRuthless commitment to impeccable code quality\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eDeep understanding of a wide range of the latest technologies and \u003cbr /\u003earchitectural approaches\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAdvanced proficiency in C# programming language, related frameworks and best \u003cbr /\u003epractices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eThe ability to make appropriate technical decisions, review design and code, \u003cbr /\u003eand ensure best technical practices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to hands-on engagement as an individual within the team, despite \u003cbr /\u003emanagerial status\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eWillingness to embrace iterative development as the means for building \u003cbr /\u003eseamless products\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003ePerfectionism: knowing how a job should be done and not stop until it’s done \u003cbr /\u003ecorrectly\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExceptional ability to effectively motivate and manage teams of individuals\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to increasing efficiency in the workplace by continuously \u003cbr /\u003eautomating parts of the software engineering process\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExcellent remote management skills (you will be using Skype, GoToMeeting, \u003cbr /\u003eGoogle Docs, etc.)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eRequired Skills and Experience:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualifications:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBachelor\u0027s degree in Computer Science, Computer Engineering, or Electrical \u003cbr /\u003eEngineering\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProven managerial skills with at least 8 years of experience\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003e2 years of experience in hands-on UWP (Universal Windows Platform) application \u003cbr /\u003edevelopment\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience with Cloud architecture and DevOps\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAt least 5 years of experience in managing .NET application development teams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in Agile, SDLC, or SLA\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in AWS and TDD is desired but not mandatory\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eOutstanding English communication skills\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eTotal compensation: $70/hr for 40 productive hours per week\u003cbr /\u003e\u003cbr /\u003eLocation: Global (remote)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWe’re one of the few legitimate companies offering high-paying jobs that are \u003cbr /\u003e100% remote, work from home. You never have to fight traffic to the office \u003cbr /\u003eagain and you have the freedom to choose when and where you put in your 40 \u003cbr /\u003ehours to be most effective each week.\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eA successful UWP Software Engineering Manager at Crossover will demonstrate \u003cbr /\u003ethe following qualifications:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBachelor\u0027s degree in Computer Science, Computer Engineering, or Electrical \u003cbr /\u003eEngineering\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProven managerial skills with at least 8 years of experience\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAt least 2 full implementations as a Lead for porting product / App to UWP \u003cbr /\u003eplatform (including scoping, sizing, team formation, costing, etc.)\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience with Cloud architecture and DevOps\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAt least 5 years of experience in managing .NET application development teams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in Agile, SDLC, or SLA\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in AWS and TDD is desired but not mandatory\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eOutstanding English communication skills\u003cbr /\u003e\u003cbr /\u003e About Crossover \u003cbr /\u003e Crossover is redefining the way people work. Brick and mortar offices are \u003cbr /\u003ehistory. The future of our global workforce will be built from teams \u003cbr /\u003ecollaborating from every corner of the world. We have embarked on an expedition \u003cbr /\u003eto find and engage with that talent. Crossover has developed a unique method of \u003cbr /\u003efinding, curating, and managing remote contractors. And now, as a fully \u003cbr /\u003edistributed company headquartered in Texas, United States we have more than 800 \u003cbr /\u003epeople working for us in over 50 countries. Our platform connects customers to \u003cbr /\u003ethe world\u0027s best talent for both technical and non-technical employment. But we \u003cbr /\u003edon’t just find the best, we also provide the tools, training, and relationship \u003cbr /\u003ebuilding support to ensure success for long term growth. External URL  apply now\u003cbr /\u003e \u003chttps://www.crossover.com/x/#/redirect/job/2358?utm_campaign\u003dJBzsto\u003e  more \u003cbr /\u003ejobs at Crossover \u003c\u003e \u003cbr /\u003eJoin us at Crossover\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eWork from anywhere Choose Your Own Hours Flat organization Work with talented, \u003cbr /\u003einteresting people. Committed to Diversity Competitive Compensation \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eMircea Strugaru \u003cbr /\u003ejava cloud \u003cbr /\u003eview profile \u003c\u003e William Huang \u003cbr /\u003ejavascript java scala domain-driven-design \u003cbr /\u003eview profile \u003c\u003e Luciano Bargmann \u003cbr /\u003ec# web-applications php cakephp \u003cbr /\u003eview profile \u003c\u003e Nagaraj Mandya \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Learn more about Crossover \u003c\u003e more jobs at Crossover \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/crossover?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:35:44 PM",
    "tags": [
      "TECH2/uwp",
      "TECH2/c#",
      "TITLE1/manager",
      "REMOTE2/America",
      "TECH2/cloud",
      "TECH2/.net",
      "TECH2/universal-windows-platfor",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/130532/saasops-software-engineering-manager-100k-crossover?a\u003dHM8q8Dy9AqI",
    "title": "SaaSOps Software Engineering Manager - $100k at Crossover () (allows remote)",
    "content": "SaaSOps Software Engineering Manager - $100k\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eIf you are an elite manager of a devops engineering team or a SaaS operations \u003cbr /\u003eteam and you are eager to gain unprecedented visibility to top technology \u003cbr /\u003ecompanies throughout the globe, employ your technical and managerial skills to \u003cbr /\u003eoversee super high impact devops migrations, and earn $100,000 USD per year \u003cbr /\u003ewhile working from virtually anywhere on the planet, this job is for you.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThe Company:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Crossover is a well-funded startup that has developed a unique way to find, \u003cbr /\u003ecurate and manage the top 1% of global talent – and connect them to medium and \u003cbr /\u003elarge businesses. We are experiencing rapid growth within the companies we \u003cbr /\u003ecurrently serve and are increasing our staff to expand our business.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Brick and mortar offices are history. The future of our global workforce will \u003cbr /\u003econsist of teams collaborating from every corner of the world. Our platform \u003cbr /\u003econnects customers to the world’s best talent for both technical and \u003cbr /\u003enon-technical contracting. But we don’t just find the best; we also provide the \u003cbr /\u003esoftware tools, training, and expert management to ensure success for long-term \u003cbr /\u003egrowth.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eJob Description:\u003cbr /\u003e\u003cbr /\u003eCrossover is looking for SaaS Software Engineering Managers who demonstrate \u003cbr /\u003eoutstanding managerial skills and also possess the technical background to be a \u003cbr /\u003eSaaS Operations leader through example. You will be expected to understand the \u003cbr /\u003earchitecture for each of a variety of new SaaS products, design high quality \u003cbr /\u003eplans for migrating to our simple consolidated architecture, and then coaching \u003cbr /\u003ea devops team to a successful on time execution. In addition, SaaS Software \u003cbr /\u003eengineering managers will be responsible for improving individual productivity \u003cbr /\u003equarter over quarter through staffing, coaching, process standardization, \u003cbr /\u003eprocess improvement, and automation.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e A successful Software Engineering Manager at Crossover will demonstrate the \u003cbr /\u003efollowing qualities:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eRuthless commitment to scientific debugging, and the unrelenting pursuit of \u003cbr /\u003ethe final \"Root Cause\"\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eThe ability to quickly appropriate architectural decisions favoring simplicity \u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to hands-on engagement as an individual within the team, despite \u003cbr /\u003emanagerial status\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003ePerfectionism: knowing how a job should be done and not stop until it’s done \u003cbr /\u003ecorrectly\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExceptional ability to effectively motivate and manage teams of individuals\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to increasing efficiency in the workplace by continuously \u003cbr /\u003eautomating manual processes\u003cbr /\u003e\u003cbr /\u003e * Excellent remote management skills (you will be using Skype, GoToMeeting, \u003cbr /\u003eGoogle Docs, etc.) \u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eRequired Skills and Experience:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful Software Engineering Manager at Crossover will demonstrate the \u003cbr /\u003efollowing qualifications:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBachelor\u0027s degree in Computer Science\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProven managerial skills with at least 5 years of experience managing multiple \u003cbr /\u003eteams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAt least 5 years of hands-on experience with system administration (including \u003cbr /\u003enetworking and databases on both windows and linux)\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency with SaaS architectures and DevOps\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in AWS and Docker is desired but not mandatory\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience in database monitoring tools and log file analysis tools\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience in running devops teams for production saas products and 24/7 saas \u003cbr /\u003esupport teams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience in escalation tools and ticketing systems like pagerduty, \u003cbr /\u003evictorops, jira\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eOutstanding English communication skills\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eTotal compensation: $50/hr for 40 productive hours per week\u003cbr /\u003e\u003cbr /\u003eLocation: Global (remote)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWe’re one of the few legitimate companies offering high-paying jobs that are \u003cbr /\u003e100% remote, work from home. You never have to fight traffic to the office \u003cbr /\u003eagain and you have the freedom to choose when and where you put in your 40 \u003cbr /\u003ehours to be most effective each week.\u003cbr /\u003e\u003cbr /\u003eTo qualify, please provide a resume/CV demonstrating the required experience \u003cbr /\u003eand skills. From there, to help us find the top 1% of talent, there will be a \u003cbr /\u003eseries of interviews and online examinations. We realize these are challenging \u003cbr /\u003eand can require a decent amount of time so we thank you in advance for your \u003cbr /\u003eefforts.\u003cbr /\u003e\u003cbr /\u003e About Crossover \u003cbr /\u003e Crossover is redefining the way people work. Brick and mortar offices are \u003cbr /\u003ehistory. The future of our global workforce will be built from teams \u003cbr /\u003ecollaborating from every corner of the world. We have embarked on an expedition \u003cbr /\u003eto find and engage with that talent. Crossover has developed a unique method of \u003cbr /\u003efinding, curating, and managing remote contractors. And now, as a fully \u003cbr /\u003edistributed company headquartered in Texas, United States we have more than 800 \u003cbr /\u003epeople working for us in over 50 countries. Our platform connects customers to \u003cbr /\u003ethe world\u0027s best talent for both technical and non-technical employment. But we \u003cbr /\u003edon’t just find the best, we also provide the tools, training, and relationship \u003cbr /\u003ebuilding support to ensure success for long term growth. External URL  apply now\u003cbr /\u003e \u003chttps://www.crossover.com/saas-sem?utm_campaign\u003dJBzsto\u003e  more jobs at \u003cbr /\u003eCrossover \u003c\u003e \u003cbr /\u003eJoin us at Crossover\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eWork from anywhere Choose Your Own Hours Flat organization Work with talented, \u003cbr /\u003einteresting people. Committed to Diversity Competitive Compensation \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eMircea Strugaru \u003cbr /\u003ejava cloud \u003cbr /\u003eview profile \u003c\u003e William Huang \u003cbr /\u003ejavascript java scala domain-driven-design \u003cbr /\u003eview profile \u003c\u003e Luciano Bargmann \u003cbr /\u003ec# web-applications php cakephp \u003cbr /\u003eview profile \u003c\u003e Nagaraj Mandya \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Learn more about Crossover \u003c\u003e more jobs at Crossover \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/crossover?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:35:44 PM",
    "tags": [
      "TITLE1/manager",
      "TECH2/devops",
      "TECH2/aws",
      "REMOTE2/America",
      "TECH2/docker",
      "TECH2/saasops",
      "TECH2/saas",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/130529/saasops-software-engineering-manager-100k-crossover?a\u003dHM4ym3W24Gk",
    "title": "SaaSOps Software Engineering Manager - $100k at Crossover () (allows remote)",
    "content": "SaaSOps Software Engineering Manager - $100k\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eIf you are an elite manager of a devops engineering team or a SaaS operations \u003cbr /\u003eteam and you are eager to gain unprecedented visibility to top technology \u003cbr /\u003ecompanies throughout the globe, employ your technical and managerial skills to \u003cbr /\u003eoversee super high impact devops migrations, and earn $100,000 USD per year \u003cbr /\u003ewhile working from virtually anywhere on the planet, this job is for you.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThe Company:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Crossover is a well-funded startup that has developed a unique way to find, \u003cbr /\u003ecurate and manage the top 1% of global talent – and connect them to medium and \u003cbr /\u003elarge businesses. We are experiencing rapid growth within the companies we \u003cbr /\u003ecurrently serve and are increasing our staff to expand our business.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Brick and mortar offices are history. The future of our global workforce will \u003cbr /\u003econsist of teams collaborating from every corner of the world. Our platform \u003cbr /\u003econnects customers to the world’s best talent for both technical and \u003cbr /\u003enon-technical contracting. But we don’t just find the best; we also provide the \u003cbr /\u003esoftware tools, training, and expert management to ensure success for long-term \u003cbr /\u003egrowth.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eJob Description:\u003cbr /\u003e\u003cbr /\u003eCrossover is looking for SaaS Software Engineering Managers who demonstrate \u003cbr /\u003eoutstanding managerial skills and also possess the technical background to be a \u003cbr /\u003eSaaS Operations leader through example. You will be expected to understand the \u003cbr /\u003earchitecture for each of a variety of new SaaS products, design high quality \u003cbr /\u003eplans for migrating to our simple consolidated architecture, and then coaching \u003cbr /\u003ea devops team to a successful on time execution. In addition, SaaS Software \u003cbr /\u003eengineering managers will be responsible for improving individual productivity \u003cbr /\u003equarter over quarter through staffing, coaching, process standardization, \u003cbr /\u003eprocess improvement, and automation.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e A successful Software Engineering Manager at Crossover will demonstrate the \u003cbr /\u003efollowing qualities:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eRuthless commitment to scientific debugging, and the unrelenting pursuit of \u003cbr /\u003ethe final \"Root Cause\"\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eThe ability to quickly appropriate architectural decisions favoring simplicity \u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to hands-on engagement as an individual within the team, despite \u003cbr /\u003emanagerial status\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003ePerfectionism: knowing how a job should be done and not stop until it’s done \u003cbr /\u003ecorrectly\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExceptional ability to effectively motivate and manage teams of individuals\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to increasing efficiency in the workplace by continuously \u003cbr /\u003eautomating manual processes\u003cbr /\u003e\u003cbr /\u003e * Excellent remote management skills (you will be using Skype, GoToMeeting, \u003cbr /\u003eGoogle Docs, etc.) \u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eRequired Skills and Experience:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful Software Engineering Manager at Crossover will demonstrate the \u003cbr /\u003efollowing qualifications:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBachelor\u0027s degree in Computer Science\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProven managerial skills with at least 5 years of experience managing multiple \u003cbr /\u003eteams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAt least 5 years of hands-on experience with system administration (including \u003cbr /\u003enetworking and databases on both windows and linux)\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency with SaaS architectures and DevOps\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in AWS and Docker is desired but not mandatory\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience in database monitoring tools and log file analysis tools\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience in running devops teams for production saas products and 24/7 saas \u003cbr /\u003esupport teams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience in escalation tools and ticketing systems like pagerduty, \u003cbr /\u003evictorops, jira\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eOutstanding English communication skills\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eTotal compensation: $50/hr for 40 productive hours per week\u003cbr /\u003e\u003cbr /\u003eLocation: Global (remote)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWe’re one of the few legitimate companies offering high-paying jobs that are \u003cbr /\u003e100% remote, work from home. You never have to fight traffic to the office \u003cbr /\u003eagain and you have the freedom to choose when and where you put in your 40 \u003cbr /\u003ehours to be most effective each week.\u003cbr /\u003e\u003cbr /\u003eTo qualify, please provide a resume/CV demonstrating the required experience \u003cbr /\u003eand skills. From there, to help us find the top 1% of talent, there will be a \u003cbr /\u003eseries of interviews and online examinations. We realize these are challenging \u003cbr /\u003eand can require a decent amount of time so we thank you in advance for your \u003cbr /\u003eefforts.\u003cbr /\u003e\u003cbr /\u003e About Crossover \u003cbr /\u003e Crossover is redefining the way people work. Brick and mortar offices are \u003cbr /\u003ehistory. The future of our global workforce will be built from teams \u003cbr /\u003ecollaborating from every corner of the world. We have embarked on an expedition \u003cbr /\u003eto find and engage with that talent. Crossover has developed a unique method of \u003cbr /\u003efinding, curating, and managing remote contractors. And now, as a fully \u003cbr /\u003edistributed company headquartered in Texas, United States we have more than 800 \u003cbr /\u003epeople working for us in over 50 countries. Our platform connects customers to \u003cbr /\u003ethe world\u0027s best talent for both technical and non-technical employment. But we \u003cbr /\u003edon’t just find the best, we also provide the tools, training, and relationship \u003cbr /\u003ebuilding support to ensure success for long term growth. External URL  apply now\u003cbr /\u003e \u003chttps://www.crossover.com/saas-sem?utm_campaign\u003dJBzsto\u003e  more jobs at \u003cbr /\u003eCrossover \u003c\u003e \u003cbr /\u003eJoin us at Crossover\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eWork from anywhere Choose Your Own Hours Flat organization Work with talented, \u003cbr /\u003einteresting people. Committed to Diversity Competitive Compensation \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eMircea Strugaru \u003cbr /\u003ejava cloud \u003cbr /\u003eview profile \u003c\u003e William Huang \u003cbr /\u003ejavascript java scala domain-driven-design \u003cbr /\u003eview profile \u003c\u003e Luciano Bargmann \u003cbr /\u003ec# web-applications php cakephp \u003cbr /\u003eview profile \u003c\u003e Nagaraj Mandya \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Learn more about Crossover \u003c\u003e more jobs at Crossover \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/crossover?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:35:44 PM",
    "tags": [
      "TITLE1/manager",
      "TECH2/devops",
      "TECH2/amazon-web-services",
      "REMOTE2/America",
      "TECH2/docker",
      "TECH2/saasops",
      "TECH2/saas",
      "REMOTE1/100"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/129589/technical-program-manager-100k-crossover?a\u003dHswKcJWJCV2",
    "title": "Technical Program Manager 100K at Crossover () (allows remote)",
    "content": "Do you get excited when you read Ben Horowitz’s definition of a good product \u003cbr /\u003eowner? Do you love bringing valuable software products to market? Do you have a \u003cbr /\u003estrong technical background so that you can work closely with the engineering \u003cbr /\u003eteams, but at the same time do you have an excellent understanding of product \u003cbr /\u003elifecycles? If so, this role is for you.\u003cbr /\u003e\u003cbr /\u003eWe are looking for a world-class Technical Program Manager to help us define \u003cbr /\u003eand build the software products that underpin our continued success. In this \u003cbr /\u003ehands-on role, you will orchestrate the delivery of your products, from setting \u003cbr /\u003especifications to execution and continual refinement, as you receive feedback \u003cbr /\u003efrom Product Managers and other stakeholders.\u003cbr /\u003e\u003cbr /\u003eYou will be working directly with our engineering teams to make our roadmap \u003cbr /\u003ebecome real products. As a result, we are looking for a person that has a good \u003cbr /\u003etechnical software background. We will be measuring your performance based on \u003cbr /\u003ethe volume of quality features being released to production, which emphasizes \u003cbr /\u003ehow tightly you will be working with the various execution teams.\u003cbr /\u003e\u003cbr /\u003eThis is a completely remote position. You can work from anywhere, and will be \u003cbr /\u003ecollaborating with people from all over the world. Therefore, strong \u003cbr /\u003ecommunication and presentation skills will be crucial for your success.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eCompany Description:\u003cbr /\u003e\u003cbr /\u003eAurea enables global enterprises to create transformative experiences for \u003cbr /\u003etheir end customers across a range of industries including retail, travel \u0026 \u003cbr /\u003ehospitality, energy, life sciences, and insurance. Aurea products enable \u003cbr /\u003ecompanies to build, execute, monitor, and optimize the end-to-end customer \u003cbr /\u003ejourney across multiple channels and touchpoints to maximize growth through a \u003cbr /\u003esuperior customer experience. Aurea serves over 2,000 customers worldwide.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eKey Responsibilities:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eWork with the product team to define the product roadmap that will add \u003cbr /\u003esignificant value to Aurea\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCreate and prioritize the product backlog\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCoordinate end-to-end delivery of multiple projects across multiple \u003cbr /\u003eengineering teams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eWork with our engineering teams daily in one scrum team to go from comps to \u003cbr /\u003eworking software\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCreate detailed working packages from Product Managers’ specifications\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eReview the features delivered by the engineering teams and demo them to \u003cbr /\u003eProduct Manager\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eManage a development process with an expected weekly (or faster) production \u003cbr /\u003erelease within a fast-changing and highly agile framework\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eWork Primarily with tech-heavy projects\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eTotal compensation: $100,000/year\u003cbr /\u003e\u003cbr /\u003eLocation: Global (remote)\u003cbr /\u003e 40 hours per week \u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eRequired Skills, Experience, and Education:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003e5+ years of technical product management and/or project management experience\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003e2+ years of experience in programming (coding is not required in this role)\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience bringing software products to market\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBackground with larger proven products \u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience on products actually used in Production\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eDemonstrated ability to create, manage, and prioritize a product backlog that \u003cbr /\u003eadds value to the company\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eFamiliarity with InVision, JIRA, and Sketch software development tools\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAbility to understand technology discussions in the context of a \u003cbr /\u003eservice-oriented architecture and a modern UI tech stack\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAbility to create detailed technical working packages from higher-level \u003cbr /\u003especifications\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExtraordinary technical background\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBachelor’s degree from a top-tier university (degrees in Computer Science, \u003cbr /\u003eMathematics, Statistics, Electrical Engineering, or a related field are \u003cbr /\u003epreferred)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThis role will be a great fit for you if:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou are technical but love developing great products\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou have worked on proven products especially those used in production\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou have Extraordinary technical background\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou love to be creative and innovate in product development\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou can work closely with a team to coordinate, inspire, and execute\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou have a sense of measured urgency—you’re able to make things happen quickly \u003cbr /\u003eand correctly, even with large teams, in tedious situations, and in dynamic, \u003cbr /\u003econstantly changing environments\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou make decisions quickly and own them, and you change your mind as the data \u003cbr /\u003edictates\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou are super detailed-oriented\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eYou are fearless in seeking out more efficient solutions and constantly \u003cbr /\u003echallenge the status quo\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWe’re one of the few legitimate companies offering high-paying jobs that are \u003cbr /\u003e100% remote / work from home. You never have to fight traffic to the office \u003cbr /\u003eagain, and you have the freedom to choose when and where you put in your 40 \u003cbr /\u003ehours to be most effective each week.\u003cbr /\u003e To qualify, please provide a resume / CV demonstrating the required \u003cbr /\u003eexperience and skills. From there, to help us find the top 1% of talent, there \u003cbr /\u003ewill be a series of interviews and online skills examinations. We realize these \u003cbr /\u003eare challenging and can require a decent amount of time, so we thank you in \u003cbr /\u003eadvance for your efforts. \u003cbr /\u003e About Crossover \u003cbr /\u003e Crossover is redefining the way people work. Brick and mortar offices are \u003cbr /\u003ehistory. The future of our global workforce will be built from teams \u003cbr /\u003ecollaborating from every corner of the world. We have embarked on an expedition \u003cbr /\u003eto find and engage with that talent. Crossover has developed a unique method of \u003cbr /\u003efinding, curating, and managing remote contractors. And now, as a fully \u003cbr /\u003edistributed company headquartered in Texas, United States we have more than 800 \u003cbr /\u003epeople working for us in over 50 countries. Our platform connects customers to \u003cbr /\u003ethe world\u0027s best talent for both technical and non-technical employment. But we \u003cbr /\u003edon’t just find the best, we also provide the tools, training, and relationship \u003cbr /\u003ebuilding support to ensure success for long term growth. External URL  apply now\u003cbr /\u003e \u003chttps://www.crossover.com/x/#/redirect/job/444?utm_campaign\u003dJBzsto\u003e  more \u003cbr /\u003ejobs at Crossover \u003c\u003e \u003cbr /\u003eJoin us at Crossover\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eWork from anywhere Choose Your Own Hours Flat organization Work with talented, \u003cbr /\u003einteresting people. Committed to Diversity Competitive Compensation \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eMircea Strugaru \u003cbr /\u003ejava cloud \u003cbr /\u003eview profile \u003c\u003e William Huang \u003cbr /\u003ejavascript java scala domain-driven-design \u003cbr /\u003eview profile \u003c\u003e Luciano Bargmann \u003cbr /\u003ec# web-applications php cakephp \u003cbr /\u003eview profile \u003c\u003e Nagaraj Mandya \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Learn more about Crossover \u003c\u003e more jobs at Crossover \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/crossover?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:35:44 PM",
    "tags": [
      "TECH2/c#",
      "TITLE1/manager",
      "TECH2/java",
      "REMOTE2/America",
      "TECH2/.net",
      "TECH2/c++",
      "REMOTE1/100",
      "TECH2/agile"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/104914/software-engineering-manager-100k-crossover?a\u003dzbsLg1KaS9a",
    "title": "Software Engineering Manager - $100k at Crossover () (allows remote)",
    "content": "Software Engineering Manager\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eIf you are an elite Software Engineering Manager eager to gain unprecedented \u003cbr /\u003evisibility to the top technology companies throughout the globe, employ your \u003cbr /\u003etechnical and managerial skills to oversee cutting-edge software in a \u003cbr /\u003ehigh-intensity environment, and earn $100,000 USD per year while working from \u003cbr /\u003evirtually anywhere on the planet, this job is for you.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThe Company:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Crossover is a well-funded startup that has developed a unique way to find, \u003cbr /\u003ecurate and manage the top 1% of global talent – and connect them to medium and \u003cbr /\u003elarge businesses. We are experiencing rapid growth within the companies we \u003cbr /\u003ecurrently serve and are increasing our staff to expand our business.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e Brick and mortar offices are history. The future of our global workforce will \u003cbr /\u003econsist of teams collaborating from every corner of the world. Our platform \u003cbr /\u003econnects customers to the world’s best talent for both technical and \u003cbr /\u003enon-technical contracting. But we don’t just find the best; we also provide the \u003cbr /\u003esoftware tools, training, and expert management to ensure success for long-term \u003cbr /\u003egrowth.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eJob Description:\u003cbr /\u003e\u003cbr /\u003eCrossover is looking for Software Engineering Managers who demonstrate \u003cbr /\u003eoutstanding managerial skills as well as the technical background to deeply \u003cbr /\u003eunderstand the code their teams are developing. You will be expected to \u003cbr /\u003edemonstrate both a mastery of the technical skills associated with the projects \u003cbr /\u003eat hand, as well as the managerial ability to motivate, build, and monitor your \u003cbr /\u003eteam. Specifically, you will be responsible for overseeing from 4 to 6 teams of \u003cbr /\u003e3 to 4 individuals. You will own the process of breaking specifications created \u003cbr /\u003eby the product management team into clear tasks and timelines, as well as \u003cbr /\u003eassembling the results into high value, reusable components. Under your \u003cbr /\u003eleadership, we expect to see consistent improvement in both static code quality \u003cbr /\u003emetrics and weekly production.\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eA successful Software Engineering Manager at Crossover will demonstrate the \u003cbr /\u003efollowing qualities:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eRuthless commitment to impeccable code quality\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eDeep understanding of a wide range of the latest technologies and \u003cbr /\u003earchitectural approaches\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAdvanced proficiency in one or more core programming languages (Java or C# or \u003cbr /\u003eRuby or PHP), related frameworks, and best practices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eThe ability to make appropriate technical decisions, review design and code, \u003cbr /\u003eand ensure best technical practices\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to hands-on engagement as an individual within the team, despite \u003cbr /\u003emanagerial status\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eWillingness to embrace iterative development as the means for building \u003cbr /\u003eseamless products\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003ePerfectionism: knowing how a job should be done and not stop until it’s done \u003cbr /\u003ecorrectly\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExceptional ability to effectively motivate and manage teams of individuals\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCommitment to increasing efficiency in the workplace by continuously \u003cbr /\u003eautomating parts of the software engineering process\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExcellent remote management skills (you will be using Skype, GoToMeeting, \u003cbr /\u003eGoogle Docs, etc.)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eRequired Skills and Experience:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eA successful Software Engineering Manager at Crossover will demonstrate the \u003cbr /\u003efollowing qualifications:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eBachelor\u0027s degree in Computer Science, Computer Engineering, or Electrical \u003cbr /\u003eEngineering\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProven managerial skills with at least 5 years of experience managing multiple \u003cbr /\u003eteams\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eExperience with Cloud architecture and DevOps\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eAt least 5 years of experience in hands-on Java and/or .NET programming and/or \u003cbr /\u003eRuby and/ or PHP\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in Agile, SDLC, or SLA\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eProficiency in AWS and TDD is desired but not mandatory\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eOutstanding English communication skills\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eTotal compensation: $50/hr for 40 productive hours per week\u003cbr /\u003e\u003cbr /\u003eLocation: Global (remote)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWe’re one of the few legitimate companies offering high-paying jobs that are \u003cbr /\u003e100% remote, work from home. You never have to fight traffic to the office \u003cbr /\u003eagain and you have the freedom to choose when and where you put in your 40 \u003cbr /\u003ehours to be most effective each week.\u003cbr /\u003e\u003cbr /\u003eTo qualify, please provide a resume/CV demonstrating the required experience \u003cbr /\u003eand skills. From there, to help us find the top 1% of talent, there will be a \u003cbr /\u003eseries of interviews and online examinations. We realize these are challenging \u003cbr /\u003eand can require a decent amount of time so we thank you in advance for your \u003cbr /\u003eefforts.\u003cbr /\u003e\u003cbr /\u003e About Crossover \u003cbr /\u003e Crossover is redefining the way people work. Brick and mortar offices are \u003cbr /\u003ehistory. The future of our global workforce will be built from teams \u003cbr /\u003ecollaborating from every corner of the world. We have embarked on an expedition \u003cbr /\u003eto find and engage with that talent. Crossover has developed a unique method of \u003cbr /\u003efinding, curating, and managing remote contractors. And now, as a fully \u003cbr /\u003edistributed company headquartered in Texas, United States we have more than 800 \u003cbr /\u003epeople working for us in over 50 countries. Our platform connects customers to \u003cbr /\u003ethe world\u0027s best talent for both technical and non-technical employment. But we \u003cbr /\u003edon’t just find the best, we also provide the tools, training, and relationship \u003cbr /\u003ebuilding support to ensure success for long term growth. External URL  apply now\u003cbr /\u003e \u003chttps://www.crossover.com/software-engineering-manager?utm_campaign\u003dJBzsto\u003e  \u003cbr /\u003emore jobs at Crossover \u003c\u003e \u003cbr /\u003eJoin us at Crossover\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eWork from anywhere Choose Your Own Hours Flat organization Work with talented, \u003cbr /\u003einteresting people. Committed to Diversity Competitive Compensation \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eMircea Strugaru \u003cbr /\u003ejava cloud \u003cbr /\u003eview profile \u003c\u003e William Huang \u003cbr /\u003ejavascript java scala domain-driven-design \u003cbr /\u003eview profile \u003c\u003e Luciano Bargmann \u003cbr /\u003ec# web-applications php cakephp \u003cbr /\u003eview profile \u003c\u003e Nagaraj Mandya \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Learn more about Crossover \u003c\u003e more jobs at Crossover \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/crossover?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:35:44 PM",
    "tags": [
      "TECH2/c#",
      "TITLE1/manager",
      "TECH2/java",
      "REMOTE2/locals-only",
      "TECH2/.net",
      "REMOTE1/100",
      "TECH2/agile"
    ]
  },
  {
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13606419",
    "title": "ClickMechanic | Head of Engineering \u0026 Full Stack Engineers | London, UK | Full-Time | Onsite",
    "content": "ClickMechanic | Head of Engineering \u0026 Full Stack Engineers | London, UK | \u003cbr /\u003eFull-Time | Onsite\u003cbr /\u003eClickMechanic brings trust \u0026 transparency to car repair. We give real-time \u003cbr /\u003eindustry-standard quotes \u0026 enable customers to quickly book a vetted mechanic \u003cbr /\u003eonline.\u003cbr /\u003e\u003cbr /\u003eYou\u0027ll join a small team of developers working on a huge consumer pain point. \u003cbr /\u003eOur stack is focused around Ruby on Rails and PostgreSQL.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re hiring for:\u003cbr /\u003e\u003cbr /\u003e* Head of Engineering / Lead Engineer - https://goo.gl/r4geD7 \u003cbr /\u003e\u003chttps://goo.gl/r4geD7\u003e\u003cbr /\u003e\u003cbr /\u003e* Senior / Mid-level Full Stack Engineers - https://goo.gl/Fd59rW \u003cbr /\u003e\u003chttps://goo.gl/Fd59rW\u003e\u003cbr /\u003e\u003cbr /\u003eSalary: £40k-£80k, dependent on role and experience, with equity also.\u003cbr /\u003e\u003cbr /\u003eProcess: phone/skype interview \u003d\u003e remote coding exercise \u003d\u003e 1 on-site \u003cbr /\u003einterview. We can be flexible and some people complete the coding exercise \u003cbr /\u003eon-site.\u003cbr /\u003e\u003cbr /\u003eSend any questions to jobs+felix@clickmechanic.com \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 9, 2017 2:28:06 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE1/100",
      "REMOTE2/America/East"
    ]
  },
  {
    "sourceName": "jobs.remotive.io",
    "url": "http://automattic.com/work-with-us/theme-wrangler/",
    "title": "Theme Wrangler at Automattic, Located Anywhere, engineering",
    "content": "Theme Wrangler — Automattic \u003cbr /\u003eAutomattic \u003c\u003e\u003cbr /\u003e\u003cbr /\u003e * Home \u003c\u003e \u003cbr /\u003e * About Us \u003c\u003e \u003cbr /\u003e * News \u003c\u003e \u003cbr /\u003e * Work With Us \u003c\u003e \u003cbr /\u003eTheme Wrangler\u003cbr /\u003eYou live and breathe WordPress themes. You are equally at home in \u003cbr /\u003ePhotoshop/Gimp, PHP, CSS, or the terminal. You’ve built numerous \u003cbr /\u003eWordPress-as-CMS sites from scratch. Everything you’ve touched is GPL. You’ve \u003cbr /\u003eprobably created your own starter theme. Come help us wrangle the wild and \u003cbr /\u003ewoolly world of themes.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e * World-class HTML + CSS + WordPress skills. \u003cbr /\u003e * Nuanced sense of design. \u003cbr /\u003e * Understanding of Open Source and the various licenses around it. \u003cbr /\u003e * Ability to take a project from idea to execution to website to blog. \u003cbr /\u003e * JavaScript and jQuery skills are a bonus. \u003cbr /\u003e * Excellent writing and documentation skills and the ability to teach people \u003cbr /\u003eare a bonus. \u003cbr /\u003eHow to Apply\u003cbr /\u003e Does this sound interesting? If yes, please send a short email to jobs @ this \u003cbr /\u003edomain telling us about yourself and attach a résumé. Let us know what you can \u003cbr /\u003econtribute to the team. Include the title of the position you’re applying for \u003cbr /\u003eand your name in the subject. Proofread! Make sure you spell and capitalize \u003cbr /\u003eWordPress and Automattic correctly. We are lucky to receive hundreds of \u003cbr /\u003eapplications for every position, so try to make your application stand out. If \u003cbr /\u003eyou apply for multiple positions or send multiple emails there will be one \u003cbr /\u003ereply. If you\u0027re reading this on a site other than automattic.com please make \u003cbr /\u003esure you visit automattic.com/work-with-us for the latest details on applying.\u003cbr /\u003e← Work With Us \u003c\u003e\u003cbr /\u003e\u003cbr /\u003eAll Jobs Require\u003cbr /\u003e\u003cbr /\u003e * Great communication skills. We’re a distributed team, so frequent and clear \u003cbr /\u003ewritten communication is a must. \u003cbr /\u003e * Self-driven work ethic. You need to be a self-starter who loves taking \u003cbr /\u003einitiative and seeing things through to completion. \u003cbr /\u003e * Curiosity and the desire to learn. Our business is changing and growing \u003cbr /\u003efast, who knows what will be the skills of tomorrow? Flexibility is key. \u003cbr /\u003eContact Us \u003c\u003e Press \u003c\u003e Privacy Policy \u003c\u003e  \u003chttps://twitter.com/automattic\u003e  \u003cbr /\u003e\u003chttp://www.facebook.com/AutomatticInc\u003e  \u003chttps://www.youtube.com/c/automattic\u003e \u003cbr /\u003e * Home \u003c\u003e \u003cbr /\u003e * About Us \u003c\u003e \u003cbr /\u003e * News \u003c\u003e \u003cbr /\u003e * Work With Us \u003c\u003e \u003cbr /\u003e© Automattic Inc., purveyors of fine blogging services since 2005. Thank you \u003cbr /\u003efor your time.",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "TITLE1/manager",
      "REMOTE1/50",
      "REMOTE2/locals-only"
    ]
  },
  {
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/129397/technical-account-manager-foursquare?a\u003dHoxe3YAYR2g",
    "title": "Technical Account Manager at Foursquare (Shanghai, China) (allows remote)",
    "content": "About Foursquare:\u003cbr /\u003e\u003cbr /\u003eSince our inception in 2009, Foursquare has been a leading force in changing \u003cbr /\u003ehow location information enriches our real-world and digital lives. As a \u003cbr /\u003elocation intelligence company, Foursquare is comprised of two well-known \u003cbr /\u003econsumer apps, Foursquare and Swarm, as well as thriving media and enterprise \u003cbr /\u003eproducts.  Our B2B offerings include Places (for developers), Pinpoint and \u003cbr /\u003eAttribution (for marketers), and Place Insights (for analysts, based on the \u003cbr /\u003eworld\u0027s largest foot traffic panel). With more than 200 people across our \u003cbr /\u003eoffices in New York, San Francisco, and in sales offices around the globe, \u003cbr /\u003ewe’re dedicated to our trailblazing mission—enriching consumer experiences and \u003cbr /\u003einforming business decisions with location intelligence.  \u003cbr /\u003e\u003cbr /\u003eAbout the Position:\u003cbr /\u003e\u003cbr /\u003eFoursquare is seeking a Technical Account Manager (TAM) to work alongside our \u003cbr /\u003eBusiness Development team. The TAM will work closely with developers and \u003cbr /\u003epartners in China and Asia-Pacific in effectively using Foursquare data via \u003cbr /\u003eAPIs and SDKs to identify location opportunity, and will best take advantage of \u003cbr /\u003eour industry-leading location cloud platform and all its components. The Asia \u003cbr /\u003eBusiness Development team is an agile team that has secured several large-data \u003cbr /\u003elicensing contracts with renowned brands in the tech, consumer products, and \u003cbr /\u003emarketing industries.You will leverage your expertise in data, location \u003cbr /\u003eservices and the mobile industry to understand Foursquare’s data \u0026 solutions, \u003cbr /\u003eand help our clients in Asia scale globally with unique solutions that fit \u003cbr /\u003etheir needs. In order to be successful, you will manage multiple clients \u003cbr /\u003esimultaneously while working closely with key internal stakeholders in Asia and \u003cbr /\u003eUS. Your work will play a crucial part in generating company revenue \u0026 ensuring \u003cbr /\u003epartner success.\u003cbr /\u003e\u003cbr /\u003eRESPONSIBILITIES\u003cbr /\u003e\u003cbr /\u003e * Be both highly technical and effectively act as a true partner of our \u003cbr /\u003eclients. \u003cbr /\u003e * Work together with Business Development team to define and execute on \u003cbr /\u003estrategy to drive partner success. \u003cbr /\u003e * Work with regional and local teams to translate solution ideas into \u003cbr /\u003efeasible technical solutions \u003cbr /\u003e * Enable Foursquare’s partners to be successful by serving as the primary \u003cbr /\u003etechnical point of contact with data partners in the pre-sales, implementation \u003cbr /\u003eand post-sales phases \u003cbr /\u003e * Be a subject matter technical expert, and have influence and support of \u003cbr /\u003epartners and internal teams at Foursquare. \u003cbr /\u003e * Build relationships with strategic partners in order to ensure their \u003cbr /\u003eongoing success working with Foursquare. \u003cbr /\u003e * Manage relationship with technical contacts (including high-profile tech \u003cbr /\u003ecompanies) and contact them pro-actively when there are new ideas or features \u003cbr /\u003eor opportunities that could be relevant to them \u003cbr /\u003e * Work cross-functionally with Foursquare business development \u0026 technical \u003cbr /\u003eteams in Asia and America \u003cbr /\u003e * Be the technical voice in the room when coming up with creative solutions \u003cbr /\u003eto meet our partners’ needs. \u003cbr /\u003e * Interact with and support our broader community of thousands of developers \u003cbr /\u003eusing the Foursquare API. \u003cbr /\u003e * Ultimately help Foursquare successfully acquire more long-term data \u0026 \u003cbr /\u003etechnology customers \u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eREQUIREMENTS\u003cbr /\u003e\u003cbr /\u003e * Software development experience in languages and environments such as \u003cbr /\u003eScala, Java, Python. \u003cbr /\u003e * Solid communication and skills, and capability to present to large \u003cbr /\u003etechnical audiences. \u003cbr /\u003e * Willingness and ability to travel approximately 10-25% of the time. \u003cbr /\u003e * 3-5 years successful track record working in, or with mobile application \u003cbr /\u003edevelopers including experience with Android/iOS and the mobile technology \u003cbr /\u003estack. \u003cbr /\u003e * Deep understanding of APIs and application development and architecture. \u003cbr /\u003eYou understand the tradeoffs that our customers’ engineers make every day and \u003cbr /\u003ecan help them make the best decisions. \u003cbr /\u003e * You are a code-native with a “get stuff done” attitude and not afraid to \u003cbr /\u003ewhip up a script, or even learn a new programming language—all in the name of \u003cbr /\u003ehelping our partners succeed. \u003cbr /\u003e * Love location-based data, tech, apps, analytics \u0026 intelligence \u003cbr /\u003e * Strong English writing, speaking and presentation skills.   \u003cbr /\u003e * Chinese language required \u003cbr /\u003e * Creativity to brainstorm and discuss new uses and use-cases for data in any \u003cbr /\u003eindustry vertical \u003cbr /\u003eIn order to be considered for this role, you must complete the “Additional \u003cbr /\u003eQuestions” section of the application.\u003cbr /\u003eExternal URL  apply now  \u003cbr /\u003e\u003chttps://jobs.lever.co/foursquare/92dd16e6-147e-4a8d-8db3-d37dc2b13f5f\u003e  more \u003cbr /\u003ejobs at Foursquare \u003c\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:35:44 PM",
    "tags": [
      "TITLE1/manager",
      "TECH2/java",
      "TECH2/scala",
      "REMOTE2/America",
      "TECH2/mobile",
      "REMOTE1/50",
      "TECH2/python",
      "TECH2/api"
    ]
  }
]
}
