{
  "items": [
  {
    "id": "UD-Ch89cSxy2y1B1tDxMmw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/138003/developer-manager-seicho-ltd?a=KhtISv5dNYI",
    "title": "Developer Manager at Seicho Ltd. (Khwaeng Phra Khanong Nuea, Thailand) (allows remote)",
    "content": "<div>        <div>                <div>            <div>                                    <div>                    <div>                        <div>                            <h2><a rel=&quot;nofollow&quot;>Developer Manager</a>                            </h2>                                <span>                                            $60k - 84k                                                </span>                        </div><a rel=&quot;nofollow&quot;>Seicho Ltd.</a>                    </div>                </div>                <div>                    <div>                                                        </div>                </div>                <div></div>            </div>        </div>                        </div>        <div>            <h3>                Job Description            </h3>            <div><ul><li>Lead the planning and implementation of various functions of the product across various mobile and web platforms.</li><li>Define project tasks and resource requirements for respective platform work streams</li><li>Track project deliverables using appropriate tracking tools</li><li>Provide direction and support to project team with quality assurance and constant monitoring with reports on progress of the project(s) to key stakeholders</li><li>Identify problems and solutions followed by managing the changes and interventions to achieve project outputs.&nbsp;</li><li>Stay up to date on the latest development trends</li><li>Understand the importance of product revenue mix in a marketing business</li></ul>            </div>        </div>            <h3>                Skills &amp; Requirements            </h3>            <div><ul><li>Past experience in IT project management and building development teams in-house or remotely</li><li>Good understanding of responsive web and mobile design and how designs will be adapted for specific devices (including responsive grids)</li><li>5+ years of full Stack experience building web apps (HTML5 / CSS3 / JS / Python / Go / PHP / Lua /NGINX / LINUX)</li><li>Familiarity with a wide range of APIs and applications wouldd be great</li><li>Good command of English Mac and Windows platform is a plus</li><li>Good command of English</li><li>Love day to day challenges, problem solving, can-do attitude.</li></ul>            </div>            <h3>                About Seicho Ltd.            </h3>            <div><p>Seicho is one of the steadiest growing companies founded in Hong Kong, now based in Thailand that provides <strong>online solution</strong> to clients from around the world since 2015. Based in the vibrant city of Bangkok, we were created by a group of experts in the field of performance solutions, fraud detection, and data analytics. Since then, we have grown to a team of nearly 25 strong with half based in Bangkok made up of locals and around the world. Our key services include mobile user acquisition, full stack advertising platforms, marketing intelligence that serve an ever-evolving industry that is becoming mobile first.</p><p>We strive to one day, very soon to be a significant player in the mobile first and online industry and for that to happen, want best people come work with us. Life at Seicho is not a job or career, but a lifestyle choice that’s filled with challenges and fun along the way. We may be a budding startup, but the benefits are anything but that!&nbsp;</p><p>We are looking for experienced and passionate individuals to play a significant role in taking our products to the next level. Reporting to the senior management directly, this role will require a mix of experience and ability to out of the box thinking.&nbsp; The role will also require one with great developer management skills and create a cohesive system among our local and overseas development team.&nbsp;</p>            </div>                        <p><em>                    The <a href=&quot;http://www.joelonsoftware.com/articles/fog0000000043.html&quot; rel=&quot;nofollow&quot;>Joel Test</a> is a twelve-question measure of the quality of a software team.                </em>            </p>                                    </div>",
    "urlFetchPending": false,
    "published": "May 1, 2017 4:24:18 PM",
    "tags": [
      "TECH2_html5",
      "TECH2_python",
      "TECH2_php",
      "TITLE1_manager",
      "TZ_Europe",
      "TECH2_javascript",
      "REMOTE1_100",
      "WORKAUTH_US",
      "TECH2_go"
    ],
    "tagsNames1": [
      "100% remote",
      "Europe timezones",
      "US work authorisation"
    ],
    "tagsNames2": [
      "go",
      "html5",
      "javascript",
      "php",
      "python"
    ]
  },
  {
    "id": "2kNqBWFMTZ-gmTWCPbS2zw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/129589/technical-program-manager-100k-crossover?a=HswKcJWJCV2",
    "title": "Technical Program Manager 100K at Crossover () (allows remote)",
    "content": "<div>        <div>                <div>            <div>                                    <div>                    <div>                        <div>                            <h2><a rel=&quot;nofollow&quot;>Technical Program Manager 100K</a>                            </h2>                        </div><a rel=&quot;nofollow&quot;>Crossover</a>                    </div>                </div>                <div>                    <div>                                                        </div>                </div>                <div></div>            </div>        </div>                        </div>        <div>            <h3>                Job Description            </h3>            <div><p>Do you get excited when you read Ben Horowitz’s definition of a good product owner? Do you love bringing valuable software products to market? Do you have a strong technical background so that you can work closely with the engineering teams, but at the same time do you have an excellent understanding of product lifecycles? If so, this role is for you.</p> <p>We are looking for a world-class Technical Program Manager to help us define and build the software products that underpin our continued success. In this hands-on role, you will orchestrate the delivery of your products, from setting specifications to execution and continual refinement, as you receive feedback from Product Managers and other stakeholders.</p> <p>You will be working directly with our engineering teams to make our roadmap become real products. As a result, we are looking for a person that has a good technical software background. We will be measuring your performance based on the volume of quality features being released to production, which emphasizes how tightly you will be working with the various execution teams.</p> <p>This is a completely remote position. You can work from anywhere, and will be collaborating with people from all over the world. Therefore, strong communication and presentation skills will be crucial for your success.</p> <br> <p>Company Description:</p> <p>Aurea enables global enterprises to create transformative experiences for their end customers across a range of industries including retail, travel &amp; hospitality, energy, life sciences, and insurance. Aurea products enable companies to build, execute, monitor, and optimize the end-to-end customer journey across multiple channels and touchpoints to maximize growth through a superior customer experience. Aurea serves over 2,000 customers worldwide.</p> <br> <p>Key Responsibilities:</p> <ul> <li><p>Work with the product team to define the product roadmap that will add significant value to Aurea</p> </li> <li><p>Create and prioritize the product backlog</p> </li> <li><p>Coordinate end-to-end delivery of multiple projects across multiple engineering teams</p> </li> <li><p>Work with our engineering teams daily in one scrum team to go from comps to working software</p> </li> <li><p>Create detailed working packages from Product Managers’ specifications</p> </li> <li><p>Review the features delivered by the engineering teams and demo them to Product Manager</p> </li> <li><p>Manage a development process with an expected weekly (or faster) production release within a fast-changing and highly agile framework</p> </li> <li><p>Work Primarily with tech-heavy projects</p> </li> </ul> <br> <p>Total compensation: $100,000/year</p> <p>Location: Global (remote)</p> 40 hours per week            </div>        </div>            <h3>                Skills &amp; Requirements            </h3>            <div><p>Required Skills, Experience, and Education:</p> <ul> <li><p>5+ years of technical product management and/or project management experience</p> </li> <li><p>2+ years of experience in programming (coding is not required in this role)</p> </li> <li><p>Experience bringing software products to market</p> </li> <li><p>Background with larger proven products </p> </li> <li><p>Experience on products actually used in Production</p> </li> <li><p>Demonstrated ability to create, manage, and prioritize a product backlog that adds value to the company</p> </li> <li><p>Familiarity with InVision, JIRA, and Sketch software development tools</p> </li> <li><p>Ability to understand technology discussions in the context of a service-oriented architecture and a modern UI tech stack</p> </li> <li><p>Ability to create detailed technical working packages from higher-level specifications</p> </li> <li><p>Extraordinary technical background</p> </li> <li><p>Bachelor’s degree from a top-tier university (degrees in Computer Science, Mathematics, Statistics, Electrical Engineering, or a related field are preferred)</p> </li> </ul> <br> <p>This role will be a great fit for you if:</p> <ul> <li><p>You are technical but love developing great products</p> </li> <li><p>You have worked on proven products especially those used in production</p> </li> <li><p>You have Extraordinary technical background</p> </li> <li><p>You love to be creative and innovate in product development</p> </li> <li><p>You can work closely with a team to coordinate, inspire, and execute</p> </li> <li><p>You have a sense of measured urgency—you’re able to make things happen quickly and correctly, even with large teams, in tedious situations, and in dynamic, constantly changing environments</p> </li> <li><p>You make decisions quickly and own them, and you change your mind as the data dictates</p> </li> <li><p>You are super detailed-oriented</p> </li> <li><p>You are fearless in seeking out more efficient solutions and constantly challenge the status quo</p> </li> </ul> <br> <p>We’re one of the few legitimate companies offering high-paying jobs that are 100% remote / work from home. You never have to fight traffic to the office again, and you have the freedom to choose when and where you put in your 40 hours to be most effective each week.</p> To qualify, please provide a resume / CV demonstrating the required experience and skills. From there, to help us find the top 1% of talent, there will be a series of interviews and online skills examinations. We realize these are challenging and can require a decent amount of time, so we thank you in advance for your efforts.            </div>            <h3>                About Crossover            </h3>            <div>Crossover is redefining the way people work. Brick and mortar offices are history. The future of our global workforce will be built from teams collaborating from every corner of the world. We have embarked on an expedition to find and engage with that talent. Crossover has developed a unique method of finding, curating, and managing remote contractors. And now, as a fully distributed company headquartered in Texas, United States we have more than 800 people working for us in over 50 countries. Our platform connects customers to the world's best talent for both technical and non-technical employment. But we don’t just find the best, we also provide the tools, training, and relationship building support to ensure success for long term growth.            </div>                        </div>",
    "urlFetchPending": false,
    "published": "May 1, 2017 4:24:18 PM",
    "tags": [
      "TECH2_c++",
      "TZ_America",
      "TECH2_agile",
      "TECH2_c#",
      "TITLE1_manager",
      "REMOTE1_100",
      "TECH2_java",
      "TECH2_.net",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": [
      ".net",
      "agile",
      "c#",
      "c++",
      "java"
    ]
  },
  {
    "id": "xoLHViWKS9OKXJSBpD7ViQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "indeed.com-1",
    "url": "http://www.indeed.com/job/Performance-Engineering-Manager-at-Swatcloud-in-New-York,-NY-0108158675ba30a6",
    "title": "Performance Engineering Manager - Swatcloud - New York, NY",
    "content": "<div><b>Performance Engineering Manager</b><br><span>Swatcloud</span>     -<span>New York, NY</span>    </div><span><p><b>Description</b></p><p>YOUR RESPONSIBILITIES</p><ul><li>Be responsible to recruit and maintain a team of performance engineers with a mix of full-time, contractors as well as college-hires</li><li>Serve as a direct manager of FTE performance test engineers. Address their onboarding, performance, career goals and growth through a mix of appropriate assignments, work review, coaching and training</li><li>Serve as manager of remote/on-site consultant performance test engineers. Address their onboarding, performance, and effective engagement on teams</li><li>Be responsible to keep up-to-date with the latest performance testing tools and technologies so as to serve as an expert. Be aware of vendor-alternatives to address spaces where open source toolset does not provide sufficient coverage</li><li>Be responsible to clearly communicate performance test strategy to the performance engineers as well as other stakeholders. Serve as an evangelist for Performance engineering. Clearly communicate the benefits, costs and limitations of performance testing</li><li>Be responsible to setup and setup reporting of KPIs for the performance test team, and take action on the data</li><li>Ensure via validation, or via inspection, that all application changes do not have a negative impact on performance</li><li>Be responsible to ensure that performance tests are conducted in an efficient manner to guarantee application performance, at optimal cost</li></ul><p>Qualifications</p><ul><li>Managerial competence, which supports team organization and management</li><li>Day-to-day management of 6-8 performance engineers</li><li>Supervision of contractors or offshore engineers as part of extended team</li><li>Defines performance engineering best practices and coaches team to effectively apply them</li><li>Reviews technology stack in use by project teams and reviews for fit with performance test tools in use</li><li>Engages with architects, development managers and leads and other leaders to update performance test tooling and practices</li><li>Uses a combination of internal and external training resources to keep team abreast of the technologies selected for performance testing</li><li>Applies metrics to monitor performance of performance engineers, and pushes for demonstrable continuous improvement</li><li>Technical competence, which supports Performance Testing</li><li>Solid scripting in Beanshell programming expertise with Jmeter and/or http/html web, Java, Oracle NCA and web services protocols of LoadRunner</li><li>Jenkins, Maven, and Jmeter CI experience</li><li>Expert Level programming skills in Beanshell and C</li><li>Very strong Linux Skills.</li><li>Diagnostic Tools like New Relic or App Dynamics is needed.</li><li>Good Knowledge of JBoss app server tuning , AWS systems, Cloud watch, Load Balancers in AWS</li><li>Ability to setup complex test scenarios to model production workloads.</li><li>Ability to monitor JVMs, analyze heap dumps, analyze queries, analyze logs and memory profiling.</li><li>Ability to monitor and collect result data, analyze and pinpoint bottlenecks and guide developers and other in fixing performance issues.</li><li>Experience diagnosing and debugging performance bottlenecks by interpreting test results and analyzing metrics gathered using tools</li><li>Database knowledge, indexes, and SQL optimization techniques.</li><li>Plan, design, execute and maintain different types of performance tests like load, stress, endurance, spike, capacity etc.</li><li>Other competence, which supports Quality</li><li>Good team player with the ability to handle multiple concurrent priorities in a fast paced environment.</li><li>Strong interpersonal, written and oral communication skills.</li><li>Strong adherent to Agile principles in letter as well as in spirit. Knows and follows Agile convention, but importantly internalizes the Agile spirit</li><li>Strong communicator – able to work closely with counterparts in a cross-functional, Agile team setting, to understand product needs and implement the right performance tests</li><li>Understands the importance of data insofar as to analyze reported issues, inform severity of defects, inform the priority of tests</li><li>Understands the importance of metrics in the modern software organization and supports the automated generation of such metrics as an outcome of normal work. Observes patterns in the metrics and takes appropriate action</li><li>Can enforce process and best practices to team members as well as teams that engage performance test engineers</li></ul><p>Job Type: Full-time</p></span>",
    "urlFetchPending": false,
    "published": "Apr 27, 2017 4:08:45 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "lkfQulp-SeK3tqwRc3v-Fw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3575-head-of-marketing-pr-bigscreen",
    "title": "Head of Marketing & PR @ Bigscreen",
    "content": "<h2>              Head of Marketing &amp; PR<small> @ Bigscreen</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-03-15 20:34</p></dd>          <dt><span>Description</span></dt>          <dd><p>Bigscreen is one of the most popular and widely used VR apps in the world. Use cases of Bigscreen include playing your fav Steam games in VR, watching movies in a virtual theater with friends, and even working and collaborating with colleagues in a virtual office.</p><p>We're looking for a hungry, scrappy &amp; talented person to take charge of marketing and PR at Bigscreen. Your job is to communicate the value proposition of Bigscreen - &quot;what, why, and how&quot; - to the world.</p><p>You'll also be responsible for content marketing, social media, coordinating press coverage for product launches. Content marketing work includes writing blog posts and creating visual (screenshot/GIF/video) content to explain and promote use cases of Bigscreen. You'll get to work remotely, a budget to buy and play videogames, write compelling blog posts, create engaging content for YouTube and Twitter, and build the Bigscreen brand.</p><p><strong>Examples</strong></p><p>This article and video describes how people love using <a href=&quot;https://uploadvr.com/played-overwatch-vr-using-bigscreen/&quot; rel=&quot;nofollow&quot;>Bigscreen to play Overwatch in VR with their friends</a>. This reddit post shows <a href=&quot;https://www.reddit.com/r/gaming/comments/5b4k9d/rocket_league_virtual_lan_party_in_vr/&quot; rel=&quot;nofollow&quot;>Bigscreen Rocket League virtual LAN party</a>, and this shows what it's like to play Civilization VI in Bigscreen. This article covers business use cases where <a href=&quot;http://uploadvr.com/virtual-office-commute-vr-replacement/&quot; rel=&quot;nofollow&quot;>teams use Bigscreen to collaborate and work together</a>.</p><p><strong>About Bigscreen</strong></p><p>Founded in 2014, Bigscreen is a California-based technology company creating an immersive virtual reality telepresence platform that aims to revolutionize the way people work, play, hangout, and collaborate. Since its beta launch in March 2016, it has become one of the most popular and highly rated VR apps. Power users spend 20-30 hours per week in Bigscreen, making it one of the most widely used &quot;killer apps&quot; in the industry.</p><p>Join us and help design the future of computing and collaboration.</p><p><strong>Requirements</strong></p><ul><li>Strong writing skills with prior published work in blogs or news sites</li><li>Strong understanding of VR and AR</li><li>Familiarity with a wide range of gaming genres and popular PC/console games</li><li>Good communication skills in English</li><li>Experience working independently and remotely</li><li>Experience using Bigscreen</li><li>Must own a Vive or Rift</li><li>Must enjoy playing PC &amp; console videogames</li></ul><p><strong>Bonus Skills</strong></p><ul><li>Design and photo editing skills with Adobe Photoshop (or similar)</li><li>Video production and editing skills, specifically video game trailers</li><li>Experience with video editing software (Premiere Pro, Final Cut Pro, or similar)</li><li>Experience with making VR videos using green screens (mixed reality)</li></ul><p><strong>Responsibilities</strong></p><ul><li>Improve user acquisition and retention by effectively communicating Bigscreen's value propositions and use cases to new users</li><li>Content marketing (writing blog posts &amp; help center docs, capturing &amp; editing videos, GIFs, and screenshots)</li><li>Press outreach (pitch journalists and secure coverage for major product launches and announcements)</li><li>Please send us examples of published work, blog posts, game reviews, YouTube videos, and other content you've created.</li></ul><p><strong>Location is remote.</strong></p><p>Once hired, you'll have access to any hardware you need ranging from the latest VR headsets to PCs, gaming consoles, as well as a budget to buy and play the latest games and movies.</p><p>This can be a part-time/freelance or a full-time position. Like all positions at Bigscreen, this job will start out as a 2-8 week paid contract (a trial period). If that works out well, we can discuss a full-time role.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Mar 15, 2017 10:34:29 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "rmU6YeoiQYicCxiYwO6UZg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/55713/engineering-manager-director-at-doctorlink/",
    "title": "Engineering Manager / Director",
    "content": "Is writing the first line of code on a brand new product something that scares you? What about hiring an engineering team? Setting up the tools, infrastructure, defining the architecture in the first few weeks in the job too much for you? If the early years give you energy, continue reading.<br /><br />We are a small team of experienced entrepreneurs, with a significant investment from a premier investor, taking on one of the biggest challenges of the 21st century: The healthcare industry. The part of the industry that touches people lives directly using modern technology, that helps them get care when needed and gives them peace of mind during some of the least fun moments in life. We can't say too much about it, but we have a few buzz words to throw out there: Mobile, AI, digital, universal access, easy to use, beautiful, modern, integration, global, behavioural science.<br /><br />You are a top engineer, architecture connoisseur, lead-by-example kind of person. You've been there and done that. You know the hundreds (thousands?) of gotchas for building an infrastructure to support Mobile, Web, Email, SMS experiences and more. You can balance engineering excellence with the business and product needs. And, you do it fast, really fast.<br /><br />This opportunity is not for the faint-hearted. A lot of responsibilities will rest on your shoulders, and the expectations are high. You'll be the first engineer in the team and the first leader. Your beliefs and philosophies will define the engineering team beliefs and philosophies. You'll help us craft the product, the processes, the tools, and, most important of all, the team. We are just starting out, and we have great clarity in our vision and mission; now we need to figure out the how and what.<br /><br />What we expect from you:<br /><br />- You have a formal education in Computer Science, Computer Engineer, or equivalent (in place of that, you acquired those skills after many years of on-the-job training, working with other extraordinary software engineers).<br />- You are a master at software architecture, componentisation, microservices, infrastructure, etc.<br />- You are pragmatic and don't overdo on abstraction, testing, and processes, but you understand the value and trade-offs.<br />- You are comfortable with all the duties of DevOps, from continuous integration to cloud management, sprinkled with some DBA skills. In the early days, we'll have to share these responsibilities with other people on the team until we hire for that role.<br />- You are very comfortable defining APIs, building backend services, using relational databases (and document-based / NoSQL DB), messaging queues, cloud services (AWS or Azure), etc.<br />- You are good (or great) at HTML, CSS, JS, and some of the modern web frameworks (React, Bootstrap, Angular, SASS / LESS, etc.)<br />- You've worked with mobile developers, lead a team of mobile developers, or built mobile applications yourself.<br />- You've managed developers and know many exceptional developers here in London (we'll need to hire them as well).<br />- Oh, and you are great with people! You'll be a manager. You'll also participate in strategic decisions, board meetings, and even customer visits every once in a while.<br />- What about the technology stack? You get to pick it from one of the moderns one: NodeJS, .NET, Python, etc. (Sorry, but no-go for RoR or PHP)<br /><br />What you'll get from us:<br /><br />- Work with talented individuals, where you can learn from and teach each other.<br />- Accelerate your career by ten years in just three!<br />- Great freedom to be the best that you can be (and become better): flexible hours, access to whatever devices & software you need.<br />- Work on a meaningful product to help people, doctors, nurses, and more.<br />- Work in the heart of London in a very cool office space.<br />- A top of the market salary and compensation package.<br />- We are firm believers in the value of diversity and equality at our company. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age or marital status.<br /><br />This position is based in London, and we work at a fantastic co-working space in Oxford Circus. We are not interested in remote workers, contractors, or working with recruiters. Your compensation will be above market (we saved the money we'd pay a recruiter and bump up your salary), and you'll get many other real benefits.<br /><br />We are biased by competency, action, kindness, collaboration, speed, and modern approaches and look forward hearing from you.",
    "urlFetchPending": false,
    "published": "Mar 25, 2017 3:13:22 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "NGi2IyOfTayd5yEnuwz-zw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/54963/head-of-technology-at-mrs-wordsmith-at-kindred-capital/",
    "title": "Head of Technology at Mrs Wordsmith",
    "content": "At &quot;Mrs Wordsmith&quot;:http://www.mrswordsmith.com, we’re on a mission to illustrate the English language one rare word at a time. We’ve teamed up with the award-winning artists behind Madagascar and Hotel Transylvania – so that children fall in love with words.<br /><br />We’ve recently closed a significant funding round from top-tier VCs and industry leaders to accelerate our growth plans. Come and join us to build the world’s first technology platform that will enable us to re-imagine the dictionary for today’s digital natives. <br /><br />We will create innovative vocabulary products for every device and every moment from hilarious loo roll to augmented reality word games. We want to be the next big education content brand. English is Britain's GREATest Export.®<br /><br /><br />*YOUR ROLE*<br />As our Head of Technology, you work closely with our cofounders and CEO, and share responsibility for delivering a service that is transforming tens of thousands, then hopefully millions of people's experience. Your primary role will be to create a content management system that will enable us to warehouse our digital media assets and leverage this CMS to create scale-able print, mobile and web-based consumer interfaces and tools. Key aspects of this role include the ability to:​<br /><br />-  Partner with other members of the leadership team to create processes and project plans that enable the team to efficiently produce a high quality product on time and on budget<br /><br />-  Provide long-term technical guidance and planning as well as being a significant individual contributor from the start<br /><br />-  Be a visible, hands-on engineer and leader, delivering clear technical direction and standards to the engineers that you hire<br /><br />-  Encourage a collaborative and inclusive environment for people to do their best work<br /><br />-  Implement web and mobile interfaces, building smart tools and great experiences for both consumers and educators<br /><br />-  Work with our Operations Team to build up the backend for our shop system and develop and enhance our front-end to increase site traffic and conversion<br /><br />-  Manage all development processes including scheduling, scrums, quality assurance, release and product reviews as you bring in a lean team<br /><br />-  Grow engineering org over time, providing guidance on compensation (budget and allocation) and promotions<br /><br />-  Drive, monitor and guide product releases/updates<br /><br />-  Develops and directs all networking safeguards to reduce the risk of outside breaches and protect sensitive (child safe) internal and external client information<br /><br />-  Be passionate about close collaboration with design, product, and marketing to craft the best experience possible throughout the entire customer journey<br /><br /><br />*ABOUT YOU*<br />-  You’ll be experienced in developing highly scalable, performant and internationalised applications<br /><br />-  You're a good communicator and have an opinion on tools, technologies and ways of working, with the experience to back it up<br /><br />-  You're a great ‘people developer’ as well as hands-on engineer. Initially you will be working alongside the Founder before building out a team<br /><br />-  Have a strong focus on quality and a desire to get things done the best possible way<br /><br />-  You care about code quality, TechOps, security, web performance and testing<br /><br />-  You're happy to experiment, learn and pick the right tools for the job<br /><br />-  Strong promoter of agile methodologies and thriving in fast-paced and changing environments<br /><br />-  Strategic thinker but also hands-on and able to deliver<br /><br />-  Excited about ambitious goals and willing to do anything to make them happen<br /><br />_*What is in it for You?*_<br /><br />-  You’ll play a key role in helping us work out what to build, when and why<br /><br />-  A chance to create a meaningful contribution to millions of families<br /><br />-  Influence, trust and impact inside a well funded startup that's scaling<br /><br />-  Work alongside other talented and friendly people with a history of learning new things<br /><br />-  Competitive salary and meaningful stock options<br /><br />-  Pick your own kit<br /><br />-  Access to an amazing network of mentors<br /><br />CLOSING DATE: MARCH 30TH, 2017<br /><br />Mrs Wordsmith cares deeply about helping our industry become a more inclusive and diverse place to work. We work hard to lead by example and are committed to Equal Employment Opportunity through attracting and retaining a complementary team of employees and building an inclusive environment for all.<br /><br />",
    "urlFetchPending": false,
    "published": "Mar 3, 2017 4:53:53 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "niSS_naESc-UHQvtCuV7gg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56119/junior-video-executive-manchester-at-lad-bible-group/",
    "title": "Junior Video Executive - Manchester",
    "content": "We are TheLADbible. We offer so much more than the latest viral and trending news and stories- we offer a community for our 21 million followers, a way of life for our audience and a movement which our audience and employees are proud to be part of. This is brought together through a shared love of relevant and relatable content is our holy grail.<br /><br />Whether the purpose is to inform, entertain, educate, capture hearts and minds, inspire or interact, we strive to build meaningful and emotional connections with our followers.  Our success is not defined by “likes” but by provoking audience engagement, creating movement, setting trends and disrupting the market on a global scale. Everyone who works at TheLADbible is passionate about keeping that connection alive.<br /><br />Does this sound like something you need to be part of? We are now looking for a Junior Video Executive to join our family and whilst we consider experience is important we are just as interested in your passion and determination to disrupt the landscape of social media. We need our people to care about every single piece of content.<br /><br />The role:<br />As a Junior Video Executive for TheLADbible you will use your awareness of what makes great viral video content, and your creative skills, to source and deliver videos to be posted across TheLADbible social platforms and website. You will be driven by your passion for staying ahead of the competition and to be at the forefront of trend setting by working quickly to obtain the best videos whilst keeping with TheLADbible tone.<br /> <br />Taking guidance from the Team Leader you will use your video editing experience in creating original and trending videos as well as you will use your knowledge and skills to identify and present trends and topics for TheLADbible team, legally obtain permission from video owners and continually monitor feedback and strive to continually improve.<br /> <br />The Person:<br />Whilst we consider experience is important we are just as interested in your passion and determination to disrupt the landscape of social media. We need our people to care about every single piece of content. In order to succeed in this role it’s important that you can demonstrate the following:<br /><br />Current/previous experience using social media sites such as Facebook and Twitter etc.<br />Experience of editing videos<br />An understanding of current trends and what makes engaging content<br />Excellent standard of written English<br />A proven understanding of copyright laws<br />The ability to think, imagine and produce new and original ideas to continuously deliver unique and engaging content<br />Degree qualified within a relevant field (English, Media, Journalism etc).<br /> <br />Overview:<br />TheLADbible Group is at the forefront of digital publishing and social entertainment. With over 110 staff across our Manchester and London offices. Our people communicate with over 42M followers publishing over 5k pieces of content per month. We are the 2nd largest publisher of video online in the world ahead of Disney and Time Warner.<br /><br />TheLADbible Group builds communities across multiple channels including our websites, Facebook, Instagram, Snapchat, Vine, Twitter, YouTube, AppleTV and our apps. We understand our audience and are on their side. Our community brings people together and we try to use our influence for good. We are the forefront of digital publishing and social entertainment. With over 100 staff across two key locations, Manchester and London, our brands include TheLADbible, TheSPORTbible, TheODDSbible, TheLENSbible, TheCONTENTbible, TheGAMINGbible, TheFOODbible, TheLADbibleOZ and Pretty52.",
    "urlFetchPending": false,
    "published": "Apr 5, 2017 4:39:10 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "0PAj95DVQD6GWX1g4LbHlQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/56078/head-of-design-at-trussle/",
    "title": "Head of Design",
    "content": "*Who are we?*<br /><br />As the UK’s first online mortgage broker, we are leading the charge in making mortgages simple and hassle-free, introducing speed, efficiency and clarity into an antiquated and disparate market. <br /><br />With recent investment of £4.5m from leading FinTech investors, key partnerships in place with players such as Zoopla and an excellent customer rating on Trustpilot, we are well placed to continue our rapid growth.<br /><br />*The role*<br /><br />Here at trussle, we strongly value the importance of design. We realise it will play a huge role in defining our product, brand and values - both today and into the future. We're looking for a Head of Design with a strong UX background to help build and develop our design team, and instil a design led culture at Trussle. You'll work alongside the product and engineering teams, taking ownership of core business metrics. Along with the rest of the team, you'll design experiments and features to influence those metrics.<br /><br />*You will:*<br /><br />* Instil a design led culture across the business, getting everyone from our Founder and investors to our Customer Success Agents and Mortgage Advisers excited about our product and design<br />* Take responsibility for building and developing a world class design team<br />* Manage the creation of a style guide and set of design principles and guidelines which guide design decisions and ensure consistency and clarity in our design<br />* Identify problems and opportunities, suggest solutions and define quick experiments to test your hypotheses<br />* Working closely with the product team, carry out industry research, create wireframes and prototypes, conduct customer feedback sessions and present research findings to the wider business<br />* Create high fidelity designs for the engineering team to work on based on your research and wireframes<br /><br />*You'll love this role if:*<br /><br />* You're an experienced and successful designer with a background in UX and a passion for delivering the very best customer experience<br />* You have built and managed successful design teams<br />* You thrive in a fast paced environment, and are willing to get involved with whatever is necessary to drive the business forward, whilst being able to take a step back and think strategically to drive the business forward<br />* You're creative, and are comfortable taking complete ownership of metrics and suggesting design initiatives to influence those metrics<br />* You love to experiment and find the fastest way to prove the value of a design before investing a lot of time into it<br />* You constantly challenge the decisions being made around you, and aren't afraid to speak up if you disagree with something<br />* You're a wizard in the Adobe Creative suite (Photoshop and Illustrator) and Sketch as well as wireframing and prototyping tools like Balsamiq, Invision or Axure<br />* You have a good understanding of the requirements and restrictions of HTML and CSS (and JavaScript is a bonus!)<br /><br />*We'll offer you:*<br /><br />* An attractive salary and options package<br />* The opportunity to be involved in a fast growing start up at an early stage<br />* Ownership of key business metrics and the autonomy to run experiments and design features to influence those metrics<br />* Bi-weekly team lunches, monthly socials, Friday drinks<br />* As much toast and peanut butter as you can eat<br /><br />Please note that we are looking for full-time employees to work in our London office. We are currently unable to offer visa sponsorship.",
    "urlFetchPending": false,
    "published": "Apr 4, 2017 5:30:57 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "jhd3dIb3S4-A_21mgHoQ_Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/56880/head-of-content-marketing-editor-at-crozdesk/",
    "title": "Head of Content Marketing / Editor",
    "content": "*About Crozdesk.com:*<br />Crozdesk is a Software-as-a-Service comparison platform looking to scale to the next level. We’ve gained traction with a large variety of businesses over the past 18 months who are using our services daily. Our two main platforms – Crozdesk and Softonic – for Business offer users a one-stop shop to find and compare applications across 200+ different sectors, while providing a high-value environment for B2B software advertisers.<br /><br />*Job Profile:*<br />We are looking for a talented content creators with a passion for startups and technology in general and software in particular. The role will entail building and managing a small team of in-house content writers and freelancers, as well as devising content schedules and optimising the production efforts with the goal of growing the platform community in mind.<br />This role requires a high level of creativity, attention to detail, and project management skills, offering plenty of growth opportunities and heaps of responsibility. <br /><br />*We’re looking for someone who:*<br />* Has a passion for writing, especially about technology <br />* Has native level English skills<br />* Knows how to produce high-quality and engaging content for a variety of audiences, especially in the B2B space <br />* Is able to identify great opportunities and frame topics to drive readers’ interest<br />* Has a good grasp on SEO and what drives traffic / user interest<br />* Has a degree in the humanities or a technical subject<br />* Has at least 2 years of experience successfully producing and promoting web content<br />* Is familiar with a range of SaaS applications and software products including Google Analytics, Google Docs, Mailchimp, Wordpress and others. <br />* Has a dual-minded approach: you’re creative and a good writer, but can also be process-driven, intricate at planning, and use data, insights and SEO best-practices to make decisions<br />* Is a team player willing to support and assist colleagues<br />* Is an ambitious, self-starter, eager to help take a startup to the next level. <br /><br />*What we offer:*<br />* Competitive salary based on your background and experience<br />* Stock options will be awarded a couple of months in if you prove yourself and become an integral member of the team<br />* Open and transparent company culture<br />* A lot of responsibility, high-growth potential and large personal development potential<br />* Shoreditch office (annexed to a night club)<br /><br />_Does this sound like you? If so, please apply with your CV and a very short statement of why you’re the right person for this, as well as why you would like to work with us. Keep it short, informal and honest._<br />",
    "urlFetchPending": false,
    "published": "Apr 28, 2017 5:48:09 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "rwY0dlyxRwawdJdEsdTotg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/56774/director-of-marketing-mf-at-relayr/",
    "title": "Director of Marketing (m/f)",
    "content": "The world is at the beginning of the fourth industrial revolution - the Industrial Internet of Things (iIoT). We believe that this stage of the revolution should actually be called the Internet of Legacy Things  - and relayr is at the center of it!<br /><br />If you have a good working knowledge of the Internet of Things, and have many years in marketing for providers of B2B software as a service (SaaS) or platform as a service (PaaS), then we encourage you to read further.<br /><br />Who we are:<br /><br />We are a 3-year-old, rapidly growing international company of 150 IoT experts in 8 cities across 4 countries on 2 continents. We are honored to have the trust of global clients and partners from different industries, like GE, Cisco, Canadian Rail, Deutsche Bahn, Bosch Siemens Home Appliances, Bosch, La Marzocco, Intel, Dell, iTron, Hartford Steam Boilers, McKinsey, BearingPoint, Deloitte, EY, and more.<br /><br />To support our growth, our Marketing Department is expanding and needs more strategic guidance. Marketing at relayr serves our sales efforts, to drive B2B client conversions, thought leadership, and brand awareness. Marketing at relayr is sub-divided into four overlapping Marketing Areas: 1) Content Marketing/Demand Generation, 2) Sales Enablement, 3) Event Marketing, 4) Developer Marketing / Evangelism.<br /><br />Your Role:<br /><br />Marketing Director will manage these four Marketing Areas, in line with international sales goals and product release cycles. He/She will report directly to the Chief of Product & Marketing. The role requires proven marketing skills and a working knowledge of operations in the industrial sector and new technologies affecting it and a demonstrated ability to deliver results. This position is responsible for developing the marketing strategy for solutions targeted for the industrial sector. Industrial IoT solutions at relayr target manufacturing, transportation, building management systems, utilities, and retail supply chain.<br /><br />Your responsibilities include the development of our marketing channels, analysing the competitive market and segmentation, positioning, and tracking product, solution and business success metrics. The Director of Marketing will support her marketing area Team Leads as they define and help create sales and marketing collateral to support achievement of annual operating plan.<br /><br />Our goal is to make relayr the world’s leading IoT platform.<br /><br />Job Responsibilities:<br /><br />Managing the relayr Marketing Team Leads according to MBOs and OKRs across Content Marketing, Event Marketing, Developer Marketing and Sales Enablement<br />Further develop the strategy and marketing plan for Industrial IoT solutions from relayr for manufacturing, transportation, utilities, logistics, building management and more<br />Manage and progressively improve the measuring and regular reporting of key marketing to sales conversion and performance metrics<br />Track and analyze market, key competitors’ strengths and weaknesses, and create and execute our marketing strategy for IoT platform and related solutions<br />Collaborate with product management in partner evaluation, phased roll-out of solution and sales/partner enablement and training<br />Engage with decision makers, industry influencers and business leaders of existing and potential customers to drive awareness and early adoption of solutions based on relayr technology<br />Brief members of the press and industry analysts about the value of relayr and our Industrial IoT solutions<br />Conduct secondary research on market trends, technology adoption, and key business/industry use-cases and requirements<br />Track customer feedback, customer care, customer satisfaction, dashboards and metrics to measure success and engagement of new and existing features and functionalities<br />With your Team Leads, establish sustainable, differentiated product positioning for global products, in line with our corporate brand positioning.<br />Identify and articulate compelling value propositions for the end user, the partners, and sales channels to ensure confidence and competence in sales execution to meet revenue targets.<br />Develop market-specific problem statements, user scenarios, business cases, & MRDs, to facilitate roadmaps that delivers a differentiated market position and real customer outcomes.<br />Drive sales growth through development of persuasive messaging, collateral, effective training material and support webcasts, webinars, seminars, websites and other customer facing assets that have a high positive brand impact.<br />Support content and messaging for outbound marketing execution of events and to drive generation of qualified leads and sales pipeline.<br />The position is based in Berlin and involves 25%+ travel<br /><br />Qualifications:<br /><br />5+ years of senior marketing experience for B2B technology products or services<br />3+ years of experience in industrial related products or consulting<br />Expertise in operational technologies is preferred<br />Needs to have a good working knowledge of IT systems, cloud services<br />Fit well with flat hierarchies and a company culture of collaboration, open communication, integrity and ability to deliver results through a pioneering spirit<br />Excellent communication and writing skills to business and technical audiences<br />Leadership – experience and the ability to manage and build a team, plus enrich relationships across the organization<br />Creativity and ability to think outside the box to solve problems and exploit opportunities<br />Proven ability to translate technical functionality into true business values and benefits<br />Proven track record of driving results for business growth<br />Strong Native English writing and speaking is required<br />A second native-level European foreign language is a strong advantage<br />Bachelor’s degree in engineering or business management is required<br /><br />What we offer:<br /><br />Flexible office environment<br />A diverse and friendly team with people from all over the world, speaking 10+ languages, of all ages and parental-status<br />Connecting you with a network of companies and people from around the globe<br />A learning environment where you can extend and build upon your skills and interests, as well as knowledge-sharing at our semi-weekly events<br />Opportunities to attend events and conferences pertaining to your discipline<br />Competitive Salary and Stock Options<br />Cool office located in Kreuzberg with free beverages, fresh fruit, a kicker table, a variety of team events, and social activities – we love to hang out and be social!<br />Free German courses at intermediate and advanced level.<br />We offer the ability to work in a cutting-edge field with the best people in the IoT industry!",
    "urlFetchPending": false,
    "published": "Apr 26, 2017 9:26:31 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "kiJy75i3TCGF-ZNErrUc4g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/56711/freelance-part-time-marketing-executive-at-1618-digital/",
    "title": "Freelance Part-Time Marketing Executive",
    "content": "OUR START-UP<br /><br />1.618 is a creative sound design agency offering audio production and post-production services, immersive & spatial audio solutions for 360 video content, interactive VR/AR media and intelligent audio branding.<br /><br />Having spent three years providing audio solutions for the industry’s leading content creators and brands, our network of sound experts are equipped with the latest industry experience, research and cutting edge technology, to help our clients with achieving their ambitious goals.<br /><br />We believe that intelligent audio in the next decade is going to become a key competitive differentiating factor and an indispensable aspect of immersive and interactive communication, storytelling and brand advertising.<br /><br /><br />LOCATION:<br /><br />Office is based in London Fields<br /><br /><br />ROLE DESCRIPTION:<br /><br />-Working closely with our audio team and head of marketing<br />-Developing marketing strategies and long term goals<br />-Assisting with developing audio branding strategies and campaigns<br />-Preparing presentations and qualitative data for project pitching<br />-Creating case studies<br />-Measuring impact of the past and ongoing campaigns, documenting and sharing data with the team<br />-Management of social media calendar across all channels + production of content<br />-Growing the following and increasing exposure of the brand<br />-Creating and deploying monthly newsletter<br />-Assisting with organising events<br />-Attending events, networking, representing the company<br /><br /><br />ESSENTIAL SKILLS & EXPERIENCE:<br /><br />-Experience in marketing industry or relevant education<br />-Tech/VR enthusiast<br />-Brilliant organisational, planning and time management skills<br />-Great communication and writing skills<br />-Blogging<br />-Social Media<br />-Copywriting<br />-Good attention to detail<br />-Adaptable, enthusiastic and willing to get stuck in<br />-Desire to research, learn and evolve quickly as well as to think outside of the box<br /><br /><br />PERKS:<br /><br />-Experience in working in the newest and fastest growing industry in the world – AR/VR and immersive media<br />-Experience working within a start-up environment<br />-Access to networking and industry connections<br />-Platform to develop case studies based on projects for global brands<br />-Chance to learn more about the film industry, virtual reality, gaming, audio and branding<br />-Desk space, situated in the trendy co-working space with many member’s perks such as free yoga classes, industry events, hospitality facilities etc.<br /><br /><br />HOW TO APPLY:<br /><br />This position is ideal for somebody who is smart and enthusiastic, is a team player with great communication and written skills, and someone who would like to get stuck into the running of a start-up business.<br /><br />Please reply with your CV or portfolio and a short paragraph about why you think you would be the perfect candidate for this position.<br /><br /><br />CLOSING DATE: May 7th",
    "urlFetchPending": false,
    "published": "Apr 24, 2017 4:12:35 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "KINrjRy6QI-GpplAtKo08g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/56614/head-of-acquisition-at-touchnote/",
    "title": "Head of Acquisition",
    "content": "*Head of Acquisition*<br /><br />We’re looking for an experienced customer acquisition specialist to join us in a newly created role.<br /><br />The ideal candidate will have had experience driving growth in the consumer space, with hands-on experience with both the science of data analysis and performance -- and the art of excellent creative and strong branding.<br /><br />You’ll join a rapid-growth environment and build Touchnote’s consumer reputation, improve customer experience and drive growth.<br /><br />*About The Role*<br /><br />The Head of Acquisition will help us grow our customer base by managing and optimising our multi-channel marketing campaigns, maximise our conversation rate and turn us into a household name in the UK and in the USA. Working closely with the Head of Retention and the rest of the team, you’ll continually ensure Touchnote targets the right traffic and our Retention team keeps them coming back for more.<br /><br />Reporting to the Director of Growth, you will manage a varied team of six, which comprises of a dedicated Product Manager, Business Analyst, Developers and Marketeers. You’ll work in collaboration with our Brand Director to commission new marketing campaigns and constantly look for creative ways of acquiring customers.<br /><br />*Key responsibilities include:*<br /><br />* Drive Acquisition and Activation KPIs: Constantly monitor our performance, create marketing reports and ensure we are spending our budget in a way that reaches targets and maximises our CPA, CR and ROI.<br />* Campaign Management & Planning: Plan and deliver, through our cross-functional teams, high impact television, out of home, and digital campaigns that bring new customers through the door, focussing on customer journey and measuring success through high conversion rates and repeat purchases.<br />* Insights: Monitor consumer insights to help inform product development, brand and marketing strategies, and communications. Carry out comparative evaluation of competitors’ performance and exposure. Provide forecasts to inform how we allocate our budget and keep our customer happiness at the forefront of what we do.<br />* Develop Strong & Collaborative Internal Relationships: Influence and respectfully challenge at a senior level. Motivate and inspire a strong team who have customer experience at the centre of all they do.<br /><br />*About You*<br /><br />You are a strategic thinker, experienced in the digital space and can see the potential Touchnote has to become ever-more successful in the coming years. You’re super smart, thoughtful and considerate, you have a track record of delivering results, and you don’t take yourself too seriously.<br /><br />* You are an experienced Acquisition Manager adept at creating and implementing multi-channel acquisition strategies, ideally including DR and BR television campaigns.<br />* You’ve got strong analytical skills with a drive to deliver ROI and the ability to use data and information to derive insights that can be turned into action.<br />* You’re customer-centric in thinking and measure services through careful analysis of figures, ready to react accordingly.<br />* You’re really comfortable in a change environment and with rapid-growth. You’re able to perform well in this space, be flexible and agile.<br />* You have awesome communication skills, able to present well and build relationships with key partners across various levels. You can hold your own and talk about your specialism with conviction and authority.<br />* You’re someone everyone wants to work for, a seriously good leader, coacher and motivator. You seek to empower your team and you’re proactive and positive in your management style.<br />* You are comfortable managing a multi-skilled team of marketers, developers, product managers and analysts.<br /><br />*About Touchnote*<br /><br />Touchnote is the world’s most popular postcard-sending service. We were ranked UK's 9th fastest growing technology company, in Deloitte's Fast50 2015 ranking.<br /><br />Our mission is to become the most meaningful way for family and close friends to stay in touch.<br /><br />We started in 2008 in London and have since sent millions of personalised cards worldwide. Our apps and website have been featured in the world's leading press, in Google Play and iTunes, and on grandparents’ fridges worldwide.<br /><br />Our app is available on iPhone, iPad, Android mobiles and tablets as well as on our website.<br /><br />*Salary*<br />Competitive, based on experience",
    "urlFetchPending": false,
    "published": "Apr 20, 2017 5:44:54 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "_tFNsddeSn-jwBDz7cXRZg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/56523/account-manager-and-presenter-at-unifrog-education-ltd/",
    "title": "Account Manager and Presenter",
    "content": "*Summary*<br />_Enthusiastic and engaging Presenter required to help us continue to grow fast and to work with our fantastic partner schools._<br /><br />Salary: £30K (plus car allowance)<br />Travel expenses to and from school meetings covered<br />Full time role<br />Start date: Mid to late May – although this is somewhat flexible (could be slightly earlier if desired)<br /> <br />*Background*<br />Unifrog is a multi-award winning startup on a mission to transform Careers Guidance in the UK. In just three years we have become the market leader, lauded by students, teachers, politicians and business leaders. We are now looking for enthusiastic and engaging Presenters to help us continue to grow.<br /><br />Our online platform makes it easy for students to find and apply for university courses, apprenticeships, and Further Education courses, while also helping teachers to track their progress and give good guidance. Unifrog is the only place where students can compare every post-16 and post-18 opportunity in the UK.<br /><br />We are now building tools to make it easy for students to compare undergraduate programmes taught in English in the Netherlands, the USA, Australia, New Zealand, Canada and elsewhere. We want to be the one-stop-shop for students to find and apply for their best next step after school, wherever they live in the world.<br /><br />We have 16 members of staff, a growing set of products, and a rapidly increasing customer base.<br /> <br />*Responsibilities*<br />As a Presenter your main responsibility is to support our London based Area Managers to look after their partner schools, ensuring that the schools are getting the most out of the platform. <br /><br />Your duties will include:<br />* Delivering engaging and informative Student Launches, normally featuring assemblies and workshops<br />* Delivering interactive Teacher Training Sessions, normally featuring presentations and workshops<br />* Leading Parents’ and Progression Evenings<br />* Taking part in focus groups with teachers and students on how to improve our customer service and our products<br />* Checking-in with partners in person and over the phone, to assess what they need to make the most out of Unifrog, and in particular to re-visit their Year Plan, where we agree with the partner how they will effectively embed and utilise Unifrog over the course of each subscription<br /> <br />*Key benefits*<br />People-focused, working particularly with young people.<br />Join one of the UK’s hottest education technology startups and help make Careers Guidance better.<br />Influence the company’s direction: we operate a flat staff structure and promote great ideas.<br /> <br />*Essential skills and experiences*<br />* Public speaking, and especially engaging with young people<br />* Organised<br />* Ability to think on your feet and be adaptable<br />* Attention to detail<br />* Interest in the education sector<br />* Clean UK driving license<br /> <br />*Location, hours, holiday*<br />Most days you will be visiting schools that you have previously organised to meet - you will also have a desk in our office.<br />Normal working hours are 8am to 5pm.<br />28 days paid holiday per year (plus bank holidays); the majority of these need to be taken during school holidays.<br /> <br />*Eligibility*<br />We can only consider applications from candidates who already have the right to work in the EU.",
    "urlFetchPending": false,
    "published": "Apr 19, 2017 9:22:31 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "sEKS94RoQoaa3b8bdJBYmA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/56257/casino-digital-marketing-executive-french-or-dutch-speaker-at-gimo-ltd/",
    "title": "Casino Digital Marketing Executive - French or Dutch Speaker",
    "content": "Global Interactive Marketing Online (GIMO) specialise in all aspects of online marketing, website and online games creation in the iGaming, Sports Betting, Poker and Casino industries. Due to the growing demand for our services, we are now recruiting for a Casino Digital Marketing Executive (French or Dutch Speaker) on a full time permanent basis.<br /><br />THE ROLE<br /><br />The main purpose of this role is to ensure that the casino product is properly targeted within the specified country markets.<br /><br />Your responsibilities will include, but are not limited to:<br /><br />Management of the website and creation of online marketing campaigns for our casino products.<br />Coordinating marketing needs with the development, design, translation and customer service teams<br />Planning and coordinating email marketing plans with our CRM department<br />Creating general reporting and analysis<br />Managing social media (blogs, forums etc.) activities<br />Other marketing duties as and when required<br />Internal communication : liaise with both the customer service and analytic teams to report any issues and hold discussions regarding any upcoming campaigns and offers<br />The ideal candidate will have:<br /><br />Excellent native French or Dutch language<br />Good English language skills, both spoken and written<br />Experience and knowledge with casino products<br />Similar previous digital marketing experience<br />Basic knowledge of HTML/Dreamweaver<br />Have strong reporting and good numerical skills<br />Be able to work entirely on their own initiative to deliver objectives as agreed<br />THE COMPANY<br /><br />Established in 2006, we are based in the Waterloo/Southwark area with circa 150 employees working for us in London, and an additional 380 employees working globally as part of the group. Focusing on mobile and online Poker, Casino and Sports Betting products in major European markets, we have a very multicultural team here at GIMO with employees specialising in all aspects of Marketing, Affiliation Marketing, Development, Web Design, Content, Analysis, Software Development and Customer Service.",
    "urlFetchPending": false,
    "published": "Apr 10, 2017 4:58:47 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "OR3fp1-cR9-OjFVHspFDEA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/56243/head-of-performance-marketing-at-moteefe/",
    "title": "Head of Performance Marketing",
    "content": "Moteefe was founded in 2014 by Lev, Mathijs and Olivier while pursuing an MBA at INSEAD. With Moteefe it is our ambition to help everyone bring great customised merchandise to the market without any risk or hassle.<br /><br />What drives us is the opportunity to promote entrepreneurship and enable social media influencers and organisations to bring their ideas to life. We want to take away all the risk, worry and hassle, and truly help people get rewarded for their creativity by giving them a platform and the opportunity to build a brand or spread a message.<br /><br />Moteefe is looking for a Head of Performance Marketing to help scale its business and hit its ambitious growth plans. This is a unique opportunity to not only lead growth efforts at a start-up, but also to have a major impact on the business moving forward.  You will have a small team of Marketing generalists to lead, but 99% of your focus will be to drive users to the platform.<br /><br />Your role will include:<br />Grow Moteefe. You will be expected to significantly improve our brand awareness and attract Sellers to the platform.<br />Be responsible for all performance marketing across all geographies (channel include PPC, Paid Social, Programmatic, Affiliates, Search, Email/CRM).<br />Drive a data-obsessed approach to marketing - You're naturally analytical.<br />Analyse performance of all campaigns, quickly identifying new areas for improvement.<br />Be the face of the all things performance and optimisation, regularly engaging and influencing stakeholders across the business.<br />Review and analyse potential to branch out to other channels (offline etc).<br />Be the point person for all agency relationships (when required).<br />Identify, implement, and iterate strategies to improve user acquisition.<br />Manage CAC with clear understanding of drivers in order to scale marketing<br />Drive and oversee all digital marketing efforts, including advertising, SEO, and social media.<br />Manage the small marketing team.<br />Manage short-form content creation and syndication via newsletters, drip campaigns, etc.<br /><br />Essential Skills:<br />Performance Marketing experience is essential. We need someone who can drive the business forward.<br />A solid understanding of internet marketing and social media marketing (Facebook advertising) etc is required.<br />Ability to work with, advise and influence Founders.<br />Solid, demonstrable experience of working on an E-Commerce platform.<br />A person who sees, Growth, Growth, Growth in all their Marketing ideas.<br />Able to lead and further develop a small Marketing team.<br />Analytical – Someone who monitors the trends and makes changes.<br />Autonomous – Must be a self-starter and able to get things done.",
    "urlFetchPending": false,
    "published": "Apr 10, 2017 1:50:52 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "6ROZpjxIR3GKCwfuUCAa9Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/56231/crm-executive-at-live-better-with/",
    "title": "CRM Executive",
    "content": "*About Live Better With*<br /><br />Launched in 2015, Live Better With aims to make day-to-day life a little bit better for people living with cancer, across the world. Our mission is to provide cancer patients and their families with the products, services, content and community that can help address the side effects and symptoms that reduce the quality of their daily lives.<br /><br />We’re looking for a talented CRM Executive to take responsibility for email segmentation and personalisation, and expand our CRM efforts further to other channels. It is an exciting opportunity for the right CRM specialist, who wants to make a difference to the lives of millions of people with long-term illnesses and be directly responsible for transforming an already successful e-commerce business into a global leader.<br /><br />*In this exciting role you will be:*<br /><br />* Working directly with our CMO on the planning and execution of CRM campaigns<br />* Planning and delivering excellent and emotionally engaging email campaigns to drive customer retention that recognise the various (tough) journeys our community is going through<br />* Mapping the customer journey with the Head of Product and analysing all touch points to simplify and enhance overall customer experience<br />* Building segmentation models and decision trees to maximise personalisation and relevance<br />* Reporting on a daily, weekly and monthly basis on campaign and channel performance, providing recommendations and learnings<br />* Exploring and rolling out CRM strategies in other channels<br /><br />*Your skills and experience:*<br /><br />* At least 1+ years hands-on experience managing email campaigns to retention targets<br />* Great communication skills - perfect English and an eloquent writer who can understand how to engage with our users’ journeys and put heart and emotion into that engagement through your writing<br />* Experience in a start-up / high-growth and innovative environment<br />* Highly analytical, data and metrics-driven<br /><br />*Your personality:*<br /><br />* Tenacious self-starter and a quick learner - excited to become the best in the world at the channels you are responsible for!<br />* Excited and curious about all things digital, up-to-date with the most recent state-of-the-art growth tactics to achieve the best results<br />* Happy to be deep in hands-on execution and to be continually learning..<br />* ...whilst excited to rapidly move up in your career - we promote the best performers fast<br />* Have a collaborative style and like working with others; at the same time, you enjoy driving decision-making<br />* …and you’re ready to share our passion and drive!<br /><br />*What we offer:*<br /><br />* Very competitive salary and options dependent on experience<br />* Join a growing, dynamic, motivated and fun team, where everyone is valued and really wants to help people<br />* Breakfast, team pizza/lunch every Tuesday!<br />* Team social events (drinks after work, monthly team outings)<br />* Perkbox loyalty card (phone insurance, gym membership discount, etc)",
    "urlFetchPending": false,
    "published": "Apr 10, 2017 12:07:50 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "78jUkHEGQhuSk7nKnhCboQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/56069/head-of-marketing-at-jivemap/",
    "title": "Head of Marketing",
    "content": "Looking for Head of Marketing to our founding team in an exiting new business with huge potential. JiveMap is a location based social network with the potential to be the &quot;next Twitter&quot;. Our app was launched into App Store and Google Play. Our backend is powered by an AI-enabled NLP engine developed by top university PhDs and verified by Omnicom and WPP.<br /><br />We need an ambitious, intelligent and capable young leader, blessed with a range of business skills. Integrity and great work ethic essential. You have ability to lead and inspire teams, ability to negotiate win/win business partnerships and close deals. You also have deep understanding of digital consumer marketing/ growth hacking as well as understanding of social media and behaviours of millennials. <br /><br />You will be responsible for excuting two very exciting marketing campaigns we will launch later this year:<br />1. #TheJiveFactor, where we will look for the next star on social media and promote him/her to our 200k+ audience. <br />2. Launching in the US. <br /><br />The role will be London based. Currently part time but expected to a full time role once funding round is closed. No cash payment at this stage but excellent equity options for the right candidate.<br /><br />Thanks for reading. We look forward to hearing from you.",
    "urlFetchPending": false,
    "published": "Apr 4, 2017 4:06:52 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "dRWadc0KRTCuIATbaD-JvA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/56061/head-of-pr-comms-at-inkitt-gmbh/",
    "title": "Head of PR / Comms",
    "content": "<br />*You:*<br />* Love to tell stories<br />* Are a happy and charismatic person who loves to build relationships<br />* Have minimum 1 year working experience in PR or Communications<br />* Get what you want in a determined but gentle way<br />* Prefer books to TV (bookworm)<br />* Are *native* English<br /><br />*We:*<br />* Are building the future of publishing<br />* Have developed an algorithm that can predict best sellers, making the publication dreams of thousands of aspiring authors come true<br />* Love data and numbers<br />* Are based in the center of the beautiful capital Berlin<br />* Do everything to make our users happy<br /><br />*The Role:*<br />* Create global buzz around Inkitt and the bestseller we publish<br />* Build a new global brand strategy and build up the PR department<br />* Create press releases, press kits, presentations, analysis, and social media content<br />* Build relationships with journalists<br />* Full-time position (Mon-Sun)<br /><br />Are you excited to build greatness from day 0? Join and build Inkitt's PR Department!<br /><br />Please send us an application with your updated Resume, Cover Letter, and preferred start date with the subject line &quot;WorkInStartups: Head of PR / Comms&quot; to get in touch.",
    "urlFetchPending": false,
    "published": "Apr 4, 2017 3:31:07 PM",
    "tags": [
      "TITLE1_manager",
      "TZ_Europe",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "Europe timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "YNMaSGOJSWWjSCHddrs3nw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/55933/head-of-marketing-at-toucanbox/",
    "title": "Head of Marketing",
    "content": "Become the driving force in spreading creativity across the globe with toucanBox<br /><br />As our Marketing pro and lead our marketing team in scaling our UK market and eventually across the world. Taking the lead on acquisition and retention targets, you’ll ensure we hit crucial revenue and profitability goals by making sure campaigns and plans are well communicated, understood and measured.<br /><br />With a solid background in all aspects of marketing, including previous experience of owning the P&L, you are familiar with the standard marketing lingo, knowing which levers to pull to increase the customer base, LTV and ROI. You’d ace a game of 3-letter acronym scrabble.<br /><br />Being a data-driven marketer, you’re comfortable extracting and using qualitative and quantitative data to influence decision making, but as comfortable using personas and creative thinking in formulating campaign ideas to really cut through the noise.<br /><br />A confident team leader, you’re comfortable leading experienced marketers and in managing upwards. Your deliverables are always the best they can be due to your broad marketing knowledge, determination and experience. You’ve been there, done that and earned the badges.<br /><br />Are you ready to take toucanbox’s marketing strategy to the next level?<br /><br />REQUIREMENTS<br /><br />What makes you toucanBox’s next head of marketing?<br /><br />- Solid grounding in all aspects of marketing<br />- Broad understanding of digital and traditional marketing channels, with at least one deep area of expertise<br />- Thorough understanding of marketing terms such as CPA, LTV, ROI, and able to measure and manipulate the marketing mix to deliver outstanding results<br />- Customer centric approach to sales with demonstrable experience of having grown sales in the UK, ideally with some exposure or experience in international growth<br />- Expert in Excel and ideally with Google Analytics plus experience of a BI tool (ie Looker/Tableau)<br />- Data obsessed, setting a very high benchmark of insight-driven decision making<br />- True leader, can motivate and inspire team members, building trust, buy-in and loyalty in your strategy and plans<br />- Able to thrive under a high pressure startup environment, driving strategic and tactical marketing forward independently<br />- Detail orientated, obsessive about quality experiences whilst showing agility in delivery<br />- Strong agency management and negotiation skills<br />- Excellent communicator and rapport builder<br />- Highly confident, energetic and enthusiastic<br />- Tenacious, with a ‘can-do’ attitude<br /><br />BENEFITS<br /><br />What are the perks?<br /><br />- Motivating salary package<br />- Private medical insurance<br />- Employer pension contribution<br />- Friendly and stimulating atmosphere<br />- Weekly keep-fit sessions<br />- Table-tennis and other games<br />- Personal growth opportunities<br />- Chance to really make a difference at the early fast-growth stage of the company",
    "urlFetchPending": false,
    "published": "Mar 30, 2017 6:53:22 PM",
    "tags": [
      "TITLE1_manager",
      "TZ_Europe",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "EU work authorisation",
      "Europe timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "_jcREqPTQJWBHRqGbJBKlQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/55850/pr-and-marketing-executive-at-minttwist/",
    "title": "PR and Marketing Executive",
    "content": "We’re looking for a creative and ambitious PR and marketing executive to join our fast growing marketing team.<br /><br />The role focuses on managing our day-to-day marketing activity and supporting the PR and Marketing manager. The ideal candidate will have a good knowledge of the marketing mix.<br /><br />You will be involved in a wide-range of activity, from managing the website to writing marketing copy to managing our Instagram account. You will have autonomy to manage activities such as promoting workshops, sending email campaigns and raising our profile on LinkedIn.<br /><br />This is an excellent opportunity for anyone that wants to work within an agency and develop their marketing skills. We believe in nurturing people and their talent and our main aim will be to help you become a well-rounded marketing professional.<br /><br />Responsibilities<br /><br />- Campaign support including creating target lists and working with internal creative teams<br />- Promoting and supporting events<br />- Creating and managing email campaigns<br />- Managing the company’s Instagram and LinkedIn presence<br />- Contributing to our digital ideas blog<br />- Assist in creating presentations for internal and external communications<br />- Preparing monthly marketing reports<br />- Creatively develop offline campaigns<br />- Broad understanding of PR<br />- Experience with MS Office, particularly Word, Excel and PowerPoint<br />- Marketing degree or qualification preferred<br />- Placement year or some internships within a varied marketing role preferable<br /><br />Skills<br /><br />- High attention to detail and excellent literacy<br />- Organised and able to work to tight deadlines and priorities workloads<br />- Good analytic skills – able to compile data from a variety of sources<br />- Good problem solving skills<br /><br />Personal<br /><br />- Well organised and self-motivated<br />- A flexible, can-do attitude and approach to working<br />- You must be eligible to work and live in the UK.<br /><br />Applications<br /><br />To apply for this vacancy you must have the legal right to live and work in the UK.",
    "urlFetchPending": false,
    "published": "Mar 29, 2017 9:16:51 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "vfWwPoxVQMeSe2DIddy8nQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/55677/digital-marketing-executive-at-live-better-with/",
    "title": "Digital Marketing Executive",
    "content": "*About Live Better With*<br /><br />Launched in 2015, Live Better With aims to make day-to-day life a little bit better for people living with cancer, across the world. Our mission is to provide cancer patients and their families with the products, services, content and community that can help address the side effects and symptoms that reduce the quality of their daily lives.<br /><br />We’re looking for a talented Digital Marketing Executive to manage our digital marketing channels and take them to the next level of growth. It is an exciting and career-defining opportunity for the right digital marketing superstar, who wants to make a difference to the lives of millions of people with long-term illnesses and be directly responsible for transforming an already successful e-commerce business into a global leader.<br /><br />*In this exciting role you will be:*<br /><br />* Working directly with our CMO on campaign planning, targeting, and budgeting<br />* Using Adwords, Facebook and other paid platforms to deploy campaigns<br />* Configuring Goals, Funnels and E-commerce tracking using Google Analytics/Tag Manager<br />* Responsible for day-to-day management and optimisation of existing paid advertising campaigns<br />* Reporting on a daily, weekly and monthly basis on campaign and channel performance, providing recommendations and learnings<br />* Contributing to/learning other revenue channels, e.g., Setting up and helping to set up and executing a forward-looking paid strategy aligned to our revenue and performance targets<br />* Growth hacking - exploring and testing new and emerging acquisition channels to expand our reach and grow our users base<br />* Working closely with the product team to deliver an integrated digital strategy and ensure targets are met<br /><br />*Your skills and experience:*<br /><br />* At least 1+ year’s hands-on experience managing Google PPC and/or Facebook ads to CPA and revenue targets<br />* Great communication skills - perfect English and an eloquent writer who can understand how to fit campaigns with our user’s journeys<br />* Experience in a start-up / high-growth and innovative environment<br />* Highly analytical, data and metrics-driven<br /><br /><br />*Your personality:*<br /><br />* Tenacious self-starter and a quick learner - excited to become the best in the world at the channels you are responsible for!<br />* Excited and curious about all things digital, up-to-date with the most recent state-of-the-art growth tactics to achieve the best results<br />* Happy to be deep in hands-on execution and to be continually learning..<br />* ...whilst excited to rapidly move up in your career - we promote the best performers fast<br />* Have a collaborative style and like working with others; at the same time, you enjoy driving decision-making<br />* …and you’re ready to share our passion and drive!<br /><br />*What we offer:*<br /><br />* Very competitive salary and options dependent on experience<br />* A growing, dynamic, motivated and fun team, where everyone is valued and really wants to help people<br />* Breakfast, team pizza/lunch every Tuesday!<br />* Team social events (drinks after work, monthly team outings)<br />* Perkbox loyalty card (phone insurance, gym membership discount, etc)",
    "urlFetchPending": false,
    "published": "Mar 24, 2017 12:04:46 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "MC8lKwvqR8WFG-esKsfUlQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/55325/email-marketing-executive-at-mvf/",
    "title": "Email Marketing Executive",
    "content": "MVF is one of the UK’s leading customer generation companies.  We are a rapidly growing business – we topped the Sunday Times Tech Track, and since then grew 278% per annum before tripling in size again. We now employ over 350 staff in the UK and USA, and conduct marketing activities in more than 120 countries.<br /><br />We are on a mission to accelerate our clients’ growth by building the world’s most effective marketing platform through a passion for data, relentless innovation and the development of world class teams. We want you to help get us there!<br /><br />Company culture is very important to us, and that is why we were voted in the top 6 places to work in the Sunday Times Best Companies List 2017, and why we are constantly looking for ways to make MVF an even better place to work. People join us to change the industry, work with world-class talent, develop their careers and become part of our remarkable culture. <br /><br />*The Role*<br /><br />Do you want the freedom to create world class content? Become outstanding at analysing data? Or put that commercial mind to good use?<br /><br />*Our Team*<br /><br />The CRM team are a 14 strong team of exceptionally talented marketers. Our daily mantra is to consistently break new ground in Email Marketing and Customer Acquisition. With over 80 million emails being sent a month, we have an enormous audience to connect with.<br /><br />*The Role*<br /><br />You will be responsible for creating engaging, innovative, and relevant content, designing templates and managing the send schedules, for a broad range of high-impact campaigns across multiple markets and languages. You will need to analyse campaign performances, identify opportunities and make data driven decisions to maximise the performance of your personal market. Think of it as your own mini business. <br /><br />In CRM, you control everything the user sees, every decision they take and every pound we make<br /><br />* Delivery, optimisation and scheduling of campaigns to maximise your gross profit contribution to MVF’s targets<br />* Producing world class content that you can be proud of<br />* Creating and delivering fantastic user experience for our subscribers<br />* Exciting testing and innovation to constantly improve campaign performance<br />* Analysis and insight to drive market and team decisions<br />* Significant collaboration with the entire CRM team and other teams in MVF<br />* Making commercial decisions to optimise against client orders and budgets<br />* Personal contribution towards the team roadmap and milestones (i.e. the big projects!)<br /><br />*Our Ideal MVFer:*<br /><br />* Logical problem solver<br />* Commercially savvy and able to prioritise high value tasks effectively<br />* Is passionate about delivering world class content and UX journey for the user<br />* Seeks to learn every day and helps to improve the team and the company<br />* Understands the importance of data driven decisions<br /><br />*Sound exciting*<br /><br />If you have a true passion for Digital Marketing and are driven to learn, develop and become world class through innovative, data savvy decisions, then please apply.<br /><br />We can’t wait to meet you.",
    "urlFetchPending": false,
    "published": "Mar 15, 2017 2:20:44 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "BdwNud9BSH6ALynUgz77EA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/55130/head-of-content-at-lovecrafts/",
    "title": "Head of Content",
    "content": "*About Us*<br /><br />Our vision at LoveCrafts is to create an entirely new platform for the global maker community - one craft at a time. We launched our first site over four years ago - early success led to funding from one of Europe's leading venture investors - and we haven't looked back since. With a global customer base, physical hubs in London, Manchester, Kyiv and USA; and 3 x growth year on year, we’ve grown from start up to sensation in a very short space of time.<br /><br />As we set out to converge traditional crafts with the digital age we are looking for exceptional talent to help us disrupt and innovate in this highly dynamic sector. We're playing with the very best in web, mobile, social, commerce and media technology as we create the perfect digital business for all things craft related.<br /><br />Our team is smart, kind and slightly kooky with talent that is insatiably curious and supremely ambitious. We hire and nurture inquisitive, creative minds looking to flourish in a supportive and collaborative environment that includes social and e-commerce stalwarts hailing from the likes of Yahoo!, Amazon, eBay, Pinterest and Rocket Internet.<br /><br /> <br />*The Opportunity*<br /><br />We’re dedicated to creating a place where makers’ projects are celebrated, advice is shared and supplies are easily sourced. Our technology delivers a unique combination of social network, digital marketplace, online media and e-commerce to deliver everything a maker needs. Thanks to great growth, we’re looking for a passionate Head of Content  to put content at the core of the business.<br /><br />The role will own how our platform delivers a range of fantastic educational and editorial content.<br /><br />You will be experienced and passionate about digital content, knowing the difference between good and terrific content. You’ll understand how to deliver fantastic video online and social media as growth drivers.  Additionally you’ll be comfortable defining and smashing performance targets, in coordination with your team.<br /><br /> <br />*Key Responsibilities*<br /><br />* Develop, implement and manage the execution of a content strategy to deliver against the business goals.<br />* This will include all types of content, with education being a big focus and multiple mediums (video, articles, guides, print) to be used on our sites and in our app.<br />* Build, mentor and lead a team to support your strategy. You’ll be fundamental in planning how the team is structured to support: Video content production, social media, internationalisation (and multilingual content creation), blogger outreach, PR and SEO.<br />* Manage a budget and team to deliver the best output. Including: production agencies, content freelancers, social media and SEO managers<br />* Be the tone of voice guardian for the business and support all business functions to create copy that reflects them<br /><br />*Experience and Skills Required*<br /><br />* A flair for, and experience of, content creation in all forms including video<br />* Analytical mindset - comfortable measuring performance and drawing conclusions from data.<br />* Experience of people and agency management<br /><br />*What We’re Offering*<br /><br />* Competitive salary and employee benefits package: options over shares, private medical insurance, pension scheme, cycle to work and childcare vouchers<br />* Central London location in a bright, spacious office between Tottenham Court Road and Holborn tube stations<br />* Smart and kind colleagues who help each other to get things done<br />* To be part of a fun, fantastic organisation and eat cake every day!<br /><br />",
    "urlFetchPending": false,
    "published": "Mar 9, 2017 10:25:18 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "5wSKulzkTAS1ZTsE4HCjyw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/55129/german-content-executive-at-lovecrafts/",
    "title": "German Content Executive",
    "content": "*About us:*<br /><br />Our vision at LoveCrafts is to create an entirely new platform for the global maker community - one craft at a time. We launched our first site four years ago - early success led to funding from one of Europe's leading venture investors - and we haven't looked back since. With a global customer base, physical hubs in London, Manchester, Kyiv, Ukraine and Illinois, USA; and 3 x growth year on year, we’ve grown from startup to sensation in a very short space of time.<br /><br />As we set out to converge traditional crafts with the digital age we are looking for exceptional talent to help us disrupt and innovate in this highly dynamic sector. We're playing with the very best in web, mobile, social, commerce and media technology as we create the perfect digital business for all things craft related.<br /><br />Our team is smart, kind and slightly kooky with talent that is insatiably curious and supremely ambitious. We hire and nurture inquisitive, creative minds looking to flourish in a supportive and collaborative environment that includes social and e-commerce stalwarts hailing from the likes of Yahoo!, Amazon, eBay and Pinterest.<br /><br /><br />*About the opportunity:*<br /><br />We’re looking for a driven marketer or copywriter to join our content marketing team to nurture and grow our German website.<br /><br />Working closely with the SEO team, Content Manager and in-house crafts experts, you’ll have a lot of responsibility early on. You’ll lead the planning, execution and reporting of success in your region. That includes everything from written copy, to helping out with imagery and even video shoots.<br /><br />As an expert in demand across the business, you’ll regularly work across teams as the guardian of quality German copy everywhere: on the website, in emails, in advertisements and offline.<br /><br /> <br />*Responsibilities:*<br /><br />* Understand what a German audience wants<br />* Stay on top of trends in German-speaking markets<br />* Perform keyword research for your markets<br />* Formulate content plans to meet traffic and engagement targets<br />* Produce and publish engaging written or translated copy<br />* Supervise the delivery of content by external agencies and freelancers<br />* Write and edit German copy needed across the business<br />* Specifically, work with the SEO team to optimise German search results<br />* Deliver imagery to use in content on site and on social media, working with our graphic designers if necessary<br />* Support creation of video, social content, and influencer-driven content<br />* Work with social media and influencer managers to promote content widely<br />* Support the launch of new craft websites in German-speaking markets<br />* Report on the success of our German content<br />* Pitch in wherever else you’re needed<br /> <br /><br />*Your skills and experience:*<br /><br />* You’re a native German speaker or fluent in written German.<br />* You write regularly (preferably in German). You love writing, and that comes across in your work.<br />* You understand the wider context of content marketing and what it can do for the business.<br />* You organise your own work efficiently.<br />* You can help agencies and freelancers to organise theirs.<br />* You always deliver.<br />* You’re a great communicator.<br />* You have flawless spelling, grammar, proofreading and editing skills with excellent attention to detail.<br />* A good visual eye.<br />* A creative thinker.<br />* You’re smart, kind and you make things happen!<br /><br />*As a bonus:*<br /><br />* Experience performing keyword research<br />* Experience reporting on the success of your content projects through metrics important to an online business, like traffic, engagement, back links, search engine visibility<br />* Knowledge of simple analytics packages<br />* Knowledge of HTML<br />* Knowledge of a graphics editing packing like Photoshop<br />* You’re a knitter, crocheter or crafter<br /> <br />*What We’re Offering:*<br /><br />* Competitive salary and employee benefits package: options over shares, private medical insurance, pension scheme, cycle to work and childcare vouchers<br />* Central London location in a bright, spacious office between Tottenham Court Road and Holborn tube stations<br />* Real responsibility and huge levels of autonomy<br />* Smart and kind colleagues who help each other to get things done<br />* The opportunity for further development and wider responsibility within the business as we grow<br />* To be part of a fun, fantastic organisation and eat cake every day!",
    "urlFetchPending": false,
    "published": "Mar 9, 2017 10:17:44 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "QVmUL2XoTKuus1hKUi3B5Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56858/telemarketing-sales-executive-at-lovestruckcom/",
    "title": "Telemarketing Sales Executive",
    "content": "This is an exciting opportunity to join a rapidly-growing international Matchmaking Agency in a Sales-focused role.<br /><br />Lovestruck Infinity is an exclusive, bespoke matchmaking and introduction Agency from multi award-winning online dating site Lovestruck.com. It’s been designed purely for those looking for committed, meaningful relationships, but without the time to do so themselves.<br /><br />This is no normal telemarketing sales role; you will be working closely with the MD, Matchmakers and Services team, where you will play a central role in maximising our face-to-face meetings at a time of rapid expansion.  <br /><br />Responsibilities:<br />* Calling Clients on the Lovestruck database and converting them into quality F2F appointments for our Matchmakers<br />* Meeting and exceeding monthly targets<br /><br />What we’re looking for:<br />* Experience of telemarketing/ telesales and managing outbound lead generation campaigns (B2B or B2C)<br />* Structured sales-oriented approach with strong, listening and objection handling skills <br />* Naturally interested in psychology and the world of matchmaking<br />* Influencing skills, confident with questioning and prospecting<br />* Self-driven, hard-working and detail-oriented, with excellent communication skills<br />* Degree-educated from a top University, with excellent spoke and written English<br />* A clear, charming and impeccable phone / email / WhatsApp manner<br />* You are a “people person” – approachable, engaging and empathetic<br />* You are confident in your ideas and willing to push them at a senior level within the business<br /><br />What we offer:<br />* £18,000 basic salary<br />* Uncapped commission<br />* Responsibility from day one in a rapidly-growing company in an exciting industry that’s ripe for disruption<br />* Opportunity to develop and manage a team of outbound telemarketers<br />* Incredible office bang in the centre of Soho<br />* 20 paid holiday days per year (pro rata’d)<br />* Pension<br />* Regular team events and evenings<br /><br />Job Type: Full-time (11am - 7pm 5 days a week (inc. weekends)",
    "urlFetchPending": false,
    "published": "Apr 28, 2017 11:14:28 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "BlfLvz3LRzm5k7cKkUr1NQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56775/senior-account-manager-dach-mf-at-relayr/",
    "title": "Senior Account Manager DACH (m/f)",
    "content": "relayr is recruiting Senior Account Managers to join our fast growing sales team in DACH region!<br /><br />Accelerate your career as you help to drive digital transformation and business outcome for business at our large enterprise customers in Germany, Austria and Switzerland. If you are passionate about IOT technology and want to be part of the digital revolution, join the relayr team in who is leading the journey to IOT connected industries.<br /><br />GENERAL SUMMARY<br /><br />Works with named or large key accounts to provide product solutions, develop new business, and to ensure tangible business outcomes and maintain positive ongoing relationships. Works with other internal sales personnel to propose specific solutions for a given account. Responsible for the overall sales strategies and generating results from the client. Plans and directs all sales activities and selling resources. <br /><br />This position requires excellent communication skills to meet or exceed the assigned revenue targets. Qualified candidates will need to interact with our ecosystem, Inside Sales Teams, and cross-functional departments to maximize speed to market and sales for exciting Internet of Things (IoT) solutions. Can effectively interface at many levels with senior managers on C-Level<br /><br />Job Responsibilities and Key Objectives:<br /><br />Driving Business Relevance /Customer Value Selling<br />Driving Sales Growth – Focusing on accounts to drive sales attainment numbers.<br />Accurately forecasting monthly, quarterly and annual revenue streams; driving profitable growth.<br />Analysing your customer’s financials to understand their pain points.<br />Driving business planning and goal attainment.<br />Effectively facilitating joint initiatives with cross-functional teams and strategically engaging cross-functional resources to achieve sales goals<br />Building Winning Capability within relayr – Focusing on collaboratively contributing to the long term success of relayr through the sharing of best practices<br />Consistently striving to improve and reinvent yourself<br />Actively promote relayr’s suite of solutions, products and services to prospects, customers, and partners<br />Engage proactively in cross-selling and upselling sales activities to drive the adoption of relayr technology<br />Successfully manage and overcome prospect objections<br />Consistently update forecast and opportunity details within Salesforce.com to ensure accurate weekly forecasts<br /><br />Requirements:<br /><br />A persistent, self-starter with a track record of successful, credible follow-up and unsolicited calling to multiple executive levels within an organization<br />A personal desire to work in a start-up culture, using inside sales as a step stone into field sales roles<br />Fluency in English & German<br />Proven successful sales experience, preferably in IT or a similar industry<br /><br />Skills required:<br /><br />Opportunity qualification and objection handling<br />Call structure and control<br />Time and territory management<br />A team player with the ability to work in a high-energy sales team environment<br />Experience and success working within a revenue quota and commission structure<br />Ability to multi-task, and operate successfully in a rapidly changing environment<br />Proficiency with standard corporate productivity tools<br />A good understanding of the cloud and IoT market and experience in discussing technology with customers<br />Sales training – Salesforce.com experience a plus<br />College degree or equivalent work experience<br /><br />We Offer:<br /><br />Flexible office environment <br />A diverse and friendly team with people from all over the world, speaking 10+ languages, of all ages and parental-status<br />Connecting you with a network of companies and people from around the globe<br />A learning environment where you can extend and build upon your skills and interests, as well as knowledge-sharing at our semi-weekly events<br />Opportunities to attend events and conferences pertaining to your discipline<br />Competitive Salary and Stock Options<br />Cool office with free beverages, fresh fruit, a kicker table, a variety of team events, and social activities – we love to hang out and be social!<br />We offer the ability to work in a cutting-edge field with the best people in the IoT industry!",
    "urlFetchPending": false,
    "published": "Apr 26, 2017 9:31:11 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "Mp3fIef-RGage3xn7Fb77Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56720/ambitious-sales-executive-at-uberated/",
    "title": "Ambitious Sales Executive",
    "content": "We’re a funded, fast growth start-up transforming the way people shop, looking for an ambitious Sales Executive who wants a fast track to a Head of Sales role.<br /><br />*What we do*<br />At Uberated, we understand that the modern shopper expects to conduct thorough research before making any significant purchase, and how frustrating it can be to try and find this information. We streamline the shopping journey by consolidating expert reviews, advice and opinions from trusted publishers, magazines and independent experts, and display them in retail stores and websites. Almost half of shoppers rely on expert product reviews to help them decide what to buy, and Uberated makes it easy to read these while shopping, rather than spending hours searching.<br /><br />*About the role:*<br />We are currently recruiting for a Sales Exec to join our team for a 6-month period to help us deliver our ambitious growth plans. Help us reach our milestones, and a Head of Sales position beckons - including share options and a significant stake in the future of the business. <br />It’s an opportunity to make a mark on a fast-growing start-up with the potential to rocket your career upwards.<br /><br />*What we are looking for*<br />A smart, outgoing and positive personality who has the grit and passion to work in a fast-paced start-up environment. Someone who brings sales experience, but still wants to learn, and has the initiative and tenacity to solve problems for our clients.<br />You should be excited about our mission to make shopping easier<br />We will support you with mentoring and advice to accelerate development of your skills and give you every opportunity to make an impact.<br /><br />*Specifically, you will be expected to:*<br />* Develop and grow strong client relationships<br />* Deliver against sales targets<br />* Work in partnership with the leadership team to exploit and identify new business opportunities <br />* Track and generate new leads<br />* Keep an up to date and accurate record of activities to enable reporting to the CEO & Board<br /><br />*What we offer*<br />* The opportunity to join a small team of smart, passionate people and work in a fast-paced start-up environment<br />* An awesome workspace in Earls Court, shared with a bunch of exciting start-ups.<br />* A 6-month role with success leading to a permanent position, and a significant bump in responsibility.<br />* Rapid career progression towards a senior leadership role.<br />* Work directly with the CEO, and get a significant professional investment in growing your skills.<br />* The chance to make a meaningful impact and help shape a fast-growing start-up<br /><br />*How to apply*<br />If you think you would be a great fit, then we’d love to hear from you. Please send over your CV and a summary of why you think you’d be perfect for the role.<br />Recruitment agencies need not get in touch.",
    "urlFetchPending": false,
    "published": "Apr 24, 2017 6:59:35 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "ZHiJzzjMTjin5lmKTNWaUw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56703/sales-executive-closer-required-uks-1-epos-in-hospitality-at-nobly-point-of-sale/",
    "title": "Sales Executive (Closer Required) - UK's #1 EPOS in Hospitality",
    "content": "ABOUT NOBLY POS AND THE ROLE:<br /><br />Nobly POS helps hundreds of happy coffee shop, restaurant and bar owners in over 20 countries. Rated the #1 iPad POS system, we’re HQ’d in London, with sales and development teams in New York City and Montevideo, Uruguay.<br /><br />We enable our amazing merchants to burn through the queues, view in-depth sales reports, better manage their inventory, track customer loyalty and more!<br /><br />This is a full-time opportunity in our London office where you will be visiting, pitching and closing exciting food and booze locations in London. You will play a vital role in driving sales forward by closing deals and exceeding your targets!<br /><br />WHAT YOU’LL DO:<br /><br />Run live and remote demos booked by the Sales Development team<br />Pitch and demo Nobly POS to potential customers<br />Move deals forward and close opportunities<br />Prospect new venues and opportunities<br />Pack out sales pipeline with additional deals<br />Build productive long lasting positive relationships in the F&B space<br />Meet and beat personal and team sales targets<br /><br />WHAT YOU NEED:<br /><br />Love closing.<br />Self-motivated and highly ambitious self-starter.<br />Perfect presentation and communicator.<br />1 + years sales experience and proven closer.<br />Desire to develop your skills and expand with the sales team<br /><br />BONUS POINTS:<br /><br />Experience dealing with SME’s<br />Prior experience in the hospitality industry<br />Knowledge of POS and payments systems<br /><br />BENEFITS:<br /><br />Brilliant progressive, bonus structure based on performance<br />Become part of the fastest growing #1 rated EPOS system<br />Progress to Senior Sales Executive in less than 6 months<br />Team drinks, events, activities and rewards<br />Help develop a young, fast-growing, dynamic & international organisation",
    "urlFetchPending": false,
    "published": "Apr 24, 2017 1:13:58 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "4ofiLdHLREutSZ2n4rIS3A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56697/sales-executive-at-second-screen/",
    "title": "Sales Executive",
    "content": "SECOND SCREEN are looking for a highly driven sales executive to head up a small sales team selling apps to music industry professionals. Day to day duties will include selling both over the phone and pitching in person, leading and directing the sales team, constructing sales pitches, reporting progress to the board and working closely with them to ensure targets are met across the whole team.<br /><br />Key Skills: 2 years experience in sales, enthusiastic, articulate, computer literate, clear understanding of multiple music genres, has attended a lot of festivals and understands the mechanics behind them, can speak and pitch confidently to music industry people. <br /><br />Desired skills (but not necessary): <br /><br />- Can drive and own a car to attend meetings<br />- Multi-lingual <br />- Good contacts<br />- Good with Adobe package programmes (PhotoShop, InDesign, Premier etc)<br />- Technical Knowledge around app development particularly Xcode and Swift <br /><br />Please apply if you feel you tick most or all of these boxes.<br /><br />Immediate start. Need to be available for an interview between 8th - 12th May 2017<br /><br />Please submit CV and cover letter to apply.",
    "urlFetchPending": false,
    "published": "Apr 24, 2017 11:46:59 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "TxWweDbYTF2jYHWLebamNw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56663/business-development-manager-at-nearst/",
    "title": "Business Development Manager",
    "content": "At NearSt we're looking for an awesome Business Development Manager to join our growing team. We’re a local shopping platform that enables you to buy anything from real shops nearby in just a couple taps of your phone. As our Business Development Manager you’ll play a key role in finding and building the relationships with hundreds of unique shops that makes achieving our mission possible: getting people all around the world back into their high street shops.<br /><br />Our startup is 18 months old and our technology has already earned us backing led by TrueStart / True Capital, international awards, and speaking slots at many events including on the main stage at WIRED Retail. Today we’re the largest bookshop network in London and we’re well on our way with half a dozen more categories (from DIY to Health & Beauty). You’ll be joining an energetic and ambitious team who’ve previously worked on everything from major global brands to building other fast-growth startups.<br /><br /><br />BUSINESS DEVELOPMENT MANAGER<br /><br /><br />Are you talented and driven to be part of a team that is changing how we all shop, and not afraid of goals others might call impossible? Yes - excellent; keep reading.<br /><br />As a Business Development Manager you will have the unique opportunity to make a huge impact on growing NearSt. Your main objective will be to identify and develop sustainable relationships with the best retail shops in London. This stretches from finding who they are, all the way to bringing them on-board and making sure their first months on NearSt are an incredible success.<br /><br />To be successful in this role you will have proven sales and account management experience developed ideally in a retail/b2b environment. You’ll be working closely with the marketing, strategy and tech team to develop, test and implement strategies for growing NearSt’s partnership network of shops in specific retail categories. Reporting directly into the Head of Growth, you'll be one of the first members of a team we'll be expanding quickly this year and who will play a big role in the success of NearSt.<br /><br /><br />Responsibilities<br /><br /><br />->Your main objective will be to develop sustainable relationships with the best retail shops in London, with the goal of converting them into Retail Partners of NearSt.<br />->You will proactively be identifying and acquiring new business opportunities in your area.<br />->You will own the entire sales funnel, from identifying prospective partners, meeting decision-makers, closing deals and on-boarding new shops to the world of NearSt.<br />->You'll have full ownership of everything you do and will be a true ambassador of NearSt.<br /><br /><br />Requirements<br /><br /><br />->Bachelor’s degree and +2 years of B2B sales experience, ideally in the retail industry<br />->Based in London<br />->You’re passionate about our mission to get people back into their local shops by connecting every product, in every shop, in every high street to the internet.<br />->A customer service orientation and proven track record of experience in sales<br />->Strong project management and organisational skills<br />->Excellent communication and presentation skills, both written and verbal<br />->An entrepreneurial and driven mindset, with a getting things done attitude<br />->You are eager to learn and striving to be better every day in order to grow with the role as the company expands<br />->And generally a great person to work with and added value to the team<br /><br /><br />Benefits<br /><br /><br />->A challenging and exciting position in a fast-paced environment with the opportunity for you to grow with the company<br />->Competitive full-time salary based on experience bonus<br />->A contract for 1 year with a renewal option (subject to performance) based on a full-time appointment<br />->Strong options plan - own a stake in the company<br />->An office in the heart of tech city (Old Street) working alongside other energetic and talented people.",
    "urlFetchPending": false,
    "published": "Apr 22, 2017 10:58:41 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "c2BSVq2gRZe8_IZjhtWmiA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56549/junior-sales-executive-at-wegift/",
    "title": "Junior Sales Executive",
    "content": "WHO WE ARE<br /><br />WeGift are a leading UK start-up based in London with a development team in Cambridge:<br /><br />We’re backed by high profile Angels, funds and a global corporate with clients including New Look, L.K.Bennett and Tradedoubler.<br /><br />We’re unlocking a $300 billion analogue gift card market through the power of real time data connectivity. Through a set of powerful API and ecommerce solutions we’re enabling instant ordering, advanced analytics and a revolution in payments by creating a new payment rails by turning plastic analogue gift cards into a real-time digital currency.<br /><br />THE JOB<br /><br />We are looking to hire a Junior Sales Executive who will be responsible for generating leads and closing deals with corporate gift card buyers and retailers as we look to grow our UK and European market.<br /><br />You’ll be working closely with the CEO and Head of Sales with the idea that your sales skills will be complemented by their technical knowledge. You’ll be expected to use your initiative and take responsibility for:<br />Proactively sourcing new leads and new business opportunities<br />Researching accounts to understand need, enable effective follow up, and generate interest<br />Performing outbound sales activities such as cold calling, lead follow-up, and opportunity qualifications<br />Leading product demonstrations and client meetings with senior executives<br />Leading and managing a sales pipeline<br />Reporting on sales activity and revenue forecasts<br />Contributing to our company’s overall strategy in finding new opportunities for growth<br /><br />You will have:<br />2+ years of sales, business development or customer acquisition experience<br />Demonstrable ability to generate and follow up on business leads effectively with excellent networking skills<br />Capability to learn a new technology quickly, and understand its benefits, and communicate this to prospects via phone or face to face<br />Strong familiarity with web tools (analytics tools, task management, CRMs, eCommerce, etc)<br /><br />You will be:<br />Likeable and good at building relationships<br />A strong communicator with excellent written and verbal English<br />Persuasive and able to make things happen<br />Organised and systematic<br />Comfortable interacting with Directors and C*level executives<br />Comfortable picking up the phone and calling<br />Persistent. You’re naturally upbeat and are aware that sales is a numbers game<br />Competitive. Improving your customer conversion metrics are top of mind<br />A self-starter, who can establish and organize daily sales activities with minimal supervision<br /><br />We'd love it if you:<br />Have experience in technology or B2B sales<br />Can demonstrate an understanding of the Gift Card and/or Retail market<br />Can show examples of deals you have closed<br />This is a unique opportunity to be involved in a fast paced, early-stage funded venture where you’ll be involved first-hand in defining the company’s processes and helping us grow. You’ll have autonomy and ownership of the topics you’ll be driving along with the guidance and tools to execute them. This is a challenging opportunity in a result driven environment.<br /><br />Basic Salary: £20K-25K DOE<br />You will earn a percentage of the net profits for all new business you generate for the company. This will not be capped in any way<br />25 Days Leave<br />Long-Term Incentive Scheme (Options Plan)<br />Based Central London<br /><br />What we want to hear from you<br />Why you want to work for WeGift and what interests you about this job?<br />What personal qualities and work experience do you have that would make you a good fit for this job? ",
    "urlFetchPending": false,
    "published": "Apr 19, 2017 11:47:27 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "4UqorxDUSuuLhyivL-BRYA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56479/businesss-development-executive-at-midrive/",
    "title": "Businesss Development Executive",
    "content": "miDrive is the modern way to learn to drive. Frustrated by the poor safety outcomes, high costs, and lack of transparency in the learn to drive industry, miDrive set out to disrupt it.<br /><br />Based in London, miDrive uses tech and data with a fresh attitude to empower both learners and instructors. Offering the largest marketplace of independent instructors (all fully approved, highest rated in the industry) and mobile-first tools to support learning, miDrive is first time driving as it should be.<br /><br />Over 300,000 young people in the UK have already gained their independence with miDrive. Having reinvented learning to drive, miDrive’s next set of products focus on reinventing first time insurance.<br /><br />Founded in 2013, miDrive has raised £5m to date from a respected group of well-connected and supportive investors ‒ including Holiday Extras & Initial Capital.<br /><br />*REQUIREMENTS*<br /><br />Love the idea of forming and developing business partnerships? Become the third member of our enthusiastic Business Development team. We are all about work hard, play hard so get ready to get stuck in, learn skills of successful business partnerships, gain loads of experience and have a lot of fun along the way.<br /><br />There is no such thing as a typical day at miDrive, you will be exposed to all aspects of the company:<br /><br />- Gain experience in outbound communications, by contacting potential miDrive partners.<br /><br />- Account management of all your onboarded partners. You will be expected to build long-term partnerships and make sure that engagement levels with miDrive and our technology remains high.<br /><br />- You will be required to use multiple sources to research potential miDrive partners.<br /><br />- Provide feedback to our development team, share product ideas, and help our business grow.<br /><br />- Be given a lot of responsibility to manage your own time and targets. You’ll be expected to carve out a unique role in the company, and we encourage you to follow up on your own initiative and run with ideas yourself.<br /><br />- Be part of a fun, young, ambitious team, based in a beautiful new startup office (if you have a puppy please bring him/her along).<br /><br />*What we are looking for:*<br /><br />- 1-2 years experience in business development, operations or direct sales.<br /><br />- An upbeat, enthusiastic team player.<br /><br />- Excellent communication skills, including engaging and appropriate phone manner and good spelling and grammar.<br /><br />- Strong problem solving skills. You will be responsible for solving problems ranging from technical issues, to partner payment enquiries.<br /><br />- Target driven. A determination to set their own goals and not stop until they have achieved what they set out to do.<br /><br />*Bonus points:*<br /><br />- A good handle on numbers and simple analysis.<br /><br />*BENEFITS*<br /><br />At miDrive, we believe it’s the people that work here that makes us successful. We are a start-up with big ambitions and we work hard so we want to give our people benefits that they really want. We’re constantly adding to this as new people join but here’s a list of the sorts of things you can expect:<br /><br />- TGIMonday Breakfasts, Juice Wednesdays, Happy Hour Thursdays<br /><br />- Fun social events - recent adventures have included escape rooms, comedy clubs, and visits to high up places (e.g. Shard, SkyGarden)<br /><br />- Regular guest speakers, networking events and ping pong (anytime)<br /><br />- Free beer, cider and prosecco all on tap!<br /><br />- Up to 2 weeks unpaid leave per year to pursue personal projects (additional to standard holiday allowance)",
    "urlFetchPending": false,
    "published": "Apr 18, 2017 4:00:40 PM",
    "tags": [
      "TITLE1_manager",
      "TZ_Europe",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "EU work authorisation",
      "Europe timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "fhF00V4XR6CehSebzhqhDg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56475/customer-happiness-operations-executive-at-midrive/",
    "title": "Customer Happiness & Operations Executive",
    "content": "*About us:* <br /><br />miDrive is reinventing learner driving and insurance. Frustrated by the poor safety outcomes, high costs, and lack of transparency in the learn to drive industry, miDrive set out to disrupt it. <br /><br />Based in London, miDrive uses tech and data with a fresh attitude to empower both learners and instructors. Offering the largest marketplace of independent instructors (all fully approved, highest rated in the industry) and mobile-first tools to support learning, miDrive is first time driving as it should be. <br /><br />Over 300,000 young people in the UK have already gained their independence with miDrive. Having reinvented learning to drive, miDrive’s next set of products focus on reinventing first time insurance. <br /><br />Founded in 2013, miDrive has raised £5m to date from a respected group of well-connected and supportive investors ‒ including Holiday Extras & Initial Capital. <br /><br />Learn more at &quot;midrive.com&quot;:https//midrive.com<br /><br />*Requirements*<br /><br />Love to solve problems and make a difference? At miDrive, the UK’s #1 app for learning to drive comes with the UK’s best customer support. Trustworthy troubleshooting and skilled advice are just part of the equation — we want our customers to be happy with every interaction they have with us.<br /><br />We’re seeking a talented *Customer Happiness & Operations Executive* to join our team and make a major contribution to our success. We're looking for someone who can:<br /><br />- Show great professionalism and empathy responding to customer and instructor inquiries via phone, email and online chat.<br /> <br />- Gain experience across a wide range of operational issues including process design, critical path management, and accounting/billing.<br /><br />- Solve tricky problems ranging from technical issues, to product requests, to pricing and refunds.<br /><br />- Provide feedback to our development team, share product ideas, and help our business grow.<br />Work across our Customer Happiness and Partnerships team. <br /><br />- Be given a lot of responsibility from day one <br /><br />- Be part of a fun, young, ambitious team, based in a beautiful new startup office (if you have a puppy please bring him/her along).<br /><br /><br />*What we’re looking for:* <br /><br />- Someone who is flexible and adaptable <br /><br />- Wants to join a core member of a growing Operations team <br /><br />- Enthusiasm for problem-solving, helping others, and going above and beyond.<br /><br />- Ideally, 1-2 years of telephone and email based customer support experience, or alternatively a Bachelor's degree with a minimum 2:1 and a demonstrated record of achievement.<br /><br />- Excellent written and spoken English.<br /><br />- High level of initiative and comfort working in a small dynamic company/startup environment.<br /><br />- Attention to detail, good basic maths, and creative skills (to help our finance and marketing teams during quiet periods).<br /><br />- Ability to thrive and grow as our products and company evolve<br /><br />- A passion for making UK roads safer -- we are on a crusade to reinvent learner driving and insurance!<br /><br />*Benefits:*<br /><br />At miDrive we work really hard, so that's why we make sure that we have best facilities to play harder! We have a host of goodies: <br /><br />- TGIMonday Breakfasts, Juice Wednesdays, Happy Hour Thursdays<br /><br />- Monthly team social events - recent adventures have included escape rooms, comedy clubs, and visits to high up places (e.g. Shard, SkyGarden)<br /><br />- Regular guest speakers, networking events and ping pong (anytime) <br /><br />- We even have *beer*, *cider* and *prosecco* on tap!<br /><br />We *are not* working with any *staffing firms or agencies* and will *not* be accepting CVs from them.",
    "urlFetchPending": false,
    "published": "Apr 18, 2017 2:55:54 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "USNnDiJ_QY20pEItynoqtQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56177/graduate-sales-executives-at-evvnt/",
    "title": "Graduate Sales Executives",
    "content": "Due to a recent sales success, we are expanding our sales team and we are now looking for graduates who wish to develop themselves as Sales Executives to join the evvnt team.<br /><br />What we are looking for… Smart, enthusiastic, commercially driven individuals who wish to develop themselves within a sales and business development environment. We have a team of experienced sales executives and managers willing to develop you from scratch in the art of sales at a global level.<br /><br />What we are offering… A competitive salary and uncapped commission scheme supported with a business development training program and extensive sales coaching.<br /><br />Our Ideal Candidate –<br /><br />Interest in direct sales experience.<br />Passionate about speaking to people and negotiating deals.<br />Skilled at understanding and executing a sales process.<br />Comfortable and excited with the prospect of talking to C-suite clients.<br />Natural phone manner with the ability to listen.<br />Strong work ethic and works to target and not to time.<br />Great attitude with the ability to work alone and as part of a team.<br />Work as part of a multi-functional and talented team with excellent interpersonal and presentation skills<br />Used to working in a fast paced and dynamic working environment.<br />evvnt is a technology company based in the heart of Soho, Central London.<br /><br />evvnt enables people all over the world to fill their events by utilising the most effective event listing sites on the web. Every minute, with little more than a click, more events and conferences appear in listings, in search engines and on mobile – discoverable by both category and location. With next to no effort customers of evvnt get greater attendance, while consumers find events they previously had no idea existed.<br /><br />To date, evvnt customers in more than 130 countries have submitted over 1m+ event listings worldwide.<br /><br />Learn more at www.evvnt.com",
    "urlFetchPending": false,
    "published": "Apr 7, 2017 9:20:00 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "BDVo-BBwTqOHc545Z3waEQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56162/sales-executive-at-evvnt/",
    "title": "Sales Executive",
    "content": "Due to a recent sales success, we are expanding our sales team and we are now looking for experienced Sales Executives to join the evvnt team.<br /><br />What we are looking for… Smart, enthusiastic, commercially driven individuals who wish to develop themselves within a sales and business development environment.<br /><br />What we are offering… A competitive salary and uncapped commission scheme supported with a business development training program and extensive sales coaching.<br /><br />Our Ideal Candidate –<br /><br />Previous 2 years plus of direct sales experience.<br />Recruitment or telesales sales background<br />Skilled at understanding and executing a sales process.<br />Comfortable with talking to C-suite clients.<br />Natural phone manner with the ability to listen.<br />Strong work ethic and works to target and not to time.<br />Great attitude with the ability to work alone and as part of a team.<br />Work as part of a multi-functional and talented team with excellent interpersonal and presentation skills<br />Used to working in a fast paced and dynamic working environment.<br />APPLY TODAY<br /><br />evvnt is a technology company based in the heart of Soho, Central London.<br /><br />evvnt enables people all over the world to fill their events by utilising the most effective event listing sites on the web. Every minute, with little more than a click, more events and conferences appear in listings, in search engines and on mobile – discoverable by both category and location. With next to no effort customers of evvnt get greater attendance, while consumers find events they previously had no idea existed.<br /><br />To date, evvnt customers in more than 130 countries have submitted over 1m+ event listings worldwide.<br />",
    "urlFetchPending": false,
    "published": "Apr 6, 2017 5:17:43 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "vdUf5y0DQOO9ZnniGBrsLw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56150/new-business-executive-at-the-bot-platform/",
    "title": "New Business Executive",
    "content": "*About The Bot Platform*<br /><br />The Bot Platform is the trusted platform for building bots on Messenger, recommended by Facebook.<br /><br />We work with customers such as the BBC, Sony Music, and Universal Music Group to create engaging bots that deliver great business value. Our founders have previously run an award winning creative technology company.<br /><br />The Bot Platform helps brands and companies engage with their audience on a 1-1 private and automated manner, generating sales, high levels of engagement and boosting loyalty.<br /><br />We are a technology start-up with big ambitions, a fun culture and we’re looking for more people like us to help us take it to the next level as we continue to grow the business.<br /><br />*Job Description*<br /><br />As a member of the The Bot Platform team, you inspire leading companies, brands, and agencies to work smarter with private 1-1 communications. Using your passion for digital solutions, you help spread the magic of The Bot Platform to organizations around the world.<br /><br />This role is an exciting opportunity to help build the next big business and define the future of truly ground-breaking technology.<br /><br />In this role, you work to drive awareness, adoption and business of The Bot Platform. This role commands a large amount of responsibility, and you are expected to participate actively in all aspects of building the business. This includes strategic planning, demand generation, installed base engagement/promotion and account management.<br /><br />The Bot Platform helps millions of people privately communicate with businesses all around the world, and build what’s next for their business — all with trailblazing technology. Our products are engineered for security, reliability and scalability. And our teams are dedicated to helping our customers — brands, agencies, media & publishers, sports & entertainment, travel & hospitality — see the benefits of our technology come to life.<br /><br />*Responsibilities*<br /><br />* Ensure delivery of new business Monthly Recurring Revenue (MMR) objectives<br />* Build and maintain executive relationships with customers, influence long-term strategic direction, and act as a trusted advisor.<br />* Help develop and execute a territory business plan, and build targeted account plans across key verticals (media, genomics, gaming and finance), resulting in a robust pipeline.<br />* Execute demand generation activities as needed, and engage, educate and ensure satisfaction of the installed base.<br />* Be able to qualify, and assist customers in identifying use cases suitable for bot deployment, articulate key differentiators and typical customer buying journeys, and generally display a passion for computer science and cloud.<br />* Manage multiple opportunities through the entire cycle simultaneously, working with cross-functional teams as necessary.<br />* Serve as the primary customer contact for all adoption-related activities.<br />* Communicate effectively with English-speaking clients.<br />",
    "urlFetchPending": false,
    "published": "Apr 6, 2017 3:01:23 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "S1DOHQpRRoe21Ke3HIWVKQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56029/senior-business-development-executive-at-benivo-formerly-flatclub/",
    "title": "Senior Business Development Executive",
    "content": "We are working hard to take away the stress of moving and starting a new job by providing companies with the *world’s first cost-effective relocation technology solution for junior employees*. We're a fast-growing team of 60+ people, boasting 15 nationalities and no matter the seniority or level of responsibility, each person can make a contribution to the success of a company. *That’s why we believe in making every employee welcome.*<br /><br />We're looking for a *Senior Business Development Executive* to join our ambitious Corporate Sales team to *prospect high-value business from large organisations and generate qualified leads.*<br />This is an opportunity for an experienced sales hunter, results driven and with some previous B2B sales exposure.<br /><br />Key to this position is the ability to work in a truly fast-paced, fast-changing environment.<br /><br />*Responsibilities*<br /><br />* Prospect high-value business at C-level from large organisations<br />* Responsive email & phone communication with new prospect accounts.<br />* Gain a clear understanding of customers’ businesses and requirements.<br />* Conduct conversations with company HR and senior management representatives to enhance client engagement<br />* Reviewing your own sales performance, aiming to meet or exceed targets<br />Work with our Marketing team to advise on the creation of inbound marketing campaigns.<br /><br />*To be considered for this role you must have*<br /><br />* Ideally 1-3 years experience working in B2B business development<br />* Proven track record and excellent sales abilities<br />* Excellent communication skills in English including an excellent telephone manner<br />* Experience in selling Saas a strong advantage but not essential.<br />* Familiarity with CRM systems <br />* Ability to thrive in a fast-paced environment<br />* Passion, ambition and business savvy<br /><br />*Benefits*<br /><br />* Competitive starting salary, dependent on experience<br />* Uncapped commission scheme<br />* Employee stock options and other benefits<br />* Central London location, open space office in a tech startup hub<br />* Drinks and social events on a frequent basis<br />* Become a member of the Techhub and Google Campus start-up community<br />* Develop a deep understanding of industries like Shared Services, Healthcare, Hospitality, IT & Technology<br />* Access to a full library of personal and professional development books and training<br />* Challenging work in a fast-paced environment<br />* Get-things-done culture where you can contribute from day one<br />* Opportunity to build a product for the most innovative companies in the world already assisting Google, Hertz, Vodafone, Microsoft and 60+ companies<br />* Be part of a startup with a potential to become a $1 billion company.<br /><br />Get in touch today!<br /><br />Please note that we will be unable to provide Visa sponsorship for this role.<br />Due to the high levels of applications we receive, we regret that we can only respond to successful applicants.<br /><br />",
    "urlFetchPending": false,
    "published": "Apr 3, 2017 6:36:04 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "mMnuOCe6SDONm_HVs6Bo2A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55932/sales-support-executive-at-perkbox/",
    "title": "Sales Support Executive",
    "content": "<br />The Company<br /><br />Fancy getting involved with one of London’s most exciting companies?<br /><br />http://startups.co.uk/startups-100/2016/2- perkbox/<br /><br />Perkbox is already one of the UK’s leading technology Customer and Employee engagement companies. Voted as the 2nd best Start up in the UK this year, we are a fast paced and high growth business. Founded 5 years ago, we have grown to an organisation that has over 5000 customers and 500,000 users across both Customer and Employee Loyalty and Engagement. We work with companies such as British Gas, AXA, Bupa, The Ritz, Wagamama, Dominos, Hawksmoor and Fiat.<br /><br />As part of our growing success, we are looking to recruit a Sales Support Executive. This role will assist both our Corporate Employee and Customer Engagement teams.<br /><br />The Role<br /><br />Assisting in researching prospects and vertical markets<br />Providing cross departmental support for the Corporate and Customer sales team to achievethe best client propositions<br />Partnership, event and distribution management and support<br />Detailed industry research, and competitor analysis.<br />Marketing, sales tool building and project management<br />Tender information gathering and fulfilment<br />Being the go-to Salesforce, tableau and customer marketing systems expert on the team<br />Supporting CPD and Senior Sales personnel in day to day sales matters.<br /><br /><br />About You<br /><br />2-4 years’ experience in an either an account management or sales support role<br />Highly I.T literate with the solid PowerPoint and Excel skills.<br />Meticulous eye for detail.<br />Proactive in improving processes.<br />Smart, accessible and enough gravitas to be involved in board level meetings.<br />A great person to be around!<br />BENEFITS<br /><br />What You Get<br /><br />Award winning team culture with regular social team events = unlimited drinks, snacks and more<br />Top central London location<br />All perks we sell to our customers are perks we get for FREE.<br />Salary is very competitive and based on experience",
    "urlFetchPending": false,
    "published": "Mar 30, 2017 5:39:05 PM",
    "tags": [
      "TITLE1_manager",
      "TZ_Europe",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "Europe timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "XMkDkGs9QXqv1E2cWYfh9Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/50647/account-executive-at-marvel/",
    "title": "Account Executive",
    "content": "Marvel is a fast growing prototyping and collaboration tool that transforms static design files and mockups into interactive, sharable prototypes that look and feel real apps and websites with needing to code.<br /> <br />Through word of mouth alone we've grown to 500,000 users including the likes of Deliveroo, ustwo, Transferwise and Paypal. <br /><br />We’re looking for experienced Account Executives to join the Marvel sales team and help set the pace for growth. This is a really exciting opportunity, as we are building out the sales team from scratch. It’s exactly the right time to join a well funded, series-A startup and grow with the company. The first people who come into the team will have the opportunity to set up the structures and processes, shape the team, and become the future leaders for sales at Marvel.<br /><br />We have a welcoming, supportive and diverse team, and we invest in our people - we are committed to giving you the opportunities and any training you need to succeed. <br /> <br />Working as Account Executive at Marvel you will be closing qualified leads from some of the biggest and most recognisable brands and agencies in the world. Qualified leads will be passed to you by your colleagues in Sales Development. You’ll re-qualify the leads, and use your natural charm to quickly build a relationship with them, answer their questions to turn them into new Enterprise or ‘Company’ level paying customers. Your success will be measured on the value of the new business you bring to Marvel each month. To be successful you’ll need to work closely with the SDRs who will be building the sales pipeline.<br /> <br />If this sounds like you then get in touch!<br /> <br />Responsibilities <br /> <br />Quickly build executive level relationships so you have the credibility to sell in to them<br />Hold meetings (in person, phone or web demos) with your accounts to close enterprise sales deals<br />Where your accounts are not yet ready to buy, know how best to nurture them; never dropping the ball<br />Understand the prospect’s goals, role and business needs <br />Become an expert on the Marvel platform and why it can add value to dozens of different customer types and use-cases<br /><br /> <br />Requirements<br /> <br />2+ years experience in an Account Executive role or similar<br />You have experience in selling to agencies, tech companies and startups<br />You’re a quick thinker and easily able assess and understand a customer’s needs<br />You’re naturally charming, charismatic and able to establish rapport with your customers<br />Fantastic communication skills, both on the phone and in writing<br />You’re extremely driven, and love hitting targets, but know the difference between being persuasive and being pushy, always putting the customer experience first <br />You’re a team player and fun to be around<br />Start-up experience and an interest in design is a plus!<br /><br />Benefits<br /><br />30 days’ holiday<br />Share options<br />Private health insurance<br />50% off Virgin active gym membership<br />1 free cinema ticket per week<br />coffee and loads of delicious snacks in the office<br />team socials and activities<br />Company holiday once per year",
    "urlFetchPending": false,
    "published": "Mar 30, 2017 2:47:27 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "8s9uYDehSimyUKSgcEg3VA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55883/junior-sales-executive-at-florence/",
    "title": "Junior Sales Executive",
    "content": "Florence is a young and dynamic start up that aims to change the face of healthcare staffing forever.  Our platform connects hospitals directly to a pool of nurses looking for extra shifts.  By cutting out the recruitment agencies in the middle, we reduce costs for hospitals and get nurses paid a better wage.  <br /><br />The business was started towards the end of 2016 and has since grown to four full time employees.  The successful candidate would be joining as the fifth hire and would be an integral part of the organisation with real opportunities for professional development. He or she will be personally responsible for developing the client base and their results will be tangible and quantifiable.  As the team is small, there will be cross over between roles with scope for the candidate to build other skill sets.<br /><br />Our offices are in TechHub, a shared workspace environment in the City of London.  It is a relaxing and creative place to work with opportunities to network with other tech start ups. <br /><br />The role of the Junior Sales Executive would include:<br />* Working alongside the Managing Director to secure new clients in the healthcare industry<br />* Conducting research sessions to identify potential clients<br />* Regular calling sessions with the goal of arranging product demonstrations and meetings<br />* Attendance at sales meetings and product demonstration<br />* Production of sales presentations and analysis of team performance<br /><br />Essential personality traits include:<br />* Tenacity and the ability to work through challenges<br />* Someone who revels in working towards and hitting goals<br />* Fiercely competitive <br />* Sociable and engaging<br /><br />As the role develops, the Managing Director will reduce his input into client sales giving the candidate progressively more autonomy and responsibility.  If you are interested in a challenging and dynamic role, then please get in touch.",
    "urlFetchPending": false,
    "published": "Mar 29, 2017 4:51:27 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "A0MeotKnRiKb_yo7IH10Jw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55797/business-development-executive-at-the-aso-co/",
    "title": "Business Development Executive",
    "content": "*The ASO Co* is the leading global App Store Optimisation agency. In a just over a year we have been appointed by some of the largest brands in the world, and are producing record breaking results. <br /><br />We are expanding our *Business Development team* and are looking for a highly motivated individual to join us in London. This role is as fast paced as they come, and requires a strategic thinker with excellent organisational skills. <br /><br />You'll need a passion for people, impeccable business acumen and a strong desire to sell our effective and unique product to the global market.<br /><br />*Responsibilities*:<br /><br />* Working directly with our Business Development Director on proposals and pitches<br />* Working with our data team to assess new markets<br />* Sourcing viable companies to prospect<br />* Directly approaching businesses and telling them about our services<br />* Appearing at and helping to run events and conferences<br />* Ensuring that the client database is kept up to date and prospective clients are followed up with on regular basis<br />* Helping with marketing and management of our social channels<br /><br />*Qualifications*:<br /><br />* 1-2 years experience in the mobile or digital media space preferable<br />* Impeccable relationship building and client facing skills<br />* Strong written and verbal communication skills including ability to deliver strong presentations and pitches<br />* Strong team player<br />* Commercial acumen and negotiations skills<br />* Highly numerate",
    "urlFetchPending": false,
    "published": "Mar 28, 2017 11:31:38 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "Z8UubRdkTuySFLHsrCN8mw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55739/partner-account-manager-at-paymentsense/",
    "title": "Partner Account Manager",
    "content": "Partner Account Manager<br /><br />£35,000 basic with a £60,000 OTE<br /><br />Working for one of the fastest growing FinTech companies in the UK<br /><br />Based in our modern offices off Portobello Road<br /><br />PaymentSense is an award winning, high growth tech company providing awesome accessible and affordable solutions to allow small companies to take card payments.<br /><br />We have an opportunity for an ambitious and commercially minded Business Account Manager to join our Connect team. Connect is a division of Paymentsense, offering an integrated payments solution to the hospitality and retail trade. Connect creates a seamless link between the card machine and electronic point of sale system (EPoS) which improves staff efficiency and provides superfast reconciliation and better customer experience. This is an opportunity to join the fastest growing part of our business in a key development role focused on driving maximum performance from current channel partners.<br /><br />We're looking for an outstanding individual with experience in a fast-paced senior role in B2B sales with the ability to build long term relationships. You should be equally comfortable dealing with partners clients in person or over the phone. Most importantly you’ll be a self-starter who is motivated and tenacious, and can bring a decisive, positive approach to delivering results.<br /><br />You'll need to be an excellent relationship builder and problem solver with fantastic communication and presentation skills. You will be managing our partners and utilising the relationship to drive consistent business growth. This is a role with huge potential and excellent growth prospects.<br /><br />Candidate Profile<br /><br />Experience in managing and developing strategic partnership for maximum growth<br />Demonstrated success in developing long-term relationships with a diverse audience<br />Ability to influence others to make important business decisions with far-reaching impacts<br />Experience in driving channel partner performance<br />Ability to build and execute tailored account management plans based on individual audiences<br />Skills in working across an organization to solve problems and capitalize on opportunities<br />Great communication skills, both written and verbal<br />Self-motivated and able to work on own initiative, but able to work as part of a team<br />Good organisational and time-management skills<br />Excellent negotiating skills<br />Target driven<br />Ability to work in a fast-paced, multi-task environment<br />Excellent time-management skills with the ability to meet deadlines<br />Proven ability of critical thinking, using logic and reason<br />Self-motivation and ability to work on own initiative as well as part of a team<br />Demonstrated pro-active troubleshooting, listening and problem solving skills<br />Enjoy networking and meeting new people<br />The Role<br /><br />Manage referral partnerships with a portfolio of EPoS channel partners of various size, maturity, and complexity<br />Develop strong relationships with partners to enhance sales performance<br />Develop and implement strategies to maximize share of partner referrals<br />Communicate best practices for driving maximum customer adoption of the company’s solution<br />Drive opportunities for jointly marketing the company’s solution into partners’ customers<br />Provide sales and operational support to partners, ensuring consistent satisfaction<br />Maintain a high degree of ethical behaviour in all aspects of daily business including relationships with partners, merchants, co-workers<br />Develop and maintain a thorough understanding of applicable products and services as they evolve<br />Administer and day-to-day management of partner accounts<br />Analyse, interpret and present results from partner accounts<br />Respond to partner/client communications or queries and resolve any client issues<br />Provide management with regular partner feedback<br />Liaising with various parts of the business i.e. Sales, Marketing, Finance, etc.<br />Why work for us?<br /><br />We are a people focused company, so spend time making sure we have a great work culture, from beer Fridays to free yoga, excellent bonus schemes and extra holiday days. We win awards for what we do, and have people in the company progress from entry level roles to heads of departments.",
    "urlFetchPending": false,
    "published": "Mar 27, 2017 10:18:52 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "jEXNUWM0SxaOOwOYMPNA1A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55702/commercial-account-executive-at-tvty/",
    "title": "COMMERCIAL ACCOUNT EXECUTIVE",
    "content": "Browsing online means being bombarded by dozens of ads. While brands try to target relevant audiences and craft compelling copy, most ads are not even shown at the right moment.<br />TVTY helps brands identify key triggers for their advertising investment and automate their campaigns to make sure users are reached at the right moment. More efficiency for the brand, more relevancy for users.<br />TVTY is one product – the Moment Marketing Platform – and a range of services – strategic consulting, analytics and media buying – to synchronize digital campaigns with offline events (TV, weather, sports, etc.) in real-time, across all online marketing channels.<br />Our significant growth in Europe is built around strong partnerships with leading media agencies, direct brands and ad tech players.<br /><br />ROLE OVERVIEW:<br /><br />Key responsibilities are to ensure success of current running business, delivering first class client service in order to exceed client expectations and also support the sales team on new business opportunities.<br />TVTY are looking for an exceptional candidate who is highly focused, tenacious, and practical with commercial flair and excellent social and networking skills. The successful candidate will have a can-do; attitude and ability to use their initiative.<br /><br />WHAT YOU WILL DO:<br /><br />- Manage a patch of clients consisting of agencies and direct clients. Be the main point of contact, dealing with any client requirements in a timely manner, and driving the day to day relationship.<br />- Understand the TVTY product offering and be able to communicate this to clients in a clear and concise manner.<br />- Monitoring performance and delivery against client objectives in coordination with the Ad Operation team.<br />- Generates and presents post campaign analysis and use it to develop and grow clients’ business.<br />- Lead quarterly client business reviews that result in continuous on-going activity.<br />- Build bespoke presentations tailored exactly to the client needs.<br />- Support sales in developing strategy and future roadmaps that will develop the client partnership whilst maximising the opportunity to increase share of wallet.<br />- Manage on-boarding process of new advertisers within your book of business from internal and external perspective.<br />- Demonstrate the ability to ask for additional revenue across your patch of clients based on sound rationale.<br />- Independently build client relationships across your book of business.<br /><br />WHAT WE ARE LOOKING FOR:<br /><br />- Client management experience, including proven ability to handle multiple deliverables within tight deadlines.<br />- Track record of success in providing exceptional client servicing.<br />- Demonstrable ability to take responsibility and accountability, and act on client goals and objectives in a client service environment.<br />- Excellent communication skills and the ability to articulate performance analytics at differing levels of understanding.<br />- Thrive in a team environment and be able to work with people across multiple disciplines whilst being able to work alone and deliver results.<br />- Good understanding of digital advertising landscape, with ideally an advanced knowledge of one of the advertising channels: Search, social, programmatic display and video.<br />- Troubleshooting and problem solving skills, with ability to overcome challenges and deliver solutions.<br />- Self-starter capable of thriving in a fast paced environment – able to multi-task.<br />- Taking a proactive approach in all areas of the role.<br />- Strong attention to detail and organisation skills.<br />- Excel and PowerPoint skills.<br />- Experience with Salesforce is a plus<br /><br />EDUCATION/EXPERIENCE:<br /><br />- Bachelors Degree or equivalent is desirable<br />- 1 – 3 years’ experience in Client Services / Account Management in digital or online advertising preferred",
    "urlFetchPending": false,
    "published": "Mar 24, 2017 6:01:12 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "p27oCQdpQLiN4CmDb3r77w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55673/hotel-contracts-executive-norwegianswedishfinnish-speaking-at-festicket/",
    "title": "Hotel Contracts Executive - Norwegian/Swedish/Finnish Speaking",
    "content": "DESCRIPTION<br /><br />ABOUT US<br /><br />Festicket is transforming the way music fans discover and book tickets and travel packages for festivals around the world. Our platform revolutionises the music festival industry by offering an end-to-end experience for music travellers through an efficient two-sided marketplace for 500+ music festivals across 40 different countries! In three short years, we have become Europe's largest music festival platform.<br /><br />Furthermore, we've just announced Series B funding - https://techcrunch.com/2016/06/30/festicket-let-it... - and now we're looking to grow the Festicket Family!<br /><br />KEY TASKS<br />* Managing the Nordic markets (Denmark, Norway, Sweden, Finland, and Iceland)<br />* Develop and manage an international client base spread over many territories with an expectation of growing this further<br />* Identify trends and developments by researching industry and related events, publications and announcements<br />* Regular and highly analytical reporting to direct line manager<br />* Ensuring all events attached to you are fully stocked in terms of accommodation<br />* Negotiating highly competitive offers for sale<br /><br />REQUIREMENTS<br />* Fluency in Norwegian, Swedish or Finnish is mandatory.<br />* Position requires experience in developing and managing a global client based related to travel<br />* Negotiation Skills and supplier management expertise<br />* Organisational skills<br />* Ability to prioritise and meet deadlines under pressure<br />* Excellent oral and written communication skills along with ability to deliver effective presentations to senior level leadership<br />* Professional, committed and determined<br />* Strong attention to detail and ability to multi-task<br />* Great interpersonal skills<br /><br />BENEFITS<br />We’re a team of 70 located in an amazing converted piano factory in Camden (NW1 8LH) a short stroll from Camden market and Primrose Hill. By joining us you will be part of one of the fastest growing music / travel start-up companies in Europe, where you will have ample opportunity for career progression as we continue to grow.<br /><br />We have a company culture which is very idea orientated and driven but also very social. It's entirely normal at 6pm on a Friday for half the company to be drinking together in the office and then planning to head out for a night out.",
    "urlFetchPending": false,
    "published": "Mar 24, 2017 11:34:31 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "cM9O2GW2R5Kd0Ce2BJfLgQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55598/hotel-account-manager-at-festicket/",
    "title": "Hotel Account Manager",
    "content": "ABOUT US<br />Festicket is transforming the way music fans discover and book tickets and travel packages for festivals around the world. Our platform revolutionises the music festival industry by offering an end-to-end experience for music travellers through an efficient two-sided marketplace for 500+ music festivals across 40 different countries! In three short years, we have become Europe's largest music festival platform.<br /><br />Furthermore, we've just announced Series B funding - https://techcrunch.com/2016/06/30/festicket-let-it... - and now we're looking to grow the Festicket Family!<br /><br />YOUR ROLE<br />The Accommodation Department is responsible for the company’s global travel needs, made up of commercial and partnership deals with (but not limited to):<br /><br />Accommodation Suppliers - e.g. hotels, apartments, and local agencies<br />Given the company's very high weekly and monthly targets, the role is exposed to high pressures on providing results within tight deadlines.<br /><br />KEY TASKS<br />* Managing accounts global accounts<br />* Regular and highly analytical reporting to direct line manager.<br />* Ensuring all events attached to you are fully stocked in terms of accommodation<br />* Daily negotiations directly with the suppliers<br />* Managing hotel reservations<br />* Managing post sale queries<br />* Ad hoc tasks<br />* Speaking regularly on the phone with suppliers<br /><br />REQUIREMENTS<br />* Position requires a strong attention to detail, ability to multi-task and time management<br />* Negotiation Skills and industry knowledge is beneficial<br />* Organisational skills<br />* Ability to prioritise and meet deadlines under pressure<br />* Excellent oral and written communication skills<br />* Professional, committed and determined<br />* Great interpersonal skills<br />* Excellent and active phone manner<br /><br />BENEFITS<br />We’re a team of 70 located in an amazing converted piano factory in Camden (NW1 8LH) a short stroll from Camden market and Primrose Hill. By joining us you will be part of one of the fastest growing music / travel start-up companies in Europe, where you will have ample opportunity for career progression as we continue to grow.<br /><br />We have a company culture which is very idea orientated and driven but also very social. It's entirely normal at 6pm on a Friday for half the company to be drinking together in the office and then planning to head out for a night out.",
    "urlFetchPending": false,
    "published": "Mar 22, 2017 11:19:32 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "2rENhgElQPGXDeSHE5DNUA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55492/travel-sales-executive-at-petspyjamas/",
    "title": "Travel Sales Executive",
    "content": "Job Title: Travel Sales Executive<br />Duration: Full Time and Permanent<br />Department: Travel<br />Location: Warehouse offices in Shoreditch, London EC2<br />Salary: £19,000 per year + Commission<br /><br />At PetsPyjamas we recognise and celebrate the positivity and happiness that pets bring to us all. Launched by the founders of toptable.com and passionate pet owners, PetsPyjamas is leading the exploding trend around pets as true family members and its growth has been rapid since launch in 2012. Today we are the number 1 pet-lifestyle website with an accessories marketplace listing over 10,000 items and an award-winning dog-friendly travel booking division featuring over 2,000 bookable, dog-friendly hotels, cottages and B&Bs.<br /><br />Since launch, the pet-friendly travel division has grown enormously - so much so, that we were awarded 'Customer Service Initiative of the Year' at the Retail Week Enterprise Awards 2014 for our unique Pet Concierge Service and we were finalist in the Retailer of the Year category at the BT Retail Week Tech & EComm Awards 2015.<br /><br />We are now looking for a talented, flexible and hungry Travel Sales Executive who is eager to join our fast growing travel department and progress within the company.To succeed in this role, you need to be a sales driven person and a great communicator, who loves talking and listening to customers and providing solutions to their needs.<br /><br />Role & Responsibilities:<br /><br />• Managing a high volume of sales enquiries and ensuring they turn into bookings – closing the sale!<br />• Responding to inbound calls and emails requesting pet-friendly accommodation all around UK<br />• Making call-outs to existing and new customers<br />• Providing quotes to customers’ requested hotel/cottage/B&B as well as coming up with other options<br />• Liaising & co-ordinating bookings between hotels and customers<br />• Creating long lasting relationships with both customers and hotels<br />• Managing customer payment details<br />• Maintaining our consumer/hotel database system<br />• Sharing knowledge, findings, patterns and hotel info with the wider sales team<br /><br />Skills, Experience & Your Personal Characteristics:<br /><br />• Outstanding sales skills<br />• Definitely a pet lover and maybe even a pet owner<br />• Excited working towards targets and selling<br />• Enjoying upselling and providing solutions to customers<br />• Persistence and creative to make browsers into bookers<br />• Generally confident, highly approachable and a team player•<br />• Excellent communicator both written and verbal with tons of flair and persistence<br />• Experience in sales and customer service a must (Emphasis on the word sales!)<br />• Well-organised and self-motivated<br />• Goal and results orientated<br />• Hungry to learn and be part of an exciting and fast-paced start-up environment•<br />• Flexible to work during weekends<br />• A smile is your default with a very positive, ‘can-do’ attitude<br /><br />The people we love and who love us:<br /><br />• Have a hands-on approach and are fast learners who love thinking on their feet<br />• Are flexible in approach and always go the extra mile<br />• Thrive on independence but adore collaboration<br />• Have tons of energy, enthusiasm and a ‘can do’ attitude – we break down walls!<br />• Have real eye for detail<br />• Have an entrepreneurial spirit with the ability to think outside the box<br />• Have a smile and ‘yes’ as default<br />• Love our brand and what pets bring to the world!<br /><br />What we have to offer:<br /><br />• A truly exciting and fast moving environment where you have an opportunity to really make your mark - build on your previous experience as well as doing brand new things<br />• Opportunities to develop and grow and be coached/mentored by some of the best in the business<br />• Cool work space, great Shoreditch location<br />• Ambitious team with great spirit punching way above our weight<br />• Lots of team social including prosecco Fridays<br />• A chance to bring your pet to work or indulge your love of pets!<br /><br />If you think you’ve got what it takes send a short email saying why you think you’d be great for this role together with your CV.<br /><br />Please note: Thank you for your application which we will review with great interest. Due to the high volume of applications, we might not be able to respond personally to all of you. If you are successful, we will be in touch with you shortly.<br /><br />If you are a recruitment agency, please do not contact us.",
    "urlFetchPending": false,
    "published": "Mar 20, 2017 11:33:53 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "epbXniSSQN6d0hbDzbTOUw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55472/business-development-manager-at-cudoni/",
    "title": "Business Development Manager",
    "content": "Who are we?<br /><br />Cudoni is the most convenient way for busy people to sell their unwanted luxury fashion goods.<br /><br />Our premium offering is tailored to suit those who are time-poor, and our clients expect only the best user experience around.<br /><br />You can expect to work directly with luxury brands, high net worth individuals and high-end retailers.<br /><br />Why join us?<br /><br />1) This is an excellent opportunity to work in a hands-on role with a funded start-up which is rapidly growing. You can expect quick career progression as we scale if you’re able to deliver results.<br />2) We have an award-winning founder and team, and our investors have built some of the biggest brands on the planet.<br />3) We have featured in numerous publications and on television – you can expect great exposure whilst you’re with us.<br />4) We have been through three incubator and accelerator programs; the last of which is recognised as being one of Europe’s top three.<br />5) Most importantly, we’re an exciting place to work. We like to mix-in drinks and laughs with hard-work and results. There is never a dull moment in our office!<br /><br />What’s the role?<br /><br />As our Business Development Manager, you'll be the driving force of our customer acquisition and retention efforts. You can also expect to be leading our customer experience team in ensuring that our clients have nothing short of the most seamless and rewarding selling experience on the market.<br /><br />This is a brilliant opportunity to immerse yourself in the world of luxury, and to lead a growing brand with international ambitions on the front-line. You will be solving a genuine problem for people who lack time, in a way that no business has been able to before.<br /><br />What responsibilities can you expect?<br /><br />•    Identifying and implementing new business and consumer acquisition and partnership strategies.<br />•    Meeting and greeting clients over the phone, at their homes, workplaces or event venues.<br />•    Creating and managing our seller events and street-level marketing campaigns.<br />•    Managing our customer experience team to ensure that they're providing the best experience to our sellers out all times.<br /><br />What skills and qualities do we require?<br /><br />•    Relevant work experience in a customer-centric role, having ideally had some experience in the luxury and/or fashion spaces.<br />•    Autonomous in approach and results-driven.<br />•    Strong communication skills and able to effectively convey our brand image. A high standard of written and spoken English is essential.<br />•    Experience in pitching ideas both internally and externally, project planning and execution.<br />•    Experience using CRM tools.<br />•    Able to use Microsoft Word, Excel and PowerPoint to a good standard.<br /><br />A UK driving license and access to a motor vehicle would also be useful, although not essential.<br /><br />What can you expect at Cudoni?<br /><br />•    A competitive salary.<br />•    Shares in the business.<br />•    A very sociable and interactive office environment.<br />•    Regular team activities and away-days.<br />•    Highly qualified and ambitious teammates.<br /><br />How can I apply to Cudoni?<br /><br />Please send us your CV along with a covering email explaining why you’d like to come and work with us!<br /><br />www.Cudoni.com",
    "urlFetchPending": false,
    "published": "Mar 19, 2017 6:28:19 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "-XMMSGIsTc6xiwWGvNDurg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55465/luxury-account-manager-at-cudoni/",
    "title": "Luxury Account Manager",
    "content": "Who are we?<br /><br />Cudoni is the most convenient way for busy people to sell their unwanted luxury fashion goods.<br /><br />Our premium offering is tailored to suit those who are time-poor, and our clients expect only the best user experience around.<br /><br />You can expect to work directly with luxury brands, high net worth individuals and high-end retailers.<br /><br />Why join us?<br /><br />1) This is an excellent opportunity to work in a hands-on role with a funded start-up which is rapidly growing. You can expect quick career progression as we scale if you’re able to deliver results.<br />2) We have an award-winning founder and team, and our investors have built some of the biggest brands on the planet.<br />3) We have featured in numerous publications and on television – you can expect great exposure whilst you’re with us.<br />4) We have been through three incubator and accelerator programs; the last of which is recognised as being one of Europe’s top three.<br />5) Most importantly, we’re an exciting place to work. We like to mix-in drinks and laughs with hard-work and results. There is never a dull moment in our office!<br /><br />What’s the role?<br /><br />Your primary focus will be to ensure that are sellers have an easy yet fulfilling user experience, from on-boarding through to retention and referral.<br /><br />We are looking for a sales-focused, competitive and hard-working Luxury Account Manager, starting as soon as you are available. As a Luxury Account Manager you will be central to building and maintaining relationships with our biggest sellers. This is a full-time position focused on our UK sellers, and there will be endless opportunities for personal and professional growth.<br /><br />This is a unique opportunity to make your mark on a growing brand with international ambitions.<br /><br />What skills and qualities do we require?<br /><br />•    Relevant work experience in a customer-centric role, having ideally had some experience in the luxury and/or fashion spaces.<br />•    Ability to highlight problems and suggest actionable solutions.<br />•    Autonomous, competitive and targets-driven.<br />•    Strong communication skills and able to effectively convey our brand image. A high standard of written and spoken English is essential.<br />•    Experience in project planning and execution.<br />•    Able to use Microsoft Word, Excel and PowerPoint to a high standard.<br /><br />What skills are not essential, but desirable?<br /><br />•    Experience using CRM tools.<br />•    A UK driving license and access to a motor vehicle could be useful.<br /><br />What can you expect at Cudoni?<br /><br />•    A competitive salary.<br />•    Shares in the business.<br />•    A very sociable and interactive office environment.<br />•    Regular team activities and off-sites.<br />•    Highly qualified and ambitious teammates.<br /><br />How can I apply to Cudoni?<br /><br />Please send us your CV along with a covering email explaining why you’d like to come and work with us!<br /><br />www.Cudoni.com",
    "urlFetchPending": false,
    "published": "Mar 19, 2017 1:40:37 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "50GKD5Y_QeevAq-MT2W1Bg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55395/senior-business-development-manager-at-hillgate/",
    "title": "Senior Business Development Manager",
    "content": "About the role<br />We're looking for a talented, curious, and experienced Senior Business Development Manager to join our team. <br /><br />We are looking for someone with at least 3-5 years of sales experience who is looking to take their career (and our business) to the next level. We need someone who can fill the role of senior sales person and close deals (otherwise known as a player/coach). From your experience you should be fully understand sales strategy, tactics, and manage the sales cycle with aplomb. <br /><br />You will use this knowledge to manage your own territory and goal and act as a coach to the rest of the sales team. Additionally, you will act as the liaison with senior management and other teams. You should be able to process lots of disparate information with ease. This will include things like incorporating the feedback/trends your hearing from into our sales strategy, assessing our current sales operations, answering questions in the moment regarding sales tactics, providing feedback to the product team to name a few.<br /><br />Your contributions will be critical to our success as a company as you will drive revenue growth and increasing sophistication of our sales operations. Success in this role will naturally lead to more responsibility as the company grows. <br /><br />This role will be based in London, UK.<br /><br />Responsibilities<br />•    Driving sales with strategic accounts<br />•    Growing our base of strategic accounts<br />•    Delivering superior performance against the key metrics (projects and revenue)<br />•    Explore multiple channels to increase sales and partnerships<br />•    Provide market feedback to the product team<br />•    Provide help with more strategic/ad hoc projects<br /><br />Key requirements <br />•    Strong experience in commercial/consultative sales <br />•    Superior analytical skills<br />•    Outstanding communication skills<br />•    High levels of passion and enthusiasm<br />•    Comfortable working in a typical start up environment: fast-paced, intense and with lots of feedback <br />•    Potential to develop into a key part of the leadership team<br />•    MBA from a top institution a plus<br /><br />About the company<br />We are a London-based startup changing the top-tier talent market. We are a marketplace that connects multinational companies with top-tier contractors that they can hire on a temporary basis. We currently work with 10% of the Global 500 and we are growing 5x YOY and looking to continue this growth. We are group of fun-loving, motivated professional from all over the world. If you like working hard and having fun doing it, then we are the right fit.",
    "urlFetchPending": false,
    "published": "Mar 16, 2017 6:45:12 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "xD8SCjBARsCz5eUb6-oniA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55383/business-development-executive-at-movable-ink/",
    "title": "Business Development Executive",
    "content": "<br />*Business Development Executive*  (London, UK)<br /><br />The Business Development Executive (BDE)’s goals will be to fill the Sales team’s pipeline with qualified leads. The BDE role is designed to provide individuals with hands-on experience in a fast-paced startup environment where things are constantly changing and evolving. <br /><br />*Responsibilities of the Business Development Executive:*<br />Develop new relationships through phone, email, and social media communications in order to establish meetings with senior level decisions makers in companies that could benefit from what we have to offer<br />Assess the prospect's needs, explain Movable Ink solutions, qualify the prospect, and schedule meetings for your Sales Managers to begin their sales process<br />Assist in the consultative sales process by learning as much as you can about a prospect and sharing that information with the relevant Sales Manager<br />Work in tandem with your Sales Managers and Marketing to research potential targets and identify key players and penetrate those targets by using creative strategies and tactics<br />Utilize our sales database and marketing automation tools to manage your pipeline and maintain accurate information about suspects, prospects, and their companies<br /><br />*Essential Skillsets/Knowledge/Experience:*<br />Bachelor's degree from a recognized university or equivalent experience<br />Very good business writing and communication skills<br />Good eye for detail and comfortable in a fast-paced, ever-changing startup environment<br />Ambitious, self-motivated and driven, personable, able to work alone and as part of a team<br />Receptive to ideas and feedback<br /><br />*Desired Skillsets/Knowledge/Experience:*<br />1 + years of experience in a market/sales development role<br />Domain experience<br />Previous experience prospecting for an Enterprise SaaS or Financial Services firm<br />Familiarity with Salesforce.com and marketing automation platforms like Marketo and Eloqua<br />Proven track record achieving measurable monthly lead development goals with a senior level audience<br />A solid understanding of what it takes to effectively manage and execute inbound and outbound prospecting strategies<br />Self-motivation and the ability to work successfully in a fast-paced, highly automated sales environment",
    "urlFetchPending": false,
    "published": "Mar 16, 2017 3:18:42 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "2m98pV1cQIWipWubuNZ5-Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55215/business-development-manager-at-blue-array-ltd/",
    "title": "Business Development Manager",
    "content": "*Job Type: Business Development Manager*<br /><br />*Location: Reading, Berkshire*<br /><br />Salary: Up to £35,000 basic OTE of 120,000+<br />Hours: Full-Time<br /><br />Due to recent aggressive expansion, a great opportunity has arisen to join a fast growing marketing agency; closing leads, driving new growth, retaining clients, training account managers, adding value throughout the sales process and mentoring apprentices.<br /><br />*What's Required of you:*<br /><br />Close or remove business in our sales funnel by quickly understanding if the customer is a fit<br />Appointment set new leads with the founder<br />Develop professional working relationships with introducers (referrers)<br />Develop new relationships with introducers and continually understand their changing needs<br />Increase revenue through identifying new opportunities, with new introducers<br />Attend exhibitions and have a strategy for leveraging these opportunities<br />Manage relationships end to end through our CRM (Zoho)<br /><br />*What you should bring:*<br /><br />Ability to communicate confidently with C-Levels and business founders<br />Experience training and motivating a team<br />Key accounts relationship knowledge<br />Proven success at arranging customer meetings (sometimes face-to-face, though usually just introducing the founder)<br />Confident and professional phone manner<br />The ability to work pro-actively and to be highly self-motivated<br />Results driven with a positive attitude<br />Successful selling experience, ideally in a B2B environment<br />Excellent organisational and communication skills<br />Resilient in the face of commercial challenges with ability to motivate others through this<br />3 years experience in business development<br />High level of written and spoken English<br /><br />*Rewards*<br /><br />* A highly competitive basic, outstanding bonus and big bonus opportunity<br />* A Macbook pro to work on<br />* Sleek modern offices in Reading, Berkshire<br />* A small but fast growing team with select clients. <br />* Simple, agile workflow processes (we spend much or our time in Google Drive & #Slack)<br />* A multitude of fun staff benefits<br />* Enterprise Management Incentives (EMIs) after a qualifying period<br /><br />*Required experience:*<br /><br />Business Development: 3 years+",
    "urlFetchPending": false,
    "published": "Mar 12, 2017 12:19:08 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "61A4s5EqT7O74EHfmy-MGA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55187/head-of-sales-operations-at-jetzt/",
    "title": "Head of Sales Operations",
    "content": "We are already a global business and as such our sales focus is now global. <br /><br />We are looking for a true sales leader who can recruit and manage a large team of telesales individuals on a global basis. <br /><br />The sales force is split in to 4 distinct sections: <br /><br />A- Corporate level sales (Blue Chip) <br />B- SME level sales <br />C- Upsale of SEO and Marketing <br />D- (Field sales) Acquisition of Marketing platform affiliates. <br /><br />These 4 sales teams will be covering UK&I, United States, Canada, Japan, Australia, Middle East, Europe. <br /><br />We are looking for somebody who can help us determine our strategy for international sales (&quot;in country&quot; or &quot;centrally based in UK). <br /><br />Track record of delivering exceptional sales in a fast paced and challenging environment. <br /><br />Must have sales leadership experience in B2B with strong knowledge of Corporate and SME markets. <br /><br /> ",
    "urlFetchPending": false,
    "published": "Mar 10, 2017 4:15:38 PM",
    "tags": [
      "TITLE1_manager",
      "TZ_Europe",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "Europe timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "DJsNPNhIQYqcqQsLrSjXLw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55149/junior-account-manager-at-parkbee/",
    "title": "Junior Account Manager",
    "content": "ParkBee is changing the world of parking, and we need you to help make this change! We have successfully launched at our home in Amsterdam and we’re now growing our network of private parking garages in London.<br /><br />ParkBee<br /><br />Almost every major city is dealing with parking problems; Parking is extremely expensive and it’s very difficult to find a parking spot. However, there are sufficient vacant parking locations, only not accessible for the general use. Think of all the private parking garages of office buildings, right in the city centre that could join the sharing economy. ParkBee is a successful Amsterdam based startup that has developed a smart technology to open up these parking locations to the public. We are now expanding and our first stop is London. Check us out at www.parkbee.com.<br /><br />Job Description <br /><br />As junior account manager you are focused on creating a world in which parking is no longer a pain.  This means finding the underutilized private parking spaces and making them available to the public. That’s the core of the ParkBee initiative and the key responsibility of this role.<br /><br />ParkBee is growing rapidly, and this function is of crucial importance to further enhance this growth. This role requires attracting new real-estate owners (clients) with parking locations to the ParkBee network. We are looking for an ambitious and outgoing professional that will attract new clients to ParkBee and help manage the existing portfolio of clients. You will have an opportunity to be a part of our sales and acquisition team in London at our Shoreditch office alongside one of the company founders.<br /><br />Responsibilities: <br /><br />●    Enhance lead generation to realise new acquisitions and optimise the process <br />●    Research and scout new ParkBee locations and find creative ways to get in contact with the right owners<br />●    Develop innovative sales strategies in line with the marketing team to grow ParkBee in the real-estate market<br />●    Work closely with strategic partners on joint procurement initiatives<br />●    Maintain communication to clients about the activities performed and planned activities for their locations<br />●    Inspire the community while building and maintaining a portfolio of clients<br />●    Ensure updates and full-use of Salesforce<br /><br />Requirements:<br /><br />●    1+ years of experience in sales or account management (real-estate knowledge in the London market is a huge plus)<br />●    Capacity to independently plan, structure and execute effective sales methods; <br />●    Ability to organise work methods to ensure targets are consistently met. <br />●    Team player with a dynamic, outgoing personality; strong communication skills, both verbal and written, are essential; <br />●    Strong work ethic with enthusiasm to work for a startup; <br />●    Ability to represent your ideas and sell to management team; <br /><br />The Perks:<br /><br />ParkBee creates an environment with significant freedom and responsibility. Working for an innovative and growing startup can be challenging but extremely rewarding! You will have an important role in this crucial stage where ParkBee is expanding to new territories. At ParkBee we have the motivation to change the world’s parking industry in a climate-friendly way. We have the proven technology to do so, now it is up to great people to assure we will get this done.<br />●    Work in an entrepreneurial environment at our Shoreditch office in London!<br />●    Sharp, motivated and international team that continues to grow<br />●    A chance to be one of the early employees for our London office.<br />●    Afternoon drinks with mingling with other startups and crazy ParkBee team events<br /><br /><br />Join us!<br /><br />Start your journey with ParkBee by sending your CV and motivation to Scott Moran. Creativity is always encouraged!<br />",
    "urlFetchPending": false,
    "published": "Mar 9, 2017 4:06:14 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "fr115Uq_SRSQlddHLqE1fg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55141/recruitment-sales-executive-at-pitchcv/",
    "title": "Recruitment Sales Executive",
    "content": "<br />Pitchcv<br />Location: London, UK<br />Inudstry: Marketing / Advertising / Sales<br />Description<br /><br />We are looking for talented and motivated Graduates of any discipline who are looking to break into Recruitment B2B Sales East London UK – As a self-starter who is able to work on your own initiative, you will be comfortable with managing your own time and working to and exceeding targets. We are looking for candidates with a hunger for self-development and a desire to be the best.<br />The role<br /><br />Working in the sales team, you will be calling on business professionals across various industries , to increase sales of your company’s. You will be responsible and accountable for your customers as you become a key point of contact.<br />Working alongside other members, you will play a pivotal role in ensuring the success of that team through your strong selling and influencing skills with customers and by developing effective working relationships with your colleagues. Tenacity, excellent communication skills and a passion to succeed are essentials for this role.<br />Requirements<br /><br />Candidate requirements:<br />•    A real “can do attitude “, someone who always strives to succeed<br />•    Ideally a 2:1 degree – Any degree discipline will be considered although an interest in science/ medicine is important<br />•    Full, UK Driving License<br />•    Exceptional communication skills - written and verbal<br />•    Evidence of achievement outside of your academic career<br />HOW TO APPLY DETAILS:<br />Complete you Video 1 min video Pitch along with your CV outlining how you meet the candidate requirements below<br />•    A real “can do attitude “, someone who always strives to succeed<br />•    Ideally a 2:1 degree – any degree discipline will be considered<br />•    Exceptional communication skills - written and verbal",
    "urlFetchPending": false,
    "published": "Mar 9, 2017 1:10:52 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "gparY4I4QgylsttpwXrAkA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55043/sales-executive-dach-at-nosto-solutions-gmbh/",
    "title": "Sales Executive DACH",
    "content": "Does transforming the way a trillion dollar industry operates sound like an exciting challenge? Do you thrive on having a huge impact and a high level of responsibility and accountability? Great, you’ll fit right in.<br /><br />Nosto enables online retailers to deliver their customers personalized shopping experiences at every touch point, across every device. A powerful personalization solution designed for ease of use, Nosto empowers retailers to build, launch and optimize 1:1 multi-channel marketing campaigns without the need for dedicated IT resources. Over 20,000 ecommerce professionals in over 100 countries are using Nosto to grow their business and delight their customers. Nosto supports its retailers from its offices in Helsinki, Berlin, Stockholm, London and New York<br /><br />*Nosto is hiring a Sales Executive for DACH in Berlin, Germany*<br /><br />As Sales Executive you are in a key role in growing our business in the DACH region. Operating from our Commercial Headquarters in Berlin, you will work closely with our technical team, partners and customers to deliver immersive online shopping experiences. Nosto partners with a wide range of players in the ecommerce field, including digital agencies, ecommerce platform vendors, software integrators, consulting houses, email service providers and payment service providers. You need to understand the various stakeholders’ roles in the ecosystem and how best to build long­lasting, successful partnerships.<br /><br />*Responsibilities:*<br />* Generate/qualify/close sales opportunities for Nosto with online retailers via face­to­face- and online meetings<br />* Build a network of channel partnership across your region as well as internationally to deliver Nosto’s offering across all channels<br />* Participate in marketing activities together with Nosto’s in‐house marketing team<br />* Engage with top ecommerce platform vendors, software integrators, online agencies, consulting houses and payment service providers in order to establish a business­generation ecosystem<br /><br />*Requirements:*<br />* Minimum Bachelors degree in Business, Economics or other relevant field<br />* Experience and proven success in sales<br />* Ability to balance competing priorities and work under pressure<br />* Goal oriented and self-motivated with ability to work independently<br />* Entrepreneurial attitude with understanding of Ecommerce business<br />* Native German and fluent English<br />* German/ EU work permit.<br /><br />*What we offer:*<br />* Working with a state-of-the-art e-commerce product and delivering it to exciting and innovative online businesses and brands.<br />* Fast learning of all the aspects of e-commerce<br />* Great team consisting of former employees of top global online brands and online entrepreneurs<br />* A job that gives you independence and autonomy and the opportunity to make a real difference in a fast-growing company.<br />* A competitive salary and great benefits<br />* A great office in central Berlin",
    "urlFetchPending": false,
    "published": "Mar 7, 2017 9:13:39 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "jHyxa25uTbWY6GS2dIZijQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55032/account-manager-for-vc-backed-fintech-in-the-challenger-bank-sector-at-pbf-solutions/",
    "title": "Account manager for VC backed FinTech in the Challenger Bank sector",
    "content": "Based in central Manchester, PBF Solutions is a marketing technology provider and digital agency working with challenger banks and other financial providers to help them raise savings and investment deposits and acquire new customers. Our services include customer on-boarding platforms, online marketing and product distribution across affiliate networks. We also operate our own product comparison platforms such as Fundshare.co.uk, which powers the Peer to Peer comparison page for the Daily Mail.<br /><br />We are a VC-backed entrepreneurial, high-growth business and in just three years have helped our financial services clients raise over £2.6 billion of new savings and investments.<br /><br />We’re looking for an experienced account manager who can help us to deliver first class client services to our portfolio of banking partners. As we are a performance-based business, it is crucial that the individual is not only experienced in relationship management and marketing but also has a keen grasp of the analytics behind the key metrics that we use to monitor and measure success. In order to drive the business forward we are focused on new business development, diversification and organic growth and this role will play a key part in the latter.<br /><br />The role requires a blend of relationship management, planning skills, project management capability and the ability to get behind the numbers and report on ROI.",
    "urlFetchPending": false,
    "published": "Mar 6, 2017 5:30:19 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "7uHCGud1SY-OYDySiANLTw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/54994/business-development-manager-at-neatebox/",
    "title": "Business Development Manager",
    "content": "Neatebox is a company with its core values intricately linked to its products. In a world where equality through inclusivity is a standard we should all aspire to Neatebox is building a team of truly driven professionals who are looking to be at the forefront of an age where technology and equality can be inextricably linked.<br />It is with this in mind that we are looking to recruit a Business Development Manager with extraordinary skills who will become a foundational team member and help us grow our company and promote our ethos of an inclusive and equitable society.<br /><br />The Business Development Manager will be a key part of the team and feed into our expansion plans, building and maintaining relationships with potential key partners and pitching to potential new clients.<br />They will also be involved in delivering key projects, pitching to high-level partners and closing deals for individual sales and partnership agreements.<br />Building and maintaining new client relationships will be key to delivering this role. We already have potential agreements in place with some fantastic partnerships, but we are keen to increase the volume of new customers as we look towards releasing the first full versions of both products; Welcome by Neatebox which is a platform for enabling visitors to plan and request assistance from any venue they wish to visit and Button by Neatebox which is a mobile application which can press the button remotely. We are now looking for an experienced Business Development Manager to join the management team to help drive the company’s sales and revenue growth.<br />As our first dedicated Business Development Manager, you will be responsible for promoting the brand and helping us grow by finding new clients and winning business.<br /><br />Person Specification<br /><br />* You’ll be entrepreneurial in your approach and willing to work hard to achieve both the company's vision and your personal targets<br />* You will be hungry, passionate and genuinely love the work you do. You will have a focus on not only winning business but actually delivering results that your clients love.<br />* You are driven, energetic and want your next move to be joining a company where you’re truly empowered, with the ownership to shape outcomes and be rewarded for driving growth the way you have always wanted to<br />* Ability to efficiently manage your time to focus on activities that drive revenue<br />* Outstanding verbal, written, presentation and phone-based communications skills are required<br />* Strong interpersonal skills and ability to excel in a team oriented atmosphere<br />* Strong work ethic and desire to continuously improve sales effectiveness and business acumen, in order to <br />   contribute to the company’s growth aspirations.<br />* Willingness to travel if required<br /><br />The Business Development Manager will be primarily concerned with the acquisition of new customers. This will be achieved by the following activities:<br /><br />* Lead generation identified online and through networking<br />* Attending networking events on behalf of the company<br />* Identifying prospects in the normal course of business<br />* Arranging meetings with potential prospects<br />* Plan approaches and pitches<br />* Work with team to develop proposals that speak to the client’s needs, concerns, and objectives.<br />* Work with technical staff and other internal colleagues to meet customer needs.<br />* Arrange and participate in internal and external client debriefs.<br />* Identify opportunities for campaigns, services, and distribution channels that will lead to an increase in sales.<br /><br />There will be targets put in place for both revenue generated and the number of partnerships created.<br />We very much look forward to hearing from you.",
    "urlFetchPending": false,
    "published": "Mar 6, 2017 10:15:39 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "kQcKsN55S029KuFge_wUdQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/54992/partnerships-executive-short-term-contract-internship-externship-at-movebubble/",
    "title": "Partnerships Executive (short term contract / internship / externship)",
    "content": "The headline<br /><br />We are looking for an enthusiastic, highly organised people person who wants to make an impact at a technology start up. You’ll be supporting our growing pool of new Agent partners and on-boarding them to the Movebubble platform by visiting them in branch to provide training and get them excited about the Movebubble mission!<br /><br />Based in-house with our Partnerships Team, you'll report to the Head of Partnerships.<br /><br /><br />The role and you<br /><br />Movebubble is on a mission to make renting better for the world’s renters. Based in London, we are forming a team of people who reflect our user base and who want to solve the pains of renting. Working in a collaborative manner and rigorously focussed on our customers, we are poised for major growth in 2017.<br /><br />You are an outgoing person who loves engaging with people and can establish rapport over the phone and in person. With a keen eye for detail and strong organisation skills, you love being busy and can spin plates when required. You will be getting stuck in at a startup so you’re also adaptable, inventive, high-energy, and really love to get things done. <br /><br /><br />Responsibilities<br /><br />•    Visiting our partners to demo the technology, on-board them to the platform, and spread our mission<br />•    Enthusiastically contacting new and existing partners to keep them engaged and provide support where needed<br />•    Collaborating with the Sales Team to complete any sales / on-boarding admin<br />•    Building an understanding of how agents use our technology, supported by data<br /><br /><br />Experience<br /><br />•    Communicating with and supporting customers (sales/account management a bonus)<br />•    Administration (on-boarding a bonus)<br />•    You've worked in rapidly changing environments (start-ups a bonus), <br />•    You've rented a place to live (in London a bonus)<br /><br /><br />Pay competitive, depending on experience. Contract length negotiable, minimum 12 weeks starting April 2017<br /><br /><br />How to apply:<br />Please send over a short cover letter and a CV <br /><br />We can’t wait to hear from you!<br />",
    "urlFetchPending": false,
    "published": "Mar 6, 2017 9:36:02 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "9UpXbzxYSqOrlRFUivOQYw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/54983/sales-executive-at-luxury-car-club/",
    "title": "Sales Executive",
    "content": "We are a luxury car rental platform, aggregating prices from suppliers around Europe. Think lastminute.com but for supercars/luxury cars!<br /><br />We are looking for someone to come in and ramp up the sales pipeline across all territories. Ideally this person will be a self starter. Someone who thrives working autonomously, and is passionate about high end cars.<br /><br />Roles/Responsibilities;<br /><br />* develop pipeline of customers from scratch<br />* manage supplier relationships<br />* manage customer experience<br />* help further develop product/website<br /><br />What you will receive in return:<br /><br />* very generous commission scheme <br />* a chance to join an exciting early stage company<br />* opportunity to work with some of the worlds finest supercars<br />* opportunity to work/travel to various European locations<br /><br />What you will be able to show;<br /><br />* proven background in sales *within the luxury car rental space* <br />* ability to self start/work autonomously<br />* knowledge, or passion for cars<br />* tenacity and professionalism <br /><br />Please attach a CV with your application.",
    "urlFetchPending": false,
    "published": "Mar 5, 2017 4:29:13 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "7uKGRV7HTiGFd-MkRQzjOg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=14025091",
    "title": "REMOTE ONLY GitLab - We're hiring a recruiter, a security specialist, sales development reps, and director level positions, ...",
    "content": "<div>                  <span>REMOTE ONLY GitLab - We're hiring a recruiter, a security specialist, sales development reps, and director level positions, see <a href=&quot;https://about.gitlab.com/jobs/&quot; rel=&quot;nofollow&quot;>https://about.gitlab.com/jobs/</a> We're a remote only company so everyone can participate and contribute equally. GitLab Community Edition is an open-source Ruby on Rails project with over 1000 contributors.<span>              </span><div>        <p>                        </p></div></span></div>",
    "content2": "",
    "urlFetchPending": false,
    "published": "Apr 3, 2017 8:40:04 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "wg5SeGqETRqnAKw7hdAAfg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=14027194",
    "title": "Sprout Social | Chicago, IL| Full-time | Engineering Manager, iOS| http://sproutsocial.applytojob.com/apply/jkJxjm/Engineering-... You will help deliver a quality application ...",
    "content": "<div>                  <span>Sprout Social | Chicago, IL| Full-time | Engineering Manager, iOS| <a href=&quot;http://sproutsocial.applytojob.com/apply/jkJxjm/Engineering-Manager-Mobile&quot; rel=&quot;nofollow&quot;>http://sproutsocial.applytojob.com/apply/jkJxjm/Engineering-...</a><p>You will help deliver a quality application to thousands of users, working on a small iOS team allowing you to take ownership of the code base and provide weigh in on user experience and design discussions. You will also manage fellow iOS Engineers with specific responsibility to support the growth of their careers. This is very much a working manager opportunity.</p><p>At Sprout we encourage cross-functional collaboration. The Mobile 'squad' consists of a dedicated Mobile Product Designer, dedicated QA Analysts, other Mobile Engineers and a Mobile Product Manager.</p><p>Sprout Social is used by more than 17,000 brands around the world. Companies like Marvel, Adobe and Pivotal Labs rely on Sprout to create stronger relationships with their customers through social media</p><p>We are looking for someone that has contributed to several apps in the Apple Store, preferably at a SaaS company. Please apply via the above link and mention Hacker News!<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "content2": "",
    "urlFetchPending": false,
    "published": "Apr 4, 2017 12:15:05 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "efO6pxL1R665oI7ILl-XVw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=14026586",
    "title": "Viamo (formerly VOTO Mobile) | Full-time | Saskatoon, Canada; Washington D.C. area; or Remote | https://votomobile.org/careers/ - Director of Product ...",
    "content": "<div>                  <span>Viamo (formerly VOTO Mobile) | Full-time | Saskatoon, Canada; Washington D.C. area; or Remote | <a href=&quot;https://votomobile.org/careers/&quot; rel=&quot;nofollow&quot;>https://votomobile.org/careers/</a><p>- Director of Product Design - VOTO Platform</p><p>- Senior Engineer - Full-stack Web Application Developer</p><p>- User Experience Engineer - Front-end Web Application Developer</p><p>- Senior Engineer - Custom Technology Applications</p><p>- Senior Engineer - Android/Mobile Application Developer<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "content2": "",
    "urlFetchPending": false,
    "published": "Apr 3, 2017 11:05:05 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "YEqGVOpnQuayzvNxcyV8bg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/129397/technical-account-manager-foursquare?a=Hoxe3YAYR2g",
    "title": "Technical Account Manager at Foursquare (Shanghai, China) (allows remote)",
    "content": "<div>        <div>                <div>            <div>                                    <div>                    <div>                        <div>                            <h2><a rel=&quot;nofollow&quot;>Technical Account Manager</a>                            </h2>                                <span>                                            $40k - 100k                                                 | Equity                                                </span>                        </div><a href=&quot;https://foursquare.com/&quot; rel=&quot;nofollow&quot;>Foursquare</a>                    </div>                </div>                <div>                    <div>                                                        </div>                </div>                <div></div>            </div>        </div>                        </div>        <div>            <h3>                Job Description            </h3>            <div><p>About Foursquare:</p><p>Since our inception in 2009, Foursquare has been a leading force in changing how location information enriches our real-world and digital lives. As a location intelligence company, Foursquare is comprised of two well-known consumer apps, Foursquare and Swarm, as well as thriving media and enterprise products. &nbsp;Our B2B offerings include Places (for developers), Pinpoint and Attribution (for marketers), and Place Insights (for analysts, based on the world's largest foot traffic panel). With more than 200 people across our offices in New York, San Francisco, and in sales offices around the globe, we’re dedicated to our trailblazing mission—enriching consumer experiences and informing business decisions with location intelligence. &nbsp;</p><p>About the Position:</p><p>Foursquare is seeking a Technical Account Manager (TAM) to work alongside our Business Development team. The TAM will work closely with developers and partners in China and Asia-Pacific in effectively using Foursquare data via APIs and SDKs to identify location opportunity, and will best take advantage of our industry-leading location cloud platform and all its components. The Asia Business Development team is an agile team that has secured several large-data licensing contracts with renowned brands in the tech, consumer products, and marketing industries.You will leverage your expertise in data, location services and the mobile industry to understand Foursquare’s data &amp; solutions, and help our clients in Asia scale globally with unique solutions that fit their needs. In order to be successful, you will manage multiple clients simultaneously while working closely with key internal stakeholders in Asia and US. Your work will play a crucial part in generating company revenue &amp; ensuring partner success.</p><p><strong>RESPONSIBILITIES</strong></p><ul><ul><li>Be both highly technical and effectively act as a true partner of our clients.</li><li>Work together with Business Development team to define and execute on strategy to drive partner success.</li><li>Work with regional and local teams to translate solution ideas into feasible technical solutions</li><li>Enable Foursquare’s partners to be successful by serving as the primary technical point of contact with data partners in the pre-sales, implementation and post-sales phases</li><li>Be a subject matter technical expert, and have influence and support of partners and internal teams at Foursquare.</li><li>Build relationships with strategic partners in order to ensure their ongoing success working with Foursquare.</li><li>Manage relationship with technical contacts (including high-profile tech companies) and contact them pro-actively when there are new ideas or features or opportunities that could be relevant to them</li><li>Work cross-functionally with Foursquare business development &amp; technical teams in Asia and America</li><li>Be the technical voice in the room when coming up with creative solutions to meet our partners’ needs.</li><li>Interact with and support our broader community of thousands of developers using the Foursquare API.</li><li>Ultimately help Foursquare successfully acquire more long-term data &amp; technology customers</li></ul></ul>            </div>        </div>            <h3>                Skills &amp; Requirements            </h3>            <div><p><strong>REQUIREMENTS</strong></p><ul><ul><li>Software development experience in languages and environments such as Scala, Java, Python.</li><li>Solid communication and skills, and capability to present to large technical audiences.</li><li>Willingness and ability to travel approximately 10-25% of the time.</li><li>3-5 years successful track record working in, or with mobile application developers including experience with Android/iOS and the mobile technology stack.</li><li>Deep understanding of APIs and application development and architecture. You understand the tradeoffs that our customers’ engineers make every day and can help them make the best decisions.</li><li>You are a code-native with a “get stuff done” attitude and not afraid to whip up a script, or even learn a new programming language—all in the name of helping our partners succeed.</li><li>Love location-based data, tech, apps, analytics &amp; intelligence</li><li>Strong English writing, speaking and presentation skills. &nbsp;</li><li>Chinese language required</li><li>Creativity to brainstorm and discuss new uses and use-cases for data in any industry vertical</li></ul></ul><p>In order to be considered for this role, you must complete the “Additional Questions” section of the application.</p>            </div>                        </div>",
    "urlFetchPending": false,
    "published": "May 1, 2017 4:24:18 PM",
    "tags": [
      "TECH2_python",
      "TZ_America",
      "REMOTE1_50",
      "TECH2_api",
      "TITLE1_manager",
      "TECH2_scala",
      "TECH2_java",
      "TECH2_mobile",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "50% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": [
      "api",
      "java",
      "mobile",
      "python",
      "scala"
    ]
  },
  {
    "id": "_jVQjFO6QGmwZKBrPxSWgg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "indeed.com-1",
    "url": "http://www.indeed.com/job/Director-Development-at-Telarix-in-Vienna,-VA-7717919830c5bd77",
    "title": "Director Of Development - Telarix - Vienna, VA",
    "content": "<div><b>Director Of Development</b><br><span>Telarix</span>     -<span>Vienna, VA</span>    </div><span>Telarix is a leading provider of interconnect and settlement software solutions to telecom communication service providers (“CSPs”) worldwide. The Company’s products drive ROI for customers by enabling and optimizing the connecting, routing and transfer of voice, video and data from one CSP’s network to another. Telarix supports a global community of over 4,000 carriers, including 38 of the top 40, and processes over 300 billion voice, SMS, content and data minutes each year. The Company's solutions serve as the standard in electronic information exchange for the telecom industry, offering carriers an unprecedented level of visibility and control of their interconnect traffic.<br><br>The Director of Development is responsible for leading a cross functionality and talented team of developers. As a Director of Development, you will get your hands dirty in code, design some cutting edge architecture and work closely with the product and project teams to negotiate scope and schedule. As a leader, you will be responsible for hiring top talent into your team, coaching the next generation of leaders. In return you will be working alongside a very talented team in a culture that balances fun, reward hard work and growth.<br><br>Key Responsibilities<br><br>Manage and motivate multiple cross-functional teams to deliver high-quality releases on schedule. Identify and remove or escalate risks to delivery<br><br>Provide technical training to teams and serve as a technical mentor to team members<br><br>Manage local, remote, and outsourced resources. Grow the engineering staff by hiring quality software engineers that match the culture and can quickly contribute to corporate goals<br><br>Interface closely with product managers to help groom and package Agile sprints into releases<br><br>Work with Project managers to ensure teams deliveries are on track<br><br>Skills and Requirements<br><br>7+ years’ of progressive responsibilities in managing one or more of the following areas: software/web development, application delivery, design or architecture for web or service oriented environments. Current coding skillset expected<br><br>Deep understanding of and recent experience with large-scale, high-performance systems<br><br>Solid understanding of relational database technology (e.g., MySQL, PostgreSQL, Microsoft SQL Server, Oracle). Some experience with non-relational databases (e.g., Hadoop, Map/Reduce) preferred.<br><br>Strong background with software development in C#, C++, Java, Python<br><br>Comfortable managing and mentoring teams of 8-10 people<br><br>Experience using version control systems such as SVN, TFS or Git<br><br>Experience with bug tracking software such as Jira<br><br>Like to occasionally get your hands dirty in the code but more often prefer to help other engineers deliver great products<br><br>Ability to motivate and inspire others through collaboration and influence<br><br>A great communicator who can help convey critical goals and priorities to a fast-moving team while also coaching individual engineers<br><br>Open source project contribution you can share a plus<br><br>Experience in Telecom Industry a plus<br><br>A Bachelor degree in Computer Science. Masters preferred<br><br>Must be a US Citizen, Permanent Resident or Green Card Holder<br><br>Must be located in DC, VA or MD</span>",
    "urlFetchPending": false,
    "published": "May 1, 2017 9:07:45 AM",
    "tags": [
      "TZ_America",
      "REMOTE1_50",
      "TITLE1_manager",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "50% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "TGj3cgg7RDGTjECrenQqCA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/55186/head-of-marketing-at-jetzt/",
    "title": "Head of Marketing",
    "content": "We are speed focused so: <br /><br />Head of Marketing <br /><br />Phenomenal track record in social media campaigns including promoted as well as guerilla campaigns in physical/digital <br />Must have worked in a disruptive company <br />International (US and Europe) experience <br />Full P/L responsibility <br />Understanding of high street retail markets <br />Comfortable working independently both at home and overseas <br />Have recruited and managed a team of 5+ <br />PR experience (to trade) <br /><br />We target 3 distinct channels and have a unique social media marketing platform through which we intend to deliver the majority of our marketing, This platform also forms part of our monetisation strategy and so is vital to the business. <br />We want somebody who can pick up the ball and run with it, building a global product that serves our requirements whilst also delivering an additional product. <br />The business is growing at the speed of light and the platform needs to keep up with this.<br /> <br /><br />Cambridge UK <br /><br />No agenices ",
    "urlFetchPending": false,
    "published": "Mar 10, 2017 4:07:46 PM",
    "tags": [
      "TZ_America",
      "REMOTE1_50",
      "TITLE1_manager",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "50% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "Txn2NNEwT-yzPpp1sZdqdQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56692/head-of-sales-and-account-management-at-food/",
    "title": "Head of Sales and Account Management",
    "content": "Hi there - <br /><br />We are looking for a senior and experience sales / growth hacker to join our management team. <br /><br />We are a highly dynamic startup willing to disrupt the food and drinks wholesale industry, using technology to make good food accessible.<br /><br />The ideal candidate has a strong background in either food, drinks, hospitality and wholesale and is terrific in sales and customer acquisition. Preferably the candidate has also a good network in the industry (such as restaurants, hotels, corporate), including London-based. The candidate needs to have a very good understanding of the food supply chain, the wholesale industry and the needs of both sides of the transaction (food producers / buyers).<br /><br />The head of sales and account management would lead a team of more junior people and will be responsible of defining and deploying fast an acquisition and growth strategy.<br /><br />We are about to finalise a new funding round led by a great VC, which means there is great opportunities for growth within our company. The candidate would become part of the management team, working in tandem with our CEO. The position includes a good fixed salary, bonuses depending on targets, and equity shares as incentive.<br /><br />The job is London-based (west London) and we are of course flexible with hours or the need for remote working when necessary. <br /><br />If you think you are the right one and all this sounds exciting, please send us an email!<br /><br />Looking forward to hearing from you soon.<br /><br /><br />",
    "urlFetchPending": false,
    "published": "Apr 24, 2017 10:50:00 AM",
    "tags": [
      "TZ_America",
      "REMOTE1_50",
      "TITLE1_manager",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "50% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "UFciPL5VSiKV2PRn5jHRag",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56658/account-executive-western-europe-at-branch/",
    "title": "Account Executive - Western Europe",
    "content": "*The Basics:* <br /><br />As a Branch Evangelist in Western Europe, you will work cross-functionally with Product, Marketing, and Partner Growth to bring our Premium Solutions to market. You will work with our largest existing customers to help them leverage our newest products and features. You’ll also reach out to new potential partners and drive them to integrate Branch’s deep linking solutions. You will succeed in this role if you are an energetic and organized self-starter who understands the sales process, can build relationships with the right decision-makers, and can succinctly define and communicate the specific benefits of Branch appropriate for each customer. You will be a key driver of revenue growth for the company, and on the front lines for evangelising our product to prospective and existing users as well as strategic channel partners.<br /><br />*What You’ll Do:*<br /><br />* Establish our growing monetisation channels and deliver revenue for the company. <br />* Work cross functionally with Marketing and Product, delivering real-time feedback on our new and existing products and features.<br />* Work autonomously and remotely, developing the market in Western Europe, traveling as needed (up to 50%).<br />* Demonstrate how mobile app developers can utilise Branch in a variety of ways, through phone calls, demonstrations, and presentations.<br />* Identify tactics to build local groundswell and brand awareness to support the sales cycle.<br />* Design and execute sales campaigns.<br />* Build and manage a sales pipeline.<br />* Make every potential Branch user happy with every interaction, regardless of deal size.<br />* Build and enhance relationships with our largest partners.<br />* Create and localise sales materials and demos to effectively showcase Branch.<br />* Represent Branch at relevant regional conferences and events.<br /><br />*We’re Looking for Someone With:*<br /><br />* 3-4 years of experience in a Sales or customer-facing role at a mobile technology company, with a track record of top performance.<br />* Ability to understand the Branch SDK in-depth and communicate its benefits to both technical and non-technical customers.<br />* Strong interest in mobile technology and mobile SDKs.<br />* Full written and speaking fluency in English, strong preference for additional fluency in French, Spanish, and/or German.<br />* A strong work ethic and internal drive to produce results.<br />* Data-driven, and experience managing a pipeline using Salesforce or similar SFA tool.<br />* Humility, and a partner-first mentality.<br /><br />*Nice to Haves:*<br /><br />* Prior experience at a growth stage Internet/Software company, selling enterprise solutions.<br />* A thorough understanding of Email Marketing and Email Service Providers (ESPs).<br />* Mobile development experience.<br /><br />*About Us:*<br /><br />Branch (branch.io) is the deep linking and mobile growth standard that helps mobile marketers and developers attribute app installs, optimize and create invite systems, and do smarter in-app sharing through our unique device fingerprinting and deep linking technology. Marketers and developers use Branch to seamlessly integrate their apps into all marketing communications and channels.  We dynamically generate short URLs on the fly that pass and track data from the originating source through installs, across devices, and across platform. We use this technology to provide brands a deeper insight into app installs, more personal customer acquisition, and better engagement of users with our variety of SDK features.<br /><br />We have amazing investors (raised over 50 million in funding) and a team based in Palo Alto of over 90 employees from different backgrounds, experiences, and educations, all passionate about the work we do, the team we do it with, and the partners we do it for.  We are constantly releasing new products and solving fascinating problems.<br /><br />If you are the type of person that loves working hard in order to solve challenging problems, appreciates a culture of transparency and ownership, and thrives with no micromanagement, then this could be a great place for you.",
    "urlFetchPending": false,
    "published": "Apr 21, 2017 7:24:11 PM",
    "tags": [
      "REMOTE1_50",
      "TITLE1_manager",
      "TZ_Europe",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "50% remote",
      "EU work authorisation",
      "Europe timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "MUQTfD3uRV-3oBlwAauIjA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56432/account-manager-at-whitehat/",
    "title": "Account Manager",
    "content": "WhiteHat is a tech startup founded to address the lack of high-quality, career-focused apprenticeships on offer for ambitious young people and provide employers with the means to attract the best non-graduate talent.<br /><br />Our mission is to accelerate incredible careers and develop a diverse group of future leaders.<br /><br />We are looking for an exceptional account manager to support our existing clients and drive deep and enduring partnerships with employers, encouraging them to increase the range and number of apprenticeships they offer across their business.<br /><br />*The Role*<br /><br />* Ongoing management of client relationship<br />* Keep CRM system updated with client touchpoints and ensure regular management of both current and previous clients is maintained at all times<br />* In-work support of employer to get ongoing feedback of apprentices in seat.<br />* Work with the Coaches and IQA to highlight at risk candidates as early as possible and work with the employer to find a solution to any issues.<br />* Land and expand within an existing account<br />* Upselling existing clients into new types of apprenticeships, encouring the progression of existing apprentices to additional apprenticeship levels, and upselling volume of hires<br />* Take a consultative approach to selling at all times<br />* Drive processes forward on the employer side by educating clients on the importance of giving candidates prompt feedback and clarity on decision making timelines<br />* Encourage clients to submit feedback on candidates in a timely manner to support candidate coaching<br />* Encourage clients to move existing apprentices to WhiteHat where they are currently contracted to another training provider<br />* Collecting employer availability for interviews and coordinating with our talent managers to get candidates booked in for interviews<br />* Constantly be looking for ways to improve hiring conversions and the efficiency of our process<br />* Act as a representative of the WhiteHat values and brand at all times, acting with integrity in everything you do<br /><br />*About You*<br /><br />* You are passionate about helping to deliver the best learning opportunities to young people<br />* You care deeply about how both our customers and our users perceive us<br />* You have a proven track record in achieving outcomes and demonstrating success<br />* You have previous experience in an account management role with upsell / land and expand mandate and goals<br />* You have a consultative sales style<br />* You ideally have startup experience<br /><br />*Our Values*<br /><br />* We are all owners: we think about the impact of our actions on the team, the company and on our external perception<br />* Good people win: we believe that respect flows both ways; we are approachable, warm and responsive<br />* We put others first: we go above and beyond to create an exceptional service and experience for our users<br />* We believe in social mobility: your background should never define your destination<br />* We are changemakers: we are working to create impact at scale<br />* Integrity is paramount: we put our apprentices’ success first<br />* We are honest but kind: direct feedback delivered with kindness helps others realise their full potential<br />* We are mission & results driven: we pursue excellence in everything we do and we energise and inspire others through the standards we set",
    "urlFetchPending": false,
    "published": "Apr 17, 2017 1:33:30 PM",
    "tags": [
      "TZ_America",
      "REMOTE1_50",
      "TITLE1_manager",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "50% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "1F1wWiH8RwqlpqRDgeSOKA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56402/business-development-manager-at-prix/",
    "title": "Business Development Manager",
    "content": "SHORT SUMMARY<br /><br />Prix is building an artificial intelligence-driven pricing solution for hotels and hostels. We need a tech savvy and entrepreneurial business development manager to help us expand rapidly in this underexploited market.<br /><br /><br />COMPANY OVERVIEW <br />Demand changes constantly. Prix is a self-driving price engine to keep your revenues on track. We deliver this solution through intuitive dashboards and APIs.<br /><br />We're a startup<br />This means the shared freedom to work how we want, on something we’re passionate about, with people we like.<br /><br />We are customer-centric<br />We place customer needs at the center of our product, roadmap and distribution strategy.<br /><br />We’re fast and ambitious<br />There is a lot of room to grow, freedom in how to do it and support when you need it.<br /><br />We do the right thing by our team<br />We have flexible hours, remote working, transparent & fair compensation (salary & options), health-plan. And just generally we respect each other and have fun.<br /><br />8 people in the team right now (6 PhDs)<br />Everyone in the company is involved in: <br />- Defining company strategy & product roadmap<br />- Participating in our inclusive agile-culture - plan, sprint, fix etc.<br />- Pitching in on whatever needs doing<br /><br />WHAT YOU WILL BE WORKING ON <br />    <br />- Create and prospect a pipeline of hospitality clients that will enable us to reach growth targets<br />- Gather customer feedback, monitor market trends and feed these back to our science and tech teams<br />- Participate in growth workshops and agile company culture to refine products and sales material<br />- Help to expand our sales operations as we grow our product and market<br />- Help around when need be, we’re a fast moving startup<br /><br />WHAT WE ARE LOOKING FOR  <br />- Energetic, very hungry superstars willing to take part in building and delivering our science & tech to the hospitality industry<br />- Entrepreneurial spirit, flexible, quick learner and proactive<br />- A champion of understanding clients needs <br />- Tech savvy and willing to work with tomorrow’s tools and processes<br />- Experience and track record in exploratory sales and/or SaaS products<br />- Excited about what we do, willing to do it even better<br /><br />BONUS <br /><br />- A second European Language<br />- Experience selling to the hospitality industry would be a huge plus<br /><br /><br /><br />",
    "urlFetchPending": false,
    "published": "Apr 13, 2017 4:22:51 PM",
    "tags": [
      "TZ_America",
      "REMOTE1_50",
      "TITLE1_manager",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "50% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "kTTolhQuRVC29yd5s3UxNg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/56277/operations-and-accounts-manager-at-yourfittingroom/",
    "title": "Operations and Accounts Manager",
    "content": "The Company<br /><br />Yourfittingroom is an online fashion marketplace and delivery company that aims to change the way people shop for fashion online. We allow customers the opportunity to experience the quality and fit of items for 30 minutes at home before making a purchasing decision. Eradicating missed deliveries, purchasing ill fitting clothes and arranging returns, Yourfittingroom breathes a breath of fresh air into the tired online shopping and delivery experience. <br /><br />On the other side of the marketplace, our unique delivery method gives independent brands a better way to introduce themselves to new customers. We remove the risk from purchasing a high price piece from an unknown brand by encouraging customers to experience items for themselves before asking them to commit to the purchase. We help customers discover new brands and brands reach new customers. <br /><br />_The Role_<br /><br />As one of the first employees, the role isn’t set in stone. The founder is seeking a person who will help shape the business and potentially evolve into the COO role over time. Currently the role covers the following:<br /><br />-Manage brands: You’ll be required to build and manage relationships with the 10 brands we currently work with. We’re a service driven business so understanding the problems our partners face and fixing them is critical to our success. <br /><br />-Understand customers: The entire team will spend time on the road making deliveries. This is our bread and butter. We’re still at a stage where we’re trying to find product/market fit so delivering gives us the perfect opportunity to build feedback into our process. <br /><br />-Solve Problems: Every day is different in the dynamic world of startups. We’re looking for someone who views problems as challenges waiting to be overcome. A self starter who’ll take responsibility for ensuring things are running smoothly without being asked. <br /><br />_The Person_<br /><br />We welcome applications from people from all backrounds, skills and experiences but ideally, you’ll have some of the below: <br /><br />-People person: This role requires constant communication with our B2B and B2C customers so great people skills is a must. <br /><br />-Project delivery experience: We’re looking for an organiser. A project manager type that enjoy getting things done. <br /><br />-Passion for the industry: We’re not your run of the mill delivery company. We’re a fashion company that delivers. <br /><br />-Hard worker: We’re an early stage start up so we need somebody who works well under pressure and is willing to put in the extra hours. <br /><br />_Our Offering_<br /><br />Between £1800 and £2200 per month and an equity share",
    "urlFetchPending": false,
    "published": "Apr 11, 2017 10:39:06 AM",
    "tags": [
      "TZ_America",
      "REMOTE1_50",
      "TITLE1_manager",
      "WORKAUTH_US"
    ],
    "tagsNames1": [
      "50% remote",
      "America timezones",
      "US work authorisation"
    ],
    "tagsNames2": []
  },
  {
    "id": "1rU7ZFt5QQW8G0iSacn3EA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING"
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/55307/account-manager-at-izettle-ab/",
    "title": "Account Manager",
    "content": "Account Manager – UK, London!<br /><br />We started iZettle with a single mission: to empower small-business owners to sell smarter by offering them the tools typically reserved for bigger players. We have come a long way, but there is so much exciting work ahead of us. Therefore, we need the best and brightest people to help us get it done. Our fast-growing start-up was founded in 2010 and currently has approximately 450 employees across its offices in London, Berlin, Madrid, Mexico City, Sao Paulo, Edinburgh and Stockholm (HQ).<br /><br />We are looking for a sales-driven, competitive and hard-working Account manager for the UK market, starting as soon as possible. As an Account manager you will deliver an excellent customer experience to our most loyal<br />customers together with a focus to drive account retention. At iZettle you’ll play an essential part in building relationships with our biggest customers. This is a full-time position, based UK, working for the UK market. Your team will consist of Account managers from Sweden, UK and Norway and you will report directly to the team<br />leader in Stockholm.<br /><br />As an experienced account manager, you’ll have no problem nurturing a significant number of relationships with few natural touch points. Your systematic approach will mean a seamless service for our clients and a steady flow of repeat business for us. For this position you will have a big impact on the continuous growth of our new retention team. With the right drive and attitude there will be endless opportunities for you to grow together with iZettle.<br /><br />Who we think you are:<br /><br />• You are professional, organized and motivated as well as have the drive to succeed in a fast-paced environment<br />• A team player personality and you strive to contribute to iZettle’s positive working atmosphere<br />• Genuine passion for sales & service and a “Get it done” mentality<br />• Excellent negotiating and people skills<br />• You love new challenges and are passionate about providing the best customer experience<br />• You can sell, of course, and your customers love to work with you!<br /><br />Requirements<br />• 2-4 years experience in sales/account management/business development<br />• Business related education and B2B experience<br />• You are fluent in English<br />• Excellent communication skills<br />Simply put, our team is looking for someone awesome! You have the skills to win great deals, but you don’t climb over people to do it. You are motivated, competitive, persuasive, hard working, but humble. You want your team to win, and you play the right way!<br /><br />If you are interested in this position, please send your CV and cover letter in English.<br />We are looking forward hearing from you!",
    "urlFetchPending": false,
    "published": "Mar 15, 2017 9:56:07 AM",
    "tags": [
      "TZ_America",
      "REMOTE1_50",
      "TITLE1_manager",
      "WORKAUTH_EU"
    ],
    "tagsNames1": [
      "50% remote",
      "America timezones",
      "EU work authorisation"
    ],
    "tagsNames2": []
  }
]
}
