{
  "items": [
  {
    "id": 26,
    "source": {},
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/134874/java-solutions-architect-granbury-solutions?a\u003dJepWJmMQICY",
    "title": "Java Solutions Architect at Granbury Solutions () (allows remote)",
    "content": "Granbury Solutions is building a next generation technology stack for our \u003cbr /\u003erestaurant and winery management platforms and we need your help.  We\u0027re \u003cbr /\u003elooking for a Java Solutions Architect to bring experience and leadership to \u003cbr /\u003eour core point-of-sale team.\u003cbr /\u003e\u003cbr /\u003eThe ideal candidate knows how to take a product manager’s vision, break it \u003cbr /\u003edown into the right design abstractions, and lead a team through the \u003cbr /\u003eimplementation process.  The ideal candidate takes responsibility for the \u003cbr /\u003esystem after it ships and maintains close relationships with the operations \u003cbr /\u003eteam to keep the system healthy and performant.\u003cbr /\u003e\u003cbr /\u003eYou\u0027ll work with people who are as nice as they are smart.  You\u0027ll get the \u003cbr /\u003eguidance you need and you won\u0027t be shamed when you stumble across a problem you \u003cbr /\u003edon\u0027t know how to solve on your own.  You\u0027ll deal with a minimum of corporate \u003cbr /\u003enonsense and get the freedom to do things right.  \u003cbr /\u003e\u003cbr /\u003eAnd you\u0027ll do all this from the comfort of your own home.  This is a remote \u003cbr /\u003eposition, but you\u0027ll keep in touch with your team with daily virtual standups. \u003cbr /\u003e We\u0027ll pick a spot on the map every so often and get together for a technical \u003cbr /\u003econference or in person design confab.  But most importantly, you\u0027ll give hard \u003cbr /\u003eworking locally owned businesses a real chance in their struggle against the \u003cbr /\u003eempire.  Seriously.\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eRequired Qualifications\u003cbr /\u003e\u003cbr /\u003e * A bachelors degree in Computer Science or equivalent experience. \u003cbr /\u003e * At least 7 years experience developing Java web applications. \u003cbr /\u003e * At least 3 years in a lead or architect role. \u003cbr /\u003e * At least 3 years experience managing and mentoring a small development team.\u003cbr /\u003e * At least 5 years with the Spring Framework. \u003cbr /\u003e * Experience with and fanatical belief in Test Driven Development with JUnit \u003cbr /\u003eor TestNG. \u003cbr /\u003e * Experience with build tools like Maven and Gradle. \u003cbr /\u003e * At least 5 years experience with developing applications for Linux web \u003cbr /\u003eservers.  (CentOS preferred.) \u003cbr /\u003e * At least 5 years experience building Java applications on relational \u003cbr /\u003edatabases. (MySQL or Postgres preferred.) \u003cbr /\u003e * A working knowledge of AWS services like EC2, Route 53, S3, RDS, and \u003cbr /\u003eElastic Load Balancing. \u003cbr /\u003e * At least one project in production on a NoSQL database. (Couchbase \u003cbr /\u003epreferred.) \u003cbr /\u003e * Exposure to at least one modern Javascript SPA framework like Backbone, \u003cbr /\u003eEmber, or Angular. \u003cbr /\u003e * Excellent communication skills. \u003cbr /\u003e * A desire to do things right and the ability to take ownership of difficult \u003cbr /\u003eproblems. \u003cbr /\u003ePreferred Qualifications\u003cbr /\u003e\u003cbr /\u003e *  Continuous integration platforms like Bamboo or Jenkins (Jenkins \u003cbr /\u003epreferred). \u003cbr /\u003e * Enough experience with JPA or Hibernate to know why they need to be phased \u003cbr /\u003eout. \u003cbr /\u003e * Experience with a configuration management system like Chef, Puppet, \u003cbr /\u003eAnsible or AWS Cloud Formation. \u003cbr /\u003e * Enough experience with Agile development methodologies to see their \u003cbr /\u003estrengths and weaknesses. \u003cbr /\u003e * Payment card industry experience or experience building PCI compliant \u003cbr /\u003esystems. \u003cbr /\u003e * Experience with asynchronous messaging systems like MQ Series, JMS, or \u003cbr /\u003eRabbit MQ. \u003cbr /\u003e * Experience with custom PXE based hardware imaging techniques. (Anaconda, \u003cbr /\u003ekickstart, etc.) \u003cbr /\u003e * Experience building and deploying software as RPM\u0027s.  (You\u0027ve created an \u003cbr /\u003eRPM build spec.) \u003cbr /\u003e * Experience with embedded development on Verifone or Ingenico payment \u003cbr /\u003edevices. (Long shot, we know.) \u003cbr /\u003e About Granbury Solutions \u003cbr /\u003e\u003cbr /\u003eWe\u0027re Granbury Solutions.  We make software for malls, wineries, and yes, \u003cbr /\u003epizza shops.  Our Thrive and Firefly POS systems are used by thousands of \u003cbr /\u003eindependent pizza restaurants all over the world to satisfy the needs of \u003cbr /\u003efamilies, college kids, and drunkards everywhere.\u003cbr /\u003e\u003cbr /\u003eWe work from home and we get together every day for a virtual stand up.  We go \u003cbr /\u003eto at least one conference a year and we sometimes fly in for design sessions \u003cbr /\u003eor project war rooms.  We try to take cool nerdy field trips.  Last time we \u003cbr /\u003ewent to the Hanford LIGO Observatory and saw how giant lasers can detect \u003cbr /\u003egravity waves.  It was cool.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 10 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? apply now \u003c\u003e  more jobs at Granbury \u003cbr /\u003eSolutions \u003c\u003e \u003cbr /\u003eJoin us at Granbury Solutions\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eHealth Insurance Free Home Internet Complementary Infants Free Technical Books \u003cbr /\u003eRegular Technical Conferences \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eJeffrey Payne \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Gillian Schweighardt \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e John Beadles \u003cbr /\u003ejavascript angularjs mocha jasmine \u003cbr /\u003eview profile \u003c\u003e Connor Douthat \u003cbr /\u003e\u003cbr /\u003eview profile \u003c\u003e Learn more about Granbury Solutions \u003c\u003e more jobs at Granbury \u003cbr /\u003eSolutions \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/granbury?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2_linux",
      "REMOTE1_100",
      "TECH2_java",
      "REMOTE2_America",
      "TECH2_maven",
      "TITLE1_product",
      "TECH2_spring",
      "TECH2_junit"
    ]
  },
  {
    "id": 96,
    "source": {},
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/132669/product-manager-developer-products-stack-overflow?a\u003dIuzlT9RNlIs",
    "title": "Product Manager - Developer Products at Stack Overflow (New York, NY) (allows remote)",
    "content": "At Stack Overflow, we are obsessed with serving developers. Whether we’re \u003cbr /\u003ehelping developersget answers to their questions \u003chttp://stackoverflow.com/\u003e, \u003cbr /\u003efind a new job \u003chttp://stackoverflow.com/jobs\u003e, or discover documentation \u003cbr /\u003e\u003chttp://stackoverflow.com/documentation\u003e, we build products that make millions \u003cbr /\u003eof developers’ lives better every day. We’re looking for a Product Manager to \u003cbr /\u003ejoin two other PM’s working on developer facing products. Working on developer \u003cbr /\u003eproducts means leading a wide range of projects around new user acquisition, \u003cbr /\u003eQ\u0026A expansion and maintenance, user onboarding, and working with our marketing \u003cbr /\u003eteam on user education. In this role you’ll work with a bright team of \u003cbr /\u003edevelopers, designers, marketing, and community growth experts to understand \u003cbr /\u003ehow we can best delight our developer customers.\u003cbr /\u003e\u003cbr /\u003eYou’ll have the opportunity to do a lot. You can expect during the first year:\u003cbr /\u003e\u003cbr /\u003e * First Month: Get onboarded and brought up to speed on our current plans. \u003cbr /\u003eYou’ll spend a lot of time learning about our products, building rapport with \u003cbr /\u003ethe product, marketing, and community teams, and contributing to small features.\u003cbr /\u003e * Next 3 Months: Acquire a deep understanding through research and testing of \u003cbr /\u003eour signup and onboarding user flows. You’ll start taking on projects of your \u003cbr /\u003eown from our backlog. You’ll take an idea and turn it into a prototype, talk to \u003cbr /\u003ethe community on Meta, and pitch your project to the rest of the company.   \u003cbr /\u003e * Next 6 months: You can expect to start taking a leadership role on \u003cbr /\u003edeveloper facing projects. You’ll be involved not just in product development, \u003cbr /\u003ebut in defining long term strategy, improving our processes, and planning the \u003cbr /\u003eroadmap for the team. \u003cbr /\u003eWe like to work in public. Not only does that mean being open within the \u003cbr /\u003ecompany about what the product team is building, we also try and bring the \u003cbr /\u003edeveloper community in as soon as we’re able.  Some examples of big \u003cbr /\u003edeveloper-facing projects we’ve worked on in the past :\u003cbr /\u003e\u003cbr /\u003e * Documentation \u003cbr /\u003e\u003chttp://meta.stackoverflow.com/questions/306213/warlords-of-documentation-your-questions-answered?rq\u003d1\u003e\u003cbr /\u003e * Developer Story \u003cbr /\u003e\u003chttp://meta.stackoverflow.com/questions/314636/the-developer-story-part-2-we-didnt-explain-that-very-well?lq\u003d1\u003e\u003cbr /\u003e * Jobs on Stack Overflow \u003cbr /\u003e\u003chttp://meta.stackoverflow.com/questions/310066/stack-overflow-serving-programmers-even-better\u003e\u003cbr /\u003eWe’re looking to hire the best person wherever you are in the world. We work \u003cbr /\u003eremotely \u003cbr /\u003e\u003chttp://blog.stackoverflow.com/2013/02/why-we-still-believe-in-working-remotely\u003e\u003cbr /\u003e so you can work from home and interact with the team over Google Hangouts and \u003cbr /\u003echat, usually during US or European working hours. We have offices in New York, \u003cbr /\u003eLondon and Denver, so if you’re in (or want to relocate to) one of those cities \u003cbr /\u003eyou can, andour offices are awesome \u003cbr /\u003e\u003chttps://stackoverflow.com/jobs/companies/stack-overflow\u003e.\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eWhat you’ll do:\u003cbr /\u003e\u003cbr /\u003e * Propose new products and features and pitch them to the company and \u003cbr /\u003ecommunity \u003cbr /\u003e * Start with high-level goals and turn them into detailed functional specs, \u003cbr /\u003eand work with developers and designers to create rapid prototypes \u003cbr /\u003e * Define and monitor metrics to determine the effectiveness of features, and \u003cbr /\u003eadminister split tests to learn whether a change is an improvement \u003cbr /\u003e * Interact with our community of developers to gather ideas and feedback \u003cbr /\u003e * Support go-to-market strategies with marketing and sales team \u003cbr /\u003eWhat we want to see:\u003cbr /\u003e\u003cbr /\u003e * Minimum of 4 years as a product manager/product owner \u003cbr /\u003e * Experience coming up with ideas for, building, and shipping web software \u003cbr /\u003e * A deep understanding of Stack Overflow and other Stack Exchange network \u003cbr /\u003esites \u003cbr /\u003e * Strong UX skills and spec-writing skills \u003cbr /\u003e * An understanding of the technical implications of what you ask the team to \u003cbr /\u003edo \u003cbr /\u003e * Excellent telecommuting skills. Even if you work from one of our offices, \u003cbr /\u003emany of our team members are remote \u003cbr /\u003e * Experience with usability testing and A/B tests \u003cbr /\u003e * Demonstrated ability to communicate clearly through written word (whether \u003cbr /\u003ethat\u0027s meta or forum posts, specs, blogging, or anything else) \u003cbr /\u003e About Stack Overflow \u003cbr /\u003e\u003cbr /\u003eOur goal is to make the Internet a better place to get expert answers to your \u003cbr /\u003equestions. We’ve done a lot of that with Stack Overflow, but we think there’s \u003cbr /\u003estill more to do.\u003cbr /\u003e\u003cbr /\u003eWe believe in hiring smart people and getting out of their way. We have an \u003cbr /\u003eoffice in New York with some of the best amenities of any New York startup, and \u003cbr /\u003ewe have people who work remotely all over the world. We keep meetings and \u003cbr /\u003eceremony to an absolute minimum, and will never poke you with a sharp stick.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eDiverse teams build better products\u003cbr /\u003e\u003cbr /\u003eLegally, we need you to know this: Stack Exchange, Inc. does not discriminate \u003cbr /\u003ein employment matters on the basis of race, color, religion, gender, national \u003cbr /\u003eorigin, age, military service eligibility, veteran status, sexual orientation, \u003cbr /\u003emarital status, disability, or any other protected class. We support workplace \u003cbr /\u003ediversity. \u003cbr /\u003e\u003cbr /\u003eBut we want to add this: We strongly believe that diversity of experience \u003cbr /\u003econtributes to a broader collective perspective that will consistently lead to \u003cbr /\u003ea better company and better products. We are working hard to increase the \u003cbr /\u003ediversity of our team wherever we can and we actively encourage everyone to \u003cbr /\u003econsider becoming a part of it.\u003cbr /\u003eapply now \u003c\u003e  more jobs at Stack Overflow  \u003c\u003e \u003cbr /\u003eJoin us at Stack Overflow\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003e20+ days vacation Flexible work schedules Ridiculous health insurance (no \u003cbr /\u003ecopay) Insanely great workstations, chairs, and desks Yearly stipend for \u003cbr /\u003econferences Gym membership reimbursement Free lunch from our in-house chefs \u003cbr /\u003eTuition reimbursement Unlimited sick days and fully paid parental leave \u003cbr /\u003eEmployees will never be poked with a sharp stick \u003cbr /\u003e\u003cbr /\u003eWho you’ll work with\u003cbr /\u003eGeoff Dalgas \u003cbr /\u003easp.net c# \u003cbr /\u003eview profile \u003c\u003e Jarrod Dixon \u003cbr /\u003ec# asp.net-mvc jquery sql \u003cbr /\u003eview profile \u003c\u003e Marc Gravell \u003cbr /\u003ec# .net sql protobuf-net \u003cbr /\u003eview profile \u003c\u003e Jeff Szczepanski \u003cbr /\u003ec kernel embedded startups \u003cbr /\u003eview profile \u003c\u003e Kevin Montrose \u003cbr /\u003ec# api-design windows .net \u003cbr /\u003eview profile \u003c\u003e Jason Punyon \u003cbr /\u003ec# redis \u003cbr /\u003eview profile \u003c\u003e Steve Trout \u003cbr /\u003epython c haskell java \u003cbr /\u003eview profile \u003c\u003e Learn more about Stack Overflow \u003c\u003e more jobs at Stack Overflow \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/stack-overflow?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2_product",
      "TECH2_trello",
      "TECH2_project-management",
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 193,
    "source": {},
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/132592/sr-security-product-manager-12781br-synopsys?a\u003dIsY5rKq1cQw",
    "title": "Sr. Security Product Manager - 12781BR at Synopsys (San Francisco, CA) (allows remote)",
    "content": "Seeking Experienced and Proven PRODUCT MANAGERS!\u003cbr /\u003e\u003cbr /\u003eSYNOPSYS is revolutionizing the development of secure and reliable software. \u003cbr /\u003eAs a SYNOPSYS Product Manager, you are passionate about understanding market \u003cbr /\u003eproblems and building solutions that delight customers. You work closely with \u003cbr /\u003ecustomers and internal stakeholders to bring the best products to the \u003cbr /\u003emarketplace. \u003cbr /\u003e\u003cbr /\u003eAs a SYNOPSYS Product Manager, you would be responsible for three key success \u003cbr /\u003efactors for your product:\u003cbr /\u003e\u003cbr /\u003e * Strategy: Starting from market research, you will work with SYNOPSYS R\u0026D to \u003cbr /\u003edefine the product roadmap; and you work with Sales to develop and implement a \u003cbr /\u003ecompany-wide go-to-market plan. \u003cbr /\u003e * Product Lifecycle: You will manage the entire product life cycle from \u003cbr /\u003estrategic planning to tactical activities. \u003cbr /\u003e * Sales Enablement: You will work with Sales and Marketing to help them \u003cbr /\u003eunderstand the product positioning, key benefits, and \u003cbr /\u003etarget SYNOPSYS customers; you help the product marketing team provide sales \u003cbr /\u003etools and collateral; and you deliver customer briefings alongside the Sales \u003cbr /\u003eteam. \u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eTo become a SYNOPSYS Product Manager, you need:\u003cbr /\u003e\u003cbr /\u003e * A unique blend of business and technical savvy; a big picture vision, and \u003cbr /\u003ethe drive to make that vision a reality. \u003cbr /\u003e * At least five years in product management positions. \u003cbr /\u003e * Excellent communication skills to work with distributed teams, customers, \u003cbr /\u003eprospects and experts. You must be able to convey your thoughts eloquently in a \u003cbr /\u003evariety of situations. \u003cbr /\u003e * Familiarity with one or more of these product markets: Software security, \u003cbr /\u003eDevOps Tools, or Cyber Security. Specific experience with DAST and IAST \u003cbr /\u003epreferred. \u003cbr /\u003e * Expertise in software application quality and security; official security \u003cbr /\u003ecertifications such as CEH and CISSP/CSSLP preferred. \u003cbr /\u003e * Bachelor of Science degree in computer science, engineering or related \u003cbr /\u003efield; Additional business degree is preferred. \u003cbr /\u003e * Ability to travel to customer sites (20%). \u003cbr /\u003eThe product we are hiring for is Seeker, our dynamic interactive web \u003cbr /\u003eapplication security testing (IAST) solution.\u003cbr /\u003e\u003cbr /\u003e About Synopsys \u003cbr /\u003e\u003cbr /\u003eSynopsys offers the most comprehensive portfolio of software security \u003cbr /\u003esolutions in the market. We go beyond traditional testing services to help our \u003cbr /\u003eclients identify, remediate, and prevent vulnerabilities in the applications \u003cbr /\u003ethat power their business. Our holistic approach to application security offers \u003cbr /\u003ea balance of managed and professional services and products tailored to fit \u003cbr /\u003eyour specific needs. We don’t stop when the test is over. Our experts also \u003cbr /\u003eprovide remediation guidance, program design services, and training that \u003cbr /\u003eempower you to build and maintain secure applications.\u003cbr /\u003eExternal URL  apply now  \u003cbr /\u003e\u003chttps://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid\u003d25235\u0026siteid\u003d5359\u0026AReq\u003d12781BR\u003e\u003cbr /\u003e more jobs at Synopsys \u003c\u003e \u003cbr /\u003eJoin us at Synopsys\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eUnlimited PTO Medical, Dental, Vision 401(k) Commuter program Performance bonus\u003cbr /\u003eCompetitive salaries Tuition reimbursement Gym membership reimbursement \u003cbr /\u003eEmployee stock purchase program \u003cbr /\u003eLearn more about Synopsys \u003c\u003e more jobs at Synopsys \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/synopsys?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 317,
    "source": {},
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/3407-digital-product-marketing-strategist",
    "title": "Digital Product Marketing Strategist",
    "content": "* \u003cbr /\u003eDigital Product Marketing Strategist\u003cbr /\u003e\u003cbr /\u003eModern Tribe\u003cbr /\u003e\u003cbr /\u003eModern Tribe’s \u003chttp://tri.be\u003e products team is looking for a digital \u003cbr /\u003emarketing strategist ready to flex their marketing muscles in a remote team \u003cbr /\u003eenvironment. If strategic planning for software products is your jam and you’re \u003cbr /\u003ebased in North America, let’s talk.\u003cbr /\u003e\u003cbr /\u003eYou’ll know this is the right role for you if you thrive on creative thinking, \u003cbr /\u003elong-range strategic planning, campaign development, market growth initiatives, \u003cbr /\u003eteam management, and design-forward execution. In this role, you’ll be \u003cbr /\u003eresponsible for leading marketing efforts for our portfolio of WordPress \u003cbr /\u003eplugins downloaded by millions of users across the globe.\u003cbr /\u003e\u003cbr /\u003eYou will submerse yourself into identifying who our customers are and how we \u003cbr /\u003ecan best reach them. Beware though, they are a pretty diverse, eccentric and \u003cbr /\u003ecreative people. ὠ9?\u003cbr /\u003e\u003cbr /\u003eTo be transparent, this is NOT a Digital Strategy or Sales role. We have \u003cbr /\u003eDigital Strategists that you will be working with to develop and execute a \u003cbr /\u003ecomprehensive long-term plan with our marketing team. This gig is focused on \u003cbr /\u003emarketing: strategic leadership, organization, and management within our \u003cbr /\u003ecross-functional teams. Also, we’re a WordPress agency so you should have run \u003cbr /\u003esome projects with the platform.\u003cbr /\u003e\u003cbr /\u003eResponsibilities\u003cbr /\u003e\u003cbr /\u003eYour primary responsibility is to develop and execute the strategic marketing \u003cbr /\u003eplan for our products portfolio. Working alongside a project manager, you will \u003cbr /\u003ebe responsible for:\u003cbr /\u003e\u003cbr /\u003eSpecific tasks this will include:\u003cbr /\u003e\u003cbr /\u003e * Customer persona/journey mapping \u003cbr /\u003e * Defining market growth objectives and identifying new opportunities \u003cbr /\u003e * Overall marketing strategy plan, timeline, and resourcing \u003cbr /\u003e * Full-scale online marketing planning, management, and execution \u003cbr /\u003e * Identify and measure KPIs for each marketing project \u003cbr /\u003e * People leadership to deliver on-time, on-budget, and with a happy team \u003cbr /\u003e * New product launch planning and promotions \u003cbr /\u003e * Integrated marketing campaigns across common channels including SEO, SEM, \u003cbr /\u003eemail marketing, video distribution, social engagement, etc. \u003cbr /\u003e * Competitive research, analysis, and recommendations for website improvements\u003cbr /\u003e * Analysis, insight, and reporting for marketing initiatives and website \u003cbr /\u003eresults \u003cbr /\u003ePersonal Competencies\u003cbr /\u003e\u003cbr /\u003e * Strong communication and/or experience working as part of a remote team \u003cbr /\u003e * Self-motivated, detail-oriented, strong organizational skills, with a \u003cbr /\u003emethodical approach to all tasks \u003cbr /\u003e * Ability to prioritize workloads and meet deadlines \u003cbr /\u003e * Ability to work independently with minimal oversight \u003cbr /\u003e * Fluent English speaker \u003cbr /\u003eKnowledge + Experience\u003cbr /\u003e\u003cbr /\u003e * Min 5 years digital marketing experience, with at least 2 years experience \u003cbr /\u003emarketing digital products \u003cbr /\u003e * Experience directing the marketing of several successful new digital \u003cbr /\u003eproduct launches. \u003cbr /\u003e * Prior experience working in a strategic marketing role \u003cbr /\u003e * Experience leading people, especially developers and designers. \u003cbr /\u003e * Advanced marketing skills in the areas of: segmentation, positioning, brand \u003cbr /\u003estrategy, product strategy, and value proposition \u003cbr /\u003e * Strong business acumen – ability to understand how to pair marketing with \u003cbr /\u003ebranding initiatives and sales growth objectives \u003cbr /\u003e * Design training \u003cbr /\u003e * Intimate familiarity with the WordPress community \u003cbr /\u003e * Proficiency in Google Analytics, eCommerce platforms, PPC \u0026 paid social, \u003cbr /\u003eand SEO \u003cbr /\u003eBonus Points\u003cbr /\u003e\u003cbr /\u003e * Experience marketing to International digital software users \u003cbr /\u003e * MySQL query writing for custom reports \u003cbr /\u003e * Experience with the freemium model \u003cbr /\u003eRequirements\u003cbr /\u003e\u003cbr /\u003eWe love working with each other because we have built a culture that suits us \u003cbr /\u003ewell. We work with a mix of freelancers and traditional employees, and \u003cbr /\u003ecoordinate their talents for large projects. Learn more about how our team \u003cbr /\u003eworks, what traits we look for in new team members andmore here \u003cbr /\u003e\u003chttp://tri.be/careers/\u003e.\u003cbr /\u003e\u003cbr /\u003ePay and Perks\u003cbr /\u003e\u003cbr /\u003eThe strategist role at Modern Tribe is a full-time job (35+ hours/weekly). \u003cbr /\u003eFull time salary between$70,000 – $90,000 USD. We may consider a contract role \u003cbr /\u003efor this gig as well.\u003cbr /\u003e\u003cbr /\u003eWork from home, or a coworking space, or join a small crew in the Minneapolis \u003cbr /\u003eoffice. We are entirely location independent (North American hours required).\u003cbr /\u003e\u003cbr /\u003eModern Tribe has been shaped as a lifestyle company: we exist to provide our \u003cbr /\u003eteam members with work that supports the lifestyles they want to see. We offer \u003cbr /\u003econsistency in expectations, payment, support and a flexible work schedule. We \u003cbr /\u003ebelieve in learning from each other and fostering personal growth. You can \u003cbr /\u003eexpect to learn a lot while working with us.\u003cbr /\u003e\u003cbr /\u003eYou also get to come on our awesome annual team trips \u003cbr /\u003e\u003chttp://tri.be/blog/team-trip-2016/\u003e.",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 8:00:25 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 334,
    "source": {},
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28794?r\u003drss2",
    "title": "Modern Tribe: Digital Product Marketing Strategist",
    "content": "Full-time\u003cbr /\u003e\u003cbr /\u003e(Anywhere) \u003cbr /\u003e\u003cbr /\u003eModern Tribe’s \u003chttp://tri.be\u003e products team is looking for a digital \u003cbr /\u003emarketing strategist ready to flex their marketing muscles in a remote team \u003cbr /\u003eenvironment. If strategic planning for software products is your jam and you’re \u003cbr /\u003ebased in North America, let’s talk.\u003cbr /\u003e\u003cbr /\u003eYou’ll know this is the right role for you if you thrive on creative thinking, \u003cbr /\u003elong-range strategic planning, campaign development, market growth initiatives, \u003cbr /\u003eteam management, and design-forward execution. In this role, you’ll be \u003cbr /\u003eresponsible for leading marketing efforts for our portfolio of WordPress \u003cbr /\u003eplugins downloaded by millions of users across the globe.\u003cbr /\u003e\u003cbr /\u003eYou will submerse yourself into identifying who our customers are and how we \u003cbr /\u003ecan best reach them. Beware though, they are a pretty diverse, eccentric and \u003cbr /\u003ecreative people. ὠ9?\u003cbr /\u003e\u003cbr /\u003eTo be transparent, this is NOT a Digital Strategy or Sales role. We have \u003cbr /\u003eDigital Strategists that you will be working with to develop and execute a \u003cbr /\u003ecomprehensive long-term plan with our marketing team. This gig is focused on \u003cbr /\u003emarketing: strategic leadership, organization, and management within our \u003cbr /\u003ecross-functional teams. Also, we’re a WordPress agency so you should have run \u003cbr /\u003esome projects with the platform. \u003cbr /\u003e\u003cbr /\u003eResponsibilities \u003cbr /\u003e\u003cbr /\u003eYour primary responsibility is to develop and execute the strategic marketing \u003cbr /\u003eplan for our products portfolio. Working alongside a project manager, you will \u003cbr /\u003ebe responsible for:\u003cbr /\u003e\u003cbr /\u003eSpecific tasks this will include: \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e * Customer persona/journey mapping \u003cbr /\u003e * Defining market growth objectives and identifying new opportunities \u003cbr /\u003e * Overall marketing strategy plan, timeline, and resourcing \u003cbr /\u003e * Full-scale online marketing planning, management, and execution \u003cbr /\u003e * Identify and measure KPIs for each marketing project \u003cbr /\u003e * People leadership to deliver on-time, on-budget, and with a happy team \u003cbr /\u003e * New product launch planning and promotions \u003cbr /\u003e * Integrated marketing campaigns across common channels including SEO, SEM, \u003cbr /\u003eemail marketing, video distribution, social engagement, etc. \u003cbr /\u003e * Competitive research, analysis, and recommendations for website improvements\u003cbr /\u003e * Analysis, insight, and reporting for marketing initiatives and website \u003cbr /\u003eresults \u003cbr /\u003ePersonal Competencies \u003cbr /\u003e\u003cbr /\u003e * Strong communication and/or experience working as part of a remote team \u003cbr /\u003e * Self-motivated, detail-oriented, strong organizational skills, with a \u003cbr /\u003emethodical approach to all tasks \u003cbr /\u003e * Ability to prioritize workloads and meet deadlines \u003cbr /\u003e * Ability to work independently with minimal oversight \u003cbr /\u003e * Fluent English speaker \u003cbr /\u003eKnowledge + Experience\u003cbr /\u003e\u003cbr /\u003e * Min 5 years digital marketing experience, with at least 2 years experience \u003cbr /\u003emarketing digital products \u003cbr /\u003e * Experience directing the marketing of several successful new digital \u003cbr /\u003eproduct launches. \u003cbr /\u003e * Prior experience working in a strategic marketing role \u003cbr /\u003e * Experience leading people, especially developers and designers. \u003cbr /\u003e * Advanced marketing skills in the areas of: segmentation, positioning, brand \u003cbr /\u003estrategy, product strategy, and value proposition \u003cbr /\u003e * Strong business acumen – ability to understand how to pair marketing with \u003cbr /\u003ebranding initiatives and sales growth objectives \u003cbr /\u003e * Design training \u003cbr /\u003e * Intimate familiarity with the WordPress community \u003cbr /\u003e * Proficiency in Google Analytics, eCommerce platforms, PPC \u0026 paid social, \u003cbr /\u003eand SEO \u003cbr /\u003eBonus Points\u003cbr /\u003e\u003cbr /\u003e * Experience marketing to International digital software users \u003cbr /\u003e * MySQL query writing for custom reports \u003cbr /\u003e * Experience with the freemium model \u003cbr /\u003eRequirements\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWe love working with each other because we have built a culture that suits us \u003cbr /\u003ewell. We work with a mix of freelancers and traditional employees, and \u003cbr /\u003ecoordinate their talents for large projects. Learn more about how our team \u003cbr /\u003eworks, what traits we look for in new team members andmore here \u003cbr /\u003e\u003chttp://tri.be/careers/\u003e.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003ePay and Perks \u003cbr /\u003e\u003cbr /\u003eThe strategist role at Modern Tribe is a full-time job (35+ hours/weekly). \u003cbr /\u003eFull time salary between$70,000 – $90,000 USD. We may consider a contract role \u003cbr /\u003efor this gig as well.\u003cbr /\u003e\u003cbr /\u003eWork from home, or a coworking space, or join a small crew in the Minneapolis \u003cbr /\u003eoffice. We are entirely location independent (North American hours required).\u003cbr /\u003e\u003cbr /\u003eModern Tribe has been shaped as a lifestyle company: we exist to provide our \u003cbr /\u003eteam members with work that supports the lifestyles they want to see. We offer \u003cbr /\u003econsistency in expectations, payment, support and a flexible work schedule. We \u003cbr /\u003ebelieve in learning from each other and fostering personal growth. You can \u003cbr /\u003eexpect to learn a lot while working with us.\u003cbr /\u003e\u003cbr /\u003eYou also get to come on our awesome annual team trips \u003cbr /\u003e\u003chttp://tri.be/blog/team-trip-2016/\u003e. \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 7:56:25 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 344,
    "source": {},
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28753?r\u003drss2",
    "title": "Hotjar: Product Manager (Europe)",
    "content": "Full-time\u003cbr /\u003e\u003cbr /\u003e(Europe) \u003cbr /\u003e\u003cbr /\u003eNote: Although this is a remote position, we are currently only seeking \u003cbr /\u003ecandidates in timezones between UTC-2 and UTC+4.\u003cbr /\u003e\u003cbr /\u003eWe are looking for a truly ambitious and data-driven Product Manager to join \u003cbr /\u003ethe product team of one of the fastest growing analytics \u0026 feedback startups in \u003cbr /\u003ethe world. As a Product Manager at Hotjar, you will play a key role in our \u003cbr /\u003eproduct development cycle as we work towards achieving our ambitious growth \u003cbr /\u003eplans. You will:\u003cbr /\u003e\u003cbr /\u003e * Collaborate with multiple teams and stakeholders on a regular basis to \u003cbr /\u003egather and compile story requirements according to agile best practises.\u003cbr /\u003e * Work closely with product teams by actively participating in planning \u003cbr /\u003esessions and being the bridge between a team and their product owner.\u003cbr /\u003e * Act as the product UX evangelist to build awareness within the organization \u003cbr /\u003eand encourage user-focused design and development.\u003cbr /\u003e * Regularly speak with our users and customers to truly understand their \u003cbr /\u003eneeds and user product metrics to make data-driven decisions.\u003cbr /\u003e * Work with our Customer Success / Hotjar Hero teams to identify common user \u003cbr /\u003eissues and potential user experience improvements.\u003cbr /\u003e * Maintain our public roadmap and communicate new product releases with our \u003cbr /\u003e200,000+ user base.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eRequirements\u003cbr /\u003e\u003cbr /\u003e * A minimum of 3 years experience working in a product management role for \u003cbr /\u003eSaaS based apps.\u003cbr /\u003e * Data-driven approach to product management.\u003cbr /\u003e * Experience working in an agile environment.\u003cbr /\u003e * A passion for detail and a care for great usability and aesthetics.\u003cbr /\u003e * Excellent self-starter who always thinks MVP first with the ability to work \u003cbr /\u003ein a small, startup-style, agile and fast-paced team.\u003cbr /\u003e * Practical knowledge of how online SaaS businesses work.\u003cbr /\u003e * Fluent in English with excellent written and verbal communication skills.\u003cbr /\u003e * A strong portfolio featuring relevant work examples.\u003cbr /\u003e * Must submit to a background check confidentially processed by our third \u003cbr /\u003eparty.\u003cbr /\u003e * Assets: Development, design or UX experience, experience working embedded \u003cbr /\u003ein a team of developers, experience working remotely.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eJob Perks: Remote and flexible, 40 days paid vacation, €4,000 home office \u003cbr /\u003ebudget which tops up annually, €500 personal development budget annually, \u003cbr /\u003eunlimited learning via Udemy, free Kindle Paperwhite, free Fitbit, 16 weeks \u003cbr /\u003epaid paternity / maternity leave, bi-annual company retreats, and the joy of \u003cbr /\u003eworking with incredibly talented teammates!\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 3:40:16 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 346,
    "source": {},
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28744?r\u003drss2",
    "title": "Grace Hill: Content Marketing Manager",
    "content": "Full-time\u003cbr /\u003e\u003cbr /\u003e(Anywhere) \u003cbr /\u003e\u003cbr /\u003eThe Content Marketing Manager will join a small, fast-paced team showcasing \u003cbr /\u003eGrace Hill’s compliance and training expertise to the property management \u003cbr /\u003eindustry. The ideal candidate delivers a high level of creativity, attention to \u003cbr /\u003edetail, and project management skills. This position requires a mastery of \u003cbr /\u003edifferent writing styles, from AP style to ad copy and from blogs to \u003cbr /\u003eproblem/solution technical writing. Additionally, the person filling this role \u003cbr /\u003edemonstrates flexibility in writing to address a variety of audiences (Grace \u003cbr /\u003eHill learners as well as Institutional Property Managers and key decision \u003cbr /\u003emakers), and strategic understanding of content creation that not only drives \u003cbr /\u003eawareness \u0026 engagement, but measurably moves qualified participants through our \u003cbr /\u003edisparate marketing funnels.\u003cbr /\u003e\u003cbr /\u003eThe Content Marketing Manager must be technically experienced enough in \u003cbr /\u003eWordPress, social listening and analytics platforms, and the mechanics of \u003cbr /\u003ekeywords, inbound links and content discovery to help us react to data and use \u003cbr /\u003eour content tools effectively.\u003cbr /\u003e\u003cbr /\u003eThe Content Marketing Manager will also be responsible for creating and \u003cbr /\u003emanaging internal and external corporate communication for our mid-sized \u003cbr /\u003ecompany.\u003cbr /\u003e\u003cbr /\u003eScope: \u003cbr /\u003e\u003cbr /\u003e *  Key message development, consulting with business sectors and the Grace \u003cbr /\u003eHill product team\u003cbr /\u003e * Effective delivery of key messages\u003cbr /\u003e * Communicates with all levels in the business \u003cbr /\u003e * Researches and analyzes data \u003cbr /\u003e *  Plans and sets priorities, developing processes to reach both output and \u003cbr /\u003eimpact objectives of the business\u003cbr /\u003e *  Writes for a wide variety of audiences\u003cbr /\u003e *  Employs technology to optimize readership and sharing of writing \u003cbr /\u003e *  Influences others (pitching story ideas internally, persuasive writing \u003cbr /\u003eetc.)\u003cbr /\u003e *  Plans for effective work flow with editorial calendar and other tools \u003cbr /\u003e *  Keeps key internal clients informed and consulted in the development \u003cbr /\u003eprocess\u003cbr /\u003eAssists with corporate messaging and tactical decisions\u003cbr /\u003e\u003cbr /\u003eResponsibilities include: \u003cbr /\u003e\u003cbr /\u003e *  Create consistent content to drive leads, subscribers, awareness, and/or \u003cbr /\u003eother important metrics (examples include ebooks, whitepapers, infographics, \u003cbr /\u003eguides, templates, etc.)\u003cbr /\u003e *  Blog on an ongoing basis to support and promote your offers and to attract \u003cbr /\u003esite visitors through search, social media, and email subscribers.\u003cbr /\u003e *  Grow our subscriber base by providing them with regular, helpful content \u003cbr /\u003ethat’s aligned with their needs and interests.\u003cbr /\u003e *  Collaborate with designers, product marketers, sales professionals, and \u003cbr /\u003eexternal influencers and industry experts to produce relevant content that \u003cbr /\u003emeets the needs of both key stakeholders and our audience.\u003cbr /\u003e *  Creates resources to drive leads, subscribers, awareness, and/or other \u003cbr /\u003eimportant measures\u003cbr /\u003e * Supports and promotes business-generating offers (customer messaging, \u003cbr /\u003ecrisis readiness, planning and operations assessments, etc.) to key prospects, \u003cbr /\u003eattracts site visitors through search, social media, and other methods, and \u003cbr /\u003eattracts email subscribers and generates readership and sharing.\u003cbr /\u003e *  Grows our subscriber/follower base by providing them with regular, helpful \u003cbr /\u003econtent that\u0027s aligned with their needs and interests. This involves all \u003cbr /\u003ebusiness sectors and other capabilities areas based on our strategic and \u003cbr /\u003ebusiness plans.\u003cbr /\u003e *  Collaborates with both internal and external resources, business leaders, \u003cbr /\u003eexternal influencers, and industry experts to concept and produce relevant \u003cbr /\u003econtent that meets the needs of our diverse audiences.\u003cbr /\u003e *  Develops creative ideas worth investing time and effort.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eRequirements: \u003cbr /\u003e\u003cbr /\u003e *  BA/BS degree or equivalent working experience \u003cbr /\u003e *  Minimum 5 years of experience \u003cbr /\u003e * Experience producing digital content (blog, SlideShare, LinkedIn, Facebook, \u003cbr /\u003eTwitter, etc.). as well as other non-digital formats\u003cbr /\u003e *  Experience writing for readers in a variety of industries \u003cbr /\u003e *  Experience building audiences through multiple communications mediums \u003cbr /\u003eincluding digital and print\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eCompetencies: \u003cbr /\u003e\u003cbr /\u003e *  Writes for a variety of audiences \u003cbr /\u003e *  Results achieving \u003cbr /\u003e *  Organizes effectively and efficiently \u003cbr /\u003e *  Influences a variety of audiences \u003cbr /\u003e *  Demonstrates business acumen \u003cbr /\u003e *  Detailed and thorough \u003cbr /\u003e *  Analyzes and solves problems \u003cbr /\u003e *  Takes initiative \u003cbr /\u003e *  Promotes teamwork and collaboration \u003cbr /\u003e *  Deadline and output oriented\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Jan 31, 2017 5:04:24 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 406,
    "source": {},
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/28141?r\u003drss2",
    "title": "The Sourcery: Technical Product Manager @Pantheon",
    "content": "Contract\u003cbr /\u003e\u003cbr /\u003e(San Francisco, CA) \u003cbr /\u003e\u003cbr /\u003eTechnical Product Manager\u003cbr /\u003e\u003cbr /\u003eAbout Pantheon:\u003cbr /\u003e\u003cbr /\u003ePantheon powers the world\u0027s professional websites. Our multi-tenant, \u003cbr /\u003econtainer-based cloud platform enables businesses to run mission-critical \u003cbr /\u003eDrupal \u0026 WordPress websites. Developers, Marketers and IT can instantly scale \u003cbr /\u003ein response to unplanned traffic spikes, without upgrading VMs or clusters. \u003cbr /\u003eLarge enterprises use Pantheon, including Intel, Cisco, Arizona State \u003cbr /\u003eUniversity, and the United Nations.\u003cbr /\u003e\u003cbr /\u003eWe value teamwork, humor and hard work balanced with solid social time \u003cbr /\u003etogether. We\u0027re enthusiastic participants in several open-source communities, \u003cbr /\u003eand have real relationships with many of our most active customers and that\u0027s \u003cbr /\u003ewhere you come in.\u003cbr /\u003e\u003cbr /\u003ePantheon is changing the way professional web developers work, which we \u003cbr /\u003ebelieve is critical as billions of people come online and the web is the \u003cbr /\u003ecentral conduit for business, organizations, and individuals to connect. We are \u003cbr /\u003elooking for someone who shares our enthusiasm for the world-changing impact of \u003cbr /\u003ethe internet, along with our internal mission.\u003cbr /\u003e\u003cbr /\u003eThe Role: \u003cbr /\u003e\u003cbr /\u003ePantheon currently operates millions of Linux containers in production, and \u003cbr /\u003eserves billions of pages monthly. We are hiring a technical product manager to \u003cbr /\u003edrive innovation and excellence for our website management platform. This \u003cbr /\u003eperson will work directly with senior engineering resources to deliver customer \u003cbr /\u003ewins and business value through our core technology.\u003cbr /\u003e\u003cbr /\u003eYou will:\u003cbr /\u003e\u003cbr /\u003e * Act as product owner and leader to deliver improvements to the platform and \u003cbr /\u003einfrastructure in an agile environment\u003cbr /\u003e * Work closely with our engineering team and leadership\u003cbr /\u003e * Interact with power-users and agency developers to understand their needs, \u003cbr /\u003eand help represent their mindset and desire internally\u003cbr /\u003e * Craft specifications for product changes — be they written, in concert with \u003cbr /\u003einternal design resources, and via research and proofs of concept. This \u003cbr /\u003eincludes defining success criteria and business value\u003cbr /\u003e * Help engineers understand said requirements, support them through \u003cbr /\u003eexecution, and making sure that success criteria are measured and the value is \u003cbr /\u003edelivered.\u003cbr /\u003e * Assist in ensuring all new features are correctly documented and \u003cbr /\u003esupportable.\u003cbr /\u003e * Be a dedicated expert in infrastructure platform work\u003cbr /\u003e * Support the marketing and sales team on product launches \u003cbr /\u003eOur ideal candidate is:\u003cbr /\u003e\u003cbr /\u003e * Passionate about infrastructure and platforms\u003cbr /\u003e * An experienced product manager with prior success with very technical \u003cbr /\u003eprojects.\u003cbr /\u003e * Has practical experience with cloud infrastructure and services (e.g. AWS \u003cbr /\u003eecosystem, CloudFoundry, Heroku, or Google Compute)\u003cbr /\u003e * Knowledgeable about software and/or web development.\u003cbr /\u003e * Experienced in justifying engineering efforts in terms of business value \u003cbr /\u003eusing data\u003cbr /\u003e * Enthusiastic about and previously successful working with a remote team \u003cbr /\u003e(#RemoteLyfe)\u003cbr /\u003e * Comfortable talking to customers and senior stakeholders, synthesizing \u003cbr /\u003efeedback, and participating in prioritization efforts\u003cbr /\u003e * User-centric, you understand the needs of developers\u003cbr /\u003eBonus points for:\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e * Knowledge of the full web stack: Linux, MySQL, PHP, HTTP, and modern \u003cbr /\u003ebrowser behavior.\u003cbr /\u003e * Architecture and systems design experience that help you write \u003cbr /\u003especifications collaboratively with engineers.\u003cbr /\u003e * Experience interfacing directly with technical customers (CIO, CTO, \u003cbr /\u003edirectors of development or engineering) to gather requirements and architect \u003cbr /\u003esolutions\u003cbr /\u003e * CS degree\u003cbr /\u003ePerks:\u003cbr /\u003e\u003cbr /\u003e * Industry competitive salary.\u003cbr /\u003e * Stock options.\u003cbr /\u003e * Vacation days and time off.\u003cbr /\u003e * Full medical coverage (medical, dental, vision).\u003cbr /\u003e * Top-of-line equipment.\u003cbr /\u003e * Discounts on custom bicycles - the founders of Pantheon also Founded \u003cbr /\u003eMission Bicycle.\u003cbr /\u003e * Dog friendly office.\u003cbr /\u003e * Training stipend to attend industry conferences.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eApply:",
    "urlFetchPending": false,
    "published": "Dec 13, 2016 9:28:15 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 446,
    "source": {},
    "sourceName": "indeed.co.uk-1",
    "url": "http://www.indeed.co.uk/job/Platform-Solution-Architect-Emea-at-Box-in-United-Kingdom-9d5624ef1477944c",
    "title": "Platform Solution Architect EMEA - Box - United Kingdom",
    "content": "\u003c\u003e Platform Solution Architect EMEA \u003cbr /\u003eBox - United Kingdom \u003cbr /\u003eAbout Box: Founded in 2005, Box (NYSE: BOX) is transforming the way people and \u003cbr /\u003eorganizations work so they can achieve their greatest ambitions. As the world\u0027s \u003cbr /\u003eleading enterprise software platform for secure content collaboration, Box \u003cbr /\u003ehelps business of all sizes in every industry securely access and manage their \u003cbr /\u003ecritical information in the cloud. Box is headquartered in Redwood City, CA, \u003cbr /\u003ewith offices across the United States, Europe and Asia. To learn more about \u003cbr /\u003eBox, visit www.box.com. ( http://www.box.com./ )\u003cbr /\u003e\u003cbr /\u003e The Solutions Architect is part of the Customer Success organization and the \u003cbr /\u003eBox Consulting team,and works across Box and with customers to define and build \u003cbr /\u003eout complex solutions. The Solutions Architect is a high impact, high \u003cbr /\u003evisibility role, responsible for ensuring customer satisfaction while promoting \u003cbr /\u003eBox technical and platform solutions and generating consulting revenue.\u003cbr /\u003e\u003cbr /\u003e You will play a critical role in building and sustaining customer and partner \u003cbr /\u003erelationships while driving the adoption of the Box product and platform. The \u003cbr /\u003eSolutions Architect also works closely with sales and field teams to maximise \u003cbr /\u003eopportunities by identifying, developing, designing, building, piecing together \u003cbr /\u003etools, and accelerating and scoping projects.\u003cbr /\u003e\u003cbr /\u003e We are looking for a candidate based in London. \u003cbr /\u003e\u003cbr /\u003eEssential Qualifications:\u003cbr /\u003e\u003cbr /\u003e * Ability to architect and design technical solutions including piecing \u003cbr /\u003etogether the right mix of Box configurations, other SaaS technologies, \u003cbr /\u003eintegration technologies, Box APIs and other partner tools to balance \u003cbr /\u003econfiguration and customization \u003cbr /\u003e * Customer facing- you feel confident presenting detailed technical \u003cbr /\u003einformation to executives and selling ideas. You will be expected to fully \u003cbr /\u003eunderstand and clearly articulate the benefits of BOX to all levels including \u003cbr /\u003eline of business managers, \u0027C\u0027 level executives, Developers, IT Architects and \u003cbr /\u003eCIO’s \u003cbr /\u003e * Outstanding written and verbal communications skills – including the \u003cbr /\u003eability to go a mile deep with technical customer resources or to explain the \u003cbr /\u003emost basic capabilities to a business user \u003cbr /\u003e * Excellent presentation skills including the ability to present both \u003cbr /\u003ebusiness oriented solutions and advanced technical concepts \u003cbr /\u003e * Experience leading and designing technical projects, engaging with, and \u003cbr /\u003edriving change across multiple levels of IT executives \u003cbr /\u003e * Ownership of the development and delivery of differentiated custom solutions\u003cbr /\u003e * Past experience working directly with Sales, Field Teams, Consultants, ISVs \u003cbr /\u003eand System Integrators \u003cbr /\u003e * BS/MS in Computer Science, Engineering, or related technical field or \u003cbr /\u003eequivalent work experience \u003cbr /\u003e * Proven experience in development, consulting, professional services or \u003cbr /\u003esales engineering experience Responsibilities:\u003cbr /\u003e\u003cbr /\u003e * Provide technical and functional expertise during meetings to prospective \u003cbr /\u003eand existing customers \u003cbr /\u003e * Design solution architectures and strategy, and handle in-depth technical \u003cbr /\u003equestions during meetings and sales calls as they relate to implementing Box \u003cbr /\u003esolutions \u003cbr /\u003e * Design and develop project scope documentation, statements of work, \u003cbr /\u003etechnical specifications, and business requirements related to customer \u003cbr /\u003eengagements \u003cbr /\u003e * Collaborate to define functional and technical requirements, and translate \u003cbr /\u003ethem into functional designs, workflows, governance documentation, proposals, \u003cbr /\u003eand project plans \u003cbr /\u003e * Develop a trusted advisor relationship with targeted customers to ensure \u003cbr /\u003ethat all activities are closely aligned with the customers’ business case and \u003cbr /\u003ebusiness strategy \u003cbr /\u003e * Engage in getting Box more deeply deployed and integrated into new industry \u003cbr /\u003eand horizontal use cases. This includes leveraging Box as a platform in line of \u003cbr /\u003ebusiness applications \u003cbr /\u003e * Establish and oversee development and usage of best practices to \u003cbr /\u003econtinually drive incremental value and return on the customers investment \u003cbr /\u003e * Contribute to organizational process improvement, including processes \u003cbr /\u003erelated to developing use cases, knowledge management. Other Key Skills:\u003cbr /\u003e\u003cbr /\u003e * Programming in at least one of the following: Python / Java/ .net / \u003cbr /\u003eVisualforce/ Node.js (MEAN stack) \u003cbr /\u003e * Understanding of REST APIs and JSON \u003cbr /\u003e * Understanding of cloud architecture patterns \u003cbr /\u003e * Ability to distill complex technical solutions and industry solutions into \u003cbr /\u003etheir digestible parts \u003cbr /\u003e * Passion for selling, learning, using evangelizing and explaining new \u003cbr /\u003etechnology \u003cbr /\u003e * A team player that will help mentor teammates who are looking to get to the \u003cbr /\u003enext level \u003cbr /\u003e * Experience working with and deploying SaaS applications \u003cbr /\u003e * Experience supporting remote / field teams \u003cbr /\u003e * Innate initiative to get things done, self-motivation and ability to \u003cbr /\u003edeliver high quality work while at the same time meeting aggressive deadlines \u003cbr /\u003e * Deep understanding of integration technologies  #LI-EMEA\u003cbr /\u003e4 days ago",
    "urlFetchPending": false,
    "published": "Feb 3, 2017 2:00:05 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 474,
    "source": {},
    "sourceName": "smashingmagazine.com",
    "url": "http://jobs.smashingmagazine.com/j/WordPress-Marketing-Developer-Remote-OK/2460618",
    "title": "WordPress Marketing Developer - Remote OK - Single Grain - (Los Angeles, CA) - FullTime",
    "content": "WordPress Marketing Developer - Remote OK\u003cbr /\u003e\u003cbr /\u003e *  Single Grain  \u003c\u003e (Los Angeles, CA) \u003cbr /\u003e * Jan 01, 2017 \u003cbr /\u003e *  Fulltime Job \u003cbr /\u003e * Tweet \u003chttps://twitter.com/share\u003e \u003cbr /\u003eWe’re looking for a full-time WordPress developer to help with work on the two \u003cbr /\u003eproperties we have: Growth Everywhere and Single Grain.\u003cbr /\u003e\u003cbr /\u003eGrowth Everywhere is an entrepreneurial podcast/interview series where I talk \u003cbr /\u003eto world-class entrepreneurs and dissect their marketing funnels and also talk \u003cbr /\u003eabout personal growth.\u003cbr /\u003e\u003cbr /\u003eSingle Grain is a digital marketing agency that has worked with awesome \u003cbr /\u003ecompanies such as Salesforce and Nordstrom.\u003cbr /\u003e\u003cbr /\u003eResponsibilities include, but are not limited to:\u003cbr /\u003e\u003cbr /\u003eAdjusting forms\u003cbr /\u003e\u003cbr /\u003eMoving things around on pages\u003cbr /\u003e\u003cbr /\u003eRunning A/B tests\u003cbr /\u003e\u003cbr /\u003eCoding up landing pages/redesigns\u003cbr /\u003e\u003cbr /\u003eEnsuring our site is as fast as possible\u003cbr /\u003e\u003cbr /\u003eSEO changes\u003cbr /\u003e\u003cbr /\u003eGoogle AMP and Facebook Instant Articles\u003cbr /\u003e\u003cbr /\u003eCreating/implementing simple widgets\u003cbr /\u003e\u003cbr /\u003eWorking with/managing designers\u003cbr /\u003e\u003cbr /\u003eThere will be more advanced work in the future. We have our hands in a lot of \u003cbr /\u003ecookie jars.\u003cbr /\u003e\u003cbr /\u003eAs long as you’re pleasant to work with, fast to respond and a curious person, \u003cbr /\u003eyou’d be the right fit!\u003cbr /\u003e\u003cbr /\u003eMUST HAVES:\u003cbr /\u003e\u003cbr /\u003e- 2+ years experience and strong expertise developing in PHP/WordPress \u003cbr /\u003edevelopment.\u003cbr /\u003e\u003cbr /\u003e- Strong experience with HTML and CSS\u003cbr /\u003e\u003cbr /\u003e- Expertise in developing responsive websites\u003cbr /\u003e\u003cbr /\u003e- Strong experience working with JavaScript/jQuery\u003cbr /\u003e\u003cbr /\u003e- Able to work with virtual teams.- Experience in a dynamic, multi-project \u003cbr /\u003eenvironment.\u003cbr /\u003e\u003cbr /\u003e- Good written and spoken English.\u003cbr /\u003e\u003cbr /\u003e- Understanding of AJAX and experience with the integration of third-party REST\u003cbr /\u003e-style APIs\u003cbr /\u003e\u003cbr /\u003e- Ability to deliver clean code\u003cbr /\u003e\u003cbr /\u003e- An understanding of current SEO best practices\u003cbr /\u003e\u003cbr /\u003eHow to apply\u003cbr /\u003e If you\u0027re interested, please make sure your cover letters includes the \u003cbr /\u003esubject line \u0027developers are cool\u0027 and include links to up to 3 best examples \u003cbr /\u003eof your work, your LinkedIn, your site, Github and anything else that\u0027s \u003cbr /\u003erelevant to eric at singlegrain dot com",
    "urlFetchPending": false,
    "published": "Jan 1, 2017 6:04:22 AM",
    "tags": [
      "TECH2_Programming",
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 535,
    "source": {},
    "sourceName": "jobs.github.com-remote",
    "url": "http://jobs.github.com/positions/9b752790-e663-11e6-9b1f-47fb82f3620e",
    "title": "Full Time: GRC Security Risk Analyst at GitHub in Remote - Canada or the United State",
    "content": "GitHub is seeking a highly experienced information security professional to \u003cbr /\u003ehelp build out the GRC Risk Management function within a young and rapidly \u003cbr /\u003egrowing organization. This is an independent contributor role.\u003cbr /\u003e\u003cbr /\u003eAre you prone to fits of root cause analysis? Do you find yourself always \u003cbr /\u003esearching for areas of weakness and naturally figuring out ways to break \u003cbr /\u003ethings? Do you create flowcharts to help your friends and family understand \u003cbr /\u003eexactly how Thanksgiving dinner should come together and who\u0027s bringing what \u003cbr /\u003esidedish? Can you spot over-engineered solutions from a mile away? Do you \u003cbr /\u003esuffer from compulsive list making? Maybe have a strong forest-from-trees \u003cbr /\u003eproject management perspective, and masterful &quot;Way With the Project Plan&quot;.\u003cbr /\u003e\u003cbr /\u003eHave you already answered the question &quot;Why are we here?&quot; with the GRC Truth, \u003cbr /\u003e&quot;Because Customers.&quot;\u003cbr /\u003e\u003cbr /\u003eThe Security-GRC team applies the GitHub standard to it’s work - transparency, \u003cbr /\u003eiteration, collaboration - we share our work early and often. These cultural \u003cbr /\u003efunctions are critical to GitHub’s success and our ability to work together and \u003cbr /\u003eiterate on ideas to ultimately ship them successfully. And we like to have some \u003cbr /\u003efun along the way.\u003cbr /\u003e\u003cbr /\u003eAs part of the GRC team reporting to the Security-GRC Risk Manager, this is an \u003cbr /\u003eexcellent opportunity for a strong independent contributor to have a hand in \u003cbr /\u003eelevating risk management and security as business and sales enabler as well as \u003cbr /\u003eintegrate a deeper understanding of risk management into the product and \u003cbr /\u003ebusiness space. Primary job duties include:\u003cbr /\u003e\u003cbr /\u003e * Execution day to day of the Information Security Risk Assessment process, \u003cbr /\u003ecovering internal and 3rd party risk. \u003cbr /\u003e * Develop and deliver risk reporting and monitoring processes and management \u003cbr /\u003eof risk tools. \u003cbr /\u003e * Contribute to the establishment of the data governance processes as well as \u003cbr /\u003eother new services out of the GRC team. \u003cbr /\u003e * Support development of processes, controls and continuous compliance \u003cbr /\u003etesting, remediation and risk mitigation solutions to support internal \u003cbr /\u003eprocesses and external audit requirements, and collaborate cross functionally \u003cbr /\u003eto establishing high levels of automated testing and evidence collection. \u003cbr /\u003eOur ideal candidate takes an extremely pragmatic approach to risk management, \u003cbr /\u003efunctions as part of a growing team, and is able to balance the needs of a very \u003cbr /\u003edynamic engineering culture with that of protecting the company and customer \u003cbr /\u003edata. This job is remote, U.S. based and open nation wide, however, \u003cbr /\u003esemi-frequent travel (\u003c15%) to our San Francisco, CA headquarters, Portland , \u003cbr /\u003eOR, or Seattle WA, will be necessary for a remote worker.\u003cbr /\u003e\u003cbr /\u003eRequired experience:\u003cbr /\u003e\u003cbr /\u003e * 6+ years prior work experience in information security risk, audit and/or \u003cbr /\u003ecompliance efforts, with a focus in a technical capacity. \u003cbr /\u003e * Prior technical program management and/or project management experience, \u003cbr /\u003epreferably in a service-oriented organization. \u003cbr /\u003e * Experience standing up and administering applications and tooling. \u003cbr /\u003e * Ability to develop and use metrics to assess and report program performance.\u003cbr /\u003e * Experience with leading or being a subject matter expert in the review of \u003cbr /\u003esystems and solutions as part of a internal risk assessment, procurement \u003cbr /\u003eprocess, or other program. \u003cbr /\u003e * Exposure to PCI, FISMA/FedRAMP, Cloud Security Alliance and the STAR \u003cbr /\u003eprogram including the CCM and CAIQ; and other industry and regulatory \u003cbr /\u003eframeworks. \u003cbr /\u003e * CRISC, CIA, CISA, CISSP, or other relevant independent certification, or \u003cbr /\u003eequivalent education. \u003cbr /\u003e * The ability to partner with and effectively communicate with technical and \u003cbr /\u003enon-technical employees, security, engineering and management staff. \u003cbr /\u003e * Strong asynchronous communication skills - does not need face to face \u003cbr /\u003ecommunications on a daily basis to perform job duties and is comfortable \u003cbr /\u003ecommunicating over media like chat, GitHub, and other online productivity tools \u003cbr /\u003elike Google Docs with email as a secondary method as needed. \u003cbr /\u003e * Must be legally authorized to work in the United States. \u003cbr /\u003ePreferred Attitude\u003cbr /\u003e\u003cbr /\u003e * Confident in ability to say &quot;I don\u0027t know, but I will find out!&quot; \u003cbr /\u003e * Comfortable with the belief of “Code speaks louder than words” and an \u003cbr /\u003eiterative, transparent work environment. \u003cbr /\u003e * Excels at creating proof of concepts, mock ups, and sharing work in draft \u003cbr /\u003estages.\u003cbr /\u003e\u003cbr /\u003e * Extremely team oriented with a desire to dig into problems, answer \u003cbr /\u003equestions, and assist colleagues both within the GRC team and across the \u003cbr /\u003ecompany.\u003cbr /\u003e\u003cbr /\u003e * High comfort level working under ambiguous situations, with natural drive \u003cbr /\u003eto bring clarity using communication and independent research of existing \u003cbr /\u003edocumentation and resources. \u003cbr /\u003e * Compulsive about documentation and organizing content into easily \u003cbr /\u003edigestible formats for the consumption of others. \u003cbr /\u003e * Ability to function as a strong business to technology translator and help \u003cbr /\u003ebridge the business view of compliance and risk management to technical \u003cbr /\u003eengineering and operations staff and vice versa. \u003cbr /\u003e * Capacity to run meetings, take notes, and track concurrent activities \u003cbr /\u003eacross multi-discipline teams \u003cbr /\u003e * Above all, you\u0027ll be getting your hands deep into the work and working with \u003cbr /\u003eproduct, engineering, and security teams to identify new ways to solve problems \u003cbr /\u003eand provide services inside our company. \u003cbr /\u003ePreferred experience:\u003cbr /\u003e\u003cbr /\u003e * Strong information security background in either software development or \u003cbr /\u003esystems operations. \u003cbr /\u003e * Have successfully contributed to regulatory audits through the entire \u003cbr /\u003elifecycle from initial gap-assessment to receiving a favorable report, and the \u003cbr /\u003eability to demonstrate effective auditor or regulatory assessors. \u003cbr /\u003e * Experience supporting on-going compliance monitoring year over year, and \u003cbr /\u003eincluding but not limited to working with independent auditors during \u003cbr /\u003evalidation and compliance testing phases. \u003cbr /\u003e * Ability to write basic scripts to automate audit evidence collection. \u003cbr /\u003e * Exposure to software version control systems/Git and GitHub. \u003cbr /\u003eGitHub is committed to building a diverse workforce and strongly encourages \u003cbr /\u003eapplications from people of color and other groups currently underrepresented \u003cbr /\u003ein tech. We are looking for candidates who:\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eDisplay a strong commitment to building an inclusive tech environment\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eHave demonstrated resilience and resourcefulness both in and outside of the \u003cbr /\u003eworkplace\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCan bring a new perspective based on unique educational, professional, and \u003cbr /\u003elived experiences\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eCan effectively communicate with people from disparate backgrounds\u003cbr /\u003e\u003cbr /\u003e * \u003cbr /\u003eHave experience mentoring/coaching/teaching, particularly in environments with \u003cbr /\u003ediverse students/participants\u003cbr /\u003e\u003cbr /\u003eWHO WE ARE\u003cbr /\u003e\u003cbr /\u003eGitHub is the best place to share code with friends, co-workers, classmates, \u003cbr /\u003eand complete strangers. Over ten million people use GitHub to build amazing \u003cbr /\u003ethings together. With the collaborative features of GitHub.com, our desktop and \u003cbr /\u003emobile apps, and GitHub Enterprise, it has never been easier for individuals \u003cbr /\u003eand teams to write better code, faster.\u003cbr /\u003e\u003cbr /\u003eWe have a lot of exciting things to do, and we’re looking for the right people \u003cbr /\u003eto grow with us!\u003cbr /\u003e\u003cbr /\u003eWHY YOU SHOULD JOIN\u003cbr /\u003e\u003cbr /\u003eWorking at GitHub is, to put it simply, a special slice of the universe. We\u0027re \u003cbr /\u003ecommitted to transparency, collaboration, experimentation, and always staying \u003cbr /\u003eclassy.\u003cbr /\u003e\u003cbr /\u003eBecause of this unique perspective, we\u0027ve established one of the most flexible \u003cbr /\u003eand well designed physical workspaces around that encourages you to work as you \u003cbr /\u003ework best. Right now, over 60% of our employees are based outside of our San \u003cbr /\u003eFrancisco (SOMA) headquarters and work according to how they get their best \u003cbr /\u003estuff done.\u003cbr /\u003e\u003cbr /\u003eEnsuring that GitHubbers are healthy, motivated, focused and creative is how \u003cbr /\u003eGitHub stays awesome. Part of this is ensuring that our benefits* are out of \u003cbr /\u003ethis world.\u003cbr /\u003e\u003cbr /\u003eIn a nutshell, we\u0027ve built and are growing a place where we truly love \u003cbr /\u003eworking, and we think you will too.\u003cbr /\u003e\u003cbr /\u003eGitHub is made up of people with many different backgrounds and lifestyles, \u003cbr /\u003eand we like it that way. We invite applications from people of all stripes. We \u003cbr /\u003edon\u0027t discriminate against employees or applicants based on gender identity or \u003cbr /\u003eexpression, sexual orientation, race, religion, age, national origin, \u003cbr /\u003ecitizenship, disability, pregnancy status, veteran status, or any other \u003cbr /\u003edifferences that people imagine to discriminate against one another. Also, if \u003cbr /\u003eyou have a disability, please let us know if there\u0027s anything we can do to make \u003cbr /\u003ethe interview process better for you; we\u0027re happy to accommodate.\u003cbr /\u003e\u003cbr /\u003ePlease note that benefits vary by country, if you have any questions don\u0027t \u003cbr /\u003ehesitate to ask your recruiter",
    "urlFetchPending": false,
    "published": "Nov 28, 2017 10:43:36 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1112,
    "source": {},
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/52974/payrollfinance-software-business-analyst-at-gage-analytics/",
    "title": "Payroll/Finance Software Business Analyst",
    "content": "Payroll/Finance Software Business Analyst\u003cbr /\u003e\u003cbr /\u003e1, 4+ years Business Analyst experience in HR/Payroll/Finance Software solution. Experienced in producing business function Spec for HR/Payroll/Finance software/business requirements.\u003cbr /\u003e\u003cbr /\u003e2, Switch on and creative. Easy to communicate with and comfortable to write business function spec.\u003cbr /\u003e\u003cbr /\u003e3, Understand global payroll reporting requirements or a quick learner. Understand data analytics.\u003cbr /\u003e\u003cbr /\u003e4, A good leader. Good time management skills and always able to meet deadline.\u003cbr /\u003e\u003cbr /\u003e5, Ideally based in London but not essential. Happy to work in a team as well as independently.\u003cbr /\u003e\u003cbr /\u003e6, Enjoy to be in a small team with a global promising product.\u003cbr /\u003e\u003cbr /\u003e7, Experience working in a start up software company is preferred.\u003cbr /\u003e\u003cbr /\u003e",
    "urlFetchPending": false,
    "published": "Jan 4, 2017 6:32:21 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1218,
    "source": {},
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/53371/product-owner-at-sam-labs/",
    "title": "Product Owner",
    "content": "We\u0027re on the hunt for a passionate Product Owner to join our tight-knit team of developers and designers in an award-winning digital startup in East London. You will help innovate and execute product initiatives across the company.\u003cbr /\u003e\u003cbr /\u003eResponsibilities\u003cbr /\u003eLead the ideation, technical development, and launch of innovative products that blend physical and digital experiences\u003cbr /\u003eEstablish shared vision across the company by building consensus on priorities leading to product execution\u003cbr /\u003eDrive product development with a team of world-class engineers and designers\u003cbr /\u003eIntegrate usability studies, research and market analysis into product requirements to enhance user satisfaction\u003cbr /\u003eDefine and analyse metrics that inform the success of products\u003cbr /\u003eMaximise efficiency in a constantly evolving environment where the process is fluid and creative solutions are the norm\u003cbr /\u003eSkills\u003cbr /\u003e3+ years product management experience\u003cbr /\u003eDelivery of entire products from start to finish\u003cbr /\u003eExceptional communication and presentation skills\u003cbr /\u003eExceptional organisational and analytical skills\u003cbr /\u003eUnderstanding of physical and digital experiences\u003cbr /\u003eExperience designing simple and intuitive user interfaces – ability to create examples through wireframes and mockups\u003cbr /\u003eAbility to thrive in a fast-paced, start-up environment\u003cbr /\u003eBonus Points\u003cbr /\u003eExperience in developing hardware and digital products\u003cbr /\u003eExperience in toys and gaming\u003cbr /\u003e\u003cbr /\u003eSalary\u003cbr /\u003e£40,000 to £45,000 mid level",
    "urlFetchPending": false,
    "published": "Jan 17, 2017 1:26:09 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1266,
    "source": {},
    "sourceName": "jobs.remotive.io",
    "url": "https://zapier.com/jobs/product-engineer-fall-2016/",
    "title": "Product Engineer at Zapier, All, product",
    "content": "Product Engineer - Jobs at Zapier - Zapier  \u003c\u003e \u003cbr /\u003e * Jobs @ Zapier \u003c\u003e \u003cbr /\u003eProduct Engineer\u003cbr /\u003e Jordan Sherer / November 1, 2016 \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eThis specific role has been filled, thank you for your interest!\u003cbr /\u003e\u003cbr /\u003eHi there!\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for a Product Engineer to join the engineering team at Zapier. \u003cbr /\u003eWant to help engineer a simple product that allows anyone to do complex, \u003cbr /\u003eincredible things with the world\u0027s APIs? Then keep reading!\u003cbr /\u003e\u003cbr /\u003eWe know applying for and taking on a new a job at any company requires a leap \u003cbr /\u003eof faith. We want you to feel comfortable and excited to apply at Zapier. To \u003cbr /\u003ehelp share a bit more about life at Zapier, here are a few resources in \u003cbr /\u003eaddition to the job description that can give you an inside look at what life \u003cbr /\u003eis like at Zapier. Hopefully you\u0027ll take the leap of faith and apply.\u003cbr /\u003e\u003cbr /\u003e * Our Commitment to Applicants \u003cbr /\u003e\u003chttps://zapier.com/jobs/our-commitment-to-applicants/\u003e \u003cbr /\u003e * Zapier Guide to Remote Work \u003cbr /\u003e\u003chttps://zapier.com/learn/the-ultimate-guide-to-remote-working/\u003e \u003cbr /\u003e * Zapier Code of Conduct \u003chttps://zapier.com/jobs/zapier-code-of-conduct/\u003e \u003cbr /\u003e * Working on Diversity and Inclusivity \u003cbr /\u003e\u003chttps://zapier.com/jobs/working-on-diversity-and-inclusivity/\u003e \u003cbr /\u003eEven though our job description may seem like we\u0027re looking for a specific \u003cbr /\u003ecandidate, the role inevitably ends up tailored to the person who applies and \u003cbr /\u003ejoins. Regardless of how well you feel you fit our description, we encourage \u003cbr /\u003eyou to apply if:\u003cbr /\u003eYou care deeply about building products that simplify the lives of millions of \u003cbr /\u003epeople through automation. \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eAbout You\u003cbr /\u003e\u003cbr /\u003eYou love building new things. Most of what you’ll do each day is guiding, \u003cbr /\u003ebuilding and maintaining Zapier\u0027s core workflow engine. This is a full-stack \u003cbr /\u003eposition, so you’ll work in the Zapier codebase, backend and frontend tech, our \u003cbr /\u003edeveloper platform and more. Zapier is built on Python, Django, React, node.js \u003cbr /\u003eand AWS. We use modern tools, which means you’ll have the opportunity to work \u003cbr /\u003ewith software like Memcache, RabbitMQ, Zookeeper, Docker, Redis, Jenkins, \u003cbr /\u003ePuppet, Ansible and much more.\u003cbr /\u003e\u003cbr /\u003eYou have worked with teams before on large Python projects. You’re also \u003cbr /\u003efamiliar with frameworks for several languages like React/Backbone.js and/or \u003cbr /\u003eDjango/Flask. You also understand how to design systems in a distributed manner \u003cbr /\u003eacross hundreds (and even thousands) of servers - we deal with 100s of millions \u003cbr /\u003eof API calls every week and growing fast.\u003cbr /\u003e\u003cbr /\u003eYou love shipping to customers. Your engineering projects will focus on \u003cbr /\u003eunderstanding customers\u0027 needs and translating those needs from product specs \u003cbr /\u003einto functional, production ready code. You\u0027ll have the opportunity to ship \u003cbr /\u003ecode daily that will be used by millions of people.\u003cbr /\u003e\u003cbr /\u003eYou love doing things efficiently. At Zapier, the work you do will have a \u003cbr /\u003edisproportionate impact on the business. We believe in systems and processes \u003cbr /\u003ethat let us scale our impact to be larger than ourselves.\u003cbr /\u003e\u003cbr /\u003eYou love learning. Engineering is an ever-evolving world. You enjoy playing \u003cbr /\u003ewith new tech and exploring areas that you might not have experience with yet.\u003cbr /\u003e\u003cbr /\u003eYou love to set your own course. You will have a team meeting and a one-on-one \u003cbr /\u003emeeting every week where you can help direct the course of your projects. \u003cbr /\u003eYou\u0027ll have a direct impact on what we work on next.\u003cbr /\u003e\u003cbr /\u003eAbout Zapier\u003cbr /\u003e\u003cbr /\u003eFor the past four years, Zapier has been helping people across the world \u003cbr /\u003eautomate the boring and tedious parts of their job. We do that by helping \u003cbr /\u003eeveryone connect the web applications they already use and love.\u003cbr /\u003e\u003cbr /\u003eWe believe that there are jobs a computer is best at doing and that there are \u003cbr /\u003ejobs a human is best at doing. We want to empower businesses to create \u003cbr /\u003eprocesses and systems that let computers do what they are best at doing and let \u003cbr /\u003ehumans do what they are best at doing.\u003cbr /\u003e\u003cbr /\u003eWe believe that with the right tools, you can have big impact with less hassle.\u003cbr /\u003e\u003cbr /\u003eWe believe in small teams. Small teams are fast and nimble. Small teams mean \u003cbr /\u003eless bureaucracy and less management and more getting things done.\u003cbr /\u003e\u003cbr /\u003eWe believe that credentials don\u0027t say everything. Our CTO has a finance \u003cbr /\u003edegree. Our CEO has an engineering degree. Our CPO has a mechanical engineering \u003cbr /\u003edegree. What you love doing is way more important than the credentials you have.\u003cbr /\u003e\u003cbr /\u003eWe believe in a safe, welcoming and inclusive environment. All teammates at \u003cbr /\u003eZapier agree to acode of conduct \u003cbr /\u003e\u003chttps://zapier.com/jobs/zapier-code-of-conduct/\u003e.\u003cbr /\u003e\u003cbr /\u003eThings You\u0027ll Do\u003cbr /\u003e\u003cbr /\u003eZapier is a startup, so you\u0027ll likely get experience on many different \u003cbr /\u003eprojects across the organization. That said, here are some things you\u0027ll \u003cbr /\u003eprobably do:\u003cbr /\u003e\u003cbr /\u003e * Help scale a fast growing and unique system - our workflow engine connects \u003cbr /\u003ewith hundreds of APIs across thousands of servers \u003cbr /\u003e * Plan and build product features - directly impact how our customers can be \u003cbr /\u003emore productive \u003cbr /\u003e * Ship to millions of users every day \u003cbr /\u003e * Work with hundreds of different API integrations \u003cbr /\u003e * Give back to the community via open source and blog posts \u003cbr /\u003e * Help customers via support to ensure they have the best experience possible \u003cbr /\u003eThe Whole Package\u003cbr /\u003e\u003cbr /\u003eLocation: Planet Earth\u003cbr /\u003e\u003cbr /\u003eIf you want to work remote, that\u0027s cool. If you want to work near others, \u003cbr /\u003ethat\u0027s cool too. The Zapier Product Engineering team has members across the \u003cbr /\u003eUnited States, Canada, and UK.\u003cbr /\u003e\u003cbr /\u003eCompensation:\u003cbr /\u003e\u003cbr /\u003e * Competitive salary (we don\u0027t use remote as an excuse to pay less) \u003cbr /\u003e * Great healthcare + dental + vision coverage \u003cbr /\u003e * 401k retirement plan with 4% company match \u003cbr /\u003e * Profit sharing \u003cbr /\u003e * 14 weeks paid leave for new parents \u003cbr /\u003e * 2-3 annual company retreats to awesome places \u003cbr /\u003ePick your own equipment. We\u0027ll set you up with whatever laptop + monitor combo \u003cbr /\u003eyou want plus any software you need.\u003cbr /\u003e\u003cbr /\u003eUnlimited vacation policy (plus we insist you take at least 2 weeks off each \u003cbr /\u003eyear—this isn\u0027t a vague policy where unlimited vacation means no vacation).\u003cbr /\u003e\u003cbr /\u003eWork with awesome companies around the world. We partner with the best \u003cbr /\u003esoftware makers in the world and you\u0027ll constantly get to interact with people \u003cbr /\u003efromgreat companies \u003chttps://zapier.com/zapbook/apps\u003e.\u003cbr /\u003e\u003cbr /\u003eSet your own destiny. Grow as an individual and professional.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eHow to Apply\u003cbr /\u003e\u003cbr /\u003eApplying is fairly straightforward, but a bit unique. Creativity is certainly \u003cbr /\u003eencouraged. To jump start the process, we ask a few questions we normally would \u003cbr /\u003eask at the start of an interview. This helps speed up the process and lets us \u003cbr /\u003eget to know you a bit better right out the gate. Make sure to answer each \u003cbr /\u003equestion, and include all requested resources in order for your application to \u003cbr /\u003ebe considered. Have fun with them. :-)\u003cbr /\u003e\u003cbr /\u003eComplete this form with answers to the below questions \u003cbr /\u003e\u003chttps://zapier.wufoo.com/forms/product-engineering-application-at-zapier/\u003e.\u003cbr /\u003e\u003cbr /\u003e * Tell us about your qualifications for this role. \u003cbr /\u003e * Tell us about the most difficult API/library/software bug you\u0027ve squashed \u003cbr /\u003e(we love troubleshooting stories). \u003cbr /\u003e * Tell us about an engineering solution you\u0027ve built that you\u0027re proud of. \u003cbr /\u003e * Tell us about the largest deployment you\u0027ve worked on. \u003cbr /\u003e * Tell us about your favorite technology to work with and why. \u003cbr /\u003e * Tell us about an industry trend you\u0027re excited about. \u003cbr /\u003e * Include links to your portfolio/Github profile or provide us with 500+ LOC \u003cbr /\u003eto help us get a feel for how you write code. \u003cbr /\u003e * Zapier operates at scale and does some pretty interesting things, rank the \u003cbr /\u003efollowing in order from what you\u0027d do best, the first being the best. Disregard \u003cbr /\u003epriority or importance considerations and focus on your skillset and excitement:\u003cbr /\u003ea. build a distributed service that executes 30k untrusted node.js scripts \u003cbr /\u003eevery minute\u003cbr /\u003e b. build a persisted cron-like tool to handle dispatching 100k jobs per minute\u003cbr /\u003e c. create a real-time system to alert us of subtle or unexpected API \u003cbr /\u003emisbehavior\u003cbr /\u003e d. write a user facing tool that can categorize \u0026 diagnose common API issues \u003cbr /\u003eacross 500+ APIs\u003cbr /\u003e e. implement a new feature that spans both frontend/backend code\u003cbr /\u003e f. build a custom database to help aggregate and analyze hundreds of millions \u003cbr /\u003eof events per day\u003cbr /\u003e\u003cbr /\u003e * Optional: Share anonymously \u003cbr /\u003e\u003chttps://zapier.wufoo.com/forms/zv5nyxr0ho7nxi/def/Field208\u003dEngineering\u003e some \u003cbr /\u003edemographic information about yourself to help us better track trends related \u003cbr /\u003eto the backgrounds of candidates interested in working at Zapier in order for \u003cbr /\u003eus to build a team that represents the users at Zapier and the broader world \u003cbr /\u003epopulation. \u003cbr /\u003eFinally, wait for us to reply. We reply to everyone, even if we\u0027re not a good \u003cbr /\u003efit.\u003cbr /\u003e\u003cbr /\u003eApply Here \u003cbr /\u003e\u003chttps://zapier.wufoo.com/forms/product-engineering-application-at-zapier/\u003e\u003cbr /\u003e\u003cbr /\u003eZapier is an equal opportunity employer. We\u0027re excited to work with talented \u003cbr /\u003eand empathetic people no matter their race, color, religion, national origin, \u003cbr /\u003esex, physical or mental disability, or age. Ourcode of conduct \u003cbr /\u003e\u003chttps://zapier.com/jobs/zapier-code-of-conduct/\u003e provides a beacon for the \u003cbr /\u003ekind of company we strive to be and we celebrate our differences because those \u003cbr /\u003edifferences are what allow us to make a product that serves a global user base.\u003cbr /\u003e\u003cbr /\u003eOther Openings\u003cbr /\u003e\u003cbr /\u003eWe\u0027re also hiring for the following roles.\u003cbr /\u003e\u003cbr /\u003e * Design Team Manager \u003c\u003e \u003cbr /\u003e * Data Team Manager \u003c\u003e \u003cbr /\u003e * Customer Champion - Weekend Warrior \u003c\u003e \u003cbr /\u003e * Senior Data Engineer \u003c\u003e \u003cbr /\u003e * Customer Champion Asia / Australia \u003c\u003e \u003cbr /\u003e *  \u003chttps://twitter.com/zapier\u003e \u003cbr /\u003e *  \u003chttp://www.linkedin.com/company/zapier/\u003e \u003cbr /\u003e *  \u003chttps://plus.google.com/105298426206075552003/\u003e \u003cbr /\u003e *  \u003c\u003e Tweet \u003chttps://twitter.com/share\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1275,
    "source": {},
    "sourceName": "jobs.remotive.io",
    "url": "https://angel.co/inspire-beats/jobs/88589-demand-generation-growth",
    "title": "Demand Generation (Growth) at Inspire Beats, Remote, marketing",
    "content": "Demand Generation/Growth job at InspireBeats - AngelList \u003cimg height\u003d&quot;1&quot; \u003cbr /\u003ewidth\u003d&quot;1&quot; style\u003d&quot;display:none&quot; \u003cbr /\u003esrc\u003d&quot;https://www.facebook.com/tr?id\u003d654344241403981\u0026amp;ev\u003dPageView\u0026amp;noscript\u003d1&quot;\u003e\u003cbr /\u003e \u003chttps://angel.co/inspire-beats/jobs\u003e \u003cbr /\u003e *  InspireBeats  \u003c\u003e \u003cbr /\u003e * Product \u003c\u003e \u003cbr /\u003e * Jobs \u003c\u003e \u003cbr /\u003e * Team \u003c\u003e  Applied  \u003c\u003e Apply Now \u003c\u003e  Apply Share \u003c\u003e  \u003cbr /\u003e\u003chttps://angel.co/inspire-beats\u003e \u003cbr /\u003eDemand Generation/Growth at InspireBeats\u003cbr /\u003eSan Francisco, Remote · Full Time  Applied  \u003c\u003e Apply Now \u003c\u003e  Apply \u003cbr /\u003eJob Description\u003cbr /\u003e\u003cbr /\u003eInspireBeats is an all in one lead generation solution for startups and \u003cbr /\u003ebusinesses. We help startups grow their outbound by helping them find quality \u003cbr /\u003eleads, research them, and craft a personalized outreach.\u003cbr /\u003e\u003cbr /\u003eWe are currently seeking an expert demand generation/Growth to help with the \u003cbr /\u003emarketing side of the business.\u003cbr /\u003e\u003cbr /\u003eIdeally you are someone who has past experience in a growth/marketing position \u003cbr /\u003eat a rapid growing startup and have knowledge in the B2B/SaaS space. You should \u003cbr /\u003ebe somebody who\u0027s also familiar with how the lead generation and sales funnel \u003cbr /\u003eprocess works.\u003cbr /\u003e\u003cbr /\u003eRequirements:\u003cbr /\u003e\u003cbr /\u003e- Test test test and test, come up with new ideas all the time and testtt \u003cbr /\u003e- A good writer \u003cbr /\u003e- Good growth hacker \u003cbr /\u003e- Can crush social media \u003cbr /\u003e- Grow our inbound channel like no tomorrow \u003cbr /\u003e- Grow and manage our email list \u003cbr /\u003e- Help out with marketing our side projects \u003cbr /\u003e- Have experience in SaaS, entrepreneurship, growth etc.\u003cbr /\u003e\u003cbr /\u003eThis is a position where you can learn new things everyday and have the \u003cbr /\u003eflexibility to test new things. It is a full time position. We don\u0027t count \u003cbr /\u003ehours, but we do expect you to work hard :)\u003cbr /\u003e\u003cbr /\u003eNo college degree or none of that needed, just need a hustler that\u0027s hungry \u003cbr /\u003eand want to learn.\u003cbr /\u003e\u003cbr /\u003eIf you\u0027re interested, drop me a note with your Linkedin wilson@inspirebeats.com\u003cbr /\u003e \u003cmailto:wilson@inspirebeats.com\u003e\u003cbr /\u003eSkills  Business Development, Social Media Marketing, Content Marketing, \u003cbr /\u003eDemand Generation, Growth Hacking Compensation  $40K – $50K \u003cbr /\u003e 0.5% – 1.0% Visa Sponsorship  Not available  Applied  \u003c\u003e Apply Now \u003c\u003e  Apply \u003cbr /\u003e People also viewed \u003cbr /\u003e \u003chttps://angel.co/reedsy/jobs/138425-content-marketer?src\u003drec\u003e Content \u003cbr /\u003eMarketer \u003chttps://angel.co/reedsy/jobs/138425-content-marketer?src\u003drec\u003e Reedsy \u003cbr /\u003e\u003chttps://angel.co/reedsy/jobs/138425-content-marketer?src\u003drec\u003e London, Western \u003cbr /\u003eEurope, United States  \u003cbr /\u003e\u003chttps://angel.co/viraltag/jobs/49902-growth-hacker-remote?src\u003drec\u003e Growth \u003cbr /\u003eHacker (Remote) \u003cbr /\u003e\u003chttps://angel.co/viraltag/jobs/49902-growth-hacker-remote?src\u003drec\u003e Viraltag \u003cbr /\u003e\u003chttps://angel.co/viraltag/jobs/49902-growth-hacker-remote?src\u003drec\u003e New York \u003cbr /\u003eCity  \u003chttps://angel.co/reedsy/jobs/114022-growth-marketer?src\u003drec\u003e Growth \u003cbr /\u003eMarketer \u003chttps://angel.co/reedsy/jobs/114022-growth-marketer?src\u003drec\u003e Reedsy \u003cbr /\u003e\u003chttps://angel.co/reedsy/jobs/114022-growth-marketer?src\u003drec\u003e New York City, \u003cbr /\u003eUnited States, Western Europe  \u003cbr /\u003e\u003chttps://angel.co/knack/jobs/63239-marketing-growth-hacker?src\u003drec\u003e \u003cbr /\u003eMarketing/Growth Hacker \u003cbr /\u003e\u003chttps://angel.co/knack/jobs/63239-marketing-growth-hacker?src\u003drec\u003e Knack \u003cbr /\u003e\u003chttps://angel.co/knack/jobs/63239-marketing-growth-hacker?src\u003drec\u003e Earth  \u003cbr /\u003e\u003chttps://angel.co/interaction-design-foundation-3/jobs/172197-marketing-specialist?src\u003drec\u003e\u003cbr /\u003eMarketing Specialist \u003cbr /\u003e\u003chttps://angel.co/interaction-design-foundation-3/jobs/172197-marketing-specialist?src\u003drec\u003e\u003cbr /\u003eInteraction Design Foundation \u003cbr /\u003e\u003chttps://angel.co/interaction-design-foundation-3/jobs/172197-marketing-specialist?src\u003drec\u003e\u003cbr /\u003eRemote, Oregon  \u003cbr /\u003e\u003chttps://angel.co/zazoapp/jobs/106228-growth-hacker-remote-job?src\u003drec\u003e Growth \u003cbr /\u003eHacker (Remote Job) \u003cbr /\u003e\u003chttps://angel.co/zazoapp/jobs/106228-growth-hacker-remote-job?src\u003drec\u003e Zazo \u003cbr /\u003e\u003chttps://angel.co/zazoapp/jobs/106228-growth-hacker-remote-job?src\u003drec\u003e San \u003cbr /\u003eFrancisco  \u003cbr /\u003e\u003chttps://angel.co/inspire-beats/jobs/89651-sales-development-rep-sdr?src\u003drec\u003e \u003cbr /\u003eSales Development Rep (SDR) \u003cbr /\u003e\u003chttps://angel.co/inspire-beats/jobs/89651-sales-development-rep-sdr?src\u003drec\u003e \u003cbr /\u003eInspireBeats \u003cbr /\u003e\u003chttps://angel.co/inspire-beats/jobs/89651-sales-development-rep-sdr?src\u003drec\u003e \u003cbr /\u003eSan Francisco  \u003cbr /\u003e\u003chttps://angel.co/studysoup/jobs/169167-head-of-growth-and-partnership?src\u003drec\u003e \u003cbr /\u003eHead of Growth and Partnership \u003cbr /\u003e\u003chttps://angel.co/studysoup/jobs/169167-head-of-growth-and-partnership?src\u003drec\u003e \u003cbr /\u003eStudySoup \u003cbr /\u003e\u003chttps://angel.co/studysoup/jobs/169167-head-of-growth-and-partnership?src\u003drec\u003e \u003cbr /\u003eRemote, Oregon  \u003cbr /\u003e\u003chttps://angel.co/freebusy/jobs/58972-chief-growth-officer?src\u003drec\u003e Chief \u003cbr /\u003eGrowth Officer \u003cbr /\u003e\u003chttps://angel.co/freebusy/jobs/58972-chief-growth-officer?src\u003drec\u003e FreeBusy \u003cbr /\u003e\u003chttps://angel.co/freebusy/jobs/58972-chief-growth-officer?src\u003drec\u003e San \u003cbr /\u003eFrancisco \u003cbr /\u003e What We\u0027re Building \u003cbr /\u003e\u003cbr /\u003eInspireBeats is a lead generation and prospecting solution that helps startups \u003cbr /\u003egenerated target and qualified leads. We then analyze, monitor, and research \u003cbr /\u003einto every single lead and craft a personalized reach out for you based on our \u003cbr /\u003eresearch. Interested leads are then sent directly to your inbox for you to \u003cbr /\u003eclose the deal on!\u003cbr /\u003e Hiring in San Francisco, Earth  1-10 Employees Lead Generation \u003cbr /\u003e\u003chttps://angel.co/lead-generation\u003e, Sales and Marketing \u003cbr /\u003e\u003chttps://angel.co/sales-and-marketing-1\u003e, Sales Automation \u003cbr /\u003e\u003chttps://angel.co/sales-automation\u003e, Lead Qaulification \u003cbr /\u003e\u003chttps://angel.co/lead-qaulification\u003e @inspirebeats \u003cbr /\u003e\u003chttp://twitter.com/inspirebeats\u003e inspirebeats.com \u003chttp://inspirebeats.com\u003e \u003cbr /\u003e Other Positions \u003cbr /\u003e\u003cbr /\u003e *  Marketing Marketing Intern \u003cbr /\u003e\u003chttps://angel.co/inspire-beats/jobs/108414-marketing-intern\u003e  Earth · \u003cbr /\u003eInternship  ·  No Salary · No Equity  Applied  \u003c\u003e Apply \u003c\u003e  Apply \u003cbr /\u003e *  Operations Customer Success Intern \u003cbr /\u003e\u003chttps://angel.co/inspire-beats/jobs/90352-customer-success-intern\u003e  San \u003cbr /\u003eFrancisco · Internship  ·  $5K – $10K · 0.0% – 0.1%  Applied  \u003c\u003e Apply \u003c\u003e  Apply\u003cbr /\u003e *  Sales Sales Development Rep (SDR) \u003cbr /\u003e\u003chttps://angel.co/inspire-beats/jobs/89651-sales-development-rep-sdr\u003e  San \u003cbr /\u003eFrancisco · Full Time  ·  $40K – $50K · 0.5% – 1.0%  Applied  \u003c\u003e Apply \u003c\u003e  Apply\u003cbr /\u003e Team \u003cbr /\u003e \u003chttps://angel.co/kevinchan1\u003e Kevin Chan \u003chttps://angel.co/kevinchan1\u003e ,  \u003cbr /\u003eFounder@InspireBeats \u003chttps://angel.co/inspire-beats\u003e • Worked at @Yahoo \u003cbr /\u003e\u003chttps://angel.co/yahoo\u003e • Studied CS at @University of California, Davis \u003cbr /\u003e\u003chttps://angel.co/university-of-california-davis\u003e  \u003cbr /\u003e\u003chttps://angel.co/wilsonpeng8\u003e Wilson Peng \u003chttps://angel.co/wilsonpeng8\u003e ,  \u003cbr /\u003eEntrepreneur and founder of YesInsights :)  \u003chttps://angel.co/kelly-willard\u003e \u003cbr /\u003eKelly Willard \u003chttps://angel.co/kelly-willard\u003e ,  Community Manager Intern @\u003cbr /\u003eInspire \u003chttps://angel.co/inspire\u003e Beats • Worked at @ZICO Beverages \u003cbr /\u003e\u003chttps://angel.co/zico-beverages\u003e • Studied at @ College of San Mateo \u003cbr /\u003e\u003chttps://angel.co/college-of-san-mateo\u003e, @City College of San Francisco \u003cbr /\u003e\u003chttps://angel.co/city-college-of-san-francisco-1\u003e  InspireBeats is one of \u003cbr /\u003e23,801 startups hiring on AngelList Browse All Startup Jobs \u003c\u003e Post a Job \u003cbr /\u003e\u003chttps://angel.co/recruiting/signup?src\u003djob-showcase\u003e Help \u003c\u003e · Terms \u003c\u003e · \u003cbr /\u003eProblem?Report this company \u003c\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1283,
    "source": {},
    "sourceName": "jobs.remotive.io",
    "url": "http://www.aha.io/company/careers/current-openings",
    "title": "Digital Marketing Manager  at Aha, Anywhere (U.S.), marketing",
    "content": "Current Job Openings | Aha!  \u003c\u003e  Log in \u003chttps://secure.aha.io/session/new\u003e  \u003c\u003e \u003cbr /\u003e * PRODUCT \u003c\u003e \u003cbr /\u003e * Benefits \u003c\u003e \u003cbr /\u003e * Features \u003c\u003e \u003cbr /\u003e * Integrations \u003c\u003e \u003cbr /\u003e * Where Aha! fits \u003c\u003e \u003cbr /\u003e * ROADMAPS \u003c\u003e \u003cbr /\u003e * Product roadmap \u003c\u003e \u003cbr /\u003e * Technology roadmap \u003c\u003e \u003cbr /\u003e * Consulting roadmap \u003c\u003e \u003cbr /\u003e * Manufacturing roadmap \u003c\u003e \u003cbr /\u003e * Marketing roadmap \u003c\u003e \u003cbr /\u003e * PRICING \u003c\u003e \u003cbr /\u003e * CUSTOMERS \u003c\u003e \u003cbr /\u003e * Success stories \u003c\u003e \u003cbr /\u003e * Love \u003c\u003e \u003cbr /\u003e * CAREERS \u003c\u003e \u003cbr /\u003e * Love your job \u003c\u003e \u003cbr /\u003e * Culture \u003c\u003e \u003cbr /\u003e * Current openings \u003c\u003e \u003cbr /\u003e * About us \u003c\u003e \u003cbr /\u003e * Company history \u003c\u003e \u003cbr /\u003e * Responsive method \u003c\u003e \u003cbr /\u003e * Blog \u003chttp://blog.aha.io/\u003e \u003cbr /\u003e * Forum \u003chttps://www.roadmap.com/?ref\u003dnav\u003e \u003cbr /\u003e * Ideas \u003chttps://big.ideas.aha.io/\u003e \u003cbr /\u003e * Support \u003chttp://support.aha.io/\u003e Start a FREE Trial \u003c\u003e  Log in \u003cbr /\u003e\u003chttps://secure.aha.io/session/new\u003e \u003cbr /\u003eWork from anywhere and be happy\u003cbr /\u003e\u003cbr /\u003eIf this is what you want, please view our open positions below\u003cbr /\u003eAll Departments Customer Success Engineering Marketing Operations People \u003cbr /\u003eSuccess Product All Locations Silicon Valley United States United Kingdom \u003cbr /\u003eAs a member of the Aha! team, you will jump into a breakthrough and profitable \u003cbr /\u003esoftware company. We are changing the way the world\u0027s best known companies \u003cbr /\u003einnovate and build great products. It has been an amazing journey and we have \u003cbr /\u003ebeen humbled by our rapid growth. Apply for one of the roles below if you want \u003cbr /\u003eto join us on this adventure.\u003cbr /\u003e\u003cbr /\u003eCustomer Success\u003cbr /\u003e\u003cbr /\u003e * Customer Success Manager (product manager exp. required) Anywhere in the \u003cbr /\u003eUnited States  \u003c\u003e \u003cbr /\u003e * Customer Success Manager (product manager exp. required) Anywhere in the \u003cbr /\u003eUnited Kingdom  \u003c\u003e \u003cbr /\u003e * Customer Success Sr. Manager (product manager exp. required) Anywhere in \u003cbr /\u003ethe United States  \u003c\u003e \u003cbr /\u003e * Customer Success Sr. Manager (product manager exp. required) Anywhere in \u003cbr /\u003ethe United Kingdom  \u003c\u003e \u003cbr /\u003e * Customer Success Specialist (product manager exp. required) Anywhere in the \u003cbr /\u003eUnited States  \u003c\u003e \u003cbr /\u003eEngineering\u003cbr /\u003e\u003cbr /\u003e * Lead Engineer Anywhere in the United States  \u003c\u003e \u003cbr /\u003e * Sr. Rails Engineer Anywhere in the United States  \u003c\u003e \u003cbr /\u003e * Rails Engineer Anywhere in the United States  \u003c\u003e \u003cbr /\u003e * Front End Developer Anywhere in the United States  \u003c\u003e \u003cbr /\u003eMarketing\u003cbr /\u003e\u003cbr /\u003e * Copy Editor Anywhere in the United States  \u003c\u003e \u003cbr /\u003e * Marketing Analytics Manager Anywhere in the United States  \u003c\u003e \u003cbr /\u003e * Sr. Digital Marketing Manager Anywhere in the United States  \u003c\u003e \u003cbr /\u003e * Sr. Product Marketing Manager Anywhere in the United States  \u003c\u003e \u003cbr /\u003e * Sr. Writer Anywhere in the United States  \u003c\u003e \u003cbr /\u003e * Communications Manager Anywhere in the United States  \u003c\u003e \u003cbr /\u003eOperations\u003cbr /\u003e\u003cbr /\u003e * Accounting Specialist Anywhere in the greater Silicon Valley area  \u003c\u003e \u003cbr /\u003ePeople Success\u003cbr /\u003e\u003cbr /\u003e * People Success Manager [Recruiter] Anywhere in the United States  \u003c\u003e \u003cbr /\u003e * People Success Specialist [Recruiter] Anywhere in the United States  \u003c\u003e \u003cbr /\u003eProduct\u003cbr /\u003e\u003cbr /\u003e * Graphic Designer Anywhere in the United States  \u003c\u003e \u003cbr /\u003e * UX Designer Anywhere in the United States  \u003c\u003e \u003cbr /\u003eDiversity\u003cbr /\u003e\u003cbr /\u003eWe are committed to hiring, promoting, and compensating employees based on \u003cbr /\u003etheir qualifications and demonstrated ability to perform job responsibilities. \u003cbr /\u003eAs an equal opportunity employer, Aha! welcomes all employees and applicants, \u003cbr /\u003ewithout regard to age, race, color, national origin, physical or mental \u003cbr /\u003edisability, gender, religion, sexual orientation, gender identity, marital or \u003cbr /\u003eveteran status, condition of pregnancy, or any other legally protected \u003cbr /\u003echaracteristic.\u003cbr /\u003e\u003cbr /\u003e One tool to manage your entire product portfolio.\u003cbr /\u003e Lead product like you always wanted and be happy. \u003cbr /\u003eFree Trial \u003c\u003e \u003cbr /\u003e * Product \u003c\u003e \u003cbr /\u003e * Benefits \u003c\u003e \u003cbr /\u003e * Features \u003c\u003e \u003cbr /\u003e * Pricing \u003c\u003e \u003cbr /\u003e * Security \u003c\u003e \u003cbr /\u003e * Roadmapping software \u003c\u003e \u003cbr /\u003e * Where Aha! fits \u003c\u003e \u003cbr /\u003e * Product lovability tool \u003c\u003e \u003cbr /\u003e * Product management guide \u003c\u003e \u003cbr /\u003e * Careers \u003c\u003e \u003cbr /\u003e * About \u003c\u003e \u003cbr /\u003e * History \u003c\u003e \u003cbr /\u003e * Support \u003chttp://support.aha.io/\u003e \u003cbr /\u003e * Blog \u003chttp://blog.aha.io/\u003e \u003cbr /\u003eCONTACT US\u003cbr /\u003e\u003cbr /\u003e * Contact form \u003c\u003e \u003cbr /\u003e *   support@aha.io \u003cmailto:support@aha.io\u003e \u003cbr /\u003e *   1-888-926-2240 \u003c\u003e \u003cbr /\u003eCONNECT\u003cbr /\u003eFollow @aha_io \u003chttps://twitter.com/aha_io\u003e © 2017 Aha! Labs Inc. All rights \u003cbr /\u003ereserved Developer API \u003c\u003e  /  Privacy policy \u003c\u003e  /  Terms of service \u003c\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_product",
      "REMOTE2_locals-only"
    ]
  },
  {
    "id": 1286,
    "source": {},
    "sourceName": "jobs.remotive.io",
    "url": "http://www.junglescout.com/jobs/",
    "title": "Product/UX Manager at Jungle Scout, Digital Nomad, marketing",
    "content": "Jobs | Jungle Scout: Amazon Product Research Made Easy \u003cbr /\u003eJungle Scout: Amazon Product Research Made Easy\u003cbr /\u003e \u003chttps://www.junglescout.com/\u003e Navigation  \u003c\u003e \u003cbr /\u003e * Products \u003c\u003e \u003cbr /\u003e * The Web App \u003chttps://www.junglescout.com/the-web-app/\u003e \u003cbr /\u003e * The Chrome Extension \u003chttps://www.junglescout.com/the-chrome-extension/\u003e \u003cbr /\u003e * FREE RESOURCES \u003cbr /\u003e\u003chttps://www.junglescout.com/amazon-product-research-resources/\u003e \u003cbr /\u003e * Blog \u003chttps://www.junglescout.com/blog/\u003e \u003cbr /\u003e * About Us \u003chttps://www.junglescout.com/aboutus/\u003e \u003cbr /\u003e * LOG IN \u003chttps://members.junglescout.com/\u003e \u003cbr /\u003e * SIGN UP \u003chttps://www.junglescout.com/#pricingtable\u003e \u003cbr /\u003e * Products \u003c\u003e \u003cbr /\u003e * The Web App \u003chttps://www.junglescout.com/the-web-app/\u003e \u003cbr /\u003e * The Chrome Extension \u003chttps://www.junglescout.com/the-chrome-extension/\u003e \u003cbr /\u003e * FREE RESOURCES \u003cbr /\u003e\u003chttps://www.junglescout.com/amazon-product-research-resources/\u003e \u003cbr /\u003e * Blog \u003chttps://www.junglescout.com/blog/\u003e \u003cbr /\u003e * About Us \u003chttps://www.junglescout.com/aboutus/\u003e \u003cbr /\u003e * LOG IN \u003chttps://members.junglescout.com/\u003e \u003cbr /\u003e * SIGN UP \u003chttps://www.junglescout.com/#pricingtable\u003e \u003cbr /\u003eWe started Jungle Scout to help people create their own freedom, in regards to \u003cbr /\u003etime, money, and location.\u003cbr /\u003e We have helped thousands of people launch successful businesses on Amazon,\u003cbr /\u003e and we are just getting started. \u003cbr /\u003e\u003cbr /\u003eJoin the movement to empower entrepreneurs around the world. \u003cbr /\u003e\u003cbr /\u003eWhy Is Jungle Scout A Special Place To Work?\u003cbr /\u003e\u003cbr /\u003eA Top Notch Team:\u003cbr /\u003e\u003cbr /\u003eWe like to think that Jungle Scout is the industry-leading product research \u003cbr /\u003etool for a reason #humblebrag. We focus on excellence in every aspect of the \u003cbr /\u003ecompany, including our people!\u003cbr /\u003e\u003cbr /\u003e100% Remote:\u003cbr /\u003e\u003cbr /\u003eWork when, and where, suits you best. Our team is distributed across the \u003cbr /\u003eglobe. Literally.\u003cbr /\u003e\u003cbr /\u003eCompetitive Salaries: \u003cbr /\u003e\u003cbr /\u003eWhile we do have fun, we are a serious business. Our compensation packages are \u003cbr /\u003eamong the most competitive offerings you’ll find.\u003cbr /\u003e\u003cbr /\u003eTeam Meetups:\u003cbr /\u003e\u003cbr /\u003eWhether Bali, Rio de Janiero, Vietnam, or Whistler, we have team meetups \u003cbr /\u003earound the world to work together, plan future products, make videos, and have \u003cbr /\u003esome fun too!\u003cbr /\u003eAmazon FBA Rockstar \u003c\u003eThis particular position actually isn’t working for the \u003cbr /\u003eJungle Scout software company but instead, our founder Greg Mercer’s FBA \u003cbr /\u003ebusiness.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eFull time, 100% remote. Candidates living outside of the US are encouraged to \u003cbr /\u003eapply.\u003cbr /\u003e\u003cbr /\u003eThis is an open-ended type role and your responsibilities will likely change \u003cbr /\u003eover time. You need to be a quick learner and very passionate about our \u003cbr /\u003ecustomer’s happiness.\u003cbr /\u003e\u003cbr /\u003eMajor Responsibilities:\u003cbr /\u003e – Administrative type tasks (all those little things – brand registry, \u003cbr /\u003edealing with seller central support, etc.)\u003cbr /\u003e – Obsessed with customer support! You’ll be in charge of all support tickets \u003cbr /\u003efrom the Amazon customers.\u003cbr /\u003e – Coordinate between trade partners and contractors. There are a lot of \u003cbr /\u003emoving parts with the supply chain, you’ll need to be great at delegating tasks \u003cbr /\u003eand very organized to manage these tasks.\u003cbr /\u003e – Help the business thrive and grow! At the end of the day, you need to be \u003cbr /\u003epassionate about making sure the business is operating smoothly and growing.\u003cbr /\u003e\u003cbr /\u003eSkills Required:\u003cbr /\u003e – Ability to push yourself to work hard with minimum supervision. This is a \u003cbr /\u003eremote position so there is nobody watching over your shoulder to make sure \u003cbr /\u003eyou’re working – you need to be self motivated!\u003cbr /\u003e – Very detail oriented and organized. You’ll likely be completing dozens \u003cbr /\u003e(maybe hundreds!) of small tasks everyday.\u003cbr /\u003e – Solid understanding of the basics of selling on Amazon. This area can be \u003cbr /\u003etaught is you’re very driven and check the rest of the boxes.\u003cbr /\u003e – Exceptional communication skills, both verbal, on video and in writing \u003cbr /\u003e\u003cbr /\u003eThis is a fantastic position for someone who is knowledgeable about Amazon and \u003cbr /\u003ewants to be part of an exciting, fast growing physical products company. You’ll \u003cbr /\u003ebe working with two other super fun individuals on a daily basis.\u003cbr /\u003e\u003cbr /\u003eCustomer Success Position \u003c\u003eThis position is for a person who is knowledgeable \u003cbr /\u003eabout selling on Amazon and also loves to help people.  Amazon selling \u003cbr /\u003eknowledge is essential; already having a product on Amazon is a bonus.  \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eFull-time, remote position\u003cbr /\u003e\u003cbr /\u003eThe perfect candidate loves to be a part of a team, works fast, dominates the \u003cbr /\u003ekeyboard, understands the selling on Amazon world and has suggestions on how \u003cbr /\u003eJungle Scout can grow its customer base.  We want to continue to wow our users \u003cbr /\u003eand are interested in help achieving this goal as well as setting higher \u003cbr /\u003estandard for the industry.  \u003cbr /\u003e\u003cbr /\u003eMajor Responsibilities:\u003cbr /\u003e\u003cbr /\u003e * Obsessed with customer support.  You will be joining the customer success \u003cbr /\u003eteam to help with customer inquiries and to help answer selling on Amazon \u003cbr /\u003equestions.   \u003cbr /\u003e * Phone calls and video calls with customers.  You must have great internet, \u003cbr /\u003ea professional working environment and comfortable speaking with Amazon \u003cbr /\u003esellers.   \u003cbr /\u003e * Weekly webinars.  Again having a solid work environment is essential.  You \u003cbr /\u003ewill be jumping on quick webinars with our new users weekly to help answer any \u003cbr /\u003equestions they may have. \u003cbr /\u003e * Help us wow and grow our customer base.  You will be empowered to try new \u003cbr /\u003eideas, bring your own ideas to the team as well as being passionate about \u003cbr /\u003eJungle Scout.   \u003cbr /\u003eSkills Required:\u003cbr /\u003e\u003cbr /\u003e * Ability to push yourself and work hard with minimum supervision.  Being a \u003cbr /\u003eremote company we are very team focused but you will not have people looking \u003cbr /\u003eover your shoulder to ensure you are working.  You need to be self-motivated. \u003cbr /\u003e * Detail oriented and organized.  You will be responsible for keeping track \u003cbr /\u003eof trends in the customer success field as well as reporting those trends to \u003cbr /\u003ethe team.  We want you to be completely in-tune with our customer base. \u003cbr /\u003e * Understanding of selling on Amazon.  You need to have experience working to \u003cbr /\u003eget a product launched, working with Amazon with issues, and just in general \u003cbr /\u003eunderstand what our customers are experiencing. \u003cbr /\u003e * Exceptional people skills and communication skills.  You will be working \u003cbr /\u003edirectly with our customer base and need to be able to connect with them.  You \u003cbr /\u003ewill need to communicate verbally, on video and in writing. \u003cbr /\u003eThis is the perfect position for someone who is knowledgeable about Amazon, \u003cbr /\u003eloves helping and educating people, is team oriented, self-motivated and \u003cbr /\u003epositive person.  You will be joining the Jungle Scout team and working \u003cbr /\u003edirectly with our customer success team.  It is a fast paced, exciting and fun \u003cbr /\u003eenvironment.  \u003cbr /\u003e\u003cbr /\u003e \u003cbr /\u003e\u003cbr /\u003eJungle Scout is growing quickly,\u003cbr /\u003e and always on the look out for All Star talent.\u003cbr /\u003e\u003cbr /\u003eIS THAT YOU?\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eWhatever your talent is, we’d love to hear from you.\u003cbr /\u003e We just have a few questions below to help us get to know you a bit.\u003cbr /\u003eAPPLY HERE \u003cbr /\u003e\u003chttps://docs.google.com/forms/d/e/1FAIpQLSdklPwdjCBfj6IR7fxOaQIf-MQzKXBQCP75YQe5HwcGVsvxUA/viewform\u003e\u003cbr /\u003eOUR OTHER AMAZING APPS:\u003cbr /\u003e \u003cbr /\u003e\u003chttps://jumpsend.com/?utm_source\u003djunglescout\u0026utm_medium\u003dfooter\u0026utm_campaign\u003djsfooter\u003e\u003cbr /\u003e \u003cbr /\u003e\u003chttps://fetcher.com/?utm_source\u003djunglescout\u0026utm_medium\u003dfooter\u0026utm_campaign\u003djsfooter\u003e\u003cbr /\u003e \u003cbr /\u003e\u003chttps://splitly.com/?utm_source\u003djunglescout\u0026utm_medium\u003dfooter\u0026utm_campaign\u003djsfooter\u003e\u003cbr /\u003e * Jungle Scout University \u003cbr /\u003e\u003chttps://www.junglescout.com/amazon-product-research-resources/\u003e \u003cbr /\u003e * Blog \u003chttps://junglescout.com/blog/\u003e \u003cbr /\u003e * Product Selection Course \u003cbr /\u003e\u003chttps://www.junglescout.com/selecting-a-profitable-product/\u003e \u003cbr /\u003e * Jungle Stix Case Study \u003chttps://junglescout.com/collaborative-launch/\u003e \u003cbr /\u003e * Sales Estimator \u003chttps://junglescout.com/estimator/\u003e \u003cbr /\u003e * Rank Table \u003chttps://junglescout.com/ranktable/\u003e \u003cbr /\u003e * Jungle Scholar \u003chttps://www.junglescout.com/jungle-scholar/\u003e \u003cbr /\u003e * Veteran Discount \u003chttps://www.junglescout.com/veteran-discount/\u003e \u003cbr /\u003e * Support \u003chttp://helpdesk.junglescout.com/\u003e \u003cbr /\u003e * About Us \u003chttps://junglescout.com/aboutus/\u003e \u003cbr /\u003e * Careers \u003chttps://junglescout.com/jobs/\u003e \u003cbr /\u003e * Terms of Use \u003chttps://junglescout.com/termsofuse/\u003e \u003cbr /\u003e * Privacy Policy \u003chttps://junglescout.com/privacy/\u003e \u003cbr /\u003e * Affiliate Program \u003chttp://affiliate.junglescout.com/\u003e \u003cbr /\u003e \u003chttps://www.junglescout.com/international/\u003e\u003cbr /\u003e\u003cbr /\u003eInterested in Jungle Scout in Your Country? \u003cbr /\u003e\u003chttps://www.junglescout.com/international/\u003e\u003cbr /\u003e \u003chttps://www.facebook.com/amazonjunglescout/\u003e \u003cbr /\u003e\u003chttps://twitter.com/junglescout\u003e \u003cbr /\u003e\u003chttps://www.linkedin.com/company/6608249?trk\u003dtyah\u0026trkInfo\u003dclickedVertical%3Acompany%2CclickedEntityId%3A6608249%2Cidx%3A2-1-2%2CtarId%3A1469809982331%2Ctas%3Ajungle%20scout\u003e\u003cbr /\u003e \u003chttps://www.youtube.com/channel/UC0iJ3ldvDUGiUPfGiiifzVQ\u003e  © Jungle Scout 2017\u003cbr /\u003e Disclaimer: Jungle Scout is in no way affiliated with Amazon or any of it\u0027s \u003cbr /\u003esubsidiaries. \u003cbr /\u003eLet\u0027s Be Friends!\u003cbr /\u003eStay in touch with latest news, feature releases, webinars and updates! Email  \u003cbr /\u003ewe value your privacy",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1299,
    "source": {},
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13542612",
    "title": "Nonprofit/Church Technology: Freelance Sales (Remote / Anywhere)",
    "content": "Nonprofit/Church Technology: Freelance Sales (Remote / Anywhere)\u003cbr /\u003eOur calling is to be behind the scenes, using technology to enhance nonprofit \u003cbr /\u003eimpact and sustainability, as well as reducing the distractions and stress on \u003cbr /\u003eleaders.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re in need of freelance sales help in 2017! We recently launched a product \u003cbr /\u003e(Donation Spring -https://www.donationspring.com \u003cbr /\u003e\u003chttps://www.donationspring.com\u003e) and plan to aggressively promote it after the \u003cbr /\u003enew year. Additionally, we continue to pitch our overall consulting and \u003cbr /\u003edevelopment services.\u003cbr /\u003e\u003cbr /\u003eWhat I\u0027m looking for:\u003cbr /\u003e\u003cbr /\u003e- The scope is primarily to find prospects, have initial conversations, \u003cbr /\u003eidentify needs, and provide them as a pre-qualified prospect. - Someone with \u003cbr /\u003esales/marketing chops. A sales or account exec history is helpful, but not a \u003cbr /\u003erequirement -- we\u0027ll consider anyone with relevant backgrounds and \u003cbr /\u003epersonality/passion alignment. - Experience/familiarity with the nonprofit and \u003cbr /\u003echurch industry. - Major bonus points to bringing an existing network of \u003cbr /\u003enonprofit/church prospects. - Located anywhere in the US. The more \u003cbr /\u003egeographically diverse our team can be, the better. - Freelance contract, \u003cbr /\u003epart-time, at your own pace. Pay is a generous commission based on lifetime \u003cbr /\u003eaccount revenue (negotiable). - Fun, easy going, and service-centered heart. \u003cbr /\u003eOur primary focus isserving both nonprofit/church missions as well as helping \u003cbr /\u003etheir staff in any tech-centric way we can.\u003cbr /\u003e\u003cbr /\u003eIf that describes you, I\u0027d love to chat!\u003cbr /\u003e\u003cbr /\u003ebrett@3riverdev.com \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 7:19:03 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1320,
    "source": {},
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13545504",
    "title": "Teachers Pay Teachers | Engineers, Product Managers, Product Designers | NYC (New York City) | Full-Time",
    "content": "Teachers Pay Teachers | Engineers, Product Managers, Product Designers | NYC \u003cbr /\u003e(New York City) | Full-Time\u003cbr /\u003eTeachers Pay Teachers is a community of millions of educators who come \u003cbr /\u003etogether to share their work, their insights, and their inspiration with one \u003cbr /\u003eanother. We are the first and largest open marketplace where teachers share, \u003cbr /\u003esell, and buy original educational resources. Since we\u0027ve started, authors on \u003cbr /\u003eTeachers Pay Teachers have earned over $200M. Here\u0027s a bit more of the \u003cbr /\u003ebackstory (https://www.nytimes.com/2015/09/06/technology/a-sharing-econ... \u003cbr /\u003e\u003chttps://www.nytimes.com/2015/09/06/technology/a-sharing-economy-where-teachers-win.html\u003e\u003cbr /\u003e). Our engineering culture focuses on Fearless Development (\u003cbr /\u003ehttp://engineering.teacherspayteachers.com/2015/10/11/the-fe... \u003cbr /\u003e\u003chttp://engineering.teacherspayteachers.com/2015/10/11/the-fear-of-breaking-things.html\u003e\u003cbr /\u003e), curiosity, learning, and autonomy.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re currently running our infrastructure on AWS with a combination of \u003cbr /\u003eterraform and chef to manage our servers. The tiers of our application are \u003cbr /\u003ebuilt with AWS Aurora, Elixir, and React.\u003cbr /\u003e\u003cbr /\u003eIf you want to learn more about us, check us out on The Muse: \u003cbr /\u003ehttps://www.themuse.com/companies/teacherspayteachers/ \u003cbr /\u003e\u003chttps://www.themuse.com/companies/teacherspayteachers/\u003e.\u003cbr /\u003e\u003cbr /\u003eI\u0027d be happy to chat about positions over email at \u003cbr /\u003eryan.s@teacherspayteachers.com or check out our careers page (\u003cbr /\u003ehttps://www.teacherspayteachers.com/Careers \u003cbr /\u003e\u003chttps://www.teacherspayteachers.com/Careers\u003e). \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 11:39:04 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1433,
    "source": {},
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13545826",
    "title": "LAUNCH POTATO | Engineers, Product Managers, Marketing | http://launchpotato.com/careers | Delray Beach, FL, or Remote | Full Time Launch Potato ...",
    "content": "LAUNCH POTATO | Engineers, Product Managers, Marketing | \u003cbr /\u003ehttp://launchpotato.com/careers \u003chttp://launchpotato.com/careers\u003e | Delray \u003cbr /\u003eBeach, FL, or Remote | Full Time\u003cbr /\u003eLaunch Potato is a profitable startup studio that incubates and launches \u003cbr /\u003emobile and web companies on our proprietary technology stack.\u003cbr /\u003e\u003cbr /\u003eWe’re HQed in Delray Beach, FL, but have an amazing, distributed global team. \u003cbr /\u003eWe believe in building teams who can solve complex problems using smart \u003cbr /\u003emarketing, great engineering, data science and fun!\u003cbr /\u003e\u003cbr /\u003eFeatured Openings:\u003cbr /\u003e\u003cbr /\u003eFront-End Engineer, Marketing - http://launchpotato.com/front-end-engineer \u003cbr /\u003e\u003chttp://launchpotato.com/front-end-engineer\u003e\u003cbr /\u003e\u003cbr /\u003eDevOps Engineer - http://launchpotato.com/devops-engineer \u003cbr /\u003e\u003chttp://launchpotato.com/devops-engineer\u003e\u003cbr /\u003e\u003cbr /\u003eData Engineer - http://launchpotato.com/data-engineer \u003cbr /\u003e\u003chttp://launchpotato.com/data-engineer\u003e\u003cbr /\u003e\u003cbr /\u003eProduct Manager - http://launchpotato.com/product-manager \u003cbr /\u003e\u003chttp://launchpotato.com/product-manager\u003e\u003cbr /\u003e\u003cbr /\u003eCampaign Manager - http://launchpotato.com/campaign-manager \u003cbr /\u003e\u003chttp://launchpotato.com/campaign-manager\u003e\u003cbr /\u003e\u003cbr /\u003eJunior Marketing Analyst - http://launchpotato.com/marketing-analyst-jr \u003cbr /\u003e\u003chttp://launchpotato.com/marketing-analyst-jr\u003e \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 2, 2017 12:09:05 AM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1472,
    "source": {},
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13544706",
    "title": "Rollbar | https://rollbar.com | San Francisco or REMOTE | Dir. Product Marketing, Contract SDK Engineers",
    "content": "Rollbar | https://rollbar.com \u003chttps://rollbar.com\u003e | San Francisco or REMOTE | \u003cbr /\u003eDir. Product Marketing, Contract SDK Engineers\u003cbr /\u003eAbout Rollbar:\u003cbr /\u003e\u003cbr /\u003e* We help tens of thousands of developers find and fix errors faster.\u003cbr /\u003e\u003cbr /\u003e* Our backend handles billions of errors with low latency and high reliability.\u003cbr /\u003e\u003cbr /\u003e* Our front-end allows developers to discover and drill down across millions \u003cbr /\u003eof errors in real-time.\u003cbr /\u003e\u003cbr /\u003e* Our open source libraries are used by some of the best engineering teams in \u003cbr /\u003ethe world, including Kayak, Twilio, Heroku, Zendesk, Instacart and Twitch.\u003cbr /\u003e\u003cbr /\u003e* We\u0027re a 19-person team (SF, LA, Las Vegas, Fort Worth, Barcelona, Nomad) \u003cbr /\u003ebuilding tools that make developers\u0027 lives better.\u003cbr /\u003e\u003cbr /\u003e* Benefits and perks: competitive salary and stock options, medical, dental \u003cbr /\u003eand vision insurance, annual conference budget, generous hardware and software \u003cbr /\u003eallowance, casual work environment, inclusive team-oriented culture, rapid \u003cbr /\u003ecareer growth opportunities, have fun and have an impact.\u003cbr /\u003e\u003cbr /\u003eWe\u0027re looking for:\u003cbr /\u003e\u003cbr /\u003e* Director of Product Marketing\u003cbr /\u003e\u003cbr /\u003e* Contract SDK Engineer\u003cbr /\u003e\u003cbr /\u003eTo get in touch, please apply via https://rollbar.com/jobs \u003cbr /\u003e\u003chttps://rollbar.com/jobs\u003e \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 10:23:05 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1474,
    "source": {},
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13546313",
    "title": "Verdigris | Mountain View, CA Looking for: * Technical Sales Engineer (Full time) Apply here: https://vdgr.is/2koNGvP ...",
    "content": "Verdigris | Mountain View, CA\u003cbr /\u003eLooking for:\u003cbr /\u003e\u003cbr /\u003e* Technical Sales Engineer (Full time)\u003cbr /\u003e\u003cbr /\u003eApply here: https://vdgr.is/2koNGvP \u003chttps://vdgr.is/2koNGvP\u003e\u003cbr /\u003e\u003cbr /\u003eAs a Technical Sales Engineer at Verdigris, you\u0027re part sales and part \u003cbr /\u003etechnologist. You’ll work with our marketing, sales and business development \u003cbr /\u003ecolleagues. We\u0027ll drive sales throughput and create organizational and product \u003cbr /\u003elearning. As an early member of a startup company you\u0027ll help in post-sales \u003cbr /\u003esupport too. Your flexibility for logistics, RMA or technical support makes you \u003cbr /\u003ea connector between customer and product teams.\u003cbr /\u003e\u003cbr /\u003eAt Verdigris, we organize ourselves as small agile teams, typically sized \u003cbr /\u003ebetween 3 to 8 people. Growth drives customer acquisition, platform deployment, \u003cbr /\u003eand revenue growth for the company. Your team is cross-functional, with diverse \u003cbr /\u003eand deep experience in sales, marketing, business development, product \u003cbr /\u003emarketing, data science and coding. We’re searching for the right teammate to \u003cbr /\u003eshare our collaborative focus.\u003cbr /\u003e\u003cbr /\u003eYou can find more information about us at verdigris.co \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 2, 2017 1:05:04 AM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1498,
    "source": {},
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13544479",
    "title": "IP Street | Technical Sales Representative | Spokane, WA | Full Time",
    "content": "IP Street | Technical Sales Representative | Spokane, WA | Full Time\u003cbr /\u003eIP Street provides the building blocks for companies and organizations to \u003cbr /\u003emodernize their current patent operations or to build new functionality not \u003cbr /\u003epreviously possible with legacy patent data services. We\u0027re looking for \u003cbr /\u003eEnterprise Sales Reps to work with our customers to build great relationships, \u003cbr /\u003ehelp them to learn about IP Street and our products and facilitate the buying \u003cbr /\u003eprocess. Our sales process is a highly consultative one and we care deeply \u003cbr /\u003eabout our customer success. The ideal candidate will have the aptitude and \u003cbr /\u003epassion to become a master of IP Street’s product capabilities, underlying \u003cbr /\u003etechnology, and competitive advantages.\u003cbr /\u003e\u003cbr /\u003ehttp://www.ipstreet.com/job-posting-technical-sales-represen... \u003cbr /\u003e\u003chttp://www.ipstreet.com/job-posting-technical-sales-representative\u003e\u003cbr /\u003e\u003cbr /\u003eEmail me directly if you are interested. Reed (at) ipstreet.com \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 10:03:05 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1585,
    "source": {},
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13543059",
    "title": "Split | http://www.split.io | Frontend / Backend / Data Engineers, Support \u0026 Sales Roles | SF/Redwood City/Remote | Full time About ...",
    "content": "Split | http://www.split.io \u003chttp://www.split.io\u003e | Frontend / Backend / Data \u003cbr /\u003eEngineers, Support \u0026 Sales Roles | SF/Redwood City/Remote | Full time\u003cbr /\u003eAbout Split Split is the platform for controlled rollouts, providing feature \u003cbr /\u003eflagging SDKs in eight distinct languages and a web UI that lets anyone on the \u003cbr /\u003eteam create feature rollouts and target them to the right users. Our customers \u003cbr /\u003euse Split to run experiments, permanently control features, or even just as a \u003cbr /\u003esafety net for every release. Our integrations with services like Datadog, JIRA \u003cbr /\u003eand Slack help teams reduce time-to-resolution if things go wrong.\u003cbr /\u003e\u003cbr /\u003eOur stack - Java8, React, Mongo, Aurora, Kinesis.\u003cbr /\u003e\u003cbr /\u003eOur openings are a great chance to join an early team with a solid \u003cbr /\u003efoundation—we recently raised our series A from Accel Partners, LightSpeed \u003cbr /\u003eVentures and Sway Ventures and have customers like Segment, WePay, and Main \u003cbr /\u003eStreet Hub. Frontend and backend engineers will be a core part of leading the \u003cbr /\u003eplanning, design and building of services to support new features and products, \u003cbr /\u003eand our sales and support roles will be key advocates for our growing customer \u003cbr /\u003ebase.\u003cbr /\u003e\u003cbr /\u003eFor more and to apply: https://jobs.lever.co/split \u003cbr /\u003e\u003chttps://jobs.lever.co/split\u003e \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 1, 2017 7:56:04 PM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_product",
      "REMOTE2_America_West"
    ]
  },
  {
    "id": 1605,
    "source": {},
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id\u003d13545831",
    "title": "Genome Medical | Product Manager | San Francisco Bay Area | REMOTE WHO IS GENOME MEDICAL Genome Medical, Inc. ...",
    "content": "Genome Medical | Product Manager | San Francisco Bay Area | REMOTE WHO IS \u003cbr /\u003eGENOME MEDICAL Genome Medical, Inc. is an early-stage company using \u003cbr /\u003etelemedicine to integrate genomic medicine into everyday health care. Founded \u003cbr /\u003eby personalized medicine pioneers Dr. Randy Scott, Dr. Robert Green, and Lisa \u003cbr /\u003eAlderson, our goal is to bridge the growing gap between available genome \u003cbr /\u003etechnology and current medical practice. As genetic information becomes \u003cbr /\u003eincreasingly important in medicine, there are too few experts to meet the \u003cbr /\u003egrowing demand for interpretation. We are addressing this challenge by creating \u003cbr /\u003ea scalable, efficient model for lifelong genome-centered health care. Our \u003cbr /\u003enetwork of clinical genomics experts provides consultations to both patients \u003cbr /\u003eand physicians. To learn more, please visit www.genomemedical.com or find us on \u003cbr /\u003eTwitter. ROLE We are searching for a product manager to transform our already \u003cbr /\u003elaunched, speed-to-market product offering into the envisioned experience that \u003cbr /\u003eGenome Medical was founded upon. You will be reporting directly to the CEO and \u003cbr /\u003ewill be responsible for all things product. RESPONSIBILITIES - Lead product \u003cbr /\u003emanagement (requirements gathering, strategy/concept development, execution, \u003cbr /\u003euser and acceptance testing) to build the overall product vision and user \u003cbr /\u003eexperience for patients and clinicians. - Lead the development and \u003cbr /\u003ecustomization of user workflows by working with the clinical team as well as \u003cbr /\u003epartner organizations. - Serve as the voice of the customer and interface with \u003cbr /\u003eour engineering team to translate customer requirements into development \u003cbr /\u003erequirements. - Work with senior leadership to define product vision and \u003cbr /\u003estrategy. - Drive innovation, definition, deliverables and design of product \u003cbr /\u003efeatures to deliver against team and company goals, while working with \u003cbr /\u003eoutsourced engineers and designers - Establish a regular feedback loop to \u003cbr /\u003eensure we’re meeting our users needs. - Research trends and collect data to \u003cbr /\u003einform product direction, whether in the form of competitive intel, user \u003cbr /\u003ebehavior or other business metrics. - Coordinate with cross-functional teams to \u003cbr /\u003eensure a successful launch of solutions through training, support and marketing \u003cbr /\u003eefforts. - Define and analyze metrics that inform the success of products. \u003cbr /\u003eQUALIFICATIONS AND EXPERIENCE - 5+ years of product management experience \u003cbr /\u003edelivering successful and innovative consumer products (consumer health \u003cbr /\u003eexperience is a plus). - Minimum 1 year of experience in healthcare. - Basic \u003cbr /\u003eunderstanding of the technical architecture of web and mobile apps. - \u003cbr /\u003eExceptional communication, organizational and analytical skills. - Strong \u003cbr /\u003epeople skills, intuitive understanding of team dynamics. - Able to work \u003cbr /\u003ecross-functionally with engineering, marketing, sales and operations teams. - \u003cbr /\u003eExperience designing simple and intuitive user interfaces – ability to create \u003cbr /\u003eexamples through wireframes and mock-ups. - Experience using both qualitative \u003cbr /\u003eobservations and quantitative data to inform the development process. - \u003cbr /\u003eExcellent written, oral, organizational and analytical skills with strong \u003cbr /\u003etechnical abilities. - Ability to accelerate the shipping/launching of \u003cbr /\u003eproducts, including providing hands-on leadership.\u003cbr /\u003eIf interested, please submit your resume to info@genomemedical.com. \u003cbr /\u003e\u003cbr /\u003ereply \u003c\u003e",
    "content2": "",
    "urlFetchPending": false,
    "published": "Feb 2, 2017 12:09:05 AM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1666,
    "source": {},
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/126135/solution-engineer-prague-ostrava-or-hradec-vendavo?a\u003dGiHZw2HU4bm",
    "title": "Solution Engineer (Prague, Ostrava or Hradec Kralove) at Vendavo (Prague, Czech Republic) (allows remote)",
    "content": "We are looking for Solution Engineers who would become a part of our Global \u003cbr /\u003eSolutions Delivery team located in Prague, Ostrava or Hradec Kralove.\u003cbr /\u003e\u003cbr /\u003eThe Solution Engineer will be a key member of the team delivering a customized\u003cbr /\u003e B2B pricing application to some of the most important and interesting\u003cbr /\u003e companies in the world. He/she will work closely with the Lead Solution \u003cbr /\u003eEngineer and/or Solution Architect to develop custom features of Vendavo \u003cbr /\u003eEnterprise Profitability Suite.\u003cbr /\u003e\u003cbr /\u003eKey Responsibilities:\u003cbr /\u003e\u003cbr /\u003e * Designing, programming and configuring of Vendavo modules with the team of \u003cbr /\u003etechnical people \u003cbr /\u003e * Resolving technical issues with others in GSD and engineering groups \u003cbr /\u003e * Integrating Vendavo suite with customer systems in close cooperation with \u003cbr /\u003etheir IT staff \u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eRequired:\u003cbr /\u003e\u003cbr /\u003e * 2+ years of progressive experience in object oriented software programming \u003cbr /\u003e * Proficient in XML and SQL \u003cbr /\u003e * In-depth knowledge of back-end Oracle database \u003cbr /\u003e * Ability to learn, common sense, analytical thinking \u003cbr /\u003e * Knowledge of Czech or Slovak language \u003cbr /\u003ePreferred:\u003cbr /\u003e\u003cbr /\u003e * Excellent verbal and written communication skills – at least intermediate \u003cbr /\u003eEnglish level is required \u003cbr /\u003e * History of large-scale enterprise applications development is a plus \u003cbr /\u003e * Global travel flexibility would certainly be preferred but not mandatory \u003cbr /\u003e * Working knowledge on any one of the following application servers [latest \u003cbr /\u003eversions] is preferred: Weblogic, WebSphere, NetWeaver, JBoss \u003cbr /\u003e * Strong Java/J2EE coding and development experience is a plus \u003cbr /\u003e About Vendavo \u003cbr /\u003e\u003cbr /\u003eWe take our mission seriously, whether it’s building an amazing product or \u003cbr /\u003ebuilding an amazing culture. We inspire our people to solve real problems, have \u003cbr /\u003efun, and create something life changing. If you thrive on unraveling \u003cbr /\u003echallenges, making a real impact, and building something big, you should join \u003cbr /\u003eus. We love being here and think you might too.\u003cbr /\u003e\u003cbr /\u003eJoel Test score: 9 out of 12\u003cbr /\u003e\u003cbr /\u003e The Joel Test \u003chttp://www.joelonsoftware.com/articles/fog0000000043.html\u003e is \u003cbr /\u003ea twelve-question measure of the quality of a software team. \u003cbr /\u003e\u003cbr /\u003e * Do you use source control? \u003cbr /\u003e * Can you make a build in one step? \u003cbr /\u003e * Do you make daily builds? \u003cbr /\u003e * Do you have a bug database? \u003cbr /\u003e * Do you fix bugs before writing new code? \u003cbr /\u003e * Do you have an up-to-date schedule? \u003cbr /\u003e * Do you have a spec? \u003cbr /\u003e * Do programmers have quiet working conditions? \u003cbr /\u003e * Do you use the best tools money can buy? \u003cbr /\u003e * Do you have testers? \u003cbr /\u003e * Do new candidates write code during their interview? \u003cbr /\u003e * Do you do hallway usability testing? apply now \u003c\u003e  more jobs at Vendavo  \u003c\u003e \u003cbr /\u003eJoin us at Vendavo\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eWorking within a team of young and highly skilled people Opportunity to get to \u003cbr /\u003eknow the pricing domain \u003cbr /\u003eLearn more about Vendavo \u003c\u003e more jobs at Vendavo \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/vendavo?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:35:44 PM",
    "tags": [
      "TECH2_xml",
      "TECH2_sql",
      "REMOTE1_100",
      "TECH2_java",
      "TECH2_oop",
      "TITLE1_product",
      "REMOTE2_locals-only",
      "TECH2_oracle"
    ]
  },
  {
    "id": 1717,
    "source": {},
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/3430-sales-representative",
    "title": "Sales Representative",
    "content": "* \u003cbr /\u003eSales Representative\u003cbr /\u003e\u003cbr /\u003eMuseum Hack\u003cbr /\u003e\u003cbr /\u003eThis position is remote, you can work from anywhere in the US if you\u0027re \u003cbr /\u003eavailable on East Coast hours.\u003cbr /\u003e\u003cbr /\u003e_ ABOUT US _\u003cbr /\u003e\u003cbr /\u003eMuseum Hack is a non-traditional private tour company crafting museum \u003cbr /\u003eexperiences that encourage visitors to look at museums in new ways. We use the \u003cbr /\u003eexpansive collection of the museums we work in as our playground to create \u003cbr /\u003e“un-highlights” tours that focus on hidden works and unexpected stories. We’re \u003cbr /\u003ea creative company that offers irreverent, renegade museum tours and cultural \u003cbr /\u003eoffsites to corporate and private clients.\u003cbr /\u003e\u003cbr /\u003eFounded in 2013 and having grown to over $2 million in sales in 2016, We’ve \u003cbr /\u003euplifted the lives of tens of thousands of new museum guests. We work at \u003cbr /\u003erenowned cultural institutions and quirky locations in New York City and other \u003cbr /\u003emajor cities to bring these innovative experiences to companies and groups.\u003cbr /\u003e\u003cbr /\u003eMuseum Hack has been featured by The Wall Street Journal, The Washington Post, \u003cbr /\u003ePBS, TimeOut New York, Huffington Post, TEDx, and more. Beloved clients include \u003cbr /\u003eprivate citizens, schools, industry groups, and large companies like Google, \u003cbr /\u003eLego, LinkedIn, and CitiBank.\u003cbr /\u003e\u003cbr /\u003e_ JOB DUTIES _\u003cbr /\u003e\u003cbr /\u003e * Communicate with prospective clients via inbound/outbound calls and email \u003cbr /\u003e * Put together proposals and follow up as necessary \u003cbr /\u003e * Manage pipeline with our CRM \u003cbr /\u003e * Request invoices be sent to clients \u003cbr /\u003e * Other duties as assigned \u003cbr /\u003e_ JOB REQUIREMENTS _\u003cbr /\u003e\u003cbr /\u003e * 1 year previous sales \u0026 customer service experience \u003cbr /\u003e * You have a home office and prior experience working remotely \u003cbr /\u003e * Available to work Eastern USA time zone + peek in on weekends \u003cbr /\u003e * Must have nearly perfect written English skills and amazingly awesome \u003cbr /\u003espoken English skills \u003cbr /\u003e * High quality work: You are an efficient individual who makes projects \u003cbr /\u003ehappen behind the scenes with a fine eye for details (in short: you get shit \u003cbr /\u003edone) \u003cbr /\u003e * Technically inclined, able to pick up new things quickly: we use a lot of \u003cbr /\u003eweb-based services (including, but not limited to: Google Docs, Gmail, Google \u003cbr /\u003eCalendar, Slack, Xero, PandaDoc, Base CRM) \u003cbr /\u003e * Flexibility quotient high: Things can and do change on a dime around here \u003cbr /\u003e-- you gotta go with the flow, and be ready to kick it into high gear at a \u003cbr /\u003emoment\u0027s notice \u003cbr /\u003e * Be fun and exciting without using too many exclamation marks!!!!!!!!! \u003cbr /\u003e * Authorized to work in the US \u003cbr /\u003e_ HOURS / PAY RATE _\u003cbr /\u003e\u003cbr /\u003e * Flexibility to work as needed from 9am to 8pm Eastern Monday - Friday and \u003cbr /\u003eon-call during the weekends (as-needed) from 9am to 6pm Eastern \u003cbr /\u003e * 25-30 hours per week. Option to work up to 40 hrs / week with approval and \u003cbr /\u003eduring busy times. \u003cbr /\u003e * $14 to $15 per hour, DOE + commission (commission plan based on sales, TBD) \u003cbr /\u003e * Must be eligible to work in the US \u003cbr /\u003e_ MORE INFO _\u003cbr /\u003e\u003cbr /\u003e * Many people on our team are remote and work from home \u003cbr /\u003e * Most of our Sale Representatives stay with the company for years, and move \u003cbr /\u003eup to do really exciting things with us. \u003cbr /\u003e * Sales Reps occasionally receive performance-based rewards and incentives \u003cbr /\u003e * Find out more about us by watching our CEO Nick\u0027s Tedx Talk \u003cbr /\u003e\u003chttps://www.youtube.com/watch?v\u003d6VWPHKABRQA\u003e.",
    "urlFetchPending": false,
    "published": "Feb 8, 2017 11:30:28 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1743,
    "source": {},
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/job/Product-Specialist-Ai-at-CliniSys-Group-in-Field-Based-30d90eeae6d64a65",
    "title": "Product Specialist AI - CliniSys Group - Field Based",
    "content": "\u003c\u003e Product Specialist AI \u003cbr /\u003eCliniSys Group - Field Based \u003cbr /\u003eJob Summary: \u003cbr /\u003e\u003cbr /\u003e * To implement the CliniSys Pathology Software and associated applications \u003cbr /\u003einto hospitals and Trusts within the UK as directed by the Product Specialist \u003cbr /\u003eTeam Leader and the Project Manager to satisfy the customer and business \u003cbr /\u003erequirements\u003cbr /\u003e * To act in a consultative role, with the customer, in configuring the \u003cbr /\u003eCliniSys Software to enhance the workflow of the laboratory.\u003cbr /\u003e * To be an instrumental element in the functional development of the CliniSys \u003cbr /\u003eProducts.\u003cbr /\u003e * To keep abreast of ongoing and future Laboratory regulations, working \u003cbr /\u003epractices, products and technologies within the pathology discipline.\u003cbr /\u003e * To contribute to product testing. Responsibilities: \u003cbr /\u003e\u003cbr /\u003e * To comply with the CliniSys codes of conduct and guidelines. \u003cbr /\u003e * To understand, comply and develop with customer and CliniSys procedures, \u003cbr /\u003eworking practices and directives in a timely manner.\u003cbr /\u003e * To understand our Customers’ workflow, advise and assist with CliniSys \u003cbr /\u003eproducts and configuration to facilitate these needs.\u003cbr /\u003e * To be fully conversant with the functionality of the Pathology product of \u003cbr /\u003eyour discipline\u003cbr /\u003e * To be conversant with the core functionality of Pathology products \u003cbr /\u003e * Assist Project manager with the implementation; that will include time \u003cbr /\u003emanagement, resource planning and working with Trust or Customer IT \u003cbr /\u003erepresentatives.\u003cbr /\u003e * Comprehend the Customers’ requirements as specified in the PID (Project \u003cbr /\u003eInitiation Document) and the design document presented at the Sales stage.\u003cbr /\u003e * Contribute to the development of the Software product \u003cbr /\u003e * To make recommendations based on customer feedback with regard to software \u003cbr /\u003echanges and enhancements.\u003cbr /\u003e * Assist with demonstrations and presentations for the Sales and Marketing \u003cbr /\u003eteam.\u003cbr /\u003e * Deliver relevant courses for key users of pathology, as required. \u003cbr /\u003e * To attend team meetings and agreed training courses. \u003cbr /\u003e * To be responsive to reasonable requests from your line manager or project \u003cbr /\u003emanagers.\u003cbr /\u003e * Contribute to and support Pathology team members and build knowledge base. \u003cbr /\u003e * To help testing of the latest version of software prior to general release. \u003cbr /\u003eKnowledge, Skills, Abilities:\u003cbr /\u003e\u003cbr /\u003e * BMS band 7/8 status in the UK Health sector. \u003cbr /\u003e * Experienced in leading a team \u003cbr /\u003e * Strong motivational skills – can deliver the tasks in difficult \u003cbr /\u003ecircumstances\u003cbr /\u003e * Excellent verbal and written communication skills; including communicating \u003cbr /\u003ewith technical and non-technical clients and staff at all organisational levels\u003cbr /\u003e * High levels of commitment and ability to take action when necessary \u003cbr /\u003e * Ability and willingness to work independently \u003cbr /\u003e * Customer service skills \u003cbr /\u003e * Ability to create and deliver executive-level summary reports and \u003cbr /\u003epresentations\u003cbr /\u003e * IT trained, experience HL7, Integration products e.g. Rhapsody, or \u003cbr /\u003eexperience of XML, Java scripting would be also useful.Education and Experience:\u003cbr /\u003e\u003cbr /\u003e * Bachelor\u0027s degree \u003cbr /\u003e * Experience within an IT or software providers organisation or \u003cbr /\u003eimplementation is desirable\u003cbr /\u003e * Moderate experience in a project management environment is desirable. \u003cbr /\u003e * Any equivalent combination of education and/or experience providing the \u003cbr /\u003eknowledge/skills/abilities listed above may be substituted.\u003cbr /\u003e To contribute to product testing\u003cbr /\u003e8 hours ago",
    "urlFetchPending": false,
    "published": "Feb 8, 2017 4:09:31 PM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_product",
      "REMOTE2_locals-only"
    ]
  },
  {
    "id": 1819,
    "source": {},
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/job/Pre-Sales-Solution-Architect-at-Marketo-in-Remote-ddf04e54ef06b47a",
    "title": "Pre-Sales Solutions Architect - Marketo - Remote",
    "content": "\u003c\u003e Pre-Sales Solutions Architect \u003cbr /\u003eMarketo 10 reviews \u003c\u003e - Remote \u003cbr /\u003eMarketo provides the leading engagement marketing software and solutions \u003cbr /\u003edesigned to help marketers develop long-term relationships with their customers \u003cbr /\u003e– from acquisition to advocacy. Marketo is built for marketers, by marketers \u003cbr /\u003eand is setting the innovation agenda for marketing technology.\u003cbr /\u003e\u003cbr /\u003eThe Opportunity:\u003cbr /\u003e We are looking for a highly technical, hands-on individual who will deliver \u003cbr /\u003estellar results on our top performing and expanding pre-sales systems \u003cbr /\u003earchitecture team. You will evangelize the Marketo Revenue Performance \u003cbr /\u003eManagement solutions to technical marketers, developers and sales audiences and \u003cbr /\u003ebe the expert with Marketo solutions during the sales cycle, while performing \u003cbr /\u003ecustomized API and product demonstrations via the web and in person to our \u003cbr /\u003ecustomers and prospects. As a Marketo Solutions Architect, you will understand \u003cbr /\u003ecustomer goals and challenges and establish Marketo as the leading solution, \u003cbr /\u003ebuild and present customized demonstrations, present Marketo technology \u003cbr /\u003einfrastructure, and demonstrate deep familiarity with hardware, software, \u003cbr /\u003enetworking and security environments. You will participate in all product, \u003cbr /\u003esales, and process training and certification to acquire and maintain the \u003cbr /\u003eknowledge necessary to be effective, and will attain quarterly and annual \u003cbr /\u003eobjectives assigned by management. You will assist Pre-Sales Solutions \u003cbr /\u003eConsultants and Account Executives with RFPs and assist in business case \u003cbr /\u003edevelopment when required.\u003cbr /\u003e\u003cbr /\u003eResponsibilities:\u003cbr /\u003e Collaborate with Small, Mid-Market and Enterprise Account Executives in a \u003cbr /\u003efast paced sales environment to identify and uncover customer business goals, \u003cbr /\u003eneeds and pains\u003cbr /\u003eDemonstrate the value proposition of the Marketo solution through highly \u003cbr /\u003ecustomized product demonstrations\u003cbr /\u003eCreate strategic and technical sales strategies, presentations and product \u003cbr /\u003edemonstrations for small and mid-market and level customers\u003cbr /\u003eHold broad accountability for the technical excellence of the Marketo \u003cbr /\u003ePlatform, from code quality to sales\u003cbr /\u003eProvide technical insight, feedback and recommendations across a wide range of \u003cbr /\u003eprojects, to help solutions consultants and account executives deliver their \u003cbr /\u003ebest work to prospects and customers\u003cbr /\u003eLead the evolution of the Marketo Product from the front lines by establishing \u003cbr /\u003ea deep relationship with the product team after analyzing prospect and customer \u003cbr /\u003eneeds.\u003cbr /\u003eKeep up with the ever-changing landscape of SaaS and alert managers, engineers \u003cbr /\u003eand product team when warranted.\u003cbr /\u003e\u003cbr /\u003eRequired Skills/ Experience:\u003cbr /\u003e B.S. Computer Science, Software Engineering, Electrical Engineering MIS or \u003cbr /\u003eequivalent work\u003cbr /\u003eStrong development skills with experience in creating web services. Experience \u003cbr /\u003ewith Python or Java is required.\u003cbr /\u003eHighly dependable, self-starter, high energy, positive attitude with good \u003cbr /\u003eorganization and time management skills\u003cbr /\u003eExperience providing solutions to small and mid-market and enterprise level \u003cbr /\u003ecustomers\u003cbr /\u003eA proven history of quota over-achievement \u003cbr /\u003eExcellent written and verbal communication skills \u003cbr /\u003eTeamwork skills a must, ability to lead and manage resources \u003cbr /\u003e\u003cbr /\u003e About Marketo \u003cbr /\u003eMarketo provides the leading engagement marketing software and solutions \u003cbr /\u003edesigned to help marketers develop long-term relationships with their customers \u003cbr /\u003e– from acquisition to advocacy. Marketo is built for marketers, by marketers \u003cbr /\u003eand is setting the innovation agenda for marketing technology. Marketo puts \u003cbr /\u003eMarketing First. Headquartered in San Mateo, CA, with offices around the world, \u003cbr /\u003eMarketo serves as a strategic partner to large enterprise and fast-growing \u003cbr /\u003esmall companies across a wide variety of industries. To learn more about \u003cbr /\u003eMarketo’s Engagement Marketing Platform, LaunchPoint® partner ecosystem, and \u003cbr /\u003ethe vast community that is the Marketo Marketing Nation®, visit www.marketo.com \u003cbr /\u003e.\u003cbr /\u003eMarketo is an equal opportunity employer.\u003cbr /\u003e11 hours ago",
    "urlFetchPending": false,
    "published": "Feb 9, 2017 9:49:08 AM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 64,
    "source": {},
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/99993/security-researcher-fastly?a\u003dxx8OsqQ5Uyc",
    "title": "Security Researcher at Fastly (San Francisco, CA) (allows remote)",
    "content": "SECURITY RESEARCHER\u003cbr /\u003e\u003cbr /\u003eAs a Security Researcher at Fastly you will help ensure our security efforts \u003cbr /\u003eare rooted in a deep understanding of the state of the art in web application \u003cbr /\u003evulnerabilities, denial of service attacks and bot mitigation techniques and \u003cbr /\u003emethods.\u003cbr /\u003e\u003cbr /\u003eWe are looking for security researchers at all levels of seniority who enjoy \u003cbr /\u003einvestigating web application security threats to contribute intelligence to \u003cbr /\u003eour security products and services. Qualified candidates will show an aptitude \u003cbr /\u003efor discovering complex security issues that affect modern web sites. We \u003cbr /\u003eencourage our security researchers to present at network and security \u003cbr /\u003econferences and participate in the security community.\u003cbr /\u003e\u003cbr /\u003eThis is a role with a high impact, friendly security team. In addition to \u003cbr /\u003econtributing to industry leading security products and services, you’ll make \u003cbr /\u003esure our customers benefit from a service built to the highest security \u003cbr /\u003estandards in the industry. We’re in beautiful downtown San Francisco, but for \u003cbr /\u003ethe right candidate, we’re open to considering a remote position, and we have \u003cbr /\u003ethe team and tools in place to make it work.\u003cbr /\u003e\u003cbr /\u003e Skills \u0026 Requirements \u003cbr /\u003e\u003cbr /\u003eRESPONSIBILITIES\u003cbr /\u003e\u003cbr /\u003e * Stay on top of new developments in application and network security \u003cbr /\u003e * Research security vulnerabilities in web applications and web application \u003cbr /\u003eframeworks \u003cbr /\u003e * Collaborate with product engineering and operations teams in support of \u003cbr /\u003edeploying new mitigations against known and new vulnerability classes \u003cbr /\u003e * Assess and perform deep dives into actual incidents and identify new \u003cbr /\u003eexploitation techniques \u003cbr /\u003e * Externalize research through blogging and speaking opportunities \u003cbr /\u003eQUALIFICATIONS\u003cbr /\u003e\u003cbr /\u003e * Understanding of DDoS and web application attack mitigation techniques \u003cbr /\u003e * Experience with vulnerability discovery (e.g. fuzzing, static analysis, \u003cbr /\u003eexploit development) and disclosure best practices \u003cbr /\u003e * Knowledge of web application security vulnerabilities such as XSS, CSRF, \u003cbr /\u003eSQL injection, ways to mitigate them and bypass those mitigations \u003cbr /\u003e * Experience with threat intelligence data, sourcing, and evaluation \u003cbr /\u003eREQUIREMENTS\u003cbr /\u003e\u003cbr /\u003e * Be passionate about building security at scale and protecting our customers \u003cbr /\u003e * Proven ability to investigate and clearly communicate security \u003cbr /\u003evulnerabilities \u003cbr /\u003e * Strong multi-tasking abilities with attention to detail and the ability to \u003cbr /\u003edive deeply into issues \u003cbr /\u003e * Excellent written communication skills \u003cbr /\u003e * Excellent ability to build relationships with customers, security engineers \u003cbr /\u003eand researchers \u003cbr /\u003e * Experience coding languages like Scala, Python, or Go is a plus, similarly \u003cbr /\u003eexperience with technologies such as Storm and Greylog are also valuable \u003cbr /\u003e About Fastly \u003cbr /\u003e\u003cbr /\u003eFastly is a flexible, transparent content delivery network that accelerates \u003cbr /\u003eand scales websites, mobile applications, and APIs. We do this by moving \u003cbr /\u003econtent physically closer to a company’s end users. If you’re tweeting, \u003cbr /\u003epinning, shopping on Wayfair or ModCloth, reading the news on Fast Company or \u003cbr /\u003eThe Guardian, browsing pictures on Imgur, or coding with GitHub, Fastly is \u003cbr /\u003eimproving your user experience.\u003cbr /\u003e\u003cbr /\u003eThe global CDN market is estimated to grow from $3.71 billion in 2014 to \u003cbr /\u003e$12.16 billion in 2019. With an exciting product roadmap and a fast-growing \u003cbr /\u003einternational team, Fastly is redefining what’s possible online.\u003cbr /\u003e\u003cbr /\u003eWe’re building a better Internet. Come join us. \u003cbr /\u003eExternal URL  apply now  \u003chttp://grnh.se/t31m7v\u003e  more jobs at Fastly  \u003c\u003e \u003cbr /\u003eJoin us at Fastly\u003cbr /\u003e\u003cbr /\u003eWe have great benefits\u003cbr /\u003eCatered Lunches Dog-Friendly Flexible Working Hours Beer, Wine, Cold Brew On \u003cbr /\u003eTap Walking distance from BART and CalTrain Unlimited PTO Wellness: Yoga \u003cbr /\u003eFrequent Tech Talks Sponsors Meetups Fully-covered Health, Dental, and Vision \u003cbr /\u003eInsurance \u003cbr /\u003eLearn more about Fastly \u003c\u003e more jobs at Fastly \u003cbr /\u003e\u003chttp://stackoverflow.com:80/jobs/companies/fastly?from\u003dJobDetailMoreJobs#open-jobs\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:04 PM",
    "tags": [
      "TECH2_threat-model",
      "TECH2_python",
      "TECH2_fuzzing",
      "TECH2_security",
      "REMOTE1_50",
      "TECH2_c",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  },
  {
    "id": 1297,
    "source": {},
    "sourceName": "jobs.remotive.io",
    "url": "http://careers.uvsouthsourcing.com/index.php?m\u003dportal\u0026a\u003ddetails\u0026jobOrderID\u003d7416655/UV_SouthSourcing/",
    "title": "Sr. Technical Functional Analyst at UV South Sourcing, Remote possible, engineering",
    "content": "Sr. Technical Functional Analyst - (Relocate to Buenos Aires or Work Remotely) \u003cbr /\u003e| UV SouthSourcing \u003cbr /\u003e *  Log In  \u003c\u003e \u003cbr /\u003e *  Register  \u003c\u003e \u003cbr /\u003e *  Jobs  \u003c\u003e \u003cbr /\u003e *  Back to Website  \u003chttp://www.uvsouthsourcing.com/\u003e  \u003c\u003e \u003cbr /\u003eSr. Technical Functional Analyst - (Relocate to Buenos Aires or Work Remotely)\u003cbr /\u003eEmail \u003cmailto:?subject\u003dJob Opening: Sr. Technical Functional Analyst - \u003cbr /\u003e(Relocate to Buenos Aires or Work Remotely)\u0026body\u003dI came across this job on the \u003cbr /\u003einternet and I thought that you or someone you know might be interested. \u003cbr /\u003ehttp://careers.uvsouthsourcing.com/index.php?m\u003dportal%26a\u003ddetails%26jobOrderID\u003d7416655\u003e\u003cbr /\u003eTweet \u003chttps://twitter.com/share\u003e  Location: New York, New York  Date Posted: \u003cbr /\u003e05-05-2016 Apply Now \u003c\u003e \u003cbr /\u003e\u003cbr /\u003e UV is a world class technology and development company providing high-end \u003cbr /\u003etechnology services to advertising and marketing agencies. With offices in six \u003cbr /\u003ecountries, UV has been growing year over year and is looking for key positions \u003cbr /\u003eto help continue with our excellent growth and fantastic work.\u003cbr /\u003e\u003cbr /\u003e This role is preferred to be in our Buenos Aires office, but remote work may \u003cbr /\u003ebe a possibility (Latin / Central / South America, Canada, Europe). US based \u003cbr /\u003ecandidates who are open to relocate will be considered. Relocation assistance \u003cbr /\u003eavailable.\u003cbr /\u003e\u003cbr /\u003e In this role you will assist the business development team in the analysis \u003cbr /\u003eand creation of proposals and RFP responses while driving the discovery process \u003cbr /\u003eto determine project requirements and specifications.\u003cbr /\u003e\u003cbr /\u003eDesired Skills and Experience: \u003cbr /\u003e * Expert ability to extract project requirements with very little direction \u003cbr /\u003eaccounting for business goals, best practices for usability from a UX/UI/AI \u003cbr /\u003eperspective, creative and aesthetic direction, clear features/specifications \u003cbr /\u003eand technological approach \u003cbr /\u003e * Highly knowledgeable across a wide array of technology stacks (front end, \u003cbr /\u003ebackend, platforms, etc) \u003cbr /\u003e * Ability to architect at a high level complex solutions regardless of the \u003cbr /\u003efeature sets or technologies required for the project \u003cbr /\u003e * Ability to create clear and compelling proposals and RFP responses  \u003cbr /\u003e * Former development experience is a big plus \u003cbr /\u003e * Excellent written and verbal communication skills \u003cbr /\u003e * Fluent English \u003cbr /\u003e * Spanish is a benefit, but not required   \u003cbr /\u003eApply Now \u003c\u003e or  \u003chttp://www.catsone.com/?ref/portal\u003e",
    "urlFetchPending": false,
    "published": "Feb 7, 2017 11:12:25 PM",
    "tags": [
      "REMOTE1_50",
      "REMOTE2_America",
      "TITLE1_product"
    ]
  }
]
}
