{
  "items": [
  {
    "id": 42,
    "source": {},
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/138941/qa-engineer-brave-software?a=KAYXaLZLUzK&sec=False",
    "title": "QA Engineer at Brave Software () (allows remote)",
    "content": "<html><head></head><body><div>        <div>                <div>            <div>                                    <div>                    <div>                        <div>                            <h1><a rel=&quot;nofollow&quot;>QA Engineer</a>                            </h1>                                <span>                                    Equity                                </span>                        </div><a rel=&quot;nofollow&quot;>Brave Software</a>                    </div>                </div>                <div>                    <div>                                                        </div>                </div>                <div></div>            </div>        </div>                        </div>        <div>            <h2>                Job Description            </h2>            <div><p>Brave&nbsp;is&nbsp;looking&nbsp;for&nbsp;an&nbsp;Android­ focused&nbsp;QA&nbsp;Engineer&nbsp;to&nbsp;work&nbsp;on&nbsp;our&nbsp;latest&nbsp;Chromium­ based&nbsp; Android&nbsp;browser. &nbsp;While primarily testing the Android browser, the candidate would also test the laptop browser and provide support to end-users. This&nbsp;is&nbsp;a&nbsp;high­ profile&nbsp;and&nbsp;impactful,&nbsp;hands­-on&nbsp;position&nbsp;in&nbsp;an&nbsp;early&nbsp;stage startup.<br><br>We are remote-friendly, candidates must be authorized to work&nbsp;in the USA or Canada.</p>            </div>        </div>            <h2>                Skills &amp; Requirements            </h2>            <div><ul><li>3+&nbsp;years&nbsp;experience&nbsp;with manual QA and automation</li><li>Proficient with&nbsp;Java&nbsp;and/or a scripting language</li><li>Experience with test frameworks</li><li>Experience with desktop and mobile testing(Android preferred)</li><li>Android&nbsp;Studio&nbsp;and/or&nbsp;Eclipse&nbsp;IDE&nbsp;experience</li><li>Experience&nbsp;with&nbsp;software&nbsp;development&nbsp;via&nbsp;distributed&nbsp;development&nbsp;teams</li><li>Comfortable&nbsp;working&nbsp;in&nbsp;an&nbsp;open&nbsp;source&nbsp;setting</li><li>A&nbsp;passion&nbsp;for&nbsp;helping&nbsp;protect&nbsp;users’&nbsp;privacy&nbsp;and&nbsp;security</li><li>Written&nbsp;and&nbsp;verbal&nbsp;communication&nbsp;skills&nbsp;in&nbsp;English</li><li>Proven&nbsp;record&nbsp;of&nbsp;getting&nbsp;things&nbsp;done</li></ul>            </div>            <h2>                About Brave Software            </h2>            <div><p>The&nbsp;web&nbsp;has&nbsp;become&nbsp;a&nbsp;different&nbsp;place.&nbsp;With&nbsp;the&nbsp;ad­tech&nbsp;ecosystem&nbsp;out&nbsp;of&nbsp;control,&nbsp;users&nbsp;have&nbsp; revolted&nbsp;and&nbsp;blocking&nbsp;ads&nbsp;has&nbsp;become&nbsp;the&nbsp;new&nbsp;weapon&nbsp;of&nbsp;choice&nbsp;for&nbsp;improving&nbsp;their&nbsp;browsing&nbsp; speed,&nbsp;safety&nbsp;and&nbsp;privacy.&nbsp;Unfortunately,&nbsp;blocking&nbsp;alone&nbsp;results&nbsp;in&nbsp;a&nbsp;race&nbsp;to&nbsp;the&nbsp;bottom&nbsp;where&nbsp; nobody&nbsp;wins.&nbsp;Without&nbsp;the&nbsp;ability&nbsp;for&nbsp;content&nbsp;creators&nbsp;to&nbsp;earn&nbsp;money&nbsp;for&nbsp;their&nbsp;efforts,&nbsp;users&nbsp;could&nbsp; be&nbsp;left&nbsp;with&nbsp;fewer&nbsp;sites&nbsp;to&nbsp;browse,&nbsp;relegated&nbsp;to&nbsp;hand­picked&nbsp;content&nbsp;from&nbsp;controlled&nbsp;sources.&nbsp; <br><br>Brave&nbsp;aims&nbsp;to&nbsp;transform&nbsp;the&nbsp;online&nbsp;ad&nbsp;ecosystem&nbsp;with&nbsp;micropayments&nbsp;and&nbsp;a&nbsp;new&nbsp;revenue sharing solution ​to give users and publishers&nbsp;a better deal, where fast, safe browsing is the path to a brighter future for the open web.</p>            </div>                                                                            <div></div>                <span></span>            </div></body></html>",
    "urlFetchPending": false,
    "published": "Apr 17, 2017 4:48:56 PM",
    "tags": [
      "TECH2_senior",
      "REMOTE1_100",
      "TECH2_android",
      "TECH2_testing",
      "TECH2_java",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 87,
    "source": {},
    "sourceName": "stackoverflow.com",
    "url": "http://stackoverflow.com/jobs/134318/qa-engineer-argo-trade-solutions?a=J2RaRzv3ODe&sec=False",
    "title": "QA Engineer at ARGO Trade Solutions (Berlin, Deutschland) (allows remote)",
    "content": "<html><head></head><body><div>        <div>                <div>            <div>                <div>                    <div>                        <div>                            <h1><a rel=&quot;nofollow&quot;>QA Engineer</a>                            </h1>                                <span>                                            €25k - 45k                                                </span>                        </div><a href=&quot;http://www.goargo.com&quot; rel=&quot;nofollow&quot;>ARGO Trade Solutions</a>                    </div>                </div>                <div>                    <div>                                                        </div>                </div>                <div></div>            </div>        </div>                        </div>        <div>            <h2>                Job Description            </h2>            <div><p><strong>Ever dreamed of disrupting&nbsp;an entire industry?</strong></p><p><strong>Join ARGO and change the way companies participate in international trade!</strong></p><p>Have you ever wondered how Western companies sell goods to countries such as China or Tansania for hundred thousands of Euros without fear of never being paid? We help them do it!</p><p>ARGO is building a new way to take the risk of non-payment out of international trade transactions, helping companies paying when its best for them. We make&nbsp;global transactions&nbsp;as easy as PayPal made it for consumers to buy in the dangerous world wide web.</p><p>We have just started on our big vision! We are backed by one of the best European VCs, we have a great complimentary management team and are right in the middle of building our first product.</p><p>But now its time for us to get help. We are looking for&nbsp;<strong>experienced quality assurance (QA)&nbsp;champions</strong>&nbsp;that share our vision of creating a big disruption and want to build something exciting and fresh from the ground up!</p><p>As core member of our backend team,&nbsp;<strong>you will help to ...</strong></p><ul><li>write and own test cases for our backend and frontend features</li><li>perform acceptance testing for every new feature</li><li>hunt for bugs and always advocate for covering even the edgiest of edge cases</li><li>create a plan for automated functional testing using Selenium</li><li>write specs and issues for developers on milestone planning phase</li></ul><p>Both in Berlin as well as in a remote position,&nbsp;<strong>we offer you...</strong></p><ul><li>a small team of super smart and driven people that believe in changing things to the better&nbsp;</li><li>an informal working atmosphere based upon direct communication and feedback with no bureaucracy or unnecessary disturbance: we believe in Slack, limited meetings and fast honest talk</li><li>direct influence on anything we&nbsp;build: We know what we want to do, but if you know a better solution, we will go your way!</li><li>an environment to grow: learn from your team, help others around you getting better every day, visit conferences, get and give feedback regularly and understand more than just the technical side of our business</li><li>lots of additional perks such as awesome team events, regular team lunches and dinners, free of choice hardware,...</li></ul><p><strong>We hope to find in you...</strong></p><ul><li>more than two years of experience testing applications</li><li>experience in analyzing business requirements, creating test plans and scripts</li><li>desire to conduct all types of testing (functional, load, acceptance)</li><li>attention to detail and zeal to get to the heart of the problem during testing</li><li>passion to manage test processes and implement new methodologies</li><li>ability to work in a multicultural team</li></ul><p>&nbsp;We are super excited to hear from you!&nbsp;</p>            </div>        </div>                                        <div></div>                <span></span>            </div></body></html>",
    "urlFetchPending": false,
    "published": "Apr 17, 2017 4:48:56 PM",
    "tags": [
      "TECH2_qa",
      "REMOTE1_100",
      "TECH2_testing",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 191,
    "source": {},
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29161?r=rss2",
    "title": "Quality Nonsense Ltd: Freelance Writers at WhoIsHostingThis.com",
    "content": "<html><head></head><body><p>Contract</p><p><strong>(Anywhere)</strong> </p><p><strong>We’re looking for reliable, talented <a href=&quot;http://www.qualitynonsense.com/job/freelance-writers/www.qualitynonsense.com/job/freelance-writers/&quot; rel=&quot;nofollow&quot;>freelance writers</a> who love writing about technical subjects.</strong></p><p>You’ll be writing on everything from web hosting to antique programming languages, from internet law to the social impact of encryption.</p><p>And you’ll be working as part of a pool of talented writers producing 10,000s of words of content per week to be published on <a href=&quot;http://www.qualitynonsense.com/whoishostingthis-com/&quot; rel=&quot;nofollow&quot;>WhoIsHostingThis.com</a>, a site that reaches many millions of users every year.</p><h2>About WhoIsHostingThis</h2><p>WhoIsHostingThis.com is one of the worlds most popular web hosting sites. We’ve been featured in The New York Times, Time, Mashable, Daily Mail, VentureBeat, and many more <a href=&quot;http://www.whoishostingthis.com/what-users-say/&quot; rel=&quot;nofollow&quot;>publications in dozens of countries</a>.</p><h2>Who Works For us?</h2><p>We work with a remote team of contractors in dozens of countries all over the world: from Bosnia to the UK to Canada to Australia. We continue to grow at a fast rate, and are looking for more writers to add to our team to keep up the pace.</p><h2>What’s It Like Writing for Us?</h2><p>The work is highly varied, but there is always writing work available for our team of freelance writers.</p><p>One writer might produce a <a href=&quot;http://whoishostingthis.com/hosting-reviews/siteground/&quot; rel=&quot;nofollow&quot;>profle of a hosting company</a> on Monday, an introduction to the <a href=&quot;http://www.whoishostingthis.com/resources/c-sharp/&quot; rel=&quot;nofollow&quot;>C# programming language</a> on Wednesday, and a blog post about people <a href=&quot;http://www.whoishostingthis.com/blog/2015/12/09/chatbots/&quot; rel=&quot;nofollow&quot;>falling in love with chatbots</a> on Friday.</p><p>If that mix sounds exciting, rather than terrifying, then maybe you are the right type of writer to join our team.</p><p>Our CEO is a former writer/editor, and understands the value of quality content.</p><h2>Job Requirements</h2><p>Our team of writers is varied. We have a grumpy physics PhD, an idealistic MBA with a side hustle in Hollywood, and a hyperactive former greyhound racing gambler <em>(or so he says)</em>. </p><p>We have wonderful writers that have worked for some of the world’s biggest websites. And we have exceptional people who only write for us.</p><p>We aren’t looking for clones. But everyone who works for us shares a handful of key attributes:</p><ul><li>Native English speaker with strong writing skills<br><em>(US English, although you can be based anywhere)</em>;</li><li>Exceptional online research skills;</li><li>Some degree of technical proficiency<br><em>(eg, two of our writers can code, most run websites/blogs)</em></li><li>Well organized &amp;  rock steady reliable;<br><em>(ie, deadlines get met on our team)</em></li><li>Working knowledge of HTML and WordPress</li><p><em>(Just the basics, nothing fancy.)</em></p></ul><li><h2>How Do We Work?</h2>You’ll be working as part of <a href=&quot;http://www.qualitynonsense.com/our-team/&quot; rel=&quot;nofollow&quot;>our remote team</a> located in dozens of countries around thw world. We use a few common tools to make that work:-<ul><li>Gmail</li><li>Google Docs</li><li>Asana</li><li>WordPress</li><li>Skype</li><li>Slack</li></ul><h2>What’s a Typical Project Like?</h2>We do a lot of different work. Check out our website, especially the <a href=&quot;http://www.whoishostingthis.com/blog/&quot; rel=&quot;nofollow&quot;>blog</a> and <a href=&quot;http://www.whoishostingthis.com/resources/&quot; rel=&quot;nofollow&quot;>resources</a> sections.</li><p>We are especially interested in people who can tackle very technical subjects, like resources on programming languages. A good example of this is our resource on the <a href=&quot;http://www.whoishostingthis.com/resources/forth-programming/&quot; rel=&quot;nofollow&quot;>Forth programming language</a>.</p><p>Articles are often 1000+ words <em>(and we even have one 60,000 word FAQ!).</em> We are very clear on what we want on every project.</p><p>Most articles can be researched online. However, some will require expert interviews via Skype or phone <em>(we’ll cover costs)</em>.</p><h2>Workload</h2><p>We have as much work as you can handle. We have freelance writers producing as much as 10,000 words per week.  We are looking for writers available of a minimum of one day/week, due to the overhead of managing many writers.</p><p>We don’t micro-manage. We provide projects with descriptions including due dates and required length. There is sometimes communication back and forth <em>(Asana is great for this)</em>.</p><p>But mostly, you write the article and turn it in, we edit it and publish. Writers invoice every other week, and get paid in US dollars by PayPal or wire transfer.</p><p></p><p><strong>Apply:</strong> Please send an email to jobs@qualitynonsense.com with:-- A 4-5 sentence introduction explaining why you think you would be a good fit;- Three URLs showcasing your work related to the internet or technology.- Format your subject line as follows: Your Name | Freelance Writer    Example: Baza Naidoo | Freelance WriterGood luck!</p></body></html>",
    "urlFetchPending": false,
    "published": "Apr 13, 2017 9:20:35 PM",
    "tags": [
      "REMOTE1_100",
      "TITLE1_qa",
      "REMOTE2_locals-only"
    ]
  },
  {
    "id": 522,
    "source": {},
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/22954",
    "title": "Software Quality Engineer Wine",
    "content": "<html><head></head><body><p>In the great Northwest they call it an SDET. &nbsp;Other places they call it a Software Quality Engineer. Whatever they call it, it's you.&nbsp; You've somehow found yourself writing code that tests other people's code.</p><br><p>At Granbury we respect the mighty SQE and we'll need your help making sure wine lovers around the world can have wine delivered to their doorsteps. &nbsp;And no, that isn't a joke. &nbsp;You'll use a new front end test automation tool we've built on top of&nbsp;<strong>Selenium WebDriver</strong>&nbsp;to make sure our DtC wine software works flawlessly.</p><br><p>Like Wes Mantooth, the other developers may hate you for it, but they&nbsp;will&nbsp;respect you.</p><br><p>And they'll work with you. &nbsp;When you need DOM&nbsp;elements to have id's, they will give you id's. &nbsp;You won't have to slog your way through&nbsp;with unwieldy xpath expressions. &nbsp;You won't be a second class citizen and you'll get the respect and support you need. &nbsp;No code ships without a green bar from you.</p><br><p>And you'll do all this from the&nbsp;<strong>comfort of your own home</strong>. &nbsp;This is a remote position, but you'll keep in touch with your team with daily virtual standups. &nbsp;We'll pick a spot on the map every so often and get together for a technical conference or an in person design confab.</p></body></html>",
    "urlFetchPending": false,
    "published": "Apr 11, 2017 2:57:14 AM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 552,
    "source": {},
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/22915",
    "title": "QA Engineer",
    "content": "<html><head></head><body><p>Springboard Retail has built a powerful and easy to use web based retail management platform for multi-channel specialty retailers. At 1,000 sites across North America innovative retailers are leveraging Springboard to operate their businesses more efficiently and profitably than ever before possible. As the leading specialty retail cloud platform, Springboard Retail has a rapidly growing customer base across many retail verticals including apparel, footwear, gifts, accessories, sporting goods, hobbies, toys, museums, nutrition, pet, and jewelry. We work hard and care deeply about our customers’ success. And we’re pleased to be able to say our customers love us!</p><br><p>We are passionately interested in how our customers interface with our products and platform, and in this dynamic market, our goal is to delight them with the best experience every single day. Because Springboard is the lifeline to a retailer’s operation, quality assurance of our product is imperative.</p><br><p>Springboard Retail is looking for someone to own QA for the Springboard Retail platform. In this position, you will engage directly with the engineering and product teams to ensure Springboard consistently delivers the highest quality service. You will report directly to the CTO.</p><br><p><strong>Responsibilities:</strong></p><br><ul><br><li>Become a Springboard Retail product expert</li><br><li>Working with the product and engineering teams to understand requirements, user stories, and acceptance criteria and to translate into detailed, comprehensive, and well-structured test plans and test cases for multiple products</li><br><li>Enhance automated and manual testing infrastructure and draft product release deliverables consistent with established standards, methodologies, and best practices</li><br><li>Performing automated and manual testing of web applications, APIs, and web-based user experiences</li><br><li>Performing automated and manual testing of data analysis code, database queries, and data pipelines</li><br><li>Building our overall testing strategy, in collaboration with engineering and product team leaders</li><br><li>Evangelizing and cultivating the adoption of quality assurance best practices across the team</li><br><li>Estimating, prioritizing, planning, coordinating, and tracking testing activities</li><br><li>Participate in agile working practices such as daily scrum meetings, sprint planning, backlog grooming and retrospectives</li><br><li>Work on hardware simulation tools to allow automating manual tests</li><br><li>Manage and create key metrics to drive towards overall business goals and support critical decision making</li><br><li>Ability to manage multiple projects while meeting tight deadlines</li><br></ul></body></html>",
    "urlFetchPending": false,
    "published": "Apr 8, 2017 12:17:46 AM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 706,
    "source": {},
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/22679",
    "title": "QA Engineer",
    "content": "<html><head></head><body>Fooji, Inc. is a US startup that helps big brands run successful promotions via social media. We work with major household brands that you will definitely be familiar with, helping them acquire and engage fans via social media and on-demand services.We are looking for a QA Engineer to ensure all of our brands' campaigns run smoothly, with no unwelcome surprises. You will be working predominantly in the campaign team, helping to test upcoming campaigns and manage a suite of test scripts that we will use to ensure each campaign is ready to go live. You will work directly with the campaign team engineers and Fooji project managers, communicating bugs to the campaign team engineers and demoing ready campaigns for the project manager.The role can be worked remotely or in our office in Lexington, Kentucky. Preferably you work in an eastern US timezone or a European timezone (GMT -6 through GMT + 2), as we currently have developers working in Eastern Time and GMT.</body></html>",
    "urlFetchPending": false,
    "published": "Mar 29, 2017 7:00:52 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 707,
    "source": {},
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/22676",
    "title": "QA Analyst",
    "content": "<html><head></head><body><div>Modern TribeÃ¢Â Â s QA team works on a lot of cool projects: over the past year alone, weÃ¢Â Â ve tested sites built by our dev team for big-name clients including&nbsp;<a href=&quot;http://columbialawreview.org/&quot; rel=&quot;nofollow&quot;>Columbia Law School</a>,&nbsp;<a href=&quot;http://www.foodinnovationgroup.com/&quot; rel=&quot;nofollow&quot;>Bon Appetit Magazine</a>,&nbsp;<a href=&quot;https://www.eventbrite.com/blog/academy/&quot; rel=&quot;nofollow&quot;>Eventbright Academy Blog</a>,&nbsp;<a href=&quot;http://hls.harvard.edu/&quot; rel=&quot;nofollow&quot;>Harvard Law School</a>&nbsp;and&nbsp;<a href=&quot;https://www.whatshouldwedo.com/&quot; rel=&quot;nofollow&quot;>What Should We Do (WSWD)</a>. (Want to see how we did? The links above highlight some of our work). And thatÃ¢Â Â s not even including our family of WordPress plugins led by&nbsp;<a href=&quot;http://theeventscalendar.com/&quot; rel=&quot;nofollow&quot;>The Events Calendar</a>.</div><div><br></div><div>WeÃ¢Â Â ve got a slew of cool projects we are working on from now through early 2017, and need another member for our QA team. If working on high-profile sites for large clients gets you excited and a serious case of attention to detail is your jam, we should talk.</div><div><br></div><div><strong><strong>Personal Competencies</strong></strong></div><div><br></div><ul><li>Extremely outgoing and friendly attitude</li><li>Strong communication skills</li><li>Experience working as part of a remote team</li><li>Self-motivated, detail-oriented</li></ul><ul><li>Strong organizational skills</li><li>A methodical approach to all tasks</li><li>Ability to prioritize workloads and meet deadlines</li></ul><ul><li>Fluent English speaker</li></ul><div><br></div><div><strong><strong>Knowledge and Experience</strong></strong></div><div><br></div><ul><li>Has a proven track record in Quality Assurance.</li><li>Pays meticulous attention to detail + fights for the customer. Being able to catch bugs is huge, but it isnÃ¢Â Â t everything Ã¢Â Â  QA is most effective when it puts itself in the customer or end userÃ¢Â Â s shoes.</li><li>Knows WordPress well, youÃ¢Â Â ll be expected to prove your familiarity with the platform.</li><li>Excellent verbal, non-verbal and written communication skills</li><li>Has 1+ year remote freelancing experience.</li></ul><div><br></div><div><strong><strong>Bonus Points</strong></strong></div><div><br></div><ul><li>Familiarity setting up local WordPress environments + cloning GIT repositories locally</li><li>Skills at training others how to admin complex WordPress sites/projects</li><li>Experience writing and implementing automated testing processes</li></ul><div><br></div><div><strong>Responsibilities</strong></div><div><br></div><div>QA is responsible for ensuring all aspects of quality at Modern Tribe. ItÃ¢Â Â s a tall order for sure: learning how a site works, creating test plans covering obscure use cases, and then putting it all into practice when testing every aspect of site functionalityÃ¢Â Â¦itÃ¢Â Â s a lot of ground to cover. But weÃ¢Â Â ve got an established workflow down that helps make sure weÃ¢Â Â re setting the team up with the tools they need to proceed and succeed.</div><div><br></div><div><strong>Though every project is different, hereÃ¢Â Â s the gist of our QA flow:</strong></div><div><br></div><ul><li><strong>KICKOFF MEETING.</strong> - Just a kickoff Ã¢Â Â  meet the PM; get your questions answered; set expectations; and schedule milestones.</li></ul><ul><li><strong>PREPARING DOCS. -&nbsp;</strong>Getting started with internal documentation early is hugely important to getting the project into your brain.</li><li><strong>REVIEW APPROVED COMPS. -&nbsp;</strong>Before you start QA or even get a walkthrough, youÃ¢Â Â ll review the comps to understand the project + prepare a list of questions to ask on the QA walkthrough.</li><li><strong>QA WALKTHROUGH. -&nbsp;</strong>Once development is far enough along for QA to begin, youÃ¢Â Â ll do a walkthrough with the lead developer to get an overview of the functionality.</li><li><strong>PREPARE QA CHECKLIST + TEST PLAN. -&nbsp;</strong>After seeing each component of the site in action, youÃ¢Â Â ll put together a first draft at a comprehensive QA checklist and a higher-level overview of what youÃ¢Â Â re planning to test, in what order, and when.</li><li><strong>HEAVY DUTY TESTING. -&nbsp;</strong>YouÃ¢Â Â ll put the site through its paces and give it a few rounds of full pass bug hunting. Beyond just hitting buttons, youÃ¢Â Â ll be thinking from a higher level: are there usability concerns? Does what weÃ¢Â Â re doing here actually make sense as the best way to solve the problem? etc.</li><li><strong>CELEBRATING A SUCCESSFUL LAUNCH.&nbsp;</strong>What feels better than kicking back after a successful launch? If QA has done their job, the project will launch smoothly, the team will have a finished product to show off, and Ã¢Â Â  most importantly Ã¢Â Â  the client will be happy. It doesnÃ¢Â Â t get much better than that.</li></ul><div><br></div><div>* Our QA team also generally leads client training and prepares training documentation/videos when appropriate, so be prepared for some direct client communication.</div><div><br></div><div><strong>Location</strong></div><div><br></div><div>Work from anywhere in the US or Canada; if you are in Central or South America, letÃ¢Â Â s talk. This will be a 100% remote position. PLEASE DO NOT APPLY if your working hours are in a timezone outside of the US range as our team will not be able to support those working hours (weÃ¢Â Â ve tried, itÃ¢Â Â s just too hard).</div><div><br></div><div><strong>Compensation</strong></div><div><br></div><div>Our hourly rate for this gig starts at $30-$40/hr, depending on experience, with opportunities for rate bumps on annual review. This gig is about 6 hours per week of work to start and ramping up to about 15 -20 hours over the next 3 -4 months. This is a one time contract position, though we are always seeking longer relationships with kick-ass people.</div><div><br></div><div><strong>Perks</strong></div><div><br></div><div>We believe that distributed working is a way of life. We understand what it means to work remotely. We offer consistency in expectations, payment, and support. We believe in learning from each other and fostering personal growth. You can expect to learn a lot while working with us. Also, if you work enough hours, we will invite you to go an adventure to attend our annual<a href=&quot;http://tri.be/team-trip-2015/&quot; rel=&quot;nofollow&quot;>&nbsp;team trip</a>.</div><div><br></div><p><strong>To apply:</strong> <a href=&quot;http://tri.be/careers/qa-analyst/&quot; rel=&quot;nofollow&quot;>http://tri.be/careers/qa-analyst/</a></p></body></html>",
    "urlFetchPending": false,
    "published": "Mar 29, 2017 6:22:00 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 708,
    "source": {},
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/22675",
    "title": "QA Engineer",
    "content": "<html><head></head><body><p>Brave&nbsp;is&nbsp;looking&nbsp;for&nbsp;an&nbsp;Android­ focused&nbsp;QA&nbsp;Engineer&nbsp;to&nbsp;work&nbsp;on&nbsp;our&nbsp;latest&nbsp;Chromium­ based&nbsp; Android&nbsp;browser. &nbsp;While primarily testing the Android browser, the candidate would also test the laptop browser and provide support to end-users. This&nbsp;is&nbsp;a&nbsp;high­ profile&nbsp;and&nbsp;impactful,&nbsp;hands­-on&nbsp;position&nbsp;in&nbsp;an&nbsp;early&nbsp;stage startup.<br><br>We are remote-friendly, candidates must be authorized to work&nbsp;in the USA or Canada.</p></body></html>",
    "urlFetchPending": false,
    "published": "Mar 29, 2017 6:08:37 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 925,
    "source": {},
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/56158/test-automation-engineer-the-perfectionist-at-curve/",
    "title": "Test Automation Engineer - ~The Perfectionist~",
    "content": "*Test Automation Engineer*<br />*_~The Perfectionist~_*<br />Shoreditch, London<br />Salary + Equity<br /><br />*Curve is growing - join our adventurous startup!*<br />We believe that the next generation of banking will be a single mobile platform that enables payment anywhere with any card from any account, and connects people in a simple way with the best technologies and financial offers - putting them back in control of their finances.<br /><br />Our team of award winning (voted leading startup at the EPAwards ‘16 and included in Tech City’s Upscale ‘17 startup programme) entrepreneurs, product-builders and customer-focused marketers are developing a ground-breaking product with the customer at the core. To start with, we’ve taken the humble bank card and injected it with a whole load of innovation. Technical complexity, scalability, security and real-time transactions are all part of the day-to-day challenges; the future will include machine learning & big data. <br /><br />With funding from the Who’s Who in angel investors and an experienced and ambitious founding team, we are at the forefront of London FinTech. <br /><br />If you like to be intellectually stretched, your capabilities tested and want an opportunity to have a real voice, input and impactful contribution, then we’re offering that in abundance.<br /><br />*_You bring your expertise; we’ll give you the platform to flex your talent!_*<br /><br />*Role Objective:*<br /><br />Quality Assurance plays an important role in the product development. As The Perfectionist you will be expected to help ensuring the reliability of the product. We expect you to think differently, smarter, so you can dream up all the test cases, specially those edge cases that no one can see until we start getting bug reports from our users. <br />Have you thought about how fast money moves around the world? And, how fast technology is changing the world? <br />Can you imagine how challenging is being responsible to ensure the quality of a revolutionary product that is bringing these two worlds together? Are you ready to ensure the product matches its requirements (functional, design, UX, etc…) and bring great ideas on how to make it even more valuable for our users?<br /><br />*Is this You?*<br />* Motivated to set high standards.<br />* Able to execute your role swiftly and safely in rapidly changing environments.<br />* Revel in fast paced startup environments.<br />* Willingness to learn.<br />* Passionate about user experience.<br />* Keen to use your technical knowledge, expertise and ability with the aim of building an exceptional product.<br />* Comfortable with starting from a blank page and taking responsibility for defining, designing & developing  clear, concise detail oriented test plans/cases from specifications or verbal communications.<br />* Clear communicator (written and verbal).<br />* Excellent Degree in Computer Science or related field.<br /><br />*We’re looking for you to:*<br />* Identify test requirements from specifications, map test case requirements and design test coverage plan.<br />* Develop, document and maintain functional test cases and other test artifacts like the test data, data validation, harness scripts and automated scripts.<br />* Execute and evaluate automated test cases and report test results.<br />* Hold and facilitate test plan/case reviews with cross-functional team members - DevOps, Marketing, Product & Design.<br />* Have experience with iOS & Android functional and UI testing tools. <br />* Ensure that validated deliverables meet functional and design specifications and requirements.<br />* Isolate, replicate, and report defects and verify defect fixes. Escalate any potential quality issues to management in a timely manner.<br />* Creatively and intelligently solve technical problems.<br />* Ability to translate technical requirements into comprehensible test plans.<br />* Working experience with issue/bug tracking tools, ideally JIRA.<br />* Be focused on deadlines and deliverables – an ability to quickly find the defects and bugs.<br />* Have an inquisitive mind - You are always asking how does it work? Why? What if this happens?<br />* Abstract thinker – an ability to not conform to the norm. Norms do not find bugs quickly!<br />* Build a strong quality mindset around the team. It’s going to be Quality First!<br /><br />*We live in an agile era, it’s a plus if you come with experience of:*<br />* Working in an Agile Development environment; preferably SCRUM.<br />* Acceptance Testing and how it applies to Agile Testing.<br />* Working with agile processes, including Test Driven Development.<br /><br />*Robots are the future and so are we!*<br />We love automation here and we hope to automate as many regression tests as possible, therefore we expect you to either have willingness to learn how to automate tests (support in your development will be provided, you won’t be on your own),<br /><br />*Or you have:*<br />A good level of proficiency with one or more programming/scripting languages. <br />Experience with automation frameworks like Selenium, Appium, Capybara or Espresso.<br />Experience working with test automation throughout the Software Development Life Cycle.<br />Familiar with Continuous Integration tools is a plus.<br /><br />*About us*<br />We’re a team of circa 30, who work closely together to turn dreams and ideas into actions and product innovation. With a flat hierarchy and an ability to make decisions quickly, we’re based in a great office in Shoreditch, close to Old Street – the heart of the vibrant tech centre of London.<br /><br />Our user base is growing daily and we have exceptional user retention. We have funding from the leading names in tech investment, and a founder who wants everyone who joins this remarkable adventure, to have the autonomy to exercise and develop their expertise.<br /><br />*Our Recruitment Philosophy & Hiring Principles:*<br />We’re committed to building a product that people want, and we can’t do it without having a talented team with a meaningful stake in the business. Everyone who joins us and contributes to Curve’s success is rewarded with equity.<br /><br />The more talent we have the more we can collectively accomplish - so we support and assist each other to reach and surpass what we think we are capable of.<br /><br />*How we aim to look after you*<br />* Monthly health & wellbeing budget for gym, etc.<br />* If you work late, we make sure you have supper and a taxi home<br />* Team Lunch Fridays<br />* Infinite stream of fruit & snacks and great coffee<br />* Generous holiday allowance<br /><br />*Start a conversation:*<br />By sending us as much information as possible about You, your achievements, your philosophy & ambitions and why Curve is of interest to you.<br /><br />*And by answering this question:* - In an Automated world, how relevant is Manual Testing? And why?<br /><br />_The successful applicant will be required to undertake DBS checks in accordance with regulation._<br /><br />",
    "urlFetchPending": false,
    "published": "Apr 6, 2017 4:37:57 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 1160,
    "source": {},
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/54607/quality-assurance-qa-engineer-mf-at-foodspring/",
    "title": "Quality Assurance (QA) Engineer (m/f)",
    "content": "How do we plan to continue developing the most revolutionary foods of our time at foodspring? With your help! As fitness food pioneers, our mission starts afresh with each new product. This approach requires great ideas. Pure passion. The best minds in their respective fields. Want to contribute to a dynamic company culture? Want to help change the lifestyle of an entire generation? Then you're in the right place!<br /><br />Your role<br /><br />You review business requirements, functional requirements and technical specifications of current software development projects<br />You create, review, update and execute automation scripts as required for development, debugging efforts, and regression activity for regular releases<br />You support the CPO in product feature and design and discussions and create and document knowledge base<br />You support the production deployment with testing and issue resolution  - you structure bug reporting, bug tracking, bug classification & prioritization<br />You collaborate with CTO to define quality process improvements, best practices, and leveraging metrics to ensure QA effectiveness<br />You mentor the Web Development team members on testing and automation solutions<br />You participate in product backlog grooming, story sizing activities while clarifying acceptance criteria<br />You convert requirements and specifications into written test plans, test cases, and occasionally test scripts<br />You define and execute test automation roadmap to reduce manual testing effort<br /><br />Your profile<br /><br />You have at least 2-4 years of experience in a similar role (QA analyst, QA engineer) on web applications (preferably e-commerce industry)<br />You are experienced with automation testing frameworks (e.g. Selenium)<br />You have knowledge in at least one object oriented programming or scripting language (e.g. PHP, Python, Java) is a plus<br />You are eperienced with testing highly scaling responsive websites<br />You bring along knowledge of common browsers, operation systems, devices and their characteristics, limitations and compatibility<br />You have a passion for writing detailed and thorough test cases<br />You are a logic and solution driven thinking and work accurate, precise and sustainable manner<br />You are an  independently working team player willing to create a well working testing infrastructure from scratch<br />You are fluent in English, German is a plus<br /><br />Your opportunity<br /><br />You are looking for your next career step into a role, where you lead and bring in your proven skills as an independ QA Engineer<br />A high degree of creative freedom for you to develop your own knowledge – flat hierarchies and short decision-making channels, a great deal of freedom in your work<br />You will benefit from a professional and highly motivated team – create value and have an impact to our great product and attractive consumer brand<br />You will experience what it is to achieve ambitious goals and to celebrate those achievements as part of a team<br />Your future starts now – the position is available immediately                                                                       <br />                                                   <br />Make an impact<br /><br />Apply here with your complete application (cover letter, CV and relevant references and certificates). ",
    "urlFetchPending": false,
    "published": "Feb 22, 2017 4:29:12 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 1185,
    "source": {},
    "sourceName": "workinstartups-testers",
    "url": "http://workinstartups.com/job-board/job/56322/qa-analyst-at-hero/",
    "title": "QA Analyst",
    "content": "The Company:<br /><br />Make an impact in a rapidly growing start-up. Hero is powering LIVE Shopping for many of the world's fastest-growing retailers. Described by Business Insider as like &quot;WhatsApp for shopping&quot;​, Hero uses messaging, live video and AI to connect online shoppers with associates in-store. <br /><br />Our team of engineers, product designers, and thought leaders are on a mission to humanise ecommerce and enable ambitious retailers to grow. Headquartered in London’s Fitzrovia, Hero was founded in 2015 by the pioneers of app commerce and is privately-funded by global retail and technology investors. It has been featured by Apple, WGSN and The Times.<br /><br />The Role:<br /><br />Hero are looking for someone to maintain the highest level of quality of our consumer and retail associate-facing software products, working alongside a team of designers and iOS, back-end and web engineers. You’ll help formalise our Quality Assurance workflows, putting in place the rigorous procedures that will ensure the highest possible quality across our platform and tooling. With the experience of working under clear QA workflows, you will be excited about the opportunity to put these into place as our team grows.<br /><br />The Responsibilities:<br /><br />Implement and own procedures to inspect and report quality issues<br />Write and maintain test scripts that can be executed against all parts of the Hero platform<br />Appraise delivery against the original requirements<br />Facilitate proactive solutions and feedback<br />Validate bug reports from users and across the business<br />Review current standards and policies<br />Keep records of quality reports, statistical reviews and relevant documentation<br /><br /><br />The Requirements:<br /><br />Proven experience as a quality assurance analyst or relevant role<br />Thorough knowledge of methodologies of quality assurance and standards<br />Experience of testing across multiple platforms (Desktop, Tablet and Mobile testing Web and Native Apps)<br />Experience of using Jira for workflow and defect management is preferred<br />Outstanding communication skills<br />Great attention to detail<br />Excellent organisational and leadership abilities<br /><br /><br />The Benefits:<br /><br />Make an impact in a rapidly growing start-up<br />Work with a talented team of people who love what they do<br />A competitive salary and options in the company<br />A shiny new MacBook Pro and all the software you need<br />A chance to work in a vibrant and creative environment (we work in a beautiful Georgian townhouse opposite a park) with plenty of team lunches and social events<br />All the coffee and tea you can drink<br /><br />Please send a CV and Cover Letter - no recruitment agencies please.",
    "urlFetchPending": false,
    "published": "Apr 12, 2017 9:28:49 AM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 1189,
    "source": {},
    "sourceName": "workinstartups-testers",
    "url": "http://workinstartups.com/job-board/job/55936/qa-analyst-at-voyanta/",
    "title": "QA Analyst",
    "content": "Who we are<br /><br />Altus Group is a leading provider of software, data solutions, and independent advisory services to the global commercial real estate industry. Our businesses, Altus Analytics and Altus Expert Services, empower clients to analyze, gain market insight and recognize value on their real estate investments. Headquartered in Canada, we have approximately 2,300 employees around the world, with operations in North America, Europe and Asia Pacific.<br /><br />The opportunity<br /><br />We are looking for a QA Analyst to join our team of functional testers on our Voyanta product. Someone who is a self-starter, methodical, and detail oriented; someone who can ensure the little things won’t get missed.  In fact, we want someone who focuses on the minutiae.  A QA manual tester who enjoys focusing on specifics features, considering all the variations that are going to occur in the data and testing for that.<br /><br />This is a QA role for someone who enjoys working with big data sets in a MySQL database.  We need a QA Analyst who both loves to work in Agile and yet is flexible to adapting methodologies and introducing new techniques to ensure the best work is being done in the most timely manner. Someone who is accountable, and constantly researching, tweaking, and testing.<br /><br />This is a manual QA tester role, with an opportunity to dig deep and broaden your skills. If you are in a QA role within an enterprise organization, this is a chance to move into a start-up environment, and gain exposure to automation testing, business analyst work, and product development.  Someone who enjoys working in small teams, at a fast-pace, in one week sprints; jumping from discussions with product managers to developers.  Someone with outstanding communication, and a go-get-it-done attitude.<br /><br />If you want to have your voice heard, strengthen your manual testing skills, learn automation, and customize your own career at a growing company, this is the QA Analyst opportunity to consider.<br /><br />Here’s what our QA Analyst will do:<br /><br />- Actively participate in weekly meetings; set and meet weekly sprint deliverables.<br />Work across all areas of the system including financial reports, database, UI and Excel integration.<br />- Test newly developed features as well as regression testing the existing system to ensure a high quality of software.<br />- Analyze feature requirements and devise appropriate and thorough test plans.<br />- Calculate complex expected results for financial reports.<br />- Create and execute weekly test plans.<br />- Produce complex test data that reflects how our clients use the system. This involves developing a good understanding of the structure of property data and reporting.<br />- Undertake both manual and automated testing.<br />- Work alongside the development team and product management team to resolve all issues as efficiently as possible.<br />- Raise bugs and errors and communicate with developers to determine resolution.<br />- Work with product team for clarification on requirements and functionality.<br />- Conduct research, suggest solutions, and generally do whatever it takes.<br /><br />Who are you?<br /><br />- Someone who loves QA! You understand testing principles; and you know how to approach testing in a Java environment.<br />- Bonus points if you have a degree in Computer Science or Math.<br />- Nice to have, but not necessary is familiarity with Selenium, Webdriver, and Cucumber.<br />- Not intimidated by large data sets.  Our system is a very large data management system.  You have experience working with data centric applications systems and you are comfortable with MySQL (or similar technologies).<br />- Methodical, analytical, and detail oriented. You are a linear thinker; yet you are incredibly adept at thinking of all possible answers.  Your passion for math and solutions serves you in considering all of the variations that could occur in data and testing for that.<br />- An outstanding communicator. You have superior communication skills. You are concise, on point, and effective. You know how to listen and how to be heard.  You are able to communicate both user requirements and technical details clearly across the team.<br />- An innovative problem-solver.  You are flexible, but process-focused and you know how to balance urgency with long-term payoff. You are on a continuous search for improvements. You are never in a panic but you know how to get work done quickly, and accurately. Integrity of test results is your priority.<br /><br />Need any more reasons to want to work with us?<br /><br />As we continue to grow, the possibilities for the people that join Altus Analytics are significant. From professional growth to innovation to collaboration we are committed to continuing to foster the right environment to help our people realize their full potential. We give our people the freedom and responsibility to take charge of their career path, bring new ideas to the forefront and work on critical projects that will shape the success of our clients.<br /><br />We thank you in advance for taking the time to learn more about what makes Altus a great place to spend time doing some of your best work. Apply now, refer a friend or stay on top of what’s new by following us on LinkedIn.<br /><br />",
    "urlFetchPending": false,
    "published": "Mar 30, 2017 9:23:01 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 1190,
    "source": {},
    "sourceName": "workinstartups-testers",
    "url": "http://workinstartups.com/job-board/job/55762/test-engineer-at-the-app-business/",
    "title": "Test Engineer",
    "content": "The App Business is looking for a talented Test Engineer to help us build and evolve our testing strategy and test team across an exciting range of projects. We hire passionate, dedicated testers who love to explore and question every step of the software development lifecycle in an open environment.<br /><br />Our ideal Test Engineer believes testing is a collaborative activity, and gets involved with feature development from day one. They contribute to the quality, robustness and reliability of the products we create, and will have the confidence to say “we can’t ship that” if these things are compromised. <br /><br />At the App Business, we believe nothing should impede you from doing your best work. So, we’ve structured the company around this principle in order to give individuals the autonomy to make decisions, to encourage experimentation and to think big.<br /><br />If you want to learn and grow in a supportive environment whilst doing your best work then you are just what we’re looking for.<br /><br /><br />You will be:<br /><br />• A technical expert in helping to deliver quality software.<br /><br />• Involved in innovating and defining how the product you build will work and function.<br /><br />• Learning and collaborating within agile teams.<br /><br />• Focused on new ideas to improve the development process and to keep The App Business ahead of the competition. <br /><br />• An avid champion of exploratory and context driven testing techniques.<br /><br /><br />You must have: <br /><br />• Experience in questioning and championing from a Testing perspective.<br /><br />• The ability to become a subject matter expert for a product.<br /><br />• Excellent experience of Behavioural Development.<br /><br />• Rigour in different testing techniques, test design and test strategies.<br /><br />• Awareness of cross-device, compatibility issues and the challenges they pose to quality.<br /><br />• Experience of working in an Agile team.<br /><br />• The ability and drive to work outside of your comfort zone.<br /><br /><br />It's nice if you have:<br /><br />• Experience with a UI automation framework.<br /><br />• Experience with API and Database testing.<br /><br />• Exposure to and understanding of mobile network architecture and networking principles.<br /><br />• Experience using build and version control tools such Gradle and GIT.<br /><br />• Exposure to the larger Testing community.<br /><br />• A university degree at 2:1 or above.<br /><br /><br />About the App Business <br /><br />Founded in 2009, The App Business runs fast and lean, creating awesome products and services for ambitious clients ready to rethink their business around mobile-enabled users. Based in the heart of London’s thriving King’s Cross, we work in an environment built to help us - and our clients - excel. We invest heavily in this vision, placing the support and development of our teams, as well as our culture, at the heart of everything we do.<br /><br />As a company, we know it is important to acknowledge the effort our people put in - which is why we have a great range of benefits in place, which increase as people grow and develop within TAB. It is one of the many ways we ensure we say thank you, and has lead to us ranking as 'Outstanding' in the independent Best Companies Index.<br /><br />If this sounds like the kind of place you want to work, apply now!",
    "urlFetchPending": false,
    "published": "Mar 27, 2017 3:24:50 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 1191,
    "source": {},
    "sourceName": "workinstartups-testers",
    "url": "http://workinstartups.com/job-board/job/55606/qa-analyst-at-memrise/",
    "title": "QA Analyst",
    "content": "Ever wanted to help build and improve a product that actually helps people do useful things? Here at Memrise we’re building the world’s most joyful language learning app, and you could be a part of it! We already have well over 15 million users, loads of accolades like Google Play App of the Year 2015 and 2016, as well as Self-Improvement App of 2016, and we have massive plans to scale and improve online and mobile learning for everyone.<br /><br />We are looking for an experienced QA Analyst to join our established team and help us take the product to the next level.<br /><br />This opportunity presents the rare chance to join a startup as it scales from millions to tens of millions of active users, and in doing so make a meaningful impact on how people learn around the world.<br />REQUIREMENTS<br /><br />Ideally you will be someone who is well versed in testing online products, mobile apps in particular. If you have knowledge of automated testing all the better, and you get many bonus points for being interested in languages and learning, as well as being bilingual or a polyglot.<br /><br />You should have some or all of the following:<br /><br /><br /><br />Solid commercial experience in a testing role<br />Excellent logic and problem solving abilities, meticulous attention to detail<br />Strong written and verbal communication skills, able to produce documentation and collaborate with others<br />Good understanding of testing methodologies including UAT, system, integration and regression testing<br />Experience in testing within an agile environment (SCRUM)<br />Experience in the use of test management and defect tracking tools<br />Experience in testing mobile or web-based applications<br />Demonstrate a basic level of technical awareness and an understanding of mobile/web application architectures<br />Ability to communicate with various stakeholders (both technical and non-technical)<br />Ability to work well within a team setting<br />Excellent logic and problem solving abilities, meticulous attention to detail<br />Strong written and verbal communication skills, able to produce documentation and collaborate with others<br /><br /><br />If you aren’t completely confident that you fit our exact criteria, please get in touch immediately. Humility is a wonderful thing and we’re not interested in hiring ‘rockstars’ or ‘ninjas’. And we're at least as interested in character as in talent.<br />BENEFITS<br /><br />Fresh fruit; coffee and soft drinks. We keep you fuelled with a wide ever-changing variety of healthy and unhealthy snacks, breakfast materials and weekly team lunches. We have frequent team expeditions, the last one being a lovely canal cruise in the summer sunshine! We run a cycle to work scheme and a selection of useful perks and benefits. You'll get to work the people in this video:<br /><br />https://www.youtube.com/watch?v=wORv8J1n0y8",
    "urlFetchPending": false,
    "published": "Mar 22, 2017 12:16:19 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 1192,
    "source": {},
    "sourceName": "workinstartups-testers",
    "url": "http://workinstartups.com/job-board/job/55453/product-quality-assurance-manager-at-qudini/",
    "title": "Product Quality Assurance Manager",
    "content": "We are a fast-growing technology company that offer an innovative B2B Customer Experience SaaS solution. We work primarily with the enterprise retail market, but also have clients in: health care, local government, hospitality and entertainment/leisure. We work with significant global brands, including O2, Telefonica global and House of Fraser.<br /><br />We are growing our energetic and ambitious team, and looking for individuals who are driven, dynamic and keen to make an impact within a small business. We value people with a high-growth mind-set and innovative vision, individuals who are also analytical in their approach and keen to learn and be challenged.<br />We offer an innovative and growing web-based SaaS platform as well as natives tablet/smartphone apps for android, iOS and Windows.<br /><br />We are hiring an experienced Quality Assurance Manager to join our growing team of 14 developers, developer operations and User Interface designers. You will report to our CTO/Co-Founder and work with our CEO/Co-Founder managing the product, you will also manage a junior QA executive.<br />The ideal candidate will be analytical, thorough and will have strong values for quality, innovation and fantastic user experience. You will be looking to progress within the company into a Senior QA or a Product Business Analyst role.<br /><br />Responsible for monitoring general performance and UX of our SaaS product and reporting issues to development<br />Track and manage issues and bugs within the system and communicating with relevant teams around delivery<br />Define test strategy and write test plans<br />Facilitate proactive solutions by collecting and analysing quality data<br />Implement new testing processes, plans and programs<br />Overseeing the complete end stage of product delivery to production servers (innovating the process in delivery), including:<br />Reviewing and completing Jira tickets waiting for QA<br />Checking the product works against the original scope and making notes against the original scope of any deviations to discuss with the product & development team<br />Testing bugs and issues and managing the developer team through completing them alongside our required release plans<br />Providing user experience feedback to generally improve the product<br />Test the product against a variety of use cases<br />Develop, write and execute user stories, test cases<br />Devising and performing test automation projects and supporting the development team in building up a complete test automation suite. Currently using Selenium, Protractor, JUnit with a Bamboo CI<br />Perform stress and load test scenarios with our CTO and Dev Ops team<br />Working with the CTO to finalise release functionality<br />Providing image content and brief overviews on the new functionality for sales and training packs and training the project management teams on how new functionality works<br />Writing engaging release notes (with imagery) for our web and apps and packs for internal and client use<br />Becoming a team member who fully understands the product to be able to help advise team members with questions<br />Where required, attending scoping sessions to discuss requirements and use cases<br />Involved in product backlog grooming process to discuss completion of issues and upcoming needs<br /><br /><br />*Minimum Qualifications:*<br />* Bachelor’s Degree in Business, Finance, Maths or other related field<br />* 2+ years of QA testing and test automation<br />* Strong organisational skills with attention to detail and the ability to multi task<br />* Strong verbal communication skills<br /><br />*Desired Qualifications:*<br />* Proven knowledge of software design, SDLC, software requirements documentation<br />* Strong understanding of SCRUM, Agile and other development methodologies",
    "urlFetchPending": false,
    "published": "Mar 18, 2017 11:45:03 AM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 1196,
    "source": {},
    "sourceName": "workinstartups-testers",
    "url": "http://workinstartups.com/job-board/job/55147/qa-superstar-at-bookingbug/",
    "title": "QA Superstar",
    "content": "BookingBug is the industry’s most advanced, powerful and versatile appointment and event booking platform, and one of London’s fastest growing technology start-ups. Using a combination of cutting-edge front end technologies, and a truly open and scalable cloud-based API architecture, we’re able to design solutions that can accommodate the wildest of client requirements.  As technology progresses, so do we; re-architecting and expanding our platform to take advantage of new ideas, methodologies, and the latest and greatest trends in the technology industry. <br /><br />It’s an exciting time to join BookingBug. We’re enhancing our testing landscape and looking for a dedicated QA [or quality focused software guru] to join one of our project teams (affectionately named after video games). The BookingBug platform is built on an interesting tech stack and the product roadmap is constantly in a state of flux.  It’s all forward thinking in an exciting time.<br /><br />About the role<br />Based in our London HQ, you’ll be working across a range of internal and client projects - including a growing list of major UK and US brands. The QA crowd work together with corresponding folk, utilising common tools and techniques to find out what the development and project management teams may not before the end user does, with added evidence and supporting metrics.<br /><br />In the role, you will:<br />●    Use your knowledge of enterprise testing to help us develop our QA processes<br />●    Work with development, engineering and project teams to produce quality, tested features<br />●    Contribute to the release cycle by monitoring quality on all environments <br />●    Plan testing from early design and specification stages to ensure robust implementation<br />●    Create test cases, modify existing tests and record and document unplanned exploratory tests<br />●    Maintain JIRA and help to school other team members on defect etiquette <br />●    Produce reports and maintain document hygiene in our JIRA, WIKI and google doc repos<br />●    Show initiative and out of the box thinking when discussing unexpected paradigms<br />●    Support clients and BookingBug staff by training and sharing techniques and information<br /><br />About You<br />The role requires the following skills and experience as a minimum:<br />●    Understanding of contemporary web development processes and release cycles<br />●    Knowledge of core web tech (HTML, CSS, JS, and relevant frameworks) <br />●    JIRA, git, Gherkin, TestRail or contemporaries <br />●    Test planning, test reporting, test metrics, sprint management, exploratory testing, mobile testing, documentation<br />●    Excellent skills with office suites; experience of process development, reports, writing plans & test cases, feature scoping, enterprise-level documentation<br />●    Dedication to technical issues; solving (and creating) in creative ways<br />●    A tester’s outlook on new functionality and a QA’s desire to maintain quality<br />●    Talent in translating code/ techspeak/ jargon into human readable instructions and vice versa<br />●    Computer science fundamentals are a plus<br />●    Bug tracking, version tracking, release tracking, tickets (JIRA, Git, Zendesk, etc.) a must<br />●    Relevant test certifications / qualifications strongly desirable<br />●    Experience of working with teams to help develop & streamline test processes<br />●    A confident, enthusiastic attitude and an understanding of and enthusiasm for, small company culture and dynamics<br />●    All relevant business or educational experience taken into consideration<br /><br />This is a unique opportunity to join a company that has the stability and commercial success of a big business, but the heart & soul of a start-up. Our Dev teams are working on truly interesting challenges – engineering issues, scalability, latency, distributed systems… so we need someone who is motivated by problem solving & seeing the wider impacts of their work. If this sounds like you we’d love to hear from you! We’re based in Farringdon in a dynamic, fun office, and have international offices in Boston and Sydney as well. Our team is very diverse, with backgrounds spanning from astrophysics to criminology to music management, and we pride ourselves on our great working culture.<br />",
    "urlFetchPending": false,
    "published": "Mar 9, 2017 3:44:07 PM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 1719,
    "source": {},
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=14029414",
    "title": "CareMessage (YC W14) | QA Automation Engineer | REMOTE | Full Time | http://caremessage.org",
    "content": "<html><head></head><body><div>                  <span>CareMessage (YC W14) | QA Automation Engineer | REMOTE | Full Time | <a href=&quot;http://caremessage.org&quot; rel=&quot;nofollow&quot;>http://caremessage.org</a><p>CareMessage is looking for a QA Automation Engineer to help with manual and automated quality assurance of the CareMessage web application and API. You will be responsible for entire features and will be a full member of the CareMessage Engineering team. Our team believes in an Agile development environment, test driven development. Our tools of choice are Ruby on Rails, AngularJS, PostgreSQL, and we place an emphasis on open collaboration and ownership. We're using Protractor for automated frontend testing so knowledge in that is a plus. When something isn’t working, we’re not afraid to throw it out and try something new - so if you have exciting ideas about the QA process and how to make your own job even easier, you’ll fit right in. All of our developers and QA engineers are working from a remote location.</p><p>Apply here: <a href=&quot;http://grnh.se/lt3wim&quot; rel=&quot;nofollow&quot;>http://grnh.se/lt3wim</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div></body></html>",
    "content2": "<html><head></head><body></body></html>",
    "urlFetchPending": false,
    "published": "Apr 4, 2017 8:00:04 AM",
    "tags": [
      "REMOTE1_100",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 1169,
    "source": {},
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/54539/automation-qa-engineer-at-simplify-digital/",
    "title": "Automation QA Engineer",
    "content": "*QA Engineer*<br /><br />_Want the environment of a start-up (no suits, flexible working..) That has the support & backing of a FTSE 100 company?_<br /><br />We're a tech business that's growing fast. We develop deal comparison SaaS for triple play:  TV, Phone and Broadband. It's a complex industry - with over 5000 products available - so we're here to make it a little bit easier to choose the right option. Not only that, we recently developed an app to help people save on their energy bills called Voltz . It's had phenomenal feedback on the app store (4+ stars)<br /><br />We use our SaaS software ourselves, but it's also used by companies like Dixons Carphone, Sainsburys, Game, CompareTheMarket, BSkyB, TalkTalk ...<br /><br /><br />*The Role*<br /><br />The Quality Assurance Engineer position will report to the QA lead, working in a Scrum team and closely with stakeholders and product managers on a number of high profile projects. Our QA lead joined us in 2016 and has had a phenomenal impact on how we 'do' QA - and she's a great person to learn from. <br /><br /><br />Besides improving your skills, your day to day work could involve:<br /><br /><br />* Working in a collaborative, Agile, team environment on a range of different projects from e-commerce websites to SaaS enterprise solutions and tools.<br />* Liaising with the technology team and wider business to effectively complete these projects<br />* Contributing to the Technology strategy and architecture by suggesting new technologies, techniques and solutions<br /><br />*What you'll bring with you:*<br /><br />* Automated web testing using Selenium WebDriver or similar (Cucumber, SpecFlow)<br />* Manual web/e-commerce testing experience<br />* SEB/ISTQB certified<br />* Experience writing black box and GUI test cases, designing tests to mitigate risks, and helping business experts define requirements.<br />* Experience collaborating with programmers and business experts<br />* Excellent communication skills and ability to work effectively in a close team.<br />* Degree in a STEM subject such as Computer Science, Mathematics, Physics, etc<br /><br /><br />*Bonus if you have:*<br /><br />* Experience of working in an Agile environment (SCRUM/XP/lean)<br />* Automated mobile testing using Calabash, Appium or similar<br /><br />*If that sounds like you, then we can offer:*<br /><br />* 25 days holiday, increasing by one day for every year of service (up to 30 days)<br />* Flexible working.<br />* Relaxed work environment - we've also got an open plan kitchen with a pool table.<br />* Several team events during the year including a legendary Christmas party.<br />* Subsidised healthcare.<br />* Casual dress – no suits!<br />* Free fruit, coffee, tea and milk.<br />* Company Bonus.<br />* Subsidised gym membership with Virgin Active.<br />* Free eye test.<br /><br /><br />*A few of our awards include:*<br /><br />- One of Europe's fastest growing technology businesses in the 2013 GP Bullhound Media Momentum Awards<br /><br />- We've been awarded the Sunday Times Tech Track 100<br /><br />- The Deloitte Technology Fast 50 awards for the past three years in a row (2015, 2014 & 2013)<br /><br />- In 2016 we were acquired by Dixons Carphone<br /><br />_Sounds good? Apply and let's chat._",
    "urlFetchPending": false,
    "published": "Feb 21, 2017 10:17:45 AM",
    "tags": [
      "REMOTE1_50",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  },
  {
    "id": 1195,
    "source": {},
    "sourceName": "workinstartups-testers",
    "url": "http://workinstartups.com/job-board/job/55298/junior-qa-engineer-at-urban-massage/",
    "title": "Junior QA Engineer",
    "content": "Hi, recruiter! If you're reading this and looking to work with us please go through the document on our careers page (it's on every job advert). Thanks!<br /><br />ABOUT URBAN MASSAGE<br /><br />We're very proud to be a fast growing start-up making our mark on the well-being industry. Our world-class platform enables brilliantly talented therapists to provide caring treatments to customers wherever and whenever they want a well deserved treat. In the past 2 years we've launched in 3 international locations, provide over 7,000 massages a month. We're now looking at many other international locations this year and a range of different wellness services.<br />As a team, we're just under 50 global employees. We do all we can to make our work environment one we love, can be ourselves in, and can be really successful in. This means lots of working and playing hard (at our Friday drinks and socials) and a chilled office full of ping-pong tables, free yoga classes and pets. Our roles come with a lot of responsibility and empowerment - we like to employ brilliant people and give them the freedom to achieve brilliant things. You can find more passionate detail about working here on Glassdoor - or just ask us!<br /><br />THE ROLE<br /><br />As a Junior QA Engineer you would be focused on supporting the Product team. We're working hard to take our product to the next stage as our start-up expands in the UK and internationally so it's a really exciting time to join us and be part of that experience!<br />Our product team presently has 12 highly-skilled employees working across design/engineering and testing. You'd work closely with other multi-discipline engineers. Our fast-moving team bring together strategy, creative and technology in agile programmes of work. We embrace strong development standards, TDD, continuous integration, peer review, test automation and replicable deployment processes.<br />Within this role, you'd be encouraged to explore new technologies where good business value is evident. We currently have several applications that are supported on multiple platforms - Web, Mobile (iOS and Android). We'd like you to be comfortable testing on all of these.<br />Currently, we have a highly experienced QA lead leading all of the testing + release process within the Product team. As a quality driven team, we have identified a need for additional resource to ensure we continue to deliver stable, well tested work to our users. Your day-to-day work will report into this thought-leader, who has a wealth of knowledge to help you upskill throughout your career with us.<br />We'd like for you to come with experience in this space already and the drive to draw on it to make a brilliant impact.<br /><br />RESPONSIBILITIES<br /><br />Review requirements, specifications and technical design documents to provide timely and meaningful feedback<br />Identify, record, document thoroughly and track bugs<br />Perform thorough regression testing when bugs are resolved<br />Develop and apply testing processes for new and existing products to meet consumers needs<br />Liaise with internal teams (e.g. developers and product owner) to identify system requirements<br />Stay up-to-date with new testing tools and test strategies<br /><br />REQUIREMENTS<br /><br />We expect our Engineers to have experience in:<br />Knowledge of QA concepts<br />Strong organization, analytic and problem-solving skills with great attention to detail.<br />Familiarity with Bug tracking (such as Jira) and version control system (Github) is preferred.<br />Picking up new technologies when appropriate for the task in hand<br />We also expect you to genuinely enjoy your craft, to take initiative, and want to help do things better<br /><br />BENEFITS<br /><br />Competitive salary (based on experience)<br />Join a fast-growing and exciting start-up with excellent growth opportunities<br />Working with a fun, international and highly-motivated team where there's never a dull moment!<br />Well-speced Apple hardware<br />A generous conference and training budget<br />Free weekly yoga sessions<br />Discounts on at-home massages<br />Fully stocked fridges<br />Central London office with great transport links",
    "urlFetchPending": false,
    "published": "Mar 14, 2017 5:33:18 PM",
    "tags": [
      "REMOTE1_50",
      "REMOTE2_America",
      "TITLE1_qa"
    ]
  }
]
}
