{
 "items": [
  {
    "id": "mfn0RQGnReuK9YoWF2zwQg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/155664/senior-etl-sql-developer-topdevz?a=QcHy6bKvlvy",
    "title": "Senior ETL/SQL Developer at TopDevz (Sacramento, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Agile Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are looking for an experienced, senior, ETL developer&nbsp;who is excited to work on one of our many client projects. The successful candidate will have extensive experience in ETL processing, PowerBI and Tableau, and creating intuitive dashboards to gain insights into the data. &nbsp;This is a remote position (US / Canada only).</p><p><strong>Skills &amp; Requirements</strong></p><p>The following skills are required:</p><ol><li>Very experienced (5+ Years) in&nbsp;<strong>ETL processing</strong></li><li>Very experienced (5+ Years) in&nbsp;<strong>Tableau</strong></li><li>Very experienced (5+ Years) in&nbsp;<strong>PowerBI</strong></li><li>Very experienced (5+ Years) in&nbsp;<strong>SQL Server</strong></li><li>Experience (2+ years) with <strong>MongoDB</strong></li><li>Knowledge of a typical development lifecycle (development to deployment) using typical industry tools, e.g. Atlassian JIRA and BitBucket</li><li>Good written and verbal communication skills</li><li>Significant attention to detail when writing code, including good commenting and code documentation skills</li></ol>                    </div>                            <h2>                About TopDevz            </h2>            <div><p>TopDevz is a boutique software development consulting agency. We place major focus on not just delivering excellent value and top-notch software to our clients, but also the happiness of our team. We are providing a friendly, remote work environment as well as a suite of interesting and challenging projects to work on.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Incredible Colleagues                            </div>                            <div>                                 Competitive Compensation                            </div>                            <div>                                 Friendly Work Environment                            </div>                            <div>                                 Interesting and Challenging Projects                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_mongodb",
      "TITLE1_dbms",
      "TECH2_sysadmin",
      "TECH2_sql-server",
      "TECH2_powerbi",
      "REMOTE1_100",
      "TECH2_etl",
      "TZ_unknown",
      "TECH2_tableau"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "etl",
      "mongodb",
      "powerbi",
      "sql-server",
      "sysadmin",
      "tableau"
    ]
  },
  {
    "id": "5XW2fqjdTXay_awZMb7jOw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/141988/senior-oracle-plsql-developer-integrated-data-services-ids?a=LCl1eS9v08U",
    "title": "Senior Oracle PLSQL Developer at Integrated Data Services (IDS) (Washington, DC) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Database Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Financial Technology, Government, Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Senior Oracle PLSQL Developer</strong></p><p>Los Angeles, CA; Washington D.C.; Rochester, NY; Dayton, OH</p><p><strong>Company Overview:</strong></p><p>Integrated Data Services, Inc. (IDS) is a leading provider of custom software products and Government financial management services. IDS was founded in 1997 in El Segundo, CA, and since that time has seen tremendous growth and success. Currently IDS has offices supporting customers nationwide. By providing customers with fast, efficient and reliable information systems and support services, IDS has become a preferred provider of financial and programmatic systems, services, and solutions across a wide variety of Government agencies.</p><p><strong>Position Description:</strong></p><p>IDS is seeking a Senior Oracle PL/SQL Developer with an expert understanding of the Oracle RDBMS, SQL and PL/SQL. You will be responsible for the architecture and development of Oracle databases, SQL scripts, PL/SQL Scripts and database Packages, Triggers and Types. We’re looking for somebody who is a confident problem solver and who proactively challenges traditional solutions. Candidate will have opportunities to expand their skill set by working on JAVA EE applications and front-end projects using HTML/CSS/SASS, AngularJS and JavaScript.</p><p><strong>Responsibilities include, but are not limited to:</strong></p><ul><li>Oracle database full life cycle development including data modeling, database architecture, SQL and PL/SQL development, unit testing and support.</li><li>Develop high quality software for web-based applications, create fast, easy-to-use, high volume production code, and develop prototypes quickly.</li><li>Contribute in the architecture and implementation of changes across our product base.</li><li>Develop detailed technical analysis and design specifications based on functional requirements.</li><li>Collaborate heavily with fellow developers, designers and analysts to solve problems.</li><li>Create and improve existing reusable database objects.</li><li>Optimize and tune SQL queries to maximize speed and scale.</li><li>Set and follow coding standards.</li></ul><p><strong>Knowledge and Skills:</strong></p><ul><li>7+ years of experience developing Oracle SQL and PL/SQL.</li><li>Experience with continuous integration tools (Jenkins and Hudson) and source control systems (SubVersion, Git).</li><li>Disciplined approach to testing and quality assurance.</li><li>Experience developing JAVA EE applications a plus.</li><li>Experience developing Single Page Applications (SPA) utilizing Bootstrap, AngularJS, backbone.js or Node.js a plus.&nbsp;</li></ul><p><strong>Education and Work Experience:</strong></p><p>This position requires a minimum of a 4-year degree from an accredited college or university in engineering, information technology, computer science, or other related disciplines. Equivalent work experience may be acceptable in lieu of a degree.</p><p><strong>Certificates and Licenses:</strong></p><p>Applicants selected for employment will be subject to a Federal background investigation and must meet additional eligibility requirements for access to classified information or materials.</p><p><strong>Travel:</strong></p><p>Some travel may be required.</p><p><strong>Hours:</strong></p><p>Normal work schedule will be 8:00 A.M. to 5:00 P.M., Monday through Friday. May be required to work additional hours and/or weekends, as needed, to meet deadlines or to fulfill travel obligations.</p><p><strong>Salary Range:</strong></p><p>Commensurate with experience.&nbsp;</p><p>Company offers full-benefits package including health, dental, vision and 401K plans. IDS is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regards to race, creed, age, sex, gender, physical or mental disability, sexual orientation, gender identity, gender expression, ancestry, pregnancy, perceived pregnancy, medical condition, marital status, familial status, color, religion, uniformed services, veteran status, national origin, genetic information, or any other characteristic protected under local, state or Federal law. A submission of a resume is an expression of interest and not considered an application.</p><p>For more information, visit <a href='http://www.get-integrated.com/' rel='nofollow'>www.get-integrated.com</a>. To apply, please send a resume and cover letter to <a href='mailto:jobs@get-integrated.com' rel='nofollow'>jobs@get-integrated.com</a> and reference code: SO-OD-VL.&nbsp;</p><p><strong>Please note:</strong> All candidates for this position will be required to complete a skills based test to demonstrate expertise in the following areas: 1) a programmer’s ability to write a recursive function; 2) a programmer’s ability to handle boundary conditions; and 3) a programmer’s ability to come up with a performant solution.&nbsp;The test should take between 2-4 hours.&nbsp;</p><p><strong>**U.S. citizenship and/or green card is required; H1-B visas and other visas are not being sponsored. Relocation expenses are NOT compensated. All jobs are employer paid; no fees to candidates. Third parties or agencies inquiries are not being accepted.**</strong></p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Company Paid - Employee Medical, Dental, Vision, Disability and Life                            </div>                            <div>                                 Other Benefits - Coverage for Dependents, Pre-Tax FSA's and AFLAC                            </div>                            <div>                                 401(k) - 3% Safe Harbor Plan with 100% vesting upon date of entry                            </div>                            <div>                                 Competitive Salary                            </div>                            <div>                                 Paid Time Off (PTO) - Vacation/Sick                            </div>                            <div>                                 Paid Holidays - Federal Calendar                            </div>                            <div>                                 Work/Life Balance                            </div>                            <div>                                 Remote Work and/or RDO Schedules (Depending on Location and Position)                            </div>                            <div>                                 Business Casual Attire (Location specific)                            </div>                            <div>                                 A place for talented people to grow                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_css",
      "TITLE1_dbms",
      "TECH2_html",
      "REMOTE1_100",
      "TECH2_plsql",
      "TZ_unknown",
      "TECH2_java-ee",
      "TECH2_rdbms"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "css",
      "html",
      "java-ee",
      "plsql",
      "rdbms"
    ]
  },
  {
    "id": "SM0MuPqqSIS2zV7C-fNmfg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/142097/nodejs-mysql-developer-vimbly?a=LEBxn4PeBEY",
    "title": "Node.js / MySQL developer at Vimbly (New York, NY) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Recreation &amp; Leisure, Software Development / Engineering, Web Development</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Why join Vimbly?</strong></p><p>Vimbly Technologies is a funded and profitable web 2.0 startup looking for a highly motivated, hard-hitting Node.js developer to join the team. &nbsp;Vimbly Technologies is a fast-paced company focused on creating custom best-in-class, high-performance solutions for&nbsp;enterprises spanning a variety of industries. &nbsp;At Vimbly, you’ll work side-by-side with proven talent, creative intelligence, and smiley faces (with firm but non-painful handshakes) -- out of our office in the best city in the world, right across from the Empire State Building. Your work will have a direct and meaningful impact on the product. We aren't looking for another cog in the wheel. You will be given significant responsibility and independence. You will be challenged.</p><p><strong>Node.js Developer</strong></p><p>We are looking for a Node.js developer with a burning curiosity, passion for building great products, track record of writing maintainable code, and reputation of being reliable and efficient.</p><p>Candidates able to&nbsp;join our&nbsp;team on-site in our office in Midtown Manhattan&nbsp;are highly preferred,&nbsp;but consideration for remote work will be given to exceptional candidates. &nbsp;Please indicate your location on your application;&nbsp;applications&nbsp;without&nbsp;location will be ignored.</p><p><strong>Responsibilities</strong></p><ul><li>Work directly with leadership on implementing cutting-edge company initiatives</li><li>Develop scalable and robust back-end systems (e.g., payment, analytics, scheduling)</li><li>Work with front-end&nbsp;team&nbsp;to integrate user-facing markup into systems</li><li>Take ownership of multiple projects and learn new technologies over time</li></ul><p><strong>Benefits</strong></p><ul><li>100% employer-covered health, dental &amp; vision insurance</li><li>Unlimited vacation days (just get your work done)</li><li>Activity budget to try items on Vimbly -- try one, try them all!</li><li>Personal movie outings (you'll get more pairs of movie tickets than you're able to use -- so you'll know the contrast from a Vimbly activity!)</li><li>Unlimited Amazon reading budget to buy any book you please</li><li>Monthly social outings (Laser tag and paintball? Coming right up...)</li><li>Monthly massage and optional monthly manicure… except they come to you</li></ul><p><strong>Skills &amp; Requirements</strong></p><p><strong>Requirements</strong></p><ul><li>Expert-level experience with&nbsp;Node.js and MySQL</li><li>Deep understanding of Node promises and event loop</li><li>Basic understanding of front-end development and implementation (HTML5, CSS3, and jQuery)</li><li>Knowledge of Git version control</li><li>Exemplary attention to detail</li><li>Bachelor's degree in computer science, engineering, or equivalent</li></ul><p><strong>Optional Bonus Points</strong></p><ul><li>Basic knowledge of system administration in Linux and Apache</li><li>Experience with Angular 2.x / 4.x</li><li>Experience working with large datasets</li><li>Experience with&nbsp;process efficiency optimization</li></ul>                    </div>                            <h2>                About Vimbly            </h2>            <div><p>Founded in 2011, Vimbly is a funded web 2.0 startup that lets users find and book recreational activities for free. Our mission is to eliminate hours of research for thousands of activities like tango lessons, intro photography classes, or Italian cooking sessions. All the information is in one place instead of the usual process of Googling, picking nearby locations, checking prices, manually comparing schedules (which are each presented differently), and then exchanging emails to lock it down.</p><p>The Vimbly team is a diverse, smart and energetic group of problem solvers. &nbsp;We are each experts in our specific trade, unified by a passion to build a great product that will change the way people discover activities, date ideas, things to do, and life experiences.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Health / dental / vision insurance                            </div>                            <div>                                 Activity budget to try items on Vimbly                            </div>                            <div>                                 Unlimited vacation days (just get your work done)                            </div>                            <div>                                 Monthly massage and optional monthly manicure... and they come to you                            </div>                            <div>                                 Monthly social outings (laser tag and paintball? Coming right up...)                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TITLE1_dbms",
      "TECH2_node.js",
      "REMOTE1_100",
      "TECH2_angular",
      "TZ_unknown",
      "TECH2_mysql"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "angular",
      "mysql",
      "node.js"
    ]
  },
  {
    "id": "1vM3G8-cQQSplcSPUqrNaw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157867/full-stack-developer-c-sharp-react-sql-server-azure-assuresign?a=QWvz5lAOnfO",
    "title": "Full Stack Developer (C#/ React/SQL Server/Azure) at AssureSign (Atlanta, GA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Javascript/C# Software Developer</strong></p><p><strong>Job Description</strong></p><p>Growing software company looking for a self-starting, experienced, and versatile software developer based in Atlanta, GA or remote.</p><p>This skilled developer will work primarily out of our main office in the Atlanta Tech Village as an addition to our software team.</p><p>This team meets (virtually) and is responsible for rolling out regular releases to several web, mobile, and desktop applications.&nbsp; At a high level, this developer will be responsible for:</p><ul><li>designing and implementing new features and functionality for both new and existing web, mobile, and desktop applications</li><li>conducting R&amp;D with new libraries, frameworks, and technologies</li><li>reviewing code</li><li>fixing bugs (nobody likes it, but we’ve all got to do it)</li><li>contributing to product documentation</li><li>responding to more technical questions from customers than we care to</li><li>communicating openly and effectively with co-workers and customers</li></ul><p>We utilize agile methodologies and typically follow a 2-week release cadence. In addition to our daily scrum meetings via Skype, we also meet weekly (virtually) to share our progress with the entire time. Once or twice a year we meet for in-person meetings/trainings.</p><p>We make heavy use of Visual Studio Online for backlog and issue tracking. We love Open Source, but we don’t shy away from spending money to make sure we have the right tools for the job.&nbsp; We aren’t afraid of trying new technology and make a point of regularly evaluating new tooling, libraries, and frameworks.&nbsp;</p><p>Work schedules are flexible, but reasonable availability for meetings, collaboration, and customer support during core business hours is required.</p><p><strong>Skills &amp; Requirements</strong></p><p>Our ideal candidate will exhibit:</p><ul><li>proven experience developing large, rich JavaScript applications</li><li>demonstrable skills working with responsive design, HTML 5, and CSS</li><li>a solid command and understanding of C# and ASP.NET</li><li>the ability to work easily in a variety of programming languages and environments to support a variety of web, mobile, and desktop applications</li><li>an approach of always writing code as if they are the ones that will have to maintain it over the long haul (because who knows, maybe they will be…)</li><li>a serious interest in learning about and trying out new technologies and platforms</li></ul><p>In addition, the following would be beneficial:</p><ul><li>a working knowledge of SQL (ideally SQL Server)</li><li>experience developing JavaScript applications using TypeScript</li><li>experience working with cloud services, SQL Database, and BLOB storage in Microsoft Azure</li><li>professional-level written and verbal communications skills</li></ul><p>If you have the experience and skills listed, we’d love to hear from you.</p><p>NO recruiters please.</p><p><strong>About Us</strong></p><p>AssureSign has been providing mission-critical electronic signature solutions to enterprise customers since 1999.&nbsp; With over 180 million global signature events to-date, AssureSign is a clear leader in the market in both cloud and on-premise deployments.</p><p>We are headquartered in Atlanta, GA and are fortunate to call the Atlanta Tech Village our home.&nbsp; We work in a mixed physical/virtual environment with some employees based out of our Atlanta office and others working from home.&nbsp; We’ve worked hard over the past couple of years to completely virtualize our network and server infrastructure.&nbsp; All of those services now reside in the Microsoft Azure cloud.</p><p><strong>Our Technology Stack</strong></p><p><strong>Web Applications</strong></p><p>On the server-side, our web applications typically leverage ASP.NET (C#) and SQL Server (typically Azure SQL Database).&nbsp; With a service oriented architectural style, we rely on Nancy FX to develop our light-weight .NET-based HTTP services.</p><p>On the client-side, we make heavy use of JavaScript to create rich client-side experiences.&nbsp; Most of our code is written in TypeScript using React and Redux. &nbsp;We typically utilize a Gulp-based build system to generate our client-side code (CSS, JavaScript) from our source TypeScript and LESS files and to maximize our control over the build process.</p><p><strong>Mobile Applications</strong></p><p>We currently offer native mobile applications that work with our core SaaS product and specifically target: iOS, Android, and the Universal Windows Platform (UWP).</p><p><strong>Desktop Applications</strong></p><p>Our .NET based Windows desktop applications are designed to complement our core SaaS web application and make heavy use of the web-based API for our core application.</p><p><strong>Why Work at AssureSign?</strong></p><p>Our product: We’re <strong>customer centric</strong> and committed to continuous improvements to stand out from the competition.&nbsp; The backlog never gets smaller, but the product continues to evolve and improve.</p><p>Our Team: We’re <strong>team players</strong> - We’re committed to the growth of our company and product and are <strong>supportive</strong> of one another.&nbsp; We’re looking for a <strong>motivated</strong> developer to join us who thrives in a fast pace environment.&nbsp;</p><p>We’re passionate about what we do, and have an ‘all hands on deck’ mentality when it comes to the success of our company and product.&nbsp; We <strong>adapt</strong>, we find solutions, and are willing to question assumptions and think outside the box. We are looking for someone who shares those characteristics and is truly passionate about coding.</p><p><strong>Benefits</strong></p><p>In addition to competitive pay, AssureSign offers the following benefits:</p><ul><li>Medical</li><li>Dental</li><li>Vision</li><li>Supplemental Insurance</li><li>401k with company match and immediate full vesting</li><li>And an open vacation/time off policy: yes, you read that correctly</li></ul>                    </div>                            <h2>                About AssureSign            </h2>            <div><p>AssureSign has been providing mission-critical electronic signature solutions to enterprise customers since 1999.&nbsp; With over 180 million global signature events to-date, AssureSign is a clear leader in the market in both cloud and on-premise deployments.</p><p>We are headquartered in Atlanta, GA and are fortunate to call the Atlanta Tech Village our home.&nbsp; We work in a mixed physical/virtual environment with some employees based out of our Atlanta office and others working from home.&nbsp; We’ve worked hard over the past couple of years to completely virtualize our network and server infrastructure.&nbsp; All of those services now reside in the Microsoft Azure cloud.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Medical                            </div>                            <div>                                 Dental                            </div>                            <div>                                 Vision                            </div>                            <div>                                 Supplemental Insurance                            </div>                            <div>                                 401k with matching and full vesting                            </div>                            <div>                                 Open vacation/time off policy                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_react",
      "TITLE1_dbms",
      "REMOTE1_50",
      "TECH2_c#",
      "TECH2_javascript",
      "TECH2_azure",
      "TZ_unknown",
      "TECH2_typescript"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "azure",
      "c#",
      "javascript",
      "react",
      "typescript"
    ]
  },
  {
    "id": "CV8yziZISfW4i4v3oym0Yg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156676/devops-architect-oracle-uk?a=QxKb3iuI5e8",
    "title": "DevOps Architect at Oracle UK (London, UK) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>DevOps, System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Enterprise Software</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>10k+ people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Public</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>One of Oracle’s most elite teams, the Product Development Cloud Solution Architects Team (the A-Team), is seeking a DevOps Architect to help strategic customers around the world succeed, implement best practices, provide real world feedback to Product Engineering and Product Management teams, and evangelize Oracle services and products through conferences and blog posts. This is a senior position with high visibility within the company.</p><p>You will join an experienced and international team, distributed in over 10 countries. You may work from home, or any Oracle office of your choice. We value and practice daily transparency, supportive feedback loops and direct communication. Team cohesion and helping each other is the core of our nature.</p><p>Applications involve the latest technologies, such as Mobile, AR/VR, Intelligent Bots. The team moves as new technologies come up, great career opportunities.</p><p>About 50% of the work is coming from the Oracle Executive Technology team, 50% is self-directed and relies on a high sense of initiative from team members to develop the business or investigate new technology trends.</p><p>&nbsp;Desired Skills:</p><p>&nbsp;&nbsp; - Expert-level, real world, experience in CI/CD, unit testing, Docker and Kubernetes</p><p>&nbsp;&nbsp; - Hands-on experience with different Cloud vendors on large-scale deployments</p><p>&nbsp;&nbsp; - Excellent programming skills in Java, Node and/or other relvent languages</p><p>&nbsp;&nbsp; - Strong Agile background (eg. SCRUM/Kanban), able to practice and mentor others</p><p>&nbsp;&nbsp; - Experience with designing large-scale, fault-tolerant distributed systems</p><p>&nbsp;&nbsp; - Ability to quickly create POC and prototypes, including web/mobile front-ends</p><p>&nbsp;&nbsp; - Comfortable with building his/her network within the organization with peers, engage in executive-level communication and handle direct customer interactions</p><p>&nbsp;&nbsp; - Experienced at leading technical teams through discovery, planning, implementation and risk remediation</p><p>&nbsp;&nbsp; - Open-source contribution and public speaking a plus</p><p>&nbsp;&nbsp; - Comfortable working in a distributed team through Slack, emails, conf call; 5-10 days travel per quarter expected</p><p>&nbsp;&nbsp; - 10-20 years of software industry experience is expected</p><p>Key highlights:</p><p>&nbsp; - work from home option</p><p>&nbsp; - high-profile team, reporting directly into CTO</p><p>&nbsp; - all the latest tech: Docker, k8, AR/VR, Intelligent Bots</p>                    </div>                            <h2>                About Oracle UK            </h2>            <div><p>With more than 420,000 customers and deployments in more than 145 countries, Oracle offers a comprehensive and fully integrated stack of cloud applications, platform services, and engineered systems.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Cycle Scheme                            </div>                            <div>                                 Your Wellbeing, Your Choice Benefits Fund                            </div>                            <div>                                 Access to Car Ownership Scheme                            </div>                            <div>                                 Excellent Learning Opportunities                            </div>                            <div>                                 Childcare Vouchers &amp; Workplace Nursery                            </div>                            <div>                                 Discount Dining Cards                            </div>                            <div>                                 Financial awareness programme and workshops                            </div>                            <div>                                 Pension                            </div>                            <div>                                 Medical coverage                            </div>                            <div>                                 Life Assurance                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_docker",
      "TITLE1_dbms",
      "TECH2_sysadmin",
      "REMOTE1_50",
      "TECH2_kubernetes",
      "TECH2_bots",
      "TECH2_java",
      "TZ_unknown",
      "TECH2_oracle"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bots",
      "docker",
      "java",
      "kubernetes",
      "oracle",
      "sysadmin"
    ]
  },
  {
    "id": "NcWmCEDITBu3O0aigM8lbQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Technical+Pre+Sales+SQL+Server&c=PeopleWorks&l=Home+Based&jk=fbdc8637928c0347&rtk=1bu3eptjn17oq6ht&from=rss",
    "title": "Technical Pre-Sales – SQL Server, Oracle, Windows, Linux - PeopleWorks - Home Based",
    "content": "<div><b>Technical Pre-Sales – SQL Server, Oracle, Windows, Linux</b><br><span>PeopleWorks</span> -<span>Home Based</span><div><span>£50,000 - £60,000 a year - </span><span>Permanent</span></div></div><span>Permanent Hertfordshire Office and Home based, UK/Ireland Travel £50,000 to £60,000 + 10% Car Allowance + Excellent Bonus Scheme + Generous Benefits One of the world’s leading providers of business process outsourcing and integrated professional support service solutions employing over 75,000 people and are listed as one of the top 25 largest British companies in the world. Due to continued growth and success, we are looking to recruit a Technical Pre-Sales Engineer to be based at our Hertfordshire offices. The role will involve you working alongside our presales and sales team of 20 plus staff all selling finance solutions, bespoke solutions and managed services. This role includes a combination of office and site based activities to support the sales process to cover off any technical requirements for each bid.<br><br>This can range from answering Tenders/RFI’s/PQQ’s to attending meetings to answer and present on the technical aspect of the solution as well as supporting the functional Pre Sales team in preparing for demonstrations. Main Tasks &amp; Responsibilities &gt; Delivering of technical presentations &amp; demonstrations, focussed on the hosting and technical design of our solutions including architecture, security &amp; management &gt; Providing hardware recommendation and design technical architecture based on customer requirements &gt; Attending regular meetings with technical teams to review proposals &gt; Responding to technical questions raised in ITTs/ RFIs &gt; Working with software engineering teams to scope out and design cross-system interfaces &gt; Keeping the sales knowledgebase for technical responses up to date. &gt; Helping to manage the Demonstration environments &gt; Occasionally working with Pre-Sales Solutions Architects (Bespoke) in scoping bespoke solutions and developing Proof-of-Concepts using our Java-based software Complying with documented procedures at all times. Essential Skills &amp; Experience # Solid technical understanding of Database technologies (ideally SQL Server and Oracle Database) # Technical understanding of Windows Operating Systems.<br><br>Knowledge of Linux is also desirable # Good understanding of networking and network designs # Good presentation skills and the ability to present solutions to both technical and non-technical audiences. # Understanding of the solution design process # Sales focused and commercially aware # Possess excellent verbal and written communication skills as, well as good interpersonal skills # Able to demonstrate commitment and understanding Desirable (not essential) Skills &amp; Experience ~ Previous experience in pre-sales for software-based solutions and/or technical solutions ~ Previous experience with finance and/or accounting systems ~ Understanding of Cloud technologies and delivery models (IaaS, PaaS, SaaS, etc.) ~ Understanding of web server technologies and services (e.g. Apache HTTP, Reverse Proxy, etc.) ~ Previous experience in working with Java</span>",
    "urlFetchPending": false,
    "published": "Oct 17, 2017 9:24:24 AM",
    "tags": [
      "TITLE1_dbms",
      "REMOTE1_50",
      "TZ_Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "Europe timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "Xck__t-_T5ucJdU-V8v6-g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Technical+Pre+Sales+SQL+Server&c=PeopleWorks&l=Home+Based&jk=fbdc8637928c0347&rtk=1bu5csft316v50jj&from=rss",
    "title": "Technical Pre-Sales – SQL Server, Oracle, Windows, Linux - PeopleWorks - Home Based",
    "content": "<div><b>Technical Pre-Sales – SQL Server, Oracle, Windows, Linux</b><br><span>PeopleWorks</span> -<span>Home Based</span><div><span>£50,000 - £60,000 a year - </span><span>Permanent</span></div></div><span>Permanent Hertfordshire Office and Home based, UK/Ireland Travel £50,000 to £60,000 + 10% Car Allowance + Excellent Bonus Scheme + Generous Benefits One of the world’s leading providers of business process outsourcing and integrated professional support service solutions employing over 75,000 people and are listed as one of the top 25 largest British companies in the world. Due to continued growth and success, we are looking to recruit a Technical Pre-Sales Engineer to be based at our Hertfordshire offices. The role will involve you working alongside our presales and sales team of 20 plus staff all selling finance solutions, bespoke solutions and managed services. This role includes a combination of office and site based activities to support the sales process to cover off any technical requirements for each bid.<br><br>This can range from answering Tenders/RFI’s/PQQ’s to attending meetings to answer and present on the technical aspect of the solution as well as supporting the functional Pre Sales team in preparing for demonstrations. Main Tasks &amp; Responsibilities &gt; Delivering of technical presentations &amp; demonstrations, focussed on the hosting and technical design of our solutions including architecture, security &amp; management &gt; Providing hardware recommendation and design technical architecture based on customer requirements &gt; Attending regular meetings with technical teams to review proposals &gt; Responding to technical questions raised in ITTs/ RFIs &gt; Working with software engineering teams to scope out and design cross-system interfaces &gt; Keeping the sales knowledgebase for technical responses up to date. &gt; Helping to manage the Demonstration environments &gt; Occasionally working with Pre-Sales Solutions Architects (Bespoke) in scoping bespoke solutions and developing Proof-of-Concepts using our Java-based software Complying with documented procedures at all times. Essential Skills &amp; Experience # Solid technical understanding of Database technologies (ideally SQL Server and Oracle Database) # Technical understanding of Windows Operating Systems.<br><br>Knowledge of Linux is also desirable # Good understanding of networking and network designs # Good presentation skills and the ability to present solutions to both technical and non-technical audiences. # Understanding of the solution design process # Sales focused and commercially aware # Possess excellent verbal and written communication skills as, well as good interpersonal skills # Able to demonstrate commitment and understanding Desirable (not essential) Skills &amp; Experience ~ Previous experience in pre-sales for software-based solutions and/or technical solutions ~ Previous experience with finance and/or accounting systems ~ Understanding of Cloud technologies and delivery models (IaaS, PaaS, SaaS, etc.) ~ Understanding of web server technologies and services (e.g. Apache HTTP, Reverse Proxy, etc.) ~ Previous experience in working with Java</span>",
    "urlFetchPending": false,
    "published": "Oct 17, 2017 9:24:24 AM",
    "tags": [
      "TITLE1_dbms",
      "REMOTE1_50",
      "TZ_Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "Europe timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "yqgn2tQdQmiPtOwW993dfQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Technical+Pre+Sales+SQL+Server&c=PeopleWorks&l=Home+Based&jk=fbdc8637928c0347&rtk=1bu5jdnsa14bm0uh&from=rss",
    "title": "Technical Pre-Sales – SQL Server, Oracle, Windows, Linux - PeopleWorks - Home Based",
    "content": "<div><b>Technical Pre-Sales – SQL Server, Oracle, Windows, Linux</b><br><span>PeopleWorks</span> -<span>Home Based</span><div><span>£50,000 - £60,000 a year - </span><span>Permanent</span></div></div><span>Permanent Hertfordshire Office and Home based, UK/Ireland Travel £50,000 to £60,000 + 10% Car Allowance + Excellent Bonus Scheme + Generous Benefits One of the world’s leading providers of business process outsourcing and integrated professional support service solutions employing over 75,000 people and are listed as one of the top 25 largest British companies in the world. Due to continued growth and success, we are looking to recruit a Technical Pre-Sales Engineer to be based at our Hertfordshire offices. The role will involve you working alongside our presales and sales team of 20 plus staff all selling finance solutions, bespoke solutions and managed services. This role includes a combination of office and site based activities to support the sales process to cover off any technical requirements for each bid.<br><br>This can range from answering Tenders/RFI’s/PQQ’s to attending meetings to answer and present on the technical aspect of the solution as well as supporting the functional Pre Sales team in preparing for demonstrations. Main Tasks &amp; Responsibilities &gt; Delivering of technical presentations &amp; demonstrations, focussed on the hosting and technical design of our solutions including architecture, security &amp; management &gt; Providing hardware recommendation and design technical architecture based on customer requirements &gt; Attending regular meetings with technical teams to review proposals &gt; Responding to technical questions raised in ITTs/ RFIs &gt; Working with software engineering teams to scope out and design cross-system interfaces &gt; Keeping the sales knowledgebase for technical responses up to date. &gt; Helping to manage the Demonstration environments &gt; Occasionally working with Pre-Sales Solutions Architects (Bespoke) in scoping bespoke solutions and developing Proof-of-Concepts using our Java-based software Complying with documented procedures at all times. Essential Skills &amp; Experience # Solid technical understanding of Database technologies (ideally SQL Server and Oracle Database) # Technical understanding of Windows Operating Systems.<br><br>Knowledge of Linux is also desirable # Good understanding of networking and network designs # Good presentation skills and the ability to present solutions to both technical and non-technical audiences. # Understanding of the solution design process # Sales focused and commercially aware # Possess excellent verbal and written communication skills as, well as good interpersonal skills # Able to demonstrate commitment and understanding Desirable (not essential) Skills &amp; Experience ~ Previous experience in pre-sales for software-based solutions and/or technical solutions ~ Previous experience with finance and/or accounting systems ~ Understanding of Cloud technologies and delivery models (IaaS, PaaS, SaaS, etc.) ~ Understanding of web server technologies and services (e.g. Apache HTTP, Reverse Proxy, etc.) ~ Previous experience in working with Java</span>",
    "urlFetchPending": false,
    "published": "Oct 17, 2017 9:24:24 AM",
    "tags": [
      "TITLE1_dbms",
      "REMOTE1_50",
      "TZ_Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "Europe timezones"
    ],
    "tagsNames2": []
  }
]
}
