{
 "items": [
  {
    "id": "b8S49lVBQ9mWjEZnoVcAMw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62423",
    "title": "Contract Designer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Skookum is hiring a Contract Designer anywhere</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 8:53:19 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "pH-yo9rZSOiAt7-xy_Ak5A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/jobs/5653-design-specialist-emea",
    "title": "InVision: Design Specialist - EMEA",
    "content": "<div>  <div>    <h2>Design Specialist - EMEA</h2>      <h4>Posted Nov  2</h4>    <h3>      <span>InVision</span><br>      <span>Headquarters: Remote</span><br>        <a href='https://www.invisionapp.com/company#jobs' rel='nofollow'>https://www.invisionapp.com/company#jobs</a>    </h3>  </div></div>  <div>    <div>We power design at the world’s smartest companies.</div><div><br></div><div></div><div>We're a workflow platform for digital product design and collaboration, built to overhaul the process that turns an idea into a product. Reinventing the end-to-end development workflow—with an emphasis on customer experience—means entire teams have the opportunity to hold digital design disruption in the palms of their hands.</div><div><br></div><div></div><div>That’s why over three million designers, product managers, marketers and other partners at so many of the world's most loved startups, agencies, &amp; corporations use InVision every single day, including Uber, Evernote, Twitter, Spotify, Salesforce and many more.</div><div><br></div><div></div><div>If your goal is to do career defining work, we believe you'll love working here. Added bonus? We’re a completely distributed team! </div><div><br></div><div></div><div>We are looking for a designer with expertise in product design best practices, design process and the design tools ecosystem to support our sales and customer success teams as a Design Specialist for the EMEA region. You will play a critical customer facing role to evangelize a design centric approach at large organizations. As a subject matter authority, you will elevate our design conversations with external senior executives, and educate and train our internal InVision EMEA customer facing teams.</div><div><br></div><div></div><div>Ideally you are a passionate senior designer or design leader, someone who's knowledgeable with popular design tools and methodologies, have first hand experience crafting or leading a design system and enjoy sharing that knowledge with others. You also love to teach, share, solve problems. Maybe you write, blog, or have a podcast as you have ambitions as a design thought leader. &nbsp;</div><div><br></div><div><h3><strong>What you can expect to be doing:</strong></h3></div><ul><li>You'll be the resident product authority around InVision and the broader ecosystem of product design and collaboration technologies</li><li>Help drive awareness and adoption of new product offerings among InVision’s Enterprise customer base</li><li>Craft customer facing programs evangelizing and educating on the value of Design Thinking and specifically targeted to the C-suite of large corporations.</li><li>Develop customer facing content and materials evangelizing the power of design. This will include translating educational content and industry experience into recommendations for rituals, team structure, processes, tooling, etc.</li><li>Regularly attend in person prospect and customer visits, leading senior level conversations on digital transformation and design best practices</li><li>Partner with the marketing team on strategic content, event speaking opportunities, and community meetups to drive awareness of the InVision brand</li><li>Work closely with Product and Design Education teams to scale efforts programs and workshops for senior leaders.</li></ul><div><h3><strong>About You:</strong></h3></div><ul><li>Ideally 5-10 years experience as a product or design lead in a large enterprise</li><li>Experience leading digital transformation or design thinking programs across large organizations</li><li>Ability to deliver engaging presentations to senior level audiences with a focus on education</li><li>Desire to build and maintain a personal brand as a product design expert</li><li>Strong desire to take initiative; you flourish with change and comfortable with ambiguity</li><li>Passionate about being a founding member of InVision’s international expansion</li><li>Bias towards immediate action and results</li><li>Willingness to learn and adapt</li></ul><div><h3><strong>About us:</strong></h3></div><div>At InVision, culture transcends space, with a team made of kind, smart people in more than 20 countries. By focusing hiring efforts on humility and talent, a family-like camaraderie naturally unfolds. You will have the opportunity to grow a career from your homes—or communal workspaces in mini hubs, where many InVisioners live. As a result, you can weave productivity into your lifestyle, with successful work-life integration making it possible to travel the world while spearheading an impressive career.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply at: <a href='https://boards.greenhouse.io/invision/jobs/890296#.WftWvBNSyb8' rel='nofollow'>https://boards.greenhouse.io/invision/jobs/890296#.WftWvBNSyb8</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 7:43:12 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "kpALTD7yQaS_Bh672lFyIw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/63083/freelance-digital-learning-designer-at-nurserybook/",
    "title": "Freelance digital learning designer",
    "content": "Our mission is to deliver a personalised and engaging online learning platform to support childcare professionals in their continuous professional development.<br /><br />Our solution will be designed for the individual; personalised and relevant to their development needs. It focuses on being fun, easy to use and highly engaging. Encouraging childcare professionals to take a little and often approach to their development.<br /><br />We are seeking a passionate digital learning designer to help us deliver industry leading training.<br /><br /><br />== We’re looking for ==<br /><br />* Experience of developing creative and innovative online adult learning solutions<br />* Knowledge of digital pedagogy, learning theories and instructional design<br />* Ability to structure meaningful learning curriculums<br />* Self-motivated, able to assume responsibility and work autonomously<br />* Excellent verbal and written communication skills<br />* Experience of defining learning objectives and content scoping<br />* Experience with gamification [Nice to have]<br />* Experience in blending learning design [Nice to have]<br />* Experience of social learning design [Nice to have]<br />* Knowledge of SCORM and LMS/LCMS [Nice to have]<br /><br /><br />== What you’ll do day to day ==<br /><br />* Work with early years education experts to identify childcare training needs and develop solutions for them<br />* Develop high-level content plans for subject matter experts<br />* Produce learning design guidelines for content development<br />* Review content from our training providers (learning activities, exercises, assessments etc.)<br />* Build engaging learning activities and compelling course content<br />* Produce content to support the training delivery<br />* Build virtual rewards and badges to incentivise learners<br /><br />== About us ==<br /><br />Kinderly is an award-winning Edtech company based in London and Bath.<br /><br />We provide a software solution that supports childcare professionals to be at their best in capturing a child’s early years journey whilst at the same time improving engagement and communication with parents to give children the best start in life.<br /><br /><br />== The role ==<br /><br />* Freelance<br />* Remote working<br />* Part-time<br />* 2 – 3 days per week<br />* Flexible hours<br />* Immediate start<br />* Competitive day rate",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 12:20:31 PM",
    "tags": [
      "TITLE1_designer",
      "TZ_Europe",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "Q9w7ey76TqC0-wzxUZrYYQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62413",
    "title": "Product Designer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Customer.io is hiring a Product Designer in Remote or Anywhere</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 12:57:26 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "KqQ3YLmARPOhyfNVSCLcoQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Product-Designer/2503686",
    "title": "Product Designer - Customer.io - (Remote) - FullTime",
    "content": "<li>          <a rel='nofollow'>                 Customer.io</a>              (Remote)          </li><li>                  Fulltime Job        </li><h2>Product Designer</h2><p>Hi, I’m Brian, Director of Product at Customer.io,</p><p>I’m looking for a Designer to join our product team and help us take our interface to the next level. You should be someone who is strong in the visual side of UI design, yet we’re a small team where you’ll get to work across the full spectrum of experience design. Our team is completely distributed so you can work whenever and wherever you’re most productive.</p><p>The design you’ll do here will help raise the bar for the everyday communications we all receive. Customer.io is a powerful tool used by over 1000 businesses to manage, send, and track performance of email, SMSes and push notifications.</p><p>Our customers are marketers, growth hackers, and engineers who are always dreaming up fresh ideas for how to be genuine and personal in their messages to customers. Unlike typical marketing platforms, we help businesses send relevant messages based on what people do or don’t do when logged in to a web or mobile app.</p><p>Sound like the next step in your career? Read on and apply at: http://grnh.se/v30tsu1</p><p>P.S. Identify more as UX Designer? UI Designer? Don’t worry about it – let us know if you think this is the place for you.</p><h3>How to apply</h3><a href='http://grnh.se/v30tsu1' rel='nofollow'>http://grnh.se/v30tsu1</a>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 12:43:07 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown",
      "TECH2_Design"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "Design"
    ]
  },
  {
    "id": "i7t6GEIlQX-yjzsUTS78kQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/jobs/5644-product-designer",
    "title": "Semaphore CI: Product Designer",
    "content": "<div>  <div>    <h2>Product Designer</h2>      <h4>Posted Nov  1</h4>    <h3>      <span>Semaphore CI</span><br>      <span>Headquarters: Novi Sad</span><br>        <a href='https://semaphoreci.com/about/careers' rel='nofollow'>https://semaphoreci.com/about/careers</a>    </h3>  </div>    </div>  <div>    <div><strong>Looking for a well-rounded Product designer [REMOTE]</strong></div><div><br></div><div><span>We’re growing our design team and looking for a person who&nbsp;</span><strong>understands product design, business perspective and why we do stuff that we do, but who’s also</strong><span>&nbsp;</span><strong>very good at visual design.</strong></div><div><br></div><div><b>What will you be working on?</b>&nbsp;<span>Semaphore is a continuous delivery service, focused on speed and simplicity. A tool that helps developers write better code. More on&nbsp;</span><a href='http://semaphoreci.com/?utm_source=weworkremotely&amp;utm_medium=link&amp;utm_campaign=productdesigner&amp;utm_term=month' rel='nofollow'>semaphoreci.com</a>.</div><div><br></div><div><span><b>Who you’ll be working with?</b></span><strong>&nbsp;</strong><span>You’ll be closely collaborating with our marketing, product and dev teams, and continuously optimise based on data and information from research. On product design end, in functional and visual aspect, you’ll have support from Design lead and the rest of the product team.</span><br></div><div></div><div></div><div></div><div></div><div></div><div><strong><br></strong></div><div><b>Who are you?&nbsp;</b>We want you to stand strongly behind your decisions, but to be humble enough to accept that your opinions are challenged all the time as part of the process.</div><div><br></div><div><b><strong>Experience</strong><strong>.</strong></b><strong>&nbsp;</strong><span>This is a senior position for experienced designers. We need someone who will be a strong addition to our team from day one. Difficult to tell how much exactly, but we’d dare to say at least 4 years working on products.</span></div><div><br></div><div><strong>Required skills.</strong>&nbsp;Your deliverables will be either in the form of sketches, mockups, prototype or code — whatever is faster and whatever communicates the idea better. You’ll use Sketch a lot, but should also be able to code your designs and deliver and test them in their natural environment. Therefore, HTML and CSS is a must. We bet on&nbsp;<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Ftachyons.io%25252F' rel='nofollow'>Tachyons</a>. Illustration and Icon drawing skills are nice-to-haves. Knowledge of Javascript isn't a must, but knowing how to handle subtle interaction details would be a great help.</div><div><br></div><div><strong>Applying.</strong>&nbsp;a) Send us the link to your portfolio. And the link to your blog if you are writing one. We’d like to evaluate your visual and your writing skills to be able to understand how do you think about design. b) Send us your CV, although not necessarily very formal, it must be something from what we can learn about your previous work experience.</div><div><br></div><div><h3>BENEFITS</h3></div><div>This is a&nbsp;<strong>REMOTE</strong>&nbsp;position, but you’re welcomed to work from our Novi Sad office. If working remotely, we would like to have&nbsp;<strong>at least 4 hours overlap with 9-5 CET</strong>. We offer fair compensation, friendly environment, 20 days of paid vacation + public holidays in your country, unlimited books, paid gym membership and so on.</div><div><br></div><div>Good luck applying!</div><div><br></div><div><strong>Who We Are</strong></div><div><br></div><div><span>SemaphoreCI.com is a leader in hosted continuous integration and deployment, with over 30,000 developers relying on Semaphore to test and deploy their code. Our mission is to help teams ship their software faster and with more confidence by providing a fast, robust and scalable platform for software delivery.</span></div><div><br></div><div><span>We work in small, highly effective teams, and every person is vital to the success of the company.</span><br></div><div></div><div></div><div></div><div></div><div></div><div><span><br></span></div><div><span>Our team is made of smart, creative people who love their craft. We believe that a great place to work is where we're surrounded by self-managed people who consistently do good work and positively inspire us.</span><br></div><div></div><div></div><div></div><div></div><div></div><div><span><br></span></div><div><span>We work in a fast-changing environment of a new market, and there are many ways you can make a great impact. You will not be just improving the product or customer experience, but have a voice in shaping the company culture too.</span><br></div><div></div><div></div><div></div><div></div><div></div><div><span><br></span></div><div><span>Sounds good? Come work with us.</span><br></div><div></div><div></div><div></div><div></div><div></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://renderedtext.workable.com/jobs/600267/candidates/new' rel='nofollow'>https://renderedtext.workable.com/jobs/600267/candidates/new</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 1, 2017 9:47:13 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "VzpSS6BkTw2S3ThJXD5Q6g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29970?r=rss2",
    "title": "NationBuilder: Designer",
    "content": "<p>Full-time</p><p><strong>(New York, NY)</strong> </p><p>NationBuilder is seeking a designer to become a core contributor to the wide scope of design needs at NationBuilder, software and community for leaders.</p><p>Your responsibilities will include maintaining and elevating the NationBuilder brand, crafting delightful web experiences across our online properties, collaborating on product design, and taking a central role in the overall evolution of design at the company. This is a great opportunity to have your work seen and appreciated widely. You will report directly to the VP of Design.</p><p>The design team is based in Brooklyn, New York, but working remotely is a possibility if required.</p><p>NationBuilder offers everyone the <a href='http://nationbuilder.com/software' rel='nofollow'>technology</a> and <a href='http://nationbuilder.com/cities' rel='nofollow'>community infrastructure</a> to lead people to greatness. Our customers range from political candidates and nonprofits to corporations - anyone building a community of people to make something happen in the world. To learn more about NationBuilder, read about our <a href='http://nationbuilder.com/mission' rel='nofollow'>mission, beliefs</a> and <a href='http://nationbuilder.com/jobs' rel='nofollow'>values</a>.</p><h2>We're looking for someone who:</h2><ul><li>Has considerable experience designing and building modern websites with a polished visual design, and has a portfolio to prove it.</li><li>Has experience coding responsive webpages in HTML and CSS, and a solid understanding of frameworks like Bootstrap.</li><li>Is highly proficient with tools such as Sketch, Photoshop, and Illustrator, and has a familiarity with prototyping tools like Marvel and InVision.</li><li>Has exceptional attention to detail.</li><li>Is humble, passionate about personal growth, and would rather be &quot;better&quot; than &quot;right.&quot;</li><li>Proactively seeks out feedback and welcomes it as an opportunity to grow.</li><li>Is effective in communicating design decisions to design and non-design audiences.</li><li>Has a strong work ethic, a quick learner and is willing to work with a fast-paced team.</li></ul><p></p><p><strong>Job Perks:</strong> - Great health insurance- Yearly conference stipend- Unlimited vacation and sick days- Unlimited MTA card (if in NYC)- Work on something huge that really matters</p><p><strong>Apply:</strong> To apply, tell us why you're interested in this position in 140 characters or less. Most importantly, include links to your portfolio with examples of responsive websites you've created, and your resume by emailing jobs@nationbuilder.com with the subject Designer.</p>",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 10:25:45 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_50",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "1Ob5_840Sza25AeWasyr5Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/jobs/5616-motion-designer-graphic-designer",
    "title": "Cleverclip: Motion Designer / Graphic Designer / Animator",
    "content": "<div>  <div>    <h2>Motion Designer / Graphic Designer / Animator</h2>      <h4>Posted Oct 26</h4>    <h3>      <span>Cleverclip</span><br>      <span>Headquarters: Switzerland</span><br>        <a href='https://cleverclip.breezy.hr/p/a204afb9b0d5-motion-designer-graphic-designer--animator?source=weworkremotely' rel='nofollow'>https://cleverclip.breezy.hr/p/a204afb9b0d5-motion-designer-graphic-designer--animator?source=weworkremotely</a>    </h3>  </div>    </div>  <div>    <div>Cleverclip Ltd. is a fast growing startup from Berne (Switzerland). Since April 2013 we pursue one simple goal: Helping people getting their ideas across in a meaningful and lasting way. We achieve this by producing explainer videos, infographics and fully animated presentations for large and small companies.&nbsp;<a href='https://vimeo.com/170446651' rel='nofollow'>Our showreel sums it up pretty well.</a>&nbsp;We are a team of 26 (hopefully soon 27) passionate artists, animators, illustrators, storytellers and designers from around the world. We work and live in San José, Berlin, Zurich, Kuala Lumpur and in a small town in the middle of nowhere in Russia.</div><div><br></div><div>We are looking for a highly talented motion designer who knows how to visually illustrate ideas. We embrace those who see things differently and aren’t afraid to experiment.</div><div><br></div><div>As our leading motion graphic artist you’ll design explainer videos as well as fully animated presentations (mainly in Adobe After Effects). Your technical skills and keen aesthetic eye for motion and compositing will help you transform concepts and ideas into awesome masterpieces that inspire audiences around the globe.</div><div><br></div><div>Join our young and aspiring team and help us to make the world less complicated.</div><div><br></div><div><h4>Responsibilities</h4></div><div>• Lead designer/animator for explainer videos and animated presentations&nbsp;<br></div><div>• Develop individual designs for our high profile customers&nbsp;<br></div><div>• Work collaboratively with project management&nbsp;<br></div><div>• Communicate effectively through storyboards and concept arts&nbsp;<br></div><div>• Work remotely and autonomous</div><div><br></div><div><h4>Qualifications</h4></div><div>• Proficient with Adobe Creative Suite (After Effects, Premiere Pro, Illustrator, Photoshop)&nbsp;<br></div><div>• Basic skills in Cinema 4D or Autodesk Maya or any other 3D-Program&nbsp;<br></div><div>• Sufficient skills on video storyboarding&nbsp;<br></div><div>• Your portfolio should demonstrate a high level of creativity&nbsp;<br></div><div>• High English skills&nbsp;<br></div><div>• Ability to manage multiple projects under tight deadline pressures</div><div><br></div><div><h4>Perks and Benefits</h4></div><div>• You’ll work mostly with cool people (Not all of us are cool. But the majority is)&nbsp;<br></div><div>• Remote work: Work wherever and whenever you want&nbsp;<br></div><div>• Creative freedom (Makes sense, right?)&nbsp;<br></div><div>•&nbsp;<a href='https://vimeo.com/228176366' rel='nofollow'>Yearly company retreat. Once a year we all meet and hang out together. This year we met in Bali, Indonesia.&nbsp;</a><br></div><div>• Gadgets - Whatever you need to get things going&nbsp;<br></div><div>• Continuing education possibilities</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://cleverclip.breezy.hr/p/a204afb9b0d5-motion-designer-graphic-designer--animator?source=weworkremotely' rel='nofollow'>https://cleverclip.breezy.hr/p/a204afb9b0d5-motion-designer-graphic-designer--animator?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 26, 2017 3:42:50 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "fHvJ8DAeTA6ddLzN91hvwQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/jobs/5583-senior-designer",
    "title": "Aha!: Senior Designer",
    "content": "<div>  <div>    <h2>Senior Designer</h2>      <h4>Posted Oct 19</h4>    <h3>      <span>Aha!</span><br>      <span>Headquarters: United States</span><br>        <a href='http://www.aha.io/company/careers/current-openings/sr_ux_designer_us' rel='nofollow'>http://www.aha.io/company/careers/current-openings/sr_ux_designer_us</a>    </h3>  </div>    </div>  <div>    <div>Do you want to change the way people innovate? Are you a problem solver who loves to visualize complex data in order to find the right solution?</div><div><br></div><div>We are looking for someone who wants to deliver beautifully designed experiences in a fast-paced, user-centric environment. If this sounds like you, we want to hear from you!</div><div><br></div><div>As a Senior Designer at Aha!, you will have an excellent opportunity to join a breakthrough and profitable company that is growing fast. Aha! was founded by a proven team of Silicon Valley veterans whose last two businesses were acquired by well-known public companies. More than 150,000 users trust Aha! to link their brilliant strategy to their team's work and create visual roadmaps.</div><div><br></div><div><h5>We are looking for someone who:</h5></div><ul><li>Has at least three years of experience on a product or user experience team for a SaaS application</li><li>Loves to see their work ship — quickly</li><li>Partners across teams at every stage to deliver the highest level of quality</li><li>Understands product management in addition to user behaviors and motivations</li><li>Wants to take responsibility for and measure the success of new designs</li></ul><div><h5>We are committed to being great, and we want someone who:</h5></div><ul><li>Is nimble and thrives in a feedback cycle measured in hours rather than weeks</li><li>Has a &quot;get it done&quot; attitude and proven background of delivering beautiful work again and again</li><li>Is seeking a career-defining opportunity with a proven, results-oriented team</li></ul><div><br></div><div><i>We are building a distributed team, and you can work from anywhere in the United States for this role. We offer generous salary, equity, benefits, and a profit-sharing program to the right candidates.</i></div><div><br></div><div><b>For immediate consideration, please follow these&nbsp;<a title=&quot;Read this first&quot; href='https://blog.aha.io/the-best-cover-letters-that-ceos-love-to-read/' rel='nofollow'>helpful guidelines</a>&nbsp;and contact us at&nbsp;<a href='mailto:Design-jobs@aha.io' rel='nofollow'>Design-jobs@aha.io</a>. If you have the right background, we will quickly follow up with you. We are not working with recruiters or third-party agencies.</b></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please send resume and portfolio to: <a href='mailto:Design-jobs@aha.io' rel='nofollow'>Design-jobs@aha.io</a> </p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 19, 2017 10:31:07 PM",
    "tags": [
      "TITLE1_designer",
      "TZ_America",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "2xtv1-CxQn6O5E9ZPUAKkQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29911?r=rss2",
    "title": "Fuel Made: Web Designer",
    "content": "<p>Full-time</p><p><strong>(Western North America)</strong> </p><p>A few years ago we (Fuel Made) were just a small handful of folks focused on building the very best ecommerce experiences on the web. Leading out with strong design is how we delighted our clients, and grew our agency. Our design-driven approach led to success, and opportunities we couldn’t have imagined.</p><p>Today, our clients are successful, established merchants with specialized shops and complex needs. The opportunity to service these clients is challenging and exciting.</p><p>We are seeking a web designer to join our small design team. In this position you will work with our team, and directly with our clients. You will be directing and designing the solutions we build. This is a serious responsibility, and an exciting one. Watching your hard work come to life as it progresses through the project life cycle, and then watching our customer’s delight as it impacts their bottom line is rewarding. This is why we love ecommerce.</p><p><strong>A quick summary of your responsibilities:</strong></p><p>Once a client comes on board you will work with them over several weeks on discovery, creating wireframes and user flows (both visual and written), style direction, and finally the visual design. You'll then shepherd all that design work through the development process.</p><p>This is where we’ll need your experience as a web designer capable of tackling big challenges with discipline and an understanding of what web design really means, and how thoughtful design can help clients reach their goals.</p><p><strong>Candidate must haves:</strong></p><ul><li>At least three years of, specifically, web design experience&nbsp;</li><li>Exceptional written and verbal communication skills</li><li>You need to truly love doing UX work in addition to visual design work</li><li>Comfortable and experienced with the technical aspects and constraints of working with the web. This includes an understanding of RWD, and how HTML and CSS work.</li><li>Passion for all things web and design. You are abreast of industry best practices and evolution.</li><li>Willingness to do things The Right Way (especially when it's hard)</li><li>Easy and enjoyable to work with</li></ul><p><strong>Nice to haves:</strong></p><ul><li>HTML/CSS coding proficiency</li><li>Experience with ecommerce</li><li>Photography background</li></ul><p><strong>Why you might like working for us:</strong></p><ul><li>We choose our clients carefully.</li><li>Freedom to care about your work (we're focused on quality)</li><li>Freedom to own projects from a design standpoint</li><li>Freedom to focus and get really good at what you do (we're focused 100% on ecommerce)</li><li>We work reasonable hours.</li><li>The care we have for our clients is rivaled only by the care we have for each other. We are a tight-knit, professional team who care a lot about doing world-class work together.</li></ul><p><strong>Benefits:</strong></p><ul><li>Vacation: two weeks paid vacation plus 7 paid holidays, and we also take off the week between Christmas and New Years.</li><li>Remote work: Western North America is your office.</li><li>Health care benefits.&nbsp;</li><li>Yearly retreat: Each year we all gather as a team for a week somewhere fun (and warm!) to connect, learn, and have a lot of fun together.</li><li>Tools: we'll make sure you have whatever software and hardware you need to do your job.</li></ul><p><strong>Location</strong>: We are a fully remote company, but you <span>must</span> be in North America, and located in the Pacific or Mountain time zones, available to work regular business hours every day.</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Oct 14, 2017 9:48:23 PM",
    "tags": [
      "TITLE1_designer",
      "TZ_America_West",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "US Pacific time zone"
    ],
    "tagsNames2": []
  },
  {
    "id": "Gf-RvQMSQR2KF2VPtWJOYQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29900?r=rss2",
    "title": "FullStack: Front-End Designer",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><p><span>FullStack has become renowned in our ability to bring creativity, expertise, and sound development practices to notable and ambitious startups and scaling organizations. Our mission is simple: to build great products that propel our clients towards success.</span><span></span></p><p><span>We're looking for someone to join our team who loves designing and developing websites and user experiences. You will have the opportunity to work alongside a close knit group of very talented engineers and product managers to build software that changes the world.</span></p><p>&nbsp;</p><p><span><span><span>At FullStack you will: </span></span></span></p><ul><li><span><span><span><span>Design custom websites and Wordpress themes</span></span></span></span></li><li><span><span><span><span><span><span>Work with Product Managers, Engineers and client stakeholders to ensure that what we're &nbsp;meets the needs of the end user</span></span></span></span></span></span></li><li><span><span><span><span><span><span><span>Effectively communicate user interaction through deliverables such as wireframes and prototypes</span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span>Wireframe and mockup user interfaces with your design application of choice or in the browser (when appropriate)</span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span>Participate as a Product Designer in creating UI/UX for web and mobile applications</span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span>Actively participate in design critiques/reviews and product discussions</span></span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span><span>Think deeply about the user experience and usability issues</span></span></span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span><span><span>You can build out your designs</span></span></span></span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span><span><span><span>QA the implementation of your designs</span></span></span></span></span></span></span></span></span></span></span></span></span></li></ul><p><span><span><span>You're qualified because:</span></span></span></p><ul><li><span><span><span><span>You’ve built custom websites before</span></span></span></span></li><li><span><span><span><span><span><span>You know how to work with Wordpress</span></span></span></span></span></span></li><li><span><span><span><span><span><span><span>Your ability to design exceptional user interfaces is second-to-none</span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span>Mobile and responsive design/development is not an afterthought</span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span>You have a burning passion for providing a great experience to users</span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span>You're proficient in handcrafting HTML and CSS (particularly HTML5 and CSS3)</span></span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span><span>You know enough JavaScript/jQuery to build out your designs</span></span></span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span><span><span>You get things done whether you're working autonomously or in a team setting</span></span></span></span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span><span><span><span>Communication skills and the ability to explain your design decisions come naturally</span></span></span></span></span></span></span></span></span></span></span></span></span></li></ul><p><span><span><span>You'll get bonus points for knowing a little something about the following:</span></span></span></p><ul><li><span><span><span><span>Version control with Git</span></span></span></span></li><li><span><span><span><span><span><span>Experience designing for iOS and Android</span></span></span></span></span></span></li><li><span><span><span><span><span><span><span>Experience with MVC frameworks such as Ruby on Rails</span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span>Familiarity with A/B testing</span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span>Ability to conduct user testing and customer interviews</span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span>Ability to create icons and logos in a pinch</span></span></span></span></span></span></span></span></span></span></li></ul><p><span><span><span><span><span><span><span><span>This is a contract position, but it has the potential to turn into more.</span></span></span></span></span></span></span></span></p><p><span><span><span><span><span><span><span><span>If this sounds like a party to you and you want to work alongside some incredibly talented and passionate engineers and designers, we want to hear from you! We are a distributed team and welcome the potential of working remotely. Please send us a current portfolio of design and code samples, and tell us why you want to work at FullStack. It also wouldn't hurt if you sent us links to your Dribbble and Github accounts.</span></span></span></span></span></span></span></span></p><p></p><p><strong>Job Perks:</strong> Work from anywhere in the US</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Oct 12, 2017 8:45:21 PM",
    "tags": [
      "TITLE1_designer",
      "TZ_America",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "gwmtd_6RQK-h2X4y-WxXCQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3920-ux-designer-modus-create",
    "title": "UX Designer @ Modus Create",
    "content": "<h2>              UX Designer<small> @ Modus Create</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-12 14:41</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>Hello Designer, does this sound like you?</strong> People describe you as a generalist, but you have your specialties. You could run a design project from start to finish, but you nerd out when it comes to a specific craft like visual design or ethnographic research. You also value soft skills. For you, over-communicating and project planning are essential to any project’s success. Selling your designs is second nature to you, because you design with intent. And pretty deliverables mean nothing to you unless you ship a product that moves the needle.</p><p>You design fast — keyboard shortcuts are your poor fingers’ best friends. You know when to lean on existing patterns and when to create something fresh. And you understand the difference between innovating and copying. To you, perfectionism is a dirty 13 letter word that has no place in design.</p><p>You accept that most companies follow a wonky design process, and that’s why they need your help. You believe that teaching is actually the perfect way to stay up to date on your craft. You preach that user experience is more than just what you see on the screen. The most frequent word in your vocabulary arsenal is “Why?” You’re as good at understanding problems as you are at solving them. </p><p>This is a contract role. It may be performed from a remote location. This role requires a level of effort estimated at 40 hours per week.</p><p><strong>Your Responsibilities</strong></p><ul><li>Own the end-to-end design process for your projects</li><li>Facilitate discovery sessions with clients and stakeholders to define success, requirements, and strategy</li><li>Actually interact with customers to research their tasks, pain points, and emotions </li><li>Use research to inform feature prioritization. Translate research data into digestible deliverableS</li><li>Create interaction design patterns in the form of user flows, wireframes, full color mockups, and interactive prototypes</li><li>Sell your work — tell compelling stories when presenting deliverables to customers</li><li>Be comfortable in formal design presentations and impromptu feedback meetings with clients</li></ul><p><strong>Required Experience</strong></p><ul><li>You have a portfolio showing your design process for multiple digital products across different industries</li><li>You have worked in an agile product development environment</li></ul><p><strong>Let’s Talk About Us</strong></p><p>Modus Create is a Product Studio offering consulting services and SaaS products for strategic planning, design and execution of web-based and mobile products. We work across multiple industries with Fortune 1000, ISVs, and startups to validate, plan and launch new products. Headquartered in Reston, VA, we are a bootstrapped team that has grown from 2 to 100 people in 26 countries in 6 years, committed to building the best product consulting firm on the planet. We offer a highly collaborative, autonomous and effective working environment. We love and believe in what we do. This is your chance to be part of building something great.</p><p><strong>Why Modus Create</strong></p><ul><li>Enjoy the independence to shape digital products </li><li>Never get bored. Work on different projects across different industries. Fitness, banking, corporate security, travel, real estate — you name it, we’ve been there</li><li>Build products that people will actually use. See your work in the app store, or in the hands of companies with thousands of employees</li><li>Collaborate with other bright user experience minds to shape a quickly growing user experience practice</li><li>Competitive compensation</li><li>Ability to work remotely / telecommute</li><li>Working side-by-side with thought leaders in emerging tech</li></ul><p><strong>Do you have what it takes to join the DC area's most awesome tech company? Let’s start a conversation.</strong></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>You must be willing to support most of business hours of our client located in GMT-4 / Eastern Time Zone of the United States.</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 12, 2017 5:41:11 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_America_East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East time zone"
    ],
    "tagsNames2": []
  },
  {
    "id": "1yydE2VMR1eKp6vaXJFv2g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62132",
    "title": "UX Designer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>Hello Designer, does this sound like you?</strong> People describe you as a generalist, but you have your specialties. You could run a design project from start to finish, but you nerd out when it comes to a specific craft like visual design or ethnographic research. You also value soft skills. For you, over-communicating and project planning are essential to any project’s success. Selling your designs is second nature to you, because you design with intent. And pretty deliverables mean nothing to you unless you ship a product that moves the needle.<br><br>You design fast — keyboard shortcuts are your poor fingers’ best friends. You know when to lean on existing patterns and when to create something fresh. And you understand the difference between innovating and copying. To you, perfectionism is a dirty 13 letter word that has no place in design.<br><br>You accept that most companies follow a wonky design process, and that’s why they need your help. You believe that teaching is actually the perfect way to stay up to date on your craft. You preach that user experience is more than just what you see on the screen. The most frequent word in your vocabulary arsenal is “Why?” You’re as good at understanding problems as you are at solving them. <br><br>This is a contract role. It may be performed from a remote location. This role requires a level of effort estimated at 40 hours per week.<br><br><strong>Your Responsibilities</strong><br><br></p><ul><li>Own the end-to-end design process for your projects<br></li><li>Facilitate discovery sessions with clients and stakeholders to define success, requirements, and strategy<br></li><li>Actually interact with customers to research their tasks, pain points, and emotions <br></li><li>Use research to inform feature prioritization. Translate research data into digestible deliverableS<br></li><li>Create interaction design patterns in the form of user flows, wireframes, full color mockups, and interactive prototypes<br></li><li>Sell your work — tell compelling stories when presenting deliverables to customers<br></li><li>Be comfortable in formal design presentations and impromptu feedback meetings with clients<br><br><strong>Required Experience</strong><br><br></li><li>You have a portfolio showing your design process for multiple digital products across different industries<br></li><li>You have worked in an agile product development environment<br><br><strong>Let’s Talk About Us</strong><br><br>Modus Create is a Product Studio offering consulting services and SaaS products for strategic planning, design and execution of web-based and mobile products. We work across multiple industries with Fortune 1000, ISVs, and startups to validate, plan and launch new products. Headquartered in Reston, VA, we are a bootstrapped team that has grown from 2 to 100 people in 26 countries in 6 years, committed to building the best product consulting firm on the planet. We offer a highly collaborative, autonomous and effective working environment. We love and believe in what we do. This is your chance to be part of building something great.<br><br><strong>Why Modus Create</strong><br><br></li><li>Enjoy the independence to shape digital products <br></li><li>Never get bored. Work on different projects across different industries. Fitness, banking, corporate security, travel, real estate — you name it, we’ve been there<br></li><li>Build products that people will actually use. See your work in the app store, or in the hands of companies with thousands of employees<br></li><li>Collaborate with other bright user experience minds to shape a quickly growing user experience practice<br></li><li>Competitive compensation<br></li><li>Ability to work remotely / telecommute<br></li><li>Working side-by-side with thought leaders in emerging tech<br><br><strong>Do you have what it takes to join the DC area's most awesome tech company? Let’s start a conversation.</strong></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 12, 2017 5:41:11 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "CKcufS8cREWPtI_H3FDoOw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62128",
    "title": "Product Designer, Partnerships",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>We’re looking for a Product Designer to join the Design Team at Zapier. If designing and developing delightful user experiences, collaborating with cross-functional teams, and creating user interfaces that solve users pain points interests you, keep reading!<br><br>As a Product Designer embedded on the Partnerships Team, you’ll be working directly with our Partners to create cohesive experiences for their Zapier integrations. Whether it’s designing the tools that enable our Partners to contextually embed Zapier in their Product or doing research with them to gather insights on their needs, you’ll be focused on engaging our Partners in ways that are truly meaningful to them and their unique needs with Zapier.<br><br>We're a widespread remote team of 110+ people, located in thirteen countries, that think computers should do more work. For the past six years, Zapier has been helping people across the world automate the boring and tedious parts of their job. We do that by helping everyone connect the web applications they already use and love.<br><br>We get together 2-3 times per year for a company retreat, and benefits include great healthcare, dental and vision coverage, 401k retirement plan with company match, profit sharing and 14 weeks paid leave for new parents.<br><br>To be considered for this role, please complete the application on <a href='https://goo.gl/pwVDLy' rel='nofollow'>Jobs @ Zapier</a>We're not accepting applications from agencies.</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 12, 2017 6:09:56 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "qDskP-2JR3u47qF0MBYUMA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/jobs/5528-ux-infographic-designer-for-interactive",
    "title": "Gear Stream, Inc.: UX Infographic Designer for Interactive Website",
    "content": "<div>  <div>    <h2>UX Infographic Designer for Interactive Website</h2>      <h4>Posted Oct 11</h4>    <h3>      <span>Gear Stream, Inc.</span><br>      <span>Headquarters: Raleigh</span><br>        <a href='http://www.gearstream.com' rel='nofollow'>www.gearstream.com</a>    </h3>  </div>    </div>  <div>    <div><b>Note 1:&nbsp; </b>This is a short, strategic design project, not a long-term job.</div><div><br></div><div><b>Note 2:</b> We are open to freelancers working remotely, but prefer those who are fluent in English and who's work hours overlap the eastern U.S.</div><div><br></div><div><b>Project Brief:</b></div><div>We have a COMPLEX process we seek to illustrate through the compelling use of interactive infographics.&nbsp; The infographics will be used to navigate through a detailed guidebook with over 20K written words.&nbsp; The illustrations will also be used throughout the guide book to amplify complex interactions and processes to ensure understanding.</div><div><br></div><div><b>The ideal freelancer for this project has the following skills:</b></div><div><br></div><div>1 - Killer UX / Web / Product Design skills... By UX we don't mean UI or pure visual design skills... we mean someone who understands the user experience and how to present complex information in a way that is approachable, intuitive, and motivates the user to explore further.</div><div><br></div><div>2 - Illustration skills - we need someone who has a range of visual illustration skills including flat line drawing, and organic / quirky.</div><div><br></div><div>3 - Art Direction - we need someone who can work from a concept and our detailed content and &quot;make sense&quot; of how best to conceive and illustrate the required visuals<b><i> in a way that convey important ideas BEYOND THE LEVEL OF GENERAL CONCEPT OR IDEA</i></b>.</div><div><br></div><div><b>Example Website:</b></div><div>The following website is ONLY an example of the what we mean when we say we want to use a strong visual, infographic style of communication and navigation to communicate a large volume of complex information.</div><div><br></div><div>https://less.works/</div><div><br></div><div><b>What we are NOT looking for:</b><br></div><div></div><div></div><div>We are NOT seeking a wordpress &quot;implementor&quot;, or wordpress theme &quot;customizer&quot;&nbsp;</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='mailto:brad.murphy@gearstream.com' rel='nofollow'>brad.murphy@gearstream.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 12, 2017 12:04:59 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "ZZptVOHoT-ejcNPob8LloQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62172",
    "title": "Mobile Application Design Company",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Royal Cyber is hiring a Mobile Application Design Company in Remote</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 11, 2017 9:50:11 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "TU9LsYE3RByAyJkuZ79gUA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3917-senior-product-designer-learnzillion",
    "title": "Senior Product Designer @ LearnZillion",
    "content": "<h2>              Senior Product Designer<small> @ LearnZillion</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-08 03:36</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>Location:</strong> Washington, DC or US-remote</p><p><strong>Department:</strong> Engineering &amp; Design</p><p><strong>Type:</strong> Full Time</p><p><strong>Min. Experience:</strong> Experienced</p><p>DC local or remote full-time staff position for authorized U.S. workers. No visa sponsorship available at this time, sorry.</p><p><strong>Overview</strong></p><p>Help us create the digital curriculum of the future.</p><p>Our well-funded, fast-growing education technology startup is looking for product designers to help us create essential tools for teachers, students, districts, and parents. You will play a key role in building LearnZillion’s technology platform and shaping its future. You will work closely with product designers, software engineers, product managers, academics, our co-founders, and user community to build our world-class web and mobile applications.</p><p>You should be well-versed in user experience, visual, and product design, technically skilled, focused, and creative.</p><p><strong>The Company</strong></p><p>LearnZillion is a social enterprise founded by two former teachers. We provide a learning platform that helps teachers and parents meet the educational needs of every student. We are building an online, collaborative, curricular platform with lessons, resources, assessments, and activities created by some of the country’s best teachers.</p><p>More about us and our DreamTeam teachers:</p><p><a href='https://learnzillion.com/p/company/' rel='nofollow'>https://learnzillion.com/p/company/</a></p><p><a href='https://learnzillion.com/p/community/' rel='nofollow'>https://learnzillion.com/p/community/</a></p><p>LearnZillion is funded through the Bill &amp; Melinda Gates Foundation, NewSchools Venture Fund, O’Reilly AlphaTech Ventures, Learn Capital, Owl Ventures, and others. More than 1M teachers and millions of students in the U.S. use LearnZillion.</p><p>Some of our mentions:</p><p><a href='http://www.fastcompany.com/3026328/most-innovative-companies-2014/the-worlds-top-10-most-innovative-companies-in-education' rel='nofollow'>http://www.fastcompany.com/3026328/most-innovative-companies-2014/the-worlds-top-10-most-innovative-companies-in-education</a></p><p><a href='http://schoolsofthought.blogs.cnn.com/2012/06/27/the-evolving-classroom-lessons-go-virtual/' rel='nofollow'>http://schoolsofthought.blogs.cnn.com/2012/06/27/the-evolving-classroom-lessons-go-virtual/</a></p><p><a href='https://www.facebook.com/BillGates/posts/144029255754260' rel='nofollow'>https://www.facebook.com/BillGates/posts/144029255754260</a></p><p><a href='http://www.thegatesnotes.com/Topics/Education/Why-Im-Excited-about-the-Arrival-of-Back-to-School-Season' rel='nofollow'>http://www.thegatesnotes.com/Topics/Education/Why-Im-Excited-about-the-Arrival-of-Back-to-School-Season</a></p><p><a href='http://www.marketplace.org/topics/life/education/learnzillion-does-number-classrooms' rel='nofollow'>http://www.marketplace.org/topics/life/education/learnzillion-does-number-classrooms</a></p><p><strong>Our Team</strong></p><p>The Engineering &amp; Design team excels at building product that delights users and solves complex problems simply. We ship product daily, value iteration over big upfront design, pay attention to the details, and help each other improve.</p><p>Our team is made up of experienced and newer SaaS product builders. We not only impact LearnZillion but regularly provide thought leadership and design contribution to the third parties we rely on, including many big name tech companies.</p><p><strong>Our Design Tool Stack</strong></p><ul><li>Adobe Creative Suite</li><li>HTML and CSS (Ruby on Rails 4 with HAML and SASS+Compass)</li><li>Marvel</li><li>FullStory</li></ul><p><strong>Key Responsibilities</strong></p><ul><li>Collaborate with coworkers and users to uncover product needs</li><li>Design research, wireframe, sketch, whiteboard, prototype, design, and build user experiences</li><li>Design and develop simple, easy-to-use, user interfaces to add impactful new features</li><li>Front-end development of features in HTML, CSS, and a smidgen of JavaScript. Engineers are always ready to help.</li></ul><p><strong>Qualifications</strong></p><ul><li>3+ years of web application product design. Mobile application product design a plus.</li><li>Strong visual and interactive design skills, as demonstrated by a portfolio of your prior work and the resulting implementations--whether you wrote the HTML and CSS or someone else did</li><li>Intrinsically-motivated individual who loves to get things done</li><li>Portfolio or collection of screenshots of past projects for us to review</li><li>Desire and aptitude to learn and build product with HTML and CSS</li></ul><p><strong>Benefits</strong></p><ul><li>Competitive salary and paid time off</li><li>4% 401(k) contribution matching</li><li>Remote-work friendly schedule</li><li>Work daily with top-notch product design and engineering team members</li><li>Make the digital curriculum of the future a reality for students everywhere</li><li>LearnZillion is an equal opportunity employer.</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>United States</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 8, 2017 6:35:42 AM",
    "tags": [
      "TITLE1_designer",
      "TZ_America",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "Qdar1ViFQZKi2EkrfUc56A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/jobs/5455-lead-visual-designer-illustrator",
    "title": "Groove: Lead Visual Designer/Illustrator",
    "content": "<div>  <div>    <h2>Lead Visual Designer/Illustrator</h2>      <h4>Posted Oct  2</h4>    <h3>      <span>Groove</span><br>      <span>Headquarters: All the places.</span><br>        <a href='http://www.groovehq.com' rel='nofollow'>www.groovehq.com</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><a href='https://www.groovehq.com/' rel='nofollow'><span>Groove</span></a><span> is a customer service software company, and we’ve spent the last five years building what we think is the best support email management tool on the planet. </span></div><div><br></div><div><span>And now, if you’re an extraordinary designer who believes in our </span><a href='https://www.groovehq.com/blog/core-values' rel='nofollow'><span>core values</span></a><span>, we want your help sharing our story with the 300,000 people who come across our brand each month.</span></div><div><br></div><div><span>As our lead designer, your job will be to take charge of all aspects of our visual identity, from our marketing </span><a href='https://www.groovehq.com/' rel='nofollow'><span>site</span></a><span> to our </span><a href='https://www.groovehq.com/blog' rel='nofollow'><span>blogs</span></a><span> to our </span><a href='https://www.groovehq.com/blog/content-marketing-course-application-page' rel='nofollow'><span>courses</span></a><span> and more. &nbsp;</span></div><div><br></div><div><span>You’ll ensure that the design across all of these is delightful, effective, consistent and extremely usable.</span></div><div><br></div><div><span>Most of your work will take place on the marketing side, though you’ll also be asked to help with in-app design from time to time, as well.</span></div><div><br></div><div><span>We’re not just looking for someone to “make things pretty.”</span></div><div><br></div><div><span>Yes, you need to be an artist, and yes, your art will be beautiful, but that’s not the extent of the difference you’ll make here.</span></div><div><br></div><div><span>Your performance will be measured not in pixels or hours, but in the impact your work has on our business. </span></div><div><br></div><div><span>If that excites you, we should talk.</span></div><div><br></div><div><span><b>What’s in it for you?</b></span></div><div><br></div><ul><li><span>Work with smart, talented people who deeply believe in you and the work you do</span><br></li><li><span>Build your skills as a growth-focused designer, learning rapidly how each move you make impacts the hundreds of thousands of people who see it</span><br></li><li><span>Work from anywhere in the world with an internet connection</span><br></li><li><span>Competitive salary, obviously</span><br></li></ul><div><br></div><div><span><b>What you’ll work on:</b></span></div><div><br></div><div><span>You’ll work directly with our marketing team to:</span></div><div><br></div><ul><li><span>Create best-in-class design every week that delivers massive value to our audience and drives growth for our business, including:</span><br></li><li><span>Marketing site design</span><br></li><li><span>Marketing site illustrations</span><br></li><li><span>A/B test variants for various pages on our site</span><br></li><li><span>Landing pages</span><br></li><li><span>Blog illustrations </span><br></li><li><span>Infographics</span><br></li><li><span>Educational content (e.g., online course slides)</span><br></li><li><span>Webinar presentations</span><br></li><li><span>Other marketing miscellania</span></li><li>Pitch in your expertise to help us meet various quarterly goals, like “improve conversions on page X”</li><li>Come up with strategies and ideas to keep pushing our design forward, and then own the execution</li></ul><div><br></div><div><span><b>Key Requirements:</b></span></div><div><br></div><ul><li><span>Extensive experience doing world-class design work that drives conversions online </span><br></li><li><span>Self-starting and communicative; we’re a remote team, and you’ll be responsible for doing amazing work when nobody is watching</span><br></li><li><span>Experience working remotely</span><br></li><li><span>Organized; our brand has a lot of moving pieces, and you’ll help us add more</span><br></li></ul><div><br></div><div><span>If you haven’t already seen our blogs, check them out here:</span></div><div><br></div><ul><li><a href='https://www.groovehq.com/support' rel='nofollow'><span>Support Blog</span></a><br><br></li><li><a href='https://www.groovehq.com/blog/startup-journey' rel='nofollow'><span>Journey to $100K Blog</span></a><br></li></ul><div><br></div><div><b>Before applying</b>, take some time to learn more about our company, and <a href='https://www.groovehq.com/about' rel='nofollow'><span>especially our core values</span></a>. They’re very, very important to us.</div><div><br></div><div><span>If this sounds like a role you’re excited to take on, email alex at groovehq with:</span></div><div><br></div><ol><li><span>“Groove Designer” in the subject line</span><br></li><li><span>Your dribbble page (or other portfolio link)</span><br></li><li><span>2 ideas for how you’d improve our existing visual brand in the first 30 days</span><br></li><li><span>Your favorite GIF and/or Urban Dictionary word</span><br><br></li></ol>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send the details above to <a href='mailto:alex@groovehq.com' rel='nofollow'>alex@groovehq.com</a>.</p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 2, 2017 5:59:20 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "BIE1ZEC6Q0Sx9ypPufoMzw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "smashingmagazine.com-programming",
    "url": "http://jobs.smashingmagazine.com/j/Probably-the-Best-Front-End-Developer-Job-in-the-World/2503597",
    "title": "Probably the Best Front-End Developer Job in the World - The Interaction Design Foundation - (Anywhere) - FullTime",
    "content": "<li>          <a rel='nofollow'>                 The Interaction Design Foundation</a>              (Anywhere)          </li><li>                  Fulltime Job        </li><h2>Probably the Best Front-End Developer Job in the World</h2><h3><span>IDF</span> seeks a Senior Front-End Developer to shape the future of design education</h3><p>The&nbsp;Interaction Design&nbsp;Foundation is the world’s most prestigious community and course platform for user experience designers. We are a nonprofit organization with a mission to reduce the cost of&nbsp;design education&nbsp;around the world, and we do so by providing high-quality online UX design courses at an affordable membership fee. With tens of thousands of members learning from our courses, and hundreds of thousands reading our free educational materials, we’re one of the largest UX design communities around the world.</p><p>We’ve spent the last 15 years building our community, and the last year rebuilding our course platform—based on a brilliant technology stack. And now we want&nbsp;you&nbsp;to help us build pure awesomeness in versions 7, 8, 9, etc.! If you’re a senior front-end developer with sublime programming skills acquired from 5+ years of experience, we’d like to work with you.</p><p>This is a paid&nbsp;full-time&nbsp;position. You’ll be&nbsp;location independent&nbsp;and will therefore be free to work from wherever you want in the world. You will have regular video-based contact with your colleagues and will get to meet them physically on team trips (see below).</p><h3>Why you’ll want to join us:</h3><ul><li>You get to work in an international team where we truly and deeply care about great architecture, great code, great documentation, great tests, etc.</li>    <li>We love our codebase and that’s why we have zero tolerance for spaghetti code and <a href='https://martinfowler.com/bliki/TechnicalDebt.html' rel='nofollow'>technical debt</a>. Code should be so well-crafted that you want to kiss the screen. </li>    <li>You will have uninterrupted concentration time every day to build pure front-end awesomeness and thus accelerate your learning curve. If you were to work at Facebook or Google, you would be <a href='https://qz.com/806583/programmers-hate-open-floor-plans/' rel='nofollow'>constantly interrupted</a> and only have 2 hours of uninterrupted “flow time” per day. That creates a <a href='https://blog.ninlabs.com/2013/01/programmer-interrupted/' rel='nofollow'>slow learning curve</a>. Working with us, you get a full 7 hours per day. Imagine what that will do to your mental muscles, to your learning and to your career.</li>    <li>You will help shape the future of design education which millions of people can benefit from.</li>    <li>You will work with the best developers and designers in the world. And learn from them.</li>    <li>You will have the ability to work from anywhere — as long as your internet connection allows you to have video-based contact with your colleagues every day.</li>    <li>You get to work with true perfectionists! The development team is a small, senior, and highly-powered team of 7 people: 4 developers, a visual/UX designer, a software tester/QA, and a product owner. They also get input/help from an additional 4 people – as well as from our community of tens of thousands of designers and front-enders who love to provide feedback. You can learn enormous amounts. </li>    <li>You get to meet up with the rest of the team several times a year at interesting destinations like a scenic Thai island, Dubai, Denmark, or the like. See <a href='https://www.interaction-design.org/careers/' rel='nofollow'>the video about our company culture</a> for more.</li>    <li>We have a focus on evergreen programming techniques and best practices, as opposed to the latest hyped framework. We’d rather hand-craft things ourselves than build our platform on a gazillion 3<sup>rd</sup> party libraries. Just ask Facebook: <a href='https://qz.com/646467/how-one-programmer-broke-the-internet-by-deleting-a-tiny-piece-of-code/' rel='nofollow'>they know it sucks</a>. </li>    <li>Our <span>CEO</span> is a programmer and you will therefore not have to worry about “management speak” in order to get your point across. Just let your awesome code “speak for itself” and you will earn respect immediately!</li></ul><h3>What you will be doing:</h3><ul><li>You will take ownership and leadership of an ever-growing front end codebase where elegance and simplicity must be maintained and furthered – and where the evil forces <a href='https://en.wikipedia.org/wiki/Software_entropy' rel='nofollow'>entropy</a>, <a href='https://en.wikipedia.org/wiki/Software_bloat' rel='nofollow'>bloat</a>, and spaghetti must be fought back by your intellect and coding skills.</li>    <li>Helping us to build an online course that will teach millions of designers how to become front-end developers. This will hugely improve your skills and ability to communicate – and will prove to be an awesome challenge!</li>    <li>Helping us to build an online course for our members on the topic of Design Systems – bringing Front End Development together with UI/UX Design.</li>    <li>Creating animations that are not only beautiful, but meaningful and are features that add to the UX of our users.</li>    <li>Building upon our current front end style guide and coding guides, which let our back end developers use front end components with ease. You will build a “design system” that is extremely detailed yet also easy to navigate and use…. much like <a href='https://polaris.shopify.com/' rel='nofollow'>https://polaris.shopify.com/</a></li></ul><h3>About you:</h3><ul><li>You love to learn and push your skills to new levels.</li>    <li>You have 5+ years of experience working professionally with OO + <span>MVC</span> (preferably web technologies).</li>    <li>You have an understanding of basic programming patterns and principles as well as a strong sense of good engineering and architecture.</li>    <li>You want to help us take our educational platform to the next level with front-end awesomeness: Animations, interactivity, social features, data-driven design, a better mobile version, “little big details”, and much more.</li>    <li>You want to help build a rock-solid and perfectly architected and documented front-end codebase.</li>    <li>You are truly ambitious, result-oriented, friendly, and you like to continually improve.</li>    <li>You are self-motivated and love to see tangible results.</li>    <li>You speak and write acceptable English – not perfect English, just acceptable – since you will be working with people from Turkey, England, Denmark, Russia and Brazil, among others.</li>    <li>It’s a plus if you have an experience with Typescript/Flow, any JS framework, and/or <a href='https://developers.google.com/web/progressive-web-apps/' rel='nofollow'><span>PWA</span></a>.</li>    <li>It’s a big plus if you have contributed to open source.</li>    <li>It’s a big plus if you have worked professionally with at least one statically typed programming language like C, C++, Java, etc.</li></ul><h3>About the technology stack:</h3><p>We believe we have an awesome technology stack and a great (and agile) development process to back that up (Scrum). You don’t have to be an expert in all of these things. The most important things are your programming skills and extensive experience from other projects.</p><p>The technology stack is currently:</p><ul><li>Modern JS stack: ES6, Babel, JS modules, module bundling.</li>    <li><a href='http://getbem.com/introduction/' rel='nofollow'><span>BEM</span></a>/<span>ITCSS</span> as our <span>CSS</span> methodology for modular, reusable, and very well structured code.</li>    <li>We support only modern browsers (IE11+).</li>    <li>A clean separation between front-end and back-end code.</li>    <li><span>PHP</span> 7.1 where we use all the newest language features like type declarations.</li>    <li>A framework which has an incredible community support. The name of the framework is not important since we are technology agnostic.</li>    <li>MySQL 5.7 configured for the highest performance; Redis for our caching needs.</li>    <li>One of the best content delivery networks with tons of delivery points all over the world for lightning fast pages.</li>    <li>Nginx with HTTP2 enabled – and thus the ability to architect your JS code more flexibly because of the architecture of the HTTP2 protocol</li>    <li>Git and <a href='https://github.com/' rel='nofollow'>GitHub</a> using <a href='https://datasift.github.io/gitflow/IntroducingGitFlow.html' rel='nofollow'>gitflow</a>.</li>    <li><a href='https://www.vagrantup.com/' rel='nofollow'>Vagrant</a> (with <a href='https://www.virtualbox.org/' rel='nofollow'>VirtualBox</a>) and seamless CI and deployment infrastructure.</li>    <li>…and well… lots more!</li></ul><h3>Want to join our team? Here is how!</h3><p>Please send an email to Rikke Friis Dam at <a href='mailto:rikke.friis.dam@interaction-design.org' rel='nofollow'>rikke.friis.dam@interaction-design.org</a> with the following:</p><ul><li>Screener question: Please tell us why you want to put your heart, mind and hard work into this job. </li>    <li>Screener question: Tell us the 3 productivity tips/methods that work best for you.</li>    <li>A personal job application</li></ul><p>Apply as soon as you can – we’re firm believers of “the sooner, the better”. We’re looking forward to working with you!</p><h3>How to apply</h3>",
    "urlFetchPending": false,
    "published": "Aug 17, 2017 4:29:44 PM",
    "tags": [
      "TITLE1_designer",
      "TECH2_Programming",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "Programming"
    ]
  },
  {
    "id": "eCshGDqwRgWSq4nHrgi8zg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "smashingmagazine.com-programming",
    "url": "http://jobs.smashingmagazine.com/j/Front-end-WordPress-Developer-Designer/2503595",
    "title": "Front-end & WordPress Developer/Designer - Design Rangers - (Colorado Springs, CO) - FullTime",
    "content": "<li>          <a rel='nofollow'>                 Design Rangers</a>              (Colorado Springs, CO)          </li><li>                  Fulltime Job        </li><h2>Front-end &amp; WordPress Developer/Designer</h2><h3><span>COMPANY</span> &amp; <span>CULTURE</span></h3><h3><span>STEWARDS</span> OF <span>OUR</span> CLIENTS’ <span>BRANDS</span>.</h3><p><strong>We help clients discover and tell their stories. We need your help to do it.<br><br></strong>Our clients trust us to take care of them – and their brand – especially when crafting their digital experiences. We believe the combination of curiosity, design, writing, development and a little bit of adventure can create something more than just a website. Our holistic approach allows us to put goals before technology and meaning before jargon.</p><p>The Design Rangers are a small, 4-person design and marketing strategy firm based in sunny Colorado Springs, Colorado, where we play (almost) as hard as we work. We’re celebrating our 10th anniversary this year and proud of our humble basement beginnings.</p><h3><span>WHO</span> IS <span>THE</span> <span>IDEAL</span> <span>DEV</span> <span>RANGER</span>?</h3><ul><li>Someone who sees code as art. Art that when combined with strategy, design and content, becomes a masterpiece.</li><li>A designer-turned developer or a developer with an <span>HUGE</span> appreciation for good design</li><li>A willing collaborator who wants to work with a team to make the best experiences possible</li><li>A life-long student</li><li>Someone who likes to laugh and have fun</li></ul><h3><span>THE</span> <span>RANGER</span> <span>CAMP</span> (<span>OUR</span> <span>CULTURE</span>):</h3><ul><li><strong>Fun and lively –</strong>&nbsp;Our Slack channel makes full use of Giphy. We like to talk, joke, have fun and eat tacos (even on a Monday.)</li><li><strong>Storytellers –</strong>&nbsp;We believe every client has a story that will connect them to their audience, and we love discovering it.</li><li><strong>Collaborators –</strong>&nbsp;We think together is better.</li><li><strong>Contributors –</strong>&nbsp;Free marketing workshops for nonprofits, sharing lessons learned with our competitors, connecting with our community. We want to be part of the conversation.</li><li><strong>Outdoorsy –</strong>&nbsp;This is Colorado after all. Several of our clients are based in the outdoor/recreation industry and we’re out in it whenever possible.</li><li><strong>We work with nice people –</strong> Because life’s too short to work with jerks.</li><li><strong>Cause related –</strong>&nbsp;Nonprofits love us and we love them.</li><li><strong>Honest –</strong>&nbsp;We are Rangers, and open and honest communication is part of our <span>DNA</span>.</li></ul><h3><span>OUR</span> <span>DESIGN</span>/<span>DEV</span> <span>PHILOSOPHY</span>:</h3><p>We’ve been watching industry leaders and adding our own Ranger insights to the mix, using atomic design principles and new deliverables like element collages to forge a new path. Don’t know what those things are? You should be looking them up. Currently we’re using tools like Sketch, InVision, WordPress, the X Theme/Pro/Cornerstone framework along with hand-crafted design, code and content to get the job done.</p><h3><span>SKILLS</span> TO <span>PAY</span> <span>THE</span> <span>BILLS</span>:</h3><h3><span>REQUIRED</span>:</h3><ul><li><strong>Front-end development –</strong> You know, the crafting of <span>HTML</span>, <span>CSS</span> &amp; JS into art like we talked about earlier. Oh, and it’s 2017 for goodness sakes, <span>EVERYTHING</span> has to be responsive.</li><li><strong>Wordpress development –</strong> You don’t need to be a <span>PHP</span> genius, but you do need to understand how basic hooks, actions, logic and structure work. Things like:<ul><li>WordPress best practices</li><li>Theme development, child themes and template creation</li><li>Working with the WP Codex</li><li>Working with existing frameworks and plugins</li><li>Creating basic extensions and/or plugins</li><li>Creating intuitive, user-friendly experiences, even in the back-end</li></ul></li><li><strong>Flexible approach to design and development –</strong> Everyone has their own way of doing things. We need someone who is always willing to experiment and change workflows when and if it makes sense.</li><li><strong>Tenacity –</strong> Dev can be frustrating, trust me, we know. But we need someone who won’t give up. Someone who curses the existence of IE but finds the solution and rises triumphantly nonetheless. #winning</li><li><strong>Detail-oriented –</strong> Sorry, 19px Arial is not close enough to 1.25rem Proxima Nova. You’ll need to be a stickler for all the little details. We all do.</li><li><strong>Thinks beyond the brackets –</strong> Your key skill is code. Our key differentiator is creating great experiences. Creating them requires thinking about the entire solution, not just one piece of it.</li><li><strong>Able to take and give feedback –</strong> Your opinion matters. So does ours. Let’s make great things together!</li></ul><h3><span>IMPORTANT</span>:</h3><ul><li><strong>OK with frameworks and <b>gasp</b> even plugins –</strong> Yes, we said the “P” word. We know custom code is always cleaner and faster. Yes, we know frameworks can add additional overhead. We also know that they can jump-start great solutions instead of re-inventing the wheel.</li><li><strong>Basic design principles –</strong> You don’t need to be a designer, but you should be able to see that <a href='https://stripe.com/' rel='nofollow'>Stripe’s website</a> looks a lot better than <a href='http://electrifyingtimes.com/' rel='nofollow'>Electrifying Times</a>.</li><li><strong>A student of life –</strong> We learn something new every day. So should you.</li><li><strong>Problem-solver –</strong> Our clients have challenges. Help us solve them.</li><li><strong>Communication skills –</strong> Be clear. Be concise. And above all else, be human. Bonus points if you can make us laugh.</li><li><strong>Tasks both big and small –</strong> Sometimes we’re creating a site that brings a client to tears. Sometimes plugins need updated. You’ll be responsible for these things and everything in-between.</li></ul><h3><span>NICE</span> TO <span>HAVE</span>:</h3><ul><li><span>PHP</span> skills</li><li>Full-stack skills</li><li>Familiarity with Agile design&nbsp;principles</li><li>Familiarity with Atomic design principles</li><li>Familiarity with <span>GIT</span> versioning</li><li>Web and/or print design skills</li><li>Loves to create a good process</li><li>Up on modern standards/techniques</li><li>Familiar with Sketch, Adobe and InVision products</li><li>UX experience</li><li>Theme and/or plugin development</li></ul><h3><span>THE</span> <span>JOB</span>:</h3><h3><span>WHAT</span> YOU’LL BE <span>DOING</span>:</h3><ul><li><strong>Crafting code –</strong> Creating digital experiences that foster an environment of success for everyone involved:<ul><li>The end user</li><li>The content managers</li><li>The stakeholder</li></ul></li><li><strong>Websites –</strong> Creating websites, from single-page campaign support to full-blown corporate basecamps.</li><li><strong>Design systems –</strong> Creating pattern libraries of design and code that can act as Lego blocks for a brand.</li><li><strong>Surprise-and-delight –</strong> Micro-interactions and small additions that make a big difference.</li><li><strong>Processes –</strong> Building and documenting Ranger-approved ways of working that can be re-used and enhanced over time</li><li><strong>Web maintenance, updates and refinements –</strong> The little stuff that’s critical to keep a site running smoothly.</li><li><strong>Extending and refining existing client sites –</strong> &nbsp;Based on data, behavior and business needs.</li><li><strong>Determining the best dev solutions – </strong>Using a holistic approach that considers the entire experience and all audiences including content managers.</li><li><strong>Support –</strong> Respond to and take action on support tickets and on-going web refinements for clients.</li><li><strong>Keep the Ranger site looking tip-top –</strong> because it tends to get neglected. Like hasn’t been updated in 2+ years neglected.</li><li><strong>Contributing –</strong> to our on-going discussion of how design and dev can help get to the essence of the client’s story.</li></ul><h3><span>SPECIFICS</span>:</h3><ul><li>Full-time preferred, part-time with secured hours considered.</li><li>In-office working arrangement preferred but open to a remote working situation.</li><li>We’ll require finalists to take a sample design and dev it. Paid of course, but you can’t BS your way through it.</li><li>We’ll want to know a lot about who you are and if you’re a fit.</li><li>Sell us! Write something interesting that lets me know who you are and what you can bring to the table.</li><li>Tell us the most interesting development problem you’ve solved.</li><li>Show us how you’ve used WordPress in interesting ways.</li><li><span>MUST</span> show completed websites and/or products you’ve worked on.</li><li><span>MUST</span> provide code examples via said websites and/or GitHub, CodePen, etc.</li><li>Salary requirements.</li></ul><h3><span>BENEFITS</span>:</h3><ul><li>Competitive salary</li><li>Health benefits</li><li>Generous paid vacation time</li><li>Beer tap and top-tier coffee just steps away</li><li>Environment where you can participate and make a difference</li><li>Collaborative workspace surrounded by architects, designers and fine artists</li><li>S’mores</li></ul><h3>How to apply</h3><a href='http://designrangers.com/contact/employment' rel='nofollow'>http://designrangers.com/contact/employment</a>",
    "urlFetchPending": false,
    "published": "Aug 16, 2017 12:40:30 AM",
    "tags": [
      "TITLE1_designer",
      "TECH2_Programming",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "Programming"
    ]
  },
  {
    "id": "QeTh-phzSAqhWxoX3QhCwQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Senior-Product-Designer/2503457",
    "title": "Senior Product Designer - Decisiv - (Virginia) - FullTime",
    "content": "<li>          <a rel='nofollow'>                 Decisiv</a>              (Virginia)          </li><li>                  Fulltime Job        </li><h2>Senior Product Designer</h2><p>Decisiv</p><p><span>YOE</span>: 3-6</p><p><span>JOB</span> <span>DESCRIPTION</span></p><p>Decisiv is looking for a Senior Product Designer with deep proficiency in creating user-focused interfaces with an Agile development team. Your work will be critical to the success of our product and as such is highly valued by the organization–particularly now, as we embark on a massive user interface update. You should be passionate about the user experience, with a track record of success with UX research and implementations that benefit the end user.</p><p>Decisiv is a rapidly-growing industry leader in the asset management and service supply chain marketplace. Our size means you’ll have major opportunities to expand your skill-set and contribute in a big way to the future of our product. Accordingly, our Design team is a group of self-starters, eager to produce quickly and solve big problems for our customers. We’re agile, flexible, and autonomous, working remotely via Slack, GitHub, Jira, Confluence, and Zoom.</p><p>Your career growth and development is top-of-mind for us. You’ll learn a lot here, and you’ll succeed as well. And while we will expect a lot from you, we also value your life outside of work; recharging is important, and we strive to offer an environment that reflects that.</p><p>The Senior Product Designer will report directly to the Senior Director of User Experience &amp; Design.</p><p><span>KEY</span> <span>RESPONSIBILITIES</span></p><p>Demonstrate ownership and lead product design for a specific portion of our product, applying a combination of direction and styles approved by the Senior Director and a deep understanding and empathy for the core persona<br><br>Mentor more junior designers within the organization, and encourage consistency and growth in the designs of the larger design team<br><br>Collaborate with other designers, developers, and product management team members to determine opportunities to improve the product<br><br>Design wireframes, user stories, user journeys, mockups, and click-through prototypes to communicate design solutions to engineering teams, internal stakeholders, and end users<br><br>Advocate for the user’s total experience across all touch points; from the corporate website to the end users’ impression of the product itself<br><br>Keep up-to-date about new and successful user experience techniques, share your knowledge on the latest trends and interaction patterns, and evangelize design-oriented thinking throughout the Decisiv organization <br><br>Apply user research methods for identifying problems in the user’s journey, determine the best resolution, and aid in the design and execution of usability tests<br><br>Contribute to the design of other collateral in support of the product, including our corporate website, white papers, template files, trade show elements, and more</p><p><span>DESIRED</span> <span>SKILLS</span> &amp; <span>EXPERIENCE</span></p><p>Completed studies in the field of Human Factors, Human-Computer Interaction, Psychology, Information Design, Interaction Design, Media Design, User Experience or similar programs, or equivalent work experience designing successful digital user-experiences<br><br>3-6 years of work experience doing UX and/or product design<br><br>Understanding of how to apply various user research methods to help define user needs and goals<br><br>Detail-oriented design and communication; the tiny details make a major impact<br><br>Experience designing wireframes and mockups using standard tools such as Illustrator, Sketch, and Balsamiq (or equivalent) to demonstrate design solutions that impact the user throughout their interaction lifecycle<br><br>Experience with and desire to lead teams of designers<br><br>Experience with mobile design patterns gets you some big thumbs up<br><br>Skill with developing light-weight click-preview prototypes with <span>HTML</span>/<span>CSS</span> is a plus<br><br>Interest and skill in developing data visualizations is also a bonus<br><br>Ability to prioritize and manage multiple design projects, strong organizational and time-management skills<br><br>People most qualified for this role will be:<br><br>Curious – about the latest UX trends and interaction patterns<br><br>Driven – to improve interactions across all user touch-points, from the beginning of their journey to the end<br><br>Smart – learn our systems and our industry quickly<br><br>Hard working – we are growing, and we’ve got a lot to accomplish<br><br>Outgoing – we have a rapidly growing, global team, and you’ll be interacting with a lot of different people within the organization, so building relationships that allow you to work productively with those teammates is key<br><br>Collaborative – we work as a team, and are firm believers that the best solutions are a team effort<br><br>Organized – like we said, there’s a lot going on, so it’s important that your work is easily accessible, shareable, and streamlined</p><p><span>PORTFOLIO</span></p><p>Show us what you’ve got! We want to see your design experience, whether it’s a full-fledged portfolio, sketches, wireframes, prototypes, personas and research, or all of the above. Please send a resume and relevant work samples to careers@decisiv.com.</p><h3>How to apply</h3>",
    "urlFetchPending": false,
    "published": "Jul 25, 2017 5:42:58 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown",
      "TECH2_Design"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "Design"
    ]
  }
]
}
