{
 "items": [
  {
    "id": "b8S49lVBQ9mWjEZnoVcAMw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62423",
    "title": "Contract Designer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Skookum is hiring a Contract Designer anywhere</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 8:53:19 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "kpALTD7yQaS_Bh672lFyIw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/63083/freelance-digital-learning-designer-at-nurserybook/",
    "title": "Freelance digital learning designer",
    "content": "Our mission is to deliver a personalised and engaging online learning platform to support childcare professionals in their continuous professional development.<br /><br />Our solution will be designed for the individual; personalised and relevant to their development needs. It focuses on being fun, easy to use and highly engaging. Encouraging childcare professionals to take a little and often approach to their development.<br /><br />We are seeking a passionate digital learning designer to help us deliver industry leading training.<br /><br /><br />== We’re looking for ==<br /><br />* Experience of developing creative and innovative online adult learning solutions<br />* Knowledge of digital pedagogy, learning theories and instructional design<br />* Ability to structure meaningful learning curriculums<br />* Self-motivated, able to assume responsibility and work autonomously<br />* Excellent verbal and written communication skills<br />* Experience of defining learning objectives and content scoping<br />* Experience with gamification [Nice to have]<br />* Experience in blending learning design [Nice to have]<br />* Experience of social learning design [Nice to have]<br />* Knowledge of SCORM and LMS/LCMS [Nice to have]<br /><br /><br />== What you’ll do day to day ==<br /><br />* Work with early years education experts to identify childcare training needs and develop solutions for them<br />* Develop high-level content plans for subject matter experts<br />* Produce learning design guidelines for content development<br />* Review content from our training providers (learning activities, exercises, assessments etc.)<br />* Build engaging learning activities and compelling course content<br />* Produce content to support the training delivery<br />* Build virtual rewards and badges to incentivise learners<br /><br />== About us ==<br /><br />Kinderly is an award-winning Edtech company based in London and Bath.<br /><br />We provide a software solution that supports childcare professionals to be at their best in capturing a child’s early years journey whilst at the same time improving engagement and communication with parents to give children the best start in life.<br /><br /><br />== The role ==<br /><br />* Freelance<br />* Remote working<br />* Part-time<br />* 2 – 3 days per week<br />* Flexible hours<br />* Immediate start<br />* Competitive day rate",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 12:20:31 PM",
    "tags": [
      "TITLE1_designer",
      "TZ_Europe",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "Europe timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "KqQ3YLmARPOhyfNVSCLcoQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Product-Designer/2503686",
    "title": "Product Designer - Customer.io - (Remote) - FullTime",
    "content": "<li>          <a rel='nofollow'>                 Customer.io</a>              (Remote)          </li><li>                  Fulltime Job        </li><h2>Product Designer</h2><p>Hi, I’m Brian, Director of Product at Customer.io,</p><p>I’m looking for a Designer to join our product team and help us take our interface to the next level. You should be someone who is strong in the visual side of UI design, yet we’re a small team where you’ll get to work across the full spectrum of experience design. Our team is completely distributed so you can work whenever and wherever you’re most productive.</p><p>The design you’ll do here will help raise the bar for the everyday communications we all receive. Customer.io is a powerful tool used by over 1000 businesses to manage, send, and track performance of email, SMSes and push notifications.</p><p>Our customers are marketers, growth hackers, and engineers who are always dreaming up fresh ideas for how to be genuine and personal in their messages to customers. Unlike typical marketing platforms, we help businesses send relevant messages based on what people do or don’t do when logged in to a web or mobile app.</p><p>Sound like the next step in your career? Read on and apply at: http://grnh.se/v30tsu1</p><p>P.S. Identify more as UX Designer? UI Designer? Don’t worry about it – let us know if you think this is the place for you.</p><h3>How to apply</h3><a href='http://grnh.se/v30tsu1' rel='nofollow'>http://grnh.se/v30tsu1</a>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 12:43:07 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown",
      "TECH2_Design"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "Design"
    ]
  },
  {
    "id": "VzpSS6BkTw2S3ThJXD5Q6g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29970?r=rss2",
    "title": "NationBuilder: Designer",
    "content": "<p>Full-time</p><p><strong>(New York, NY)</strong> </p><p>NationBuilder is seeking a designer to become a core contributor to the wide scope of design needs at NationBuilder, software and community for leaders.</p><p>Your responsibilities will include maintaining and elevating the NationBuilder brand, crafting delightful web experiences across our online properties, collaborating on product design, and taking a central role in the overall evolution of design at the company. This is a great opportunity to have your work seen and appreciated widely. You will report directly to the VP of Design.</p><p>The design team is based in Brooklyn, New York, but working remotely is a possibility if required.</p><p>NationBuilder offers everyone the <a href='http://nationbuilder.com/software' rel='nofollow'>technology</a> and <a href='http://nationbuilder.com/cities' rel='nofollow'>community infrastructure</a> to lead people to greatness. Our customers range from political candidates and nonprofits to corporations - anyone building a community of people to make something happen in the world. To learn more about NationBuilder, read about our <a href='http://nationbuilder.com/mission' rel='nofollow'>mission, beliefs</a> and <a href='http://nationbuilder.com/jobs' rel='nofollow'>values</a>.</p><h2>We're looking for someone who:</h2><ul><li>Has considerable experience designing and building modern websites with a polished visual design, and has a portfolio to prove it.</li><li>Has experience coding responsive webpages in HTML and CSS, and a solid understanding of frameworks like Bootstrap.</li><li>Is highly proficient with tools such as Sketch, Photoshop, and Illustrator, and has a familiarity with prototyping tools like Marvel and InVision.</li><li>Has exceptional attention to detail.</li><li>Is humble, passionate about personal growth, and would rather be &quot;better&quot; than &quot;right.&quot;</li><li>Proactively seeks out feedback and welcomes it as an opportunity to grow.</li><li>Is effective in communicating design decisions to design and non-design audiences.</li><li>Has a strong work ethic, a quick learner and is willing to work with a fast-paced team.</li></ul><p></p><p><strong>Job Perks:</strong> - Great health insurance- Yearly conference stipend- Unlimited vacation and sick days- Unlimited MTA card (if in NYC)- Work on something huge that really matters</p><p><strong>Apply:</strong> To apply, tell us why you're interested in this position in 140 characters or less. Most importantly, include links to your portfolio with examples of responsive websites you've created, and your resume by emailing jobs@nationbuilder.com with the subject Designer.</p>",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 10:25:45 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "cP9rA_FPQzW6d3r19As6ag",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/62982/product-designer-at-basement-crowd/",
    "title": "Product designer",
    "content": "Basement Crowd is a leading technology company in the legal sector with a world-class team of engineers and legal experts, creating innovation and beautiful design. We are a well-funded, rapidly growing London-based start-up with a mature strategy and a pipeline of exciting new products. Our founding team has a track record of creating, growing and exiting successful technology businesses.<br /><br />Job description:<br />You will be joining a cross-functional product and engineering team to conceptualise, design and build innovative software products for the LegalTech space. You will collaborate closely with other product designers, product managers, engineers and domain experts (mostly lawyers) to deliver excellent end-to-end product experiences.<br />While your focus will be UI design, you have a strong interest and motivation to also get involved in other areas of the product development process, and have a strong appreciation for UX. <br /><br />Key duties and responsibilities:<br />- Craft beautiful visual designs and illustrations that reflect our product branding.<br />- Create presentations for sales and marketing (e.g. pitches for client meetings).<br />- Refine UX flows and translate them into pixel-perfect high-fidelity designs.<br /><br />Other responsibilities:<br />- Take on board broad conceptual and strategic ideas, and produce user-centred solutions.<br />- Create UX flows, wireframes, UI designs and interactive prototypes.<br />- Clearly communicate internally the story of the user and how what you’re proposing will best meet their needs.<br />- Bring UX and UI best practices and skills to the company.<br /><br />Skills and requirements:<br />- 1+ years of experience in working closely with product managers, UX designers and software engineers in the creation of innovative ideas.<br />- A proven track record of creating wireframes, UI designs and interactive prototypes, with an existing portfolio to showcase.<br />- Strong skills in visual design and illustration. Excellent feel for aesthetic and clean design.<br />- Highly proficient in tools for prototyping and design, e.g. Sketch, Invision or Zeplin.<br />- An in-depth understanding of the latest design trends.<br />- Excellent communication and teamwork skills, being able to contribute in a fast-paced and collaborative startup environment.<br />- High attention to detail.<br /><br />We are an equal opportunities employer and welcome applications from all suitably qualified persons regardless of their race, sex, disability, religion/belief, sexual orientation or age.",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 9:40:19 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "Oxs8-nfNTJW6UlrEE1lP5w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Sr-UX-Designer-HTML-CSS-Paid-Relocation-to-Amsterdam-/2503667",
    "title": "Sr. UX Designer (HTML/CSS) (Paid Relocation to Amsterdam) - Booking.com - (Amsterdam, Netherlands) - FullTime",
    "content": "<li>          <a rel='nofollow'>                 Booking.com</a>              (Amsterdam, Netherlands)          </li><li>                  Fulltime Job        </li><h2>Sr. UX Designer (HTML/CSS) (Paid Relocation to Amsterdam)</h2><p>Join the world’s leading accommodation company and help define the future of travel. This position offers the successful candidate broad scope for working on a variety of products within the current and future Booking.com family, based in our headquarters in the centre of Amsterdam.</p><p>Your Skills</p><p>As a candidate for Senior Designer, you possess a broad range of abilities –</p><p>You are comfortable with each part of the design process, from research to exceptional UI design through to shipping production code<br><br>Your strengths include being self-driven, working collaboratively and solving challenging problems<br><br>You handle the responsibility of defining the design direction of a team, and coaching and mentoring other designers<br><br>You are well versed in designing for all platforms<br><br>You skillfully communicate your work to stakeholders<br><br>You work closely with your team to create exceptional features &amp; products<br><br>You understand and thrive in an environment which employs extensive A/B testing – Booking.com is a data-informed company</p><p>Your Experience</p><p>We’re looking for Designers with a minimum of 5 years of relevant experience, preferably in design and development positions. Past experience working in ecommerce, or in data-driven product development teams is a plus.</p><p>Senior Designers at Booking.com must be excellent collaborators – we work in an agile, dynamic, diverse environment in which openness &amp; humility are key. At Booking.com, design is a team sport, and together we solve hard problems while keeping the user at the center of everything we do.</p><p>Ensuring a diverse and inclusive workplace is part of our core values. We are an equal opportunity employer and know that a team of different backgrounds, abilities, and perspectives makes us thrive and build better products. We are fortunate to be members of one of the most diverse design teams in the world and we do our best work when we join forces. Come and be part of an exceptionally talented and fun team, where you’ll do challenging and rewarding work.</p><p>You will also contribute to the growth of Booking.com through interviewing, on-boarding, or other recruitment efforts.</p><p>This position is open to worldwide candidates and in the case of relocation, we will assist you with a generous relocation package, ensuring a smooth transition to working and living in Amsterdam.  We have successfully relocated 300+ Technology professionals to Amsterdam in the last year!</p><h3>How to apply</h3><a href='https://workingatbooking.com/vacancies/sr-ux-designer-htmlcss/?gh_src=3nukl71&amp;amp;utm_source=Smashing%20Magazine&amp;amp;utm_medium=Jobboard&amp;amp;utm_campaign=Senior_UX_Designer&amp;amp;utm_term=Smashing%20Magazine' rel='nofollow'>https://workingatbooking.com/vacancies/sr-ux-designer-htmlcss/?gh_src=3nukl71&amp;amp;utm_source=Smashing%20Magazine&amp;amp;utm_medium=Jobboard&amp;amp;utm_campaign=Senior_UX_Designer&amp;amp;utm_term=Smashing%20Magazine</a>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 4:26:18 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown",
      "TECH2_Design"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "Design"
    ]
  },
  {
    "id": "x7AAsIyDR1qSckci93D-XQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/UX-Designer-Team-Lead-Paid-Relocation-to-Amsterdam-/2503666",
    "title": "UX Designer & Team Lead (Paid Relocation to Amsterdam) - Booking.com - (Amsterdam, Netherlands) - FullTime",
    "content": "<li>          <a rel='nofollow'>                 Booking.com</a>              (Amsterdam, Netherlands)          </li><li>                  Fulltime Job        </li><h2>UX Designer &amp; Team Lead (Paid Relocation to Amsterdam)</h2><p>Booking.com BV (the company behind Booking.com™, the market leading online accommodation reservation service in the world) is looking for the world’s smartest designers. Join the world’s leading accommodation company and help define the future of travel. This position offers the successful candidate the freedom to make meaningful and measurable improvements, impacting millions of people. You’ll join us at our beautiful Amsterdam HQ and work with some of our industry’s smartest people.</p><p>B.responsible</p><p>As a Team Lead in the Booking.com Technology Department, you will be supporting and facilitating the work of multi-disciplinary agile product teams built up of 4-8 people. These teams are cross functional and team members will consist of varied skills, experiences and backgrounds.</p><p>You are hands on and also technically minded. You understand that behind any technical decision there is a business need to be fulfilled and are able to communicate that to your team.</p><p>You are focussed on growing and developing the people within the team and you lead by example and are passionate about the team’s performance level. Team Lead responsibilities would include:</p><p>Facilitate an Agile team (small 4-8 people)<br><br>Identify and grow talents, provide feedback and look after people’s personal development<br><br>Assess individual performance, recognize and promote excellent performance and assess underachieving performers<br><br>Focus on supporting the business priorities, be pragmatic about technology choices<br><br>Collaborate with the team and Product Owner to prioritize the projects<br><br>Contribute to Booking.com’s growth through interviewing, on-boarding or other recruitment efforts.<br><br>Along with your leadership skills, you will also have a background as a UX Designer. You’ll be a key part of the idea generation process, you’d be just as happy to be labelled an Engineer, or Analyst; a Builder, Maker or Problem Solver. Your portfolio is a collection of stories that you can discuss with enthusiasm, and regret … because you’re always getting better at what you do and you’re never satisfied with ‘good enough’. You’re excited about the endless potential of the web and being able to build things that millions of people can use every day.</p><p>B.skilled</p><p>As a candidate for the Team Lead – UX Designer position, you possess a broad range of abilities:</p><p>You are comfortable with each part of the design process, from research to exceptional UI design, through to shipping production code<br><br>You are proficient with <span>HTML</span> &amp; <span>CSS</span><br><br>You have experience with template engines to display data from the backend – you’d be implementing your work using our in-house templating engine (don’t worry – we’ll show you the ropes!)<br><br>You are comfortable creating the wireframes, polished mockups, and prototypes needed to communicate them (e.g., Sketch, Framer, InVision)<br><br>Your strengths include being self-driven and taking full ownership of your ideas to solve challenging problems<br><br>You are comfortable working collaboratively with developers, product owners, and copywriters<br><br>You thrive on feedback and critique, responding with creative thinking and iterative design<br><br>You are a passionate advocate for the user, dedicated to the craft of design and creating elegant user experiences<br><br>You understand and thrive in an environment which employs extensive A/B testing – Booking.com is a data-informed company</p><p>B.experienced</p><p>We’re looking for Team Leads with around 1-2 years’ experience in a leadership role managing teams, and also with a minimum of 4 years of relevant UX experience, ideally with some history of working in e-commerce &amp; data-informed organisations.</p><p>Designers at Booking.com must be excellent collaborators – we work in an agile, dynamic, diverse environment in which openness &amp; humility are key. Our designers combine their knowledge and expertise with the goals of our business to deliver a world-class user experience to our diverse, loyal user-base. At Booking.com, design is a team sport, and together we solve hard problems while keeping the user at the centre of everything we do.</p><p>Ensuring a diverse and inclusive workplace is part of our core values. We are an equal opportunity employer and know that a team of different backgrounds, abilities, and perspectives makes us thrive and build better products. We are fortunate to be members of one of the most diverse design teams in the world and we do our best work when we join forces. We’re looking forward to welcoming you into our team of exceptionally talented and fun colleagues, where you’ll do challenging and rewarding work.</p><p>You will also contribute to the growth of Booking.com through interviewing, on-boarding, or other recruitment effortsn(repeated?)</p><p>We are a performance-based company that offers career advancement and lucrative compensation, including bonuses and stock potential.  We also offer what we call the “Booking Deal” with other competitive perks and benefits.  IT also has regular hackathons, training and attends/speaks at global conferences.</p><p>This position is open to worldwide candidates and in the case of relocation, we will assist you with a generous relocation package, ensuring a smooth transition to working and living in Amsterdam.  We have successfully relocated 200+ IT professionals to Amsterdam in the last year!</p><h3>How to apply</h3><a href='https://workingatbooking.com/vacancies/ux-designer-team-lead/?gh_src=x6hlow1&amp;amp;utm_source=Smashing%20Magazine&amp;amp;utm_medium=Jobboard&amp;amp;utm_campaign=UX_DesignerTeam_Lead&amp;amp;utm_term=Smashing%20Magazine' rel='nofollow'>https://workingatbooking.com/vacancies/ux-designer-team-lead/?gh_src=x6hlow1&amp;amp;utm_source=Smashing%20Magazine&amp;amp;utm_medium=Jobboard&amp;amp;utm_campaign=UX_DesignerTeam_Lead&amp;amp;utm_term=Smashing%20Magazine</a>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 4:01:12 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown",
      "TECH2_Design"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "Design"
    ]
  },
  {
    "id": "2xtv1-CxQn6O5E9ZPUAKkQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29911?r=rss2",
    "title": "Fuel Made: Web Designer",
    "content": "<p>Full-time</p><p><strong>(Western North America)</strong> </p><p>A few years ago we (Fuel Made) were just a small handful of folks focused on building the very best ecommerce experiences on the web. Leading out with strong design is how we delighted our clients, and grew our agency. Our design-driven approach led to success, and opportunities we couldn’t have imagined.</p><p>Today, our clients are successful, established merchants with specialized shops and complex needs. The opportunity to service these clients is challenging and exciting.</p><p>We are seeking a web designer to join our small design team. In this position you will work with our team, and directly with our clients. You will be directing and designing the solutions we build. This is a serious responsibility, and an exciting one. Watching your hard work come to life as it progresses through the project life cycle, and then watching our customer’s delight as it impacts their bottom line is rewarding. This is why we love ecommerce.</p><p><strong>A quick summary of your responsibilities:</strong></p><p>Once a client comes on board you will work with them over several weeks on discovery, creating wireframes and user flows (both visual and written), style direction, and finally the visual design. You'll then shepherd all that design work through the development process.</p><p>This is where we’ll need your experience as a web designer capable of tackling big challenges with discipline and an understanding of what web design really means, and how thoughtful design can help clients reach their goals.</p><p><strong>Candidate must haves:</strong></p><ul><li>At least three years of, specifically, web design experience&nbsp;</li><li>Exceptional written and verbal communication skills</li><li>You need to truly love doing UX work in addition to visual design work</li><li>Comfortable and experienced with the technical aspects and constraints of working with the web. This includes an understanding of RWD, and how HTML and CSS work.</li><li>Passion for all things web and design. You are abreast of industry best practices and evolution.</li><li>Willingness to do things The Right Way (especially when it's hard)</li><li>Easy and enjoyable to work with</li></ul><p><strong>Nice to haves:</strong></p><ul><li>HTML/CSS coding proficiency</li><li>Experience with ecommerce</li><li>Photography background</li></ul><p><strong>Why you might like working for us:</strong></p><ul><li>We choose our clients carefully.</li><li>Freedom to care about your work (we're focused on quality)</li><li>Freedom to own projects from a design standpoint</li><li>Freedom to focus and get really good at what you do (we're focused 100% on ecommerce)</li><li>We work reasonable hours.</li><li>The care we have for our clients is rivaled only by the care we have for each other. We are a tight-knit, professional team who care a lot about doing world-class work together.</li></ul><p><strong>Benefits:</strong></p><ul><li>Vacation: two weeks paid vacation plus 7 paid holidays, and we also take off the week between Christmas and New Years.</li><li>Remote work: Western North America is your office.</li><li>Health care benefits.&nbsp;</li><li>Yearly retreat: Each year we all gather as a team for a week somewhere fun (and warm!) to connect, learn, and have a lot of fun together.</li><li>Tools: we'll make sure you have whatever software and hardware you need to do your job.</li></ul><p><strong>Location</strong>: We are a fully remote company, but you <span>must</span> be in North America, and located in the Pacific or Mountain time zones, available to work regular business hours every day.</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Oct 14, 2017 9:48:23 PM",
    "tags": [
      "TITLE1_designer",
      "TZ_America_West",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "US Pacific Time Zone"
    ],
    "tagsNames2": []
  },
  {
    "id": "Gf-RvQMSQR2KF2VPtWJOYQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29900?r=rss2",
    "title": "FullStack: Front-End Designer",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><p><span>FullStack has become renowned in our ability to bring creativity, expertise, and sound development practices to notable and ambitious startups and scaling organizations. Our mission is simple: to build great products that propel our clients towards success.</span><span></span></p><p><span>We're looking for someone to join our team who loves designing and developing websites and user experiences. You will have the opportunity to work alongside a close knit group of very talented engineers and product managers to build software that changes the world.</span></p><p>&nbsp;</p><p><span><span><span>At FullStack you will: </span></span></span></p><ul><li><span><span><span><span>Design custom websites and Wordpress themes</span></span></span></span></li><li><span><span><span><span><span><span>Work with Product Managers, Engineers and client stakeholders to ensure that what we're &nbsp;meets the needs of the end user</span></span></span></span></span></span></li><li><span><span><span><span><span><span><span>Effectively communicate user interaction through deliverables such as wireframes and prototypes</span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span>Wireframe and mockup user interfaces with your design application of choice or in the browser (when appropriate)</span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span>Participate as a Product Designer in creating UI/UX for web and mobile applications</span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span>Actively participate in design critiques/reviews and product discussions</span></span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span><span>Think deeply about the user experience and usability issues</span></span></span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span><span><span>You can build out your designs</span></span></span></span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span><span><span><span>QA the implementation of your designs</span></span></span></span></span></span></span></span></span></span></span></span></span></li></ul><p><span><span><span>You're qualified because:</span></span></span></p><ul><li><span><span><span><span>You’ve built custom websites before</span></span></span></span></li><li><span><span><span><span><span><span>You know how to work with Wordpress</span></span></span></span></span></span></li><li><span><span><span><span><span><span><span>Your ability to design exceptional user interfaces is second-to-none</span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span>Mobile and responsive design/development is not an afterthought</span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span>You have a burning passion for providing a great experience to users</span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span>You're proficient in handcrafting HTML and CSS (particularly HTML5 and CSS3)</span></span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span><span>You know enough JavaScript/jQuery to build out your designs</span></span></span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span><span><span>You get things done whether you're working autonomously or in a team setting</span></span></span></span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span><span><span><span>Communication skills and the ability to explain your design decisions come naturally</span></span></span></span></span></span></span></span></span></span></span></span></span></li></ul><p><span><span><span>You'll get bonus points for knowing a little something about the following:</span></span></span></p><ul><li><span><span><span><span>Version control with Git</span></span></span></span></li><li><span><span><span><span><span><span>Experience designing for iOS and Android</span></span></span></span></span></span></li><li><span><span><span><span><span><span><span>Experience with MVC frameworks such as Ruby on Rails</span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span>Familiarity with A/B testing</span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span>Ability to conduct user testing and customer interviews</span></span></span></span></span></span></span></span></span></li><li><span><span><span><span><span><span><span><span><span><span>Ability to create icons and logos in a pinch</span></span></span></span></span></span></span></span></span></span></li></ul><p><span><span><span><span><span><span><span><span>This is a contract position, but it has the potential to turn into more.</span></span></span></span></span></span></span></span></p><p><span><span><span><span><span><span><span><span>If this sounds like a party to you and you want to work alongside some incredibly talented and passionate engineers and designers, we want to hear from you! We are a distributed team and welcome the potential of working remotely. Please send us a current portfolio of design and code samples, and tell us why you want to work at FullStack. It also wouldn't hurt if you sent us links to your Dribbble and Github accounts.</span></span></span></span></span></span></span></span></p><p></p><p><strong>Job Perks:</strong> Work from anywhere in the US</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Oct 12, 2017 8:45:21 PM",
    "tags": [
      "TITLE1_designer",
      "TZ_America",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "gwmtd_6RQK-h2X4y-WxXCQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3920-ux-designer-modus-create",
    "title": "UX Designer @ Modus Create",
    "content": "<h2>              UX Designer<small> @ Modus Create</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-12 14:41</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>Hello Designer, does this sound like you?</strong> People describe you as a generalist, but you have your specialties. You could run a design project from start to finish, but you nerd out when it comes to a specific craft like visual design or ethnographic research. You also value soft skills. For you, over-communicating and project planning are essential to any project’s success. Selling your designs is second nature to you, because you design with intent. And pretty deliverables mean nothing to you unless you ship a product that moves the needle.</p><p>You design fast — keyboard shortcuts are your poor fingers’ best friends. You know when to lean on existing patterns and when to create something fresh. And you understand the difference between innovating and copying. To you, perfectionism is a dirty 13 letter word that has no place in design.</p><p>You accept that most companies follow a wonky design process, and that’s why they need your help. You believe that teaching is actually the perfect way to stay up to date on your craft. You preach that user experience is more than just what you see on the screen. The most frequent word in your vocabulary arsenal is “Why?” You’re as good at understanding problems as you are at solving them. </p><p>This is a contract role. It may be performed from a remote location. This role requires a level of effort estimated at 40 hours per week.</p><p><strong>Your Responsibilities</strong></p><ul><li>Own the end-to-end design process for your projects</li><li>Facilitate discovery sessions with clients and stakeholders to define success, requirements, and strategy</li><li>Actually interact with customers to research their tasks, pain points, and emotions </li><li>Use research to inform feature prioritization. Translate research data into digestible deliverableS</li><li>Create interaction design patterns in the form of user flows, wireframes, full color mockups, and interactive prototypes</li><li>Sell your work — tell compelling stories when presenting deliverables to customers</li><li>Be comfortable in formal design presentations and impromptu feedback meetings with clients</li></ul><p><strong>Required Experience</strong></p><ul><li>You have a portfolio showing your design process for multiple digital products across different industries</li><li>You have worked in an agile product development environment</li></ul><p><strong>Let’s Talk About Us</strong></p><p>Modus Create is a Product Studio offering consulting services and SaaS products for strategic planning, design and execution of web-based and mobile products. We work across multiple industries with Fortune 1000, ISVs, and startups to validate, plan and launch new products. Headquartered in Reston, VA, we are a bootstrapped team that has grown from 2 to 100 people in 26 countries in 6 years, committed to building the best product consulting firm on the planet. We offer a highly collaborative, autonomous and effective working environment. We love and believe in what we do. This is your chance to be part of building something great.</p><p><strong>Why Modus Create</strong></p><ul><li>Enjoy the independence to shape digital products </li><li>Never get bored. Work on different projects across different industries. Fitness, banking, corporate security, travel, real estate — you name it, we’ve been there</li><li>Build products that people will actually use. See your work in the app store, or in the hands of companies with thousands of employees</li><li>Collaborate with other bright user experience minds to shape a quickly growing user experience practice</li><li>Competitive compensation</li><li>Ability to work remotely / telecommute</li><li>Working side-by-side with thought leaders in emerging tech</li></ul><p><strong>Do you have what it takes to join the DC area's most awesome tech company? Let’s start a conversation.</strong></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>You must be willing to support most of business hours of our client located in GMT-4 / Eastern Time Zone of the United States.</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 12, 2017 5:41:11 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_America_East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East timezone"
    ],
    "tagsNames2": []
  },
  {
    "id": "1yydE2VMR1eKp6vaXJFv2g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62132",
    "title": "UX Designer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>Hello Designer, does this sound like you?</strong> People describe you as a generalist, but you have your specialties. You could run a design project from start to finish, but you nerd out when it comes to a specific craft like visual design or ethnographic research. You also value soft skills. For you, over-communicating and project planning are essential to any project’s success. Selling your designs is second nature to you, because you design with intent. And pretty deliverables mean nothing to you unless you ship a product that moves the needle.<br><br>You design fast — keyboard shortcuts are your poor fingers’ best friends. You know when to lean on existing patterns and when to create something fresh. And you understand the difference between innovating and copying. To you, perfectionism is a dirty 13 letter word that has no place in design.<br><br>You accept that most companies follow a wonky design process, and that’s why they need your help. You believe that teaching is actually the perfect way to stay up to date on your craft. You preach that user experience is more than just what you see on the screen. The most frequent word in your vocabulary arsenal is “Why?” You’re as good at understanding problems as you are at solving them. <br><br>This is a contract role. It may be performed from a remote location. This role requires a level of effort estimated at 40 hours per week.<br><br><strong>Your Responsibilities</strong><br><br></p><ul><li>Own the end-to-end design process for your projects<br></li><li>Facilitate discovery sessions with clients and stakeholders to define success, requirements, and strategy<br></li><li>Actually interact with customers to research their tasks, pain points, and emotions <br></li><li>Use research to inform feature prioritization. Translate research data into digestible deliverableS<br></li><li>Create interaction design patterns in the form of user flows, wireframes, full color mockups, and interactive prototypes<br></li><li>Sell your work — tell compelling stories when presenting deliverables to customers<br></li><li>Be comfortable in formal design presentations and impromptu feedback meetings with clients<br><br><strong>Required Experience</strong><br><br></li><li>You have a portfolio showing your design process for multiple digital products across different industries<br></li><li>You have worked in an agile product development environment<br><br><strong>Let’s Talk About Us</strong><br><br>Modus Create is a Product Studio offering consulting services and SaaS products for strategic planning, design and execution of web-based and mobile products. We work across multiple industries with Fortune 1000, ISVs, and startups to validate, plan and launch new products. Headquartered in Reston, VA, we are a bootstrapped team that has grown from 2 to 100 people in 26 countries in 6 years, committed to building the best product consulting firm on the planet. We offer a highly collaborative, autonomous and effective working environment. We love and believe in what we do. This is your chance to be part of building something great.<br><br><strong>Why Modus Create</strong><br><br></li><li>Enjoy the independence to shape digital products <br></li><li>Never get bored. Work on different projects across different industries. Fitness, banking, corporate security, travel, real estate — you name it, we’ve been there<br></li><li>Build products that people will actually use. See your work in the app store, or in the hands of companies with thousands of employees<br></li><li>Collaborate with other bright user experience minds to shape a quickly growing user experience practice<br></li><li>Competitive compensation<br></li><li>Ability to work remotely / telecommute<br></li><li>Working side-by-side with thought leaders in emerging tech<br><br><strong>Do you have what it takes to join the DC area's most awesome tech company? Let’s start a conversation.</strong></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 12, 2017 5:41:11 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "CKcufS8cREWPtI_H3FDoOw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62128",
    "title": "Product Designer, Partnerships",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>We’re looking for a Product Designer to join the Design Team at Zapier. If designing and developing delightful user experiences, collaborating with cross-functional teams, and creating user interfaces that solve users pain points interests you, keep reading!<br><br>As a Product Designer embedded on the Partnerships Team, you’ll be working directly with our Partners to create cohesive experiences for their Zapier integrations. Whether it’s designing the tools that enable our Partners to contextually embed Zapier in their Product or doing research with them to gather insights on their needs, you’ll be focused on engaging our Partners in ways that are truly meaningful to them and their unique needs with Zapier.<br><br>We're a widespread remote team of 110+ people, located in thirteen countries, that think computers should do more work. For the past six years, Zapier has been helping people across the world automate the boring and tedious parts of their job. We do that by helping everyone connect the web applications they already use and love.<br><br>We get together 2-3 times per year for a company retreat, and benefits include great healthcare, dental and vision coverage, 401k retirement plan with company match, profit sharing and 14 weeks paid leave for new parents.<br><br>To be considered for this role, please complete the application on <a href='https://goo.gl/pwVDLy' rel='nofollow'>Jobs @ Zapier</a>We're not accepting applications from agencies.</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 12, 2017 6:09:56 AM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "ZZptVOHoT-ejcNPob8LloQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62172",
    "title": "Mobile Application Design Company",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Royal Cyber is hiring a Mobile Application Design Company in Remote</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 11, 2017 9:50:11 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "TU9LsYE3RByAyJkuZ79gUA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3917-senior-product-designer-learnzillion",
    "title": "Senior Product Designer @ LearnZillion",
    "content": "<h2>              Senior Product Designer<small> @ LearnZillion</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-08 03:36</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>Location:</strong> Washington, DC or US-remote</p><p><strong>Department:</strong> Engineering &amp; Design</p><p><strong>Type:</strong> Full Time</p><p><strong>Min. Experience:</strong> Experienced</p><p>DC local or remote full-time staff position for authorized U.S. workers. No visa sponsorship available at this time, sorry.</p><p><strong>Overview</strong></p><p>Help us create the digital curriculum of the future.</p><p>Our well-funded, fast-growing education technology startup is looking for product designers to help us create essential tools for teachers, students, districts, and parents. You will play a key role in building LearnZillion’s technology platform and shaping its future. You will work closely with product designers, software engineers, product managers, academics, our co-founders, and user community to build our world-class web and mobile applications.</p><p>You should be well-versed in user experience, visual, and product design, technically skilled, focused, and creative.</p><p><strong>The Company</strong></p><p>LearnZillion is a social enterprise founded by two former teachers. We provide a learning platform that helps teachers and parents meet the educational needs of every student. We are building an online, collaborative, curricular platform with lessons, resources, assessments, and activities created by some of the country’s best teachers.</p><p>More about us and our DreamTeam teachers:</p><p><a href='https://learnzillion.com/p/company/' rel='nofollow'>https://learnzillion.com/p/company/</a></p><p><a href='https://learnzillion.com/p/community/' rel='nofollow'>https://learnzillion.com/p/community/</a></p><p>LearnZillion is funded through the Bill &amp; Melinda Gates Foundation, NewSchools Venture Fund, O’Reilly AlphaTech Ventures, Learn Capital, Owl Ventures, and others. More than 1M teachers and millions of students in the U.S. use LearnZillion.</p><p>Some of our mentions:</p><p><a href='http://www.fastcompany.com/3026328/most-innovative-companies-2014/the-worlds-top-10-most-innovative-companies-in-education' rel='nofollow'>http://www.fastcompany.com/3026328/most-innovative-companies-2014/the-worlds-top-10-most-innovative-companies-in-education</a></p><p><a href='http://schoolsofthought.blogs.cnn.com/2012/06/27/the-evolving-classroom-lessons-go-virtual/' rel='nofollow'>http://schoolsofthought.blogs.cnn.com/2012/06/27/the-evolving-classroom-lessons-go-virtual/</a></p><p><a href='https://www.facebook.com/BillGates/posts/144029255754260' rel='nofollow'>https://www.facebook.com/BillGates/posts/144029255754260</a></p><p><a href='http://www.thegatesnotes.com/Topics/Education/Why-Im-Excited-about-the-Arrival-of-Back-to-School-Season' rel='nofollow'>http://www.thegatesnotes.com/Topics/Education/Why-Im-Excited-about-the-Arrival-of-Back-to-School-Season</a></p><p><a href='http://www.marketplace.org/topics/life/education/learnzillion-does-number-classrooms' rel='nofollow'>http://www.marketplace.org/topics/life/education/learnzillion-does-number-classrooms</a></p><p><strong>Our Team</strong></p><p>The Engineering &amp; Design team excels at building product that delights users and solves complex problems simply. We ship product daily, value iteration over big upfront design, pay attention to the details, and help each other improve.</p><p>Our team is made up of experienced and newer SaaS product builders. We not only impact LearnZillion but regularly provide thought leadership and design contribution to the third parties we rely on, including many big name tech companies.</p><p><strong>Our Design Tool Stack</strong></p><ul><li>Adobe Creative Suite</li><li>HTML and CSS (Ruby on Rails 4 with HAML and SASS+Compass)</li><li>Marvel</li><li>FullStory</li></ul><p><strong>Key Responsibilities</strong></p><ul><li>Collaborate with coworkers and users to uncover product needs</li><li>Design research, wireframe, sketch, whiteboard, prototype, design, and build user experiences</li><li>Design and develop simple, easy-to-use, user interfaces to add impactful new features</li><li>Front-end development of features in HTML, CSS, and a smidgen of JavaScript. Engineers are always ready to help.</li></ul><p><strong>Qualifications</strong></p><ul><li>3+ years of web application product design. Mobile application product design a plus.</li><li>Strong visual and interactive design skills, as demonstrated by a portfolio of your prior work and the resulting implementations--whether you wrote the HTML and CSS or someone else did</li><li>Intrinsically-motivated individual who loves to get things done</li><li>Portfolio or collection of screenshots of past projects for us to review</li><li>Desire and aptitude to learn and build product with HTML and CSS</li></ul><p><strong>Benefits</strong></p><ul><li>Competitive salary and paid time off</li><li>4% 401(k) contribution matching</li><li>Remote-work friendly schedule</li><li>Work daily with top-notch product design and engineering team members</li><li>Make the digital curriculum of the future a reality for students everywhere</li><li>LearnZillion is an equal opportunity employer.</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>United States</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 8, 2017 6:35:42 AM",
    "tags": [
      "TITLE1_designer",
      "TZ_America",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "XmuIvrklQYaFDg1yQQIRMQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/61888/digital-designer-at-drover/",
    "title": "Digital Designer",
    "content": "Drover is the mobility-as-a-service platform for everyone who wants a car for longer than just getting from A to B: find the car you want, keep it for as long as you want, swap or cancel anytime. In short: the Netflix for cars.<br /><br />Drover achieves this through a two-sided rental marketplace model, connecting professional fleet owners with individual hirers, run on a superb website, a SaaS-based fleet management interface and a mobile app. Our vision is to provide a better alternative to car financing and traditional car ownership and change how people access cars today.<br /><br />Drover was founded by a team of serial technology entrepreneurs in Jan-16, has handled over 10,000 vehicle bookings since and has been serially backed by world-class investors including Partech Ventures, Version One, Forward Partners and BP Ventures. If you want to make a difference, and you’re passionate about tech & mobility, come on board and join the ride.<br /><br />With several new product launches coming up and a full rebrand in the making, there has never been a more exciting time to join us as a Digital Designer. In this role, you will in partnership with our existing product designer on all aspects of digital design, focusing primarily on composing highly creative visual experiences. In particular, you will:<br /><br />Deliver creative digital (90%) and print (10%) assets that wow our customers in terms of aesthetics and ease of use<br />Ensure consistent design across the entire platform<br />Understand the needs of our business and our customers and translate these to our product<br />Work closely with our UX/UI-focused designer as well as software development team in implementing new product design and features<br />Work with our development team, collecting and monitoring metrics to guide product focus and decisions<br /><br />Requirements: <br />A naturally creative design professional with an extensive portfolio of beautiful digital assets to show off<br />2+ years of experience delivering easy-to-use and visually impressive web and mobile apps, ideally at a high-growth B2C tech startup<br />Versatility and breadth of design skills: a digital designer who won’t shy away from print media<br />Excellent attention to detail, highly organised and a multi-tasker<br />A versatile designer ready for a diverse and flexible role<br />Entrepreneurial working style, comfortable with constantly changing priorities<br />Excellent organisational skills and experience<br />Nice to have’s<br /><br />Ability to prototype designs in HTML/CSS<br />Knowledge of HTML5, CSS3<br />Knowledge of responsive layout (Bootstrap Framework) across Desktop, Tablet and Mobile<br />Good understanding of cross-browser compatibility issues and the best solutions for resolving them<br /><br />Benefits: <br />Become one of the key employees of a fast-growing, exciting startup changing the mobility and automotive landscape<br />The opportunity to work with a world-class team that includes serial entrepreneurs and alumni from some of the world’s best schools (Oxbridge, LSE, WHU) and most exciting companies (Google, Uber, Lyft, Gett, WeWork, EY, Goldman Sachs)<br />A competitive salary<br />Top-notch kit - we'll get you a shiny new Macbook<br />Tech and food events with the team<br />Work in an awesome startup office with a ping-pong table, an Oculus Rift and a sleek roof deck<br />Free team lunch on Fridays<br />Monthly socials, biannual trips to European capitals to celebrate milestones (Budapest down, Lisbon coming up…)<br />Perkbox: free phone insurance, cinema discounts, hundreds of retailer discounts<br />",
    "urlFetchPending": false,
    "published": "Sep 25, 2017 5:17:41 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "BIE1ZEC6Q0Sx9ypPufoMzw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "smashingmagazine.com-programming",
    "url": "http://jobs.smashingmagazine.com/j/Probably-the-Best-Front-End-Developer-Job-in-the-World/2503597",
    "title": "Probably the Best Front-End Developer Job in the World - The Interaction Design Foundation - (Anywhere) - FullTime",
    "content": "<li>          <a rel='nofollow'>                 The Interaction Design Foundation</a>              (Anywhere)          </li><li>                  Fulltime Job        </li><h2>Probably the Best Front-End Developer Job in the World</h2><h3><span>IDF</span> seeks a Senior Front-End Developer to shape the future of design education</h3><p>The&nbsp;Interaction Design&nbsp;Foundation is the world’s most prestigious community and course platform for user experience designers. We are a nonprofit organization with a mission to reduce the cost of&nbsp;design education&nbsp;around the world, and we do so by providing high-quality online UX design courses at an affordable membership fee. With tens of thousands of members learning from our courses, and hundreds of thousands reading our free educational materials, we’re one of the largest UX design communities around the world.</p><p>We’ve spent the last 15 years building our community, and the last year rebuilding our course platform—based on a brilliant technology stack. And now we want&nbsp;you&nbsp;to help us build pure awesomeness in versions 7, 8, 9, etc.! If you’re a senior front-end developer with sublime programming skills acquired from 5+ years of experience, we’d like to work with you.</p><p>This is a paid&nbsp;full-time&nbsp;position. You’ll be&nbsp;location independent&nbsp;and will therefore be free to work from wherever you want in the world. You will have regular video-based contact with your colleagues and will get to meet them physically on team trips (see below).</p><h3>Why you’ll want to join us:</h3><ul><li>You get to work in an international team where we truly and deeply care about great architecture, great code, great documentation, great tests, etc.</li>    <li>We love our codebase and that’s why we have zero tolerance for spaghetti code and <a href='https://martinfowler.com/bliki/TechnicalDebt.html' rel='nofollow'>technical debt</a>. Code should be so well-crafted that you want to kiss the screen. </li>    <li>You will have uninterrupted concentration time every day to build pure front-end awesomeness and thus accelerate your learning curve. If you were to work at Facebook or Google, you would be <a href='https://qz.com/806583/programmers-hate-open-floor-plans/' rel='nofollow'>constantly interrupted</a> and only have 2 hours of uninterrupted “flow time” per day. That creates a <a href='https://blog.ninlabs.com/2013/01/programmer-interrupted/' rel='nofollow'>slow learning curve</a>. Working with us, you get a full 7 hours per day. Imagine what that will do to your mental muscles, to your learning and to your career.</li>    <li>You will help shape the future of design education which millions of people can benefit from.</li>    <li>You will work with the best developers and designers in the world. And learn from them.</li>    <li>You will have the ability to work from anywhere — as long as your internet connection allows you to have video-based contact with your colleagues every day.</li>    <li>You get to work with true perfectionists! The development team is a small, senior, and highly-powered team of 7 people: 4 developers, a visual/UX designer, a software tester/QA, and a product owner. They also get input/help from an additional 4 people – as well as from our community of tens of thousands of designers and front-enders who love to provide feedback. You can learn enormous amounts. </li>    <li>You get to meet up with the rest of the team several times a year at interesting destinations like a scenic Thai island, Dubai, Denmark, or the like. See <a href='https://www.interaction-design.org/careers/' rel='nofollow'>the video about our company culture</a> for more.</li>    <li>We have a focus on evergreen programming techniques and best practices, as opposed to the latest hyped framework. We’d rather hand-craft things ourselves than build our platform on a gazillion 3<sup>rd</sup> party libraries. Just ask Facebook: <a href='https://qz.com/646467/how-one-programmer-broke-the-internet-by-deleting-a-tiny-piece-of-code/' rel='nofollow'>they know it sucks</a>. </li>    <li>Our <span>CEO</span> is a programmer and you will therefore not have to worry about “management speak” in order to get your point across. Just let your awesome code “speak for itself” and you will earn respect immediately!</li></ul><h3>What you will be doing:</h3><ul><li>You will take ownership and leadership of an ever-growing front end codebase where elegance and simplicity must be maintained and furthered – and where the evil forces <a href='https://en.wikipedia.org/wiki/Software_entropy' rel='nofollow'>entropy</a>, <a href='https://en.wikipedia.org/wiki/Software_bloat' rel='nofollow'>bloat</a>, and spaghetti must be fought back by your intellect and coding skills.</li>    <li>Helping us to build an online course that will teach millions of designers how to become front-end developers. This will hugely improve your skills and ability to communicate – and will prove to be an awesome challenge!</li>    <li>Helping us to build an online course for our members on the topic of Design Systems – bringing Front End Development together with UI/UX Design.</li>    <li>Creating animations that are not only beautiful, but meaningful and are features that add to the UX of our users.</li>    <li>Building upon our current front end style guide and coding guides, which let our back end developers use front end components with ease. You will build a “design system” that is extremely detailed yet also easy to navigate and use…. much like <a href='https://polaris.shopify.com/' rel='nofollow'>https://polaris.shopify.com/</a></li></ul><h3>About you:</h3><ul><li>You love to learn and push your skills to new levels.</li>    <li>You have 5+ years of experience working professionally with OO + <span>MVC</span> (preferably web technologies).</li>    <li>You have an understanding of basic programming patterns and principles as well as a strong sense of good engineering and architecture.</li>    <li>You want to help us take our educational platform to the next level with front-end awesomeness: Animations, interactivity, social features, data-driven design, a better mobile version, “little big details”, and much more.</li>    <li>You want to help build a rock-solid and perfectly architected and documented front-end codebase.</li>    <li>You are truly ambitious, result-oriented, friendly, and you like to continually improve.</li>    <li>You are self-motivated and love to see tangible results.</li>    <li>You speak and write acceptable English – not perfect English, just acceptable – since you will be working with people from Turkey, England, Denmark, Russia and Brazil, among others.</li>    <li>It’s a plus if you have an experience with Typescript/Flow, any JS framework, and/or <a href='https://developers.google.com/web/progressive-web-apps/' rel='nofollow'><span>PWA</span></a>.</li>    <li>It’s a big plus if you have contributed to open source.</li>    <li>It’s a big plus if you have worked professionally with at least one statically typed programming language like C, C++, Java, etc.</li></ul><h3>About the technology stack:</h3><p>We believe we have an awesome technology stack and a great (and agile) development process to back that up (Scrum). You don’t have to be an expert in all of these things. The most important things are your programming skills and extensive experience from other projects.</p><p>The technology stack is currently:</p><ul><li>Modern JS stack: ES6, Babel, JS modules, module bundling.</li>    <li><a href='http://getbem.com/introduction/' rel='nofollow'><span>BEM</span></a>/<span>ITCSS</span> as our <span>CSS</span> methodology for modular, reusable, and very well structured code.</li>    <li>We support only modern browsers (IE11+).</li>    <li>A clean separation between front-end and back-end code.</li>    <li><span>PHP</span> 7.1 where we use all the newest language features like type declarations.</li>    <li>A framework which has an incredible community support. The name of the framework is not important since we are technology agnostic.</li>    <li>MySQL 5.7 configured for the highest performance; Redis for our caching needs.</li>    <li>One of the best content delivery networks with tons of delivery points all over the world for lightning fast pages.</li>    <li>Nginx with HTTP2 enabled – and thus the ability to architect your JS code more flexibly because of the architecture of the HTTP2 protocol</li>    <li>Git and <a href='https://github.com/' rel='nofollow'>GitHub</a> using <a href='https://datasift.github.io/gitflow/IntroducingGitFlow.html' rel='nofollow'>gitflow</a>.</li>    <li><a href='https://www.vagrantup.com/' rel='nofollow'>Vagrant</a> (with <a href='https://www.virtualbox.org/' rel='nofollow'>VirtualBox</a>) and seamless CI and deployment infrastructure.</li>    <li>…and well… lots more!</li></ul><h3>Want to join our team? Here is how!</h3><p>Please send an email to Rikke Friis Dam at <a href='mailto:rikke.friis.dam@interaction-design.org' rel='nofollow'>rikke.friis.dam@interaction-design.org</a> with the following:</p><ul><li>Screener question: Please tell us why you want to put your heart, mind and hard work into this job. </li>    <li>Screener question: Tell us the 3 productivity tips/methods that work best for you.</li>    <li>A personal job application</li></ul><p>Apply as soon as you can – we’re firm believers of “the sooner, the better”. We’re looking forward to working with you!</p><h3>How to apply</h3>",
    "urlFetchPending": false,
    "published": "Aug 17, 2017 4:29:44 PM",
    "tags": [
      "TITLE1_designer",
      "TECH2_Programming",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "Programming"
    ]
  },
  {
    "id": "eCshGDqwRgWSq4nHrgi8zg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "smashingmagazine.com-programming",
    "url": "http://jobs.smashingmagazine.com/j/Front-end-WordPress-Developer-Designer/2503595",
    "title": "Front-end & WordPress Developer/Designer - Design Rangers - (Colorado Springs, CO) - FullTime",
    "content": "<li>          <a rel='nofollow'>                 Design Rangers</a>              (Colorado Springs, CO)          </li><li>                  Fulltime Job        </li><h2>Front-end &amp; WordPress Developer/Designer</h2><h3><span>COMPANY</span> &amp; <span>CULTURE</span></h3><h3><span>STEWARDS</span> OF <span>OUR</span> CLIENTS’ <span>BRANDS</span>.</h3><p><strong>We help clients discover and tell their stories. We need your help to do it.<br><br></strong>Our clients trust us to take care of them – and their brand – especially when crafting their digital experiences. We believe the combination of curiosity, design, writing, development and a little bit of adventure can create something more than just a website. Our holistic approach allows us to put goals before technology and meaning before jargon.</p><p>The Design Rangers are a small, 4-person design and marketing strategy firm based in sunny Colorado Springs, Colorado, where we play (almost) as hard as we work. We’re celebrating our 10th anniversary this year and proud of our humble basement beginnings.</p><h3><span>WHO</span> IS <span>THE</span> <span>IDEAL</span> <span>DEV</span> <span>RANGER</span>?</h3><ul><li>Someone who sees code as art. Art that when combined with strategy, design and content, becomes a masterpiece.</li><li>A designer-turned developer or a developer with an <span>HUGE</span> appreciation for good design</li><li>A willing collaborator who wants to work with a team to make the best experiences possible</li><li>A life-long student</li><li>Someone who likes to laugh and have fun</li></ul><h3><span>THE</span> <span>RANGER</span> <span>CAMP</span> (<span>OUR</span> <span>CULTURE</span>):</h3><ul><li><strong>Fun and lively –</strong>&nbsp;Our Slack channel makes full use of Giphy. We like to talk, joke, have fun and eat tacos (even on a Monday.)</li><li><strong>Storytellers –</strong>&nbsp;We believe every client has a story that will connect them to their audience, and we love discovering it.</li><li><strong>Collaborators –</strong>&nbsp;We think together is better.</li><li><strong>Contributors –</strong>&nbsp;Free marketing workshops for nonprofits, sharing lessons learned with our competitors, connecting with our community. We want to be part of the conversation.</li><li><strong>Outdoorsy –</strong>&nbsp;This is Colorado after all. Several of our clients are based in the outdoor/recreation industry and we’re out in it whenever possible.</li><li><strong>We work with nice people –</strong> Because life’s too short to work with jerks.</li><li><strong>Cause related –</strong>&nbsp;Nonprofits love us and we love them.</li><li><strong>Honest –</strong>&nbsp;We are Rangers, and open and honest communication is part of our <span>DNA</span>.</li></ul><h3><span>OUR</span> <span>DESIGN</span>/<span>DEV</span> <span>PHILOSOPHY</span>:</h3><p>We’ve been watching industry leaders and adding our own Ranger insights to the mix, using atomic design principles and new deliverables like element collages to forge a new path. Don’t know what those things are? You should be looking them up. Currently we’re using tools like Sketch, InVision, WordPress, the X Theme/Pro/Cornerstone framework along with hand-crafted design, code and content to get the job done.</p><h3><span>SKILLS</span> TO <span>PAY</span> <span>THE</span> <span>BILLS</span>:</h3><h3><span>REQUIRED</span>:</h3><ul><li><strong>Front-end development –</strong> You know, the crafting of <span>HTML</span>, <span>CSS</span> &amp; JS into art like we talked about earlier. Oh, and it’s 2017 for goodness sakes, <span>EVERYTHING</span> has to be responsive.</li><li><strong>Wordpress development –</strong> You don’t need to be a <span>PHP</span> genius, but you do need to understand how basic hooks, actions, logic and structure work. Things like:<ul><li>WordPress best practices</li><li>Theme development, child themes and template creation</li><li>Working with the WP Codex</li><li>Working with existing frameworks and plugins</li><li>Creating basic extensions and/or plugins</li><li>Creating intuitive, user-friendly experiences, even in the back-end</li></ul></li><li><strong>Flexible approach to design and development –</strong> Everyone has their own way of doing things. We need someone who is always willing to experiment and change workflows when and if it makes sense.</li><li><strong>Tenacity –</strong> Dev can be frustrating, trust me, we know. But we need someone who won’t give up. Someone who curses the existence of IE but finds the solution and rises triumphantly nonetheless. #winning</li><li><strong>Detail-oriented –</strong> Sorry, 19px Arial is not close enough to 1.25rem Proxima Nova. You’ll need to be a stickler for all the little details. We all do.</li><li><strong>Thinks beyond the brackets –</strong> Your key skill is code. Our key differentiator is creating great experiences. Creating them requires thinking about the entire solution, not just one piece of it.</li><li><strong>Able to take and give feedback –</strong> Your opinion matters. So does ours. Let’s make great things together!</li></ul><h3><span>IMPORTANT</span>:</h3><ul><li><strong>OK with frameworks and <b>gasp</b> even plugins –</strong> Yes, we said the “P” word. We know custom code is always cleaner and faster. Yes, we know frameworks can add additional overhead. We also know that they can jump-start great solutions instead of re-inventing the wheel.</li><li><strong>Basic design principles –</strong> You don’t need to be a designer, but you should be able to see that <a href='https://stripe.com/' rel='nofollow'>Stripe’s website</a> looks a lot better than <a href='http://electrifyingtimes.com/' rel='nofollow'>Electrifying Times</a>.</li><li><strong>A student of life –</strong> We learn something new every day. So should you.</li><li><strong>Problem-solver –</strong> Our clients have challenges. Help us solve them.</li><li><strong>Communication skills –</strong> Be clear. Be concise. And above all else, be human. Bonus points if you can make us laugh.</li><li><strong>Tasks both big and small –</strong> Sometimes we’re creating a site that brings a client to tears. Sometimes plugins need updated. You’ll be responsible for these things and everything in-between.</li></ul><h3><span>NICE</span> TO <span>HAVE</span>:</h3><ul><li><span>PHP</span> skills</li><li>Full-stack skills</li><li>Familiarity with Agile design&nbsp;principles</li><li>Familiarity with Atomic design principles</li><li>Familiarity with <span>GIT</span> versioning</li><li>Web and/or print design skills</li><li>Loves to create a good process</li><li>Up on modern standards/techniques</li><li>Familiar with Sketch, Adobe and InVision products</li><li>UX experience</li><li>Theme and/or plugin development</li></ul><h3><span>THE</span> <span>JOB</span>:</h3><h3><span>WHAT</span> YOU’LL BE <span>DOING</span>:</h3><ul><li><strong>Crafting code –</strong> Creating digital experiences that foster an environment of success for everyone involved:<ul><li>The end user</li><li>The content managers</li><li>The stakeholder</li></ul></li><li><strong>Websites –</strong> Creating websites, from single-page campaign support to full-blown corporate basecamps.</li><li><strong>Design systems –</strong> Creating pattern libraries of design and code that can act as Lego blocks for a brand.</li><li><strong>Surprise-and-delight –</strong> Micro-interactions and small additions that make a big difference.</li><li><strong>Processes –</strong> Building and documenting Ranger-approved ways of working that can be re-used and enhanced over time</li><li><strong>Web maintenance, updates and refinements –</strong> The little stuff that’s critical to keep a site running smoothly.</li><li><strong>Extending and refining existing client sites –</strong> &nbsp;Based on data, behavior and business needs.</li><li><strong>Determining the best dev solutions – </strong>Using a holistic approach that considers the entire experience and all audiences including content managers.</li><li><strong>Support –</strong> Respond to and take action on support tickets and on-going web refinements for clients.</li><li><strong>Keep the Ranger site looking tip-top –</strong> because it tends to get neglected. Like hasn’t been updated in 2+ years neglected.</li><li><strong>Contributing –</strong> to our on-going discussion of how design and dev can help get to the essence of the client’s story.</li></ul><h3><span>SPECIFICS</span>:</h3><ul><li>Full-time preferred, part-time with secured hours considered.</li><li>In-office working arrangement preferred but open to a remote working situation.</li><li>We’ll require finalists to take a sample design and dev it. Paid of course, but you can’t BS your way through it.</li><li>We’ll want to know a lot about who you are and if you’re a fit.</li><li>Sell us! Write something interesting that lets me know who you are and what you can bring to the table.</li><li>Tell us the most interesting development problem you’ve solved.</li><li>Show us how you’ve used WordPress in interesting ways.</li><li><span>MUST</span> show completed websites and/or products you’ve worked on.</li><li><span>MUST</span> provide code examples via said websites and/or GitHub, CodePen, etc.</li><li>Salary requirements.</li></ul><h3><span>BENEFITS</span>:</h3><ul><li>Competitive salary</li><li>Health benefits</li><li>Generous paid vacation time</li><li>Beer tap and top-tier coffee just steps away</li><li>Environment where you can participate and make a difference</li><li>Collaborative workspace surrounded by architects, designers and fine artists</li><li>S’mores</li></ul><h3>How to apply</h3><a href='http://designrangers.com/contact/employment' rel='nofollow'>http://designrangers.com/contact/employment</a>",
    "urlFetchPending": false,
    "published": "Aug 16, 2017 12:40:30 AM",
    "tags": [
      "TITLE1_designer",
      "TECH2_Programming",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "Programming"
    ]
  },
  {
    "id": "QeTh-phzSAqhWxoX3QhCwQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "smashingmagazine.com-design",
    "url": "http://jobs.smashingmagazine.com/j/Senior-Product-Designer/2503457",
    "title": "Senior Product Designer - Decisiv - (Virginia) - FullTime",
    "content": "<li>          <a rel='nofollow'>                 Decisiv</a>              (Virginia)          </li><li>                  Fulltime Job        </li><h2>Senior Product Designer</h2><p>Decisiv</p><p><span>YOE</span>: 3-6</p><p><span>JOB</span> <span>DESCRIPTION</span></p><p>Decisiv is looking for a Senior Product Designer with deep proficiency in creating user-focused interfaces with an Agile development team. Your work will be critical to the success of our product and as such is highly valued by the organization–particularly now, as we embark on a massive user interface update. You should be passionate about the user experience, with a track record of success with UX research and implementations that benefit the end user.</p><p>Decisiv is a rapidly-growing industry leader in the asset management and service supply chain marketplace. Our size means you’ll have major opportunities to expand your skill-set and contribute in a big way to the future of our product. Accordingly, our Design team is a group of self-starters, eager to produce quickly and solve big problems for our customers. We’re agile, flexible, and autonomous, working remotely via Slack, GitHub, Jira, Confluence, and Zoom.</p><p>Your career growth and development is top-of-mind for us. You’ll learn a lot here, and you’ll succeed as well. And while we will expect a lot from you, we also value your life outside of work; recharging is important, and we strive to offer an environment that reflects that.</p><p>The Senior Product Designer will report directly to the Senior Director of User Experience &amp; Design.</p><p><span>KEY</span> <span>RESPONSIBILITIES</span></p><p>Demonstrate ownership and lead product design for a specific portion of our product, applying a combination of direction and styles approved by the Senior Director and a deep understanding and empathy for the core persona<br><br>Mentor more junior designers within the organization, and encourage consistency and growth in the designs of the larger design team<br><br>Collaborate with other designers, developers, and product management team members to determine opportunities to improve the product<br><br>Design wireframes, user stories, user journeys, mockups, and click-through prototypes to communicate design solutions to engineering teams, internal stakeholders, and end users<br><br>Advocate for the user’s total experience across all touch points; from the corporate website to the end users’ impression of the product itself<br><br>Keep up-to-date about new and successful user experience techniques, share your knowledge on the latest trends and interaction patterns, and evangelize design-oriented thinking throughout the Decisiv organization <br><br>Apply user research methods for identifying problems in the user’s journey, determine the best resolution, and aid in the design and execution of usability tests<br><br>Contribute to the design of other collateral in support of the product, including our corporate website, white papers, template files, trade show elements, and more</p><p><span>DESIRED</span> <span>SKILLS</span> &amp; <span>EXPERIENCE</span></p><p>Completed studies in the field of Human Factors, Human-Computer Interaction, Psychology, Information Design, Interaction Design, Media Design, User Experience or similar programs, or equivalent work experience designing successful digital user-experiences<br><br>3-6 years of work experience doing UX and/or product design<br><br>Understanding of how to apply various user research methods to help define user needs and goals<br><br>Detail-oriented design and communication; the tiny details make a major impact<br><br>Experience designing wireframes and mockups using standard tools such as Illustrator, Sketch, and Balsamiq (or equivalent) to demonstrate design solutions that impact the user throughout their interaction lifecycle<br><br>Experience with and desire to lead teams of designers<br><br>Experience with mobile design patterns gets you some big thumbs up<br><br>Skill with developing light-weight click-preview prototypes with <span>HTML</span>/<span>CSS</span> is a plus<br><br>Interest and skill in developing data visualizations is also a bonus<br><br>Ability to prioritize and manage multiple design projects, strong organizational and time-management skills<br><br>People most qualified for this role will be:<br><br>Curious – about the latest UX trends and interaction patterns<br><br>Driven – to improve interactions across all user touch-points, from the beginning of their journey to the end<br><br>Smart – learn our systems and our industry quickly<br><br>Hard working – we are growing, and we’ve got a lot to accomplish<br><br>Outgoing – we have a rapidly growing, global team, and you’ll be interacting with a lot of different people within the organization, so building relationships that allow you to work productively with those teammates is key<br><br>Collaborative – we work as a team, and are firm believers that the best solutions are a team effort<br><br>Organized – like we said, there’s a lot going on, so it’s important that your work is easily accessible, shareable, and streamlined</p><p><span>PORTFOLIO</span></p><p>Show us what you’ve got! We want to see your design experience, whether it’s a full-fledged portfolio, sketches, wireframes, prototypes, personas and research, or all of the above. Please send a resume and relevant work samples to careers@decisiv.com.</p><h3>How to apply</h3>",
    "urlFetchPending": false,
    "published": "Jul 25, 2017 5:42:58 PM",
    "tags": [
      "TITLE1_designer",
      "REMOTE1_100",
      "TZ_unknown",
      "TECH2_Design"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "Design"
    ]
  }
]
}
