{
 "items": [
  {
    "id": "5Gu_UXCcQn21F5Yg-eB56Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Robotic+Process+Automation+Architect&c=Calibro&l=Remote&jk=07b55c51af8530c4&rtk=1c0ui19jd0k4h1g4&from=rss",
    "title": "Robotics Process Automation Architect(Remote role, US Citizens/GC holders) - Calibro Corp - Remote",
    "content": "<div><b>Robotics Process Automation Architect(Remote role, US Citizens/GC holders)</b><br><span>Calibro Corp</span>     -<span>Remote</span>    <div>        <span>Contract</span>        </div></div><span><p><b>Job Summary</b></p><p><b>There is an urgent Robotics Automation Architect position (Remote role). This will be a Skype interview followed by an offer</b></p><p><b>Job Description: </b></p><p><b>POSITION SUMMARY</b> :</p><p>Client is looking for a talented thought leader with experience in having delivered Robotic Process Automation (RPA) solutions leveraging industry-leading RPA vendor technologies such as UiPath, BluePrism, and Automation Anywhere. Client is in the process of embarking on its Intelligent Automation (IA) journey and this individual will play a key role in formulating its strategy and execution.</p><p><b>ESSENTIAL DUTIES &amp; RESPONSIBILITIES: </b></p><ul><li>Perform the role of a thought leader and technical lead to help guide the design and implementation of automation solutions using industry-standard RPA solutions.</li><li>Analyze business processes and identify automation opportunities and assess automation feasibility.</li><li>Help facilitate sessions with business users to elicit use cases for automation; act as a thought leader in helping prioritize and document them in a formal technical design documents.</li><li>Develop AS-IS and TO-BE process flows.</li><li>Design robotic process automation architecture and logic using industry best practices to deliver solutions that are efficient, well-structured, &amp; maintainable.</li><li>Deliver and demonstrate effective proof-of-concept solutions to demonstrate RPA.</li><li>Create and maintain solution documentation.</li><li>Play a key role in helping create an Intelligent Automation Center of Excellence (CoE).</li><li>Problem-solve issues that arise in day-to-day running of RPA processes and providing timely responses and solutions as required.</li><li>Contribute to the development of governance, methodologies, and procedures to continually improve a rapid and repeatable delivery channel for Automaton Delivery Team.</li><li>Create and document test procedures and scenarios for the pre-UAT phases.</li><li>Support the Operational Teams during the UAT and rollout phases.</li><li>Participate in the development of robotic operating model (ROM) for long-term maintenance, support, and hand-off to the delivery organization.</li><li>Identify &amp; assist in initial setting up and support of an RPA development infrastructure to support process automation across the enterprise.</li><li>Lead hands-on and non-hands-on training sessions in the use of RPA tools and best practices for using RPA tools to deliver robotic solutions.</li></ul><p><b>QUALIFICATIONS: </b></p><ul><li>3+ years of thought leadership and execution experience in both Business process automation &amp; Robotic process automation</li><li>7+ years of strong experience in delivery of end-to-end software projects using cutting-edge technologies</li><li>Developer certifications in Ui Path, BluePrism, or Automation Anywhere <b><i>preferred</i></b> (we have not decided on a particular tool as yet and this person may play a role in its selection)</li><li>Experience with configuring Optical Character Recognition (OCR) technologies and integrating to RPA and other process automation technologies</li><li>Experience with leveraging machine learning models and how to train them <b><i>a plus</i></b></li><li>Experience with some or all of the following programming languages &amp; technologies is <b><i>preferred</i></b> :</li><li>Microsoft Technologies (VB .NET, Windows, Internet Explorer, SQL Server, Web Services)</li><li>Application integration using Web Services/RESTFUL API access, integration bus (ex: Tibco, Biztalk, etc.)</li><li>Scripting languages (ex. python, perl, etc.)</li><li>Programming languages such as Java, C#, HTML, etc.</li></ul><p>Job Type: Contract</p><p>Required experience:</p><ul><li>SDLC: 9 years</li><li>Business process automation: 6 years</li><li>Big 4 consulting exp.: 2 years</li><li>Robotics automation: 4 years</li></ul></span>",
    "urlFetchPending": false,
    "published": "Dec 8, 2017 7:53:27 PM",
    "tags": [
      "REMOTE1_100",
      "TZ_unknown",
      "TITLE1_integration"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "fzF3OsQUT16uO17U3srElg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157284/php-back-end-developer-integrations-specialist-time-doctor?a=QKnZanLVRwA",
    "title": "PHP Back-end Developer - Integrations Specialist - 100% Remote at Time Doctor () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>This is a 100% remote position. We prefer to hire people from Europe and Asia because of team collaboration, all of our current dev team is in Asia or Europe and so it is unlikely (although not impossible) that we will hire in north or south america.</p><p>You will be working from home with mostly flexible hours although you will need to attend the team meeting which is at approximately 8:30am GMT and to work for 3 hours after this time for team collaboration (This is 3:30am to 6:30am New York time, so you can see that’s the reason we are not likely to hire in north, central or south america).</p><p><strong><strong>WHAT YOU WILL BE RESPONSIBLE FOR</strong></strong></p><p>You will be working in a team of around 10 other developers. You primary areas of work will be:</p><ol><li>Building and maintaining external integrations with partners through different communication protocols - REST / SOAP etc …</li><li>Integrations with Zapier</li><li>Working on queue management back-end solutions helping these integrations to operate properly</li><li>Working on developing back-end modules / services part of the whole product infrastructure</li><li>Working with databases with millions of records and hundreds of thousands of requests per day.</li><li>You are going to get involved into continuous integration processes, different branching models for version control and strict coding standards.</li><li>Work on highly scalable cloud infrastructure including multiple instances connected by load balancers for traffic distribution</li></ol><p><strong>TO BE A BEST FIT FOR THIS JOB YOU NEED TO:</strong></p><ul><li>be an expert in PHP at least 5+ years. Expert means that you have solid experience in building web based applications with high level of abstraction</li><li>be an expert in External API Integrations and have a quick understanding how an integration can be done - REST / SOAP</li><li>have a good experience in MVC frameworks</li><li>have a good experience with Symfony Framework</li><li>have a good experience of building DDD oriented architecture</li><li>have a solid experience in code optimization and performance improvements</li><li>know how the core of MySQL is working, make decisions about the storage engines, database structure and scalability of the database</li><li>know how to optimize database performance</li><li>be able to solve complex bugs often quite quickly</li><li>always document your code on a good level</li><li>have a basic understanding of any Javascript Framework but preferably React</li><li>have a good understanding and experience with MongoDB or other noSQL databases</li><li>know what is continous integration and how it works</li></ul><p>Experience or knowledge how Amazon services like EC2, RDS, CloudFront work is a plus.</p><p>To apply for this job, you MUST answer the two questions below and email your answers to: <a href='mailto:timedoctor-tmdc0464@applications.recruiterbox.com' rel='nofollow'>timedoctor-tmdc0464@applications.recruiterbox.com</a>. Make sure you also attached your UPDATED resume.<br>NOTE: ONLY those with answers to the two questions and resume will be accepted.</p><p>These are the questions to answer to qualify for this job:</p><p>Q1) What is persistent cookie?</p><p>a) Cookie which is stored in a cookie file permanently on the browser<br>b) Cookie which is stored in a cookie file permanently on the file server<br>c) Cookie which is more secured than a regular cookie</p><p>Q2) Can you extend Final Defined class?<br>a) Yes, only once<br>b) Yes, multiple times<br>c) No</p>                    </div>                            <h2>                About Time Doctor            </h2>            <div><p>Time Doctor is a time tracking and productivity tool. Our software can be used by an individual or a team to track time for tasks and monitor computer activity, such as taking screenshots while you’re working, monitor keyboard and mouse activity and track web app and website usage.</p><p>We have a team of over 65 people working 100% remotely in 8 different countries. &nbsp;More about us here: <a href='https://www.timedoctor.com/about-us.html' rel='nofollow'>https://www.timedoctor.com/about-us.html</a></p><p><a href='https://www.linkedin.com/company/time-doctor' rel='nofollow'>https://www.linkedin.com/company/time-doctor</a></p>            </div>        ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_soap",
      "TECH2_php",
      "TECH2_symfony2",
      "TECH2_mvc",
      "DBG:surround``2W(100, remot)",
      "REMOTE1_100",
      "TZ_America_East",
      "TITLE1_integration",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "TECH2_mysql"
    ],
    "tagsNames1": [
      "100% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "mvc",
      "mysql",
      "php",
      "soap",
      "symfony2"
    ]
  },
  {
    "id": "0lgsbGr3TtOslwuHsFjEhQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/referralmd/jobs/12593-senior-architect-application-integration",
    "title": "Senior Architect, Application Integration",
    "content": "<div><h2>Senior Architect, Application Integration at ReferralMD</h2><div>San Francisco, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$90K–$160K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Looking to change healthcare, and not just build another app that does not solve a real world problem? </p><p>referralMD is a San Francisco-based health-tech startup with a mission of optimizing and solving the $180B referral leakage problem. We are a HIPAA-compliant, cloud-based software company focused on improving collaboration between health systems by providing communication tools, decision support, and notifications when patients are admitted, discharged, or transferred between care settings.  We passionately believe in improving healthcare by embracing technology to empower physicians to deliver optimal care.</p><p>Position Summary</p><p>Looking for a strong technical leader to drive product development for the CRM team.</p><p>Position Description</p><p>Cultivates an environment where associates respect and adhere to company standards of integrity and ethics</p><p>Develops and executes technical software development strategy for ecommerce applications and systems using current business roadmap</p><p>Develops and implements strategies to attract and maintain a highly skilled and engaged workforce</p><p>Develops and leverages internal and external partnerships and networks to maximize the achievement of business goals</p><p>Ensures product quality</p><p>Executes engineering projects</p><p>Provides overall direction for Engineering</p><p>Reduces customer impact (for example, sales loss) due to applications systems issues</p><p>Minimum Qualifications</p><p>Bachelor's Degree in Computer Science or related field and 7 years experience building scalable ecommerce applications or mobile software and 2 years supervisory experience.</p></div>",
    "urlFetchPending": false,
    "published": "Oct 7, 2017 10:21:11 PM",
    "tags": [
      "San Francisco",
      "Remote OK",
      "Full Time",
      "Software Engineer",
      "REMOTE1_100",
      "TZ_unknown",
      "TITLE1_integration",
      "Full-Stack Developer"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  }
]
}
