{
 "items": [
  {
    "id": "xGvl5MMESsihES0L8wy8Cg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/158624/application-release-engineer-oreilly-auto-parts?a=RcfsrD4IAnu",
    "title": "Application Release Engineer at O'Reilly Auto Parts (Springfield, MO) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Automotive</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>10k+ people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Public</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>As a <strong><em>Release Engineer</em></strong> on the O'Reilly Retail Development team, you will create, maintain, and curate the main code branches for all active development projects. The Release Engineer coordinates the releases of not only multiple projects, but the multiple code branches that make up those projects. You will be the point of contact and subject matter expert for releases to the development, test, and production environments. You will also have the opportunity to automate the management and deployment of code to all of the environment. The Release Engineer works closely with the development, project management, and QA teams to coordinate the timely and effective release of new software releases.</p><p><strong>Essential Job Functions </strong></p><ul><li>Owns and curates the builds, patches, and processes needed to orchestrate a delivery of software across our various environments</li><li>Perform the actual releases from one environment to the next and final deployment into production</li><li>Estimate, plan, and track software configuration management tasks while providing project status updates to management</li><li>Document and track releases for auditing purposes</li><li>Create and manage release notes and deployment notifications to appropriate parties</li><li>Coordinate release activities with internal teams (development, business, QA, project management) to ensure a smooth and trouble free roll out of releases and software patches</li><li>Support and enhance build and release processes through automation.</li><li>Configures and enforces release standards for the Retail IT team (e.g. versioning, artifacts, documentation)</li><li>Actively engages the outside industry to research and stay up to date on new release and deployment technologies</li></ul><p><strong>Skills and Qualifications</strong></p><ul><li>Bachelor of Arts or Bachelor of Science degree in related discipline or equivalent</li><li>Experience with source code management systems such as Jenkins, Artifactory, GIT, and Ansible</li><li>Experience with Linux and bash scripting</li><li>Experience in process and system automation and system admin procedures</li><li>Solid understanding and experience with Agile software development methodologies</li><li>Solid understanding and practical experience of software development life cycles</li><li>Experience with issue troubleshooting and bug triage</li><li>2 years build automation experience (e.g. Jenkins, Artifactory, or Gradle)</li><li>Ansible experience a plus</li></ul>                    </div>                            <h2>                About O'Reilly Auto Parts            </h2>            <div><p>O'Reilly Auto Parts is a Fortune 500 company with 59 straight years of continuous growth and over 73,000 team members at more than 4,600 stores and 26 distribution centers in 44 states. We are determined to be the leader in the auto parts industry and believe that our team members are the most important asset in our business.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive Salary                            </div>                            <div>                                 Medical, Dental, and Vision Insurance                            </div>                            <div>                                 Team Member Discounts                            </div>                            <div>                                 On-Site Gym and Cafeteria                            </div>                            <div>                                 Competitive Benefits Package                            </div>                            <div>                                 401K                            </div>                            <div>                                 Stock Purchase Plan                            </div>                            <div>                                 Paid Vacation                            </div>                            <div>                                 Remote Work                            </div>                            <div>                                 Profit Sharing                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_automation",
      "TECH2_gradle",
      "TECH2_ansible",
      "TECH2_sysadmin",
      "TECH2_agile",
      "REMOTE1_100",
      "TZ_unknown",
      "TITLE1_integration",
      "TECH2_jenkins"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "agile",
      "ansible",
      "automation",
      "gradle",
      "jenkins",
      "sysadmin"
    ]
  },
  {
    "id": "R2M0KStmTd28aOFLPDouEA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157265/senior-u-i-developer-integrated-data-services-ids?a=QJZuxpxPCs8",
    "title": "Senior U/I Developer at Integrated Data Services (IDS) (Washington, DC) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Financial Technology, Government, Software Development</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Senior UI Developer</strong></p><p>Los Angeles, CA; Washington D.C.; Rochester, NY; Dayton, OH</p><p><strong>Company Overview:</strong></p><p>Integrated Data Services, Inc. (IDS) is a leading provider of custom software products and Government financial management services. IDS was founded in 1997 in El Segundo, CA, and since that time has seen tremendous growth and success. Currently IDS has offices supporting customers nationwide. By providing customers with fast, efficient and reliable information systems and support services, IDS has become a preferred provider of financial and programmatic systems, services, and solutions across a wide variety of Government agencies.</p><p></p><p><strong>Position Description:</strong></p><p>IDS is seeking a Senior UI Developer with an expert understanding of UI design. You will be responsible for the design and development of web applications using AngularJS. In addition to writing front-end code, you must be able to work with others to take a design concept and develop it into a production ready product. We’re looking for somebody who is a confident problem solver and who proactively challenges traditional solutions.</p><p><strong>Responsibilities include, but are not limited to:</strong></p><ul><li>Write client-side code for web-based applications, create fast, easy-to-use, high volume production applications, and develop prototypes quickly.</li><li>Contribute in the design and implementation of UI changes across our product base.</li><li>Develop detailed technical analysis and design specifications based on functional requirements.</li><li>Collaborate heavily with fellow developers, designers and analysts to solve problems.</li><li>Develop complete front-end stack of projects using HTML/CSS/SASS, AngularJS and JavaScript.</li><li>Create and improve existing reusable components.</li><li>Integrate front-end UI with backend services.</li><li>Optimize web applications to maximize speed and scale</li><li>Set and follow coding standards.</li></ul><p></p><p><strong>Physical &amp; Mental Qualifications:</strong></p><ul><li>Must be able to lift/carry at least 25 lbs.</li><li>Must be able to walk, sit, type, hear, see, speak, and stand for extended periods of time.</li><li>May be required to bend, balance, stretch, reach, twist, walk, kneel, stoop, crouch, push, pull.</li><li>Must be able to remain in a stationary position 80% of the time.</li><li>Must consistently work and type on a computer and may be required to move about inside the office to access file cabinets, office supplies, etc.</li></ul><p><strong>Knowledge and Skills:</strong></p><ul><li>5+ years of experience developing dynamic, highly interactive user interfaces for the web.</li><li>1+ years using AngularJS.</li><li>Must be fluent in front-end technologies including, but not limited to, JavaScript, AJAX, HTML, CSS, SASS, XML, and familiar with one or more JavaScript libraries (jQuery, D3, and Backbone).</li><li>Good understanding of the current state of modern web development.</li><li>Disciplined approach to testing and quality assurance.</li></ul><p><strong>Education and Work Experience:</strong></p><p>This position requires a minimum of a 4-year degree from an accredited college or university in engineering, information technology, computer science, or other related disciplines. Equivalent work experience may be acceptable in lieu of a degree.</p><p><strong>Certificates and Licenses:</strong></p><p>Applicants selected for employment will be subject to a Federal background investigation and must meet additional eligibility requirements for access to classified information or materials.</p><p></p><p><strong>Travel:</strong></p><p>Some travel may be required.</p><p><strong>Hours:</strong></p><p>Normal work schedule will be 8:00 A.M. to 5:00 P.M., Monday through Friday.&nbsp; May be required to work additional hours and/or weekends, as needed, to meet deadlines or to fulfill travel obligations.</p><p><strong>Salary Range:</strong></p><p>Commensurate with experience.</p><p>Company offers full-benefits package including health, dental, vision and 401K plans.&nbsp; IDS is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regards to race, creed, age, sex, gender, physical or mental disability, sexual orientation, gender identity, gender expression, ancestry, pregnancy perceived pregnancy, medical condition, marital status, familial status, color, religion, uniformed services, veteran status, national origin, genetic information, or any other characteristic protected under local, state or Federal law.&nbsp; A submission of a resume is an expression of interest and not considered an application.</p><p>For more information, visit <a href='http://www.get-integrated.com/' rel='nofollow'>www.get-integrated.com</a>. To apply, please send a resume and cover letter to <a href='mailto:jobs@get-integrated.com' rel='nofollow'>jobs@get-integrated.com</a> and reference code: IDS-UD-VL.</p><p><strong>Please note:</strong> All candidates for this position will be required to complete a skills based test to demonstrate expertise in the following areas: 1) a programmer’s ability to write a recursive function; 2) a programmer’s ability to handle boundary conditions; and 3) a programmer’s ability to come up with a performant solution.&nbsp;The test should take between 2-4 hours.&nbsp;</p><p><strong>**U.S. citizenship and/or green card is required; H1-B visas and other visas are not being sponsored. Relocation expenses are NOT compensated.&nbsp; All jobs are employer paid; no fees to candidates. Third parties or agencies inquiries are not being accepted.**</strong></p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Company Paid - Employee Medical, Dental, Vision, Disability and Life                            </div>                            <div>                                 Other Benefits - Coverage for Dependents, Pre-Tax FSA's and AFLAC                            </div>                            <div>                                 401(k) - 3% Safe Harbor Plan with 100% vesting upon date of entry                            </div>                            <div>                                 Competitive Salary                            </div>                            <div>                                 Paid Time Off (PTO) - Vacation/Sick                            </div>                            <div>                                 Paid Holidays - Federal Calendar                            </div>                            <div>                                 Work/Life Balance                            </div>                            <div>                                 Remote Work and/or RDO Schedules (Depending on Location and Position)                            </div>                            <div>                                 Business Casual Attire (Location specific)                            </div>                            <div>                                 A place for talented people to grow                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_ui-design",
      "TECH2_angularjs",
      "TECH2_html",
      "TECH2_javascript",
      "REMOTE1_100",
      "TZ_unknown",
      "TECH2_sass",
      "TITLE1_integration"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "angularjs",
      "html",
      "javascript",
      "sass",
      "ui-design"
    ]
  },
  {
    "id": "2mQYTNhzRlyParG2npsHPg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156656/integrations-engineer-cxt-software?a=QxkouNJeFzy",
    "title": "Integrations Engineer at CXT Software (Phoenix, AZ) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, Software Development / Engineering, Transportation</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>CXT Software, a leader in providing automation technology to expedited delivery and distribution businesses, is seeking an Integrations Software Engineer with solid server and web service based development experience using Microsoft tools, including C#, WCF, MS SQL Server. Join a talented team of software professionals to enhance, maintain, and support our market-leading software products.</p><p>Position Scope</p><ul><li>Intelligent, dedicated, and eager to learn.</li><li>High level of proficiency with software, databases, networking, and hardware.</li><li>Highly motivated, hands-on, and results-oriented.</li><li>Comfortable in a small team environment using Agile methodologies.</li><li>Ability to efficiently solve problems and implement code for time-sensitive engineering projects.</li><li>Experience working in a remote environment.</li></ul><p>Position Responsibilities</p><ul><li>Design and develop challenging two way integrations with proprietary software platforms using web services, file transfer protocols, and industry-standard formats such as X12 EDI, XML, JSON and flat files.</li><li>Design and implement web service based business processes for an enterprise-level software platform.</li><li>Provide tier-4 technical support to internal and external customers.</li></ul><p>Candidate Requirements</p><ul><li>Solid working knowledge in developing C# and service oriented business applications.</li><li>Solid working knowledge of X12 EDI, XML, JSON, and RESTful web services.</li><li>Knowledge of MS SQL Server including stored procedures, triggers, database design, and ADO.</li><li>Working knowledge of performance monitors and debugger tools.</li><li>Must have an work space that is free of distractions.</li></ul><p>Candidate Desired Qualities</p><ul><li>Experience with data integration platforms and EDI.</li><li>Experience in use of WCF for web services a plus.</li><li>Working knowledge of unit testing using Microsoft test.</li><li>Ability to read and understand programs written in Visual Basic 6.0.</li><li>Experience with JIRA, Git and SVN.</li></ul>                    </div>                            <h2>                About CXT Software            </h2>            <div><p>&nbsp;CXT Software Benefits:</p><p>CXT Software offers competitive pay, 401(k) with 3% of salary company match, paid vacations, holiday and personal time pay, and medical/dental benefits.</p><p>&nbsp;Note to Applicants:</p><p>&nbsp;CXT Software is an equal opportunity employer.&nbsp; We value the diversity of our workforce.&nbsp; No third parties please.&nbsp; We are unable to sponsor H1b applicants at this time.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 9 Paid Holidays Per Year                            </div>                            <div>                                 Personal and Vacation Time                            </div>                            <div>                                 Company contributes 80% of the Employees Medical Insurance Premium                            </div>                            <div>                                 Remote Working                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_json",
      "TECH2_xml",
      "TECH2_sql-server",
      "TECH2_wcf",
      "TECH2_c#",
      "REMOTE1_100",
      "TZ_unknown",
      "TITLE1_integration"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "c#",
      "json",
      "sql-server",
      "wcf",
      "xml"
    ]
  },
  {
    "id": "fzF3OsQUT16uO17U3srElg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157284/php-back-end-developer-integrations-specialist-time-doctor?a=QKnZanLVRwA",
    "title": "PHP Back-end Developer - Integrations Specialist - 100% Remote at Time Doctor () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>This is a 100% remote position. We prefer to hire people from Europe and Asia because of team collaboration, all of our current dev team is in Asia or Europe and so it is unlikely (although not impossible) that we will hire in north or south america.</p><p>You will be working from home with mostly flexible hours although you will need to attend the team meeting which is at approximately 8:30am GMT and to work for 3 hours after this time for team collaboration (This is 3:30am to 6:30am New York time, so you can see that’s the reason we are not likely to hire in north, central or south america).</p><p><strong><strong>WHAT YOU WILL BE RESPONSIBLE FOR</strong></strong></p><p>You will be working in a team of around 10 other developers. You primary areas of work will be:</p><ol><li>Building and maintaining external integrations with partners through different communication protocols - REST / SOAP etc …</li><li>Integrations with Zapier</li><li>Working on queue management back-end solutions helping these integrations to operate properly</li><li>Working on developing back-end modules / services part of the whole product infrastructure</li><li>Working with databases with millions of records and hundreds of thousands of requests per day.</li><li>You are going to get involved into continuous integration processes, different branching models for version control and strict coding standards.</li><li>Work on highly scalable cloud infrastructure including multiple instances connected by load balancers for traffic distribution</li></ol><p><strong>TO BE A BEST FIT FOR THIS JOB YOU NEED TO:</strong></p><ul><li>be an expert in PHP at least 5+ years. Expert means that you have solid experience in building web based applications with high level of abstraction</li><li>be an expert in External API Integrations and have a quick understanding how an integration can be done - REST / SOAP</li><li>have a good experience in MVC frameworks</li><li>have a good experience with Symfony Framework</li><li>have a good experience of building DDD oriented architecture</li><li>have a solid experience in code optimization and performance improvements</li><li>know how the core of MySQL is working, make decisions about the storage engines, database structure and scalability of the database</li><li>know how to optimize database performance</li><li>be able to solve complex bugs often quite quickly</li><li>always document your code on a good level</li><li>have a basic understanding of any Javascript Framework but preferably React</li><li>have a good understanding and experience with MongoDB or other noSQL databases</li><li>know what is continous integration and how it works</li></ul><p>Experience or knowledge how Amazon services like EC2, RDS, CloudFront work is a plus.</p><p>To apply for this job, you MUST answer the two questions below and email your answers to: <a href='mailto:timedoctor-tmdc0464@applications.recruiterbox.com' rel='nofollow'>timedoctor-tmdc0464@applications.recruiterbox.com</a>. Make sure you also attached your UPDATED resume.<br>NOTE: ONLY those with answers to the two questions and resume will be accepted.</p><p>These are the questions to answer to qualify for this job:</p><p>Q1) What is persistent cookie?</p><p>a) Cookie which is stored in a cookie file permanently on the browser<br>b) Cookie which is stored in a cookie file permanently on the file server<br>c) Cookie which is more secured than a regular cookie</p><p>Q2) Can you extend Final Defined class?<br>a) Yes, only once<br>b) Yes, multiple times<br>c) No</p>                    </div>                            <h2>                About Time Doctor            </h2>            <div><p>Time Doctor is a time tracking and productivity tool. Our software can be used by an individual or a team to track time for tasks and monitor computer activity, such as taking screenshots while you’re working, monitor keyboard and mouse activity and track web app and website usage.</p><p>We have a team of over 65 people working 100% remotely in 8 different countries. &nbsp;More about us here: <a href='https://www.timedoctor.com/about-us.html' rel='nofollow'>https://www.timedoctor.com/about-us.html</a></p><p><a href='https://www.linkedin.com/company/time-doctor' rel='nofollow'>https://www.linkedin.com/company/time-doctor</a></p>            </div>        ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_soap",
      "TECH2_php",
      "TECH2_symfony2",
      "TECH2_mvc",
      "REMOTE1_100",
      "TZ_America_East",
      "TITLE1_integration",
      "TECH2_mysql"
    ],
    "tagsNames1": [
      "100% remote",
      "US East timezone"
    ],
    "tagsNames2": [
      "mvc",
      "mysql",
      "php",
      "soap",
      "symfony2"
    ]
  }
]
}
