{
 "items": [
  {
    "id": "fzF3OsQUT16uO17U3srElg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157284/php-back-end-developer-integrations-specialist-time-doctor?a=QKnZanLVRwA",
    "title": "PHP Back-end Developer - Integrations Specialist - 100% Remote at Time Doctor () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>This is a 100% remote position. We prefer to hire people from Europe and Asia because of team collaboration, all of our current dev team is in Asia or Europe and so it is unlikely (although not impossible) that we will hire in north or south america.</p><p>You will be working from home with mostly flexible hours although you will need to attend the team meeting which is at approximately 8:30am GMT and to work for 3 hours after this time for team collaboration (This is 3:30am to 6:30am New York time, so you can see that’s the reason we are not likely to hire in north, central or south america).</p><p><strong><strong>WHAT YOU WILL BE RESPONSIBLE FOR</strong></strong></p><p>You will be working in a team of around 10 other developers. You primary areas of work will be:</p><ol><li>Building and maintaining external integrations with partners through different communication protocols - REST / SOAP etc …</li><li>Integrations with Zapier</li><li>Working on queue management back-end solutions helping these integrations to operate properly</li><li>Working on developing back-end modules / services part of the whole product infrastructure</li><li>Working with databases with millions of records and hundreds of thousands of requests per day.</li><li>You are going to get involved into continuous integration processes, different branching models for version control and strict coding standards.</li><li>Work on highly scalable cloud infrastructure including multiple instances connected by load balancers for traffic distribution</li></ol><p><strong>TO BE A BEST FIT FOR THIS JOB YOU NEED TO:</strong></p><ul><li>be an expert in PHP at least 5+ years. Expert means that you have solid experience in building web based applications with high level of abstraction</li><li>be an expert in External API Integrations and have a quick understanding how an integration can be done - REST / SOAP</li><li>have a good experience in MVC frameworks</li><li>have a good experience with Symfony Framework</li><li>have a good experience of building DDD oriented architecture</li><li>have a solid experience in code optimization and performance improvements</li><li>know how the core of MySQL is working, make decisions about the storage engines, database structure and scalability of the database</li><li>know how to optimize database performance</li><li>be able to solve complex bugs often quite quickly</li><li>always document your code on a good level</li><li>have a basic understanding of any Javascript Framework but preferably React</li><li>have a good understanding and experience with MongoDB or other noSQL databases</li><li>know what is continous integration and how it works</li></ul><p>Experience or knowledge how Amazon services like EC2, RDS, CloudFront work is a plus.</p><p>To apply for this job, you MUST answer the two questions below and email your answers to: <a href='mailto:timedoctor-tmdc0464@applications.recruiterbox.com' rel='nofollow'>timedoctor-tmdc0464@applications.recruiterbox.com</a>. Make sure you also attached your UPDATED resume.<br>NOTE: ONLY those with answers to the two questions and resume will be accepted.</p><p>These are the questions to answer to qualify for this job:</p><p>Q1) What is persistent cookie?</p><p>a) Cookie which is stored in a cookie file permanently on the browser<br>b) Cookie which is stored in a cookie file permanently on the file server<br>c) Cookie which is more secured than a regular cookie</p><p>Q2) Can you extend Final Defined class?<br>a) Yes, only once<br>b) Yes, multiple times<br>c) No</p>                    </div>                            <h2>                About Time Doctor            </h2>            <div><p>Time Doctor is a time tracking and productivity tool. Our software can be used by an individual or a team to track time for tasks and monitor computer activity, such as taking screenshots while you’re working, monitor keyboard and mouse activity and track web app and website usage.</p><p>We have a team of over 65 people working 100% remotely in 8 different countries. &nbsp;More about us here: <a href='https://www.timedoctor.com/about-us.html' rel='nofollow'>https://www.timedoctor.com/about-us.html</a></p><p><a href='https://www.linkedin.com/company/time-doctor' rel='nofollow'>https://www.linkedin.com/company/time-doctor</a></p>            </div>        ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_soap",
      "TECH2_php",
      "TECH2_symfony2",
      "TECH2_mvc",
      "REMOTE1_100",
      "TZ_America_East",
      "TITLE1_integration",
      "TECH2_mysql"
    ],
    "tagsNames1": [
      "100% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "mvc",
      "mysql",
      "php",
      "soap",
      "symfony2"
    ]
  }
]
}
