{
 "items": [
  {
    "id": "hdpIXi4ZQj-2gQsAsG-GtA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63599",
    "title": "Product Development Manager",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>We are seeking a veteran, process-oriented Product Manager to become a key member of our product leadership team. Working with existing product team, you will help act as the interface between a globally dispersed team of developers, QA professionals and members of a remote, sales-driven organization. <br><br>You will be responsible for balancing needs between infrastructure and product development requirements. You will work with stakeholders and product team members to collect, understand, and translate the business needs of our internal and external clients into technical language for your development team. You will share ownership over the product roadmap and be responsible for forecasting and maintaining on-time delivery of roadmap items. <br><br>You will work with a team that is charged with helping to increase the profitability of existing products and to develop new products for the company. You will build products from existing ideas, and help to develop new ideas based on your industry experience and your contact with customers, prospects, and internal clients. You must possess a unique blend of business and technical savvy; have big-picture vision, and the drive to make that vision a reality. You must enjoy spending time in the market to understand its problems and find innovative solutions. <br><br>You must be able to communicate efficiently and effectively up, down, and laterally within and without our organization. You will work with an engineering counterpart to define product release requirements and with the company marketing team to define the go-to-market strategy, and help them understand the product positioning, key benefits, and target customers. You will also serve as the internal and external evangelist for your product offering, often working with the sales team and key customers/partners.<br>Responsibilities:<br><br>Gain a deep understanding of customer experience to identify and fill product gaps<br>Generate new ideas that grow market share, improve customer experience, and drive growth<br>Work with all stakeholders to prioritize and define features and tasks, aligned with strategic initiatives and business drivers<br>Evaluate competitor and technology landscape and identify niche opportunities that leverage our product line’s strengths and other weaknesses<br>Assess market competition by comparing the company's product to competitors' products.<br>Provide information for management by preparing short-term and long-term product success forecasts, special reports and analyses, and answer questions and requests.<br>Drive a solution set across development teams (primarily Development/Engineering and Marketing) through market requirements, product contracts, and positioning.<br>Propel product launches forward by working with the public relations team, executives, and other members of the management team <br>Translate product strategy into detailed requirements<br>Identify and provide solutions for unique client requirements without completely diverging from the roadmap and product vision<br>Brainstorm with the management team and contribute to the creation and maintenance of a product-line strategy and roadmap<br>Work closely with engineering teams to deliver quick time-to-market solutions<br><br>Skills and Experience<br>6+ years of Product Management/Project Management experience<br>Experience in a technology driven product environment, preferably SaaS product, B2B or B2C<br>Experience building SaSS based business models within the product; onboarding, billing, plan management, etc.<br>Technology background in SQL and Ruby on Rails<br>Experience working with API’s and integrating with third party API’s<br>Able to quickly learn new technological environments and keep updated on industry trends<br>Experience working with remote teams – a plus<br>Proven track record of managing all aspects of a successful product throughout its lifecycle<br>Proven ability to align/develop product and marketing strategies and effectively communicate recommendations to executive management<br>Strong problem solving skills<br>Excellent written and verbal communication skills<br>Product management experience in a SaaS, cloud, or marketing software environment<br>Clear and precise communications skills, and ability to work with remotely distributed teams<br>Solid technical background with understanding and/or hands-on experience in software development and web technologies<br>BS/BA required in Computer Science or a related technical field, MBA a plus<br>Strong background in analyzing multiple data sets, demonstrating the ability to understand key performance drivers and ability to execute against findings<br>Strong technical architectural understanding of mobile and web products <br>Must have experience working with design and engineering teams to deliver end to end products<br>Strong understanding of UX best practices and ability to craft well thought out wireframes to communicate ideas effectively to development team as well as stakeholders.<br>A team-player attitude with willingness to get all hands on deck and roll up sleeves to achieve the best result<br><br><br><br><br><br></p></span></td><td></td><td></td><td><a href='mailto:cljobs%40regroup.com?subject=Application%20for%20Product%20Development%20Manager%20at%20Regroup&amp;body=Hi%21%0A%0AI%27d%20like%20to%20apply%20for%20your%20position%20for%20a%20Product%20Development%20Manager%20at%20Regroup' rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 8, 2017 10:49:21 PM",
    "tags": [
      "REMOTE1_50",
      "TITLE1_manager",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "9kbR4QijQLKvHwHZZlJWtA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/64144/pr-account-executive-at-prezzroom/",
    "title": "PR Account Executive",
    "content": "About Prezzroom:<br /><br />Prezzroom, a public relations company for startups with clients in London and New York, is seeking a public relations Account Executive -- a mid-level to senior-level role -- for immediate hire.<br /><br />Prezzroom is made for startups, by startups. We're on a mission to challenge the PR industry and bring quality, yet affordable PR services to small businesses. Focusing on Health and Wellness, one of the world's fastest-growing markets, we discover today’s newest and most innovative companies and make sure they get the exposure their brand deserves.<br /><br />Our global roster of clients includes several of the fastest growing brands in wellness, covering fitness events and studios, food and drink, as well as new consumer technology across health, beauty and fashion. We are seeking an ambitious, entrepreneurial, professional, and enthusiastic self-starter interested in rapidly advancing their career in public relations while helping some of the newest, most extraordinary companies take off. All candidates must have at least two years post-university experience either at a public relations agency or in-house.<br /><br />Duties:<br /><br />Executing PR campaigns as an integral member of a team<br />Drafting, editing, and reviewing press materials<br />Dealing with enquiries from press, clients, new business and external organizations<br />Issuing press releases and pitching to reporters both within the UK and internationally<br />Daily media monitoring<br />On a regular basis, conducting direct client engagement<br />Undertaking industry research and generating story ideas and angles<br />Developing and maintain relationships with media to secure and grow coverage<br />Supporting in-person and phone meetings with clients and potential new business<br />Supporting and training your own personal Intern<br /><br />Skills Requirement:<br /><br />Minimum of 2 years PR agency experience post-university<br />Exceptional written and verbal communication<br />Excellent knowledge of the health and wellness or food and drink industry<br />Demonstrated ability to think strategically and to identify opportunities for clients<br />Ability to communicate clearly and transfer complex information in a concise and clear form<br />Ability to prioritize and plan effectively<br />Strong attention to detail<br />Ability to work well in a startup team<br />Excellent interpersonal skills<br />Motivated to excel in a fast-paced environment<br />Ability to maintain a high level of social, organizational and professional standards in job-related activities<br /><br />Candidates must submit a resume and cover letter.<br /><br />Job Type: Full-time<br /><br />Job Location:<br />London, UK<br />Flexible hours<br />Ability to work remotely<br /><br />Required education:<br />Bachelor's<br /><br />Required experience:<br />post-university: 2 years<br /><br />Required language:<br />English",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 11:39:12 PM",
    "tags": [
      "REMOTE1_50",
      "TITLE1_manager",
      "TZ_Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "SFtlvBUiSLiEMfAOe0qtAg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/dataiku/jobs/121891-account-executive-west-coast-us",
    "title": "Account Executive- West Coast US",
    "content": "<div><h2>Account Executive- West Coast US at Dataiku</h2><div>San Francisco, California, Remote · Full Time</div></div><div><div>Skills</div><div>Sales, Customer Relationship Management, Analytics, Customer Centric Selling</div><div>Compensation</div><div>$75K–$140K<br>0.001%–0.005%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Dataiku is looking for an experienced Account Executive to join our sales team in the San Francisco Bay Area. Since the launch of our company in the US, we have experienced healthy growth and steady market demand. This individual contributor position is a new position due to business expansion, with responsibility for an extensive west territory.<br>We’re looking for someone who can express passion about the new technologies and possibilities of Big Data and Advanced Analytics.<br>The role consists of engaging prospects and customers on the topics of their Big Data and Advanced Analytics initiatives and to help them develop a more efficient approach, leveraging our platform. The Sales Executive is responsible for the entire sales cycle, while being able to leverage various company resources, to reach a successful collaboration with the prospect.<br>Dataiku is a young company with great momentum and at this early stage, the Account Executive is likely to work cross functionally with Marketing, Product Management and Engineering.</p><p>Required Skills<br>5+ years experience in software field sales<br>Strong belief in a customer centric selling philosophy and applying a consultative approach in customer interactions<br>Background in selling innovation and new concepts to large Enterprises<br>Strong ability to develop a vision match with prospects and customers, to develop alignment across different groups and cultivate champions.<br>Good articulation of competitive positioning<br>Travel 30 to 50%</p><p>Desired Skills<br>Experience in ‘data’ – big data, analytics, data science, BI/DW, data integration<br>Early start-up experience</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 8:22:29 PM",
    "tags": [
      "San Francisco",
      "Remote OK",
      "Sales",
      "Customer Relationship Management",
      "TITLE1_manager",
      "Full Time",
      "Customer Centric Selling",
      "REMOTE1_100",
      "California",
      "TZ_unknown",
      "Analytics"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "1aJxXrVzR1OlKY0m03cZtA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/sentext-solutions/jobs/122653-account-executive",
    "title": "Account Executive",
    "content": "<div><h2>Account Executive at SenText Solutions</h2><div>United States, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Sales and Marketing</div><div>Compensation</div><div>$50K–$90K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Responsible for showing 98% of companies that are NOT text marketing how they can.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 4, 2017 10:25:32 PM",
    "tags": [
      "Remote OK",
      "United States",
      "Sales and Marketing",
      "TITLE1_manager",
      "Full Time",
      "REMOTE1_100",
      "Business Development",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "r9KJtgdDTeiTKXzkfdqJ7w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/64010/head-of-engineering-at-tallysticksio/",
    "title": "Head of Engineering",
    "content": "At Tallysticks, we believe that international trade brings the global community together. We’re opening up growth for independent businesses, building trust with their trading partners and confidence in their trade potential. We’ve simplified the end-to-end trade process by creating a single online tool for documentation, communications and payments. Tallysticks reduces the effort, cost and risk of trade management for independent businesses. Our aim is to help SMEs around the world grow their business.<br /><br />What is Tallysticks?<br />Tallysticks is a solution that helps customers create, negotiate, and agree international (containerised) trade contracts with ease. The solution is comprised of two key products:<br /><br />   1) a trade book - an application enabling importers and exporters to draft and sign legally binding trade contracts<br />   2) a payments mechanism - a framework that allows buyers and sellers to confidently exchange payment in a protected manner<br /><br />We have a number of different products and applications envisaged over the coming years, but the above two are the focus for 2018.<br /><br />Head of Engineering<br />As the Head of Engineering, you will be working closely with the CTO to devise how we will execute the tech vision.<br /><br />The role:<br />You will be working with the Head of Product to manage the sprints, ensure that the backlog is being met and is understood but everyone in the engineering team. You will also work closely with the COO to manage our hiring pipeline.<br /><br />You will also be expected to think critically and intelligently about how engineering and its challenges fits into the company’s wider strategic vision and to take part in tech planning and architectural discussions.<br /><br />Successful candidate profile<br />The successful candidate will want to build a successful engineering culture with the company and should have a proven track record of delivering successful software products and growing high-performance teams.<br /><br />   - Able to intelligently assess the trade-offs with different technology choices such as databases, cloud services, languages and approaches to development<br />   - Experience of managing development teams in an agile environment<br />   - Strong prioritisation and estimation skills<br />   - Strongly familiar with cloud computing concepts (we use AWS)<br />   - Understanding of security and basic cryptography concepts<br />   - Must understand continuous delivery and its importance<br />   - Has experience of web paradigms such as Microservices, REST, WebSockets, Authentication<br />   - Able to create a winning hiring-strategy for our developers<br /><br />When does the position start?<br />We only accept the best candidates and as such are in no rush. We hope to have the right person through the door by February 2018 but we will wait for the right person.<br /><br />Application process<br />   1) Send CV and Cover Letter<br />   2) Phone Screening Interview with competency based questions<br />   3) Take-home test<br />   4) Face-to-Face interview<br /><br />Remuneration and package<br />We offer a competitive package including salary and equity. We are a meritocracy and reward good work.<br /><br />Tallysticks leadership team<br />   - CEO: ex JP-Morgan Emerging Markets Analyst, ex US Diplomat and previous SME owner<br />   - CTO: ex CTO of CarThrottle<br />   - COO: ex KPMG Machine Learning Product Manager, ex Berlin Tech Accelerator<br />   - Head of Product: ex TechStars Mentor and B2B and B2C Product Manager",
    "urlFetchPending": false,
    "published": "Dec 4, 2017 11:07:48 AM",
    "tags": [
      "REMOTE1_50",
      "TITLE1_manager",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "RvCoV3HfQVuK909RfpNpCw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/memsql/jobs/111417-enterprise-account-executive-new-york",
    "title": "Enterprise Account Executive, New York",
    "content": "<div><h2>Enterprise Account Executive, New York at MemSQL</h2><div>New York City, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Sales, Databases, Enterprise Software, Enterprise Sales</div><div>Compensation</div><div>$225K–$300K<br>0.0%–0.05%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>MemSQL is looking for an accomplished database sales rockstar to add to our growing team. He/She will be tasked with transforming named accounts into real-time enterprises within the Northeast region. MemSQL is more than doubling annual revenue year-after-year and our list of Fortune500 customers just keeps growing. We are looking for an accomplished high-tech sales evangelist and startup player who will showcase MemSQL’s market superiority and grow our strategic accounts customer list. </p><p>About the Position</p><p>The Enterprise/Strategic Account Executive will develop, manage, and close sales opportunities within a select number of strategic accounts within the Northeast region. You will have the opportunity to overachieve and earn uncapped commission and accelerators. You must meet or exceed territory sales targets using deep industry expertise, drive, creativity and your already formed relationships with C-level clients, buyers and stakeholders. You thrive in an environment that is fast-moving and highly collaborative.  </p><p>Desired Skills and Experience <br>-Proven track record of successfully selling new enterprise solutions (large software, big data, and analytics solutions in particular) and increasing revenue through new customer acquisition.<br>-8+ years successful software sales experience<br>-Consistent track-record of surpassing sales targets.<br>-Strong understanding of how to grow a greenfield territory.<br>-Demonstrated ability to sell to CXO or line of business, successfully emphasizing business value vs. product.<br>-Actively listen to determine the customers’ needs.<br>-Operate in a fast-moving, entrepreneurial environment and do not require overhead support (You have no problems producing your own territory plan, presentations, quotes, etc.).<br>-Able to garner commitment at every step of sales process, a proven closer.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 1, 2017 10:17:44 PM",
    "tags": [
      "New York City",
      "Remote OK",
      "Sales",
      "Databases",
      "Enterprise Software",
      "TITLE1_manager",
      "Full Time",
      "REMOTE1_100",
      "TZ_unknown",
      "Enterprise Sales"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "F6-3In8mTLOere0ozNsX5w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/spiceblue/jobs/89424-pre-sales-executive",
    "title": "Pre Sales Executive",
    "content": "<div><h2>Pre Sales Executive at Spiceblue</h2><div>Chennai, Remote · Full Time</div></div><div><div>Compensation</div><div>₹120K–₹300K<br>No Equity</div></div><h3>Job Description</h3><div><p>Requirements and Responsibilities </p><p>Affinity to both sales and technology<br>Product presentations and demonstrations <br>Support with technical qualification of sales opportunities <br>Provide first-line technical support for software evaluations and/or pilot projects <br>Provide answers to (technical) questions in a Request for Information(RFI) or a Request for  Proposal (RFP).                                                                                                                                                   <br>Support at external and internal customer facing events <br>Create internal software requests and POC implementation plans and monitor the approval process <br>Be able to position and present  various product offerings</p></div>",
    "urlFetchPending": false,
    "published": "Nov 30, 2017 10:26:31 PM",
    "tags": [
      "Remote OK",
      "Sales",
      "Chennai",
      "TITLE1_manager",
      "Full Time",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "FElwqIkGS36beLak4U7n5Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/open-health-network/jobs/86122-director-marketing",
    "title": "Director, Marketing",
    "content": "<div><h2>Director, Marketing at Open Health Network</h2><div>Sunnyvale, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Lead Generation, Social Media Marketing, Market Research, Integrated Marketing, Marketing Management</div><div>Compensation</div><div>$80K–$120K<br>0.1%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Looking for a top integrated marketing strategist who is fluent in mobile health space.</p></div>",
    "urlFetchPending": false,
    "published": "Nov 29, 2017 10:22:20 PM",
    "tags": [
      "Remote OK",
      "Lead Generation",
      "Integrated Marketing",
      "Marketing Management",
      "Sunnyvale",
      "TITLE1_manager",
      "Full Time",
      "REMOTE1_100",
      "Social Media Marketing",
      "TZ_unknown",
      "Market Research",
      "Marketing"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "TroGummeTpOF4W10UjEGlw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/cylindo/jobs/60646-sales-executive-americas",
    "title": "Sales Executive - Americas",
    "content": "<div><h2>Sales Executive - Americas at Cylindo</h2><div>North America, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Inside Sales, Presentation Skills, Enterprise Sales, Solutions Selling, SaaS Sales</div><div>Compensation</div><div>$110K–$140K<br>0.05%–0.2%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Cylindo is looking for a Sales Executive to join our team in North America. You will be responsible for developing new business. You understand and know how to uncover your clients’ needs to ensure you offer the best and most valuable solution. Successful candidates must have a strong work ethic, passion to be part of Cylindo, and the drive to not only meet, but exceed, sales targets. With a winning attitude, a passion for Cylindo and proven success, we offer comprehensive career development plans.</p><p>Primary Responsibilities</p><p>- Selling Cylindo software and services to mid-sized companies<br> Full sales cycle management – from qualifying leads (leads primarily generated from SDR team and inbound), demonstrating the product, pricing, negotiation and closing<br>- Achieve and consistently exceed monthly sales goals<br>- Consistently managing and accurately forecasting monthly, quarterly, and annual pipelines and forecasts<br>- Developing short and longer term plans to achieve strategic sales objectives within the assigned territory<br>-Developing and managing executive level and key stakeholder customer relationships<br>- Sales primarily handled inside, but attendance at quarterly industry tradeshows for networking, prospecting and selling is expected<br>- Effectively demonstrate Cylindo software through use of WebEx/GoToMeeting<br>- Proactively maintain your pipeline using our CRM, Salesforce</p><p>Required Skills</p><p>- +2 years of direct quota driven SaaS sales experience<br>- Experience in closing deals in the $50K-$75K range<br>- Knowledge from retail and/or e-commerce a plus<br>- Adept at qualifying leads, reaching the right contact, prioritizing the pipeline and closing the deal to meet your monthly and quarterly targets<br>- Understanding of the decision making structure in mid-size companies<br>- Ability to thrive in a performance-oriented environment<br>- Self-starter with a competitive nature and desire to grow a career in software sales<br>- Excellent communication skills<br>- You are ambitious, self-driven and result oriented<br>- Preferably working knowledge of Salesforce.com<br>- Willingness to travel<br>- Strong work ethic and commitment<br>- Positive, team-oriented attitude</p></div>",
    "urlFetchPending": false,
    "published": "Nov 24, 2017 10:18:03 PM",
    "tags": [
      "Solutions Selling",
      "Presentation Skills",
      "Remote OK",
      "Sales",
      "SaaS Sales",
      "TITLE1_manager",
      "Full Time",
      "Inside Sales",
      "REMOTE1_100",
      "TZ_unknown",
      "North America",
      "Enterprise Sales"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "z3_8hfCnQYup6Ze0oaxGuQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4012-inside-sales-executive-teamup",
    "title": "Inside Sales Executive @ Teamup",
    "content": "<h2>              Inside Sales Executive<small> @ Teamup</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-11-24 17:28</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>ABOUT US!</strong></p><p><a href='https://goteamup.com/' rel='nofollow'>Teamup</a> is an all-in-one business management solution for independent fitness businesses. Our customers include businesses like CrossFit gyms, yoga studios, martial arts centres, and more.</p><p>Since 2012, teamup has helped thousands of businesses take control of payments, scheduling, and member management.</p><p>Our remote team of 10 is currently based in the UK, US, and Spain.</p><p><strong>THE JOB</strong></p><ul><li>Qualifying potential customers</li><li>Handling incoming enquiries</li><li>Managing the sales pipeline</li><li>Following up consistently</li><li>Using data to identify opportunities (we’ll show you how)</li><li>Phone and email communication with customers and prospects</li></ul><p><strong>YOU HAVE</strong></p><ul><li>Native-level English proficiency and are excited to work directly with customers via email, phone or screen share</li><li>Ability to engage potential customers by phone, and understand their requirements.</li><li>Determination for every customer to have a great experience with teamup and a desire to take responsibility for the customers you are helping</li><li>Experience working in a remote environment (comfortable primarily communicating over platforms like Close.io, Hipchat, Skype, Basecamp, ZenDesk, Jira etc.)</li><li>Computer literacy</li></ul><p>The schedule to work Monday through Friday, 9am - 5:30pm UK time, with ability to cover some hours during evenings, weekends and on public holidays if required</p><p><strong>ESSENTIAL TO HAVE</strong> (bonus points for both)</p><ul><li>Experience of fitness businesses</li><li>Experience working in the software industry</li></ul><p><strong>WHY WORK FOR US?</strong></p><p>We’re a very small team doing very big things — your work will make a huge impact and your voice will be heard! We offer a competitive salary, gym membership, team meet ups and a great team atmosphere to help you achieve your best work.</p><ul><li>Salary</li><li>£21,000 per annum</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Applicants should be based in Europe</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Nov 24, 2017 7:01:38 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "oHyNEsdNShirSFunK7agdg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63274",
    "title": "Inside Sales Executive",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>ABOUT US!</strong><br><br><a href='https://goteamup.com/' rel='nofollow'>Teamup</a> is an all-in-one business management solution for independent fitness businesses. Our customers include businesses like CrossFit gyms, yoga studios, martial arts centres, and more.<br>Since 2012, teamup has helped thousands of businesses take control of payments, scheduling, and member management.<br><br>Our remote team of 10 is currently based in the UK, US, and Spain.<br><br><strong>THE JOB</strong><br><br></p><ul><li>Qualifying potential customers<br></li><li>Handling incoming enquiries<br></li><li>Managing the sales pipeline<br></li><li>Following up consistently<br></li><li>Using data to identify opportunities (we’ll show you how)<br></li><li>Phone and email communication with customers and prospects<br><br><strong>YOU HAVE</strong><br><br></li><li>Native-level English proficiency and are excited to work directly with customers via email, phone or screen share<br></li><li>Ability to engage potential customers by phone, and understand their requirements.<br></li><li>Determination for every customer to have a great experience with teamup and a desire to take responsibility for the customers you are helping<br></li><li>Experience working in a remote environment (comfortable primarily communicating over platforms like Close.io, Hipchat, Skype, Basecamp, ZenDesk, Jira etc.)<br></li><li>Computer literacy<br><br>The schedule to work Monday through Friday, 9am - 5:30pm UK time, with ability to cover some hours during evenings, weekends and on public holidays if required<br><br><strong>ESSENTIAL TO HAVE</strong> (bonus points for both)<br><br></li><li>Experience of fitness businesses<br></li><li>Experience working in the software industry<br><br><strong>WHY WORK FOR US?</strong><br><br>We’re a very small team doing very big things — your work will make a huge impact and your voice will be heard! We offer a competitive salary, gym membership, team meet ups and a great team atmosphere to help you achieve your best work.<br><br></li><li>Salary<br></li><li>£21,000 per annum<br></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 24, 2017 7:01:38 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "pZsgJTO_Tfq7ZkonnnnVQg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5816-product-manager-with-project-management",
    "title": "Lean Startup Co: Product Manager with Project Management Experience (Lean Startup practitioner required)",
    "content": "<div>  <div>    <h2>Product Manager with Project Management Experience (Lean Startup practitioner required)</h2>      <h4>Posted Nov 24</h4>    <h3>      <span>Lean Startup Co</span><br>      <span>Headquarters: San Francisco, CA</span><br>        <a href='https://lean-startup-co.breezy.hr/p/a5458172dce001-product-manager-with-project-management-experience-lean-startup-practitioner-required?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/a5458172dce001-product-manager-with-project-management-experience-lean-startup-practitioner-required?source=weworkremotely</a>    </h3>  </div></div>  <div>    <div>Lean Startup Company offers the most exciting education solutions available today in modern management. We are a startup with&nbsp;<span>global brand recognition</span>&nbsp;headquartered in San Francisco, CA. We bring the entrepreneurial spirit to large organizations through cutting-edge education and modern management techniques. Lean Startup methodology provides a scientific approach and&nbsp;<span>framework for innovation,</span>&nbsp;so you can learn what your customers really want. It’s about testing your vision continuously, so you can effectively adapt and adjust before it’s too late.</div><div><br></div><div><span></span></div><div></div><div><br></div><div><span>ABOUT THE POSITION</span></div><div><br></div><div><span>We're seeking a part-time Product Manager with Project Management experience for</span>&nbsp;<a href='http://www.leanstartup.co/education' rel='nofollow'><span>The Lean Startup Co. Education Program</span></a>&nbsp;to lead the execution of an important initiative that will set the stage for an extraordinary transformation at a large, national organization.</div><div><br></div><div>In this role, your project management expertise and uncanny ability to obtain buy-in at all levels will serve you well. You’ll lead a group of subject matter experts, client stakeholders and creatives to help build and scale a program that will empower its participants to innovate and adapt to market changes using Lean Startup methodology.</div><div><br></div><div>You will make a massive impact in this initiative by leading the team towards the same objective, while managing and prioritizing resources to ensure client needs are met.</div><div></div><div></div><div><br></div><div><span>You’ll Work on Projects Like</span></div><div><br></div><ul><li>Scaling the adoption of Lean Startup methodology across a large organization</li><li>Working with subject matter experts and content creators to develop unique program training materials. Think playbooks and field guides, coach-the-coach curriculum and marketing collateral</li></ul><div></div><div><br></div><div><span>You’ll excel in (and enjoy!) this role if</span></div><div><br></div><ul><li>You have a track record of:</li><li><span>Working with Lean Startup methodology at an intermediate (required)&nbsp;</span>or higher level</li><li>Scaling a methodology (i.e. Lean Startup, Agile, Design Thinking) across a large organization</li><li>Creating a program that embeds a mindset and mechanics of a cultural shift across the organization</li><li>Coordinating, planning, executing, and tracking large scale implementation or organization change projects from beginning to end</li><li>Proactively working with stakeholders to drive initiatives forward, and ensure on time delivery of deliverables</li><li>Facilitating meetings and ensuring alignment across stakeholder groups</li><li>Demonstrating a proactive focus on meeting client and project requirements in a timely and cost effective manner</li><li>Operating under conditions of uncertainty and with minimal guidance</li><li>Maintaining accurate documentation, including timelines, budget updates, meeting notes, and timeframes</li><li>Managing competing priorities and ensuring stakeholders are clear on the path forward</li></ul><div><li>Overseeing stakeholder and team metrics dashboard data</li><li>You are an incredible communicator in virtual video meetings and in writing. People respond quickly to your email requests with the information you need.</li><li>You pride yourself on being proactive, responsive and exceptional at managing expectations.</li><li>You enjoy working collaboratively (yay, for google docs!) and thrive in a fast-paced environment where we love challenging ourselves (in Lean Startup fashion) to build, measure, and learn.</li><li>You are open to feedback, take ownership of your mistakes, and love applying your lessons learned to get 10x better.</li><li>You are familiar with remote working tools such as Slack, Zoom, Google apps</li><li>And finally, you get brownie points if you:</li></div><ul><li>Have remote work experience</li><li>Have experience working with a government client</li></ul><div></div><div><br></div><div><span>You’ll ensure the success of the initiative by</span></div><div><br></div><ul><li><em>Translating vision into execution.</em>&nbsp;You’ll ensure that the stakeholders and everyone involved is crystal clear on what the desired outcome is and you know how to get there with the resources you have available</li><li>Effectively utilizing subject matter experts and specialists to efficiently&nbsp;<em>move projects forward</em>.</li><li><em>Proactively managing people and expectations.</em>&nbsp;You’ll be awesome at ensuring that the right people are in the loop on the various stages of the project and there won’t be any surprises.</li><li><em>Being customer focused</em>. Learn the needs of the client and proactively test and advise the client on best path forward.</li><li><em>Being metrics oriented and business-driven.</em>&nbsp;Sharing your knowledge from past experience scaling programs across organizations to provide guidance on the best path forward.</li><li><em>Clearly communicating scope changes and impact</em>&nbsp;they have on budget and strategy.</li><li><em>Connecting and prioritizing</em>&nbsp;individual initiatives to the overall strategy.</li></ul><div></div><div><br></div><div><span>Why You’ll Love Working With Us</span></div><div><br></div><ul><li>We’re a 100% remote team using fun collaborative tools.</li><li>We encourage unplugging and prefer you don’t check email while you’re away.</li><li>Our clients are some of the largest companies in the world and you get a front row seat to the challenges they’re facing around innovation. Better yet, you get to help them solve their problems.</li><li>The work we do will go down in history as powerfully-transformative.</li><li>Experience the thrill and challenge of working in a fast-paced, growing startup.</li></ul><div></div><div><br></div><div>This is a contract-based, freelance role. The&nbsp;<span>position is remote</span>, but we ask that you’re 1) located in&nbsp;<span>the U.S</span><span>.</span>&nbsp;and 2) available to communicate during Pacific Time business hours.</div><div><br></div><div>*<span>Note</span>&nbsp;- We understand that you are eager to hear back from us. We receive a lot of applications and cannot respond to all of them. Please do not reach out to us regarding your application. If there is a mutual fit, we will contact you to move forward with the next steps in the process.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://lean-startup-co.breezy.hr/p/a5458172dce001-product-manager-with-project-management-experience-lean-startup-practitioner-required?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/a5458172dce001-product-manager-with-project-management-experience-lean-startup-practitioner-required?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 24, 2017 4:10:57 PM",
    "tags": [
      "TITLE1_manager",
      "TZ_America_West",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "US Pacific time zone"
    ],
    "tagsNames2": []
  },
  {
    "id": "n2WqhQLcTmuDZXuKpEThTA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/jobs/5786-content-marketing-project-manager",
    "title": "Growth Machine: Content Marketing Project Manager",
    "content": "<div>  <div>    <h2>Content Marketing Project Manager</h2>      <h4>Posted Nov 20</h4>    <h3>      <span>Growth Machine</span><br>      <span>Headquarters: New York, NY</span><br>        <a href='https://yourgrowthmachine.com/careers/' rel='nofollow'>https://yourgrowthmachine.com/careers/</a>    </h3>  </div>    </div>  <div>    <div>Growth Machine is expanding quickly, and we need your help to lead our content marketing projects.</div><div><br></div><div>We’re looking to hire a content project manager to help us with our growing client base. As the first full-time employee of the company, you’d work directly with our founder (<a href='https://www.nateliason.com/' rel='nofollow'>Nat Eliason</a>) to refine the systems that allow us to help our clients grow their blogs to hundreds of thousands of monthly visitors.</div><div><br></div><div><span>Specifically, your responsibilities will include</span>:</div><ul><li>Coordinating the planning, production, and promotion for content across clients</li><li>Working with a team of freelance writers to write some of the best articles on the Internet</li><li>Designing systems to produce high-quality content on a consistent schedule</li><li>Setting and tracking client growth goals</li><li>Reporting weekly results to clients</li><li>Working with clients to design their brand’s voice for content</li><li>Shaping the Growth Machine project management role as our first full-time hire</li></ul><div><span><br></span></div><div><span>Who you are</span>:</div><ul><li>You’re great at working independently, setting your own goals and hitting them.</li><li>You have a systems-first approach to work, focusing on designing repeatable methods instead of just completing tasks.</li><li>You’re a confident writer.</li><li>You’ve successfully grown your own or a company blog.</li><li>You’ve managed a team of writers or other content producers.</li><li>You’re punctual with your goals—deadlines are not options to you.</li></ul><div><span><br></span></div><div><span>Benefits of working with us:</span></div><ul><li>We’re a 100% remote company, so you can work anywhere from Pittsburgh to Phuket.</li><li>You’ll earn a salary + scaling bonus as you improve our project management systems.</li><li>By directing content for anywhere from five to a dozen blogs, you’ll improve your marketing skills faster than you can anywhere else.</li><li>We’re growing rapidly, and you’ll have ample opportunities for taking on bigger leadership roles.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Fill out the form at <a href='https://yourgrowthmachine.com/careers/content-marketing-project-manager/' rel='nofollow'>https://yourgrowthmachine.com/careers/content-marketing-project-manager/</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 20, 2017 9:44:15 PM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "0cYejTF6TS-wcwz8vy7qVw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/161012/director-of-engineering-python-docker-graphql-finetune-learning?a=RZTY4SvabVC",
    "title": "Director of Engineering (Python, Docker, GraphQL, Ansible, AWS) at FineTune Learning (Boston, MA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Assessment, Education Technology, Human Resources</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>FineTune is seeking a director of engineering to lead a team of 13 developers. The director of engineering will be the expert in residence around infrastructure scaling, python, docker, database performance and microservices. S/he must have experience working with at least 3 production released software projects/products. S/he should be hands on tech and comfortable solving complex system problems while making sure software team understands clearly what they are building, while refactoring/architecting new and existing services to scale to support 5 million users.</p><p><br> S/he should also be comfortable interacting with customer and provide guidance on the technical feasibility and scope of engineering/rearchitecting needed to solve problems and deliver features. <br> If the director of engineering desires, one could also manage, mentor, performance review engineers in the team. Director of engineering will also work with 3 tech leads and QA team to find best ways to increase the performance of the development team and enhance software quality and development speed.</p><p>S/he will interface with CTO to continuously drive innovation and new product development while promoting and advancing the scalability and modularization of current platform we are working on with Collegeboard. S/he will be essential member of the leadership team to drive company vision and mission while scaling the software for larger audience.</p>                    </div>                            <h2>                About FineTune Learning            </h2>            <div><p>We are working on a variety of projects from componentizing and enhancing front end reactjs to optimize user experience and reusability of components.&nbsp; We are constantly collecting data on users to help recommend better resources for their learning.&nbsp; We build interesting but simple dashboards that may help teachers become more data driven.&nbsp; We work on behavioral experiments via randomized control trial through our software. Our backend is mostly python/sqlalchemy and supports graphql and diverse set of databases depending on the application.&nbsp; Continuous integration and continuous deployment are next in our pipeline. We are facing challenges in scalability and automation which we plan to tackle in 2018 and refactor code to&nbsp;increase the software performance and support 5 million users.&nbsp; We work with our design team to make this experience engaging&nbsp;for effective learning. We practice agile and scrum and&nbsp;strive to continuously improve.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Responsible time off                            </div>                            <div>                                 100% remote work/work from anywhere                            </div>                            <div>                                 401k                            </div>                            <div>                                 Health/dental                            </div>                            <div>                                 Profit sharing                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 18, 2017 10:29:16 PM",
    "tags": [
      "TECH2_reactjs",
      "TECH2_react-apollo",
      "TECH2_graphql",
      "TITLE1_manager",
      "REMOTE1_100",
      "TECH2_redux",
      "TZ_unknown",
      "TECH2_responsive"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "graphql",
      "react-apollo",
      "reactjs",
      "redux",
      "responsive"
    ]
  },
  {
    "id": "IwvmuR4TRymeQo49t0McOQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8145-sales-executive",
    "title": "Sales Executive",
    "content": "Sales Executive - Jobmote<div><div><h2>Sales Executive</h2><h5>Productive Power</h5></div></div><div><div><div><div><div><p>Are you a self-motivated person with a strong sales background? Do you have a passion for technology and productivity? If so, you could be a perfect sales executive for Productive Power.</p><p>Productive Power helps professionals maximize their productivity through digital training that transforms the way they work. Our Digital Productivity Essentials™ program teaches participants a series of innovative, easy-to-implement best practices that significantly increase organization and productivity. Participants&nbsp;report life-changing results, including the ability to accomplish more, beat deadlines and enjoy peace of mind in and out of the office.</p><p>We are looking for personable and tenacious sales professionals to generate clients across the country. Because our service genuinely solves a need for prospects, they must be effective using a consultative sales approach. Sales executives will follow up on incoming leads, attend&nbsp;networking events, reach&nbsp;out to&nbsp;existing networks and conduct&nbsp;in-person and online presentations. They will work from home and travel locally on a weekly basis.</p><p><strong>Requirements</strong> </p><ul><li>Bachelor's degree<br></li><li>Successful sales track record<br></li><li>Very adept with technology<br></li><li>Ability to interact comfortably with executives<br></li><li>Exceptional communication skills<br></li><li>Strong organizational skills<br></li><li>Proficient in Microsoft Outlook<br></li><li>Sincere interest in helping people<br></li><li>Ability to work remotely and travel locally<br></li><li>Live in the United States<br></li><li>Be able to commute to a major city within 30 minutes<br></li></ul><p><strong>Compensation Plan</strong> </p><ul><li>Guaranteed $50,000 base salary<br></li><li>Uncapped 10% commission<br></li><li>Paid time off (vacation, personal and sick)<br></li><li>Paid holidays<br></li><li>Employer funded Health Reimbursement Account (HRA)<br></li><li>401(k) plan with company match<br></li></ul><p>Join our growing team of professionals selling an exciting new service with vast market potential. Reap the financial and intrinsic rewards resulting from selling a service that helps professionals increase the quality of their lives.</p><p>In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Nov 18, 2017 3:00:27 PM",
    "tags": [
      "REMOTE1_50",
      "TITLE1_manager",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "TsjepgdRQPuwuPdT9FymTg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/advancing-women-executives/jobs/53765-regional-director",
    "title": "Regional Director",
    "content": "<div><h2>Regional Director at Advancing Women Executives </h2><div>San Francisco, San Francisco Bay Area, Silicon Valley, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$90K–$100K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>What does it feel like working for a company where clients every day say to you, &quot;Thank you for doing what you do!&quot;?<br>What does it feel like working for a company where you're impacting positive change in the world?<br>What does it feel like working for a company where you are constantly learning?<br>What does it feel like working for a company where you're stimulated intellectually by your peers while, at the same time, laughing and not taking yourself too seriously?<br>It feels great and this is what working at AWE feels like every day.</p><p>Advancing Women Executives (AWE) is a start-up with the mission to accelerate the careers of women in business to improve the global economy, by providing VP-level and above corporate executive women the opportunity to build cross-functional and cross-industry relationships in a safe, locally-based environment. AWE membership services include events, training, and executive coaching. AWE currently has memberships in San Francisco, Los Angeles, Silicon Valley, New York and Chicago. AWE is based in Los Angeles, CA, but has staff in all other membership cities. <br> <br>AWE is seeking a highly qualified Regional Director to join our team to be based in the Bay Area and report to the Founder and CEO.  The primary responsibility of this role is to sell AWE services to VP-level and above corporate executive women for the purposes of furthering AWE’s mission and generating business revenue.<br> <br>Responsibilities:<br>Prospecting and closing new AWE memberships in San Francisco, Silicon Valley, and  Los Angeles;<br>Network and build relationships with the top influencers in corporate America, private equity, venture capital and service industries;<br>Lead and develop a team of sales and client relations associates; <br>Executing a sales methodology with an average sales cycle of 6 weeks or less;<br>Partner with Associate Director of Member Relations to ensure AWE leaders are active and engaged in membership through a consultative sales approach;<br>Sales forecasting and new business pipeline management; <br>Strategize about sales and client relations process and services;<br>Conduct Training Sessions across California locations;<br>Host bi-annual events and monthly dinners with AWE leaders.</p><p>Qualifications<br> A successful candidate will possess:</p><p>True belief in AWE’s mission to significantly improve the number of women in senior management and on board seats;<br>The spirit to “Be Bold” and fearless in representing AWE, even during its start-up phase; <br>Spirit of generosity and service;<br>Intellectual curiosity and drive to problem solve;<br>Natural ability to connect with people and to be a connector for people; <br>6+ years transactional sales experience with success negotiating and closing business;<br>Exceptional ability to immediately establish one's credibility with senior executives;<br>Willingness to work outside strict job description parameters, thinking creatively about how to provide the highest level of customer/member service and overall business growth;<br>Excellent written and oral communication skills; <br>Strong public speaking skills and experience presenting to large groups;<br>Great sense of humor;<br>Excellent meeting facilitation skills; ability to conduct 100% phone-based meetings;<br>Solid understanding of business concepts and ability to quickly learn content terrain;<br>Ability to diagnose prospect needs and identify relevant resources;<br>Ability to meet personal and team weekly, monthly, quarterly, and annual financial goals;<br>Solid understanding of business concepts &amp; dynamics for large national and international corporations;<br>Superior time management, detail orientation and organization skills;<br>Bachelor's Degree required, MBA preferred.</p><p>AWE is an Equal Opportunity Employer.</p></div>",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 10:19:47 PM",
    "tags": [
      "San Francisco",
      "Remote OK",
      "Sales",
      "TITLE1_manager",
      "Full Time",
      "San Francisco Bay Area",
      "REMOTE1_100",
      "Silicon Valley",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "Ku0Cv2WGQqqaCI9reMHJmA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159923/director-engineering-marketplace-creative-market?a=RDg4Gmjbjl6",
    "title": "Director, Engineering (Marketplace) at Creative Market (San Francisco, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Manager</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Creative Services, Marketplace</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>As a <strong>Director, Engineering</strong> for our Marketplace team, you will be responsible for building and mentoring a group of motivated, talented engineers whose work ships to millions of people. You'll work closely with engineering leadership, as well as product managers and other stakeholders, to ensure our team ships great work on schedule.</p><p><strong>Responsibilities</strong></p><ul><li>Build a growing team of full-stack, front-end and back-end engineers.</li><li>Recruit talented engineers to build your team.</li><li>Partner with cross-functional team leaders to understand their engineering needs.</li><li>Consult on the design and timelines of key projects with product managers, engineers, and functional leads.</li><li>Work directly with Creative Market's engineering leadership to craft scalable processes, like mentorship-focused code reviews.</li><li>Coach and mentor engineers by helping them advance their skills and move forward in their careers.</li></ul><p><strong>About You</strong></p><ul><li>You are a direct, empathetic communicator.</li><li>You lead by example.</li><li>You have experience working with remote teams (close to your time zone).</li><li>You love autonomy, but know when to surface issues and communicate openly.</li><li>You think in terms of architecture and drive conversations toward decisions.</li><li>You trust the team to solve things.</li><li>You build partnerships and trust with stakeholders.</li><li>You work individually but look through the lens of the team and process.</li></ul>                    </div>                            <h2>                About Creative Market            </h2>            <div><p><strong>Help independent creators make a living doing what they love!</strong>&nbsp;Every day, thousands of customers use&nbsp;<a href='https://creativemarket.com/' rel='nofollow'>Creative Market</a>&nbsp;to bring their creative projects to life with ready-to-use design content from independent creators around the world.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive compensation                            </div>                            <div>                                 Meaningful equity options                            </div>                            <div>                                 401(k) plan                            </div>                            <div>                                 Medical, dental, and vision benefits                            </div>                            <div>                                 Generous paid time off                            </div>                            <div>                                 New workstation                            </div>                            <div>                                 Continued career training and education                            </div>                            <div>                                 Paid volunteer time and matched donations                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``remot 16W timezon",
      "TECH2_php",
      "TECH2_amazon-web-services",
      "TITLE1_manager",
      "TECH2_vue.js",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "TECH2_mysql"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "mysql",
      "php",
      "vue.js"
    ]
  },
  {
    "id": "otCwgi0CTiOjKWBLi431zg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159922/director-engineering-marketplace-creative-market?a=RDeMKPLO8KY",
    "title": "Director, Engineering (Marketplace) at Creative Market (San Francisco, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Manager</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Creative Services, Marketplace</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>As a <strong>Director, Engineering</strong> for our Marketplace team, you will be responsible for building and mentoring a group of motivated, talented engineers whose work ships to millions of people. You'll work closely with engineering leadership, as well as product managers and other stakeholders, to ensure our team ships great work on schedule.</p><p><strong>Responsibilities</strong></p><ul><li>Build a growing team of full-stack, front-end and back-end engineers.</li><li>Recruit talented engineers to build your team.</li><li>Partner with cross-functional team leaders to understand their engineering needs.</li><li>Consult on the design and timelines of key projects with product managers, engineers, and functional leads.</li><li>Work directly with Creative Market's engineering leadership to craft scalable processes, like mentorship-focused code reviews.</li><li>Coach and mentor engineers by helping them advance their skills and move forward in their careers.</li></ul><p><strong>About You</strong></p><ul><li>You are a direct, empathetic communicator.</li><li>You lead by example.</li><li>You have experience working with remote teams (close to your time zone).</li><li>You love autonomy, but know when to surface issues and communicate openly.</li><li>You think in terms of architecture and drive conversations toward decisions.</li><li>You trust the team to solve things.</li><li>You build partnerships and trust with stakeholders.</li><li>You work individually but look through the lens of the team and process.</li></ul><p><strong>We're Offering</strong></p><ul><li>Competitive compensation</li><li>Meaningful equity</li><li>401(k) plan</li><li>Medical, dental, and vision benefits</li><li>Generous paid time off</li><li>New workstation</li><li>Company-wide vacation from Christmas Eve to New Year's Day</li><li>Dog-friendly office</li></ul>                    </div>                            <h2>                About Creative Market            </h2>            <div><strong>Help independent creators make a living doing what they love!</strong>&nbsp;Every day, thousands of customers use&nbsp;<a href='https://creativemarket.com/' rel='nofollow'>Creative Market</a>&nbsp;to bring their creative projects to life with ready-to-use design content from independent creators around the world.            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive compensation                            </div>                            <div>                                 Meaningful equity options                            </div>                            <div>                                 401(k) plan                            </div>                            <div>                                 Medical, dental, and vision benefits                            </div>                            <div>                                 Generous paid time off                            </div>                            <div>                                 New workstation                            </div>                            <div>                                 Continued career training and education                            </div>                            <div>                                 Paid volunteer time and matched donations                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``remot 16W timezon",
      "TECH2_php",
      "TECH2_amazon-web-services",
      "TITLE1_manager",
      "TECH2_vue.js",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "TECH2_mysql"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "mysql",
      "php",
      "vue.js"
    ]
  },
  {
    "id": "CG6QQi3rTC-gMNtK_moxAA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/160789/project-management-engineer-european-timezone-platformsh?a=RVguaQsP7YQ",
    "title": "Project Management Engineer - European timezone at Platform.sh () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Continuous Delivery, PaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong><strong>Job description:</strong></strong></p><p>Platform.sh is a groundbreaking hosting and development tool for web applications. We’re a European VC-Backed startup with a host of blue-chip Enterprise clients and a string of awards and grants (including €2m from the EU Horizon 2020 program). To reinforce our technical prowess, we are looking to grow our engineering team with an engineer that also enjoys project management. If you’re looking for an exciting, high-growth opportunity with an award-winning, cutting-edge company, this could be just the job for you</p><p>For its groundbreaking PaaS solution <a href='https://platform.sh/' rel='nofollow'>https://platform.sh</a> is looking for a Project Manager with a taste for Go, good Linux system understanding, and a real hunger for the challenges of building robust, distributed systems.</p><p>Platform.sh is a PaaS shrouded in a lot of black magic (we can consistently clone a whole running cluster, with its state, databases, indexes in a matter of seconds). We want to get this down to the hundreds of milliseconds domain. Interested? There is more...</p><p>Our external API is pure Hypermedia REST + oAuth on top of Pyramid. It mechanizes the Git layer and needs more features.</p><p>We can consistently generate from the same manifest a Docker container, an LXC one, or VM disk images (AWS, Azure, OpenStack), we want more targets.</p><p>We probably have the highest industry container density. We need to get it higher.</p><p>We support any Python, Ruby, NodeJS or PHP application, it’s time to roll-out Java and .NET, and Elixir, of course Elixir.</p><p>We need to have more auto-healing on the high-availability clusters. We need more performance out of our multi-protocol ssh proxy. We need work on our Ceph Implementation; We need to get the Debian package generation streamlined and faster. We need… great ideas on how to make Platform.sh even better. Interested? Join us!</p><p><strong>Mission :</strong></p><p>Directly reporting to our VP of Engineering, your roles will include:</p><ul><li>Engineering teams coordination for the flawless execution of ambitious, time constrained development projects</li></ul><ul><li>Work with CPO and CTO to ensure alignment between roadmap goals and short-term goals. Communication with all company stakeholders to give an incredibly clear project of both &nbsp;advancement and roadblocks</li></ul><ul><li>Backlog grooming. Making it pretty. Actionable. Sublime</li></ul><ul><li>Sprint planning, estimation, critical path analysis</li></ul><ul><li>Knowing all the things ; where each skeleton is buried</li></ul><ul><li>Making projects delivery predictable. Measurable. Finding impediments and helping remove them</li></ul><ul><li>Managing with brio changes to backlog. Informing stakeholders when an injected task will cause some other story to be rejected from current sprint or be late</li></ul><ul><li>Project scopes and objectives, involving all relevant stakeholders and ensuring technical feasibility</li></ul><ul><li>Review resource availability and allocation</li></ul><ul><li>Tooling around project plan and progress tracking</li></ul><ul><li>Reporting and escalation when necessary</li></ul><ul><li>Quality management. Managing the “Definition of Done” hand in hand with QA</li></ul><ul><li>Delivery management (release planning, QA follow-up) coordination with the Partner Delivery Manager</li></ul><p><strong>Must have :</strong></p><p>The ideal candidate:</p><ul><li>Is a true software engineer with enough low level chops. They know their system. Uses Linux. Codes. This is not a job for anyone who does not like coding. It is not a coding job. But extreme empathy with developers is absolutely required. So the candidate should be one</li></ul><ul><li>Is focused. Organized. Mature. Handles pressure. Handles multi-tasking. (Don’t worry we are nice and try to make a really nice stress-free working environment. But when the PM is panicky... well this is when stress-free disappears: PM should be the rock)</li></ul><ul><li>Has proven successful experience in project management</li></ul><ul><li>Has comprehensive knowledge of agile development. They know they Kanban from their Scrum. Know thy artifacts PM</li></ul><ul><li>Has had exposure to cloud services (AWS, Azure etc..)</li></ul><ul><li>Understands how an OS works, knows networking, how git works, and the constraints of a distributed system</li></ul><ul><li>Is proficient in at least one modern programming language (and proficient in troll deflection about what “modern programming languages” are and are not)</li></ul><p><strong>Nice to have :</strong></p><ul><li>Knowledge of some PHP stuff. Magento, Symfony, Drupal, eZ Platform, or Typo3. No expertise required</li></ul><ul><li>Mad Jira skillz</li></ul><ul><li>Public speaking experience</li></ul><ul><li>Proficiency in Rust or Ponylang grants you bonus points</li></ul>                    </div>                            <h2>                About Platform.sh            </h2>            <div><p>We’re a venture capital funded, award-winning team of hard-core hackers who want to revolutionize the way that developers and agencies build and deploy web applications. We’re mostly distributed, but we meet up daily in cyberspace, and occasionally in Paris, France. &nbsp;We value enthusiasm, team spirit, and a constant desire to expand personal knowledge and contribute to the community. We provide a multi-cultural, casual and balanced work environment. We recently helped launch&nbsp;Magento Enterprise Cloud Edition and the Sensio Cloud on Platform.sh technology.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from home, wherever you are                            </div>                            <div>                                 Safe and friendly working environment                            </div>                            <div>                                 Stock options for everyone                            </div>                            <div>                                 Rest and recovery are essential to health and happiness; we get that                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "TECH2_python",
      "DBG:surround``OR(europ, european, europeanunion) 3W OR(timezon,time)",
      "TECH2_amazon-web-services",
      "TITLE1_manager",
      "TECH2_project-management",
      "TZ_Europe",
      "TECH2_linux",
      "REMOTE1_100",
      "DBG:surround``work 2W from 2W wherev"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "linux",
      "project-management",
      "python"
    ]
  },
  {
    "id": "wIVzTG7ATcmRZR2HUwvtsQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/spacetimepartners/jobs/97172-head-of-product",
    "title": "Head of Product",
    "content": "<div><h2>Head of Product at Spacetime Partners</h2><div>Monterrey, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Web Development, User Interface Design, Linux</div><div>Compensation</div><div>$10K–$55K<br>1.0%–5.0%</div></div><h3>Job Description</h3><div><p>Spacetime Partners is looking for a head of product to lead the development of our business services product portfolio; continue developing new and improved features as a result of customer feedback.</p><p>+Highly independent and motivated person<br>+100% client focus to develop and maintain great product line<br>+Ability to lead product management team<br>+Deep knowledge of web based business services industry including business intelligence, communications, productivity and collaboration tools<br>+Proficiency in design &amp; engineering of software &amp; hardware<br>+Ability to respond to customers and loop feedback to engineering and design teams</p><p>RESPONSIBILITIES<br>+New product development<br>+Strategic planning for business services line of products<br>+Analyze current competition and deploy relevant strategies<br>+Coordinate with engineering and design teams to achieve top performance</p></div>",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 1:05:18 PM",
    "tags": [
      "User Interface Design",
      "Remote OK",
      "Product Manager",
      "Linux",
      "TITLE1_manager",
      "Full Time",
      "REMOTE1_100",
      "TZ_unknown",
      "Monterrey",
      "Web Development"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "Y5xzYb0eRkG4wjseUWOm1w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8111-director-of-sales",
    "title": "Director of Sales",
    "content": "Director of Sales - Jobmote<div><div><h2>Director of Sales</h2><h5>Pressable</h5></div></div><div><div><div><div><div><p>Pressable, a leading provider of WordPress hosting, is looking for&nbsp;a seasoned sales leader to build a high-performance sales and account management team.</p><p>This position is salary + bonus, with incredible potential.</p><p><strong>We are looking for these qualities:</strong></p><ul><li>Prior experience managing a sales and account management team</li><li>A track record of exceeding quotas</li><li>Knowledge of SaaS and, preferably, WordPress hosting</li><li>Familiarity with data analysts and reporting</li><li>Exceptional written and oral communication skill</li><li>Strong interpersonal skills</li><li>Self directed with strong organizational skills</li><li>Ability to balance the responsibilities of leadership with multiple hands-on tasks</li></ul><p><strong>Day-to-day responsibilities include:</strong></p><ul><li>Managing Pressable's sales and account management team, ensuring quotas are exceeded</li><li>Reporting sales activities to company management</li><li>Working closely with Pressable's leadership to align products with sales opportunities</li><li>Creating a sales on-boarding experience</li><li>Hiring and training salespeople</li><li>Creating Pressable's sales playbook</li><li>Leading our migration from Capsule CRM to Pipedrive or Salesforce</li><li>Integrating Pressable's CRM with a lead generation service</li><li>Growing Pressable's Affiliate (in ShareASale) and Partner programs</li><li>Coordinating events, e.g. WordCamps</li></ul><p><strong>Our benefits our great. You can expect:</strong></p><ul><li>Flexibility. Our team is remote, meaning you can work from anywhere you want as long as you have an internet connection.</li><li>Medical, dental, vision, and life insurance for less than $10. We pay 99% of premiums for you and your family.</li><li>An annual company retreat.</li><li>401(k) matching. We match your 401(k) contributions up to 6% of your salary.</li><li>A generous time off policy. We want our team members to enjoy a phenomenal work–life balance.</li></ul></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Nov 16, 2017 11:00:24 PM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "Zrout2K-SK6GR03n0R9jaw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5771-director-of-sales",
    "title": "Pressable: Director of Sales",
    "content": "<div>  <div>    <h2>Director of Sales</h2>      <h4>Posted Nov 16</h4>    <h3>      <span>Pressable</span><br>      <span>Headquarters: San Antonio</span><br>        <a href='https://pressable.com/careers/director-of-sales/' rel='nofollow'>https://pressable.com/careers/director-of-sales/</a>    </h3>  </div>    </div>  <div>    <div>Pressable, a leading provider of WordPress hosting, is looking for&nbsp;a seasoned sales leader to build a high-performance sales and account management team.</div><div><br></div><div>This position is salary + bonus, with incredible potential.</div><div><br></div><div><strong>We are looking for these qualities:</strong></div><div><br></div><ul><li>Prior experience managing a sales and account management team</li><li>A track record of exceeding quotas</li><li>Knowledge of SaaS and, preferably, WordPress hosting</li><li>Familiarity with data analysts and reporting</li><li>Exceptional written and oral communication skill</li><li>Strong interpersonal skills</li><li>Self directed with strong organizational skills</li><li>Ability to balance the responsibilities of leadership with multiple hands-on tasks</li></ul><div><strong>Day-to-day responsibilities include:</strong></div><div><br></div><ul><li>Managing Pressable's sales and account management team, ensuring quotas are exceeded</li><li>Reporting sales activities to company management</li><li>Working closely with Pressable's leadership to align products with sales opportunities</li><li>Creating a sales on-boarding experience</li><li>Hiring and training salespeople</li><li>Creating Pressable's sales playbook</li><li>Leading our migration from Capsule CRM to Pipedrive or Salesforce</li><li>Integrating Pressable's CRM with a lead generation service</li><li>Growing Pressable's Affiliate (in ShareASale) and Partner programs</li><li>Coordinating events, e.g. WordCamps</li></ul><div><strong>Our benefits our great. You can expect:</strong></div><div><br></div><ul><li>Flexibility. Our team is remote, meaning you can work from anywhere you want as long as you have an internet connection.</li><li>Medical, dental, vision, and life insurance for less than $10. We pay 99% of premiums for you and your family.</li><li>An annual company retreat.</li><li>401(k) matching. We match your 401(k) contributions up to 6% of your salary.</li><li>A generous time off policy. We want our team members to enjoy a phenomenal work–life balance.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://pressable.com/careers/apply/?position=director_sales' rel='nofollow'>https://pressable.com/careers/apply/?position=director_sales</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 16, 2017 10:59:04 PM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "yIOAMSqZRX2SWlXQwXVmKA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/63444/head-of-growth-at-find-my-larp/",
    "title": "Head of Growth",
    "content": "About Find My Larp<br /><br />Find My Larp is a global online marketplace for Live Action Role Playing (Larp) events. <br /><br />The global Larp event market is estimated to be worth £500m per year in ticket sales alone, and we are on a mission to create the first Marketplace of it’s kind for this industry. We launched our MVP in late October 2017 and have already sold tickets and got early traction. We’ve also managed to attracted a good number of users on both the supply & demand side. <br /><br />Our small founding team is made of Larp industry experts and experienced tech industry founders. The team is spread out between London and Stockholm and we mostly work remotely.  <br /><br />Learn more at www.findmylarp.com<br /><br />Role Objectives<br /><br />We are looking for a Head of Growth who will be responsible for developing and executing marketing & business development plans. In practice, the role will be a hybrid of a marketer and business development. <br /><br />The Head of Growth will, first and foremost, be a growth hacker, able to think strategically about approaches, methodologies, indicators, and metrics, and define the relevant growth KPIs, on the one hand; and, on the other, personally deploying all available tools and techniques, using whatever tactics are suitable – and with minimal budget – to drive product adoption and usage. This will include ongoing experimentation and continuous optimisation through testing and tuning.<br /><br />Effective growth hacking will necessitate a deep understanding of the drivers of engagement and virality within products, and the Head of Growth will work closely with the rest of the team to optimise the end-to-end user/customer experience.<br /><br />The role will also be responsible for the management and utilisation of user/customer data across all touch points, ensuring that the right infrastructure, systems and people are in place to support effective data-driven decision making. <br />The role is absolutely critical for Find My Larp – and you will be able to significantly influence whether or not Find My Larp is able to reach it’s full potential in the quickest time possible.. This is a career-defining opportunity to; help build a brand new business from the ground up in an industry which is on the cusp of becoming mainstream and hugely popular. <br /><br />Profile Overview<br /><br />The ideal candidate will be…<br /><br />…an experienced growth hacker with a stellar track record of driving exponential growth in usage and engagement, across multiple markets, for a new internet businesses.<br /><br />…intelligent, creative, bold and daring, but at the same time highly data-driven and analytical. They will be highly commercial, with a good understanding of growth metrics and KPIs, and strong instincts for where the greatest gains, at the fastest speed, may be made. They will be an expert in the use of social media and features to drive virality and growth.<br /><br />…equally comfortable with high-level, strategic thinking, and hands-on implementation, with close attention to detail. He or she will have a strong bias to action, able to work at a very fast pace, and comfortable making quick decisions.<br /><br />…naturally intellectually curious and unafraid to take risks, willing to try non-traditional approaches to achieve goals relish new challenges and learning new things; and enjoy conducting experiments and testing hypotheses.<br /><br />…a bold, ambitious and creative individual who genuinely wants to challenge the status quo. They will have no tolerance for mediocrity and will constantly be raising the bar. They will have a collaborative, open style that fosters participation and widespread contribution of ideas.<br /><br />Summary of Required Experience & Attributes:<br /><br />GROWTH MARKETING EXPERIENCE – Will be an accomplished and experienced growth hacker, with a track record of driving user/customer growth and engagement for online businesses. It is expected that this person will be hands-on familiar with paid search and social marketing (Google & Facebook in particular).<br /><br />PRODUCT SENSIBILITY / APPRECIATION FOR ENGAGING CONSUMER PRODUCTS – Will have a good understanding of UX, and experience of working hand-in glove with product management. Will understand drivers of engagement and virality.<br /><br />BOTH STRATEGIC AND EXECUTION-FOCUSED – Will be able to think ‘big picture’ and take a strategic perspective, but have a strong bias to action, with a hands-on, implementation-oriented approach.<br /><br />RELATIONSHIP AND COMMUNICATION SKILLS – Will be capable of operating successfully with small teams and able to scale them as needed. Will be an inspiring and engaging communicator and colleague, able to build positive working relationships with ease.<br /><br />CULTURE FIT – Entrepreneurial, passionate, friendly, low-ego, collaborative, fast-paced, transparent, creative, challenging, high integrity, down to earth.<br /><br />Benefits<br /><br />Find My Larp is a very early stage (pre-funding) start up and as such the perks on offer are limited. The biggest benefit we can current offer is opportunity to take a fledgling company (with huge potential) to it’s full potential. <br /><br />As the Head of Growth you will have the ability to shape the direction of the company and if successful will reap the rewards along the way. For the right candidate we can offer an attractive equity package of between 10-20% as well as performance related bonuses and profit sharing opportunities. <br /><br />Flexible working conditions come as part of the package, so you can pick when and where you work from. <br /><br /><br />Application Method<br /><br />Send us an email (via work-in-startups) with your CV and a short letter outlining why you feel you're the right person for the job and will get back to you within 3 business days. <br /><br />*We are not working with any staffing firms or agencies and will not be accepting resumes from them.<br />",
    "urlFetchPending": false,
    "published": "Nov 15, 2017 3:38:20 PM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``2N(team, spread, out)"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "-rWf7_-nSJaOiJmp0txgog",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/open-health-network/jobs/140140-technical-senior-project-manager",
    "title": "Technical Senior Project Manager",
    "content": "<div><h2>Technical Senior Project Manager at Open Health Network</h2><div>Earth, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Project Management, Technical Project Management, Account Management</div><div>Compensation</div><div>$90K–$120K<br>0.1%–0.5%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>We need an experienced technical project manager to manage deployments with our F100 customers. Strong client management skills, technical expertise, super organizational skills required.</p></div>",
    "urlFetchPending": false,
    "published": "Nov 9, 2017 1:09:37 PM",
    "tags": [
      "Earth",
      "Account Manager",
      "Technical Project Management",
      "Remote OK",
      "Project Management",
      "TITLE1_manager",
      "Full Time",
      "Project Manager",
      "Account Management",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "J81GDg0qR4S5m-iovWOtyA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/open-health-network/jobs/37677-director-of-sales",
    "title": "Director of Sales",
    "content": "<div><h2>Director of Sales at Open Health Network</h2><div>Sunnyvale, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Business Development, Healthcare Expertise, Deal Structuring, Health Care Information Technology, Sales and Marketing, Closing Deals, Healthcare, Deal Execution, Clinical Trials</div><div>Compensation</div><div>$120K–$160K<br>1.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Experienced sales executive with over 10 years of B2B sales in Healthcare space. Proven track record of closing deals. Connections to C-level executives in Pharma, Medical, Advocacy and other healthcare organizations.</p></div>",
    "urlFetchPending": false,
    "published": "Nov 9, 2017 1:09:37 PM",
    "tags": [
      "Sales and Marketing",
      "Sunnyvale",
      "TITLE1_manager",
      "Full Time",
      "TZ_unknown",
      "Clinical Trials",
      "Remote OK",
      "Sales",
      "Health Care Information Technology",
      "Healthcare Expertise",
      "Healthcare",
      "Deal Structuring",
      "REMOTE1_100",
      "Business Development",
      "Deal Execution",
      "Closing Deals"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "iTuxM-EjQgqmQNbbsoiQUw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3974-senior-engineering-manager-npm",
    "title": "Senior Engineering Manager @ npm",
    "content": "<h2>              Senior Engineering Manager<small> @ npm</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-11-09 03:47</p></dd>          <dt><span>Description</span></dt>          <dd><p>npm is the world's largest software repository, with over 10 million users and over 13 billion downloads every month. Our engineering team builds software and services that have become essential to modern JavaScript development, and are used by every company that builds websites.</p><p>We are looking for someone who has worked with teams at startups before. You'll make sure your team members are supported, and aid communication both within your team and with other teams. You'll understand the company's business goals and pro-actively align your team's tasks and priorities to match. You'll have experience hiring engineers, and helping them grow in experience and responsibility as a company evolves.</p><p>You have a background as an experienced engineer who exemplifies our engineering culture: flexible, pragmatic, communicative, and empathetic. You won't be writing production code, but we'll expect you to understand the software your team is building to a degree where you can meaningfully assist in architectural and implementation decisions, both by drawing on your own experience and providing the broader perspective on company goals that your position will give you.</p><p>Leaders at npm are evaluated based on the success of their team.  Your success in this role means pushing authority to information, mentoring your team to continually improve their skill, building trust for each other and for their colleagues, and adapting processes as necessary to execute on our mission.  We believe that having to tell people exactly what to do indicates a failure mode.</p><p>Our team is distributed across locations and timezones, so you must be comfortable with remote work and asynchronous communication patterns. Slack is the hub of all of our workflows, so your skill with textual communication is essential.</p><p>npm is an engineering-centric company and its engineering practices and culture are important to us. In this position you’ll have a chance to influence that culture and help us live up to our values. We emphasize collaboration and thoughtful iteration on our processes as well as our code. We feel that people do their best work when in emotionally safe environments and in their best physical health, and our management team is tasked with creating the culture that makes this possible. Our wish is that we can enable everyone at npm to do the best work of their careers thus far, and set them up to do even better work after npm.</p><p>The work your team will be doing is vital to all of npm’s product plans. It will affect the daily work of millions of JavaScript developers worldwide. If you want to lead an engineering team at the company that has revolutionized web development, this is the job for you.</p><p><strong><em>We will be accepting applicants for this position through Monday, Nov 27, 2017.</em></strong></p><h5>About working here</h5><p>You will most likely be working out of our headquarters in Oakland, California. While many of our team members are spread out around the globe, we will have a preference for local applicants, as this job will be easier with direct real-time communication with a majority of our team. We are open to considering experienced remote candidates, however! We cannot currently sponsor new work visas other than TN-1s, but we can transfer existing H-1Bs.</p><p>npm is not a typical early-stage “work hard/play hard” startup. We are responsible adults with diverse backgrounds and interests, who take our careers and our lives seriously. The best way to iterate towards success is by taking care of ourselves, our families, our users, and one another.</p><p>We aim for a sustainable approach to work and life, because that is the best way to maximize long-term speed, while retaining clarity of vision. Compassion is our strategy.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Nov 9, 2017 5:47:30 AM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``2N( OR(feasibl,OR(consid,consider),occas,possibl), remot)",
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "WGalDvWOSYG0ASo85MZP3A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62945",
    "title": "Senior Engineering Manager",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>npm is the world's largest software repository, with over 10 million users and over 13 billion downloads every month. Our engineering team builds software and services that have become essential to modern JavaScript development, and are used by every company that builds websites.<br><br>We are looking for someone who has worked with teams at startups before. You'll make sure your team members are supported, and aid communication both within your team and with other teams. You'll understand the company's business goals and pro-actively align your team's tasks and priorities to match. You'll have experience hiring engineers, and helping them grow in experience and responsibility as a company evolves.<br><br>You have a background as an experienced engineer who exemplifies our engineering culture: flexible, pragmatic, communicative, and empathetic. You won't be writing production code, but we'll expect you to understand the software your team is building to a degree where you can meaningfully assist in architectural and implementation decisions, both by drawing on your own experience and providing the broader perspective on company goals that your position will give you.<br><br>Leaders at npm are evaluated based on the success of their team. Your success in this role means pushing authority to information, mentoring your team to continually improve their skill, building trust for each other and for their colleagues, and adapting processes as necessary to execute on our mission. We believe that having to tell people exactly what to do indicates a failure mode.<br><br>Our team is distributed across locations and timezones, so you must be comfortable with remote work and asynchronous communication patterns. Slack is the hub of all of our workflows, so your skill with textual communication is essential.<br><br>npm is an engineering-centric company and its engineering practices and culture are important to us. In this position you’ll have a chance to influence that culture and help us live up to our values. We emphasize collaboration and thoughtful iteration on our processes as well as our code. We feel that people do their best work when in emotionally safe environments and in their best physical health, and our management team is tasked with creating the culture that makes this possible. Our wish is that we can enable everyone at npm to do the best work of their careers thus far, and set them up to do even better work after npm.<br><br>The work your team will be doing is vital to all of npm’s product plans. It will affect the daily work of millions of JavaScript developers worldwide. If you want to lead an engineering team at the company that has revolutionized web development, this is the job for you.<br><br><strong><em>We will be accepting applicants for this position through Monday, Nov 27, 2017.</em></strong><br><br></p><h4>About working here<br></h4><p><br>You will most likely be working out of our headquarters in Oakland, California. While many of our team members are spread out around the globe, we will have a preference for local applicants, as this job will be easier with direct real-time communication with a majority of our team. We are open to considering experienced remote candidates, however! We cannot currently sponsor new work visas other than TN-1s, but we can transfer existing H-1Bs.<br><br>npm is not a typical early-stage “work hard/play hard” startup. We are responsible adults with diverse backgrounds and interests, who take our careers and our lives seriously. The best way to iterate towards success is by taking care of ourselves, our families, our users, and one another.<br><br>We aim for a sustainable approach to work and life, because that is the best way to maximize long-term speed, while retaining clarity of vision. Compassion is our strategy.</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 9, 2017 5:47:30 AM",
    "tags": [
      "REMOTE1_50",
      "TITLE1_manager",
      "TZ_unknown",
      "DBG:surround``2N( OR(feasibl,OR(consid,consider),occas,possibl), remot)"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "QO95OdaeSy25gzLvhQQDdQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156126/ui-engineering-manager-leading-open-source-elastic?a=Qmj8KEracJa",
    "title": "UI Engineering Manager- Leading Open Source Company at Elastic () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Lead, Manager</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Data &amp; Analytics, Search, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>501-1k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>With Elastic's continued growth, we are looking for a talented, attentive Engineering Manager to propel and guide our team. Do you feel at home nurturing the success of dynamic, wold class engineers? Are you a top Software Engineering Managers who want to support and lead engineers on Kibana and X-Pack, robust tools which allow visual exploration, real-time data analysis in addition to other powerful features, all while working on core frontend applications? Than we want to meet you.</p><p>If you read this far and think, “that's me!” then you probably won't need to read any further and we should have a conversation. But if you are in any doubt the type of experiences we expect you to have then the following should help clarify;</p><p><em><strong>Please include a short note as to wire you are a fit for Elastic and this role </strong></em></p><p><strong>Kibana is the window into the Stack</strong></p><p>Kibana lets users visualize their Elasticsearch data and navigate the Elastic Stack, so they can do anything from learning why they’re getting paged at 2:00 a.m. to understanding the impact rain might have on their quarterly numbers. Kibana gives users the freedom to select the way they give craft to their data. And they don’t always have to know what they’re looking for. With its interactive visualizations, users start with one question and see where it leads them. Kibana core ships with the classics: histograms, line graphs, pie charts, sunbursts, and more. They demonstrate the full aggregation capabilities of Elasticsearch.</p><p><strong>Engineering Philosophy</strong></p><p>Engineering a highly complex distributed system that is easy to operate via elegantly designed APIs is a non-trivial effort. It requires solid software development skills, and more importantly, a sharp mind and the ability to think like a user. We also care deeply about giving you full ownership of what you’re working on. Our company fundamentally believes great minds achieve greatness when they are set free and are surrounded and challenged by their peers, which is clearly visible in our organization. At Elastic, we effectively don’t have a hierarchy to speak of. We feel that anyone needs to be in the position to comment on absolutely anything, regardless of his or her role within the company.</p><p><strong>What you will be doing:</strong></p><ul><li>Day to day management of 10-15 engineers</li><li>Hiring and recruiting of new staff</li><li>Performance management, reviews and quarterly feedback for the team</li><li>Expense management and approval</li><li>Vacation and time off management and approval</li><li>Project management and prioritization support for the team</li><li>Management of roadmaps and requirements against release targets</li></ul><p><strong>What you've done:</strong></p><ul><li>3+ years of software engineering management</li><li>Recent experience leading teams producing complex interactive web experiences</li><li>An engineering background with a B.S. or equivalent in a Software Engineering related domain</li><li>Experience leading distributed teams</li><li>Experience leading an open source product team</li><li>Familiarity with JavaScript and one or more UI framework: AngularJS, React, Node.js etc...</li></ul>                    </div>                            <h2>                About Elastic            </h2>            <div><p>Elastic is the world's leading software provider for making structured and unstructured data usable in real time for search, logging, security, and analytics use cases. Founded in 2012 by the people behind the Elasticsearch, Kibana, Beats, and Logstash open source projects, Elastic's global community has more than 80,000 members across 45 countries, and since its initial release. Elastic's products have achieved more than 100 million cumulative downloads. Today thousands of organizations, including Cisco, eBay, Dell, Goldman Sachs, Groupon, HP, Microsoft, Netflix, <em>The New York Times</em>, Uber, Verizon, Yelp, and Wikipedia, use the Elastic Stack, X-Pack, and Elastic Cloud to power mission-critical systems that drive new revenue opportunities and massive cost savings. Elastic is backed by more than $104 million in funding from Benchmark Capital, Index Ventures, and NEA; has headquarters in Amsterdam, the Netherlands, and Mountain View, California; and has over 400 employees in more than 30 countries around the world.</p><p><strong>Additional Information</strong></p><ul><li>Competitive pay and benefits</li><li>Stock options</li><li>Catered lunches, snacks, and beverages in most offices</li><li>An environment in which you can balance great work with a great life</li><li>Passionate people building great products</li><li>Employees with a wide variety of interests</li><li>Your age is only a number. It doesn't matter if you're just out of college or your children are; we need you for what you can do.</li></ul><p>Elastic is an Equal Employment employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status or any other basis protected by federal, state or local law, ordinance or regulation. Elastic also makes reasonable accommodations for disabled employees consistent with applicable law.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 401k Matching Up to 6 % in US and Pensions in some other countries                            </div>                            <div>                                 Health Care Insurance                            </div>                            <div>                                 Vacation Time Determined By Location                            </div>                            <div>                                 Lunch and Breakfast in Most Offices                            </div>                            <div>                                 100% Remote work possible                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_reactjs",
      "TECH2_user-interface",
      "TECH2_node.js",
      "DBG:surround``2W(100, remot)",
      "TITLE1_manager",
      "TECH2_javascript",
      "REMOTE1_100",
      "TZ_America_East",
      "TECH2_elasticsearch",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``2N(work, remot) 2N OR(option, avail, allow, abl, possibl, permit)"
    ],
    "tagsNames1": [
      "100% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "elasticsearch",
      "javascript",
      "node.js",
      "reactjs",
      "user-interface"
    ]
  },
  {
    "id": "NCLkgnWQRnyM9864K53keg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157505/director-of-cloud-operations-security-ems-software?a=QOYTdmJwAj6",
    "title": "Director of Cloud Operations & Security at EMS Software (Greenwood Village, CO) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Manager</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise Software</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span>EMS Software is looking for a Director of Cloud Ops &amp; Security who will aid us in the ongoing transformation of our product offering from an on-premise solution to one having a hybrid offering with a pure SaaS presence. </span></p><p><span>You will be at the center of a vital growth initiative.</span></p><p><span>You’ll join a company that serves 2,500 great organizations like Accenture, Deloitte, Goldman Sachs, Harvard and Yale University. Our customers have millions of people using our software to manage events, reserve spaces to meet, work and study; and to analyze and optimize their use of real estate.</span></p><p><span>Your role combines the operational responsibility for cloud ops and security, plus the strategic responsibility for enabling and encouraging our product and sales teams to promote our offering to existing and new customers alike. This is the perfect role for a technical leader who wants the high visibility of driving adoption</span></p><p><span>So, where will you focus your energy? </span></p><p><strong>Delivery</strong></p><ul><li><span>Drive customer satisfaction (DevOps + external) by providing world-class application availability and protection of customer data</span></li><li><span>Direct the team to perform system setup, system administration, incident resolution, problem management, configuration management, change management, security monitoring, security management, capacity planning, availability management and disaster recovery</span></li><li><span>Establish performance monitoring and response processes</span></li><li><span>Ensure efficiency and predictability of deployments and upgrades</span></li><li><span>Roll out and enforce best-in-class security practices for greater customer success</span></li></ul><p><strong>Process</strong></p><ul><li><span>Assess and refine our Agile/SCRUM process by collaborating with Product Management, Sales and Support</span></li><li><span>Understand and improve our existing operations and planning processes to elevate the output and quality of our operations team</span></li></ul><p><strong>Direction</strong></p><ul><li><span>Direct and develop our operational resources by prioritizing and delegating across multiple projects and initiatives</span></li><li><span>Optimize resource efficiency and help technical leads and team leads continuously make better tradeoffs</span></li><li><span>Create a security roadmap for an organization with enterprise grade customers</span></li></ul><p><strong>Leadership</strong></p><p><em><span>Technical</span></em></p><ul><li><span>Understand the technical decisions that are being made by your operations team and synthesize &nbsp;their decisions into &nbsp;your decision-making process</span></li><li><span>Leverage your technical leadership to refine Product Management’s 6-month roadmap into tangible, and technically practical deliverables </span></li><li><span>Seek out meaningful certifications and security measures to increase our customers confidence in the delivery of our SaaS solution </span></li><li><span>Adopt a CI/CD mindset that is more advanced (and more beneficial) than our current DevOps mentality to accelerate deployments, reduce cost of ownership, and maintain quality</span></li><li><span>Understand and simplify the complexities of maintaining both on-premise installations as well as SaaS installation of the same technology stack</span></li></ul><p><em><span>Team</span></em></p><ul><li><span>Understand the skills and capacity of your team and how to best utilize them to achieve our goals </span></li><li><span>Identify and employ data to empower your team’s continuous improvement</span></li><li><span>Develop career paths for your engineers and provide opportunities and feedback that will help them pursue those paths</span></li></ul><p><em><span>Organizational</span></em></p><ul><li><span>Analyze departmental spending and collaborate with Product Management to capture ROI; evangelize findings to senior leadership</span></li><li><span>Coordinate cross-functional dependencies with a 360° leader mentality (</span><em><span>i.e.</span></em><span>, an ability to influence up, down and laterally across the organization) &nbsp;</span></li><li><span>Understand the tradeoffs and impact of decisions at the resource, technical and product level</span></li></ul><p><strong>Required Experience</strong></p><ul><li><span>5+ years of experience managing cloud operations experience with and strong knowledge of Microsoft Azure, Amazon Web Services, Google Cloud Platform, or other cloud platforms</span></li><li><span>2+ years of experience managing a team of at least 5 engineers </span></li><li><span>2+ years as an operations engineer yourself</span></li><li><span>3+ years of CI/CD experience</span></li><li><span>1+ years of experience working in an agile development environment</span></li><li><span>Expertise in cloud security compliance, including experience with security audits</span></li><li><span>Experience hosting 300+ customers in the cloud; enterprise customers highly preferred</span></li><li><span>Ability to communicate verbally and in writing with both technical and business people in terms that they understand</span></li></ul><p><em><span>EMS Software is proud to be an Equal Opportunity Employer. Applicants are considered for all positions without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, ancestry, marital or veteran status. We are committed to hiring a diverse and talented workforce, supporting integrity in the workplace and an entrepreneurial atmosphere.</span></em></p>                    </div>                            <h2>                About EMS Software            </h2>            <div><p>EMS Software offers the most comprehensive, cutting-edge platform to enable innovative work and learning environments. We make it easier to connect people with space, resources, and technology – allowing them to collaborate flawlessly, make informed business decisions, and get more out of each day.</p><p><em>EMS Software is an equal opportunity employer. In order to provide equal employment and advancement opportunities to all individuals, employment decisions at EMS Software will be based on merit, qualifications, and abilities. EMS Software does not discriminate against any person because of race, color, creed, religion, sex, sexual orientation, national origin, ancestry, disability, veteran status, age or any other characteristic protected by law.</em></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Medical, dental and vision plans                            </div>                            <div>                                 Physical fitness reimbursement plan and on-site fitness center                            </div>                            <div>                                 Self-Directed PTO                            </div>                            <div>                                 Flexible work environment and remote work options                            </div>                            <div>                                 Competitive compensation and employer-matched 401(k) savings plan                            </div>                            <div>                                 &quot;Bug hunts,&quot; casual dress code, open floor plan, collaboration spaces                            </div>                            <div>                                 Two blocks from the Arapahoe Village Center RTD Station                            </div>                            <div>                                 Walking distance to numerous bars, restaurants and coffee shops                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_google-cloud-platform",
      "TECH2_amazon-web-services",
      "REMOTE1_50",
      "TECH2_iaas",
      "TITLE1_manager",
      "TECH2_azure",
      "TZ_unknown",
      "DBG:surround``2N(work, remot) 2N OR(option, avail, allow, abl, possibl, permit)",
      "TECH2_cloud"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "azure",
      "cloud",
      "google-cloud-platform",
      "iaas"
    ]
  },
  {
    "id": "mw4vT7L5RtCYMI9h6WZQ2Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156831/engineering-manager-formstack?a=QAXZRDVDxy8",
    "title": "Engineering Manager at Formstack (Indianapolis, IN) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, SaaS, Web Technology</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span>Formstack, the most flexible and powerful form building application, is looking for an </span><span><strong>Engineering Manager</strong>&nbsp;to add to its already awesome Dev team!</span></p><p>Formstack&nbsp;is an 11&nbsp;year old company with its roots in Indianapolis. Our customers span 110 different countries, and our employees live and work across the U.S. and the globe. We provide a remote work environment that is flexible and provides great freedom for those who can perform.</p><p><strong>What You Will Do:</strong></p><p>You will work directly with the product managers and product design leads to help scope and hand off product features to the development team. Responsibilities include tracking team performance, setting and meeting goals, managing expectations, and delivering software on a deadline.</p><p>The majority of this role will be to manage people, projects and timelines. You should have an understanding of software development and be comfortable helping out when needed.</p><p><strong>Who You Are:</strong></p><p>You are a great leader, listener, decision maker, and can think on your feet. You believe people should lead by example. You have great attention to detail and enjoy keeping track of the who, what, when, where, and why. Constantly thinking about how to improve the development process keeps you up at night. You put your team ahead of yourself and try to do what's best for all parties involved. You aren't scared to make mistakes and try new things to achieve your objectives. You are comfortable not always knowing the answer and without a doubt a great communicator.</p><p><strong>Who We Are:</strong></p><p>We are a group of people who care about our customers and our teammates. We love what we do and what it means to our clients. Relationships are very important to us and we strive to create an environment where you can solve problems creatively and be yourself. We enjoy posting gifs (hard G) to Slack, playing Overwatch, eating lunch on camera (remote lunch get-togethers) and supporting each other. We believe strongly in a work/life balance and letting teams make their own decisions.</p><p><strong>Requirements</strong></p><ul><li>Demonstrated success &nbsp;working in a development environment</li><li>Proven success as a team lead or similar position</li><li>Comfortable managing a team of up to 6-8 developers and QA Analysts (we work in x-functional teams)</li><li>Excellent written and oral communication skills</li><li>Comfortable with agile methodologies &amp; scrum</li><li>Proven ability to manage a remote team of software developers</li><li>Strong experience with PHP, Python, MySQL, Angular and JavaScript</li><li>Passion for quality. Code coverage with unit tests should be as complete as possible. Strive for performance and correctness.</li></ul><p><strong>Extra Credit</strong></p><ul><li>Experience working and managing teams over multiple time zones</li><li>Experience using JIRA or similar software</li></ul><p><strong>What Formstack Offers:</strong></p><ul><li>Remote environment</li><li>Medical, Dental, Vision as well as company-paid Disability and Life Insurance Benefits.</li><li>401k with matching company contribution</li><li>Friday Lunch (Indianapolis Office)</li><li>The most up-to-date technology, including company-issued Macs, the latest software and other tools needed to excel at your job</li><li>Company-paid conferences and extended learning</li><li>Yearly company gatherings</li><li>Generous PTO</li></ul><p>Want to learn more about who we are and what we value?&nbsp;<a href='http://fast.wistia.net/embed/iframe/18hybe1npy?canonicalUrl=https%3A%2F%2Fwww.formstack.com%2Fabout&amp;canonicalTitle=About%20Our%20Team%20%C2%B7%20Formstack' rel='nofollow'>Check out this Video</a>&nbsp;and apply if you want to jump into the next great chapter of your life!</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 The most up-to-date software                            </div>                            <div>                                 401k Safe Harbor Match                            </div>                            <div>                                 Lunch everyday paid for by Formstack (for employees in Indianapolis)                            </div>                            <div>                                 Generous PTO policy                            </div>                            <div>                                 Remote working office                            </div>                            <div>                                 All the snacks you can handle                            </div>                            <div>                                 Company-contributions to HSA                            </div>                            <div>                                 Monthly company &quot;fun&quot;                            </div>                            <div>                                 Yearly team-building event for the whole company                            </div>                            <div>                                 All the pings and pongs you can handle!                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``OR(home,remot,telecommut) 3W OR(role,work) 4W OR(offic,headquart,onsit)",
      "TECH2_php",
      "REMOTE1_50",
      "TECH2_lead",
      "TITLE1_manager",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "lead",
      "php"
    ]
  },
  {
    "id": "UURZqNGGSOKrPGBaljOHng",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/154313/director-data-science-insights-achievement-network?a=PKBTCawBKfe",
    "title": "Director, Data Science & Insights at Achievement Network (Boston, MA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Data Scientist</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Education, Non-Profit</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><em>Location: &nbsp;Flexible (Boston, MA or New England region preferred)</em></p><p><em>Position available: November 2017</em></p><p><strong><strong>THE OPPORTUNITY</strong></strong></p><p>We are seeking a Director to join the Organizational &nbsp;Effectiveness (OE) team. &nbsp;The OE team ensures that ANet has the right goals that motivate and drive us to achieve our mission, spearheads our shared organizational focus on improving our core service model, and builds a research mindset and capability across ANet’s internal teams. This role reports to the Vice President, Org Effectiveness and is the ideal position for someone who has a passion for growing an organization’s confident use of data in order to shape strategic decisions and to deepen its long-term impact.</p><p>ANet is flexible to remote working, with occasional travel to ANet’s National Office in Boston. Therefore, proximity to the New England area and/or eastern time zone is preferable.</p><p><strong>WHAT YOU’LL DO</strong></p><p><strong>Examine our organizational impact on school performance and hone our organizational focus on impacting school practice</strong></p><ul><li><strong><strong>Lead organization-wide school and student learning impact reporting against annual goals &nbsp;</strong></strong></li></ul><ul><ul><ul><li>Manage complex analyses to extract new insights and year-over-year data patterns that convey a clear, compelling picture of ANet’s national impact over time</li><li>Convey results on goals in a way that is user-friendly and compelling for internal teams &nbsp;and that can be used for external generalist audiences (i.e. impact statements)</li><li>Leverage strong visualizations and presentations to boost end user (primarily senior leadership &amp; marketing/business development teams) comprehension of national impact results</li></ul></ul></ul><ul><li><strong><strong>Lead impact analyses that test and improve ANet’s core service model</strong></strong></li></ul><ul><ul><li>Execute organization-wide annual analyses that identify the relationships between state assessment outcomes (student and school performance) and internal practice with inputs data sources (school demographic data, school practice data, partner school survey data, etc.)</li><li>Conduct complex analyses to &nbsp;extract relevant findings/insights and year-over-year data patterns to share with senior leadership tied to 2020 strategic plan and impact vision</li><li>Partner closely with key business leads to identify annual prioritized research questions, drawing from prior years’ results, annual strategic goals, and ongoing learning agenda priorities</li></ul></ul><ul><li><strong>Lead reporting and analysis of ANet’s evolving non-core service model offerings to assess impact</strong></li></ul><p><strong>Lead long-cycle learning on ANet’s core service model, primarily via mix of data collection and analytic improvement strategies</strong></p><ul><li><strong><strong>Lead data characterization and analyses of newer ANet data sources to deepen ANet’s ability to test and improve its core service model</strong></strong></li></ul><ul><ul><li>Lead exploratory analyses of school partner data to produce new, actionable findings that accelerate improving ANet’s core service model and other service offerings</li><li>In collaboration with other OE team members and internal clients, set key research questions</li><li>Partner with key internal product and program teams to finalize use cases and baseline set definitions, metrics, and modes of analyses</li><li>Define reporting requirements for Engineering team</li><li>Examine and conduct feasibility checks of data in Google Analytics and identify and establish business and analytic rules for using tools such as unSampler</li><li>Explore opportunities with the Engineering team to identify longer-term data storage and cloud solutions</li></ul></ul><p><strong><strong>WHO YOU ARE &amp; WHAT YOU BRING</strong></strong></p><p>Must Have:</p><ul><li>You have prior experience and success designing and leading internal program evaluations and/or business intelligence projects for scaling organizations.</li><li>You bring proficiency and versatility with Excel and at least one statistical analysis software package (R, SAS, Stata, or SPSS) and are confident in advising others on matching the right analytic tool to the analytic task at hand.</li><li>You are optimistic that all of our schools can be successful if we learn together and that comes through in your facility with analyzing information and communicating complex findings to both technical and non-technical audiences.</li></ul><ul><li>You bring proficiency with data visualization software (i.e. Tableau) and website usage analytics and software tools (Google Analytics).</li><li>You are motivated by working in an environment where we live out our core values daily and are eager to examine personal archetypes and biases while discussing topics related to race, class, and privilege which relate to ANet’s Advance Equity and People Matter values</li></ul><p>Nice to Have:</p><ul><li>Prior experience in a school, education, or non-profit setting</li><li>Degree in quantitative field, program evaluation, analytics, or statistics</li><li>Proficiency with unSampler</li><li>SQL proficiency</li></ul><p><strong><em>ANet is committed to maximizing the diversity of our organization. We are an equal opportunity employer and encourage individuals of all ethnic and racial backgrounds and gender identities to apply to our positions.</em></strong></p>                    </div>                            <h2>                About Achievement Network            </h2>            <div><p>Achievement Network (ANet) is a nonprofit dedicated to educational equity. We help schools boost student learning with great teaching that’s grounded in standards, informed by data, and built on the successful practices of educators around the country.</p><p>Founded in 2005, ANet now serves over 700 schools educating over 230,000 students in California, Colorado, Connecticut, District of Columbia, Illinois, Louisiana, Massachusetts, Michigan, New Jersey, New York, Ohio, and Tennessee. Our support has consistently helped our partner schools—both district and charter—achieve breakthrough results for their students. ANet has received multiple awards and recognitions, including a prestigious Investing In Innovation (i3) grant from the federal government in 2010, New Schools Venture Fund’s “Organization of the Year” in 2011, and The NonProfit Time’s “Best Nonprofits to Work For” in 2015 and 2016.</p><p>ANet is a dynamic, values driven, team-oriented organization that is committed to the growth and development of all staff members. Individuals who join ANet have the opportunity to join an exceptional team of colleagues committed to helping schools drive excellent teaching and learning by investing in each other and learning together.</p><p><strong>WHAT WE OFFER</strong></p><p>ANet offers highly competitive compensation based on prior experience and qualifications as well as comprehensive benefits in order to best support our people. Benefits we offer include: health, dental and vision insurance where ANet pays 80% of the cost of these benefits for employees and their families/domestic partner; 3 weeks of vacation (4 weeks after two years with ANet); 10 paid holidays with paid days off between the Christmas and New Year’s holidays; a paid floating holiday; paid sick &amp; personal days; paid parental leave; retirement plan options; commuter benefits; tuition reimbursement; &nbsp;flexible spending accounts; short and long-term disability coverage; and basic life and personal accident insurance.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 80% Health, Dental, Vision                            </div>                            <div>                                 3 Weeks Vacation                            </div>                            <div>                                 10 Paid Holidays                            </div>                            <div>                                 Paid Parental Leave                            </div>                            <div>                                 Retirement Plan Options                            </div>                            <div>                                 Flexible Spending Accounts                            </div>                            <div>                                 Short and Long-Term Disability Coverage                            </div>                            <div>                                 Basic Life and Personal Accident Insurance                            </div>                            <div>                                 Tuition Reimbursement                            </div>                            <div>                                 Commuter Benefits                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_business-intelligence",
      "TECH2_r",
      "REMOTE1_50",
      "TITLE1_manager",
      "DBG:surround``OR(travel,visit) W to 4W OR(offic,headquart,onsit)",
      "TECH2_sql",
      "TZ_America_East",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "TECH2_google-analytics",
      "TECH2_tableau"
    ],
    "tagsNames1": [
      "50% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "business-intelligence",
      "google-analytics",
      "r",
      "sql",
      "tableau"
    ]
  },
  {
    "id": "-Dcgn-gdTz-v02rK28Sp1w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5650-sales-executive",
    "title": "Productive Power: Sales Executive",
    "content": "<div>  <div>    <h2>Sales Executive</h2>      <h4>Posted Nov  2</h4>    <h3>      <span>Productive Power</span><br>      <span>Headquarters: Miami Beach</span><br>        <a href='http://productivepower.applytojob.com/apply/WNMnJ26eRX/Sales-Executive?source=We+Work+Remotely' rel='nofollow'>http://productivepower.applytojob.com/apply/WNMnJ26eRX/Sales-Executive?source=We+Work+Remotely</a>    </h3>  </div>    </div>  <div>    <div>Are you a self-motivated person with a strong sales background? Do you have a passion for technology and productivity? If so, you could be a perfect sales executive for Productive Power.</div><div><br></div><div>Productive Power helps professionals maximize their productivity through digital training that transforms the way they work. Our Digital Productivity Essentials™ program teaches participants a series of innovative, easy-to-implement best practices that significantly increase organization and productivity. Participants&nbsp;report life-changing results, including the ability to accomplish more, beat deadlines and enjoy peace of mind in and out of the office.</div><div><br></div><div>We are looking for personable and tenacious sales professionals to generate clients across the country. Because our service genuinely solves a need for prospects, they must be effective using a consultative sales approach. Sales executives will follow up on incoming leads, attend&nbsp;networking events, reach&nbsp;out to&nbsp;existing networks and conduct&nbsp;in-person and online presentations. They will work from home and travel locally on a weekly basis.</div><div><br></div><div><strong>Requirements</strong><br></div><ul><li>Bachelor's degree<br></li><li>Successful sales track record<br></li><li>Very adept with technology<br></li><li>Ability to interact comfortably with executives<br></li><li>Exceptional communication skills<br></li><li>Strong organizational skills<br></li><li>Proficient in Microsoft Outlook<br></li><li>Sincere interest in helping people<br></li><li>Ability to work remotely and travel locally<br></li><li>Live in the United States<br></li><li>Be able to commute to a major city within 30 minutes<br></li></ul><div><b><br></b></div><div><b>Compensation Plan</b><br></div><ul><li>Guaranteed $50,000 base salary<br></li><li>Uncapped 10% commission<br></li><li>Paid time off (vacation, personal and sick)<br></li><li>Paid holidays<br></li><li>Employer funded Health Reimbursement Account (HRA)<br></li><li>401(k) plan with company match<br></li></ul><div><span><br></span></div><div>Join our growing team of professionals selling an exciting new service with vast market potential. Reap the financial and intrinsic rewards resulting from selling a service that helps professionals increase the quality of their lives.</div><div><br></div><div>In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.</div><div></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='http://productivepower.applytojob.com/apply/WNMnJ26eRX/Sales-Executive?source=We+Work+Remotely' rel='nofollow'>http://productivepower.applytojob.com/apply/WNMnJ26eRX/Sales-Executive?source=We+Work+Remotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 3:56:04 PM",
    "tags": [
      "REMOTE1_50",
      "TITLE1_manager",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "fNz59xPgQTWCBEGNakEZVw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5649-inside-sales-executive",
    "title": "Teamup: Inside Sales Executive",
    "content": "<div>  <div>    <h2>Inside Sales Executive</h2>      <h4>Posted Nov  2</h4>    <h3>      <span>Teamup</span><br>      <span>Headquarters: United Kingdom</span><br>        <a href='https://teamup.breezy.hr/p/5b666fa1d2c8-inside-sales-executive?source=weworkremotely' rel='nofollow'>https://teamup.breezy.hr/p/5b666fa1d2c8-inside-sales-executive?source=weworkremotely</a>    </h3>  </div>    </div>  <div>    <div>ABOUT US!</div><div></div><div></div><div><br></div><div>Teamup (goteamup.com) is an all-in-one business management solution for independent fitness businesses. Our customers include businesses like CrossFit gyms, yoga studios, martial arts centres, and more.</div><div></div><div></div><div><br></div><div>Since 2012, teamup has helped thousands of businesses take control of payments, scheduling, and member management.</div><div><br></div><div>Our remote team of 10 is currently based in the UK, US, and Spain.</div><div><br></div><div>THE JOB</div><div><br></div><ul><li>Qualifying potential customers<br><br></li><li>Handling incoming enquiries<br><br></li><li>Managing the sales pipeline<br><br></li><li>Following up consistently<br><br></li><li>Using data to identify opportunities (we’ll show you how)<br><br></li><li>Phone and email communication with customers and prospects<br></li></ul><div></div><div><br></div><div>YOU HAVE</div><div><br></div><ul><li>Native-level English proficiency and are excited to work directly with customers via email, phone or screen share<br><br></li><li>Ability to engage potential customers by phone, and understand their requirements.<br><br></li><li>Determination for every customer to have a great experience with teamup and a desire to take responsibility for the customers you are helping<br><br></li><li>Experience working in a remote environment (comfortable primarily communicating over platforms like Close.io, Hipchat, Skype, Basecamp, ZenDesk, Jira etc.)<br><br></li><li>Computer literacy<br><br></li><li>The schedule to work Monday through Friday, 9am - 5:30pm UK time, with ability to cover some hours during evenings, weekends and on public holidays if required<br></li></ul><div></div><div><br></div><div>ESSENTIAL TO HAVE (bonus points for both)</div><div></div><div></div><div><br></div><ul><li>Experience of fitness businesses<br><br></li></ul><ul><li>Experience working in the software industry<br></li></ul><div></div><div></div><div><br></div><div>WHY WORK FOR US?</div><div></div><div></div><div><br></div><div>We’re a very small team doing very big things — your work will make a huge impact and your voice will be heard! We offer a competitive salary, gym membership, team meet ups and a great team atmosphere to help you achieve your best work.</div><div></div><div></div><div><br></div><div>Salary</div><div><br></div><div>£21,000 per annum</div><div></div><div></div><div><br></div><div>To apply for the position of Inside Sales Executive please complete the below steps:</div><div></div><div></div><div><br></div><div>1. Send a copy of your CV</div><div><br></div><div>2. Send a cover letter explaining why you think you're suitable for the role</div><div><br></div><div>3. Please call +44 20 3808 8576. We will ask you for your name and number and a question focused on the customer experience, with answers to be left as a voicemail. Please take as many attempts as you like at this. We understand that you aren’t fully familiar with teamup yet.<br></div><div>We'll only consider applicants who complete all 3 steps.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://teamup.breezy.hr/p/5b666fa1d2c8-inside-sales-executive?source=weworkremotely' rel='nofollow'>https://teamup.breezy.hr/p/5b666fa1d2c8-inside-sales-executive?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 2:38:11 PM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "Dea1MZ9hTNyL5nlSI_I6xw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62379",
    "title": "Head of Support",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Hiya! We’re SkyVerge and we love eCommerce. Our products help merchants manage and grow their online stores, all the way from boutique corner shops to Fortune 500 retailers. We’re looking for a Head of Support to join our fully-distributed team who will improve our support team and processes across our entire suite of products.<br><br><strong>Role</strong><br><br>You’ll be focused on ensuring that our customer support across our products and the platforms we work with continues to meet our high standards, and is constantly improving. You’ll be coaching support and engineering team members on tone and process, doing everything from reviewing drafts, spot-reading replies, assisting in de-escalating difficult threads, to tracking and improving team metrics on replies, response times, and response quality.<br><br>We know that the best learning and understanding comes from hands-on experience, so you’ll also be rolling up your sleeves to assist with support and pre-sales questions across our product suite. We have over 70 different products, so you’re excited that there’s always something new to learn.<br><br>You’ll have the opportunity to dive in and question everything: is what we’re doing effective? How are we measuring success? What standards are we setting? How can we improve and unify process across all products we support? Are our tools supporting our goals?<br><br>We expect that our head of support will be pushing our team forward on customer service best-practices, impeccable tone and voice, accuracy in replies, great supporting documentation, maintaining an internal knowledge base, and overall ensuring that our organization’s support runs as efficiently and seamlessly as a Swiss watch. We have several amazing team members already supporting our customers every day; you’ll be working directly with them to take our support to new heights.<br><br>We expect you to work closely with our product and development teams to ensure we’re building great products, have solid feedback loops in place for further improvements, and that customers get the help they need while running their businesses.<br><br><strong>You</strong><br><br>You have a remarkable knack for understanding our customers’ problems, and working together with them to understand our products and resolve issues. You know good customer service comes from a place full of empathy, helpfulness, and friendliness. Your written communication is crystal-clear and representative of the standards our team should work towards.<br><br>You’re solutions-oriented, self-directed, curious, and love solving problems. No question is too difficult for you to research, critically evaluate current best-practices, then develop your own path forward for an optimal solution or potential improvements. You can do this on your own, or work with a team to drive a project forward. You question existing practices and seek out the “best” way to do things.<br><br>To succeed in this role, you’ll have:<br><br></p><ul><li>excellent written communication and native-level English fluency. (Do you have proficiency in other languages? Tell us! We love being able to support customers in their native language.)<br></li><li>ability to thrive in a remote environment (along with a reliable internet connection).<br></li><li>above-average skills for reporting on and evaluating data &amp; support metrics.<br></li><li>boundless curiosity and inquisitiveness for our products and how we can do things better.<br></li><li>high technical competency, such as ability to use FTP, launch a website from scratch, and understand software development in general.<br></li><li>proficiency with HTML / CSS.<br></li><li>experience writing technical documentation or guides.<br></li><li>experience in previous team captain or leadership roles.<br></li><li>experience in supporting software (downloadable or SaaS, we do both!).<br><br>It’s helpful if you have:<br><br></li><li>experience with eCommerce, or with platforms we work with in particular (Shopify, WooCommerce, Easy Digital Downloads).<br></li><li>experience in building, fixing, or maintaining software (if you have PHP, JavaScript, Ruby, etc., skills, let us know).<br></li><li>previous experience working remotely.<br></li><li>are US or CA-based for maximum overlap with our existing support team.<br><br>Our team is fully-remote and we communicate primarily through Slack, GitHub, Help Scout, and weekly stand-ups on Monday via Zoom (a few short meetings on Monday) — we believe the best work happens when given lots of uninterrupted time that’s free of distractions. That said, we believe face time is valuable — availability for 1-2 company-paid team trips (<a href='https://www.skyverge.com/blog/skytrip-2017-recap/' rel='nofollow'>SkyTrip!</a>) per year is necessary.<br>This is a full-time, salaried position, but hours are flexible. We know your work will speak for itself with support metric improvements, documentation added, and wiki edits.<br><br><strong>Process</strong><br><br>Qualified candidates will get an email with a few questions to answer via email. Following that, you’ll have a few 30-minute phone chats with different people on our team to learn more about you and answer any questions you have about the position and company. <br><br>If this goes well, we’ll invite you to join our team and start your 4-week trial. During this period, you’ll work full-time as a contractor, or part-time on nights/weekends if you already have a full-time position. This gives you an opportunity to make sure you enjoy the work and the team, and it gives us an opportunity to evaluate your work. We’ll have regular chats each week to share feedback and make sure we’re on the same page. At the end of the 4 weeks, you’ll be offered a permanent position  <br><br><strong>Benefits</strong><br><br>Here are some benefits we're excited to offer to our team members:<br><br></li><li>Competitive salary<br></li><li>Annual incentive for meeting team and company goals<br></li><li>25 days of paid time-off, in addition to 2 company holidays (SkyVerge Day in March, Founders Day in June )<br></li><li>Medical, Dental, and Vision insurance for US and Canadian residents and their families (reimbursements for comparable care for non-US/Canadian residents)<br></li><li>401k/RRSP Retirement plan with 4% company match for US/Canadian residents (contributions to comparable plans for non-US/Canadian residents)<br></li><li>Work from anywhere that has a reliable internet connection<br></li><li>The tools (hardware/software) you need to be productive<br></li><li>Allowance for professional growth (books, courses, conferences)<br></li><li>Home office or co-working allowance<br></li><li>A Kindle to help you keep learning<br><br><em>We support workplace diversity and do not discriminate on any protected class. We believe when we work together as a team of different views, experiences, and ideas, we can build amazing things.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 6:20:34 AM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "R-qCENOMS_O2H9dhBy6Dtg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5634-head-of-support",
    "title": "SkyVerge: Head of Support",
    "content": "<div>  <div>    <h2>Head of Support</h2>      <h4>Posted Oct 31</h4>    <h3>      <span>SkyVerge</span><br>      <span>Headquarters: Remote</span><br>        <a href='http://www.skyverge.com' rel='nofollow'>www.skyverge.com</a>    </h3>  </div>    </div>  <div>    <div>Hiya! We’re SkyVerge and we love eCommerce. Our products help merchants manage and grow their online stores, all the way from boutique corner shops to Fortune 500 retailers. We’re looking for a Head of Support to join our fully-distributed team who will improve our support team and processes across our entire suite of products.</div><div><br></div><div></div><div><span><b>Role</b></span></div><div><br></div><div></div><div><span>You’ll be focused on ensuring that our customer support across our products and the platforms we work with continues to meet our high standards, and is constantly improving. You’ll be coaching support and engineering team members on tone and process, doing everything from reviewing drafts, spot-reading replies, assisting in de-escalating difficult threads, to tracking and improving team metrics on replies, response times, and response quality.</span></div><div><br></div><div></div><div><span>We know that the best learning and understanding comes from hands-on experience, so you’ll also be rolling up your sleeves to assist with support and pre-sales questions across our product suite. We have over 70 different products, so you’re excited that there’s always something new to learn.</span></div><div><br></div><div></div><div><span>You’ll have the opportunity to dive in and question everything: is what we’re doing effective? How are we measuring success? What standards are we setting? How can we improve and unify process across all products we support? Are our tools supporting our goals?</span></div><div><br></div><div></div><div><span>We expect that our head of support will be pushing our team forward on customer service best-practices, impeccable tone and voice, accuracy in replies, great supporting documentation, maintaining an internal knowledge base, and overall ensuring that our organization’s support runs as efficiently and seamlessly as a Swiss watch. We have several amazing team members already supporting our customers every day; you’ll be working directly with them to take our support to new heights.</span></div><div><br></div><div></div><div><span>We expect you to work closely with our product and development teams to ensure we’re building great products, have solid feedback loops in place for further improvements, and that customers get the help they need while running their businesses.</span></div><div><br></div><div></div><div><span><b>You</b></span></div><div><br></div><div></div><div><span>You have a remarkable knack for understanding our customers’ problems, and working together with them to understand our products and resolve issues. You know good customer service comes from a place full of empathy, helpfulness, and friendliness. Your written communication is crystal-clear and representative of the standards our team should work towards.</span></div><div><br></div><div></div><div><span>You’re solutions-oriented, self-directed, curious, and love solving problems. No question is too difficult for you to research, critically evaluate current best-practices, then develop your own path forward for an optimal solution or potential improvements. You can do this on your own, or work with a team to drive a project forward. You question existing practices and seek out the “best” way to do things.</span></div><div><br></div><div></div><div><span>To succeed in this role, you’ll have:</span></div><div><br></div><div></div><ul><li><span>excellent written communication and native-level English fluency. (Do you have proficiency in other languages? Tell us! We love being able to support customers in their native language.)</span></li><li><span>ability to thrive in a remote environment (along with a reliable internet connection).</span></li><li><span>above-average skills for reporting on and evaluating data &amp; support metrics.</span></li><li><span>boundless curiosity and inquisitiveness for our products and how we can do things better.</span></li><li><span>high technical competency, such as ability to use FTP, launch a website from scratch, and understand software development in general.</span></li><li><span>proficiency with HTML / CSS.</span></li><li><span>experience writing technical documentation or guides.</span></li><li><span>experience in previous team captain or leadership roles.</span></li><li><span>experience in supporting software (downloadable or SaaS, we do both!).</span></li></ul><div><span><br></span></div><div></div><div><span>It’s helpful if you have:</span></div><div><br></div><div></div><ul><li><span>experience with eCommerce, or with platforms we work with in particular (Shopify, WooCommerce, Easy Digital Downloads).</span></li><li><span>experience in building, fixing, or maintaining software (if you have PHP, JavaScript, Ruby, etc., skills, let us know).</span></li><li><span>previous experience working remotely.</span></li><li><span>are US or CA-based for maximum overlap with our existing support team.</span></li></ul><div><span><br></span></div><div></div><div><span>Our team is fully-remote and we communicate primarily through Slack, GitHub, Help Scout, and weekly stand-ups on Monday via Zoom (a few short meetings on Monday) — we believe the best work happens when given lots of uninterrupted time that’s free of distractions. That said, we believe face time is valuable — availability for 1-2 company-paid team trips (<a href='https://www.skyverge.com/blog/skytrip-2017-recap/' rel='nofollow'><span>SkyTrip!</span></a>) per year is necessary.</span></div><div><br></div><div></div><div><span>This is a full-time, salaried position, but hours are flexible. We know your work will speak for itself with support metric improvements, documentation added, and wiki edits.</span></div><div><br></div><div></div><div><span><b>Process</b></span></div><div><br></div><div></div><div><span>Qualified candidates will get an email with a few questions to answer via email. Following that, you’ll have a few 30-minute phone chats with different people on our team to learn more about you and answer any questions you have about the position and company.</span></div><div><br></div><div></div><div><span>If this goes well, we’ll invite you to join our team and start your 4-week trial. During this period, you’ll work full-time as a contractor, or part-time on nights/weekends if you already have a full-time position. This gives you an opportunity to make sure you enjoy the work and the team, and it gives us an opportunity to evaluate your work. We’ll have regular chats each week to share feedback and make sure we’re on the same page. At the end of the 4 weeks, you’ll be offered a permanent position </span></div><div><br></div><div></div><div><span><b>Benefits</b></span></div><div><br></div><div></div><div><span>Here are some benefits we're excited to offer to our team members:</span></div><div><br></div><div></div><ul><li><span>Competitive salary</span></li><li><span>Annual incentive for meeting team and company goals</span></li><li><span>25 days of paid time-off, in addition to 2 company holidays (SkyVerge Day in March, Founders Day in June )</span></li><li><span>Medical, Dental, and Vision insurance for US and Canadian residents and their families (reimbursements for comparable care for non-US/Canadian residents)</span></li><li><span>401k/RRSP Retirement plan with 4% company match for US/Canadian residents (contributions to comparable plans for non-US/Canadian residents)</span></li><li><span>Work from anywhere that has a reliable internet connection</span></li><li><span>The tools (hardware/software) you need to be productive</span></li><li><span>Allowance for professional growth (books, courses, conferences)</span></li><li><span>Home office or co-working allowance</span></li><li><span>A Kindle to help you keep learning</span></li></ul><div><span><br></span></div><div></div><div><span><i>We support workplace diversity and do not discriminate on any protected class. We believe when we work together as a team of different views, experiences, and ideas, we can build amazing things.</i></span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply directly via this link: <a href='https://skyverge.workable.com/jobs/600766' rel='nofollow'>https://skyverge.workable.com/jobs/600766</a>. Applications accepted until November 17th.</p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 6:00:59 AM",
    "tags": [
      "DBG:surround``headquart 3N remot",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "dzCTvx-cTLCnM2DNmGGp2Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/62938/inside-sales-executive-at-teamup-sports-inc/",
    "title": "Inside Sales Executive",
    "content": "ABOUT US!<br /><br />Teamup (goteamup.com) is an all-in-one business management solution for independent fitness businesses. Our customers include businesses like CrossFit gyms, yoga studios, martial arts centres, and more.<br /><br />Since 2012, teamup has helped thousands of businesses take control of payments, scheduling, and member management. <br /><br />Our remote team of 10 is currently based in the UK, US, and Spain. <br /><br />THE JOB<br /><br />Qualifying potential customers<br />Handling incoming enquiries<br />Managing the sales pipeline<br />Following up consistently<br />Using data to identify opportunities (we’ll show you how)<br />Phone and email communication with customers and prospects<br /><br />YOU HAVE<br /><br />Native-level English proficiency and are excited to work directly with customers via email, phone or screen share<br />Ability to engage potential customers by phone, and understand their requirements.<br />Determination for every customer to have a great experience with teamup and a desire to take responsibility for the customers you are helping<br />Experience working in a remote environment (comfortable primarily communicating over platforms like Close.io, Hipchat, Skype, Basecamp, ZenDesk, Jira etc.)<br />Computer literacy <br />The schedule to work Monday through Friday, 9am - 5:30pm UK time, with ability to cover some hours during evenings, weekends and on public holidays if required<br /><br />ESSENTIAL TO HAVE (bonus points for both)<br /><br />Experience of fitness businesses<br />Experience working in the software industry <br /><br /><br />WHY WORK FOR US?<br /><br />We’re a very small team doing very big things — your work will make a huge impact and your voice will be heard! We offer a competitive salary, gym membership, team meet ups and a great team atmosphere to help you achieve your best work.<br /><br />Salary <br />£21,000 per annum <br /><br />To apply for the position of Inside Sales Executive please complete the below steps:<br /><br />1. Send a copy of your CV<br />2. Send a cover letter explaining why you think you're suitable for the role",
    "urlFetchPending": false,
    "published": "Oct 30, 2017 11:02:19 AM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "04L6GCc2QTqeYN242Bc3PA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29963?r=rss2",
    "title": "e9digital: Project Manager/Website Producer",
    "content": "<p>Part-time</p><p><strong>(Midtown Manhattan)</strong> </p><p><strong>e9digital</strong> is one of the top rated digital agencies in Manhattan and NYC.</p><p>We have over 200 clients under management and produce 10+ projects at any one time.</p><p>We're seeking an experienced project manager to interface with our clients and manage our development teams to deliver on-time, on-budget projects.</p><p><strong>Experience:<br></strong>We are looking for a candidate that has a minimum of 3+ years experience and proven track record on dozens of website proejcts.</p><p>You must have great written and verbal communication skills, and have that soft touch that clients love.</p><p><strong>Location:<br></strong>Bacause of our banking clients' security requirements <strong>you must be a US Citizen located in the USA.</strong> You can work remotely since most of our meetings with clients and team are done via uberconference, but if you are in the NYC area, you can work at our Midtown studio if you want.&nbsp;</p><p><strong>Compensation:</strong><br>We will pay an hourly rate commensurate with experience, so tell us what your rate is.</p><p>We pay staff and freelancers twice per month, so you'll never wait for your compensation with us.</p><p>We expect that you will have 20 to 30 hours per week at the start, and that could quickly grow to 40 hours per week.</p><p><strong>Job Responsibilities:</strong><br>1) Reports directly to the Creative Director and CEO<br>2) Serves as Leader of organizational processes, protocols, practices<br>3) Serves as point of contact for clients with new website/marketing projects as well as websites/projects in maintenance and/or maintenance requests.<br>4) Schedules, coordinates, and enforces all phases (from inception to completion) of new project/maintenance tasks with Creative Director, Production Team<br>5) Request/Source/Manage resources; measures the profitability of using resources. Management will approve or deny requested resources.<br>6) Leads regularly staff &quot;stand-up&quot; meetings/events covering &quot;big picture&quot; + production/scheduling details<br>7) Maintain/cultivate Expert level knowledge of web technology/best practices, digital industry developments<br>8) Provides ad hoc administrative support to designers, engineers, sales as schedule permits<br>9) Analyzes Internal Processes on ongoing basis to look for ways to improve efficiency, quality, team spirit<br>10) Documents all ongoing project/process intelligence for future reference<br><br><strong>-- FOR NEW website/creative projects:</strong><br>1) Gathers all Project Summary, other client background info from Sales<br>2) Creates Project Kickoff documentation containing all necessary, relevant background info<br>3) Schedules, co-leads (with Creative Director) Project Kickoff Meeting with Client + other pertinent personnel<br>4) Documents all meeting interactions, follows through with summary to client, CD; collects all assets necessary from client<br>5) Initiates internal Creative/Production brief document to be shared with Production Team<br>6) Creates Project schedule with checkpoints, Coordinates with CD to properly staff assigned production team<br>7) Schedules, co-leads (with Creative Director) Creative Presentation Meeting (follows through per #4)<br>8) Communicates regularly with Client, CD/Production Team to ensure scheduling milestones met<br>9) Facilitates content + tech production if skills/schedule permits<br>10) Manages website QA + site launch process; print production proof/fulfillment process, plus all other media fulfillment process<br>11) Trains clients on basic WordPress editing/content management<br><br><strong>-- FOR MAINTENANCE tasks/requests:</strong><br>1) Documents, analyzes, parses all client's new projects and maintenance requests before assigning to production team.<br>2) For simple WordPress updates, offers advice and/or assistance to the client.<br>3) For more complex tasks, confers with CD and/or engineer to evaluate best approach (may mean pushing back on client request)<br>4) Manages QA, task fulfillment</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Oct 29, 2017 5:12:07 PM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "TZ_America",
      "REMOTE1_50",
      "TITLE1_manager",
      "DBG:surround``can 2W remot"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "QwAHQeUmTL6TFT-nrete8Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5623-account-executive",
    "title": "Follow Up Boss: Account Executive",
    "content": "<div>  <div>    <h2>Account Executive</h2>      <h4>Posted Oct 27</h4>    <h3>      <span>Follow Up Boss</span><br>      <span>Headquarters: Remote</span><br>        <a href='https://www.followupboss.com/' rel='nofollow'>https://www.followupboss.com/</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span><b>Who Is Follow Up Boss?</b></span></div><div><br></div><ul><li><span>We’re a simple, sales-focused CRM for real estate teams (and we use our own product)</span><br></li><li><span>We’re a bootstrapped, profitable company started back in April of 2011</span><br></li><li><span>We’re a remote company with a mostly US-based team</span><br></li><li><span>We don’t just claim to be customer-centric - we live it: </span><a href='https://www.facebook.com/followupboss/reviews' rel='nofollow'><span>https://www.facebook.com/followupboss/reviews</span></a></li></ul><div><b><br></b></div><div><span><b>Why Would You Want To Work Here?</b></span></div><div><br></div><ul><li><span>We’re a young, ambitious company who only answers to our customers</span><br></li><li><span>Opportunity to have a big impact on our growth and your career</span><br></li><li><span>All your leads are warm, inbound inquiries</span><br></li><li><span>No red tape or pointless meetings</span><br></li><li><span>Uncapped commissions, competitive base salary, health/dental insurance and 20 days paid holiday</span><br></li></ul><div><br></div><div><span><b>This Role Is For You If...</b></span></div><div><br></div><ul><li><span>Your approach to sales is consultative, and focused on service and helping people get results</span><br></li><li><span>You would describe yourself as patient, empathetic and having a good sense of humour</span><br></li><li><span>You LOVE sales, and other salespeople (since that’s who you’re connecting with all day)</span><br></li><li><span>You’re independent, self-motivated and can stay efficient and productive without someone looking over your shoulder all day long</span><br></li><li><span>You thrive on ambitious goals and can’t handle anything but being the top producer on your team</span><br><br></li></ul><div><span><b>Your qualifications:</b></span></div><div><br></div><ul><li><b>Tech/SAAS</b> experience with free trial / inbound sales experience.</li><li><span><b>Consultative selling</b></span><span> experience, ideally to small businesses.</span></li><li><span><b>Self motivated</b></span><span> and proactive mindset.</span></li><li><span><b>Remote work</b></span><span> experience is considered an asset.</span></li><li><span><b>Based in the USA</b></span><span>, quiet home office with fast internet.</span></li></ul><div><br></div><div><span>Your responsibilities will include: </span></div><div><br></div><ul><li><span>Calling, texting and emailing new free trials proactively to help identify their biggest challenges, show how we can solve them, and begin helping to solve those problems as early in their free trial as possible (we use our own product, Follow Up Boss)</span><br></li><li><span>On-boarding and setting up new accounts during the free trial giving our customers a referable experience.</span><br></li><li><span>Answering incoming phone calls and emails from people on free trials or who are considering starting one to answer questions and consult them on the best solution for their current situation</span><br></li><li><span>Monitoring qualified free trial accounts to ensure that they are thrilled, getting results, and progressing towards account activation (and ultimately conversion)</span><br></li><li><span>Becoming a keen, passionate expert in all things related to real estate lead generation, lead conversion, sales optimization and customer service</span><br><br></li></ul><div><span>If this sounds like a great fit we would love to hear from you, drop us a line below.</span></div><div><br></div><div><span><br></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply using this link <a href='http://grnh.se/r7d4w51' rel='nofollow'>http://grnh.se/r7d4w51</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 27, 2017 5:29:38 AM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG:surround``headquart 3N remot",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "E8BsWNYdThe6TpHTweH3Ug",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3944-engineering-manager-observability-team-etsy",
    "title": "Engineering Manager, Observability Team @ Etsy",
    "content": "<h2>              Engineering Manager, Observability Team<small> @ Etsy</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-23 03:21</p></dd>          <dt><span>Description</span></dt>          <dd><h4>Etsy is seeking an Engineering Manager to join our team.</h4><p>As Etsy grows, the technical infrastructure and platforms need to continue to enable Etsy's growth while providing innovative ways to improve our systems. The Observability team is tasked with making that happen for all metrics, logging and alerting needs and we're looking for someone to manage this team.</p><p>Etsy is actively preparing to move systems to a cloud provider, and this team play a key role in this work. This is an exciting and revolutionary time to join Etsy as engineering embarks on its next generation work, offering an opportunity to be part of the teams that run the infrastructure that connects millions of sellers and customers</p><p>This is a full-time position based in Etsy’s Brooklyn office or remote in a US timezone.</p><p><strong>About the Teams</strong></p><p>The Observability team is a fluid and dynamic group. We work across Engineering to provide teams with tools, platforms and insights into how their systems are performing. The team strives for situational awareness; we know that failure happens, and sometimes we even cause them to happen on purpose. Being nice is a requirement. You will likely learn more about collaboration at Etsy than you have anywhere else.</p><p><strong>About the Role</strong></p><ul><li>Manage the career development of a team of highly collaborative systems engineers</li><li>Contribute to technical discussions within your team to help increase the efficiency, stability, deliverability, and maintainability of everything your team produces</li><li>Participate in the greater company discussions to help set the direction for Etsy’s engineering team</li><li>Offer strategic direction, provide space for the team to create solutions</li><li>Work asynchronously with people spread geographically between Europe, East Coast and the West Coast</li><li>Regular 1:1s with team members, team meetings, representing the team within Systems Engineering and across the wider Engineering org</li><li>Curiosity regarding what makes people tick</li></ul><p><strong>About You</strong></p><ul><li>Have prior experience managing teams</li><li>Understand the importance of authenticity and mindfulness in leadership</li><li>Have excellent written and verbal communication skills</li><li>Are as excited by the challenges of nurturing a team as you are by the technical challenges of building systems</li><li>Help those around you grow as engineers and be successful</li><li>Enjoy learning about and interacting with the people who use your systems</li><li>What is nice to have, but not essential</li><li>Relevant domain experience</li><li>Experience with bare metal and cloud environments</li></ul><p><strong>Why Etsy</strong></p><ul><li>We are very open about how we build things and the tools we have created to get things done. Read more on our technical blog, <a href='https://codeascraft.com/' rel='nofollow'>CodeAsCraft</a></li><li>We open source a lot of <a href='https://github.com/etsy' rel='nofollow'>code</a></li><li>We have amazing offices in the heart of Dublin city and Brooklyn, and ensure our remote employees don’t miss out either!</li><li>We genuinely care about our talented teams and offer a fantastic <a href='https://blog.etsy.com/ca/news/2016/strong-families-strong-business-a-step-forward-in-parental-leave-at-etsy/' rel='nofollow'>parental leave policy</a>, Health Care, Dental Care, Sabbatical leave and many more exciting benefits</li><li>Most importantly we’re a social bunch with global offices full of fun, innovation, awesome people and all kinds of interesting events and we are continuously growing!</li></ul><p><strong>What’s Next</strong></p><p>Interested in joining the team? Send us a cover letter and your resume explaining why you’d be great for the job. We value individuality and variety, so make sure to tell us what you’re all about. If you have an online presence (blog, Twitter, Facebook), send it along. And if you write, draw, craft, or contribute to something you’re proud of, we’d love to hear about it. </p><p><em>Etsy is proud to be an equal opportunity employer and will consider all qualified applicants regardless of color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital or family status, disability, gender identity or expression, veteran status, actual or presumed belonging to an ethnic group, or any other legally protected status. If you have a disability or special need that requires accommodation, please let us know.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:21:51 AM",
    "tags": [
      "DBG:surround``remot 16W timezon",
      "DBG:surround``usa 3W OR(time,timezon)",
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100",
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "ST2pzLrySG2tEiq2SFsORA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62240",
    "title": "Engineering Manager Observability Team",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><h3>Etsy is seeking an Engineering Manager to join our team.<br></h3><p><br>As Etsy grows, the technical infrastructure and platforms need to continue to enable Etsy's growth while providing innovative ways to improve our systems. The Observability team is tasked with making that happen for all metrics, logging and alerting needs and we're looking for someone to manage this team.<br><br>Etsy is actively preparing to move systems to a cloud provider, and this team play a key role in this work. This is an exciting and revolutionary time to join Etsy as engineering embarks on its next generation work, offering an opportunity to be part of the teams that run the infrastructure that connects millions of sellers and customers<br><br>This is a full-time position based in Etsy’s Brooklyn office or remote in a US timezone.<br><br><strong>About the Teams</strong><br><br>The Observability team is a fluid and dynamic group. We work across Engineering to provide teams with tools, platforms and insights into how their systems are performing. The team strives for situational awareness; we know that failure happens, and sometimes we even cause them to happen on purpose. Being nice is a requirement. You will likely learn more about collaboration at Etsy than you have anywhere else.<br><br><strong>About the Role</strong><br><br></p><ul><li>Manage the career development of a team of highly collaborative systems engineers<br></li><li>Contribute to technical discussions within your team to help increase the efficiency, stability, deliverability, and maintainability of everything your team produces<br></li><li>Participate in the greater company discussions to help set the direction for Etsy’s engineering team<br></li><li>Offer strategic direction, provide space for the team to create solutions<br></li><li>Work asynchronously with people spread geographically between Europe, East Coast and the West Coast<br></li><li>Regular 1:1s with team members, team meetings, representing the team within Systems Engineering and across the wider Engineering org<br></li><li>Curiosity regarding what makes people tick<br><br><strong>About You</strong><br><br></li><li>Have prior experience managing teams<br></li><li>Understand the importance of authenticity and mindfulness in leadership<br></li><li>Have excellent written and verbal communication skills<br></li><li>Are as excited by the challenges of nurturing a team as you are by the technical challenges of building systems<br></li><li>Help those around you grow as engineers and be successful<br></li><li>Enjoy learning about and interacting with the people who use your systems<br></li><li>What is nice to have, but not essential<br></li><li>Relevant domain experience<br></li><li>Experience with bare metal and cloud environments<br><br><strong>Why Etsy</strong><br><br></li><li>We are very open about how we build things and the tools we have created to get things done. Read more on our technical blog, <a href='https://codeascraft.com/' rel='nofollow'>CodeAsCraft</a></li><li>We open source a lot of <a href='https://github.com/etsy' rel='nofollow'>code</a></li><li>We have amazing offices in the heart of Dublin city and Brooklyn, and ensure our remote employees don’t miss out either!<br></li><li>We genuinely care about our talented teams and offer a fantastic <a href='https://blog.etsy.com/ca/news/2016/strong-families-strong-business-a-step-forward-in-parental-leave-at-etsy/' rel='nofollow'>parental leave policy</a>, Health Care, Dental Care, Sabbatical leave and many more exciting benefits</li><li>Most importantly we’re a social bunch with global offices full of fun, innovation, awesome people and all kinds of interesting events and we are continuously growing!<br><br><strong>What’s Next</strong><br><br>Interested in joining the team? Send us a cover letter and your resume explaining why you’d be great for the job. We value individuality and variety, so make sure to tell us what you’re all about. If you have an online presence (blog, Twitter, Facebook), send it along. And if you write, draw, craft, or contribute to something you’re proud of, we’d love to hear about it. <br><br><em>Etsy is proud to be an equal opportunity employer and will consider all qualified applicants regardless of color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital or family status, disability, gender identity or expression, veteran status, actual or presumed belonging to an ethnic group, or any other legally protected status. If you have a disability or special need that requires accommodation, please let us know.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:21:51 AM",
    "tags": [
      "DBG:surround``remot 16W timezon",
      "DBG:surround``usa 3W OR(time,timezon)",
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "cpxr0XK-RCKGjZOGqFIsyw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5574-sales-development-manager-admissions-team",
    "title": "Remote Year: Sales Development Manager, Admissions Team",
    "content": "<div>  <div>    <h2>Sales Development Manager, Admissions Team</h2>      <h4>Posted Oct 19</h4>    <h3>      <span>Remote Year</span><br>      <span>Headquarters:  United States</span><br>        <a href='https://remote-year.breezy.hr/p/cd2c7afcf65a-sales-development-manager-admissions-team?source=weworkremotely' rel='nofollow'>https://remote-year.breezy.hr/p/cd2c7afcf65a-sales-development-manager-admissions-team?source=weworkremotely</a>    </h3>  </div>    </div>  <div>    <div><span><b>Remote Year</b></span><br></div><div></div><div><span><br></span></div><div><span>Remote Year brings together communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend a year working, traveling, and exploring 12 cities around the world. Spending one month in each location, communities connect with local cultures and business ecosystems, forming lifelong, borderless personal and professional relationships along the way. Together we are shaping the future of work.</span></div><div><br></div><div><span><b>Role Description</b></span></div><div><br></div><div>Our Admissions team is looking for an experienced Sales Manager to lead our growing consumer sales team. Working closely with our Head of Sales and the Head of Admissions you will be responsible for delivering on the Remote Year consumer sales strategy. You will bring your expertise in building and managing sales teams, maximizing pipeline potential, and - ultimately - driving revenue growth. We need a self-starter who helps others thrive in an autonomous workplace who can also develop and mentor a team of smart, talented, and passionate Admission Sales Consultants.</div><div><br></div><div><span><b>Responsibilities</b></span></div><div><br></div><ul><li>Manage, coach and develop a high-performing team of Admission Consultants.<br><br></li><li>Recruiting and retaining top talent through various sales-team appropriate engagement mechanisms.<br><br></li><li>Develop the strategy and delivery for training, onboarding, and development of our current and new Admission Consultants.<br><br></li></ul><ul><li>Lead daily sales initiatives, including both strategic elements (processes, quota alignments, targets) and operationally (tools, coaching, hiring needs)<br><br></li><li>Set and monitor KPIs, sales targets, and goals for the team.<br><br></li><li>Collaborate with People Business Partners on compensation packages for all levels of the sales team, onboarding, and other people-related needs.<br><br></li><li>Partner with Sales Ops and Finance to develop financial and operating targets and ensure alignment with a strategic plan.<br></li></ul><div><br></div><div><span><b>Qualifications</b></span></div><div><br></div><ul><li><span>3-5 years of management experience,</span>&nbsp;with preference to leading a distributed sales teams.<br><br></li><li>A strong familiarity with sales tools and CRMS in particular, Salesforce.<br><br></li><li>Previous startup experience and/or experience working with distributed teams across multiple timezones.<br><br></li><li>Ability to perform well in highly dynamic, rapidly changing environment.<br><br></li><li>Strong analytical and problems-solving ability - must have grit and a love for numbers.<br><br></li><li>Ability to give direct, constructive feedback to your team, peers and co-workers.<br><br></li><li>Ability to travel internationally extensively.<br><br></li></ul><div><span>To Apply: Drop your resume below, along with a note telling us more on your leadership style, what excites you about the role, and what we're building at Remote Year.</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://remote-year.breezy.hr/p/cd2c7afcf65a-sales-development-manager-admissions-team?source=weworkremotely' rel='nofollow'>https://remote-year.breezy.hr/p/cd2c7afcf65a-sales-development-manager-admissions-team?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 19, 2017 6:46:28 PM",
    "tags": [
      "DBG:surround``headquart 3N remot",
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "L-UNFPE4QkS6Mc9VAms2tQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5558-saas-marketing-project-manager-80k",
    "title": "Aurea: SaaS Marketing Project Manager ($80k)",
    "content": "<div>  <div>    <h2>SaaS Marketing Project Manager ($80k)</h2>      <h4>Posted Oct 17</h4>    <h3>      <span>Aurea</span><br>      <span>Headquarters: Austin, TX</span><br>        <a href='https://www.aurea.com/' rel='nofollow'>https://www.aurea.com/</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>Are you a get shit done, high-capacity, project manager in the B2B marketing world? Are you easily bored and excited by the prospect of managing over 50 SaaS products with a team of high performers from around the globe? If you’re looking to join a rocketship on the ground floor while working from the comfort of your home office or favorite coffee shop, this role is for you. </span></div><div><br></div><div><span><b>Team-specific background</b></span></div><div>The team you will be joining is tasked with building the inbound portion of Aurea’s new customer acquisition capability. Currently the team is working with six different products and is ramping to over fifty products in the next two years. To generate these MQLs, the team produces landing pages, websites, PPC ads, and content which attract MQLs into our funnel.&nbsp;<br></div><div><span><br></span></div><div><span>Without you as the project manager, our designer in Romania waits for the Pardot forms from our Canadian marketing automation specialist who read a Skype message and thought that our campaign manager in CA already sent it -- all the while the team moves slower than we ought to. Working closely with our creative director and design team, this won’t happen anymore: you’ll manage a workflow process which systematically coordinates the production of deliverables across a wide range of sales and marketing channels. </span></div><div><br></div><div><span><b>Job Description</b></span></div><div><br></div><ul><li><span>Manage and own the calendar for all stakeholders across the full project lifecycle, from briefing to creative concepting to production/development to implementation</span><br><br></li><li><span>Set deadlines for individual team members and keep people accountable to their goals</span><br><br></li><li><span>Proactively identify project slips, communicate to rest of the team, and build solutions to maintain due date</span><br><br></li><li><span>Set and manage budget for special experiments </span><br><br></li><li><span>Assign resources project-by-project, manage workloads, forecast coverage needs, communicate workload with creative director and leadership</span><br><br></li><li><span>Measure marketing department’s output and report progress to leadership </span><br><br></li><li><span>Enable quicker delivery of department’s deliverables by identify backlogs and process improvements &nbsp;</span><br><br></li></ul><div><span><b>Core skills and capabilities</b></span></div><div><br></div><ul><li><span>Able to keep complex teams and process ahead of schedule </span><br><br></li><li><span>Able to manage across functions: strategy, writing, design, dev, and QA</span><br><br></li><li><span>Effective collaborator with talented team members around the globe</span><br><br></li><li><span>Experience with agile/waterfall/scrum and similar management frameworks </span><br><br></li><li><span>Motivate diverse groups of people to perform at peak levels</span><br><br></li></ul><div><span><b>Behavioral characteristics</b></span></div><div><br></div><ul><li><span>Unusually high bandwidth and comfortable simultaneously managing multiple projects </span><br><br></li><li><span>Ability to coordinate timing and expectations between multiple stakeholders </span><br><br></li><li><span>Process-oriented and metric-driven contributor</span><br><br></li><li><span>Curiosity and openness to a remote work culture with differentiated core values </span><br><br></li></ul><ul><li><span>High performing history at B2B SaaS company</span><br><br></li><li><span>Proficiency with project management and communication tools </span><br><br></li></ul><div><span>Compensation is $80k/year ($40/hour)</span></div><div><br></div><div><span>Time: Full time (40 hours/week)</span></div><div><br></div><div><span>Offer: 1099 if outside the US and W2 if within US</span><span><br></span></div><div></div><div><span>Location: Global (remote)</span></div><div><br></div><div><span>To qualify,&nbsp;please complete our pre-interview work assignment – a thoughtful response to which will require investing 1-2 hours of preparation time. &nbsp;We find both the willingness to invest this time – coupled with the insights we derive from the answers – help us find the truly capable and passionate candidates. Candidates who demonstrate excellence in these responses will be contacted for final interviews.</span></div><div><br></div><div><b>Company background: Aurea Software</b> is a rapidly growing enterprise software company that delivers transformative customer experience through a variety of world class software products. &nbsp;With the recent acquisition of Jive Software, the Aurea team now includes 2,000 employees across 5 continents and a roster of over 4,000 customers, including Disney, British Airways, and Apple – all of whom use Aurea technology to engage employees and customers to create meaningful and transformative experiences.</div><div><br></div><div><span>Aurea’s growth strategy has focused on acquisition growth coupled with organic growth driven through the installed base. &nbsp;Aurea is currently building and scaling a world-class new customer acquisition capability using a combination of traditional enterprise software sales and the latest inbound/outbound marketing techniques.</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://goo.gl/1rwy6X' rel='nofollow'>https://goo.gl/1rwy6X</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 17, 2017 5:06:18 PM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "sHse7deIStKRJQFh9tzxZw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/jobs/5550-creative-director",
    "title": "Hotjar: Creative Director",
    "content": "<div>  <div>    <h2>Creative Director</h2>      <h4>Posted Oct 16</h4>    <h3>      <span>Hotjar</span><br>      <span>Headquarters: Malta</span><br>        <a href='https://careers.hotjar.com/o/creative-director' rel='nofollow'>https://careers.hotjar.com/o/creative-director</a>    </h3>  </div>    </div>  <div>    <div><strong>Note:</strong>&nbsp;Although this is a remote position, we are seeking candidates in the following timezones only: Europe (UTC+0 - UTC+4), US (EST only).</div><div></div><div></div><div><br></div><div>We are looking for a strategic, user-centric and hands-on creative leader that is ambitious and passionate about creating engaging, consistent and memorable experiences. Hotjar is a rapidly growing startup that is giving thousands of designers, marketers and website owners the tools needed to discover how their visitors are really using their website. In this role you will be actively contributing into shaping and evolving the Hotjar brand whilst growing with us.</div><div><br></div><div>This is an excellent remote career opportunity in a key role with a fast growing and innovative tech-startup. This role is situated in the Product Marketing team and will report to the Director of Marketing.</div><div><br></div><div>&nbsp;</div><div><br></div><div><strong>As the Creative Director, you will be:</strong></div><div><br></div><ul><li>Directing and creating media and campaigns that engage and empower our target audience to take action.</li><li>Hands on – designing creative assets for Hotjar sites, advertising, content marketing and marketing campaigns.</li><li>Owning and maintaining resources related to Hotjar’s brand and identity.</li><li>Advocating Hotjar’s brand standards and visual communication while ensuring they are met both internally and on all public channels, including social media and marketing channels.</li><li>Working within the Marketing team – managing the creative process and translating marketing objectives into clear creative strategies from concept to completion.</li><li>Working closely with product teams to ensure consistent messaging and visual communication.</li><li>Leading, training and mentoring a team of creatives whose primary focus is to provide Marketing with all their creative needs.</li><li>Participating in the recruitment process when hiring new creative talent to join the Marketing team.</li><li>Identifying and communicating with third-party creative agencies to collaborate and sustain marketing needs on all channels / mediums.</li></ul><div></div><div></div><div><br></div><div><strong>Compensation Range:</strong></div><div><br></div><div>The budgeted compensation range for this role is €60,000 to €80,000 annually. Ranges are based on market research and are equitable to other roles within Hotjar. The actual compensation offered to the chosen candidate will be based on relative experience and skills. At this time we are only able to provide official employment status to those located in Malta. All other candidates will join our team as full-time consultants and will be responsible for paying any taxes or applicable fees where they reside.&nbsp;<br></div><div><h4>Requirements</h4></div><div><strong>We want to hear from you if you:</strong></div><div><br></div><ul><li>Have 6+ years of creative direction experience with a minimum of 3 years leading design teams with a variety of skills (visual, UX/IA, writing, research, etc) at digital product companies.</li><li>Are a&nbsp;proven leader with great practical design skills who is eager to use them on a regular basis. You have shipped a lot of work yourself over the years and you know what it takes to create awesome, memorable experiences.</li><li>Have an analytical and user-focused mindset and understand the importance of qualitative and quantitative research. You constantly seek to improve your team’s outputs through user feedback and data insights.</li><li>Demonstrate a desire for continuous learning and personal growth in multiple areas; from design&nbsp;skills,&nbsp;to leadership, to processes, to market trends, etc.</li><li>Are an excellent communicator with excellent verbal, written, interpersonal and technical skills, and are able to work cross-functionally with business stakeholders.</li><li>Take pride in your ability to inspire and motivate others to carry out and execute a strategy while working in a fully remote team environment.</li><li>Are able to independently take decisions on final visuals and copy while meeting deadlines within the marketing team.</li><li>Are able to think critically and problem-solve in a&nbsp;fast-paced, entrepreneurial environment.</li><li>Are experienced working in a high growth SaaS startup with global expansion. This will be considered a plus, not a requirement.</li><li>Must submit to a background check confidentially processed by a trusted third party resource.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply via <a href='https://careers.hotjar.com/o/creative-director/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/creative-director/?source=WeWorkRemotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 16, 2017 5:39:07 PM",
    "tags": [
      "DBG:surround``remot 16W timezon",
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "zxv0_uHJQQaV6SkbrRihXQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/appzilo-3/jobs/134958-it-assistant-project-manager",
    "title": "IT Assistant Project Manager",
    "content": "<div><h2>IT Assistant Project Manager at AppZilo</h2><div>Malaysia, Remote · Full Time</div></div><div><div>Skills</div><div>Javascript, HTML, CSS, ActionScript, Flash, UI/UX Design, SCRUM, HTML5 &amp; CSS3, JSON / XML / HTML / Javascript / JQuery, Jave Programming</div><div>Compensation</div><div>$5K–$14K<br>No Equity</div></div><h3>Job Description</h3><div><p>Responsibilities</p><p>Work with remote team<br>Responsible for project and resource scheduling, project tracking, risk management and quality assurance<br>Oversee the implementation of the projects. Track all project phases &amp; activities and monitor progress and dependencies<br>Able to effectively lead and work closely with project team and solve problems, cultivate team cohesiveness &amp; teamwork<br>Strong in driving project implementation and delivery</p><p>Requirements</p><p>Possess at least Diploma , Advance / Higher / Graduate Diploma , Bachelor's Degree or Master 's Degree in Computer Science / Information Technology , Engineering ( Computer / Telecommunication) or equivalent.<br>Have a minimum of 5 years' experience , with at least 3 years' in project management and solutioning.<br>Good knowledge of scrum and agile methodlogy<br>Experience with PHP, MYSQL, HTML/CSS, Javascript(jQuery), Flash, Actionscript, AJAX, Testing Methodology, UI Design<br>Required Language(s): English and Chinese . Both oral and written is preffered<br>Willing to travel and work in overseas project<br>Applicants should be Malaysian citizen or hold relevant residence status<br>Full-Time position available</p></div>",
    "urlFetchPending": false,
    "published": "Oct 10, 2017 10:02:04 PM",
    "tags": [
      "Frontend Developer",
      "Jave Programming",
      "CSS",
      "TITLE1_manager",
      "Full Time",
      "Mobile Developer",
      "HTML5 & CSS3",
      "Malaysia",
      "HTML",
      "SCRUM",
      "JSON _ XML _ HTML _ Javascript _ JQuery",
      "TZ_unknown",
      "Remote OK",
      "Backend Developer",
      "Javascript",
      "UI_UX Design",
      "REMOTE1_100",
      "Flash",
      "ActionScript"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "Du2MKdFST9W6gGBqkpFUCw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/promethean-energy/jobs/122596-technical-sales-executive",
    "title": "Technical Sales Executive",
    "content": "<div><h2>Technical Sales Executive at Promethean Energy</h2><div>Mumbai, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Technical Sales</div><div>Compensation</div><div>₹400K–₹500K<br>No Equity</div></div><h3>Job Description</h3><div><p>Qualifications : Either B.Tech in Food technology/Dairy Technology/ Mechanical engineering/ Chemical engineering or diploma in similar fields. However, willing to look at other candidates with great communication skills and hunger to grow as a business development professional.<br>Preferably should have 2-4 years of technical sales experience selling to dairies/food &amp; beverages or similar sector. Must have sold some equipment in the above spaces.</p><p>Job Roles :<br>a)    Prospecting potential customers, identifying leads, setting up initial discussions.<br>b)    Meeting potential clients at client site, concept-selling the product and first level discussions.<br>c)    Meeting technical decision makers, including operators, plant managers at client site and discussing product features and value to the client.<br>d)    Documenting the entire sales process with clients, including time of engagement, nature of response, time to follow-up, sizing the client potential, etc<br>e)    Follow up with leads on regular basis, and continuous engagement with client to identify sales purchase process.<br>f)    Execute against sales strategy defined by company and give constant feedback on effectiveness of strategy.<br>g)    Regular updates with top management on progress.<br>Job will involve 15% of desk job (for prospecting, reporting, analysis etc), and 85% on the field interacting with clients.</p><p>Requirements in ideal candidate:<br>a)    Must enjoy talking to new people and need to solve client problems.<br>b)    Job is primarily on the field so candidate must be willing to travel.<br>c)    Good communication skills – good command over English and Hindi (knowing the local language is a bonus)</p></div>",
    "urlFetchPending": false,
    "published": "Oct 7, 2017 10:24:23 PM",
    "tags": [
      "Remote OK",
      "Sales",
      "Technical Sales",
      "TITLE1_manager",
      "Full Time",
      "REMOTE1_100",
      "TZ_unknown",
      "Mumbai"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "tInMYjXmRJyDHOOlNIdFkQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/jobs/5468-business-book-illustrator-freelance",
    "title": "Gear Stream: Business Book Illustrator - Freelance / Project Based",
    "content": "<div>  <div>    <h2>Business Book Illustrator - Freelance / Project Based</h2>      <h4>Posted Oct  3</h4>    <h3>      <span>Gear Stream</span><br>      <span>Headquarters: Raleigh</span><br>    </h3>  </div>    </div>  <div>    <div>This is a project based, freelance position that can be done remotely from anywhere in the world. &nbsp;</div><div><br></div><div>We prefer candidates from North America and/or Western Europe.</div><div><br></div><div>Project Brief:</div><div>We are nearing completion of a new business book focused on helping traditional companies reinvent themselves for Digital. &nbsp;The book is part strategy, part &quot;how to&quot;, and part case study. &nbsp;The manuscript is approx. 58,000 words. &nbsp;We think there are approx. 20-25 illustrations / tables required for the book. &nbsp;We're not sure, but we're hoping an experienced illustrator can give us help and guidance in this area.</div><div><br></div><div>Ideal Candidate:</div><div>We seek an illustrator who has worked on both traditionally published business books as well as self-published business books. &nbsp;We prefer candidates who have a wide range of illustration styles from conservative to whimsical. &nbsp;&nbsp;</div><div><br></div><div>If Interested Please Contact us and provide the following:</div><div>&nbsp;1 - A link to your portfolio</div><div>&nbsp;2 - A list of prior books you've illustrated</div><div>&nbsp;3 - Rate Guidance</div><div>&nbsp;4 - Current Availability</div><div><br></div><div>&nbsp;</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='mailto:brad.murphy@gearstream.com' rel='nofollow'>brad.murphy@gearstream.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 3, 2017 10:05:33 PM",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  }
]
}
