{
 "items": [
  {
    "id": "vVzlxr2CSO2FZIil5oORnA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/158020/vp-of-engineering-noom?a=QZGO2DWZupy",
    "title": "VP of Engineering at Noom (New York, NY) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Mobile Developer</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Digital Health, Mobile Application</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Noom Inc., a leader in mobile health coaching, combines the power of technology with the empathy of real human coaches to deliver successful behavior change at scale. Noom’s direct-to-consumer weight loss and exercise tracking mobile applications have reached more than 45 million users worldwide. Leveraging the success of their ground-breaking health and fitness programs, Noom developed a behavior change platform to treat chronic and pre-chronic conditions, beginning with the CDC’s Diabetes Prevention Program (DPP). On the first day the CDC began recognizing mobile and online DPP providers, Noom was there. Since then, Noom has expanded its curricula across the acuity spectrum and now features programs for pre-hypertension, hypertension and diabetes management in addition to its flagship weight loss and diabetes prevention programs. Noom has offices in New York City, Seoul and Tokyo.</p><p><br>Just the U.S. alone spends $3.8 trillion dollars on healthcare, and large chunks of that can be saved by shifting more to prevention. The existing healthcare system has no idea how to do this, and that’s where we come in.</p><p><br>We are looking for a VP of Engineering; a leader, someone who will oversee the engineering organization and help evolve Noom technology, all while keeping the team productive and happy. This person will inspire not only the team, but the entire Noom community, and carry us through the technical challenges and opportunities as we set the standard for wellness intelligence. You will get to lead a team of world-class engineers, help millions of people be healthier, and tackle some of the hardest problem in healthcare and technology.</p><p><strong>What You'll Do:</strong></p><ul><li>Drive technical, architectural, and organizational decisions, making sure we build a scalable, efficient, and maintainable infrastructure</li><li>Evolve Noom engineering through best practices, coding guidelines, and design documents, ensuring the organization as a whole feels awesome, top-notch, and fun</li><li>Optimize interactions between engineering and other functions, e.g product management, design, marketing, etc.</li><li>Help design and refine a scalable engineering culture to accommodate this growth</li><li>Be a good career coach and mentor, help engineers grow to be tech leads, and guiding all others towards success</li></ul><p><strong>What We're Looking For:</strong></p><ul><li>Experience leading an engineering team in both a cutting-edge large-scale tech company and in a start-up (team size is less important than what you achieved with it)</li><li>An experienced engineer and technical wizard, with the know-how to design complex scalable systems and how to design them correctly</li><li>An ability to quickly hold a conceptual and technical grasp of our complex tech stack and infrastructure</li><li>A strong leader and great communicator, with a welcoming and supportive personality</li><li>Past success creating processes that define a high-quality and enjoyable engineering culture</li><li>An inspiring motivator, supporter, and quarterback for the team</li></ul>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Home cooked, Healthy, and Tasty Lunch Everyday                            </div>                            <div>                                 Monthly Wellness Reimbursement                            </div>                            <div>                                 Flexible Work Schedules                            </div>                            <div>                                 Conference &amp; Education Budget                            </div>                            <div>                                 Collaborative, Fun Work Environment                            </div>                            <div>                                 Whatever Hardware You Need                            </div>                            <div>                                 Learn and Work Across the Entire Stack                            </div>                            <div>                                 Offsites Galore!                            </div>                            <div>                                 Great Benefits                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TECH2_ios",
      "TECH2_android",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "android",
      "ios"
    ]
  },
  {
    "id": "zWROEiNnRHO1ou4v-KdbeA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157996/senior-director-network-strategy-fastly?a=QZbRM321oqs",
    "title": "Senior Director, Network Strategy at Fastly (San Francisco, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Internet Infrastructure</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>SUMMARY</strong></p><p>Come join our team responsible for building out 50 POPs and 20 Terabits per Second of global network capacity!</p><p>Fastly is looking for a Director of Network Strategy to join our Infrastructure Team. This role is responsible for strategy development, deployments, and team leadership for Fastly’s infrastructure acquisition and capacity planning team. This role drives our global build out plan, including forecasts, budgets, procurement of colocation, connectivity, and managed services that power our global edge cloud.</p><p>You will be required to recruit, hire, and retain a top notch, globally distributed team of infrastructure acquisition managers and capacity planners. The acquisition team is required to source infrastructure globally, review contracts for business, legal, and compliance, and execute deployment plans. You will be expected to develop, iterate, and execute on Fastly’s global strategy to deliver customer content efficiently and at low costs to Fastly. The team is also responsible for project management of our deployments, so the ability to get your hands dirty with some field work alongside your team is also possible. It is expected that you participate in industry forums such as NANOG, RIPE, APRICOT, LACNOG, GPF, EPF, and APF because you will own key strategic relationships with partner networks.</p><p>The capacity planning team is responsible for producing forecasts and reports on deployment requirements and quality of experience. Our edge cloud is deployed over 43 global points of presence (POPs) on 6x continents, and we only expect the count of deployments to grow. Therefore, driving a team to make deployment decisions based upon metrics that tie back to business goals is a key aspect of the job. The ability to use forecasts to create budgets is a required skill. Additionally, not all locations we want to deploy to are easy to do business in, so a creative mindset that finds “win-win-wins” with partners is required.</p><p>Candidates must have a background in network engineering and a strong aptitude for business concepts. You must be able to identify and leverage worldwide Internet interconnection trends to Fastly’s strategic advantage. You must be able to align these trends to capacity plans, business plans, and a profit and loss statement. You and your team are expected to deliver cost efficiencies to the bottom line. Candidates should be extremely organized, detail oriented, and process driven individuals. Candidates must be able to work independently and cross functionally.</p><p><strong>RESPONSIBILITIES</strong></p><ul><li>Recruits, retains, and manages a globally distributed infrastructure acquisition and capacity planning team.</li><li>Develops and iterates on network deployment strategies to bring Fastly customer content to end users in performant and efficient manners using a metrics driven process.</li><li>Engages with key partners (colocation, IP transit, interconnection, and suppliers) at a strategic level to develop and realize long term plans.</li><li>Works with business functions (finance, legal, and compliance) to ensure objectives on budget, risk, and compliance are adhered to and met.</li><li>Designs metrics to capture quality of experience, measures, and reports on said metrics. Uses forecasts and reports to create budgets and other strategic planning documentation.</li></ul><p><strong>PRIOR EXPERIENCE</strong></p><ul><li>Prior leadership experience in engineering, data center management, interconnection, purchasing, or supply chain.</li><li>5+ years of direct experience in building out networks.</li><li>5+ years of direct experience in sourcing, contract negotiation and administration, and/or in project management.</li></ul><p><strong>QUALIFICATIONS</strong></p><ul><li>Must be a capable leader with experience in running distributed teams.</li><li>Must be a strong networker and communicator, both internally and externally. Network strategy requires as much human networking skill as it does technical chops.</li><li>Must be proficient in finance for managers including P&amp;L and budgets.</li><li>Capable of designing metrics, iterating on measurement, and driving change.</li><li>Comfortable with Microsoft Word, Excel, Powerpoint, bonus for any of SQL, R, Python.</li></ul><p><em>Fastly provides equal employment opportunity without regard to an applicant’s race, sex, pregnancy, sexual orientation, gender identity or expression, genetic information, national origin, age, physical or mental disability, medical condition, religion, marital status or veteran status.&nbsp;</em></p><p><em>Applicants with disabilities may be entitled to reasonable accommodation under the terms of the Americans with Disabilities Act and certain state or local laws. A reasonable accommodation is a change in the way things are normally done which will ensure an equal employment opportunity without imposing undue hardship on Fastly. Please inform us if you need assistance completing any forms or to otherwise participate in the application process.</em></p>                    </div>                            <h2>                About Fastly            </h2>            <div><p>Fastly helps the world’s most popular digital businesses keep pace with their customer expectations by delivering fast, secure, and scalable online experiences. Businesses trust Fastly to accelerate the pace of technical innovation, mitigate evolving threats, and scale on demand. Founded in 2011, Fastly powers online destinations including Airbnb, GitHub, Alaska Airlines, Pinterest, Vimeo, The Guardian, The New York Times and Ticketmaster.</p><p>The worldwide cloud services market is projected to grow rapidly to $236 billion in 2020, according to Forrester, Inc. As more and more businesses move operations to the cloud, Fastly is well positioned to continue increasing CDN, cloud networking and cloud security market share with edge cloud services that reach beyond content delivery.</p><p>We’re building a better Internet. Come join us.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Catered Lunches                            </div>                            <div>                                 Dog-Friendly                            </div>                            <div>                                 Flexible Working Hours                            </div>                            <div>                                 Beer, Wine, Cold Brew On Tap                            </div>                            <div>                                 Walking distance from BART and CalTrain                            </div>                            <div>                                 Unlimited PTO                            </div>                            <div>                                 Wellness: Yoga                            </div>                            <div>                                 Frequent Tech Talks                            </div>                            <div>                                 Sponsors Meetups                            </div>                            <div>                                 Fully-covered Health, Dental, and Vision Insurance                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TITLE1_manager",
      "TECH2_project-management",
      "REMOTE1_100",
      "TZ_America_East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East timezone"
    ],
    "tagsNames2": [
      "project-management"
    ]
  },
  {
    "id": "NCLkgnWQRnyM9864K53keg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157505/director-of-cloud-operations-security-ems-software?a=QOYTdmJwAj6",
    "title": "Director of Cloud Operations & Security at EMS Software (Greenwood Village, CO) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Manager</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise Software</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span>EMS Software is looking for a Director of Cloud Ops &amp; Security who will aid us in the ongoing transformation of our product offering from an on-premise solution to one having a hybrid offering with a pure SaaS presence. </span></p><p><span>You will be at the center of a vital growth initiative.</span></p><p><span>You’ll join a company that serves 2,500 great organizations like Accenture, Deloitte, Goldman Sachs, Harvard and Yale University. Our customers have millions of people using our software to manage events, reserve spaces to meet, work and study; and to analyze and optimize their use of real estate.</span></p><p><span>Your role combines the operational responsibility for cloud ops and security, plus the strategic responsibility for enabling and encouraging our product and sales teams to promote our offering to existing and new customers alike. This is the perfect role for a technical leader who wants the high visibility of driving adoption</span></p><p><span>So, where will you focus your energy? </span></p><p><strong>Delivery</strong></p><ul><li><span>Drive customer satisfaction (DevOps + external) by providing world-class application availability and protection of customer data</span></li><li><span>Direct the team to perform system setup, system administration, incident resolution, problem management, configuration management, change management, security monitoring, security management, capacity planning, availability management and disaster recovery</span></li><li><span>Establish performance monitoring and response processes</span></li><li><span>Ensure efficiency and predictability of deployments and upgrades</span></li><li><span>Roll out and enforce best-in-class security practices for greater customer success</span></li></ul><p><strong>Process</strong></p><ul><li><span>Assess and refine our Agile/SCRUM process by collaborating with Product Management, Sales and Support</span></li><li><span>Understand and improve our existing operations and planning processes to elevate the output and quality of our operations team</span></li></ul><p><strong>Direction</strong></p><ul><li><span>Direct and develop our operational resources by prioritizing and delegating across multiple projects and initiatives</span></li><li><span>Optimize resource efficiency and help technical leads and team leads continuously make better tradeoffs</span></li><li><span>Create a security roadmap for an organization with enterprise grade customers</span></li></ul><p><strong>Leadership</strong></p><p><em><span>Technical</span></em></p><ul><li><span>Understand the technical decisions that are being made by your operations team and synthesize &nbsp;their decisions into &nbsp;your decision-making process</span></li><li><span>Leverage your technical leadership to refine Product Management’s 6-month roadmap into tangible, and technically practical deliverables </span></li><li><span>Seek out meaningful certifications and security measures to increase our customers confidence in the delivery of our SaaS solution </span></li><li><span>Adopt a CI/CD mindset that is more advanced (and more beneficial) than our current DevOps mentality to accelerate deployments, reduce cost of ownership, and maintain quality</span></li><li><span>Understand and simplify the complexities of maintaining both on-premise installations as well as SaaS installation of the same technology stack</span></li></ul><p><em><span>Team</span></em></p><ul><li><span>Understand the skills and capacity of your team and how to best utilize them to achieve our goals </span></li><li><span>Identify and employ data to empower your team’s continuous improvement</span></li><li><span>Develop career paths for your engineers and provide opportunities and feedback that will help them pursue those paths</span></li></ul><p><em><span>Organizational</span></em></p><ul><li><span>Analyze departmental spending and collaborate with Product Management to capture ROI; evangelize findings to senior leadership</span></li><li><span>Coordinate cross-functional dependencies with a 360° leader mentality (</span><em><span>i.e.</span></em><span>, an ability to influence up, down and laterally across the organization) &nbsp;</span></li><li><span>Understand the tradeoffs and impact of decisions at the resource, technical and product level</span></li></ul><p><strong>Required Experience</strong></p><ul><li><span>5+ years of experience managing cloud operations experience with and strong knowledge of Microsoft Azure, Amazon Web Services, Google Cloud Platform, or other cloud platforms</span></li><li><span>2+ years of experience managing a team of at least 5 engineers </span></li><li><span>2+ years as an operations engineer yourself</span></li><li><span>3+ years of CI/CD experience</span></li><li><span>1+ years of experience working in an agile development environment</span></li><li><span>Expertise in cloud security compliance, including experience with security audits</span></li><li><span>Experience hosting 300+ customers in the cloud; enterprise customers highly preferred</span></li><li><span>Ability to communicate verbally and in writing with both technical and business people in terms that they understand</span></li></ul><p><em><span>EMS Software is proud to be an Equal Opportunity Employer. Applicants are considered for all positions without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, ancestry, marital or veteran status. We are committed to hiring a diverse and talented workforce, supporting integrity in the workplace and an entrepreneurial atmosphere.</span></em></p>                    </div>                            <h2>                About EMS Software            </h2>            <div><p>EMS Software offers the most comprehensive, cutting-edge platform to enable innovative work and learning environments. We make it easier to connect people with space, resources, and technology – allowing them to collaborate flawlessly, make informed business decisions, and get more out of each day.</p><p><em>EMS Software is an equal opportunity employer. In order to provide equal employment and advancement opportunities to all individuals, employment decisions at EMS Software will be based on merit, qualifications, and abilities. EMS Software does not discriminate against any person because of race, color, creed, religion, sex, sexual orientation, national origin, ancestry, disability, veteran status, age or any other characteristic protected by law.</em></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Medical, dental and vision plans                            </div>                            <div>                                 Physical fitness reimbursement plan and on-site fitness center                            </div>                            <div>                                 Self-Directed PTO                            </div>                            <div>                                 Flexible work environment and remote work options                            </div>                            <div>                                 Competitive compensation and employer-matched 401(k) savings plan                            </div>                            <div>                                 &quot;Bug hunts,&quot; casual dress code, open floor plan, collaboration spaces                            </div>                            <div>                                 Two blocks from the Arapahoe Village Center RTD Station                            </div>                            <div>                                 Walking distance to numerous bars, restaurants and coffee shops                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_google-cloud-platform",
      "TECH2_amazon-web-services",
      "TECH2_iaas",
      "TITLE1_manager",
      "REMOTE1_100",
      "TECH2_azure",
      "TZ_unknown",
      "TECH2_cloud"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "azure",
      "cloud",
      "google-cloud-platform",
      "iaas"
    ]
  },
  {
    "id": "mw4vT7L5RtCYMI9h6WZQ2Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156831/engineering-manager-formstack?a=QAXZRDVDxy8",
    "title": "Engineering Manager at Formstack (Indianapolis, IN) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, SaaS, Web Technology</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span>Formstack, the most flexible and powerful form building application, is looking for an </span><span><strong>Engineering Manager</strong>&nbsp;to add to its already awesome Dev team!</span></p><p>Formstack&nbsp;is an 11&nbsp;year old company with its roots in Indianapolis. Our customers span 110 different countries, and our employees live and work across the U.S. and the globe. We provide a remote work environment that is flexible and provides great freedom for those who can perform.</p><p><strong>What You Will Do:</strong></p><p>You will work directly with the product managers and product design leads to help scope and hand off product features to the development team. Responsibilities include tracking team performance, setting and meeting goals, managing expectations, and delivering software on a deadline.</p><p>The majority of this role will be to manage people, projects and timelines. You should have an understanding of software development and be comfortable helping out when needed.</p><p><strong>Who You Are:</strong></p><p>You are a great leader, listener, decision maker, and can think on your feet. You believe people should lead by example. You have great attention to detail and enjoy keeping track of the who, what, when, where, and why. Constantly thinking about how to improve the development process keeps you up at night. You put your team ahead of yourself and try to do what's best for all parties involved. You aren't scared to make mistakes and try new things to achieve your objectives. You are comfortable not always knowing the answer and without a doubt a great communicator.</p><p><strong>Who We Are:</strong></p><p>We are a group of people who care about our customers and our teammates. We love what we do and what it means to our clients. Relationships are very important to us and we strive to create an environment where you can solve problems creatively and be yourself. We enjoy posting gifs (hard G) to Slack, playing Overwatch, eating lunch on camera (remote lunch get-togethers) and supporting each other. We believe strongly in a work/life balance and letting teams make their own decisions.</p><p><strong>Requirements</strong></p><ul><li>Demonstrated success &nbsp;working in a development environment</li><li>Proven success as a team lead or similar position</li><li>Comfortable managing a team of up to 6-8 developers and QA Analysts (we work in x-functional teams)</li><li>Excellent written and oral communication skills</li><li>Comfortable with agile methodologies &amp; scrum</li><li>Proven ability to manage a remote team of software developers</li><li>Strong experience with PHP, Python, MySQL, Angular and JavaScript</li><li>Passion for quality. Code coverage with unit tests should be as complete as possible. Strive for performance and correctness.</li></ul><p><strong>Extra Credit</strong></p><ul><li>Experience working and managing teams over multiple time zones</li><li>Experience using JIRA or similar software</li></ul><p><strong>What Formstack Offers:</strong></p><ul><li>Remote environment</li><li>Medical, Dental, Vision as well as company-paid Disability and Life Insurance Benefits.</li><li>401k with matching company contribution</li><li>Friday Lunch (Indianapolis Office)</li><li>The most up-to-date technology, including company-issued Macs, the latest software and other tools needed to excel at your job</li><li>Company-paid conferences and extended learning</li><li>Yearly company gatherings</li><li>Generous PTO</li></ul><p>Want to learn more about who we are and what we value?&nbsp;<a href='http://fast.wistia.net/embed/iframe/18hybe1npy?canonicalUrl=https%3A%2F%2Fwww.formstack.com%2Fabout&amp;canonicalTitle=About%20Our%20Team%20%C2%B7%20Formstack' rel='nofollow'>Check out this Video</a>&nbsp;and apply if you want to jump into the next great chapter of your life!</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 The most up-to-date software                            </div>                            <div>                                 401k Safe Harbor Match                            </div>                            <div>                                 Lunch everyday paid for by Formstack (for employees in Indianapolis)                            </div>                            <div>                                 Generous PTO policy                            </div>                            <div>                                 Remote working office                            </div>                            <div>                                 All the snacks you can handle                            </div>                            <div>                                 Company-contributions to HSA                            </div>                            <div>                                 Monthly company &quot;fun&quot;                            </div>                            <div>                                 Yearly team-building event for the whole company                            </div>                            <div>                                 All the pings and pongs you can handle!                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_php",
      "REMOTE1_50",
      "TECH2_lead",
      "TITLE1_manager",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "lead",
      "php"
    ]
  },
  {
    "id": "UURZqNGGSOKrPGBaljOHng",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/154313/director-data-science-insights-achievement-network?a=PKBTCawBKfe",
    "title": "Director, Data Science & Insights at Achievement Network (Boston, MA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Data Scientist</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Education, Non-Profit</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><em>Location: &nbsp;Flexible (Boston, MA or New England region preferred)</em></p><p><em>Position available: November 2017</em></p><p><strong><strong>THE OPPORTUNITY</strong></strong></p><p>We are seeking a Director to join the Organizational &nbsp;Effectiveness (OE) team. &nbsp;The OE team ensures that ANet has the right goals that motivate and drive us to achieve our mission, spearheads our shared organizational focus on improving our core service model, and builds a research mindset and capability across ANet’s internal teams. This role reports to the Vice President, Org Effectiveness and is the ideal position for someone who has a passion for growing an organization’s confident use of data in order to shape strategic decisions and to deepen its long-term impact.</p><p>ANet is flexible to remote working, with occasional travel to ANet’s National Office in Boston. Therefore, proximity to the New England area and/or eastern time zone is preferable.</p><p><strong>WHAT YOU’LL DO</strong></p><p><strong>Examine our organizational impact on school performance and hone our organizational focus on impacting school practice</strong></p><ul><li><strong><strong>Lead organization-wide school and student learning impact reporting against annual goals &nbsp;</strong></strong></li></ul><ul><ul><ul><li>Manage complex analyses to extract new insights and year-over-year data patterns that convey a clear, compelling picture of ANet’s national impact over time</li><li>Convey results on goals in a way that is user-friendly and compelling for internal teams &nbsp;and that can be used for external generalist audiences (i.e. impact statements)</li><li>Leverage strong visualizations and presentations to boost end user (primarily senior leadership &amp; marketing/business development teams) comprehension of national impact results</li></ul></ul></ul><ul><li><strong><strong>Lead impact analyses that test and improve ANet’s core service model</strong></strong></li></ul><ul><ul><li>Execute organization-wide annual analyses that identify the relationships between state assessment outcomes (student and school performance) and internal practice with inputs data sources (school demographic data, school practice data, partner school survey data, etc.)</li><li>Conduct complex analyses to &nbsp;extract relevant findings/insights and year-over-year data patterns to share with senior leadership tied to 2020 strategic plan and impact vision</li><li>Partner closely with key business leads to identify annual prioritized research questions, drawing from prior years’ results, annual strategic goals, and ongoing learning agenda priorities</li></ul></ul><ul><li><strong>Lead reporting and analysis of ANet’s evolving non-core service model offerings to assess impact</strong></li></ul><p><strong>Lead long-cycle learning on ANet’s core service model, primarily via mix of data collection and analytic improvement strategies</strong></p><ul><li><strong><strong>Lead data characterization and analyses of newer ANet data sources to deepen ANet’s ability to test and improve its core service model</strong></strong></li></ul><ul><ul><li>Lead exploratory analyses of school partner data to produce new, actionable findings that accelerate improving ANet’s core service model and other service offerings</li><li>In collaboration with other OE team members and internal clients, set key research questions</li><li>Partner with key internal product and program teams to finalize use cases and baseline set definitions, metrics, and modes of analyses</li><li>Define reporting requirements for Engineering team</li><li>Examine and conduct feasibility checks of data in Google Analytics and identify and establish business and analytic rules for using tools such as unSampler</li><li>Explore opportunities with the Engineering team to identify longer-term data storage and cloud solutions</li></ul></ul><p><strong><strong>WHO YOU ARE &amp; WHAT YOU BRING</strong></strong></p><p>Must Have:</p><ul><li>You have prior experience and success designing and leading internal program evaluations and/or business intelligence projects for scaling organizations.</li><li>You bring proficiency and versatility with Excel and at least one statistical analysis software package (R, SAS, Stata, or SPSS) and are confident in advising others on matching the right analytic tool to the analytic task at hand.</li><li>You are optimistic that all of our schools can be successful if we learn together and that comes through in your facility with analyzing information and communicating complex findings to both technical and non-technical audiences.</li></ul><ul><li>You bring proficiency with data visualization software (i.e. Tableau) and website usage analytics and software tools (Google Analytics).</li><li>You are motivated by working in an environment where we live out our core values daily and are eager to examine personal archetypes and biases while discussing topics related to race, class, and privilege which relate to ANet’s Advance Equity and People Matter values</li></ul><p>Nice to Have:</p><ul><li>Prior experience in a school, education, or non-profit setting</li><li>Degree in quantitative field, program evaluation, analytics, or statistics</li><li>Proficiency with unSampler</li><li>SQL proficiency</li></ul><p><strong><em>ANet is committed to maximizing the diversity of our organization. We are an equal opportunity employer and encourage individuals of all ethnic and racial backgrounds and gender identities to apply to our positions.</em></strong></p>                    </div>                            <h2>                About Achievement Network            </h2>            <div><p>Achievement Network (ANet) is a nonprofit dedicated to educational equity. We help schools boost student learning with great teaching that’s grounded in standards, informed by data, and built on the successful practices of educators around the country.</p><p>Founded in 2005, ANet now serves over 700 schools educating over 230,000 students in California, Colorado, Connecticut, District of Columbia, Illinois, Louisiana, Massachusetts, Michigan, New Jersey, New York, Ohio, and Tennessee. Our support has consistently helped our partner schools—both district and charter—achieve breakthrough results for their students. ANet has received multiple awards and recognitions, including a prestigious Investing In Innovation (i3) grant from the federal government in 2010, New Schools Venture Fund’s “Organization of the Year” in 2011, and The NonProfit Time’s “Best Nonprofits to Work For” in 2015 and 2016.</p><p>ANet is a dynamic, values driven, team-oriented organization that is committed to the growth and development of all staff members. Individuals who join ANet have the opportunity to join an exceptional team of colleagues committed to helping schools drive excellent teaching and learning by investing in each other and learning together.</p><p><strong>WHAT WE OFFER</strong></p><p>ANet offers highly competitive compensation based on prior experience and qualifications as well as comprehensive benefits in order to best support our people. Benefits we offer include: health, dental and vision insurance where ANet pays 80% of the cost of these benefits for employees and their families/domestic partner; 3 weeks of vacation (4 weeks after two years with ANet); 10 paid holidays with paid days off between the Christmas and New Year’s holidays; a paid floating holiday; paid sick &amp; personal days; paid parental leave; retirement plan options; commuter benefits; tuition reimbursement; &nbsp;flexible spending accounts; short and long-term disability coverage; and basic life and personal accident insurance.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 80% Health, Dental, Vision                            </div>                            <div>                                 3 Weeks Vacation                            </div>                            <div>                                 10 Paid Holidays                            </div>                            <div>                                 Paid Parental Leave                            </div>                            <div>                                 Retirement Plan Options                            </div>                            <div>                                 Flexible Spending Accounts                            </div>                            <div>                                 Short and Long-Term Disability Coverage                            </div>                            <div>                                 Basic Life and Personal Accident Insurance                            </div>                            <div>                                 Tuition Reimbursement                            </div>                            <div>                                 Commuter Benefits                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_business-intelligence",
      "TECH2_r",
      "REMOTE1_50",
      "TITLE1_manager",
      "TECH2_sql",
      "TZ_America_East",
      "TECH2_google-analytics",
      "TECH2_tableau"
    ],
    "tagsNames1": [
      "50% remote",
      "US East timezone"
    ],
    "tagsNames2": [
      "business-intelligence",
      "google-analytics",
      "r",
      "sql",
      "tableau"
    ]
  },
  {
    "id": "QO95OdaeSy25gzLvhQQDdQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156126/ui-engineering-manager-leading-open-source-elastic?a=Qmj8KEracJa",
    "title": "UI Engineering Manager- Leading Open Source Company at Elastic () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Lead, Manager</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Data &amp; Analytics, Search, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>501-1k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>With Elastic's continued growth, we are looking for a talented, attentive Engineering Manager to propel and guide our team. Do you feel at home nurturing the success of dynamic, wold class engineers? Are you a top Software Engineering Managers who want to support and lead engineers on Kibana and X-Pack, robust tools which allow visual exploration, real-time data analysis in addition to other powerful features, all while working on core frontend applications? Than we want to meet you.</p><p>If you read this far and think, “that's me!” then you probably won't need to read any further and we should have a conversation. But if you are in any doubt the type of experiences we expect you to have then the following should help clarify;</p><p><em><strong>Please include a short note as to wire you are a fit for Elastic and this role </strong></em></p><p><strong>Kibana is the window into the Stack</strong></p><p>Kibana lets users visualize their Elasticsearch data and navigate the Elastic Stack, so they can do anything from learning why they’re getting paged at 2:00 a.m. to understanding the impact rain might have on their quarterly numbers. Kibana gives users the freedom to select the way they give craft to their data. And they don’t always have to know what they’re looking for. With its interactive visualizations, users start with one question and see where it leads them. Kibana core ships with the classics: histograms, line graphs, pie charts, sunbursts, and more. They demonstrate the full aggregation capabilities of Elasticsearch.</p><p><strong>Engineering Philosophy</strong></p><p>Engineering a highly complex distributed system that is easy to operate via elegantly designed APIs is a non-trivial effort. It requires solid software development skills, and more importantly, a sharp mind and the ability to think like a user. We also care deeply about giving you full ownership of what you’re working on. Our company fundamentally believes great minds achieve greatness when they are set free and are surrounded and challenged by their peers, which is clearly visible in our organization. At Elastic, we effectively don’t have a hierarchy to speak of. We feel that anyone needs to be in the position to comment on absolutely anything, regardless of his or her role within the company.</p><p><strong>What you will be doing:</strong></p><ul><li>Day to day management of 10-15 engineers</li><li>Hiring and recruiting of new staff</li><li>Performance management, reviews and quarterly feedback for the team</li><li>Expense management and approval</li><li>Vacation and time off management and approval</li><li>Project management and prioritization support for the team</li><li>Management of roadmaps and requirements against release targets</li></ul><p><strong>What you've done:</strong></p><ul><li>3+ years of software engineering management</li><li>Recent experience leading teams producing complex interactive web experiences</li><li>An engineering background with a B.S. or equivalent in a Software Engineering related domain</li><li>Experience leading distributed teams</li><li>Experience leading an open source product team</li><li>Familiarity with JavaScript and one or more UI framework: AngularJS, React, Node.js etc...</li></ul>                    </div>                            <h2>                About Elastic            </h2>            <div><p>Elastic is the world's leading software provider for making structured and unstructured data usable in real time for search, logging, security, and analytics use cases. Founded in 2012 by the people behind the Elasticsearch, Kibana, Beats, and Logstash open source projects, Elastic's global community has more than 80,000 members across 45 countries, and since its initial release. Elastic's products have achieved more than 100 million cumulative downloads. Today thousands of organizations, including Cisco, eBay, Dell, Goldman Sachs, Groupon, HP, Microsoft, Netflix, <em>The New York Times</em>, Uber, Verizon, Yelp, and Wikipedia, use the Elastic Stack, X-Pack, and Elastic Cloud to power mission-critical systems that drive new revenue opportunities and massive cost savings. Elastic is backed by more than $104 million in funding from Benchmark Capital, Index Ventures, and NEA; has headquarters in Amsterdam, the Netherlands, and Mountain View, California; and has over 400 employees in more than 30 countries around the world.</p><p><strong>Additional Information</strong></p><ul><li>Competitive pay and benefits</li><li>Stock options</li><li>Catered lunches, snacks, and beverages in most offices</li><li>An environment in which you can balance great work with a great life</li><li>Passionate people building great products</li><li>Employees with a wide variety of interests</li><li>Your age is only a number. It doesn't matter if you're just out of college or your children are; we need you for what you can do.</li></ul><p>Elastic is an Equal Employment employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status or any other basis protected by federal, state or local law, ordinance or regulation. Elastic also makes reasonable accommodations for disabled employees consistent with applicable law.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 401k Matching Up to 6 % in US and Pensions in some other countries                            </div>                            <div>                                 Health Care Insurance                            </div>                            <div>                                 Vacation Time Determined By Location                            </div>                            <div>                                 Lunch and Breakfast in Most Offices                            </div>                            <div>                                 100% Remote work possible                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_reactjs",
      "TECH2_user-interface",
      "TECH2_node.js",
      "REMOTE1_50",
      "TITLE1_manager",
      "TECH2_javascript",
      "TZ_America_East",
      "TECH2_elasticsearch"
    ],
    "tagsNames1": [
      "50% remote",
      "US East timezone"
    ],
    "tagsNames2": [
      "elasticsearch",
      "javascript",
      "node.js",
      "reactjs",
      "user-interface"
    ]
  },
  {
    "id": "TWKkQvyGS_i-cH8YLmlWGg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5649-inside-sales-executive",
    "title": "Teamup: Inside Sales Executive",
    "content": "<div>  <div>    <h2>Inside Sales Executive</h2>      <h4>Posted Nov  2</h4>    <h3>      <span>Teamup</span><br>      <span>Headquarters: United Kingdom</span><br>        <a href='https://teamup.breezy.hr/p/5b666fa1d2c8-inside-sales-executive?source=weworkremotely' rel='nofollow'>https://teamup.breezy.hr/p/5b666fa1d2c8-inside-sales-executive?source=weworkremotely</a>    </h3>  </div>    </div>  <div>    <div>ABOUT US!</div><div></div><div></div><div><br></div><div>Teamup (goteamup.com) is an all-in-one business management solution for independent fitness businesses. Our customers include businesses like CrossFit gyms, yoga studios, martial arts centres, and more.</div><div></div><div></div><div><br></div><div>Since 2012, teamup has helped thousands of businesses take control of payments, scheduling, and member management.</div><div><br></div><div>Our remote team of 10 is currently based in the UK, US, and Spain.</div><div><br></div><div>THE JOB</div><div><br></div><ul><li>Qualifying potential customers<br><br></li><li>Handling incoming enquiries<br><br></li><li>Managing the sales pipeline<br><br></li><li>Following up consistently<br><br></li><li>Using data to identify opportunities (we’ll show you how)<br><br></li><li>Phone and email communication with customers and prospects<br></li></ul><div></div><div><br></div><div>YOU HAVE</div><div><br></div><ul><li>Native-level English proficiency and are excited to work directly with customers via email, phone or screen share<br><br></li><li>Ability to engage potential customers by phone, and understand their requirements.<br><br></li><li>Determination for every customer to have a great experience with teamup and a desire to take responsibility for the customers you are helping<br><br></li><li>Experience working in a remote environment (comfortable primarily communicating over platforms like Close.io, Hipchat, Skype, Basecamp, ZenDesk, Jira etc.)<br><br></li><li>Computer literacy<br><br></li><li>The schedule to work Monday through Friday, 9am - 5:30pm UK time, with ability to cover some hours during evenings, weekends and on public holidays if required<br></li></ul><div></div><div><br></div><div>ESSENTIAL TO HAVE (bonus points for both)</div><div></div><div></div><div><br></div><ul><li>Experience of fitness businesses<br><br></li></ul><ul><li>Experience working in the software industry<br></li></ul><div></div><div></div><div><br></div><div>WHY WORK FOR US?</div><div></div><div></div><div><br></div><div>We’re a very small team doing very big things — your work will make a huge impact and your voice will be heard! We offer a competitive salary, gym membership, team meet ups and a great team atmosphere to help you achieve your best work.</div><div></div><div></div><div><br></div><div>Salary</div><div><br></div><div>£21,000 per annum</div><div></div><div></div><div><br></div><div>To apply for the position of Inside Sales Executive please complete the below steps:</div><div></div><div></div><div><br></div><div>1. Send a copy of your CV</div><div><br></div><div>2. Send a cover letter explaining why you think you're suitable for the role</div><div><br></div><div>3. Please call +44 20 3808 8576. We will ask you for your name and number and a question focused on the customer experience, with answers to be left as a voicemail. Please take as many attempts as you like at this. We understand that you aren’t fully familiar with teamup yet.<br></div><div>We'll only consider applicants who complete all 3 steps.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://teamup.breezy.hr/p/5b666fa1d2c8-inside-sales-executive?source=weworkremotely' rel='nofollow'>https://teamup.breezy.hr/p/5b666fa1d2c8-inside-sales-executive?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 2:38:11 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "bGOjdxIOR_KkmGZ9mvKCvg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62379",
    "title": "Head of Support",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Hiya! We’re SkyVerge and we love eCommerce. Our products help merchants manage and grow their online stores, all the way from boutique corner shops to Fortune 500 retailers. We’re looking for a Head of Support to join our fully-distributed team who will improve our support team and processes across our entire suite of products.<br><br><strong>Role</strong><br><br>You’ll be focused on ensuring that our customer support across our products and the platforms we work with continues to meet our high standards, and is constantly improving. You’ll be coaching support and engineering team members on tone and process, doing everything from reviewing drafts, spot-reading replies, assisting in de-escalating difficult threads, to tracking and improving team metrics on replies, response times, and response quality.<br><br>We know that the best learning and understanding comes from hands-on experience, so you’ll also be rolling up your sleeves to assist with support and pre-sales questions across our product suite. We have over 70 different products, so you’re excited that there’s always something new to learn.<br><br>You’ll have the opportunity to dive in and question everything: is what we’re doing effective? How are we measuring success? What standards are we setting? How can we improve and unify process across all products we support? Are our tools supporting our goals?<br><br>We expect that our head of support will be pushing our team forward on customer service best-practices, impeccable tone and voice, accuracy in replies, great supporting documentation, maintaining an internal knowledge base, and overall ensuring that our organization’s support runs as efficiently and seamlessly as a Swiss watch. We have several amazing team members already supporting our customers every day; you’ll be working directly with them to take our support to new heights.<br><br>We expect you to work closely with our product and development teams to ensure we’re building great products, have solid feedback loops in place for further improvements, and that customers get the help they need while running their businesses.<br><br><strong>You</strong><br><br>You have a remarkable knack for understanding our customers’ problems, and working together with them to understand our products and resolve issues. You know good customer service comes from a place full of empathy, helpfulness, and friendliness. Your written communication is crystal-clear and representative of the standards our team should work towards.<br><br>You’re solutions-oriented, self-directed, curious, and love solving problems. No question is too difficult for you to research, critically evaluate current best-practices, then develop your own path forward for an optimal solution or potential improvements. You can do this on your own, or work with a team to drive a project forward. You question existing practices and seek out the “best” way to do things.<br><br>To succeed in this role, you’ll have:<br><br></p><ul><li>excellent written communication and native-level English fluency. (Do you have proficiency in other languages? Tell us! We love being able to support customers in their native language.)<br></li><li>ability to thrive in a remote environment (along with a reliable internet connection).<br></li><li>above-average skills for reporting on and evaluating data &amp; support metrics.<br></li><li>boundless curiosity and inquisitiveness for our products and how we can do things better.<br></li><li>high technical competency, such as ability to use FTP, launch a website from scratch, and understand software development in general.<br></li><li>proficiency with HTML / CSS.<br></li><li>experience writing technical documentation or guides.<br></li><li>experience in previous team captain or leadership roles.<br></li><li>experience in supporting software (downloadable or SaaS, we do both!).<br><br>It’s helpful if you have:<br><br></li><li>experience with eCommerce, or with platforms we work with in particular (Shopify, WooCommerce, Easy Digital Downloads).<br></li><li>experience in building, fixing, or maintaining software (if you have PHP, JavaScript, Ruby, etc., skills, let us know).<br></li><li>previous experience working remotely.<br></li><li>are US or CA-based for maximum overlap with our existing support team.<br><br>Our team is fully-remote and we communicate primarily through Slack, GitHub, Help Scout, and weekly stand-ups on Monday via Zoom (a few short meetings on Monday) — we believe the best work happens when given lots of uninterrupted time that’s free of distractions. That said, we believe face time is valuable — availability for 1-2 company-paid team trips (<a href='https://www.skyverge.com/blog/skytrip-2017-recap/' rel='nofollow'>SkyTrip!</a>) per year is necessary.<br>This is a full-time, salaried position, but hours are flexible. We know your work will speak for itself with support metric improvements, documentation added, and wiki edits.<br><br><strong>Process</strong><br><br>Qualified candidates will get an email with a few questions to answer via email. Following that, you’ll have a few 30-minute phone chats with different people on our team to learn more about you and answer any questions you have about the position and company. <br><br>If this goes well, we’ll invite you to join our team and start your 4-week trial. During this period, you’ll work full-time as a contractor, or part-time on nights/weekends if you already have a full-time position. This gives you an opportunity to make sure you enjoy the work and the team, and it gives us an opportunity to evaluate your work. We’ll have regular chats each week to share feedback and make sure we’re on the same page. At the end of the 4 weeks, you’ll be offered a permanent position  <br><br><strong>Benefits</strong><br><br>Here are some benefits we're excited to offer to our team members:<br><br></li><li>Competitive salary<br></li><li>Annual incentive for meeting team and company goals<br></li><li>25 days of paid time-off, in addition to 2 company holidays (SkyVerge Day in March, Founders Day in June )<br></li><li>Medical, Dental, and Vision insurance for US and Canadian residents and their families (reimbursements for comparable care for non-US/Canadian residents)<br></li><li>401k/RRSP Retirement plan with 4% company match for US/Canadian residents (contributions to comparable plans for non-US/Canadian residents)<br></li><li>Work from anywhere that has a reliable internet connection<br></li><li>The tools (hardware/software) you need to be productive<br></li><li>Allowance for professional growth (books, courses, conferences)<br></li><li>Home office or co-working allowance<br></li><li>A Kindle to help you keep learning<br><br><em>We support workplace diversity and do not discriminate on any protected class. We believe when we work together as a team of different views, experiences, and ideas, we can build amazing things.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 6:20:34 AM",
    "tags": [
      "TZ_America",
      "REMOTE1_50",
      "TITLE1_manager"
    ],
    "tagsNames1": [
      "50% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "lx3drtFWQtqVDY9u6OL4SQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5634-head-of-support",
    "title": "SkyVerge: Head of Support",
    "content": "<div>  <div>    <h2>Head of Support</h2>      <h4>Posted Oct 31</h4>    <h3>      <span>SkyVerge</span><br>      <span>Headquarters: Remote</span><br>        <a href='http://www.skyverge.com' rel='nofollow'>www.skyverge.com</a>    </h3>  </div>    </div>  <div>    <div>Hiya! We’re SkyVerge and we love eCommerce. Our products help merchants manage and grow their online stores, all the way from boutique corner shops to Fortune 500 retailers. We’re looking for a Head of Support to join our fully-distributed team who will improve our support team and processes across our entire suite of products.</div><div><br></div><div></div><div><span><b>Role</b></span></div><div><br></div><div></div><div><span>You’ll be focused on ensuring that our customer support across our products and the platforms we work with continues to meet our high standards, and is constantly improving. You’ll be coaching support and engineering team members on tone and process, doing everything from reviewing drafts, spot-reading replies, assisting in de-escalating difficult threads, to tracking and improving team metrics on replies, response times, and response quality.</span></div><div><br></div><div></div><div><span>We know that the best learning and understanding comes from hands-on experience, so you’ll also be rolling up your sleeves to assist with support and pre-sales questions across our product suite. We have over 70 different products, so you’re excited that there’s always something new to learn.</span></div><div><br></div><div></div><div><span>You’ll have the opportunity to dive in and question everything: is what we’re doing effective? How are we measuring success? What standards are we setting? How can we improve and unify process across all products we support? Are our tools supporting our goals?</span></div><div><br></div><div></div><div><span>We expect that our head of support will be pushing our team forward on customer service best-practices, impeccable tone and voice, accuracy in replies, great supporting documentation, maintaining an internal knowledge base, and overall ensuring that our organization’s support runs as efficiently and seamlessly as a Swiss watch. We have several amazing team members already supporting our customers every day; you’ll be working directly with them to take our support to new heights.</span></div><div><br></div><div></div><div><span>We expect you to work closely with our product and development teams to ensure we’re building great products, have solid feedback loops in place for further improvements, and that customers get the help they need while running their businesses.</span></div><div><br></div><div></div><div><span><b>You</b></span></div><div><br></div><div></div><div><span>You have a remarkable knack for understanding our customers’ problems, and working together with them to understand our products and resolve issues. You know good customer service comes from a place full of empathy, helpfulness, and friendliness. Your written communication is crystal-clear and representative of the standards our team should work towards.</span></div><div><br></div><div></div><div><span>You’re solutions-oriented, self-directed, curious, and love solving problems. No question is too difficult for you to research, critically evaluate current best-practices, then develop your own path forward for an optimal solution or potential improvements. You can do this on your own, or work with a team to drive a project forward. You question existing practices and seek out the “best” way to do things.</span></div><div><br></div><div></div><div><span>To succeed in this role, you’ll have:</span></div><div><br></div><div></div><ul><li><span>excellent written communication and native-level English fluency. (Do you have proficiency in other languages? Tell us! We love being able to support customers in their native language.)</span></li><li><span>ability to thrive in a remote environment (along with a reliable internet connection).</span></li><li><span>above-average skills for reporting on and evaluating data &amp; support metrics.</span></li><li><span>boundless curiosity and inquisitiveness for our products and how we can do things better.</span></li><li><span>high technical competency, such as ability to use FTP, launch a website from scratch, and understand software development in general.</span></li><li><span>proficiency with HTML / CSS.</span></li><li><span>experience writing technical documentation or guides.</span></li><li><span>experience in previous team captain or leadership roles.</span></li><li><span>experience in supporting software (downloadable or SaaS, we do both!).</span></li></ul><div><span><br></span></div><div></div><div><span>It’s helpful if you have:</span></div><div><br></div><div></div><ul><li><span>experience with eCommerce, or with platforms we work with in particular (Shopify, WooCommerce, Easy Digital Downloads).</span></li><li><span>experience in building, fixing, or maintaining software (if you have PHP, JavaScript, Ruby, etc., skills, let us know).</span></li><li><span>previous experience working remotely.</span></li><li><span>are US or CA-based for maximum overlap with our existing support team.</span></li></ul><div><span><br></span></div><div></div><div><span>Our team is fully-remote and we communicate primarily through Slack, GitHub, Help Scout, and weekly stand-ups on Monday via Zoom (a few short meetings on Monday) — we believe the best work happens when given lots of uninterrupted time that’s free of distractions. That said, we believe face time is valuable — availability for 1-2 company-paid team trips (<a href='https://www.skyverge.com/blog/skytrip-2017-recap/' rel='nofollow'><span>SkyTrip!</span></a>) per year is necessary.</span></div><div><br></div><div></div><div><span>This is a full-time, salaried position, but hours are flexible. We know your work will speak for itself with support metric improvements, documentation added, and wiki edits.</span></div><div><br></div><div></div><div><span><b>Process</b></span></div><div><br></div><div></div><div><span>Qualified candidates will get an email with a few questions to answer via email. Following that, you’ll have a few 30-minute phone chats with different people on our team to learn more about you and answer any questions you have about the position and company.</span></div><div><br></div><div></div><div><span>If this goes well, we’ll invite you to join our team and start your 4-week trial. During this period, you’ll work full-time as a contractor, or part-time on nights/weekends if you already have a full-time position. This gives you an opportunity to make sure you enjoy the work and the team, and it gives us an opportunity to evaluate your work. We’ll have regular chats each week to share feedback and make sure we’re on the same page. At the end of the 4 weeks, you’ll be offered a permanent position </span></div><div><br></div><div></div><div><span><b>Benefits</b></span></div><div><br></div><div></div><div><span>Here are some benefits we're excited to offer to our team members:</span></div><div><br></div><div></div><ul><li><span>Competitive salary</span></li><li><span>Annual incentive for meeting team and company goals</span></li><li><span>25 days of paid time-off, in addition to 2 company holidays (SkyVerge Day in March, Founders Day in June )</span></li><li><span>Medical, Dental, and Vision insurance for US and Canadian residents and their families (reimbursements for comparable care for non-US/Canadian residents)</span></li><li><span>401k/RRSP Retirement plan with 4% company match for US/Canadian residents (contributions to comparable plans for non-US/Canadian residents)</span></li><li><span>Work from anywhere that has a reliable internet connection</span></li><li><span>The tools (hardware/software) you need to be productive</span></li><li><span>Allowance for professional growth (books, courses, conferences)</span></li><li><span>Home office or co-working allowance</span></li><li><span>A Kindle to help you keep learning</span></li></ul><div><span><br></span></div><div></div><div><span><i>We support workplace diversity and do not discriminate on any protected class. We believe when we work together as a team of different views, experiences, and ideas, we can build amazing things.</i></span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply directly via this link: <a href='https://skyverge.workable.com/jobs/600766' rel='nofollow'>https://skyverge.workable.com/jobs/600766</a>. Applications accepted until November 17th.</p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 6:00:59 AM",
    "tags": [
      "TZ_America",
      "REMOTE1_50",
      "TITLE1_manager"
    ],
    "tagsNames1": [
      "50% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "LaW4PmfgR4qjK-C8hghc1w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/62938/inside-sales-executive-at-teamup-sports-inc/",
    "title": "Inside Sales Executive",
    "content": "ABOUT US!<br /><br />Teamup (goteamup.com) is an all-in-one business management solution for independent fitness businesses. Our customers include businesses like CrossFit gyms, yoga studios, martial arts centres, and more.<br /><br />Since 2012, teamup has helped thousands of businesses take control of payments, scheduling, and member management. <br /><br />Our remote team of 10 is currently based in the UK, US, and Spain. <br /><br />THE JOB<br /><br />Qualifying potential customers<br />Handling incoming enquiries<br />Managing the sales pipeline<br />Following up consistently<br />Using data to identify opportunities (we’ll show you how)<br />Phone and email communication with customers and prospects<br /><br />YOU HAVE<br /><br />Native-level English proficiency and are excited to work directly with customers via email, phone or screen share<br />Ability to engage potential customers by phone, and understand their requirements.<br />Determination for every customer to have a great experience with teamup and a desire to take responsibility for the customers you are helping<br />Experience working in a remote environment (comfortable primarily communicating over platforms like Close.io, Hipchat, Skype, Basecamp, ZenDesk, Jira etc.)<br />Computer literacy <br />The schedule to work Monday through Friday, 9am - 5:30pm UK time, with ability to cover some hours during evenings, weekends and on public holidays if required<br /><br />ESSENTIAL TO HAVE (bonus points for both)<br /><br />Experience of fitness businesses<br />Experience working in the software industry <br /><br /><br />WHY WORK FOR US?<br /><br />We’re a very small team doing very big things — your work will make a huge impact and your voice will be heard! We offer a competitive salary, gym membership, team meet ups and a great team atmosphere to help you achieve your best work.<br /><br />Salary <br />£21,000 per annum <br /><br />To apply for the position of Inside Sales Executive please complete the below steps:<br /><br />1. Send a copy of your CV<br />2. Send a cover letter explaining why you think you're suitable for the role<br />3. Please call +44 20 3808 8576. We will ask you for your name and number and a question focused on the customer experience, with answers to be left as a voicemail<br /><br />We'll only consider applications who complete all 3 steps",
    "urlFetchPending": false,
    "published": "Oct 30, 2017 11:02:19 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "04L6GCc2QTqeYN242Bc3PA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29963?r=rss2",
    "title": "e9digital: Project Manager/Website Producer",
    "content": "<p>Part-time</p><p><strong>(Midtown Manhattan)</strong> </p><p><strong>e9digital</strong> is one of the top rated digital agencies in Manhattan and NYC.</p><p>We have over 200 clients under management and produce 10+ projects at any one time.</p><p>We're seeking an experienced project manager to interface with our clients and manage our development teams to deliver on-time, on-budget projects.</p><p><strong>Experience:<br></strong>We are looking for a candidate that has a minimum of 3+ years experience and proven track record on dozens of website proejcts.</p><p>You must have great written and verbal communication skills, and have that soft touch that clients love.</p><p><strong>Location:<br></strong>Bacause of our banking clients' security requirements <strong>you must be a US Citizen located in the USA.</strong> You can work remotely since most of our meetings with clients and team are done via uberconference, but if you are in the NYC area, you can work at our Midtown studio if you want.&nbsp;</p><p><strong>Compensation:</strong><br>We will pay an hourly rate commensurate with experience, so tell us what your rate is.</p><p>We pay staff and freelancers twice per month, so you'll never wait for your compensation with us.</p><p>We expect that you will have 20 to 30 hours per week at the start, and that could quickly grow to 40 hours per week.</p><p><strong>Job Responsibilities:</strong><br>1) Reports directly to the Creative Director and CEO<br>2) Serves as Leader of organizational processes, protocols, practices<br>3) Serves as point of contact for clients with new website/marketing projects as well as websites/projects in maintenance and/or maintenance requests.<br>4) Schedules, coordinates, and enforces all phases (from inception to completion) of new project/maintenance tasks with Creative Director, Production Team<br>5) Request/Source/Manage resources; measures the profitability of using resources. Management will approve or deny requested resources.<br>6) Leads regularly staff &quot;stand-up&quot; meetings/events covering &quot;big picture&quot; + production/scheduling details<br>7) Maintain/cultivate Expert level knowledge of web technology/best practices, digital industry developments<br>8) Provides ad hoc administrative support to designers, engineers, sales as schedule permits<br>9) Analyzes Internal Processes on ongoing basis to look for ways to improve efficiency, quality, team spirit<br>10) Documents all ongoing project/process intelligence for future reference<br><br><strong>-- FOR NEW website/creative projects:</strong><br>1) Gathers all Project Summary, other client background info from Sales<br>2) Creates Project Kickoff documentation containing all necessary, relevant background info<br>3) Schedules, co-leads (with Creative Director) Project Kickoff Meeting with Client + other pertinent personnel<br>4) Documents all meeting interactions, follows through with summary to client, CD; collects all assets necessary from client<br>5) Initiates internal Creative/Production brief document to be shared with Production Team<br>6) Creates Project schedule with checkpoints, Coordinates with CD to properly staff assigned production team<br>7) Schedules, co-leads (with Creative Director) Creative Presentation Meeting (follows through per #4)<br>8) Communicates regularly with Client, CD/Production Team to ensure scheduling milestones met<br>9) Facilitates content + tech production if skills/schedule permits<br>10) Manages website QA + site launch process; print production proof/fulfillment process, plus all other media fulfillment process<br>11) Trains clients on basic WordPress editing/content management<br><br><strong>-- FOR MAINTENANCE tasks/requests:</strong><br>1) Documents, analyzes, parses all client's new projects and maintenance requests before assigning to production team.<br>2) For simple WordPress updates, offers advice and/or assistance to the client.<br>3) For more complex tasks, confers with CD and/or engineer to evaluate best approach (may mean pushing back on client request)<br>4) Manages QA, task fulfillment</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Oct 29, 2017 5:12:07 PM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "NFzRL2-iStGNj-RcZ5jJFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5623-account-executive",
    "title": "Follow Up Boss: Account Executive",
    "content": "<div>  <div>    <h2>Account Executive</h2>      <h4>Posted Oct 27</h4>    <h3>      <span>Follow Up Boss</span><br>      <span>Headquarters: Remote</span><br>        <a href='https://www.followupboss.com/' rel='nofollow'>https://www.followupboss.com/</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span><b>Who Is Follow Up Boss?</b></span></div><div><br></div><ul><li><span>We’re a simple, sales-focused CRM for real estate teams (and we use our own product)</span><br></li><li><span>We’re a bootstrapped, profitable company started back in April of 2011</span><br></li><li><span>We’re a remote company with a mostly US-based team</span><br></li><li><span>We don’t just claim to be customer-centric - we live it: </span><a href='https://www.facebook.com/followupboss/reviews' rel='nofollow'><span>https://www.facebook.com/followupboss/reviews</span></a></li></ul><div><b><br></b></div><div><span><b>Why Would You Want To Work Here?</b></span></div><div><br></div><ul><li><span>We’re a young, ambitious company who only answers to our customers</span><br></li><li><span>Opportunity to have a big impact on our growth and your career</span><br></li><li><span>All your leads are warm, inbound inquiries</span><br></li><li><span>No red tape or pointless meetings</span><br></li><li><span>Uncapped commissions, competitive base salary, health/dental insurance and 20 days paid holiday</span><br></li></ul><div><br></div><div><span><b>This Role Is For You If...</b></span></div><div><br></div><ul><li><span>Your approach to sales is consultative, and focused on service and helping people get results</span><br></li><li><span>You would describe yourself as patient, empathetic and having a good sense of humour</span><br></li><li><span>You LOVE sales, and other salespeople (since that’s who you’re connecting with all day)</span><br></li><li><span>You’re independent, self-motivated and can stay efficient and productive without someone looking over your shoulder all day long</span><br></li><li><span>You thrive on ambitious goals and can’t handle anything but being the top producer on your team</span><br><br></li></ul><div><span><b>Your qualifications:</b></span></div><div><br></div><ul><li><b>Tech/SAAS</b> experience with free trial / inbound sales experience.</li><li><span><b>Consultative selling</b></span><span> experience, ideally to small businesses.</span></li><li><span><b>Self motivated</b></span><span> and proactive mindset.</span></li><li><span><b>Remote work</b></span><span> experience is considered an asset.</span></li><li><span><b>Based in the USA</b></span><span>, quiet home office with fast internet.</span></li></ul><div><br></div><div><span>Your responsibilities will include: </span></div><div><br></div><ul><li><span>Calling, texting and emailing new free trials proactively to help identify their biggest challenges, show how we can solve them, and begin helping to solve those problems as early in their free trial as possible (we use our own product, Follow Up Boss)</span><br></li><li><span>On-boarding and setting up new accounts during the free trial giving our customers a referable experience.</span><br></li><li><span>Answering incoming phone calls and emails from people on free trials or who are considering starting one to answer questions and consult them on the best solution for their current situation</span><br></li><li><span>Monitoring qualified free trial accounts to ensure that they are thrilled, getting results, and progressing towards account activation (and ultimately conversion)</span><br></li><li><span>Becoming a keen, passionate expert in all things related to real estate lead generation, lead conversion, sales optimization and customer service</span><br><br></li></ul><div><span>If this sounds like a great fit we would love to hear from you, drop us a line below.</span></div><div><br></div><div><span><br></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply using this link <a href='http://grnh.se/r7d4w51' rel='nofollow'>http://grnh.se/r7d4w51</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 27, 2017 5:29:38 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "m03uCqm1TZS17doCU6Ui_Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3944-engineering-manager-observability-team-etsy",
    "title": "Engineering Manager, Observability Team @ Etsy",
    "content": "<h2>              Engineering Manager, Observability Team<small> @ Etsy</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-23 03:21</p></dd>          <dt><span>Description</span></dt>          <dd><h4>Etsy is seeking an Engineering Manager to join our team.</h4><p>As Etsy grows, the technical infrastructure and platforms need to continue to enable Etsy's growth while providing innovative ways to improve our systems. The Observability team is tasked with making that happen for all metrics, logging and alerting needs and we're looking for someone to manage this team.</p><p>Etsy is actively preparing to move systems to a cloud provider, and this team play a key role in this work. This is an exciting and revolutionary time to join Etsy as engineering embarks on its next generation work, offering an opportunity to be part of the teams that run the infrastructure that connects millions of sellers and customers</p><p>This is a full-time position based in Etsy’s Brooklyn office or remote in a US timezone.</p><p><strong>About the Teams</strong></p><p>The Observability team is a fluid and dynamic group. We work across Engineering to provide teams with tools, platforms and insights into how their systems are performing. The team strives for situational awareness; we know that failure happens, and sometimes we even cause them to happen on purpose. Being nice is a requirement. You will likely learn more about collaboration at Etsy than you have anywhere else.</p><p><strong>About the Role</strong></p><ul><li>Manage the career development of a team of highly collaborative systems engineers</li><li>Contribute to technical discussions within your team to help increase the efficiency, stability, deliverability, and maintainability of everything your team produces</li><li>Participate in the greater company discussions to help set the direction for Etsy’s engineering team</li><li>Offer strategic direction, provide space for the team to create solutions</li><li>Work asynchronously with people spread geographically between Europe, East Coast and the West Coast</li><li>Regular 1:1s with team members, team meetings, representing the team within Systems Engineering and across the wider Engineering org</li><li>Curiosity regarding what makes people tick</li></ul><p><strong>About You</strong></p><ul><li>Have prior experience managing teams</li><li>Understand the importance of authenticity and mindfulness in leadership</li><li>Have excellent written and verbal communication skills</li><li>Are as excited by the challenges of nurturing a team as you are by the technical challenges of building systems</li><li>Help those around you grow as engineers and be successful</li><li>Enjoy learning about and interacting with the people who use your systems</li><li>What is nice to have, but not essential</li><li>Relevant domain experience</li><li>Experience with bare metal and cloud environments</li></ul><p><strong>Why Etsy</strong></p><ul><li>We are very open about how we build things and the tools we have created to get things done. Read more on our technical blog, <a href='https://codeascraft.com/' rel='nofollow'>CodeAsCraft</a></li><li>We open source a lot of <a href='https://github.com/etsy' rel='nofollow'>code</a></li><li>We have amazing offices in the heart of Dublin city and Brooklyn, and ensure our remote employees don’t miss out either!</li><li>We genuinely care about our talented teams and offer a fantastic <a href='https://blog.etsy.com/ca/news/2016/strong-families-strong-business-a-step-forward-in-parental-leave-at-etsy/' rel='nofollow'>parental leave policy</a>, Health Care, Dental Care, Sabbatical leave and many more exciting benefits</li><li>Most importantly we’re a social bunch with global offices full of fun, innovation, awesome people and all kinds of interesting events and we are continuously growing!</li></ul><p><strong>What’s Next</strong></p><p>Interested in joining the team? Send us a cover letter and your resume explaining why you’d be great for the job. We value individuality and variety, so make sure to tell us what you’re all about. If you have an online presence (blog, Twitter, Facebook), send it along. And if you write, draw, craft, or contribute to something you’re proud of, we’d love to hear about it. </p><p><em>Etsy is proud to be an equal opportunity employer and will consider all qualified applicants regardless of color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital or family status, disability, gender identity or expression, veteran status, actual or presumed belonging to an ethnic group, or any other legally protected status. If you have a disability or special need that requires accommodation, please let us know.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:21:51 AM",
    "tags": [
      "TZ_America",
      "TITLE1_manager",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "3kbK-5V-S8qBnETRRKOwYg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5576-project-manager-solutions-consultant",
    "title": "iMerit Technology Services: Project Manager/Solutions Consultant",
    "content": "<div>  <div>    <h2>Project Manager/Solutions Consultant</h2>      <h4>Posted Oct 19</h4>    <h3>      <span>iMerit Technology Services</span><br>      <span>Headquarters: San Francisco, CA</span><br>        <a href='http://www.imerit.net' rel='nofollow'>http://www.imerit.net</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>About iMerit</span><br></div><div><span>iMerit is a unique for-profit company with a social impact mission. We specialize in providing data services to global clients. Founded by successful entrepreneurs in Silicon Valley, we employ marginalized youth and women who have been trained in digital skills. This workforce provides critical services such as data enrichment, sentiment analysis, and data classification.</span></div><div><br></div><div><span>Our customers range from large, enterprise organizations to high-impact tech and e-commerce companies. We work with their most innovative teams in Machine Learning, Computer Vision, Product Experience and Data Science. </span></div><div><br></div><div><span>Our funders include Omidyar Network and the Michael and Susan Dell Foundation. &nbsp;With 800+ employees, we are an agile and fast-paced global startup with growing revenues and hands-on leadership.</span></div><div></div><div><br></div><div><span>About the Role</span><br></div><div><span>As a Project Manager, you are working closely with the Sales team’s efforts to engage with prospective clients and translate their often custom requirements into a full-fledged end-to-end data processing solution.</span></div><div><br></div><div><span>In order to establish new processes, you will be working with the Sales team, prospective and current clients, and the India-based Project Delivery team. You will also have the opportunity to design, coordinate, and product manage in-house development of custom tools, platforms, and workflows.</span></div><div><br></div><div><span>This is a role for self-directed learners, creative thinkers, and workplace chameleons. You will need to be adaptive, curious and resourceful and enjoy working with a diverse young team.</span></div><div><br></div><div><span>Responsibilities:</span><br></div><ul><li><span>Work with customers and prospective customers to deeply understand their proposed use case(s) and propose solutions based on iMerit’s core offerings, technology, and workforce capability</span><br></li><li><span>Lead newly engaged customers through any technical sales consultation and project implementation phase, while building trust in the solutions offered by iMerit</span><br></li><li><span>Work as the bridge between Sales, guiding their understanding of project implementation, and Project Delivery (responsible for actually delivering quality work). This requires a strong ability to multi-task, and switch gears between teams with competing priorities. </span><br></li><li><span>Provide consultative proposals and findings to clients in an organized and accessible manner. This includes a combination of data analysis, development of workflow proposals, and the ability to clearly map out process and values provided by the iMerit team. While heavily consultative, the ability to win (and maintain) client trust is of great importance. </span><br></li><li><span>Manage multiple projects simultaneously, including the project design, development, implementation, and delivery</span></li></ul><div><br></div><div><span>Required Experience/Skills:</span><br></div><ul><li><span>Minimum 3 years experience and success working in a customer-facing role</span><br></li><li><span>Prior experience managing a variety of projects and accounts, at different stages of development </span><br></li><li><span>Ability to work interculturally and in a distributed team </span><br></li><li><span>Interest (and openness) to travel (India and California)</span><br></li><li><span>Self-directed learner and hands-on problem solver</span><br></li><li><span>Comfortable working with numbers and data</span><br></li><li><span>Prior experience in Account Management, Project Management, Customer Success or Pre-Sales Consultation</span><br></li><li><span>Desire to learn independently about market trends, technology, and concepts in Machine Learning/Data Science field</span><br></li></ul><div><br></div><div><span>Ideal Candidate Traits/Experience:</span><br></div><ul><li><span>Experience working for an international company</span><br></li><li><span>Experience working with remote teams</span><br></li><li><span>Experience working in/with India</span><br></li><li><span>Prior work history with crowd-sourcing/outsourcing</span><br></li><li><span>Moderate to advanced Excel knowledge</span><br></li><li><span>Basic knowledge of SQL and other databases</span><br></li><li><span>Interest in social impact</span><br></li><li><span>Basic familiarity with programming languages such as HTML, PHP, Python, R</span><br></li><li><span>Based in San Francisco Bay Area a plus (Remote OK)</span></li></ul><div><span><br></span></div><div><span>Location: Remote</span><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send a cover letter and resume to <a href='mailto:jenny@imerit.net' rel='nofollow'>jenny@imerit.net</a> with subject line: &quot;We Work Remotely - Job Application for [your name here]&quot;</p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 19, 2017 8:46:36 PM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "kLMmUm7iRHyqvDlyqTalWw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5574-sales-development-manager-admissions-team",
    "title": "Remote Year: Sales Development Manager, Admissions Team",
    "content": "<div>  <div>    <h2>Sales Development Manager, Admissions Team</h2>      <h4>Posted Oct 19</h4>    <h3>      <span>Remote Year</span><br>      <span>Headquarters:  United States</span><br>        <a href='https://remote-year.breezy.hr/p/cd2c7afcf65a-sales-development-manager-admissions-team?source=weworkremotely' rel='nofollow'>https://remote-year.breezy.hr/p/cd2c7afcf65a-sales-development-manager-admissions-team?source=weworkremotely</a>    </h3>  </div>    </div>  <div>    <div><span><b>Remote Year</b></span><br></div><div></div><div><span><br></span></div><div><span>Remote Year brings together communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend a year working, traveling, and exploring 12 cities around the world. Spending one month in each location, communities connect with local cultures and business ecosystems, forming lifelong, borderless personal and professional relationships along the way. Together we are shaping the future of work.</span></div><div><br></div><div><span><b>Role Description</b></span></div><div><br></div><div>Our Admissions team is looking for an experienced Sales Manager to lead our growing consumer sales team. Working closely with our Head of Sales and the Head of Admissions you will be responsible for delivering on the Remote Year consumer sales strategy. You will bring your expertise in building and managing sales teams, maximizing pipeline potential, and - ultimately - driving revenue growth. We need a self-starter who helps others thrive in an autonomous workplace who can also develop and mentor a team of smart, talented, and passionate Admission Sales Consultants.</div><div><br></div><div><span><b>Responsibilities</b></span></div><div><br></div><ul><li>Manage, coach and develop a high-performing team of Admission Consultants.<br><br></li><li>Recruiting and retaining top talent through various sales-team appropriate engagement mechanisms.<br><br></li><li>Develop the strategy and delivery for training, onboarding, and development of our current and new Admission Consultants.<br><br></li></ul><ul><li>Lead daily sales initiatives, including both strategic elements (processes, quota alignments, targets) and operationally (tools, coaching, hiring needs)<br><br></li><li>Set and monitor KPIs, sales targets, and goals for the team.<br><br></li><li>Collaborate with People Business Partners on compensation packages for all levels of the sales team, onboarding, and other people-related needs.<br><br></li><li>Partner with Sales Ops and Finance to develop financial and operating targets and ensure alignment with a strategic plan.<br></li></ul><div><br></div><div><span><b>Qualifications</b></span></div><div><br></div><ul><li><span>3-5 years of management experience,</span>&nbsp;with preference to leading a distributed sales teams.<br><br></li><li>A strong familiarity with sales tools and CRMS in particular, Salesforce.<br><br></li><li>Previous startup experience and/or experience working with distributed teams across multiple timezones.<br><br></li><li>Ability to perform well in highly dynamic, rapidly changing environment.<br><br></li><li>Strong analytical and problems-solving ability - must have grit and a love for numbers.<br><br></li><li>Ability to give direct, constructive feedback to your team, peers and co-workers.<br><br></li><li>Ability to travel internationally extensively.<br><br></li></ul><div><span>To Apply: Drop your resume below, along with a note telling us more on your leadership style, what excites you about the role, and what we're building at Remote Year.</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://remote-year.breezy.hr/p/cd2c7afcf65a-sales-development-manager-admissions-team?source=weworkremotely' rel='nofollow'>https://remote-year.breezy.hr/p/cd2c7afcf65a-sales-development-manager-admissions-team?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 19, 2017 6:46:28 PM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "D7PSwSIjQ_SJhujJoxMh9g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5559-account-executive",
    "title": "Help Scout: Account Executive",
    "content": "<div>  <div>    <h2>Account Executive</h2>      <h4>Posted Oct 17</h4>    <h3>      <span>Help Scout</span><br>      <span>Headquarters: Boston, MA</span><br>        <a href='https://www.helpscout.net/company/careers/' rel='nofollow'>https://www.helpscout.net/company/careers/</a>    </h3>  </div>    </div>  <div>    <div><strong>YOUR IMPACT</strong></div><div><br></div><div>At Help Scout, the sales team serves as a trusted advisor for prospects and customers -- listening to their needs, clearly explaining what’s possible, and leading training/onboarding efforts to make sure everyone is successful for the long term. Quite simply, you’ll have the opportunity to impact small businesses in a big way on a daily basis.</div><div><br></div><div><strong>ABOUT THE ROLE</strong></div><div><br></div><ul><li>You’ll partner with customers through the entire buying process, from initial evaluation to close, and through onboarding of the entire team. In most cases, you’ll be the primary point of contact through the first year renewal.</li><li>You’ll team with marketing to ensure inbound campaigns are well coordinated as you follow up to qualify and close those opportunities.</li><li>In most cases you’ll be working with SMBs with up to 250 employees leading to a higher volume of transactions at lower values. Efficiency is a must in this fast moving business.</li><li>The companies you work with will be qualified and passed to you based on the number of expected Users. They will mostly be trial signups, webinar attendees, or inbound leads we’ve talked with to get a high-level understanding of their needs. You’ll also work with existing customers on high-value upgrade and expansion opportunities.</li><li>Most of your time will be spent working with stakeholders over email and on the phone, and doing demos. There’s a reason we call you a trusted advisor -- this is less about the hard sell and more about having the product knowledge, passion and people skills to let the product sell itself.</li><li>Based on what works, you’ll experiment with, measure and document strategies that help us increase sales effectiveness. You’ll be a critical part of helping us enhance our sales playbook.</li><li>You’ll be proactively reporting on learnings and valuable feedback to the product team so that we can improve the product and prioritize the right projects.</li></ul><div><br></div><div><h3>REQUIREMENTS</h3></div><ul><li>We’re looking for someone who can work mostly EST hours. Because we value work-life balance and creating a sustainable position, we prefer if you are geographically located in the EST timezone (so you do not need to zone-shift or work far outside of normal business hours where you live).</li></ul><div><br></div><div><strong>ABOUT YOU</strong></div><div><br></div><ul><li>You have 2+ years of successful selling to SMBs, and have experience working on deals similar in size and volume to the ones you’d be working on at Help Scout.</li><li>You are in sales because you love helping people win. It energizes you to work alongside people to improve their business.</li><li>You are naturally curious and have a history of learning new things quickly. This is especially important in a remote company like Help Scout, as you won’t always have people nearby that you can talk to and learn from.</li><li>You excel at managing yourself like a successful business -- highly organized, setting and achieving goals with regularity, creating a great customer experience, and making your teammates better.</li><li>You have experience tracking all of your sales activity and reports with Salesforce.</li><li>As the primary point of contact and a trusted advisor, you’re happy to wear several hats: sales, support, customer success. Over the course of a customer’s first year, you may be point person on any one of them, mobilizing your teammates for support.</li><li>Above all, you’re an entrepreneur and are excited by the prospect of building your business and hitting your quarterly and annual goals.</li></ul><div><strong><br></strong></div><div><strong>ABOUT US</strong></div><div><br></div><ul><li>Help Scout is a remote team with employees in eleven countries (eight people in the Boston office). We optimize for excellence over geography and overcome remote challenges through transparency, trust, chat and video conferencing.</li><li>We’re a customer-driven company and always will be. Everything follows the customer experience, no exceptions.</li><li>Our company is growing and has aspirations of helping millions of people around the world. Accomplishing our goals will present countless challenges and require you to excel in every aspect of the position. It’s hard work, but the people we’re looking for love exploring and solving hard problems.</li><li>This is not the typical startup “rocket ship.” We’ll never compromise customers or the experience in favor of growth. Our purpose is to build a profitable company that small businesses love and sustain it. We optimize your career at Help Scout for the long term as well, so keeping a healthy work/life balance is an important priority.</li><li>We value diversity at Help Scout and welcome all applicants regardless of actual or perceived race, color, ethnicity, sexual identity, gender identity, gender expression, economic status, ability, disability, religious beliefs or disbeliefs, national origin, age, military service eligibility, veteran status, marital status, parental status, or caregiver status.</li></ul><div><h3>BENEFITS</h3></div><ul><li><strong>Competitive Salary</strong>&nbsp;- We pay at or above market salary in most cases and evaluate a lot of research to make sure everyone is paid well. The formula we use to calculate all salaries is public to employees and is improved upon regularly.</li><li><strong>Work anywhere</strong>&nbsp;- Work from our office in Boston or anywhere else, provided you have 4 hours of overlap with the team. We’ll even buy your home office furniture or help you pay for a co-working space.</li><li><strong>Health and dental insurance</strong>&nbsp;- We cover you and your family's health/dental insurance 100%. If you are based in the US, we'll cover you on our Aetna policy.</li><li><strong>Long-term/Short-term Disability Insurance &amp; Life Insurance</strong>&nbsp;- we cover 100% of the premiums for LT/ST Disability insurance and base Life Insurance. You also have the option to purchase supplementary life insurance through our provider.</li><li><strong>International Benefit Stipend&nbsp;</strong>- If you’re based outside the US, you’ll receive a monthly stipend that goes towards covering medical insurance, long and short-term disability, and accountant costs.</li><li><strong>Flexible vacation</strong>&nbsp;- Take time off when you need it, we trust you.</li><li><strong>Paid parental leave, including adoption&nbsp;</strong>- 12 weeks if you have or adopt a baby, 4 weeks if your partner has a baby.</li><li><strong>401k with 1% match</strong>- 1% Retirement Plan matching for both US and International Employees</li><li><strong>Personal development stipend</strong>&nbsp;- Up to $1,800 per year to improve your craft</li><li><strong>Great tools</strong>&nbsp;- Each employee receives a Mac laptop and 27'' display (or equivalent). We’ll also purchase any of the software or hardware you need as well as high-end furniture to get your home office started</li><li><strong>Complete transparency</strong>&nbsp;- Everyone has full access to business metrics and financial information about the company.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://www.workable.com/j/17F122A9EF' rel='nofollow'>https://www.workable.com/j/17F122A9EF</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 17, 2017 7:36:38 PM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_America_East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East timezone"
    ],
    "tagsNames2": []
  },
  {
    "id": "-qwEOlEhQhis9FKqrgEIkA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5558-saas-marketing-project-manager-80k",
    "title": "Aurea: SaaS Marketing Project Manager ($80k)",
    "content": "<div>  <div>    <h2>SaaS Marketing Project Manager ($80k)</h2>      <h4>Posted Oct 17</h4>    <h3>      <span>Aurea</span><br>      <span>Headquarters: Austin, TX</span><br>        <a href='https://www.aurea.com/' rel='nofollow'>https://www.aurea.com/</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>Are you a get shit done, high-capacity, project manager in the B2B marketing world? Are you easily bored and excited by the prospect of managing over 50 SaaS products with a team of high performers from around the globe? If you’re looking to join a rocketship on the ground floor while working from the comfort of your home office or favorite coffee shop, this role is for you. </span></div><div><br></div><div><span><b>Team-specific background</b></span></div><div>The team you will be joining is tasked with building the inbound portion of Aurea’s new customer acquisition capability. Currently the team is working with six different products and is ramping to over fifty products in the next two years. To generate these MQLs, the team produces landing pages, websites, PPC ads, and content which attract MQLs into our funnel.&nbsp;<br></div><div><span><br></span></div><div><span>Without you as the project manager, our designer in Romania waits for the Pardot forms from our Canadian marketing automation specialist who read a Skype message and thought that our campaign manager in CA already sent it -- all the while the team moves slower than we ought to. Working closely with our creative director and design team, this won’t happen anymore: you’ll manage a workflow process which systematically coordinates the production of deliverables across a wide range of sales and marketing channels. </span></div><div><br></div><div><span><b>Job Description</b></span></div><div><br></div><ul><li><span>Manage and own the calendar for all stakeholders across the full project lifecycle, from briefing to creative concepting to production/development to implementation</span><br><br></li><li><span>Set deadlines for individual team members and keep people accountable to their goals</span><br><br></li><li><span>Proactively identify project slips, communicate to rest of the team, and build solutions to maintain due date</span><br><br></li><li><span>Set and manage budget for special experiments </span><br><br></li><li><span>Assign resources project-by-project, manage workloads, forecast coverage needs, communicate workload with creative director and leadership</span><br><br></li><li><span>Measure marketing department’s output and report progress to leadership </span><br><br></li><li><span>Enable quicker delivery of department’s deliverables by identify backlogs and process improvements &nbsp;</span><br><br></li></ul><div><span><b>Core skills and capabilities</b></span></div><div><br></div><ul><li><span>Able to keep complex teams and process ahead of schedule </span><br><br></li><li><span>Able to manage across functions: strategy, writing, design, dev, and QA</span><br><br></li><li><span>Effective collaborator with talented team members around the globe</span><br><br></li><li><span>Experience with agile/waterfall/scrum and similar management frameworks </span><br><br></li><li><span>Motivate diverse groups of people to perform at peak levels</span><br><br></li></ul><div><span><b>Behavioral characteristics</b></span></div><div><br></div><ul><li><span>Unusually high bandwidth and comfortable simultaneously managing multiple projects </span><br><br></li><li><span>Ability to coordinate timing and expectations between multiple stakeholders </span><br><br></li><li><span>Process-oriented and metric-driven contributor</span><br><br></li><li><span>Curiosity and openness to a remote work culture with differentiated core values </span><br><br></li></ul><ul><li><span>High performing history at B2B SaaS company</span><br><br></li><li><span>Proficiency with project management and communication tools </span><br><br></li></ul><div><span>Compensation is $80k/year ($40/hour)</span></div><div><br></div><div><span>Time: Full time (40 hours/week)</span></div><div><br></div><div><span>Offer: 1099 if outside the US and W2 if within US</span><span><br></span></div><div></div><div><span>Location: Global (remote)</span></div><div><br></div><div><span>To qualify,&nbsp;please complete our pre-interview work assignment – a thoughtful response to which will require investing 1-2 hours of preparation time. &nbsp;We find both the willingness to invest this time – coupled with the insights we derive from the answers – help us find the truly capable and passionate candidates. Candidates who demonstrate excellence in these responses will be contacted for final interviews.</span></div><div><br></div><div><b>Company background: Aurea Software</b> is a rapidly growing enterprise software company that delivers transformative customer experience through a variety of world class software products. &nbsp;With the recent acquisition of Jive Software, the Aurea team now includes 2,000 employees across 5 continents and a roster of over 4,000 customers, including Disney, British Airways, and Apple – all of whom use Aurea technology to engage employees and customers to create meaningful and transformative experiences.</div><div><br></div><div><span>Aurea’s growth strategy has focused on acquisition growth coupled with organic growth driven through the installed base. &nbsp;Aurea is currently building and scaling a world-class new customer acquisition capability using a combination of traditional enterprise software sales and the latest inbound/outbound marketing techniques.</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://goo.gl/1rwy6X' rel='nofollow'>https://goo.gl/1rwy6X</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 17, 2017 5:06:18 PM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "a16Cw4p8QKaNpCuk8tZnCg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/jobs/5550-creative-director",
    "title": "Hotjar: Creative Director",
    "content": "<div>  <div>    <h2>Creative Director</h2>      <h4>Posted Oct 16</h4>    <h3>      <span>Hotjar</span><br>      <span>Headquarters: Malta</span><br>        <a href='https://careers.hotjar.com/o/creative-director' rel='nofollow'>https://careers.hotjar.com/o/creative-director</a>    </h3>  </div>    </div>  <div>    <div><strong>Note:</strong>&nbsp;Although this is a remote position, we are seeking candidates in the following timezones only: Europe (UTC+0 - UTC+4), US (EST only).</div><div></div><div></div><div><br></div><div>We are looking for a strategic, user-centric and hands-on creative leader that is ambitious and passionate about creating engaging, consistent and memorable experiences. Hotjar is a rapidly growing startup that is giving thousands of designers, marketers and website owners the tools needed to discover how their visitors are really using their website. In this role you will be actively contributing into shaping and evolving the Hotjar brand whilst growing with us.</div><div><br></div><div>This is an excellent remote career opportunity in a key role with a fast growing and innovative tech-startup. This role is situated in the Product Marketing team and will report to the Director of Marketing.</div><div><br></div><div>&nbsp;</div><div><br></div><div><strong>As the Creative Director, you will be:</strong></div><div><br></div><ul><li>Directing and creating media and campaigns that engage and empower our target audience to take action.</li><li>Hands on – designing creative assets for Hotjar sites, advertising, content marketing and marketing campaigns.</li><li>Owning and maintaining resources related to Hotjar’s brand and identity.</li><li>Advocating Hotjar’s brand standards and visual communication while ensuring they are met both internally and on all public channels, including social media and marketing channels.</li><li>Working within the Marketing team – managing the creative process and translating marketing objectives into clear creative strategies from concept to completion.</li><li>Working closely with product teams to ensure consistent messaging and visual communication.</li><li>Leading, training and mentoring a team of creatives whose primary focus is to provide Marketing with all their creative needs.</li><li>Participating in the recruitment process when hiring new creative talent to join the Marketing team.</li><li>Identifying and communicating with third-party creative agencies to collaborate and sustain marketing needs on all channels / mediums.</li></ul><div></div><div></div><div><br></div><div><strong>Compensation Range:</strong></div><div><br></div><div>The budgeted compensation range for this role is €60,000 to €80,000 annually. Ranges are based on market research and are equitable to other roles within Hotjar. The actual compensation offered to the chosen candidate will be based on relative experience and skills. At this time we are only able to provide official employment status to those located in Malta. All other candidates will join our team as full-time consultants and will be responsible for paying any taxes or applicable fees where they reside.&nbsp;<br></div><div><h4>Requirements</h4></div><div><strong>We want to hear from you if you:</strong></div><div><br></div><ul><li>Have 6+ years of creative direction experience with a minimum of 3 years leading design teams with a variety of skills (visual, UX/IA, writing, research, etc) at digital product companies.</li><li>Are a&nbsp;proven leader with great practical design skills who is eager to use them on a regular basis. You have shipped a lot of work yourself over the years and you know what it takes to create awesome, memorable experiences.</li><li>Have an analytical and user-focused mindset and understand the importance of qualitative and quantitative research. You constantly seek to improve your team’s outputs through user feedback and data insights.</li><li>Demonstrate a desire for continuous learning and personal growth in multiple areas; from design&nbsp;skills,&nbsp;to leadership, to processes, to market trends, etc.</li><li>Are an excellent communicator with excellent verbal, written, interpersonal and technical skills, and are able to work cross-functionally with business stakeholders.</li><li>Take pride in your ability to inspire and motivate others to carry out and execute a strategy while working in a fully remote team environment.</li><li>Are able to independently take decisions on final visuals and copy while meeting deadlines within the marketing team.</li><li>Are able to think critically and problem-solve in a&nbsp;fast-paced, entrepreneurial environment.</li><li>Are experienced working in a high growth SaaS startup with global expansion. This will be considered a plus, not a requirement.</li><li>Must submit to a background check confidentially processed by a trusted third party resource.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply via <a href='https://careers.hotjar.com/o/creative-director/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/creative-director/?source=WeWorkRemotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 16, 2017 5:39:07 PM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "jiqK_shRS9aJi7ZbE3hhEQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/62581/head-of-customer-experience-at-the-plum-guide/",
    "title": "Head of Customer Experience",
    "content": "Background <br /><br />The Plum Guide is building a marketplace of the world’s best holiday homes. For real! <br /><br />We are taking a systematic and obsessive approach to testing every single home on the planet, and accepting only the top 1%. <br /><br />We do so by putting every home through The Plum Test: a gruelling hospitality exam, which uses a mix of algorithms and physical visits by hospitality experts. <br /><br />We launched 18 months ago in London. Since then, we have grown 20% month on month, vetted over 80,000 homes and reached over £10m in annualised sales! We are backed by an all-star cast investor group including Local Globe (TransferWise, OneFineStay, Citymapper), Alex Chesterman (Founder of Zoopla), William Reeve (Founder of Love Film), Alex Saint and Troy Collins (Founders of Secret Escapes), Errol Damlin (Founder of Wonga) Jason Goodman (Founder of Albion) and many more. <br /><br />We are currently closing our Series A round of funding. Our single most important objective for the next 18 months it to bring our NPS score to the top 0.1%ile of the travel sector. Seriously! <br /><br />After all, that is what the Plum Guide is all about: delivering the perfect stay. <br /><br />That is where you come in. <br /><br /><br /><br />The Role <br /><br />At Plum, we have been investing a lot of time and effort in decoding the “formula” of what makes a perfect stay. We use this formula to guide how we test homes and drive new feature and service innovations. We call this formula “The Science Behind the Perfect Stay”. <br /><br />The reality is, that we are at the foothills of this journey. Our formula needs lots of work and there are dozens of services and product innovations we need to launch to genuinely deliver on the promise. <br /><br />This will be your role.  <br /><br />Specifically, you will have hit the ball out of the park, if in 12 months our NPS score is at the top 0.1%ile of the travel sector. <br /><br /><br /><br />What you’ll be up to <br /><br />This is a highly entrepreneurial role that will quickly evolve and morph. However, to bring it to life, here is what you can expect to be doing: <br /><br />1.    Running an always on program of observational, qualitative and quantitative research to identify customer pain points and opportunities for delight. <br /><br />2.    Translating these insights into innovations in all parts of the customer journey, including: <br />        a)    The booking experience: e.g. showing guests the right information at the right time. <br />        b)    The pre-check in experience: e.g. building tools for guests to order fridge fills, airport pickups and daily cleaning. <br />        c)    Our customer service offer: e.g. designing the “Plum Way” of delivering service.  <br />       d)    The in-stay experience: e.g. creating a training program for hosts on delivering hospitality the “Plum Way”. <br />       e)    Our testing process: e.g. generating improvements to our home testing process. <br /><br />3.    Implement the innovations: Turning the big ideas into real products, with beautiful user experience. You will launch both digital as well as “off line” innovations. <br /><br />4.    Be responsible for improving our site conversion: developing new features and user journeys that will meet our goal of doubling conversion over the next 12 months. <br /><br />5.    Build and manage a world class innovation team: you will be expected to build a team of 8-10 UX designers, hospitality experts, researchers and developers. <br /><br /><br /><br />Who we are looking for <br /><br />This role really does require a very diverse set of skills. With that in mind, we will prioritise hiring people with the right raw talent and attitude, over particular skills. The important thing is that you: <br /><br />•    Find the idea of designing one of the world’s most famous consumer products and services insanely motivating. <br /><br />•    Are scarily ambitious and with an unreasonably high standard for what is good enough. <br /><br />•    Highly attuned to noticing customer pain points, behaviours, hopes and fears. And able to convert them into piercing insight.    <br /><br />•    Fearlessly creative: able to turn these insights into truly original solutions that surpass even the most discerning customer expectations. <br /><br />•    A resourceful doer: able to translate these ideas into, in-market innovations, quickly and with limited resources. You are super action driven. <br /><br />•    A beautiful eye: an impeccable taste in design, aesthetics and usability.  <br /><br />•    An intense (almost) maniacal attention to detail.<br /><br />•    Highly analytical: deconstructing problems logically & solving them using data, insight & gut.  <br /><br />•    A motivating and inspiring individual: able to attract amazing talent and inspire them to deliver the best work of their lives. <br /><br />•    Highly commercial, with great business sensibility. <br /><br />•    A passion and vision for what makes great digital products is a must. <br /><br />•    A track record of designing and launching product and service innovations. <br /><br />•    A confident self-learner: confident at teaching yourself new things on a daily basis. <br /><br /><br /><br />Benefits <br /><br />•    An unparalleled opportunity to make a name for yourself as a world class product & service designer. <br /><br />•    Incredible learning opportunities in building and scaling a consumer brand: Not only will you lead the Customer Experience of a VC backed business, but will be exposed to all facets of scaling a digital business: fund raising, marketing, engineering, finance and ops. <br /><br />•    If you make your objectives happen, you will inevitably be one of the most sought out talents in the London start-up, hospitality and technology scene.<br /><br />•    Genuine influence and control: you will join the leadership team and work as an equal with the founding team in setting the strategy and vision for Plum.  <br /><br />•    Be the 15th team member, of what we believe will be, one of Europe’s most famous start-ups.<br /><br />•    Competitive salary and generous option scheme: our ambitions are huge and we hope it pays out for all.",
    "urlFetchPending": false,
    "published": "Oct 16, 2017 4:03:14 PM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "Lu83h3VISz6jWb5hYiQ49A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-copywriting",
    "url": "https://weworkremotely.com/jobs/5526-certification-program-development-expert",
    "title": "Alliances Management Consulting Inc.: Certification Program Development Expert",
    "content": "<div>  <div>    <h2>Certification Program Development Expert</h2>      <h4>Posted Oct 11</h4>    <h3>      <span>Alliances Management Consulting Inc.</span><br>      <span>Headquarters: Redwood City, CA</span><br>        <a href='http://www.alliancesmanagement.com' rel='nofollow'>www.alliancesmanagement.com</a>    </h3>  </div></div>  <div>    <div>Position Title:&nbsp; Certification Program Development Expert</div><div><br></div><div>Reports To:&nbsp; Technical Director</div><div><br></div><div>Compensation:&nbsp; $70,000 - $85,000, depending on experience</div><div><br></div><div>Location:&nbsp; Negotiable: All Alliances Management team members work virtually </div><div><br></div><div>Term:&nbsp; Full-time</div><div><br></div><div>Dedication:&nbsp; Expected 40 hours/week</div><div><br></div><div>Travel:&nbsp; 10%, domestic and international</div><div><br></div><div>To Apply:&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; </div><div><br></div><div>Qualified candidates should send a resume and a customized introductory letter (which we really do read) to hr@alliancesmanagement.com.&nbsp; Applications should be received no later than 30 October 2017.</div><div><br></div><div></div><div><span><span>Background</span></span></div><div><br></div><div></div><div><span><span>AlliancesManagement is an association management and consulting company withprofessionals located throughout the United States and satellite offices inEurope and Asia.<span>&nbsp; </span>We fulfill high-profilefunctions for international clients, including EMVCo and GlobalPlatform in theassociation space and eBay and Visa in the private sector.<span>&nbsp; </span>We have grown tenfold since our inception in2006 because of our unwavering commitment to excellence.<span>&nbsp; </span>Our services include development ofinternational programs, management of global events, financial management, andimplementation of certification programs.</span></span></div><div><br></div><div></div><div><span><span>We areinterested in hiring only candidates with extremely high standards and whobelieve that client satisfaction is essential not only in its own right, butalso because it will bring long-term success to Alliances Management.</span></span></div><div><br></div><div></div><div><span><span>To learn more,visit <a href='http://www.alliancesmanagement.com' rel='nofollow'>www.alliancesmanagement.com</a>.</span></span></div><div><b><br></b></div><div></div><div><b><span><span>Responsibilities:</span></span></b></div><div><br></div><div><span><span></span></span><span><span></span></span></div><div></div><div><span>Candidate will support Alliances Management clients by workingwith internal and external teams to create high-quality policy and proceduredocumentation for certification programs in development, create applicationsand forms to support operational needs, and maintain active programdocumentation. </span></div><div><br></div><div></div><div><span>For new certification programs, this role supports allaspects of the development, including initial brainstorming with SMEs, definingproject timelines and deliverables, creating documentation, and coordinatingall required approvals for launch. For existing programs, this role maintainsthe programs by updating the documentation and procedures as necessary. </span></div><div><br></div><div></div><div><b><span>Requirements&amp; Skills:</span></b></div><div><br></div><div></div><ul><li><span>Experience     defining Operational Policy and Process Documentation</span></li><li><span>Excellent     verbal and written communication skills with the ability to explain     technical information clearly</span></li><li><span>Experience     working in a member-driven standards organization, where member working     groups are the primary stakeholder for deliverables</span></li><li><span>Experience     in Technical Writing and Editing</span></li><li><span>Strong     working knowledge of Microsoft Office</span></li><li><span>Knowledge     of HTML and Markdown</span></li><li><span>Experience     with Git and GitHub</span></li><li><span>Ability     to multitask and handle several projects simultaneously</span></li><li><span>Comfort     operating in a fast-paced, highly technical environment</span></li><li><span>Ability     to work well in a “matrix” organization that requires answering to     different managers and working with individuals across different parts of     the company </span></li><li><span>Familiarity     and experience working with business professionals from different cultural     backgrounds, and flexibility to support meetings across time zones</span></li><li><span>Extreme     attention to detail</span></li><li><span>Positive     attitude and a team player—both with managers and colleagues</span></li><li><span>Native     English speaker </span></li></ul><div><br></div><div></div><div><b><span>Preferred Skills:</span></b></div><div><br></div><div></div><ul><li><span>Knowledge     of Structured XML or LaTeX</span></li><li><span>Project     Management experience</span></li><li><span>Degree     in English, Communications, or Engineering</span></li><li><span>MBA</span></li></ul><div><br></div><div></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Qualified candidates should send a resume and a customized introductory letter (which we really do read) to <a href='mailto:hr@alliancesmanagement.com' rel='nofollow'>hr@alliancesmanagement.com</a>.  In the body of your letter, explain why you are the right candidate for the opportunity.  Please be specific.  Please also include salary history/expectations, any additional information you would like us to know, and any questions that you have.As Alliances Management is a virtual company, all employees work from home.  The Certification Program Development Expert will do the same while employed by Alliances Management, based in Silicon Valley, California.  In order to meet company requirements to manage client projects, the selected candidate will ordinarily need to work U.S. hours (8:00 a.m. – 5:00 p.m. U.S. Pacific Time); however, there will be times when it will be critical to work alternative hours in order to meet client expectations. In everything we do, we place our clients’ needs first.  Visit <a href='http://www.alliancesmanagement.com' rel='nofollow'>www.alliancesmanagement.com</a> to learn more.</p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 11, 2017 8:03:23 PM",
    "tags": [
      "TITLE1_manager",
      "TZ_America_West",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "US Pacific Time Zone"
    ],
    "tagsNames2": []
  },
  {
    "id": "Ql0IEm3PTyO6i1f1FkPChQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/62364/key-account-director-saas-at-patsnap/",
    "title": "Key Account Director - Saas",
    "content": "About Patsnap<br /><br />PatSnap is the world’s leading IP Analytic and Management platform that empowers senior business leaders to accelerate growth through Innovation and R&D. IP and patent strategy is now a major board level priority – our product solves a real and growing problem globally. Our differentiation is the reason behind the company’s exponential growth. PatSnap technologies make patent intelligence more accessible to non-IP proficient business users and provide intuitive analytics, making our products usable and sticky. Our market is limitless because patent strategy is relevant to all businesses ranging from NASA to PepsiCo.<br /><br />PatSnap has been commercially active since July 2007, we now employ over 500 people worldwide and through funding we continue to scale rapidly. We have offices in Singapore, China, London and Los Angeles.<br /><br />Key Responsibilities of our Key Account Director :<br /><br />Grow and expand an existing base of strategic high growth accounts<br />Ensure customers achieve their adoption and success targets<br />Mapping to network and manage relationships across different business functions within a complex global organisation<br />Create, monitor and execute a custom success plan for each customer to drive usage and value<br />Work with the Customer Success team to deliver successful on-boarding and adoption through the lifespan with PatSnap from launch<br />Create Value Reports for stakeholders demonstrating ROI<br />Conduct health checks and collaborate with the Customer Success team to achieve world beating retention rates.<br />Ensure customers are vocal advocates of the PatSnap brand who renew our relationships year after year<br />Rapidly learning of IP, R&D and Innovation Strategy<br /><br />REQUIREMENTS<br /><br />Natural born self-starter that thrives in a fast-paced, high intensity start-up environment<br />Proven experience in B2B business intelligence/SaaS<br />Awesome track record of maintaining high retention rates<br />A hunter mentalitiy in order to grow a dedicated account pack year on year and drive revenue from your accounts.<br />Meeting/exceeding activity, pipeline, and revenue targets<br />Extensive track record in crushing customer satisfaction goals as measured by renewal, usage and account expansion<br />Experienced in a solution approach and adept at creating value for customers<br />You understand the SaaS business model and have proven track record of implementing successful CS initiatives<br />Proven experience using Salesforce<br />Strong problem-solving skills and familiarity with business intelligence technology<br />Ability to thrive in a fast-paced and changing environment<br />High level of motivation, ability to quickly learn/explore our clients business, and work closely with all levels of the PatSnap team globally<br />A natural leader with a very high level of emotional intelligence<br /><br /><br />BENEFITS<br />PatSnap can offer you:<br /><br />The ability to learn progress and develop your skills through mentoring from some of the best experts in our field<br />We attract and recruit the best in class, you will have a market leading budget to help build a world-class channel sales engine<br />Active career management, with progression reviews and achievement acknowledgement<br />The opportunity to contribute directly to the growth and success of a fast-paced exciting company<br />A transparent and open culture that encourages frank conversation between staff and all levels of management<br />Competitive base salary with an awesome commission structure<br />Benefits, incentives and rewards<br />A fun, exciting workplace with people who love and care about what they do",
    "urlFetchPending": false,
    "published": "Oct 10, 2017 11:37:57 AM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "Fk8jbQnjSP28Lv6O7H96ew",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/62289/marketing-executive-at-kickdynamic/",
    "title": "Marketing Executive",
    "content": "*Are you looking for an exciting, unique role at a growing marketing technology company?*<br /><br />Kickdynamic is looking for a talented marketing professional with the creativity, drive and strategic vision to position our company at the forefront of the email marketing world. The ideal candidate will be looking for a challenge and have 1-2 years of experience. This is a great opportunity to progress quickly to become an email and B2B marketing specialist. This is a unique and exciting position at a growing marketing technology company. <br /><br />*You will:*<br /><br />Own marketing operations and drive reach, leads, opportunities, customers, revenue and brand reputation<br />Improve and own the marketing calendar to ensure consistent and excellent marketing campaigns<br />Working with Kickdynamic team to produce regular content via blog, LinkedIn and social media<br />Own website updates and online marketing<br />Work with sales team to product weekly tactical email marketing campaigns to promote the excellent work our<br />customers are doing with the platform<br />Manage our popular customer events and other events we are attending or sponsoring<br />Manage all marketing communications with customers<br />Work with Account Managers to produce case studies, quarterly showcases, whitepapers and look books<br />Create regular reports and action plans that feedback success, failures and plans<br /><br /><br />*About you:*<br /><br />You are independent and curious<br />You love technology and innovation<br />You are great at building relationships with customers<br />You are confident and calm<br />You have other non ‘work’ interests or hobbies<br />You find solutions to problems<br />You have great written and verbal skills<br />You are a self-starter <br /><br />*About Kickdynamic:*<br /><br />The Kickdynamic innovative platform lets marketers dynamically change their product content, branding and messages in real time to match every individual customer. Customers embed Kickdynamic into their email to automatically personalize content to every customer based on their preference, behaviour, previous purchase & open-time context - automatically. Our platform is the smarter way to personalize email content and helps brands engage with their customers in a more meaningful way to generate more revenue from their email marketing programs. Kickdynamic works with leading international brands, including ASDA, ASOS, New Look, Mr Porter, Thomas Cook, IHG, Aer Lingus, Staples.<br /><br />*What we offer:*<br /><br />Location: London and opportunity to work from home. Our office is the Tower Hill WeWork with arguably the best view of London. <br />Competitive salary & bonuses<br />Generous holiday <br />Work-life balance is really important to everyone at Kickdynamic - we believe it and practice it<br />Pick your own equipment. We'll set you up with whatever laptop + monitor combo you want plus any software you need",
    "urlFetchPending": false,
    "published": "Oct 6, 2017 12:52:04 PM",
    "tags": [
      "REMOTE1_50",
      "TITLE1_manager",
      "TZ_Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "Europe timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "gf9vD7mIS1yZLJyJDJUnpw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3908-project-manager-implementation-navblue",
    "title": "Project Manager - Implementation @ NAVBLUE",
    "content": "<h2>              Project Manager - Implementation<small> @ NAVBLUE</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-04 17:46</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>Summary:</strong></p><p>NAVBLUE, an Airbus Company, is a leading global provider of flight operations solutions which directly support millions of flights each year and help NAVBLUE’s airline customers maximize efficiency, reduce costs, ensure compliance with complex national and international safety regulations, and effectively deliver their services.</p><p>NAVBLUE’s software solutions form integral components of our airline customers’ operations centres, and we are currently seeking a Project Manager to lead and manage software implementations into these sophisticated technological environments.  This role will be responsible for planning, directing and coordinating project activities for large, complex software implementations in collaboration with our customers’ project managers and other key stakeholders, as well as with NAVBLUE’s technical and product personnel.  A key focus for this role will be on managing project activities to ensure that goals and objectives of projects are accomplished within the prescribed time frame and funding parameters. </p><p>The successful candidate is an effective, confident communicator with extensive experience in implementing large, complex SaaS products into sophisticated customer environments, knows the right questions to ask to get the job done, can deal with ambiguity in a fast-paced environment, and can demonstrate sound leadership to business partners and key stakeholders.  You thrive on learning, enjoy collaborating with colleagues to help deliver results yet can work effectively under minimal supervision and direction, and expect that hard work is required to do great things.  The ability to manage multiple ongoing projects and handle multiple timelines and priorities is essential to being successful in this role.</p><p><strong>Responsibilities:</strong></p><ul><li>Develops project plans specifying goals, scheduling, identification and management of risks, contingency plans and allotment of resources; review with Senior Management as required</li><li>Co-ordination and communication with customers and internal stakeholders in multiple countries and across multiple time zones</li><li>Synchronize NAVBLUE’s project/implementation plan with customer’s project manager and plans</li><li>Annual program planning and budget development</li><li>Formulates technical scope and objectives of project for project personnel; manages project scope and communication with customers to ensure that deliverables meet customer expectations.</li><li>Identifies and schedules project deliverables, milestones, and required tasks including hand-over to customer support (user manuals &amp; product documentation, scheduling training, hand-over to Account Management, orientation with NAVBLUE’s customer support infrastructure)</li><li>Liaises with team members to ensure clear understanding of project scope, requirements and budget</li><li>Schedules and facilitates customer and project team meetings</li><li>Creates and maintains activity and progress reports for both internal and external customers</li><li>Monitors projects to ensure that they are on budget throughout the life of the project; identifies and reports project changes that affect budget</li><li>Establishes and maintains good communications with Product Management, the customer and internal staff on project issues and concerns including managing customer expectations on requests for changes to project deliverables.</li><li>Monitors quality of project deliverables</li><li>Anticipates and devises solutions to problems that may arise in project execution</li><li>Properly notifies Management of any pending or current escalations relating to the project that could impact the success of the project</li><li>May include management of third party vendors</li></ul><p><strong>Academic/Educational Requirements:</strong></p><ul><li>Successful completion of University degree in Computer Science, Business Administration, or equivalent work experience</li><li>Project Management Professional credentials from accredited Project Management Institute, or equivalent work experience</li></ul><p><strong>Required Skills/Experience:</strong></p><ul><li>5 – 7 years Project Management and Implementation experience in a software technology environment, with projects of varying scope and size</li><li>Superior communication, people management and technical presentation skills</li><li>Strong problem solving, facilitation and organization skills</li><li>Prior experience in commercial airline flight operations a definite asset</li><li>Able to travel to global customer sites as required</li><li>Extensive experience with MS Project and MS Excel</li></ul><p><strong>About Us:</strong></p><p>NAVBLUE is the new generation of digital, user-friendly Flight Operations and Air Traffic Management solutions.  Powered by Airbus’ pioneer spirit and infused with Navtech’s agility, it combines the best of both worlds.</p><p>A leading global provider of flight operations solutions serving more than 400 airlines and aviation service companies across all platforms, NAVBLUE has a proven track record in product innovation.  With access to Airbus’ resources and data, NAVBLUE provides its customers with the best solutions based on the best data, fully supporting them in their digital transformation.</p><p>NAVBLUE is a fully owned subsidiary of Services by Airbus and is based in Hersham (UK), Cardiff (UK), Toulouse (France) and Waterloo, ON (Canada), with offices around the world.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>North America, EMEA</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 4, 2017 8:46:30 PM",
    "tags": [
      "REMOTE1_50",
      "TITLE1_manager",
      "TZ_Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "Europe timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "hFOTokW5RRKNFEGO1p_erw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/62034/passionate-sales-executive-at-melitarose/",
    "title": "Passionate Sales Executive",
    "content": "The story behind Melitarose<br /><br />Serena founded Melitarose in 2014 whilst on maternity leave.<br /><br />Wanting to use this time to relax, enjoy the experience and channel her entrepreneurial spirit, she decided to start her own brand and create footsteps towards her future.<br /><br />The name comes from a culmination of her grandmother’s name ‘Melita’ and her mother’s name ‘Rose’, both of whom are important and influential figures within her life. A brand made of simplicity and nostalgia, the idea was based on Rose’s love of candles and Melita’s hours spent working on her beautiful rose garden.<br /><br />We are a start-up business selling a scented , soy wax candles. We sell our product online and wholesale, to independent retailers & online businesss across the UK.<br /><br />You will be required to secure new business with prospective clients.<br /><br />We are looking for a strong , experienced sales people who are highly passionate , motivated & an interest in all things home decor or beauty related.<br /><br />If you’re fun, creative, focused, ambitious, inspiring , self motivated and have an understanding of  the beaut industry then you’re exactly what we are looking for!<br /><br />We want you to be a part of this exciting phase in our incredible journey.<br />If you would like to come and work for a company that’s innovative, loves what they do and values their sales people, then please read on!<br /><br />About the role<br />You will successfully secure sales and help us build the company and brand into a successful and thriving business. This involves:<br /><br />• Travelling around London meeting potential clients<br />• Providing management with feedback<br />• Working from home<br />• Commit for 1 day a week with the hope to increase hours if your happy.<br /><br />About you:<br />• A positive attitude<br />• Focus , ambitous and determined<br />• Excellent communication skills (verbal & written)<br />• Good negotiation skills with buyers<br />• Motivated, confident, reliable, polite and punctual<br />• Solid background in face-to-face sales<br />• Able to bring fresh ideas to implement strategies<br />• Clean driving license <br />• Be passionate about candles & beauty<br /><br />Working hours<br />Very flexible: on an ad-hoc basis, with various shifts to suit you, between Monday to Friday ( we are very flexiable)<br /><br />Compensation<br />You need to be self-employed. You will earn an excellent commission fee for each order confirmed.<br /><br />Next Steps<br />If you are interested in applying for this role, please send your CV and picture, along with a covering letter telling us why you think you are perfect for this role, and why you want to join us.<br /><br />**Please only apply if you are available to start within the next week. **<br /><br />We will arrange interviews with stand-out applicants.<br />Part of the interview process will involve you giving us a 5-minute mock presentation of how you would pitch our product to a prospective client.<br /><br />We look forward to hearing from you!",
    "urlFetchPending": false,
    "published": "Sep 28, 2017 1:41:45 PM",
    "tags": [
      "TITLE1_manager",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  }
]
}
