{
 "items": [
  {
    "id": "v4JzE4uNTsmo3GQg7AZIVA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159062/senior-software-quality-engineer-ems-software?a=Rlm6PuQplC0",
    "title": "Senior Software Quality Engineer at EMS Software (Greenwood Village, CO) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise Software</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>What will you do?</strong> You will be responsible for software testing, working within a product team and with the individuals on that team to execute our technical testing strategies, including our test automation strategy. You will also provide technical advice and assistance on test tools, test planning, and test design – with an emphasis on test automation. You will provide recommendations in regards to technical approaches, deployments, tool uses, and integrations.&nbsp;</p><p><strong>Who are you?</strong></p><ul><li>You are an early adopter of tools and technology and understand that the automation of tests and other tasks is one component of a good quality engineer.</li><li>You bring your brain to work. You’re not a rookie and you know how to assess a situation or platform and recommend solutions.</li><li>Because you’re a professional, you know what needs to be done and you know how to work with stakeholders to make it happen.</li><li>You’re a Software Tester that has worked within different SDLC methodologies (Agile, waterfall, etc.).</li><li>You understand how to design a testing solution based on good testing practices and you use test automation concepts and tools to enhance that solution.</li><li>You’re able to research root causes around issues and identify, recommend and execute solutions.</li><li>You’ve contributed to automation strategies and you write tests using tools and other technology forums based on your deep testing knowledge.</li><li>You are a technical testing expert and you have created and/or contributed to one or more testing frameworks and you can speak to the differences between them.</li><li>You can provide informal knowledge transition and/or hands-on training with other team members.</li><li>You have the ability to adapt and learn from coworkers and share information and experiences in a variety of communication modes.</li><li>You are flexible and adaptable when needed, but you know when to deep dive and focus on the task at hand.</li><li>You both contribute to and consume from the Software Testing community in the form of writing or speaking and stay up on current trends and technologies in order to enhance your career and professional development.</li></ul><p><strong>Your Skills</strong></p><ul><li>You have experience with: object-oriented programming languages (C#, Java), .NET technologies, SQL/TSQL (including DML/DDL/function commands), stored procedures, DB Tracing, DB Profiling/SQL Profiler, impact analysis, DB sharding, JavaScript, AJAX, JSON, XPath.</li><li>You have expertise and a strong understanding of object-oriented programming principles and can consult on coding to support test automation.</li><li>You have experience in Web Services (SOAP, REST) and automated testing tools (<em>g.</em>, Selenium, WebDriver API, SoapUI, Cucumber) and mobile and performance testing strategies.</li><li>You have experience with scripting languages, preferably Windows PowerShell and batch scripting.</li><li>You know how to integrate third party APIs/tools from GITHUB or any other open sources as automation needs arise.</li><li>You have strong working knowledge and implementation practice of software development life-cycle and testing tools.</li><li>You like to learn and actively seek new skills and knowledge to keep up with the changing technology field, including bringing new ideas to the team.&nbsp;</li></ul>                    </div>                            <h2>                About EMS Software            </h2>            <div><p>EMS Software offers the most comprehensive, cutting-edge platform to enable innovative work and learning environments. We make it easier to connect people with space, resources, and technology – allowing them to collaborate flawlessly, make informed business decisions, and get more out of each day.</p><p><em>EMS Software is an equal opportunity employer. In order to provide equal employment and advancement opportunities to all individuals, employment decisions at EMS Software will be based on merit, qualifications, and abilities. EMS Software does not discriminate against any person because of race, color, creed, religion, sex, sexual orientation, national origin, ancestry, disability, veteran status, age or any other characteristic protected by law.</em></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Medical, dental and vision plans                            </div>                            <div>                                 Physical fitness reimbursement plan and on-site fitness center                            </div>                            <div>                                 Self-Directed PTO                            </div>                            <div>                                 Flexible work environment and remote work options                            </div>                            <div>                                 Competitive compensation and employer-matched 401(k) savings plan                            </div>                            <div>                                 &quot;Bug hunts,&quot; casual dress code, open floor plan, collaboration spaces                            </div>                            <div>                                 Two blocks from the Arapahoe Village Center RTD Station                            </div>                            <div>                                 Walking distance to numerous bars, restaurants and coffee shops                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_software-quality",
      "TECH2_scripting-language",
      "TECH2_web-services",
      "TECH2_automated-tests",
      "REMOTE1_100",
      "TZ_unknown",
      "TECH2_oop",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "automated-tests",
      "oop",
      "scripting-language",
      "software-quality",
      "web-services"
    ]
  },
  {
    "id": "BTrsLwvLRrK1oiczveleAA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156414/intermediate-senior-software-qa-engineer-daily-kos-kos-media-llc?a=QsipXNsNmyk",
    "title": "Intermediate/Senior Software QA Engineer at Daily Kos (Kos Media LLC) (Oakland, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Digital Media</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are seeking an experienced QA lead to shape the QA function at Daily Kos. Currently most QA at Daily Kos is done manually and the responsibility is spread across a few people on staff who also have other roles. This QA Engineer will be the first dedicated hire for QA and will have a significant role in shaping the department as we expand our development team and build out more capacity for automated testing. Applicants should be self-sufficient and comfortable working independently. In addition we are looking for someone who:</p><ul><li>can clearly and precisely document bugs and the steps to reproduce them</li><li>can write and follow detailed test plans for new features</li><li>can use the JavaScript console, debugger, and other browser developer tools</li><li>can write and run raw SQL queries in MySQL or PostgreSQL; knowledge of other data storage a plus</li><li>can read Ruby and JavaScript code&nbsp;</li><li>has awareness of typical programming errors and the unexpected things users do whether accidentally or maliciously</li><li>has exposure to performance and security testing</li><li>has exposure to front-end automated testing tools</li><li>can summon a maddeningly creative approach to breaking things and other chaos monkey skills</li><li>enjoys using the Daily Kos application in general</li><li>will advocate for our users both internally and externally to ensure they have the reliable tools that they need and do what they need and expect</li></ul><p>At Daily Kos, we believe that the diversity of ideas, experiences and cultures that our employees contribute to our organization help us be more effective in our work, and we are proud to be an inclusive and equal-opportunity workplace. We're a company that loves learning and supports growth and training for all our employees.</p><p>To apply, please send an email to <a href='mailto:tech_jobs@dailykos.com' rel='nofollow'>tech_jobs@dailykos.com</a> with the name of the position in the subject line, a cover letter, code sample or github repo and your resume (include your LinkedIn profile link).</p>                    </div>                            <h2>                About Daily Kos (Kos Media LLC)            </h2>            <div><p>DailyKos, the leading online progressive blogging and activism platform, is looking for an Intermediate/Senior Software QA Engineer.</p><p>DailyKos is a great place to work-- your code will be used by hundreds of thousands of people a day who care deeply about progressive politics and are working to effect real political change. We provide an extensive feature set that extends from blogging to activism and beyond. If you want a job that provides more than just a technical challenge, we'd love to hear from you.</p><p>The job offers a flexible work environment, the ability to work remotely (US only, please) on a distributed team of self-sufficient collaborators, competitive salary and benefits, and we provide an Apple MacBook Pro or your preferred comparable hardware. Our organization’s commitment to personal growth reduces churn and encourages a very rewarding long term position. We have an energized team filled with great people with different backgrounds.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 100% Medical Coverage                            </div>                            <div>                                 6 weeks paid vacation per year                            </div>                            <div>                                 401K Plan                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_ruby",
      "TECH2_qa",
      "TECH2_javascript",
      "REMOTE1_100",
      "TECH2_testing",
      "TZ_unknown",
      "TITLE1_qa",
      "TECH2_mysql"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "javascript",
      "mysql",
      "qa",
      "ruby",
      "testing"
    ]
  },
  {
    "id": "wu--qbNjSZyFxLu8Ki9Fxw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/143641/software-quality-engineer-zf-friedrichshafen-ag?a=MaHZVnWg9oc",
    "title": "Software Quality Engineer at ZF Friedrichshafen AG (Düsseldorf, Deutschland) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Embedded Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Automotive, Autonomous Driving, Safety Technology</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>10k+ people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>WHY JOIN ZF TRW?</strong></p><p>ZF TRW operates a global network of technical centers worldwide where we employ engineers, researchers, designers and technicians. Our global network allows us to develop active and passive automotive safety technologies, while continuously improving existing products and systems.</p><p>Employees use sophisticated testing and computer simulation equipment. We have advanced engineering and research and development programs for next-generation products in all of our segments.</p><p>ZF TRW is disciplined and innovative in our approach to research and development, employing various tools to improve efficiency and reduce cost, such as Six Sigma, &quot;follow-the-sun&quot; (a 24-hour a day engineering program that utilizes our global network) and other e-Engineering programs.</p><p>The safety technologies market is hot, and ZF TRW is at the forefront. Come join the global leader in automotive safety and apply today!</p><p>The Software Team is responsible for the development and release of software for a number of high profile and challenging global applications with European, North American and Chinese vehicle manufactures. A senior software engineer is required to support this development striving for customer delight with timely deliveries, novel system functions and high quality software.</p><p><strong>Your task:</strong></p><ul><li>Creation, monitoring and reporting of quality targets for the active quality assurance of software-based application projects</li><li>Review of work products, initiation of improvement measures during development</li><li>Support for the optimization of the development processes</li><li>Support for the implementation of a user-oriented infrastructure, considering the development processes</li><li>Consulting and training of specialist departments &amp; project teams in the application of development processes and infrastructure</li></ul>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Flexible working time models                            </div>                            <div>                                 Numerous opportunities for professional development, training, expert                            </div>                            <div>                                 30 vacational days                            </div>                            <div>                                 Employees profit from various discounts                            </div>                            <div>                                 Christmas and Holiday Pay                            </div>                            <div>                                 Catering facilities on-site                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_aspice",
      "TECH2_embedded",
      "TECH2_automated-tests",
      "REMOTE1_100",
      "TECH2_testing",
      "TECH2_c",
      "TZ_unknown",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "aspice",
      "automated-tests",
      "c",
      "embedded",
      "testing"
    ]
  },
  {
    "id": "dOcMnRDeTIi2nRQikFaOaA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159536/leadership-opportunity-for-qa-engineer-on-inventorylab-inc?a=RvdaCfZyfPa",
    "title": "Leadership opportunity for QA Engineer on Solutions Focused Remote Team at InventoryLab Inc. () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>SaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>*Open to US residents only. We do not sponsor employment visas.*</strong></p><p>At InventoryLab we are redefining the workflow of thousands of Amazon sellers. Our product simplifies product sourcing, inventory management, Amazon listing, and profitability analysis for our customers. We are looking to add A-grade players to our customer-driven team to meet increased demand and support our exciting future plans.</p><p>We are searching for a Software Quality Assurance Engineer&nbsp;confident in taking our good QA function to world-class status. We need a player/coach that can check all the boxes on this list:</p><ul><li>QA pro that has already turned out high-quality software while improving throughput.</li><li>Connected QA industry sponge that is on top of trends and knows what works.</li><li>Leader who can analyze a QA landscape, see areas to improve, and make it stronger.</li><li>Loves collaborating throughout the entirety of the SDLC with a distributed team (SW Development, Product Manager, Designer, Customer Champions) of talented players.</li><li>Makes quality happen on the input side and not just the output side - partner in the design and definition of new features or enhancements with your QA lens.</li><li>Roll-up-your-sleeves software tester that can build and execute manual/automated unit/integration/regression/smoke tests effectively and knows when to use them.</li><li>Fast learner that can see the big picture and speaks up when something doesn’t feel right.</li><li>People leader that can get the most from the SQA Analysts on your team.</li></ul><p><strong>How we get it done:</strong></p><ul><li>Our focus is on how we can continue to provide an optimal user experience.</li><li>We use Jira for product management, issue reporting, ideology, and documentation.</li><li>Basecamp is our project management and team communication tool of choice.</li><li>We rely on TestRail to keep our testing efforts sorted out.</li></ul><p><strong>What we are looking for:</strong></p><ul><li>You have at least 2 years experience as a SQA Engineer.</li><li>You have at least 2 years experience managing or supervising a team.</li><li>You have successfully put SQA processes in place before.</li><li>You know your way around software design, programming and automated testing software.</li><li>You live for details. You understand that details are the difference between a failed and successful release. In fact, when we ask you later, you will tell us that your favorite color is Island Blue!</li><li>You have a BS in Computer Information Systems, or related experience.</li><li>You are self-driven and can thrive as part of a remote team.</li></ul><p><strong>What will set you apart:</strong></p><ul><li>Someone who cares more about getting the product right than being right.</li><li>Experience with Agile/Lean Methodologies.</li><li>You have navigated the challenges of working remotely and are fully prepared to work within them.</li><li>A little coding knowledge goes a long way so let us know what you know. C# and Java knowledge get extra points.</li><li>You’ve sold in, worked with, or been frustrated by the API’s of online marketplaces in your past.</li></ul>                    </div>                            <h2>                About InventoryLab Inc.            </h2>            <div><p>At InventoryLab we work in small multidisciplinary teams to plan next steps and give advice but we all are responsible for making it happen. You will have the freedom, and responsibility, to chart your own course. Working at InventoryLab means choosing your own work location every day, responsible time off, and a full benefits package.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Technology you need                            </div>                            <div>                                 401K with company match                            </div>                            <div>                                 8 Paid Holidays                            </div>                            <div>                                 Responsible Time Off policy                            </div>                            <div>                                 Health &amp; Fitness Reimbursement                            </div>                            <div>                                 Home Office Allowance                            </div>                            <div>                                 Health Insurance                            </div>                            <div>                                 Dental/Vision Insurance                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_amazon-web-services",
      "TECH2_c#",
      "TECH2_automated-tests",
      "REMOTE1_100",
      "TECH2_testing",
      "TECH2_java",
      "TZ_unknown",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "automated-tests",
      "c#",
      "java",
      "testing"
    ]
  },
  {
    "id": "slQb-bA2T4md82RUFi6MLg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/151919/software-qa-engineer-olo?a=OWPEpLRV7ck",
    "title": "Software QA Engineer at Olo (New York, NY) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>E-Commerce, Mobile, Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Olo seeks a skilled Software Quality Assurance Engineer to join our engineering team and help us foster whole team quality and testing. You’ll work with a smart, passionate team dedicated to delivering amazing products and committed to a multi-faceted approach to product quality.</p><p>At Olo we develop an online food ordering platform used by many of the country’s largest restaurant chains, reaching millions of consumers. We are revolutionizing the customer experience at these restaurant chains, and we're looking for talented engineers to join our team and help achieve our vision. As part of the team you’ll play a significant and visible role in helping us build the most robust food ordering platform on the market.</p><p>This is a full-time position.</p><p><strong>Responsibilities</strong></p><ul><li>Help us evolve our QA function from Quality Assurance to Quality Advocate.</li><li>Promote team ownership of product quality for our platforms and products.</li><li>Collaborate with product owners and developers to design, implement and maintain test plans, and test scenarios and test cases.</li><li>Support our kanban flow and continuous delivery initiatives.</li><li>Propose creative solutions to our testing problems, both technological and process.</li><li>Identify and contribute to automated test solutions.</li><li>Apply a variety of testing techniques to validate new features.</li><li>Find and report defects with detailed, accurate and concise steps to reproduce.</li><li>Recommend system enhancements where you see opportunities for improvements in UX, reliability, performance, etc.</li></ul><p><strong>Requirements</strong></p><ul><li>You are able to evaluate a product or user story specification and convert that into an actionable test plan.</li><li>You can empathize with a variety of users, be they hungry consumers, restaurant managers, or Olo administrators.</li><li>You demonstrate a strong command of manual and exploratory testing methodologies and general software quality concepts.</li><li>You have worked in an Agile lifecycle and can troubleshoot at lightning speeds.</li><li>You have extensive knowledge of web technologies and experience testing web APIs.</li><li>You have earned a Bachelor’s in Computer Science, or related field, or have comparable industry experience.</li><li>At least 4 years of experience in an agile testing role.</li></ul><p><strong>Beneficial</strong></p><ul><li>Experience working in a C#/.NET environment.</li><li>Experience with version control (especially Git).</li><li>Experience with TeamCity and AWS.</li><li>Experience testing hosted/cloud SaaS web applications is highly desirable.</li><li>Experience testing native mobile applications is desirable.</li></ul>                    </div>                            <h2>                About Olo            </h2>            <div><p>Olo is the leading provider of digital ordering for today’s restaurants. We help restaurant brands maximize revenue per square foot by delivering faster, more accurate, and more personal service to their customers.</p><p>We’re quite up-front about the technical challenges our business faces. &nbsp;Running a platform with multiple white-labeled front-ends, that maintains real-time connections into thousands of restaurants’ POS systems, and coordinates complex transactions between these and other third parties (such as payment gateways and gift card providers) is not for the faint of heart!</p><p>Olo is located at 26 Broadway in the historic Standard Oil Building, the former home of John D. Rockefeller. &nbsp;We offer great benefits, such as 20 days of Paid Time Off, paid health, dental and vision care, stock options, a generous maternity/paternity leave plan and perks like FitBits, rotating craft beers on tap in our kitchen plus a fully stocked wine fridge, and food events featuring our clients' menu items (now you know why we give out FitBits!).</p><p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 20 Days of PTO                            </div>                            <div>                                 Semi-private offices                            </div>                            <div>                                 Health, Vision &amp; Dental coverage (you + your family)                            </div>                            <div>                                 Flexible working hours                            </div>                            <div>                                 Competitive Compensation Package                            </div>                            <div>                                 Powerful workstations                            </div>                            <div>                                 401(k) Plan                            </div>                            <div>                                 Maximum respect                            </div>                            <div>                                 Food events &amp; monthly team events                            </div>                            <div>                                 12 week paid parental leave                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_qa",
      "TECH2_c#",
      "REMOTE1_100",
      "TECH2_testing",
      "TZ_unknown",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "c#",
      "qa",
      "testing"
    ]
  },
  {
    "id": "YEbCR2DuT-qyidU9COz1Ow",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/153854/sr-mobile-test-engineer-developer-in-test-instructure?a=PB4aKhs4oM0",
    "title": "Sr. Mobile Test Engineer (Developer in Test) at Instructure (Salt Lake City, UT) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Mobile Developer, QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Education Technology, Enterprise Web Solutions, SaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>501-1k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>What you will be doing:</p><ul><li>Writing automated tests for multiple Android and iOS applications</li><li>Leverage and extending API clients to seed test data</li><li>Maintaining, improving, and building automation tools and frameworks</li><li>Manually testing new changes as necessary</li><li>By any means necessary, making sure the products are high quality and do what they’re meant to do</li></ul><p>What you need to have:</p><ul><li>5+ years of development or test automation experience; experience with iOS and/or Android strongly preferred</li><li>Strong object-oriented programming experience with one or more of the following languages: Java, Kotlin, Swift, Objective C, JavaScript, Ruby</li><li>Experience with the following frameworks/tools preferred: Espresso, EarlGrey, React Native, Buddybuild, Bitrise</li><li>Bachelors Degree in a technical field (Computer Science, IS, IT, etc) or equivalent work experience</li><li>Excellent communication and analytical skills</li></ul>                    </div>                            <h2>                About Instructure            </h2>            <div><p>Instructure was founded to define, develop, and deploy superior, easy-to-use software. (And that’s what we did / do / will keep on doing.) We are dedicated to the fight against iffy, mothbally, shoddy software. We make better, more usable tools for teaching and learning (you know, stuff people will actually use). A better connected and more open edtech ecosystem. And more effective ways for everyone everywhere to access education, make discoveries, share knowledge, be inspired, and do big things. We accomplish all this by giving smart, creative, passionate people opportunities to create awesome.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 100% paid Medical, Dental, AD&amp;D, Life                            </div>                            <div>                                 Paid time off and 9 paid holidays                            </div>                            <div>                                 HSA program, Vision, and more                            </div>                            <div>                                 Free gym membership and rewards-based fitness tracking                            </div>                            <div>                                 Equity                            </div>                            <div>                                 Flexible schedule                            </div>                            <div>                                 Fully stocked kitchen and catering                            </div>                            <div>                                 401K (with a company match) and Tuition Reiumbursement                            </div>                            <div>                                 Lifty desks, comfy chairs, and a casual dress code                            </div>                            <div>                                 Employee Stock Purchase Plan                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_automation",
      "TECH2_ruby",
      "TECH2_qa",
      "REMOTE1_100",
      "TECH2_ios",
      "TECH2_android",
      "TZ_unknown",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "android",
      "automation",
      "ios",
      "qa",
      "ruby"
    ]
  },
  {
    "id": "jlHfOV-PQlWn_ax2pq1vow",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/153232/senior-qa-engineer-sa-ignite?a=Po8jDQDCejK",
    "title": "Senior QA Engineer at SA Ignite (Chicago, IL) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise, Healthcare, SaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>SA Ignite is looking for <strong>Senior QA&nbsp;engineers</strong> to engage with an experienced cross-disciplinary team to design and develop innovative products in the healthcare industry. Do you get a thrill out of using new technologies and doing what others think can’t be done? Can you design, develop, execute and maintain complex tests for a software system that must scale seamlessly with the ever-increasing numbers of users that work in healthcare today. At SA Ignite, we embrace challenges like these, as we work to improve the U.S. healthcare system leveraging big data, analytics and machine learning.</p><p><strong>Basic Qualifications</strong></p><ul><li>Bachelor’s Degree in Computer Science, Computer Engineering or related field</li><li>5+ years of professional experience in enterprise software development</li><li>Proficiency in Oracle Java or Microsoft .NET</li><li>Passion for building quality systems</li><li>Experience in shipping complex software systems</li><li>Familiarity with automated testing frameworks</li><li>Experience with open source tools and resources</li><li>Highly autonomous, detail-oriented and possesses strong written and communication skills</li></ul>                    </div>                            <h2>                About SA Ignite            </h2>            <div><p>SA Ignite is a high growth company that helps healthcare organizations simplify the management of complex value-based programs through SaaS products and advisory services. Our SaaS products, combined with our strategic advisory services, enable a proactive approach to value based payment programs — including Meaningful Use (MU), the Merit-Based Incentive Payment System (MIPS) and other MACRA programs offered by the Center for Medicare and Medicaid Services (CMS).</p><p>Our management team has previous experience building successful companies with software products. Our employees are passionate about what they do and how our products help our customers. We embrace our company’s culture and values, which greatly impacts our employees, customers and society.</p><p>We’re headquartered in Chicago, IL, USA.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive Compensation                            </div>                            <div>                                 Equity Opportunities                            </div>                            <div>                                 Matching 401K                            </div>                            <div>                                 The best workstations for improved productivity                            </div>                            <div>                                 Unlimited Paid Time Off                            </div>                            <div>                                 Health Insurance                            </div>                            <div>                                 Life Insurance / AD&amp;D                            </div>                            <div>                                 Vision &amp; Dental Insurance                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_qa",
      "TECH2_sql",
      "REMOTE1_100",
      "TECH2_java",
      "TZ_unknown",
      "TITLE1_qa",
      "TECH2_selenium",
      "TECH2_junit"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "java",
      "junit",
      "qa",
      "selenium",
      "sql"
    ]
  },
  {
    "id": "lyLfCWKWR0amMKWc5QtiEw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/148500/software-test-engineer-odyssey?a=NNK1crtawRa",
    "title": "Software Test Engineer at Odyssey (Indianapolis, IN) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer, DevOps</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Digital Media, Marketing, Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are looking for a Software Test Engineer t that will closely integrate with the software engineering team and empower them, helping to create tooling and efficiencies for automated testing of the development.</p><p><strong>Our Stack</strong></p><ul><li><strong>Frontend</strong>: React + Redux + Babel + ImmutableJS + Draft.js, Sass, Webpack, ES6</li><li><strong>Backend</strong>: Node.js + Sequelize, Koa, ExpressJS, Python</li><li><strong>Persistence Layer</strong>: MySQL (Amazon RDS Aurora), MSSQL</li><li><strong>Platforms</strong>: AWS Elastic Beanstalk, AWS Lambda, Docker Swarm</li><li><strong>Monitoring</strong>: New Relic, StatusCake, Sentry.io, Grafana, InfluxDB</li><li><strong>Quality Assurance</strong>: Jest, Selenium, ESLint</li><li><strong>Misc</strong>: Redis, Docker, Drone CI/CD, AWS services</li></ul><p><strong>What we expect of you</strong></p><ul><li>Ability to write end-to-end and integration tests in JavaScript testing frameworks.</li><li>Interest in agile development and DevOps.</li><li>Ability to thoroughly understand underlying technologies, to understand what the largest candidates are for what should be tested.</li><li>Basic knowledge of at least one web MVC framework, preferably React–you need to be able to get your hands dirty in feature code.</li><li>Engage with software engineers to develop a test plan for our software</li><li>Engage with DevOps engineers to develop a full CI pipeline to run automated tests</li><li>Engage with the product team and engineers to develop “eye candy” that relay test success/failure information to the rest of the team</li><li>Ability to effectively communicate with local and remote employees alike</li><li>Be positive! We like to have fun and joke around while we work!</li></ul><p><strong>Bonus points if you…</strong></p><ul><li>Know other web testing platforms, and can converse about the pros and the cons between each.</li><li>Have experience in unit testing, integration testing, scalability testing, and UI testing.</li><li>Don’t mind running smoke tests, but you also don’t mind delegating to engineers, making QA an organic process that the whole team is responsible for.</li><li>Prefer a collaborative environment, and you have disdain for “throw it over the wall” or “gatekeeper” mentalities.</li><li>Know all the things. Or at least some of the things.</li></ul><p>Odyssey is an equal opportunity employer.&nbsp; &nbsp;Odyssey participates in E-Verify for Employment Eligibility Verification. Candidates must be eligible to work in the United States for any employer.&nbsp;<br> <br>Interested parties should email resume and LinkedIn profile to <a href='mailto:careers@theodysseyonline.com' rel='nofollow'>careers@theodysseyonline.com</a>.</p>                    </div>                            <h2>                About Odyssey            </h2>            <div><p>Odyssey is ushering in a shift in social media to bring complete, broader, more trusted ideas to the world. Launched in 2014, the social media platform empowers more than 15,000 local, millennial content creators to express what’s important to them and share it organically across their own social networks. As a result, Odyssey exposes its audience—more than 30 million strong and growing rapidly—to broader, more thoughtful, more honest perspectives on topics they care about. For more information, visit<a href='http://www.theodysseyonline.com/' rel='nofollow'> http://www.theodysseyonline.com/</a>.</p><p>We were featured in the <strong>Indianapolis Business Journal</strong> in a high-tech jobs report, after receiving <strong>$25M</strong> in an equity round. We recently rebuilt our online platform using our favorite technologies, and kicked off the new start with a <strong>beta launch</strong> <strong>event </strong>in New York City. We are quickly expanding our technology center in Indianapolis as we are becoming a top tech company in the region.</p><p>At Odyssey, our culture is at the heart of our company and your career potential is unlimited.</p><p><strong>A Collaborative Team</strong></p><p>The staff at Odyssey have worked hard to create an organic, flat environment across the company. The team works collaboratively, creating an atmosphere in which everyone’s ideas and opinions are solicited and considered equally, regardless of position. Executives and managers work with their teams closely and are there to support staff’s personal and professional growth—while also maintaining shared company vision.</p><p><strong>Odyssey Benefits: What We Offer</strong></p><p>In a word, “Collaboration!” Like other great companies, we offer the key essentials (Health benefits, 401K, etc.), but what distinguishes The Odyssey culture is how we set our people and teams up for success, and give them the tools, support and empowerment to thrive on both a professional and personal level. Our teams share a fierce “get it done” attitude. The Odyssey philosophy encourages our team members to strive for their goals, and fosters a transparent and supportive work culture. What you do matters every day.</p><p>The creative potential of our Company is derived from the collective experience of everyone who works here. We’re proud of our team, and we hire top tier talent to generate rock star results -– sound good so far?</p><p><strong>Oh, and about those other benefit areas…</strong></p><ul><li>Medical, Dental and Vision insurance coverage to keep you and your family healthy</li><li>Flex Time Off to encourage a positive work/life balance</li><li>Company Paid Holidays, of course!</li><li>401K to help you plan for your future</li><li>Transportation support for the NYC team for a better commute</li><li>Health Saving Account to save money now</li><li>Life Insurance to give you peace of mind</li><li>Long-term and short-term disability is available to give you extra peace of mind</li><li>Pet-friendly office, so it’s “take your dog to work day” on any day&nbsp;</li><li>Collaborative, transparent, and fun office culture to enjoy what you do</li></ul><p>Read more about us at www.about.theodysseyonline.com</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Health, Vision, &amp; Dental Insurance (Eligible 1st Day of Employment)                            </div>                            <div>                                 401K                            </div>                            <div>                                 Commuter Benefits                            </div>                            <div>                                 Business Casual, Open Work Environment                            </div>                            <div>                                 Laptop Provided                            </div>                            <div>                                 Flex Paid Time Off                            </div>                            <div>                                 Bonus potential                            </div>                            <div>                                 Inviting and Friendly Work Atmosphere                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_automation",
      "TECH2_reactjs",
      "TECH2_qa",
      "TECH2_javascript",
      "REMOTE1_100",
      "TECH2_devops",
      "TZ_unknown",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "automation",
      "devops",
      "javascript",
      "qa",
      "reactjs"
    ]
  },
  {
    "id": "LqzDGb5mRaOzBxrxcr3tpw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/146502/qa-engineer-tester-with-superhuman-communication-mecum-auctions?a=N8chpRYtuzm",
    "title": "QA Engineer/Tester with Superhuman Communication Skills at Mecum Auctions (Walworth, WI) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Automotive</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>As a QA Engineer/Tester at Mecum Auctions, you will be responsible for ensuring the quality of the software we develop.&nbsp; The QA Engineer/Tester is in a unique role to not only help us make better software but also learn many diverse aspects of our business.&nbsp; The software development team at Mecum Auctions is a small agile group of talented individuals focused on building applications that solve the needs of the business.&nbsp; We are building both internal and customer facing applications focused on enabling our talented staff to do their jobs better or meeting the needs of hundreds of thousands of customers.&nbsp; Ideal candidates will be expected to have professional experience testing software and maintain a strong desire to build awesome things.</p><p>Remote candidates will be hired on a contract basis.&nbsp; Permanent hire is a possibility for successful contractors.</p><p>Mecum Auctions does not provide H1B Visa sponsorship.</p><p>You must reside in the United States.</p>                    </div>                            <h2>                About Mecum Auctions            </h2>            <div><p>Mecum Auctions is the world leader of collector car, vintage and antique motorcycle, and Road Art sales, hosting auctions across&nbsp;the United States. The company has been specializing in the sale of collector cars for over 30 years, now offering more than 15,000 vehicles per year and averaging more than one auction each month. &nbsp;Mecum auctions are broadcast live on NBCSN.</p><p>Headquartered in Walworth, WI, Mecum Auctions has been ranked No. 1 in the world with number of collector cars offered at auction since 2011, No. 1 in the world with number of collector cars sold at auction, No. 1 in the U.S. with number of auction venues, No. 1 in the U.S. in total dollar volume of sales, and is host to the world’s largest collector car auction held annually in Kissimmee, Florida.</p><p>Mecum Auctions is an equal opportunity employer. Full-time positions feature comprehensive benefits including fully paid health insurance for employee and 401K plan. Pay is commensurate with ability and experience.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Health                            </div>                            <div>                                 Dental                            </div>                            <div>                                 Retirement                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TZ_America",
      "TECH2_qa",
      "REMOTE1_100",
      "TECH2_testing",
      "TITLE1_qa",
      "TECH2_selenium"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": [
      "qa",
      "selenium",
      "testing"
    ]
  },
  {
    "id": "6xyJ6TizRLeIdbJdboKw7Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156355/quality-assurance-qa-engineer-tester-semanticbits?a=Qr4mdPHKiaI",
    "title": "Quality Assurance (QA) Engineer/Tester at SemanticBits () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Digital Health</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Responsibilities</p><ul><li>Define and maintain test plans and test specifications for functional, regression, and performance testing</li><li>Implement and maintain automated test scripts covering fundamental functions in the application</li><li>Work with the engineering team to improve automated testing where possible</li><li>Create manual test cases and validation of automation failures</li><li>Generate test reports and traceability matrix</li><li>Translate high-level business requirements into test scenarios</li><li>Assist in keeping application specifications accurate and up to date</li><li>Perform service-level testing on an as-needed basis</li><li>Work closely with engineering teams to discuss risk and risk mitigation</li><li>Assist in shaping the overall QA process by suggesting improvements, best practices, and new approaches to testing workflow</li></ul><p>Requirements</p><ul><li>Bachelor’s Degree in Computer Science or related field</li><li>Hands-on experience with different types of testing (System, Regression, Smoke, Performance, Load, etc.)</li><li>UNIX experience preferred</li><li>Knowledge of relational database concepts and good SQL skills preferred</li><li>Hands-on experience testing and debugging web-based software</li><li>Knowledge of micro-services based Architecture and messaging protocols preferred</li><li>Solid understanding of Software Configuration Management concepts and methodologies</li><li>Proficient in at least one source control tool (Git)</li><li>Experience with Load, Stress, and Performance testing</li><li>Experience with Agile development methodologies</li><li>Strong critical thinking, attention to detail, and analytical skills</li><li>Strong oral and written communication skills</li><li>Ability to work independently</li></ul>                    </div>                            <h2>                About SemanticBits            </h2>            <div><p>SemanticBits is a leading company specializing in the design and development of digital health services, and the work we do is just as unique as the culture we’ve created. We develop cutting-edge solutions to complex problems for commercial, academic, and government organizations. The systems we develop are used in finding cures for deadly diseases, improving the quality of healthcare delivered to millions of people, and revolutionizing the healthcare industry on a nationwide scale. There is a meaningful connection between our work and the real people who benefit from it; and, as such, we create an environment in which new ideas and innovative strategies are encouraged. We are an established company with the mindset of a startup and we feel confident that we offer an employment experience unlike any other and that we set our employees up for professional success every day.</p><p><strong>Salary &amp; Benefits</strong></p><ul><li>Generous base salary</li><li>Three weeks of PTO</li><li>Excellent health benefits program (Medical, dental and vision)</li><li>Education and conference reimbursement</li><li>401k retirement plan. We contribute 3% of base salary irrespective of employee's contribution</li><li>100% paid short-term and long-term disability</li><li>100% paid life insurance</li><li>FSA</li><li>Casual Working Environment</li><li>Flexible Office Hours</li><li>Unlimited Coffee &amp; Snacks</li></ul><p>SemanticBits, LLC is an Equal Employment Opportunity (EEO) employer and embraces workplace diversity.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Medical, dental, vision, life, disability                            </div>                            <div>                                 Matched 401K plan                            </div>                            <div>                                 Generous vacation allowances, floating holidays, and sick leave                            </div>                            <div>                                 Continued Education Reimbursement                            </div>                            <div>                                 Free coffee and snacks                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_automation",
      "TECH2_qa",
      "TECH2_sql",
      "REMOTE1_100",
      "TECH2_testing",
      "TZ_unknown",
      "TITLE1_qa",
      "TECH2_git"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "automation",
      "git",
      "qa",
      "sql",
      "testing"
    ]
  },
  {
    "id": "CRkKhmgPSMmmhl-CSGjNwQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/125119/mobile-test-engineer-ios-android-remote-creatubbles?a=FXAcQPOcE8g",
    "title": "Mobile Test Engineer (iOS & Android) - Remote at Creatubbles () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Mobile Developer, QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, Social Networking</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Creatubbles™ is the safe global community for creators of all ages. It is the perfect space for children, families and teachers to save, share, discover and interact with multimedia creativity portfolios. It lets anyone share their experiences and creations safely in more than 50 countries, whether they are at home, school, an event or activity.</p><p>We recognize creativity is a critical life skill to be developed and nurtured like any other form of expression. We believe in the importance of finding and developing your individual voice by being able to express thoughts and ideas freely.</p><p>Creatubbles™ is an integrated creativity ecosystem with a growing list of partners that believe in nurturing creativity through a safe and supportive environment.</p><p><strong>About our company</strong></p><p>We are an ambitious team of around 25 people, covering 14 nationalities and operating as a network of virtual teams around the world.</p><p>To fulfill our mission to nurture the original creativity of children around the world, we are constantly exploring new ways to incorporate the latest ideas, approaches, and technologies into our products and services.</p><p>At Creatubbles, you will be helping to build a product that serves not only the future of the world, but the parents and the teachers that guide them as well.</p><p>Main site:&nbsp;<a href='https://www.creatubbles.com' rel='nofollow'>https://www.creatubbles.com</a> <br>Blog: <a href='https://stateoftheart.creatubbles.com' rel='nofollow'>https://stateoftheart.creatubbles.com</a></p><p><strong>About our development Team and Technologies</strong><br>- We start the day with a standup call and organise our work in weekly iterations.<br>- Slack, Trello, Github, CircleCI and Amazon AWS are just a couple of the many friends we rely on every single day.<br>- ScreenHero allows us to enjoy pair­-programming sessions, even when members are located on the other side of the world.<br>- Our focus is to build and keep iterating on universal experiences and interfaces that work for and delight users between ages of 1 and 99.<br>- The back­end is made available to our web app, our native mobile apps and our partner's applications as a simple REST API.<br>- Security is extremely important to us as want our own kids to use our apps in a safe way.<br>- We follow a Balanced Teams approach whereby design/development/testing is tightly integrated.<br>- Our PMs keep tabs on the work to be done and prepare detailed acceptance criteria for each task.</p><p><br><strong>About you</strong><br>- You have experience working with testing native iOS and Android mobile apps (and Web app test experience is a big plus).<br>- You are a hero when it comes to manual testing but also know how to leverage crowd-based solutions like test.io<br>- You know your way with APIs and how to test apps that rely on them.<br>- You insist on clean and well-­maintained code with a good amount of test coverage that leads to beautiful user-­interfaces. You have experience with data­-driven product development: analytics, A/B testing, etc<br>- You have experience writing tests in some sort of xUnit framework.<br>- You take quality and testing very seriously. Very very seriously. Obviously.<br>- You are fluent in spoken and written English (knowledge of Japanese is a big plus).<br>- You have a pro­active personality, are a real team player and feel comfortable working in a fast-­paced tech startup environment.<br>- You have a fundamental interest in what we are doing and show empathy for our users.<br>- You have a general curiosity and an ability to embrace complexity.<br>- Ideally you are based somewhere in the European time zone to maximize work time overlap with our development teams.<br><br></p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Remote                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_swift",
      "TZ_Europe",
      "REMOTE1_100",
      "TECH2_ios",
      "TECH2_android",
      "TECH2_circleci",
      "TITLE1_qa",
      "TECH2_kotlin"
    ],
    "tagsNames1": [
      "100% remote",
      "Europe timezones"
    ],
    "tagsNames2": [
      "android",
      "circleci",
      "ios",
      "kotlin",
      "swift"
    ]
  },
  {
    "id": "b7NMgXyHR_CMmpgMShR1zg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/149859/qa-tester-onepulse-ltd?a=OfZZ6F03uMw",
    "title": "QA Tester at OnePulse Ltd () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Market Research</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>The main duties and responsibilities in this role will include, but are not limited to:</p><p>Hands on regression &amp; UAT testing of all functional modules, across different platform<br>Ensure the software meets expectations in terms of usability and features<br>Create and execute test plans and test scripts<br>Produce a readable, reproducible set of issues that our developers can easily replicate and fix</p><p>Requirements:</p><p>Experience of testing mobile apps on both iOS and Android<br>Experience of working with Development teams (Remote experience a plus)<br>Experience diagnosing, reporting, tracking and resolving quality issues<br>Knowledge of software development life cycle<br>Creation of test scenarios and test scripts<br>Sound understanding of software testing techniques and QA processes<br>Ability to understand software specifications and derive test scenarios from them<br>Methodical and thorough approach to investigation and solution of problems<br>Dedication to quality and meticulous approach<br>Strong attention to detail</p><p>Nice to haves:</p><p>Experience using Mantis for tracking issues<br>Experience with automated test tools such as Selenium</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Remote working                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_qa",
      "REMOTE1_100",
      "TECH2_testing",
      "TZ_unknown",
      "TITLE1_qa",
      "TECH2_selenium"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "qa",
      "selenium",
      "testing"
    ]
  },
  {
    "id": "aUqMJCJhSC-LJGrPjes2YA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/112752/hiring-automated-test-engineers-surge-llc?a=BOrbvuPoJyw",
    "title": "Hiring Automated Test Engineers at Surge, LLC () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>DevOps, QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>SURGE is looking for smart, self-motivated, experienced, senior automated test engineers&nbsp;who enjoy the freedom of telecommuting and flexible schedules, to work as long-term, consistent&nbsp;(40 hrs/week) independent contractors (no W2)&nbsp;on a variety of software development projects.</p>                    </div>                            <h2>                About Surge, LLC            </h2>            <div><p>Surge is&nbsp;a leading provider of custom web, cloud, mobile, digital, and desktop software development and consulting services to clients in every industry, from hot startups to Fortune 500 companies. Founded in 2007, and listed on the Inc. 5000 list of America's fastest growing companies for four straight years, the Surge team has successfully delivered hundreds of software products, apps, and solutions to its clients using a proven agile/scrum development process combined with an elite group of North American software professionals. Simply put, Surge offers America's best software engineers, on demand, at rates 30-50% less than the competition.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Great Pay                            </div>                            <div>                                 Choose Your Hours                            </div>                            <div>                                 Work From Home                            </div>                            <div>                                 Work With Happy People                            </div>                            <div>                                 Zero Commute                            </div>                            <div>                                 See Your Family More                            </div>                            <div>                                 Travel While You Work                            </div>                            <div>                                 Software Provided                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_qa",
      "TECH2_automated-tests",
      "TECH2_javascript",
      "REMOTE1_100",
      "TECH2_devops",
      "TECH2_java",
      "TZ_unknown",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "automated-tests",
      "devops",
      "java",
      "javascript",
      "qa"
    ]
  },
  {
    "id": "aKulZtY2QEq-TR32vo7oKw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/107608/senior-lead-qa-test-engineer-compucorp?a=A5tKNRSYI0M",
    "title": "Senior/Lead QA (Test) Engineer at Compucorp () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>CRM, Information Technology, Non-Profit</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Are you the QA engineer to help us implement a robust QA process for our open source platforms developed for non profit organisations?</p><p>We like to build stuff… sometimes complicated stuff… and sometimes it breaks! So we’re looking for a confident and ambitious Senior QA Test Engineer to join our distributed team.</p><p>We do things a little differently, basing all our solutions on open source products, having flexible working hours and real team mentality. Our work covers web design, CRM, app development and branding for Charities and non-profit organisations across the country. Our clients include Charities such as Wikimedia and Farm Africa, galleries such as the Photographers Gallery and Craft Central but also companies, trade associations and government bodies.</p><p>We are also developing several open source products that are used by non profit organsiations worldwide and the role will be uniquely rewarding as you will have the opportunity to influence and support these valuable projects.</p><p>The ideal candidate will be an experienced QA engineer who has worked on many complex web applications in the past.</p><p>The role will involve a mixture of writing and executing manual test scripts, feeding back to developers on bugs or issues noted. There may also be some future work on automation testing although the primary focus for this role will be manual testing. The ideal candidate would have some existing CRM and CMS experience (ideally Drupal), be an expert in developing comprehensive test plans and submitting bug reports. SQL knowledge and the ability to setup a basic development environment with Git would be a major advantage but are not essential for the role.</p><p>What were looking for is someone who can grasp concepts quickly, has great attention to detail, and loves picking holes in (other people’s!) logic. In short, we’re a team of self confessed geeks who love tinkering and tweaking until something is just right, and we’re looking for someone who thinks and acts like us to join our growing team.</p><p><strong>The idea candidate will have:</strong></p><p>- 5+ years experience developing test cases and plans&nbsp;for complex web applications<br>- Experience with implementing solid testing methodologies and processes within an existing organisation<br>- SQL skills a plus<br>- Basic git skills and an understanding of git workflows a plus<br>- A keen interest in developing open source technologies for non profit organisations</p>                    </div>                            <h2>                About Compucorp            </h2>            <div><p>We&nbsp;like&nbsp;to&nbsp;build&nbsp;stuff,&nbsp;sometimes&nbsp;complicated&nbsp;stuff,&nbsp;for&nbsp;people&nbsp;who&nbsp;like&nbsp;to&nbsp;make&nbsp;a&nbsp;difference. We&nbsp;do&nbsp;things&nbsp;a&nbsp;little&nbsp;differently,&nbsp;basing&nbsp;all&nbsp;our&nbsp;solutions&nbsp;on&nbsp;open&nbsp;source&nbsp;products,&nbsp;having&nbsp;flexible&nbsp;working&nbsp;hours&nbsp;and&nbsp;a&nbsp;real&nbsp;team&nbsp;mentality.&nbsp;With&nbsp;a&nbsp;team&nbsp;of almost 30 technology professionals we're&nbsp;passionate&nbsp;about&nbsp;the&nbsp;platforms&nbsp;we&nbsp;work&nbsp;with&nbsp;and&nbsp;the&nbsp;communities&nbsp;which&nbsp;we&nbsp;are&nbsp;part&nbsp;of.&nbsp; Our&nbsp;work&nbsp;covers&nbsp;web&nbsp;design,&nbsp;app&nbsp;development&nbsp;and&nbsp;branding&nbsp;for&nbsp;Charities&nbsp;and&nbsp;non-profit&nbsp;organisations&nbsp;across&nbsp;the&nbsp;country.&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible working hours                            </div>                            <div>                                 UK Visa Sponsorship                            </div>                            <div>                                 Remote working                            </div>                            <div>                                 Flexible holidays                            </div>                            <div>                                 Training and development                            </div>                            <div>                                 Contribute to Open Source projects                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_qa",
      "REMOTE1_100",
      "TECH2_testing",
      "TZ_unknown",
      "TITLE1_qa",
      "TECH2_selenium-webdriver",
      "TECH2_integration-testing",
      "TECH2_selenium"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "integration-testing",
      "qa",
      "selenium",
      "selenium-webdriver",
      "testing"
    ]
  },
  {
    "id": "Gcgk1HFgS-mEX8ANf9-ktw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/7879-quality-assurance-qa-analyst",
    "title": "Quality Assurance (QA) Analyst",
    "content": "Quality Assurance (QA) Analyst - Jobmote<div><div><h2>Quality Assurance (QA) Analyst</h2><h5>Modern Tribe</h5></div></div><div><div><div><div><div><h3>The Opportunity</h3><p>Modern Tribe’s QA team works on a lot of cool projects: over the past year alone, we’ve tested sites built by our dev team for big-name clients including&nbsp;<a href='http://columbialawreview.org/' rel='nofollow'>Columbia Law School</a>,&nbsp;<a href='http://www.foodinnovationgroup.com/' rel='nofollow'>Bon Appetit Magazine</a>,&nbsp;<a href='https://www.eventbrite.com/blog/academy/' rel='nofollow'>Eventbright Academy Blog</a>,&nbsp;<a href='http://hls.harvard.edu/' rel='nofollow'>Harvard Law School</a>&nbsp;and&nbsp;<a href='https://www.whatshouldwedo.com/' rel='nofollow'>What Should We Do (WSWD)</a>. (Want to see how we did? The links above highlight some of our work). And that’s not even including our family of WordPress plugins led by&nbsp;<a href='http://theeventscalendar.com/' rel='nofollow'>The Events Calendar</a>.</p><p>We’ve got a slew of cool projects we are working on in 2017, and need another member for our QA team. If working on high-profile sites for large clients gets you excited and a serious case of attention to detail is your jam, we should talk.</p><h3>Responsibilities</h3><p>QA is responsible for ensuring all aspects of quality at Modern Tribe. It’s a tall order for sure: learning how a site works, creating test plans covering obscure use cases, and then putting it all into practice when testing every aspect of site functionality…it’s a lot of ground to cover. But we’ve got an established workflow down that helps make sure we’re setting the team up with the tools they need to proceed and succeed.</p><p>Though every project is different, here’s the gist of our QA flow:</p><ul><li><strong>KICKOFF MEETING.&nbsp;</strong> Just a kickoff — meet the PM; get your questions answered; set expectations; and schedule milestones.</li><li><strong>PREPARING DOCS.&nbsp;</strong> Getting started with internal documentation early is hugely important to getting the project into your brain.</li><li><strong>REVIEW APPROVED COMPS.</strong> &nbsp;Before you start QA or even get a walkthrough, you’ll review the comps to understand the project + prepare a list of questions to ask on the QA walkthrough.</li><li><strong>QA WALKTHROUGH.</strong> &nbsp;Once development is far enough along for QA to begin, you’ll do a walkthrough with the lead developer to get an overview of the functionality.</li><li><strong>PREPARE QA CHECKLIST + TEST PLAN.</strong> &nbsp;After seeing each component of the site in action, you’ll put together a first draft at a comprehensive QA checklist and a higher-level overview of what you’re planning to test, in what order, and when.</li><li><strong>HEAVY DUTY TESTING.</strong> &nbsp;You’ll put the site through its paces and give it a few rounds of full pass bug hunting. Beyond just hitting buttons, you’ll be thinking from a higher level: are there usability concerns? Does what we’re doing here actually make sense as the best way to solve the problem? etc.</li><li><p><strong>CELEBRATING A SUCCESSFUL LAUNCH.</strong> &nbsp;What feels better than kicking back after a successful launch? If QA has done their job, the project will launch smoothly, the team will have a finished product to show off, and — most importantly — the client will be happy. It doesn’t get much better than that.</p></li><li><p>Our QA team also generally leads client training and prepares training documentation/videos when appropriate, so be prepared for some direct client communication.</p></li></ul><h4>Personal Competencies</h4><ul><li>Extremely outgoing and friendly attitude</li><li>Strong communication skills</li><li>Experience working as part of a remote team</li><li>Self-motivated, detail-oriented</li><li>Strong organizational skills</li><li>A methodical approach to all tasks</li><li>Ability to prioritize workloads and meet deadlines</li><li>Fluent English speaker</li></ul><h4>Knowledge and Experience</h4><ul><li>Has a proven track record in Quality Assurance.</li><li>Pays meticulous attention to detail + fights for the customer. Being able to catch bugs is huge, but it isn’t everything — QA is most effective when it puts itself in the customer or end user’s shoes.</li><li>Knows WordPress well, you’ll be expected to prove your familiarity with the platform.</li><li>Excellent verbal, non-verbal and written communication skills</li><li>Has 1+ year remote freelancing experience.</li></ul><h4>Bonus Points</h4><ul><li>Familiarity setting up local WordPress environments + cloning GIT repositories locally</li><li>Skills at training others how to admin complex WordPress sites/projects</li><li>Experience writing and implementing automated testing processes</li></ul><h3>Who We Are</h3><p>Modern Tribe, Inc. is a rapidly growing software &amp; design company. We develop custom solutions for some of the world’s largest companies, government institutions and smaller growing organizations. We pride ourselves on our ability to bridge people and technology and to bring the passion and dedication of an entrepreneur to every project. Our team is composed of talented employees and freelancers around North &amp; South America (and a smattering across the globe).</p><h3>Who You Are</h3><p>We love working with each other because we have built a culture that suits us well. We work primarily with freelancers and coordinate their talents for large projects. To be on our team, you must be:</p><ul><li><strong>HAPPY</strong> &nbsp;Where there is a will, there is a way. Having a positive disposition allows us to achieve great things and to support each other.</li><li><strong>HELPFUL&nbsp;</strong> Always looking for ways that you can help others.</li><li><strong>CURIOUS</strong> &nbsp;It is essential that you have a passion for learning. Technology changes daily, and life has a way of constantly raising the bar.</li><li><strong>ACCOUNTABLE</strong> &nbsp;Our clients expect us to get the right thing done on budget and on time. Communicating expectations and meeting them is the cornerstone of success.</li><li><strong>A FREELANCER</strong> &nbsp;This means that if you live within the USA, you will also maintain your own personal client list and that Modern Tribe will only comprise a portion of your total income. Regardless of where you live, you need to be already freelancing.</li></ul><h4>Location</h4><p>Work from anywhere in the&nbsp;US or Canada; if you are in&nbsp;Central or South America, let’s talk. This will be a 100% remote position.&nbsp;&nbsp;If your working hours are in a timezone outside of the US range, but you work 4+ hours of overlap each day our team might be able to consider your application.</p><h4>Compensation</h4><p>Our hourly rate for this gig starts at&nbsp;$25-$35/hr, depending on experience, with opportunities for rate bumps on annual review. This gig is about 8 hours per week of work to start and ramping up to about 15 -20 hours over the next 2 -3 months. This is a one time contract position, though we are always seeking longer relationships with kick-ass people.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Nov 3, 2017 11:00:37 PM",
    "tags": [
      "TZ_America",
      "REMOTE1_100",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "FGq2UypdTaix1AmrpZ5uvA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5667-quality-assurance-qa-analyst",
    "title": "Modern Tribe: Quality Assurance (QA) Analyst",
    "content": "<div>  <div>    <h2>     Quality Assurance (QA) Analyst</h2>      <h4>Posted Nov  3</h4>    <h3>      <span>Modern Tribe</span><br>      <span>Headquarters: Remote</span><br>        <a href='http://m.tri.be/19sb' rel='nofollow'>http://m.tri.be/19sb</a>    </h3>  </div>    </div>  <div>    <div><h3>The Opportunity</h3></div><div><span></span></div><div>Modern Tribe’s QA team works on a lot of cool projects: over the past year alone, we’ve tested sites built by our dev team for big-name clients including&nbsp;<a href='http://columbialawreview.org/' rel='nofollow'>Columbia Law School</a>,&nbsp;<a href='http://www.foodinnovationgroup.com/' rel='nofollow'>Bon Appetit Magazine</a>,&nbsp;<a href='https://www.eventbrite.com/blog/academy/' rel='nofollow'>Eventbright Academy Blog</a>,&nbsp;<a href='http://hls.harvard.edu/' rel='nofollow'>Harvard Law School</a>&nbsp;and&nbsp;<a href='https://www.whatshouldwedo.com/' rel='nofollow'>What Should We Do (WSWD)</a>. (Want to see how we did? The links above highlight some of our work). And that’s not even including our family of WordPress plugins led by&nbsp;<a href='http://theeventscalendar.com/' rel='nofollow'>The Events Calendar</a>.</div><div><br></div><div>We’ve got a slew of cool projects we are working on in 2017, and need another member for our QA team. If working on high-profile sites for large clients gets you excited and a serious case of attention to detail is your jam, we should talk.</div><div><br></div><div><h3>Responsibilities</h3></div><div><span></span></div><div>QA is responsible for ensuring all aspects of quality at Modern Tribe. It’s a tall order for sure: learning how a site works, creating test plans covering obscure use cases, and then putting it all into practice when testing every aspect of site functionality…it’s a lot of ground to cover. But we’ve got an established workflow down that helps make sure we’re setting the team up with the tools they need to proceed and succeed.</div><div><br></div><div>Though every project is different, here’s the gist of our QA flow:</div><div><br></div><ul><li><span><b>KICKOFF MEETING.&nbsp;</b></span>Just a kickoff — meet the PM; get your questions answered; set expectations; and schedule milestones.</li><li><span><b>PREPARING DOCS.&nbsp;</b></span>Getting started with internal documentation early is hugely important to getting the project into your brain.</li><li><b>REVIEW APPROVED COMPS.</b>&nbsp;Before you start QA or even get a walkthrough, you’ll review the comps to understand the project + prepare a list of questions to ask on the QA walkthrough.</li><li><b>QA WALKTHROUGH.</b>&nbsp;Once development is far enough along for QA to begin, you’ll do a walkthrough with the lead developer to get an overview of the functionality.</li><li><b>PREPARE QA CHECKLIST + TEST PLAN.</b>&nbsp;After seeing each component of the site in action, you’ll put together a first draft at a comprehensive QA checklist and a higher-level overview of what you’re planning to test, in what order, and when.</li><li><b>HEAVY DUTY TESTING.</b>&nbsp;You’ll put the site through its paces and give it a few rounds of full pass bug hunting. Beyond just hitting buttons, you’ll be thinking from a higher level: are there usability concerns? Does what we’re doing here actually make sense as the best way to solve the problem? etc.</li><li><b>CELEBRATING A SUCCESSFUL LAUNCH.</b>&nbsp;What feels better than kicking back after a successful launch? If QA has done their job, the project will launch smoothly, the team will have a finished product to show off, and — most importantly — the client will be happy. It doesn’t get much better than that.</li></ul><div>* Our QA team also generally leads client training and prepares training documentation/videos when appropriate, so be prepared for some direct client communication.</div><div><br></div><div><h4>Personal Competencies</h4></div><ul><li>Extremely outgoing and friendly attitude</li><li>Strong communication skills</li><li>Experience working as part of a remote team</li><li>Self-motivated, detail-oriented</li><li>Strong organizational skills</li><li>A methodical approach to all tasks</li><li>Ability to prioritize workloads and meet deadlines</li><li>Fluent English speaker</li></ul><div><h4>Knowledge and Experience</h4></div><ul><li>Has a proven track record in Quality Assurance.</li><li>Pays meticulous attention to detail + fights for the customer. Being able to catch bugs is huge, but it isn’t everything — QA is most effective when it puts itself in the customer or end user’s shoes.</li><li>Knows WordPress well, you’ll be expected to prove your familiarity with the platform.</li><li>Excellent verbal, non-verbal and written communication skills</li><li>Has 1+ year remote freelancing experience.</li></ul><div><h4>Bonus Points</h4></div><ul><li>Familiarity setting up local WordPress environments + cloning GIT repositories locally</li><li>Skills at training others how to admin complex WordPress sites/projects</li><li>Experience writing and implementing automated testing processes</li></ul><div><br></div><div><h3>Who We Are</h3></div><div><span></span></div><div><span>Modern Tribe, Inc</span>. is a rapidly growing software &amp; design company. We develop custom solutions for some of the world’s largest companies, government institutions and smaller growing organizations. We pride ourselves on our ability to bridge people and technology and to bring the passion and dedication of an entrepreneur to every project. Our team is composed of talented employees and freelancers around North &amp; South America (and a smattering across the globe).</div><div><h3>Who You Are</h3></div><div><span></span></div><div>We love working with each other because we have built a culture that suits us well. We work primarily with freelancers and coordinate their talents for large projects. To be on our team, you must be:</div><div><br></div><ul><li><b>HAPPY</b>&nbsp;Where there is a will, there is a way. Having a positive disposition allows us to achieve great things and to support each other.</li><li><span><b>HELPFUL&nbsp;</b></span>Always looking for ways that you can help others.</li><li><b>CURIOUS</b>&nbsp;It is essential that you have a passion for learning. Technology changes daily, and life has a way of constantly raising the bar.</li><li><b>ACCOUNTABLE</b>&nbsp;Our clients expect us to get the right thing done on budget and on time. Communicating expectations and meeting them is the cornerstone of success.</li><li><b>A FREELANCER</b>&nbsp;This means that if you live within the USA, you will also maintain your own personal client list and that Modern Tribe will only comprise a portion of your total income. Regardless of where you live, you need to be already freelancing.</li></ul><div><span><br></span></div><div><h4>Location</h4></div><div>Work from anywhere in the&nbsp;<span>US or Canada</span>; if you are in&nbsp;<span>Central or South America</span>, let’s talk. This will be a 100% remote position.&nbsp;<span>&nbsp;</span><span>If your working hours are in a timezone outside of the US range, but you work 4+ hours of overlap each day our team might be able to consider your application.</span></div><div><br></div><div><h4>Compensation</h4></div><div>Our hourly rate for this gig starts at&nbsp;<span>$25-$35/hr</span>, depending on experience, with opportunities for rate bumps on annual review. This gig is about 8 hours per week of work to start and ramping up to about 15 -20 hours over the next 2 -3 months. This is a one time contract position, though we are always seeking longer relationships with kick-ass people.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply on our site: <a href='http://m.tri.be/19sb' rel='nofollow'>http://m.tri.be/19sb</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 3, 2017 10:25:50 PM",
    "tags": [
      "TZ_America",
      "REMOTE1_100",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "POMZmDgrQciepzKMuKdFag",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Test+Automation+Architect&c=Crossover&l=Remote&jk=82bfe8f6854a8879&rtk=1bu3ept3l0k3a50o&from=rss",
    "title": "Test Automation Architect - Crossover - Remote",
    "content": "<div><b>Test Automation Architect</b><br><span>Crossover</span> -<span>Remote</span><div><span>$60,000 a year - </span><span>Contract</span></div></div><span>Are you an expert in Test Automation? Do you pride yourself in being 10 times more productive than the typical test architect? Are you interested in earning $60K USD, living anywhere in the world, while working for a leading technology company? If you are eager to join a network of the most talented remote workers in the world, than this role is for you.<br><br><b>Company Description:</b>Aureais partnering withCrossoverto fill this position. Crossover specializes in finding and managing the talent in today’s global workforce and will help you through the recruiting process.<br><br>Aureaenables global enterprises to create transformative experiences for their end customers across a range of industries including retail, travel &amp; hospitality, insurance, energy, life sciences, and insurance. Aurea products enable companies to build, execute, monitor, and optimize the end-to-end customer journey across multiple channels and touchpoints to accelerate growth through an excellent customer experience. Aurea serves over 2,000 customers worldwide.<br><br><b>Job Description:</b>We are seeking a technical guru who thrives in solving complex problems for customers with high expectations. The position is a great fit for someone who takes a truly hands-on approach to product development, design and engineering. It's a great opportunity to secure a high-impact technical lead role in a rapidly-growing global software company that is expanding both organically and through acquisitions. The opportunity to grow and address new challenges is infinite, as the acquisition of several new products and customer bases every year creates interesting learning opportunities for motivated professionals who strive to craft value in their work and grow personally.<br><br>We offer a fast-paced environment where you will play a dynamic technical leadership role. You will be responsible for developing test automation solutions to complex systems, establishing and implementing automated testing strategies and being a hands-on peer leader of top development resources. As the owner of the technical solution, you will understand the current large enterprise product automation frameworks and identify the opportunities for optimization and improvements such as multi-threading. Contributions to the team involve resolving challenging issues with complex automation tasks/requirements. You will work with existing SMEs to understand their expertise developed over the years and become the go-to person for the teams.<br><br><b>Key Responsibilities:</b><ul><li>Responsible for automation infrastructure that will integrate development activities with tools for metric collection and reporting<br><br></li><li>Set definitions and guidelines for subsystem, integration, regression and exploratory tests.<br><br></li><li>You will be developing expertise in our Test Automation design and implementation.<br><br></li><li>Bringing to bear your broad technology capabilities and maintaining a level of excitement in using various technologies to architect, develop, and iteratively deploy Test Automation.<br><br></li><li>Obtaining an expert level understanding of our current product environments and the use of our products.<br><br></li><li>Maintaining an excellent understanding of our current automation frameworks and bringing continuous improvements.<br><br></li><li>Solving day-to-day issues/challenges faced by the large automation teams and becoming a go-to person for any automation help.<br><br></li><li>Monitoring overall test execution and deep dive into the failures and work with the teams to get them fixed.<br><br></li><li>Creating solution architecture for new automation frameworks as required.<br><br></li><li>Personally accountable for resolution of the most technically challenging issues<br><br></li><li>Ensuring our customers are supremely confident in the advantages and quality of our product and solution, and the technical services you lead to deliver them.<br><br></li></ul><b>Required Education and Experience:</b><ul><li>A successful Full Stack Architect with Test Automation at Crossover will demonstrate the following qualifications:<br><br></li><li>Bachelor’s degree from a top university in Computer Science, Computer Engineering.<br><br></li><li>At least 8 years of experience in hands-on implementation and execution of automated test strategies within various technical and functional contexts.<br><br></li><li>Experience developing automated UI and API test case framework.<br><br></li><li>Experience with Java, Python, AWS, Unix, Linux<br><br></li><li>Expertise industry standard frameworks and tools such Java Robot Framework/ Selenium/Cucumber/etc.<br><br></li><li>Expertise in defining testing automation strategies for enterprise solutions.<br><br></li><li>Experience in leading teams<br><br></li><li>Excellent understanding of current enterprise software technologies and development practices/tools, including virtual environments, source control, remote development, issue tracking, build and test automation, and networking management<br><br></li></ul><b>You might be a great fit if:</b><ul><li>You are able to engage sophisticated global customers in deep technical discussions, making them confident that you know their problem better than they do<br><br></li><li>You have a true “roll up the sleeves and get it done” working approach; demonstrated success as a problem solver, operating with end results in mind, self-starter<br><br></li><li>You are comfortable “working virtually” with teammates and customers around the world<br><br></li></ul>Pay:$30/hror$60K/year<br><br>Commitment:40hours/week<br><br>Location:Global(remote)<br><br>We’re one of the few legitimate companies offering high-paying jobs that are 100% remote, work from home. You never have to fight traffic to the office again and you have the freedom to choose when and where you put in your 40 hours to be most effective each week.<br><br>However, it is important to note that while you will work as a &quot;contractor,&quot; these are long-term contracts that should be your only source of employment. You are not permitted to work additional jobs on the side. Please do not apply unless you are available to make this position your sole employment.<br><br>Toqualify, please provide a resume/CV demonstrating the required experience and skills. From there, to help us find the top 1% of talent, there will be a series of interviews and online skills examinations. We realize these are challenging and can require a decent amount of time - so we thank you in advance for your efforts.</span>",
    "urlFetchPending": false,
    "published": "Nov 1, 2017 7:18:19 PM",
    "tags": [
      "REMOTE1_100",
      "TZ_unknown",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "4l17SXZQRGKwCkmtp3EwIg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/62895/senior-automation-engineers-at-spotqa/",
    "title": "Senior Automation Engineers",
    "content": "About you<br /><br />If you care about software quality but find testing and QA tedious, maybe you are curious whether there might be a better way.<br />Do you love bridging skill-gaps and enabling others to do more and achieve more? We would like to hear from you.<br /><br />About us<br /><br />We are SpotQA's Product Team, building the next generation of testing automation software.<br />We are building the self-driving car technology for the testing world.<br />Our objective? To develop new technology that uses machine-learning and domain expertise with the aim of performing testing fully autonomously<br />To help with our mission, we are looking for a Senior Automation Architect to join our team. Ideally, the following responsibilities should resonate with you:<br />Lead the design, development and creation of internal/external tools to help people do more and achieve more.<br />Ensure automated testing frameworks are designed, built, and structured to support testing automation. Publish test methodologies and package test frameworks for customers to follow and use for testing their applications.<br />Drive team adoption of latest testing standards, tools and frameworks within software development cycles.<br />Function as Thought Leader for automated testing expertise.<br /><br />REQUIREMENTS<br /><br />Most importantly, we are looking for can-do attitudes, with a passion to help others and delving into challenging problems.<br /><br />We also have our eyes on a few skills, namely the following:<br /><br />Can quickly get your hands dirty for scripting and becoming a Principal Engineer whenever necessary to solve problems.<br />8-10 years of experience developing quality automation solutions in a technology firm.<br />Comfortable with a wide range of software technologies: Java, Popular IDEs (IntelliJ/Eclipse), Build Systems (Maven, Gradle).<br />Proven experience with full-stack testing – unit testing, API & UI testing, non-functional testing.<br />Hands on experience with multiple test automation tools – JUnit, Selenium, Jmeter.<br />Expert in planning, tracking and monitoring the projects.<br />Exceptional reporting skills and ability to give flawless demonstrations to customers and colleagues.<br />Significant expertise leading cross functional global projects and initiatives.<br />Ability to work effectively with remote teams across geographical boundaries in a fast paced, diverse, agile environment.<br />Ability to work effectively with diverse stakeholders including other technical leads, Product Owners, and executive management.<br /><br />BENEFITS<br /><br />Competitive Salary.<br />Possibility of working remotely is available.<br />Personal development by working with a fast growing multinational startup aiming to shape the future of Digital QA.",
    "urlFetchPending": false,
    "published": "Oct 27, 2017 8:03:03 AM",
    "tags": [
      "REMOTE1_50",
      "TZ_unknown",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "YSzwG6PSQPyu4qwI5Dk4OA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/jobs/5617-qa-lead-engineer-nearshore",
    "title": "Learning Tapestry: QA Lead Engineer - Nearshore - Remote",
    "content": "<div>  <div>    <h2>QA Lead Engineer - Nearshore - Remote</h2>      <h4>Posted Oct 26</h4>    <h3>      <span>Learning Tapestry</span><br>      <span>Headquarters: Berkeley, CA</span><br>        <a href='https://jobs.enlist.io/learning_tapestry/jobs/7e96e9c0-f7b1-449c-bfa8-6bf774f368b3' rel='nofollow'>https://jobs.enlist.io/learning_tapestry/jobs/7e96e9c0-f7b1-449c-bfa8-6bf774f368b3</a>    </h3>  </div></div>  <div>    <div><h4><b>About Learning Tapestry</b></h4></div><div>Hi! We're Learning Tapestry. We're a 35+ person all-remote, global organization dedicated to making digital learning &quot;just work&quot; for educators and learners alike. We solve hard problems in complex education technology environments. We’re a triple bottom line company: we make a profit like any good business; our work makes the world better (“social impact”); and we create a healthy internal work environment for everyone who works here. For our staff we believe in flexible work locations and working arrangements.&nbsp;We empower all of our team members to manage their schedules and adjust as necessary. We're focused on results and impact, not locations and hours. We hire people with great technical ability, but we also expect everyone at Learning Tapestry to have a strong character and solid communication skills.</div><div><br></div><div><h4><b>What We're Looking For</b></h4></div><div>Our client list is growing quickly, so we're looking for a Quality Assurance Lead Engineer to help us deliver exceptional solutions for our clients, and to help us build a strong QA practice (and team, in the near future). The position is full-time and remote. To minimize timezone challenges, you should be available for working for at least 4 hours of your time every day with US/Eastern time zone business hours (8am - 6pm).</div><div><br></div><div><h4><b>About You</b></h4></div><ul><li>You’ve got 5+ years as a QA engineer/analyst with increasing levels of responsibility throughout your career. You’ve worked on a wide variety of projects, from new development to taking over maintenance of an existing test suite.</li><li>You’re comfortable in a remote work environment, with team members from different time zones. You can manage your own time and are a self-starter.</li><li>You are experienced and fluent in the productivity tools we use, like Google Apps &amp; Hangouts, Slack, and Harvest for time tracking.</li><li>You’re comfortable hiring, leading and managing a team of QA engineers. We have a couple of contracted QA people on staff now, and that could grow.</li><li>You have experience developing and writing test plans for large software development initiatives, and working with clients to verify signoff of delivered functionality.</li><li>You’ve got demonstrable experience developing new tests and maintaining test suites in Ruby (with rspec, minitest, capybara, or similar), mobile (iOS, Android or React Native), javascript (mocha, chai, jest, etc) or .NET. In an ideal case you’ve got experience with more than one of these.</li><li>You’ve developed and executed cross-browser testing, using Browserstack, Sauce Labs, or similar.</li><li>You’re comfortable with git for version control, and have used Github for reviewing pull requests.</li></ul><div><br></div><div><h4><b>Bonus Skills</b></h4></div><div></div><div></div><ul><li>You’re an especially strong candidate if you have experience writing tests for automated test frameworks like Selenium or appium, and integrating a test suite with Continuous Integration tools, and software development lifecycles using Github or Bitbucket.</li><li>You’ve used several issue trackers in your career, like Github issues, Asana, Jira, or Redmine and you have strong opinions about which you prefer, and why.</li></ul><div><span><br></span></div><div><span>Please do not hesitate to apply if you do not match these requirements exactly but think you could be a good fit.</span><br></div><div></div><div></div><div></div><div><span><br></span></div><div><h4><b>Equal Opportunity</b></h4></div><div>Learning Tapestry is an equal opportunity employer and encourages individuals of all ethnic and racial backgrounds, sexual orientations, and gender identities to apply. We are also particularly interested in individuals who have lived in or worked with underserved communities such as low-income, gender nonconforming, disabled, or indigenous peoples.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Fill out the online application here:  <a href='https://jobs.enlist.io/learning_tapestry/jobs/7e96e9c0-f7b1-449c-bfa8-6bf774f368b3' rel='nofollow'>https://jobs.enlist.io/learning_tapestry/jobs/7e96e9c0-f7b1-449c-bfa8-6bf774f368b3</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 26, 2017 5:19:37 PM",
    "tags": [
      "REMOTE1_50",
      "TZ_America_East",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "50% remote",
      "US East timezone"
    ],
    "tagsNames2": []
  },
  {
    "id": "T_OsXXaGQEicUSKO_slz_Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-testers",
    "url": "http://workinstartups.com/job-board/job/62868/qa-engineer-at-twickets/",
    "title": "QA Engineer",
    "content": "QA Engineer<br />Location : Central London<br /><br />Who are we<br /><br />Twickets was created by music fan, Richard Davies, who made the simple observation that real<br />fans don’t want to rip other fans off. When we have tickets we can no longer use, most of us<br />don’t want to sell them for a profit. We just don’t want them to go to waste and are really happy<br />if we can get our money back. So Richard set up Twickets as a service on Twitter, connecting<br />fans and allowing them to trade with each other at strictly no more than face value.<br />Today, Twickets is the largest fan-to-fan marketplace for face value tickets and connects fans<br />via both website and app (iOS and Android) across three continents. Thousands of tickets are<br />listed every month for gigs, festivals, sports, comedy, theatre and the arts.<br />We are growing rapidly, and have attracted support from the industry through our event<br />partners, investors and the media. Our platform and technologies are constantly evolving as we<br />strive to innovate and expand into new territories.<br />We allow ticket resale both on a private basis and through integrations with artists, promoters,<br />ticket agencies, sporting organisations and venues.<br /><br />Our Tech<br /><br />Our backend platform is a Java stack, using Spring, CXF, Thrift, Cassandra, RabbitMQ and<br />Postgresql, all running on AWS. We deliver everything through web services (REST/JSON) to<br />the frontend system.<br />Frontends are written in Bootstrap / AngularJS (the main web site), Android & iOS and for<br />internally facing web applications, Vaadin framework.<br /><br />The Role<br /><br />We are looking for keen, self motivated individual to join our development team at Twickets as a<br />QA. Our product is a web application, its written in Angular.JS (front end) and Java (backend)<br />and native mobile apps for the two main mobile platforms. We currently do a combination of<br />testing by hand and automated testing. Each feature is developed and tested in isolation thenretested at the end of the sprint. You will work closely with the product owner throughout to<br />make sure that you know the stories being developed and help define acceptance criteria, you<br />will then test each story as soon as is has come out of code review, and complete final product<br />testing once all stories in the sprint are complete.<br />When not actively testing new features, you will be working on improving and extending our<br />automated test suite, implementing new types of test, all helping assure quality of our product.<br />Essential skills<br /><br />You should be a good communicator, a team player and always improving your own skills and<br />those of others around you. You need to be able to quickly get up to speed with technical<br />concepts. You should also be strong in the following skills:<br /><br />- Management of the testing process<br />- Functional Testing<br />- Exploratory Testing<br />- Agile Process<br />- Continuous Integration<br />- Version control systems, Git<br />- HTML/CSS/Javascript<br />- SQL Databases<br />Other skills and qualifications<br />A good degree or similar from a well regarded university or commensurate industry experience<br />would be beneficial. Also, experience with:<br />- Integration testing<br />- Testing mobile applications<br />- Testing Automation frameworks (selenium, protractor)<br /><br />The Benefits<br /><br />● You will be enrolled onto a workplace pension scheme<br />● Central London offices just off Oxford Street<br />● Free Kitchen with breakfast, fruit, beer fridge and refreshments<br />● Gig / event tickets<br />● Opportunity for remote working",
    "urlFetchPending": false,
    "published": "Oct 26, 2017 12:12:23 PM",
    "tags": [
      "TZ_Europe",
      "REMOTE1_100",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote",
      "Europe timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "_KWkZOdnTT2k1h_ohqtsOg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3912-test-automation-engineer-superawesome",
    "title": "Test Automation Engineer @ SuperAwesome",
    "content": "<h2>              Test Automation Engineer<small> @ SuperAwesome</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-06 04:00</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>DESCRIPTION</strong></p><p>SuperAwesome (@GoSuperAwesome) is the largest kids digital media platform in the world, reaching over a quarter of a billion kids each month across mobile, web and online video. SuperAwesome’s technology and products power kid-safe advertising, parent-portals and COPPA compliance for hundreds of brands and agencies around the world. Recently named in London’s future 50 (<a href='http://futurefifty.com/2017-cohort/' rel='nofollow'>http://futurefifty.com/2017-cohort/</a>), we continue to grow at a fast pace with some of the biggest clients on the planet including Lego, Warner Bros, Hasbro, Spin Master, Nintendo and many others.</p><p>We are looking for various developer roles across the company, one of which is to help us build out a world class test automation suite that allows us to move our products from development to production in the most streamlined and robust way possible.</p><p>The role would see you own the set-up, development and deployment of our automated testing suite, giving you the full freedom and flexibility to use the tools and languages of your choosing. This is a big challenge that allows you to use and experiment with many cutting-edge technologies, helping us to continue iterating on our production environment at scale.</p><p><strong>Key Responsibilities</strong></p><ul><li>Take full ownership of our testing set-up, framework and environment<ul><li>Identify test requirements and design coverage plans.</li><li>Develop, document and maintain functional test cases and other test artifacts like test data, data validation and automated scripts.</li><li>Evaluate automated test cases and report results in ways that are easily digestible to the rest of the team</li><li>Enable the team to scale their testing, without becoming a bottleneck yourself</li></ul></li><li>Ensure all testing products are built to an appropriate level of quality for the stage (alpha/beta/production)</li><li>Deliver products using the appropriate agile project management methodology, learning &amp; iterating frequently</li><li>Work with our Head of Engineering to define the right approach and priorities to improve our testing</li></ul><p><strong>REQUIREMENTS</strong></p><ul><li>A few years of experience developing and/or testing large and complex web applications<ul><li>Experience with NodeJS would be a plus</li></ul></li><li>Comfortable both on the front and the back-end of web applications<ul><li>Experience with AngularJS would be a plus</li></ul></li><li>A passion for building and using testing frameworks at scale</li></ul><p><strong>Qualities</strong></p><ul><li>You get stuff done.</li><li>You’re a fire-starter, you can clearly demonstrate your ability to be proactive without direct supervision</li><li>You like working in an agile development environment</li><li>Flexible and adaptable, to changing situations and responsibilities</li></ul><p><strong>BENEFITS</strong></p><ul><li>Ownership: we trust you to get sh*t done</li><li>Live &amp; learn on the cutting-edge: we want to use the best tools for the job, you won't be stuck using older frameworks</li><li>Never sit still: Yearly swarm weeks at remote locations with the whole team (Portugal is next), Hackdays every quarter and constant innovation across the company lead to real innovation</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 6, 2017 7:00:51 AM",
    "tags": [
      "REMOTE1_100",
      "TZ_unknown",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "x-NnDhqdRi-jo0RyefDUrQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-sysadmin",
    "url": "https://weworkremotely.com/jobs/5469-intermediate-senior-software-qa-engineer",
    "title": "Daily Kos: Intermediate/Senior Software QA Engineer",
    "content": "<div>  <div>    <h2>Intermediate/Senior Software QA Engineer</h2>      <h4>Posted Oct  3</h4>    <h3>      <span>Daily Kos</span><br>      <span>Headquarters: Oakland, CA</span><br>        <a href='https://www.dailykos.com/jobs/intermediatesenior-software-qa-engineer' rel='nofollow'>https://www.dailykos.com/jobs/intermediatesenior-software-qa-engineer</a>    </h3>  </div>    </div>  <div>    <div>  </div><div>DailyKos, the leading online progressive blogging and activism platform, is looking for an Intermediate/Senior Software QA Engineer.</div><div><br></div><div></div><div>DailyKos is a great place to work-- your code will be used by hundreds of thousands of people a day who care deeply about progressive politics and are working to effect real political change. We provide an extensive feature set that extends from blogging to activism and beyond. If you want a job that provides more than just a technical challenge, we'd love to hear from you.</div><div><br></div><div></div><div>The job offers a flexible work environment, the ability to work remotely (<b>U.S. only,</b> please) on a distributed team of self-sufficient collaborators, competitive salary and benefits, and we provide an Apple MacBook Pro or your preferred comparable hardware. Our organization’s commitment to personal growth reduces churn and encourages a very rewarding long term position. We have an energized team filled with great people with different backgrounds.</div><div><br></div><div></div><div>We are seeking an experienced QA lead to shape the QA function at Daily Kos. Currently most QA at Daily Kos is done manually and the responsibility is spread across a few people on staff who also have other roles. This QA Engineer will be the first dedicated hire for QA and will have a significant role in shaping the department as we expand our development team and build out more capacity for automated testing. Applicants should be self-sufficient and comfortable working independently. In addition we are looking for someone who:</div><div><br></div><div></div><ul><li>can clearly and precisely document bugs and the steps to reproduce them</li><li>can write and follow detailed test plans for new features</li><li>can use the JavaScript console, debugger, and other browser developer tools</li><li>can write and run raw SQL queries in MySQL or PostgreSQL; knowledge of other data storage a plus</li><li>can read Ruby and JavaScript code&nbsp;</li><li>has awareness of typical programming errors and the unexpected things users do whether accidentally or maliciously</li><li>has exposure to performance and security testing</li><li>has exposure to front-end automated testing tools</li><li>can summon a maddeningly creative approach to breaking things and other chaos monkey skills</li><li>enjoys using the Daily Kos application in general</li><li>will advocate for our users both internally and externally to ensure they have the reliable tools that they need and do what they need and expect</li></ul><div>At Daily Kos, we believe that the diversity of ideas, experiences and cultures that our employees contribute to our organization help us be more effective in our work, and we are proud to be an inclusive and equal-opportunity workplace. We're a company that loves learning and supports growth and training for all our employees.</div><div><br></div><div></div><div></div><div><br></div><div></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>To apply, please send an email to <a href='mailto:tech_jobs@dailykos.com' rel='nofollow'>tech_jobs@dailykos.com</a> with the name of the position in the subject line, a cover letter, code sample or github repo and your resume (include your LinkedIn profile link).</p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 3, 2017 10:17:24 PM",
    "tags": [
      "REMOTE1_100",
      "TZ_unknown",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "iJ_gad_PSYGbF5Ortbfg6Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-1",
    "url": "http://www.indeed.co.uk/viewjob?t=Test+Engineer&c=Infuse+Consulting&l=London&jk=3e2ad7d8dea7780f&rtk=1bu5jdnku17n74jt&from=rss",
    "title": "Test Engineer - Infuse Consulting Ltd - London",
    "content": "<div><b>Test Engineer</b><br><span>Infuse Consulting Ltd</span> -<span>London</span><div><span>£40,000 - £60,000 a year</span></div></div><span>Infuse is a consulting business that helps organisations get the most out of their software. We specialise in delivering modern software testing by providing global clients with pioneering software testing, transformation consulting, and environments management. We have positioned ourselves as a market leader in this ever-evolving niche by establishing long lasting relationships.<br>If you join Infuse, you will get the opportunity to mix technology, cognitive ability, technical innovation, and objectivity with experienced colleagues, be given the opportunity to solve business problems and quickly realise business value for our clients.<br>Infuse consultants have the opportunity to work on a variety of projects, travel the world, and make an impact each with their own unique alchemy of people, process, and technology. We aim to make you the best you can be. We have a great relationship with the Infuse alumni many of whom are leading industry experts and great references.<br>Infuse is headquartered in the heart of London, we also have operations in Pune, India as well as delivery capability in Portugal.<br>See our growing list of case studies on http://infuse.it/case-studies/<br>Infuse has also been recognised by CIO Magazine in 2015; (most promising Micro Focus and Oracle solution providers) and Bronze Partner of the Year Award for 2015-16 by the UK Oracle User Group.<br>About the Project<br>Infuse has won numerous new projects over the last 12 months, and needs to expand its delivery capability with Test Architects, Technical Test Consultants and Test Engineers.<br>Our projects range from engineering automated regression testing systems for global clearing houses, global healthcare trusts, Russell Group universities, leading telco providers, local /central government, healthcare providers, retailers, finance companies, banks, leading system integrators and Fintech companies.<br>Based on the client site and requirements, you will typically be working in a mixed consultancy team of 3-10 people across multiple projects and programmes.<br>The technologies will range from Mainframe to the New Style of IT (Digital, Mobile, DevOps) and projects will last between 3 months and 2 years.<br>You will also work with stakeholders including project/programme managers, BAs, Operations, Business Users and Developers in advising, engineering, and presenting complex technical solutions based on enterprise and open source technology.<br>You will be required to travel and be fully compensated for time away from the main office.<br><br>Depending on your experience, your focus will be on the following activities<br>Leveraging automated test tools to<br>build test automation scriptsupdate automated test frameworkscode automated test componentsbuild and debug automated testsmaintain and update automated testscreate, read, update and delete data for automated testswriting handover documentationfacilitating knowledge transfer to colleagues and/or end clients personnelupdating and maintaining knowledge repositories so other colleagues can learn from your projects and achievementsIn addition, you will be given the opportunity to put together presentations, white papers and lunch and learn webinars for your colleagues and peers which the business may promote from time to time.<br>You’ll need to support wider testing initiatives, such as manual testing, but also support other areas where a strong coding background is required.<br>You will provide extensive hands on test experience within bi-modal delivery (Agile and Waterfall).<br>You will take a pro-active approach in managing test dependencies, coordinating test coverage and execution.<br>You will assist in defining and advising on test scope, approach, risks and assumptions across project delivery.<br><br><b>Requirements:</b><br>Essential skills<br><br>Proven knowledge and experience of working with one or more of the following technologies:<br><b>Test Automation tools and frameworks:</b> useMango™, Micro Focus Suite ADM: UFT, Selenium Webdriver, Cucumber, Gherkin, Jasmine, Nightwatch, Protractor, Robot Framework, Smartbear Test Complete, OATS and REST libraries Service Virtualisation: Mockito, Stubit, SoapUI, Service Virtualization (Micro Focus, IBM, Parasoft) Performance: LoadRunner, Performance Center, JMeter, Gatling, StormRunner, The Grinder, Oracle Load Test Test management and SDLC Collaboration tools: Confluence, JIRA, Zephyr, ALM, Slack, ALM-QC, ALM.Octane, Silk Central, CA Agile Requirements Designer, TFS, Service Now, and MTM Containerisation, CI and Deployment: Chef, Puppet, Jenkins/Drone/Gitlab, Fabric 8, Kubernetes, Docker, Maven, Bamboo, etc Cloud Based Services such as AWS, Azure, and GoogleStrong coding experience in one or more of VBS, Ruby, C#, VB.NET, Java, JavaScript, Python, Scala, Groovy,<br>Strong ability to design and write engineering artefacts beyond just code<br>Strong ability to design and write automation scripts<br>Demonstrable experience of working with one or more of the following areas:<br>Digital services, micro service architectures and data services<br>Mainframe/Pascal/C++/Cobol<br><b>Packaged Applications:</b> SAP, Oracle E-Business Suite, Oracle Fusion Applications, OFM, Salesforce, SuccessFactors<br>Good knowledge of Automation Triangle<br>Stakeholder management at all levels, ability to work with all relevant parties (project, supplier technical teams, internal technical teams, service delivery, and so forth) to ensure an effective test service is maintained throughout the delivery lifecycle<br>Ability to facilitate meetings, workshops, training and other aspects as required<br>Understanding of the business objectives to be able to offer any value-add proposals or innovations, when appropriate<br>Excellent Presentation to technical and non-technical audiences<br>Excellent written and oral English<br>ISTQB Foundation in Software Testing<br><br><b>Benefits:</b><br><ul><li>Cycling allowance to/from work</li><li>Death in service 4x salary</li><li>Employee Assistance programme for counselling, health, legal, household (available to immediate family)</li><li>Non-Contributory Pension</li><li>Mobile</li><li>Laptop for remote working</li><li>Flexible and remote working where approved by line manager or client</li><li>Discretionary bonus for utilisation and business success</li></ul>You must be eligible to work in the UK. Due to the nature of our business, whilst we endeavour to place our people near their home this isn’t always possible and therefore, you must be willing to work throughout the country and possibly EU<br>SC Cleared or eligible for SC clearance is preferred (5 years + residence in UK, UK passport holder or ILR) although exceptions are made for outstanding candidates.<br>Please ensure that you highlight your specific relevant experience for this role in your covering letter, CVs received without this may not be reviewed.<br>For an initial conversation, please get in touch by sending your cover letter and CV to andy.levis@infuse.it<br>No agencies please.</span>",
    "urlFetchPending": false,
    "published": "Sep 18, 2017 9:51:27 PM",
    "tags": [
      "TZ_Europe",
      "REMOTE1_100",
      "TITLE1_qa"
    ],
    "tagsNames1": [
      "100% remote",
      "Europe timezones"
    ],
    "tagsNames2": []
  }
]
}
