{
 "items": [
  {
    "id": "IJ-u5eg-SeyZnBgSvcDKfw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159519/100-remote-migrations-manager-filevine-llc?a=RuRfQkQclUY",
    "title": "100% Remote Migrations Manager at Filevine LLC (Provo, UT) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise Software, Law Firms</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>The problem that I want you to solve...</strong></p><p>We are a fast growing software company building highly customizable SaaS products.&nbsp; When we close new customers, those customer have legacy systems full of data of varying quality that they want moved to our system.&nbsp; Since our system is highly customizable, some of that is repeatable and some are one off migrations.</p><p>I need a person that could manage a staff of technical people, but also can make the customer experience good one.&nbsp;&nbsp;Setting customer expectations, creating repeatable processes, dealing with internal and external people.&nbsp; That will require a firm hand and the ability to say &quot;no.&quot;.&nbsp; We currently have a backlog of customers not yet onboarded and sales are ramping up.&nbsp; This is currently a weak point in our operation and we need a person that can make this into a strength.&nbsp;&nbsp;</p><p>Challenges include varying data quality in legacy system, varying cooperation from new customer, commitments are important because new customers often have to cease operations on legacy systems and start on Filevine, creating a relatively small window, managing late process requests for changes - all of the usual migration issues.&nbsp; Key is finding the balance in all of this.&nbsp; No customer wants or will pay for perfect data but we want them happy at the end.&nbsp; That can be a moving target.</p><p>Sk<strong>ills &amp; Requirements</strong></p><p>Ability to manage a technical operation and staff - this often means a technical background</p><p>Ability to navigate the balance between pleasing customers and letting them take advantage</p><p>Ability to setup processes that are reliable</p><p>Ability to set and meet&nbsp;commitments</p><p>Ability to properly set expectations properly</p>                    </div>                            <h2>                About Filevine LLC            </h2>            <div><p>Filevine is a private software company with a product that helps law firms manage their practices. &nbsp;Filevine has two physical locations in Provo, UT and Las Vegas, NV for sales and support.&nbsp; &nbsp;&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 100% Remote Work                            </div>                            <div>                                 Jerk-free Environment                            </div>                            <div>                                 Normal stuff like Health Insurance, Paid Time Off and 401K                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_database",
      "TITLE1_sales",
      "REMOTE1_100",
      "TECH2_etl",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "database",
      "etl"
    ]
  },
  {
    "id": "28EpFwYJTX6gjZi1Yk-pBQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/155101/sre-manager-platformsh?a=Q0ZKJIH6fqU",
    "title": "SRE Manager at Platform.sh () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead, Manager</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Continuous Delivery, PaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Directly reporting to our CTO and in close interaction with our Compliance, Engineering and Infrastructure Operations teams, you will be responsible for:</p><ul><li>high availability of platforms, their up-scaling and automatization (auto-remediation, auto-scaling, predictive maintenance, …)</li></ul><ul><li>creating and standardizing systems, tools &amp; processes that will enhance our support and operations efficiency</li></ul><ul><li>improving service quality, discipline and reliability throughout lifecycle</li></ul><ul><li>monitoring operating objectives, streamline and automate intervention</li></ul><ul><li>continuous learning from Operations experience, modeled as software</li></ul><ul><li>supporting technical teams and promoting SRE good practice in the organization</li></ul><ul><li>eventually, creating and managing a team of SREs</li></ul><p><strong>Must have :</strong></p><p><span>The ideal candidate:</span></p><ul><li><span>has proven firm-wide successful experience in managing infrastructure</span></li></ul><ul><li><span>has demonstrated the ability to successfully manage cloud-based infrastructure for a fast growing organization</span></li></ul><ul><li><span>has e</span><span>xperience with containerization technologies</span></li></ul><ul><li><span>has had exposure to cloud services (AWS)</span></li></ul><ul><li><span>understands how an OS works, knows networking, how git works, and the constraints of a distributed system</span></li></ul><ul><li><span>is proficient in Python</span></li><li><span>likes solving problems once, hates anything manual and repetitive</span></li><li><span>ambitious &nbsp;and courageous with a cool head </span></li></ul><p><strong>Nice to have :</strong></p><ul><li><span>experience with Golang !</span></li></ul><ul><li><span>proficiency in Rust, Elixir or Haskell</span></li></ul><ul><li>k<span>nowledge of Magento Ecommerce, Symfony, Drupal, eZ Platform, or Typo3 (a lot of our customers run those)</span></li><li><span>working knowledge of Puppet &amp; Fabric</span></li></ul><ul><li><span>public speaking experience</span></li><li><span>mad Debian skillz !</span></li></ul>                    </div>                            <h2>                About Platform.sh            </h2>            <div><p>Platform.sh offers a groundbreaking hosting and development tool for web applications.</p><p>We’re a European VC-Backed startup with a host of blue-chip Enterprise clients and a string of awards and grants (including €2m from the EU Horizon 2020 program).</p><p>To reinforce our technical prowess, we are looking to grow our engineering team with our sole SRE who has knows Python, has a taste for Go, with good Linux system understanding, and a real hunger for the challenges of building robust, distributed systems.</p><p>If you’re looking for an exciting, high-growth opportunity with an award-winning, cutting-edge company, this could be just the job for you.</p><p>Platform.sh is a PaaS shrouded in a lot of black magic. We can consistently clone a whole running cluster, with its state, databases, indexes in a matter of seconds. We want to get this down to the hundreds of milliseconds domain. Interested? There is more...</p><p>Our external API is pure Hypermedia REST + oAuth on top of Pyramid. It mechanizes the Git layer and needs more features.</p><p>We can consistently generate from the same manifest a Docker container, an LXC one, or VM disk images (AWS, Azure, OpenStack), we want more targets.</p><p>We probably have the highest industry container density. We need to get it higher.</p><p>We support any Python, Ruby, NodeJS, Golang, Java or PHP application, it’s time to roll-out .NET, and Elixir, of course Elixir.</p><p>We need to have more auto-healing on the high-availability clusters. We need more performance out of our multi-protocol ssh proxy. We need to work on our Ceph Implementation; We need to get the Debian package generation streamlined and faster.</p><p>We need… great ideas on how to make Platform.sh even better.</p><p>Interested?</p><p>Join us!</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from home, wherever you are                            </div>                            <div>                                 Safe and friendly working environment                            </div>                            <div>                                 Stock options for everyone                            </div>                            <div>                                 Rest and recovery are essential to health and happiness; we get that                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_python",
      "TECH2_amazon-web-services",
      "TITLE1_sales",
      "REMOTE1_100",
      "TECH2_rust",
      "TZ_unknown",
      "TECH2_elixir",
      "TECH2_go"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "elixir",
      "go",
      "python",
      "rust"
    ]
  },
  {
    "id": "6LvrPrPJT_eyloRph2egDw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/7850-sales-development-representative",
    "title": "Sales Development Representative",
    "content": "Sales Development Representative - Jobmote<div><div><h2>Sales Development Representative</h2><h5>51 Blocks</h5></div></div><div><div><div><div><div><p>Who We Are:</p><p>51Blocks is Denver's premier boutique Internet Marketing Agency. We provide SEO, PPC, Social Media, and other internet marketing tools and services for small businesses. We are looking for an excellent communicator that can help engage with new leads and grow the sales pipeline.</p><p>Is this you or what you like?</p><ul><li><p>Autonomy - We welcome people who are looking to drive their own success. Someone who enjoys working without a boss looking over your shoulder. Someone who likes to have their own time and space to do their best work. Together we will set goals and define what success looks like together. </p></li><li><p>Purpose - At 51Blocks we are looking for someone who enjoys growing and developing business online - helping them understand their ROI and showing them how we grow their business. &nbsp;We have people who love helping small business but at the same time are growing their passion in different areas. For example, we have Reggie who loves music and creates his own. Any time we run into anything in that field he loves working and helping those people. What is your passion and how can we align that? </p></li><li><p>Always Learning - We welcome new ideas and always want you to be learning. &nbsp;We hope that you would have a curiosity that pushes you to learn and grow consistently. </p></li><li><p>Who You Will Report To - You will work directly with the Founder and Owner of the company and the sales manager. Your daily activities will have major impact on the company </p></li></ul><p>What You’ll Do:</p><p>The Sales Development Representative will be tasked with growing the sales pipeline by reaching out to new and potential leads. This includes the following:</p><ul><li><p>Emailing and Cold Calling activity (60+ calls per day) </p></li><li><p>Moving the prospect along from opening conversation to a deeper dive meeting with the sales team </p></li><li><p>Educate and set expectations for the client involving the 51Blocks process </p></li><li><p>Utilize best practices and our process to reach as many new leads as possible </p></li></ul><p>Requirements:</p><ul><li><p>Track Record of hitting sales goals and quotas </p></li><li><p>Proven hunter to find the right lead </p></li><li><p>Strong communication skills </p></li><li><p>Self motivated </p></li><li><p>1-3 years of related experience </p></li><li><p>Cold calling success </p></li><li><p>Comfortable conducting client calls one-on-one </p></li><li><p>Experience or ability to organize task work </p></li><li><p>Must be detail oriented and very thorough with your work. </p></li><li><p>Need to be able to thrive in a fast pace environment </p></li><li><p>Must be a quick learner </p></li><li><p>Passion for Internet Marketing is a must! </p></li><li><p>Must have a positive outlook on life </p></li><li><p>Must live the startup feel - less structure, very nimble </p></li><li><p>Bachelor degree preferred </p></li></ul><p>Working Remotely</p><ul><li><p>US Hours - You must work US hours as we need to communicate with clients who are US based </p></li><li><p>US Based - You must be based in the US </p></li><li><h2>of Hours - This will be an hourly position.</h2></li></ul></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 8:00:38 PM",
    "tags": [
      "TZ_America",
      "TITLE1_sales",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "uW-l9lwJQjOY-COlCCF42g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62325",
    "title": "Sales Assistant",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong><em>US Based Applicants Only. Not hiring in Washington state, Oregon state, San Francisco, or New York.</em></strong><br><br><br></p><p>Simply put, we make websites easier to use. Through a scientific method of determining which site improvements result in actual performance improvements, we replace the old way of designing sites through gut feel and management opinions with designing sites through data. Tactically speaking, clients come to us for both strategic direction and to supplement their internal teams.<br><br><br></p><p>We struggled with what to call this job since while the core of the job is sales assistant, the job will also be what you make of it. We refer to our current sales assistant, Jill Mendoza, as our “Jill of all trades” and she has a small picture of Wonder Woman as the :jill: emoji in our slack instance. Unfortunately, we have grown too big for Jill to be able to do everything, so we need more help.<br><br><br>Here are a few of the many, diverse tasks that you'll be potentially doing:<br><br></p><ul><li>Working to make sure quarterly client reviews are on track, and scheduling them with the clients<br></li><li>Creating sales decks with our CEO and 2 VPs of business development<br></li><li>Creating proposals with our CEO and 2 VPs of business development<br></li><li>Ensuring contracts are signed by all parties and facilitating handoffs between business development and the product management team<br></li><li>Various marketing tasks such as updating the website, sending out newsletters, posting jobs for sales assistants, etc (how meta!)<br></li><li>Helping to arrange team travel and client dinners<br></li><li>Competitive research and general LinkedIn research<br><br><br><br><p>Our most successful candidates have the following skills/experience/traits:<br><br><br></p></li><li>Ability to get things done with little direction<br></li><li>Worked cross-functionally in a highly collaborative environment, preferably in a remote capacity<br></li><li>Genuinely like working with clients and their distributed stakeholder group<br></li><li>Lifelong learner<br><br>If you’re interested in checking out the swell people you’ll be working with, click here <a href='https://crometrics.com/meet-the-team/' rel='nofollow'>to learn more about the team.</a><br><br><em>If you have questions as you go through this, make notes and if we haven’t answered them by the end, feel free to email chris@crometrics.com or tom@crometrics.com.</em><br><br><br></li><li><strong>We’re a remote company.</strong> We are spread out all over the country and enjoy the flexibility remote working affords. Want to go on a mountain bike ride in the middle of the day? Cool, don’t forget your helmet! Need to pick the kids up from school? Nice, you’ve got parent of the year in the bag. We stay connected through Slack and workcations, including one annual trip that is funded by the company.<br></li><li><strong>Our engineers value elegant code, but move fast.</strong> We’re writing code that runs on top of existing websites. Some tests only run for a few days before disappearing (though some do so well they become a permanent part of the client’s site). If “minimum viable product” isn’t in your lexicon, you aren’t a good fit.<br></li><li><strong>Communication is critical.</strong> We’re a remote company. That makes communication — including writing and reading comprehension — extremely important. You’ll work closely with engineers, designers and writers. This is not a simple “write specs and close tickets” gig. Successful applicants enjoy the process of defining and clarifying specs, documenting processes, improving processes, seeing their ideas and work affect millions of users, and uploading custom emoji to Slack.<br></li><li><strong>We’re relentlessly focused on our client’s happiness.</strong> The PM is a client-facing role. Managing a client relationship virtually takes a different type of skill set – the PMs have to be both a strategic partner, the customer (represented by the data), teacher and project manager over the phone/email/Slack, all while delivering an exceptional level of service. This type of interaction is not for everyone, and we completely understand. It’s not easy!<br></li><li><strong>We are not perfect.</strong> At the core of experimentation is the lesson to be learned from the test, whether a win, loss or inconclusive. We extend this concept to everything we do by setting the bar high for our team and fostering an environment of radical candor and constant learning.<br><br>This short essay sums up the philosophy we operate by: This is Professionalism: <a href='http://arches.io/2014/03/this-is-professionalism/' rel='nofollow'>http://arches.io/2014/03/this-is-professionalism/</a> <em>Sound like something you are interested in? Read on.</em></li></ul></span></td><td></td><td><a rel='nofollow'>10d</a></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 26, 2017 12:20:10 AM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "IBWBzh7WSUqs7VZHsxSZNg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/62859/sales-ninja-at-unhackable/",
    "title": "Sales Ninja",
    "content": "UnHackable is a secure email service for anyone who wants an email account that can't be hacked and benefit from 24/7 security monitoring of their accounts. With zero technical knowledge by the user it is used by individuals and businesses to protect some of their most important information and data. Accounts start from £12.50 per mailbox per week and for a number of reasons, we don't offer free trials at this time. We currently have a user base of 30 with the immediate goal being to reach 100 users and a 12 month goal of achieving 1000 users. <br /><br />About you: <br />An ambitious, dedicated and hard working young sales consultant. You might not have years of experience but you want to be part of something from the ground up, be an entrepreneur and part-founder of a new global business. You will be able to co-build your own sales strategy, work without any guidance and be focussed on the goal. You should be comfortable approaching a range of potential clients, institutions and businesses. <br /><br />Immediate equity on offer and commission for successful sales. <br /><br />Need to be able to meet up in London for an initial interview (Skype video considered for exceptional candidates) and then work remotely at your own relentless pace! <br /><br />Cheers James & Ian",
    "urlFetchPending": false,
    "published": "Oct 25, 2017 9:58:37 PM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "zgqdM1tHQKmA6KNMVQXmTA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/62825/business-development-associate-at-causalens/",
    "title": "Business Development Associate",
    "content": "Business Development Associate - Full Time (Remote)<br /><br />Summary<br /><br />We are looking for a motivated and high-achieving individual based in Europe to join the team working on expansion of the company in global markets. This is a full time placement with significant opportunities for growth, travel and advancement as one of the first employees of the company.<br /><br />The Company<br /><br />causaLens is high-tech startup based in London. We are bringing machine learning and big data technologies to the World’s leading asset managers. We are an extraordinary team and the founders have worked for some of the most prominent global hedge funds and scientific institutions. <br /><br />Core requirements<br /><br />* Highly capable, self-motivated, collaborative and personable <br />* Strong academic record <br />* Strong commercial skills gained from a professional background <br />* Interest in advanced technologies such as machine learning <br />* Able to demonstrate integrity, drive and natural curiosity<br />* An excellent written and verbal communicator with a high level of business acumen<br />* Ability to effectively work remotely (from home or coworking space) <br /><br />Roles and Responsibilities:<br /><br />* The role is varied and involves a combination of strategic & critical thinking, analysis and engagement with internal and external stakeholders. <br />* You will identify new opportunities and manage the full sales cycle from finding new prospects through to closure.<br />* You will be developing and maintaining value-based relationships with our customers.<br />* You will work directly with the CEO on developing and evaluating new opportunities. <br /><br />Benefits<br /><br />Successful candidate will have the opportunity to join a fast-growing, agile, and international team passionate about innovation and making a difference.  We will offer guidance, mentorship, and opportunities for professional development. <br />",
    "urlFetchPending": false,
    "published": "Oct 25, 2017 7:20:35 AM",
    "tags": [
      "TZ_Europe",
      "TITLE1_sales",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "Europe timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "jCiAm5htSSabpDChbmrNTw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3941-sales-engineer-open-source-wallaroo-labs",
    "title": "Sales Engineer Open Source @ Wallaroo Labs",
    "content": "<h2>              Sales Engineer Open Source<small> @ Wallaroo Labs</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-23 03:07</p></dd>          <dt><span>Description</span></dt>          <dd><p>Wallaroo Labs is working on a huge idea, and this is a phenomenal opportunity for a person who enjoys challenges. We believe in open source and strive to build on these technologies. Our distributed team is ten people and growing. We had have generated a lot of interest through our product and vision and raised a large seed round with several well-known VCs.</p><p>Faster data, more data sources, and business requirements are driving increasingly sophisticated algorithms and putting more and more demands on data applications. Wallaroo Labs solves these problems with Wallaroo, a data engine for building highly elastic big data applications.</p><p>We are looking for a Sales Engineer to drive the adoption of Wallaroo open-source offering within the developer community. This position is essential to our success; you will be responsible for identifying friction points with Wallaroo and systematically eliminate to improve the developer experience.</p><p>Although Wallaroo's headquarters is in New York, this position can be remote.  Candidates located in a Tech Hub cities or that have deep connections within existing developer networks would prove invaluable in building our community.</p><p><strong>Responsibilities</strong></p><ul><li>Provide support to sales team by running demos via remote session</li><li>Monitor communication channels (HN, Reddit, StackOverflow, Mailing lists, IRC) and interact with the community, answer questions and assist developers.</li><li>Identify and build relationships with the developer community, meetups, and conferences and leverage relationships to evangelize Wallaroo.</li><li>Own problem resolution and participate with the development team to create solutions.</li><li>Publish content from blog posts to video demos.</li></ul><p><strong>Qualities we are looking for</strong></p><ul><li>Experience working on a commercialized open source project (Spark, Cassandra, MongoDB etc.)</li><li>Ability to learn new technologies quickly.</li><li>Comfortable with a variety of programming languages, experience with Python, Go, JavaScript are a plus.</li><li>Familiar with Big Data technologies.</li><li>Desire and ability to work with enterprise clients and our open source community.</li><li>Experience working with open source software, GitHub etc.</li><li>Familiar with software development process in a business setting.</li><li>Outstanding verbal and written communication skills.</li></ul><p><strong>Learn more about Wallaroo</strong></p><ul><li>Corporate site: <a href='http://www.wallaroolabs.com' rel='nofollow'>http://www.wallaroolabs.com</a></li><li>Wallaroo Community Site: <a href='http://www.wallaroolabs.com/community' rel='nofollow'>http://www.wallaroolabs.com/community</a></li><li>Wallaroo Blog: <a href='https://blog.wallaroolabs.com/' rel='nofollow'>https://blog.wallaroolabs.com/</a></li><li>GitHub: <a href='https://github.com/WallarooLabs/wallaroo' rel='nofollow'>https://github.com/WallarooLabs/wallaroo</a></li></ul><p><em>We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:07:17 AM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "pK-1YeqLT5qybi48gFN9eg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62241",
    "title": "Sales Engineer Open Source",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Wallaroo Labs is working on a huge idea, and this is a phenomenal opportunity for a person who enjoys challenges. We believe in open source and strive to build on these technologies. Our distributed team is ten people and growing. We had have generated a lot of interest through our product and vision and raised a large seed round with several well-known VCs.<br><br>Faster data, more data sources, and business requirements are driving increasingly sophisticated algorithms and putting more and more demands on data applications. Wallaroo Labs solves these problems with Wallaroo, a data engine for building highly elastic big data applications.<br><br>We are looking for a Sales Engineer to drive the adoption of Wallaroo open-source offering within the developer community. This position is essential to our success; you will be responsible for identifying friction points with Wallaroo and systematically eliminate to improve the developer experience.<br><br>Although Wallaroo's headquarters is in New York, this position can be remote. Candidates located in a Tech Hub cities or that have deep connections within existing developer networks would prove invaluable in building our community.<br><br><strong>Responsibilities</strong><br><br></p><ul><li>Provide support to sales team by running demos via remote session<br></li><li>Monitor communication channels (HN, Reddit, StackOverflow, Mailing lists, IRC) and interact with the community, answer questions and assist developers.<br></li><li>Identify and build relationships with the developer community, meetups, and conferences and leverage relationships to evangelize Wallaroo.<br></li><li>Own problem resolution and participate with the development team to create solutions.<br></li><li>Publish content from blog posts to video demos.<br><br><strong>Qualities we are looking for</strong><br><br></li><li>Experience working on a commercialized open source project (Spark, Cassandra, MongoDB etc.)<br></li><li>Ability to learn new technologies quickly.<br></li><li>Comfortable with a variety of programming languages, experience with Python, Go, JavaScript are a plus.<br></li><li>Familiar with Big Data technologies.<br></li><li>Desire and ability to work with enterprise clients and our open source community.<br></li><li>Experience working with open source software, GitHub etc.<br></li><li>Familiar with software development process in a business setting.<br></li><li>Outstanding verbal and written communication skills.<br><br><strong>Learn more about Wallaroo</strong><br><br></li><li>Corporate site: <a href='http://www.wallaroolabs.com' rel='nofollow'>http://www.wallaroolabs.com</a></li><li>Wallaroo Community Site: <a href='http://www.wallaroolabs.com/community' rel='nofollow'>http://www.wallaroolabs.com/community</a></li><li>Wallaroo Blog: <a href='https://blog.wallaroolabs.com/' rel='nofollow'>https://blog.wallaroolabs.com/</a></li><li>GitHub: <a href='https://github.com/WallarooLabs/wallaroo' rel='nofollow'>https://github.com/WallarooLabs/wallaroo</a><br><em>We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:07:17 AM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "i4NrkHIVQbGACt99DW0HIg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workingnomads.co",
    "url": "https://www.workingnomads.co/jobs/sales-manager-brazil-business-reports",
    "title": "Sales Manager",
    "content": "<p>U.S. based digital publishing firm, Brazil Business Reports Inc (BBR) is currently seeking a Sales Manager for our education division, BBR Education. This unique position is remote (we are a company of established digital nomads), allowing you the ability to work from whatever office, home, state or country that works best for you.</p><p><em>About the Role:</em></p><p>We are seeking a proven, strategic sales leader to lead a business development team who are tasked with generating growth within our new and existing education industry related customer base. This individual will be responsible for generating revenue growth and achieving individual, team and organizational quotas. They will also be a valuable contributor to the overall sales strategy, leading implementation and driving execution to achieve objectives. We are looking for a self starter who takes ownership of their responsibilities and isn’t afraid to make decisions in order to achieve goals. This role will be responsible for leading and managing the team, coaching team members on strategy, pipeline management and ensuring all administrative and tracking tasks are maintained.</p><p><em>About Us:</em></p><p><a href='http://www.brazilbr.com/' rel='nofollow'>BBR</a> has been a leader in international publishing since 2010. Our driven and charismatic team of professionals serve top-ranked universities and Fortune 500 companies across the Americas. We are a dynamic, boutique and fast moving company committed to providing a high level services to our clients and the markets we serve.<a href='http://www.bbr-education.com/' rel='nofollow'> BBR Education</a> is a division of BBR, empowering the future leaders of Latin American students with valuable information on obtaining their degrees abroad.</p><p><em>About You:</em></p><p>Our ideal candidate is a proven client management expert, self-motivated, organized and driven by financial rewards from both individual and company successes. Positive attitudes and strong written and verbal communication skills are critical. To be successful you must also be persuasive, persistent and creative. You need to be comfortable working from home, but also be able to collaborate with multiple team members across the company (and continents). Management experience is critical; you must be comfortable and skilled at setting goals and holding people accountable to achieving those goals while providing training and motivation when necessary.</p><p><em>It’s all in the Details:</em></p><p>Compensation will be highly commission based allowing you to see direct reward for your individual efforts and contributions. There will also be an hourly component for management of the team. To apply, please email Michelle at <a href='mailto:titus@brazilbr.com' rel='nofollow'>titus@brazilbr.com</a>.</p>",
    "urlFetchPending": false,
    "published": "Oct 17, 2017 3:52:55 AM",
    "tags": [
      "REMOTE1_50",
      "TITLE1_sales",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "e7d31v-2RUKfPxRK97Ra8Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/62539/change-manager-you-used-to-write-programs-now-you-manage-programmes-at-mongoose-gray/",
    "title": "Change Manager. You used to write programs. Now you manage programmes.",
    "content": "*A change is gonna come.*<br /><br />Moses. Now there was a guy who could handle change. Sailed before he could walk. Took on the Pharaoh. Walked the desert for 40 years. Transcribed the Ten Commandments. Led his people to the promised land, survived an assassination by the Almighty _and_ lived to one hundred and score.<br /><br />If you can do all that (apart from the one hundred and score since our pension fund won’t stretch to it) then you could be the one for us.<br /><br />Here’s how it works.<br /><br />*We’re an independent, investor-backed technology and change management boutique.* In London. Which is like Canaan, but with fewer mountains and more Costa Coffees.<br /><br />You’re probably at a large corporate, frustrated at not being able to make a difference. Like Moses in Egypt but with less blood - this is not up for debate, we’re open-minded but murder is a no-no.<br /><br />*We’re looking for a highly personable, tech-savvy consultant* to design and implement complex business, technical and cultural change programmes. Like shifting from golden calves to stone tablets. (Stick with us, we’ll run out of analogies eventually.)<br /><br />You’ll be disciplined. A creator of project governance and communication channels that will guarantee success. An advocate of quality, control and rigour.  An approachable, motivating mentor who’ll persuade people to embark on a journey. Folks didn’t follow the big M for forty years because he had PowerPoint.<br /><br />*You’ll work with senior stakeholders on strategies and roadmaps.* It’s like talking to God. He’s the boss, He pay the bills, but sometimes He needs a nudge in the right direction.<br /><br />Okay, enough with the scripture, here’s the small print.<br /><br />*Ideally you’re an ex-programmer* (C#, Java or other object-orientated language) who’s moved into a business-facing, consulting role. You have  solid project management exposure, with proven skills in delivering technical and operational change. And you’re all about technology trends, lean methodologies, continuous improvement and process excellence.<br /><br />*We’re big on work/life balance, with scope for remote working.* There will be domestic and international travel, and just in case you were wondering it’s £60,000 plus excellent benefits and share options.<br /><br />And all _you_ have to do is send a CV with a covering letter. It’s not parting the Red Sea, is it?",
    "urlFetchPending": false,
    "published": "Oct 14, 2017 6:00:08 PM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "aEZ9KhVaTdW_yf81H93H9A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/62390/business-development-operations-analyst-at-tallysticksio/",
    "title": "Business Development & Operations Analyst",
    "content": "_*Junior Business Development Analyst*_<br /><br />Tallysticks is a trade finance solution that addresses the large unmet demand of SME importers and exporters the world over. Whilst SMEs account for 90% of all sales domestically, they account for less than 10% of all international sales. We have redefined the current and outdated international trade finance process to allow SMEs to access financing more readily.  <br /><br />We have won numerous awards since our inception in 2016, such as Barclays Techstars, FinTech 100, BBVA Open, NTT Data and Simmons and Simmons. We are now looking to grow our team with a Business Development and Operations Analyst<br /><br /><br />_*Suits a person who:*_<br /><br />* Wants to build a career in any one of the areas: Tech Development, Start- ups, FinTech, Consulting (strategic and operational), Banking, Financial Services and Operations<br />* Has work-experience in a professional environment such as in any of the above areas<br />* Is passionate about making a difference to an ever-changing business<br />* Can actively participate in the development of Tallysticks and its ventures<br />* Can take ownership from the get-go and work with minimal guidance<br />* Can demonstrate leadership and complex, quick problem-solving<br />* Has a minimum 2.1 Hons Degree from a Russel Group university or equivalent in any degree discipline<br /><br />_*Responsibilities*_<br /><br />You will primarily be working with the COO and CEO and also assisting the development team. The below are indicative of some of the responsibilities of the role:<br />* Assist with market and competitor analysis<br />* Assist and prepare sales and marketing materials<br />* Assist with implementation documentation and relevant information to ensure that clients understand our product and the change management required<br />* Manage our social media presence and assist the team in writing and publishing blog posts across platforms<br />* Attend conferences with the team and help grow the brand (this may require international travel)<br />* Assist in the event management of relevant sales and marketing events<br />* Lead and manage the team of interns and help secure interns<br />* Assist in managing our hiring pipeline and help to recognise potential candidates, matching them with our current job positions<br />* Assist in team meetings and setting the company agenda and strategy<br />* Assist in a range of administrative tasks no matter how big or small<br /><br /><br />_*Required Skills*_<br /><br />* Some relevant work experience<br />* Excellent command of the MS Office Suite<br />* Exemplary attention to detail<br />* Demonstrate excellent critical thinking and impeccable communication skills<br />* Demonstrable experience in leadership and problem solving<br />* Be able to work in a small, multinational team across disciplines and be a positive influence<br />* Be presentable and understand the pressures and requirements of a professional environment<br />* Want to take an active part in executing the business vision<br />* A can-do, positive attitude where no task is too big or too small<br />* Offer a solution to any problem<br /><br /><br />_*Nice to haves*_<br /><br />* Language skills<br />* Experience of working with Google Drive, Drawing Software Tools, Appreciation of Design Principles, Trello<br />* Be able to recognise beneficial tasks and work required before these are assigned<br />* Some experience of project management<br /><br /><br />_*The details*_<br /><br />* £18k-£25k & equity negotiable based on experience<br />* The position is based at Rise London, Shoreditch with some travel required<br />* We offer flexi-time but cannot offer remote work<br />* We cannot sponsor visas at this time<br /><br />*Need to have read and understood the salary and time requirement above*<br /><br />*Apply with CV and Cover Letter<br />* Include 2 paragraph understanding of what is blockchain<br /><br />_NO RECRUITERS_",
    "urlFetchPending": false,
    "published": "Oct 10, 2017 5:18:02 PM",
    "tags": [
      "TZ_Europe",
      "TITLE1_sales",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "Europe timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "v3X9RsWNRvmRoBdpYxrC6A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/62373/juniortrainee-mf-global-business-development-gaming-at-ad2games/",
    "title": "Junior/Trainee (m/f) Global Business Development - Gaming",
    "content": "ad2games is a digital marketing company specializing in pay-to-play and free-to-play games on PC and console platforms. Leveraging our advanced in-house technologies, we create measurable branding solutions, drive direct sales in your store and generate loyal users for your games. Our products and services are trusted by over 150 international brands including Daum Europe, Innogames, Gameforge, Youzu and Wargaming.<br /><br />Our global business development teams are now looking for a “Junior/Trainee (m/f)” to support them with their daily activities. If you are looking for an entry opportunity into Sales, then this will be the right opportunity. You will start with mainly supportive tasks and then, based on your personal development, eventually broaden your scope of responsibility. Depending on your experience, we hire you as a Junior or Trainee- important is that this is a long term opportunity with an unlimited contract. <br /><br />Your Role:<br />You scout online for potential leads and constantly fill the pipeline<br />You develop a very good understanding for the gaming industry and it’s players<br />You constantly stay on the top of the latest trends of the gaming market (new titles, releases, news etc.)<br />You support the global BD teams (Sao Paulo, Shanghai, San Francisco & Berlin) with client relations by sending meeting requests and follow ups<br />You create pitch presentations and case studies<br />You clear up and maintain our CRM (Salesforce) <br /><br />Your Profile:<br />You strive for a career in business development and sales<br />You have a passion for gaming and are a gamer yourself<br />You have very good English skills, written and spoken<br />You know how to prepare great presentations and feel comfortable using tools like PowerPoint, Google Slides and Photoshop<br />You are a highly motivated and outgoing individual with a positive working attitude<br />You are thorough, structured and well organized<br />You like to work independently with minimal supervision<br /><br />What do we Offer?<br />You become a part of a fun and unique company culture: https://www.youtube.com/watch?v=JkdS9q95M1Q&t=6s<br />You get to work with serial entrepreneurs who co-founded over a dozen successful companies<br />You enjoy a competitive remuneration package and much more<br />You work with a highly motivated and skilled team of young top performers<br />You get free German courses and enjoy numerous team events<br />A great experience: Living and working in Berlin- Europe’s Silicon Valley!<br /><br />Interested? - Submit your CV along with relevant documents online.<br />",
    "urlFetchPending": false,
    "published": "Oct 10, 2017 1:03:11 PM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "6v55liElTXumCWmIY_72Uw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/61731/junior-account-manager-at-adzuna/",
    "title": "Junior Account Manager",
    "content": "The Role<br /><br />Adzuna is looking for an Account Manager to play a key role in helping grow and retain our UK job advertiser base.<br />As the junior Account Manager, your primary objective will be to provide great customer service to our job board advertisers and optimise their campaigns. Working closely with our awesome sales team, you will be responsible for all revenue growth from this existing account base as well as developing new opportunities across jobs, property and cars. You will be seen as a product and people expert and use this as a reference point for customers wishing to continue to use Adzuna as their advertising partner of choice for their CPC budget and beyond.<br /><br />In return we offer a fun, entrepreneurial working environment within an exciting high-growth business where you can make a huge difference, with a market competitive package including stock options, training and a monthly social calendar all centred in a great West London location.<br /><br />Key responsibilities will include:<br /><br />Account Management<br />Manage a set list of existing clients and delight them!<br />Targeted on developing existing accounts and their growth within the business.<br />Identify and foresee issues, before the client brings them to us that could prevent them from rebooking.<br />Build effective working relationships with current client base to enable smooth transition from new business to an account managed service.<br />Review clients feeds and suggest ways for more efficient delivery, to help them get better return on their spend.<br />Work to understand the client’s motivations for success and work these to ensure delivery of these needs.<br /><br />General<br />Have a complete understanding of the Adzuna’s proposition; products and services to enable all customers’ needs be serviced.<br />Liaise closely with the Marketing & Tech teams to ensure continued world-class user experience for all current and prospective partners.<br />Report back any competitive information / sales trends you feel would be useful to the business.<br />Research opportunities and competition.<br />Document sales trends and customer/prospect feedback and report back to management.<br />Support the Key Account manager on larger accounts when required.<br /><br />Requirements<br /><br />Experience<br />· Excellent rapport builder/ people skills.<br />· Be able to demonstrate achievement of financial targets.<br />· Strong numerical skills, be able to analyse and optimise campaigns.<br />· Technically adept, with experience using MS Office suite and CRM applications.<br />· A good understanding of online advertising ideally with CPC and CPA models/ pricing.<br />· Best in class negotiation skills.<br />· Have a passion for great customer service.<br /><br />Personal Characteristics <br />· Enjoy working to daily, weekly and monthly targets whilst maintaining a flexible positive attitude.<br />· Show a desire to make decisions, take ownership and make judgement calls.<br />· Highly organised with great attention to detail.<br />· Ambitious, energetic and smart person who enjoys building strong relationships with their clients and team alike.",
    "urlFetchPending": false,
    "published": "Sep 19, 2017 6:01:06 PM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "rTL_fzDpQmuIK66XIDU1Vw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/61730/account-manager-us-accounts-at-adzuna/",
    "title": "Account Manager US accounts",
    "content": "Adzuna is looking for an Account Manager to play a key role in helping grow and retain our US job advertiser base.<br /><br />As the Account Manager, your primary objective will be to provide great customer service to our job board advertisers and optimise their campaigns. Reporting to our Country Manager US & Canada, you will be responsible for all revenue growth from this existing account base as well as developing new opportunities. You will be seen as a product and people expert and use this as a reference point for customers wishing to continue to use Adzuna as their advertising partner of choice for their CPC budget and beyond.<br /><br />In return we offer a fun, entrepreneurial working environment within an exciting high-growth business where you can make a huge difference, with a market competitive package including stock options, training and a monthly social calendar all centred in a great West London location.<br /><br /><br />Key responsibilities will include:<br />Account Management<br />- Manage a set list of existing clients and delight them!<br />- Targeted on developing existing accounts and their growth within the business<br />- Identify and foresee issues, before the client brings them to us that could prevent them from rebooking<br />- Build effective working relationships with current client base to enable smooth transition from new business to an account managed service<br />- Review client's feeds and suggest ways for more efficient delivery, to help them get better return on their spend<br />- Work to understand the client’s motivations for success and work these to ensure delivery of their needs<br /><br />General<br />- Have a complete understanding of the Adzuna’s proposition; products and services to enable all customers’ needs be serviced<br />- Liaise closely with the Marketing & Tech teams to ensure continued world-class user experience for all current and prospective clients<br />- Report back any competitive information / sales trends you feel would be useful to the business<br />- Research opportunities and competition<br />- Document sales trends and customer/prospect feedback and report back to management<br />- Support the Country Manager US & Canada on larger accounts when required<br /><br />Experience<br />· Excellent rapport builder/ people skills<br />· Be able to demonstrate achievement of financial targets<br />· Strong numerical skills, be able to analyse and optimise campaigns<br />· Technically adept, with experience using MS Office suite and CRM applications<br />· A good understanding of online advertising ideally with CPC and CPA models/ pricing<br />· Best in class negotiation skills<br />· Have a passion for great customer service<br /><br />Personal Characteristics<br />· Enjoy working to daily, weekly and monthly targets whilst maintaining a flexible positive attitude<br />· Show a desire to make decisions, take ownership and make judgement calls<br />· Highly organised with great attention to detail<br />· Ambitious, energetic and smart person who enjoys building strong relationships with their clients and team alike<br /><br />Benefits<br /><br />Work at a company where you can make a real difference<br />- A market-competitive salary, stock options and pension scheme<br />- Entrepreneurial environment in a great office in Fulham<br />- 23 days holiday – plus a bonus day for your birthday<br />- A bursting social event calendar and training opportunities<br />- A fancy coffee machine, ping pong table, maternity pay, bike to work scheme, fresh fruit, Adzuna Academy training program, Apple store discount and lots more",
    "urlFetchPending": false,
    "published": "Sep 19, 2017 5:58:03 PM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "TjvjdrkzT-ug_O6oHqmAOA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/61569/global-partnerships-manager-at-adzuna/",
    "title": "Global Partnerships Manager",
    "content": "Adzuna is looking for a Global Partnerships Manager to play a key role in leading our charge into new markets and expanding our reach in existing territories. Working closely with our awesome co-founders and entire management team, you’ll be responsible for finding and building new partnerships with other websites and media brands in the UK, US and beyond - and have the scope to put your own stamp on a very important part of our business.<br /><br />You will seek out new deals that help meaningfully grow Adzuna’s business, and constantly be on the hunt for ways to attract traffic, users, data and revenue.  Adzuna treats all employees like owners: all roles come with equity, so that’s exactly what you’ll be. Like Google’s Adsense, our partnership programme is a key part of our story already - and we expect it to be a growth engine that fuels Adzuna’s business in the UK and internationally in the next few years.<br /><br />A natural conversationalist, you’ll be able to charm the potential partners from the trees, by phone, email, in person or using carrier pigeons. You’ll leave no stone unturned in your quest for creative ways to draw value from partnerships across Adzuna’s business. You’ll be just as comfortable talking to CEOs and receptionists, and will thrive on the thrill of adventure, trying new ideas, exploring new territories, and making a huge difference, whilst working closely with our awesome team of marketers, techsperts and sales stars.<br /><br />Proven partner-hunting skills and a thirst for adventure are a must.<br /><br />Adzuna is a high-growth startup, that is championing real change in the job market - using the power of tech to match people to better, more fulfilling jobs. Our team of smart cookies is growing fast, so if you can hit the right notes, we’d love you to join our merry band and help us steer Adzuna on the next stage of its journey.<br /><br />Candidate requirements<br />5+ years of business development, partnerships and/or sales experience<br />Previous partnership or business development experience for online brands, ideally with exposure to the UK and US<br />Strong face-to-face business development experience essential, coupled with excellent email/phone outreach and strong networking skills<br />Strong communication skills, written and verbal<br />Excellent at commercial negotiations and contract management <br />Technically adept with a good understanding of online advertising, ideally with previous exposure to online search or advertising (cpc/cpa models) or jobs/classifieds industry<br />Creative approach to problem solving<br />Demonstrate a desire to make decisions, take ownership and make judgment calls both as a team and individually<br />Can present to and build relationships with senior level counterparts<br />Self-motivated, ambitious, energetic and smart person who enjoys building strong relationships with their partners<br /><br />Key responsibilities<br />New Business Development<br />Devise a list of potential partnership opportunities to grow traffic, acquire data or build brand<br />Work closely with Founders and Management Team on partnerships strategy<br />Develop new partnerships, pursuing the defined opportunities and nurturing potential partners<br />Propose creative partnership solutions (within scope of what business can support) and negotiate favorable commercial terms, including exclusivity where relevant; agree contracts<br />Liaise closely with Tech team to build partnership integrations <br />Achieve and exceed monthly performance metrics (pipeline metrics, deals signed/implemented, volume/value/margins, exclusive deals etc).<br /><br />General<br />Have a complete understanding of Adzuna’s proposition, products and services to enable all customers and partners needs to be serviced.<br />Liaise closely with the International & Technology teams to ensure continued world-class user experience for all current and prospective partners.<br />Own the relationship with big partners and work closely with Digital Marketing Manager for ongoing partner account management and reporting <br />Report back any competitive information and trends you feel would be useful to the business.<br /><br />Benefits<br />Work at a company where you can make a real difference<br /> A market-competitive salary and bonus scheme totalling £50k-£65k OTE depending on experience<br />Stock options - we want you to feel like an true owner<br />Entrepreneurial environment<br />A great office in Fulham Broadway<br />23 days holiday – plus a bonus day for your birthday<br />A bursting social event calendar<br />A fancy coffee machine, ping pong table, pension, maternity pay, bike to work scheme, fresh fruit, Adzuna Academy training program, Apple store discount and lots more!<br /> <br />About Adzuna<br /><br />Adzuna is a search engine for jobs ads used by over 10 million visitors per month that aims to list every job, everywhere.  We search thousands of websites so users don’t have to, bringing together millions of ads in one place. By providing smarter search options and powerful data about the job market, as well as unique tools like ValueMyCV, we give jobseekers the information they need to take control of their careers.<br /><br />Adzuna’s data also powers the Number 10 Dashboard, used by the Prime Minister and senior officials to keep track of economic growth on a daily basis.<br /><br />Adzuna launched in the UK in July 2011 and now operates in 16 countries. We have a great team, top class investors, recently won an award for best crowdfunding round of the year, and have been recognised as one of the government’s Future Fifty and Sunday Times Tech Track 100 fastest-growing tech companies in Britain.<br /><br />Adzuna’s mission is to be the best place to start looking for a job. We love using the awesome power of technology to help match people to better, more fulfilling jobs and keep Britain working.<br />You can read more here: http://www.adzuna.co.uk/about-us.html",
    "urlFetchPending": false,
    "published": "Sep 13, 2017 6:17:30 PM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  }
]
}
