{
 "items": [
  {
    "id": "nhp12o69QN-GfbpIbzb0og",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/160877/technical-pre-sales-field-consultants-octopus-deploy?a=RX5VP1PI9gc",
    "title": "Technical Pre-Sales/Field Consultants at Octopus Deploy () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>DevOps</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Continuous Delivery, DevOps, Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Octopus Deploy is the most popular deployment automation tool in the world, and large enterprises are standardising on Octopus as their company-wide deployment tool of choice. This presents many interesting architectual considerations, design challenges, and issues that we need you to help our customers navigate.&nbsp;</p><p>We're looking for&nbsp;two new team mates in the United States,&nbsp;who can help large customers who have already adopted, or planning to adopt, Octopus Deploy. A typical day in the role might include:</p><ul><li>A video call with a potential customer who's considering Octopus (and modernizing their software delivery stack more generally), and giving them a tailored demo of the product and how it might help them.&nbsp;</li><li>Putting together architectual diagrams or writing up advice on how a particular customer should implement Octopus for their entire organization</li><li>Following up with potential customers who need help building a proof-of-concept deployment pipeline with Octopus</li><li>Helping a customer's security team understand the best practices for using Octopus and what impacts Octopus might have for them</li><li>Representing Octopus at conferences around the US and talking to Octopus users face-to-face</li></ul><p>If you know Octopus, have a passion for seeing customers improve their CI/CD pipelines or adopt a DevOps approach more broadly, and are comfortable talking with small groups of people, this role is a chance to make a big difference.&nbsp;</p><p>A person in this role would ideally:</p><ul><li>Have implemented Octopus before at some scale, and know the tool well</li><li>Have good knowledge of other CI/CD tools</li><li>Have some experience in a client-facing role – e.g., in consulting</li><li>Have a mix of technical skills, ideally with experience development, release management or operations</li><li>Be great at written and verbal communication</li><li>Be organised and good at managing their time/setting expectations</li><li>Be relatively experienced and understand the realities of life in a large enterprise</li></ul><p>Most of our team is based in Australia, so this will be a remote role - you'll spend most of your time working from home. When you start we'd like&nbsp;to bring you to Brisbane, Australia for a few weeks to meet the team and as part of the onboarding/training program. There will also occasionally be some travel to attend conferences/trade shows that Octopus is exhibiting at.&nbsp;</p>                    </div>                            <h2>                About Octopus Deploy            </h2>            <div><p>We make <a href='http://octopusdeploy.com' rel='nofollow'>Octopus Deploy</a>, an automated deployment tool. Since 2012, we've grown organically and have over 20,000 customers around the world including 25 of the Fortune 100. Our software is used by teams to deploy .NET and Java applications to hundreds and thousands of production servers in the cloud and on-premises.&nbsp;</p><p>We are a small team that believe in building high-quality software. We ship new releases often, plan our milestones and major features in public, and take the time to do things right rather than rush. As an ISV, we know that our code is an asset to be invested in, not an expense to be minimised. If doing it right means it takes longer, so be it.&nbsp;</p><p>While most of our team is based in Brisbane or other parts of Australia, everyone works from home most of the week, so we've built a remote-first culture.&nbsp;We have a flexible&nbsp;<a href='http://octopusdeploy.com/blog/growing-octopus/how-we-work' rel='nofollow'>schedule and working arrangements</a>, and our team works mostly from home or occasionally from an office in Brisbane. We have a well-defined&nbsp;<a href='http://octopusdeploy.com/blog/growing-octopus/developer-career-paths' rel='nofollow'>career path for developers</a>, and&nbsp;a standardised&nbsp;<a href='http://octopusdeploy.com/blog/growing-octopus/compensation-and-progression' rel='nofollow'>approach to compensation and coaching</a>. We ensure you have the right tools with our&nbsp;<a href='http://octopusdeploy.com/blog/growing-octopus/laptop-program' rel='nofollow'>choose your own hardware</a>&nbsp;program.&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from home in a remote-first organization                            </div>                            <div>                                 Family-friendly, flexible schedules                            </div>                            <div>                                 Choose your own laptop, plus additional hardware budget                            </div>                            <div>                                 Modern technology, exciting challenges                            </div>                            <div>                                 Competitive salaries                            </div>                            <div>                                 Good, fun people who take pride in their work                            </div>                            <div>                                 No deathmarches; quality work takes time                            </div>                            <div>                                 Our customers are developers too, and they love what you build                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``remot 3N OR(role, employment)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR( australia, japan, newzealand)",
      "TECH2_continuous-delivery",
      "TITLE1_sales",
      "TZ_Asia",
      "REMOTE1_100",
      "TECH2_octopus-deploy",
      "TECH2_devops"
    ],
    "tagsNames1": [
      "100% remote",
      "Asia time zones"
    ],
    "tagsNames2": [
      "continuous-delivery",
      "devops",
      "octopus-deploy"
    ]
  },
  {
    "id": "zwM4NKuDSAiuSj3pYb6bZw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8088-sales-engineer",
    "title": "Sales Engineer",
    "content": "Sales Engineer - Jobmote<div><div><h2>Sales Engineer</h2><h5>iMerit Technology Services</h5></div></div><div><div><div><div><div><p>About iMerit </p><p>iMerit is a unique for-profit company with a social impact mission. We specialize in providing data services to global clients. Founded by successful entrepreneurs in Silicon Valley, we employ marginalized youth and women who have been trained in digital skills. This workforce provides critical services such as data enrichment, sentiment analysis, and data classification.</p><p>Our customers range from large, enterprise organizations to high-impact tech and e-commerce companies. We work with their most innovative teams in Machine Learning, Computer Vision, Product Experience and Data Science. </p><p>Our funders include Omidyar Network and the Michael and Susan Dell Foundation. &nbsp;With 800+ employees, we are an agile and fast-paced global startup with growing revenues and hands-on leadership.</p><p>About the Role </p><p>As a Sales Engineer, you are working closely with the Sales team’s efforts to engage with prospective clients and translate their often custom requirements into a full-fledged end-to-end data processing solution.</p><p>In order to establish new processes, you will be working with the Sales team, prospective and current clients, and the India-based Project Delivery team. You will also have the opportunity to design, coordinate, and product manage in-house development of custom tools, platforms, and workflows.</p><p>This is a role for self-directed learners, creative thinkers, and workplace chameleons. You will need to be adaptive, curious and resourceful and enjoy working with a diverse young team.</p><p>Responsibilities: </p><ul><li>Work with customers and prospective customers to deeply understand their proposed use case(s) and propose solutions based on iMerit’s core offerings, technology, and workforce capability<br></li><li>Lead newly engaged customers through any technical sales consultation and project implementation phase, while building trust in the solutions offered by iMerit<br></li><li>Work as the bridge between Sales, guiding their understanding of project implementation, and Project Delivery (responsible for actually delivering quality work). This requires a strong ability to multi-task, and switch gears between teams with competing priorities.<br></li><li>Provide consultative proposals and findings to clients in an organized and accessible manner. This includes a combination of data analysis, development of workflow proposals, and the ability to clearly map out process and values provided by the iMerit team. While heavily consultative, the ability to win (and maintain) client trust is of great importance.<br></li><li>Manage multiple projects simultaneously, including the project design, development, implementation, and delivery</li></ul><p>Required Experience/Skills: </p><ul><li>Minimum 3 years experience and success working in a customer-facing role<br></li><li>Prior experience managing a variety of projects and accounts, at different stages of development<br></li><li>Ability to work interculturally and in a distributed team<br></li><li>Interest (and openness) to travel (India and California)<br></li><li>Self-directed learner and hands-on problem solver<br></li><li>Comfortable working with numbers and data<br></li><li>Prior experience in Account Management, Project Management, Customer Success or Pre-Sales Consultation<br></li><li>Desire to learn independently about market trends, technology, and concepts in Machine Learning/Data Science field<br></li></ul><p>Ideal Candidate Traits/Experience: </p><ul><li>Experience working for an international company<br></li><li>Experience working with remote teams<br></li><li>Experience working in/with India<br></li><li>Prior work history with crowd-sourcing/outsourcing<br></li><li>Moderate to advanced Excel knowledge<br></li><li>Basic knowledge of SQL and other databases<br></li><li>Interest in social impact<br></li><li>Basic familiarity with programming languages such as HTML, PHP, Python, R<br></li><li>Based in San Francisco Bay Area a plus (Remote OK)</li></ul><p>Location: United States </p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Nov 16, 2017 12:00:26 AM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "TZ_America",
      "TITLE1_sales",
      "REMOTE1_100",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "zkmIMvOjSuS8GqufKn7yXw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30015?r=rss2",
    "title": "Aha!: PR & Communications Manager",
    "content": "<p>Full-time</p><p><strong>(Anywhere in US)</strong> </p><p>Are you a communications star who dreams about the best way to pitch a story? And do you know the right people to make that dream pitch turn into actual coverage? Do boilerplate press releases make your stomach turn? We are looking for a self-starter with proven communications, media and analyst relations, and marketing chops. This is a tremendous opportunity to use your expertise and knowledge to achieve meaningful results — and jump on a rocket. If this is you, we want to hear from you!</p><p>As a Communications Manager at Aha!, you will have an excellent opportunity to join a breakthrough and profitable company that is growing fast. Aha! was founded by a proven team of Silicon Valley veterans whose last two businesses were acquired by well-known public companies. More than 150,000 users trust Aha! to link their brilliant strategy to their team's work and create visual roadmaps.</p><h4>We are looking for someone who:</h4><ul><li>Has meaningful experience at a B2B SaaS or technology company</li><li>Writes exceptionally well</li><li>Has a proven track record of top-tier media placements</li><li>Brings fresh ideas to tell exciting stories</li><li>Has experience with integrated marketing campaigns</li><li>Likes to interact with customers and write quick case studies</li><li>Gets social and loves to advocate a strong company point-of-view</li></ul><h4>We are committed to being great, and we want someone who:</h4><ul><li>Can work at a fast-paced company where the feedback cycle is measured in hours rather than weeks</li><li>Has a &quot;get it done&quot; attitude and a background of delivering superb work again and again</li><li>Is seeking a career-defining opportunity and a proven, results-oriented team which has sold multiple software companies</li></ul><p><em>We are building a distributed team, and you can work from anywhere in the United States for this role. We offer generous salary, equity, benefits, and a profit-sharing program to the right candidates.</em></p><p><strong>For immediate consideration, please follow these&nbsp;<a title=&quot;Read this first&quot; href='https://blog.aha.io/the-best-cover-letters-that-ceos-love-to-read/' rel='nofollow'>helpful guidelines</a>&nbsp;and contact us at&nbsp;<a href='mailto:Marketing-jobs@aha.io' rel='nofollow'>Marketing-jobs@aha.io</a>. If you have the right background, we will quickly follow up with you. We are not working with recruiters or third-party agencies.</strong></p><p></p><p><strong>Apply:</strong> Please send your resume and cover letter to: Marketing-jobs@aha.io </p>",
    "urlFetchPending": false,
    "published": "Nov 14, 2017 6:32:39 PM",
    "tags": [
      "DBG:surround``4N(fulltim, anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "TZ_America",
      "TITLE1_sales",
      "REMOTE1_100",
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "S5W1m2-jTV-r4IKAtQ41dg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/jobs/5747-advertising-manager",
    "title": "Trialfacts: Advertising Manager",
    "content": "<div>  <div>    <h2>Advertising Manager</h2>      <h4>Posted Nov 14</h4>    <h3>      <span>Trialfacts</span><br>      <span>Headquarters: Completely Remote</span><br>        <a href='https://signup.trialfacts.com/advertising-manager/' rel='nofollow'>https://signup.trialfacts.com/advertising-manager/</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><ul><li><h3><span>Make a Dent in the Universe by Solving the Number One Problem Faced by Medical Researchers</span></h3></li></ul><ul><li><h3><span>Have Freedom Over When, Where &amp; How You Work</span></h3></li><li><h3><span>No Experience Necessary</span></h3></li><li><h3><span>Rapid Growth in New &amp; Existing Marketing Skills</span></h3></li><li><h3><span>Salary + Performance Compensation Package</span></h3></li></ul><div></div><div><br></div><div>Hello—we’re Trialfacts, a remote entrepreneurial company, and without us, a lot of medical research would not be possible. We’re searching for an <b>Advertising Manager</b> to help our our team solve our clients’ biggest problem. If you’re looking for a position where you can <b>set your own hours</b>, <b>take holidays as you see fit</b>, <b>work remotely</b> from home, and <b>help medical research succeed</b>, then please read on. </div><div><br></div><div><span>Today’s highly sophisticated medical system has added nearly 20 years of life expectancy, reduced infant mortality by 90% and maternal mortality by 99%. Polio, leprosy, smallpox, and tuberculosis are practically eradicated, even in the poorest countries in the world. There’s plenty of room for improvement, but a big part of what’s been achieved is due to new medications, medical devices and understanding developed through clinical research. </span></div><div><br></div><div><b>Our clients</b> – medical research organizations, are working hard to continue to develop treatments and devices, increase our understanding, eradicate sickness and improve quality of life. Their biggest challenge is spending half of their time searching for and never being able to recruit enough of the patients required for their clinical trials. </div><div><br></div><div><b>Our company</b> – Trialfacts, removes the biggest hurdle and frustration to conducting their research, by recruiting the patients they require for their clinical trials, and many times thereby saving their research. We’re the only company in the industry to also do this in a predictable and reliable manner, by determining upfront exactly how many patients we can recruit, and backing that up with a money-back guarantee.</div><div><br></div><div><h3><span>We’re looking for someone who can:</span></h3><br></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><span><b>Advertise</b></span><span>—You’ll need to create, manage and optimize our Facebook advertising campaigns and funnels. This includes strategy, persona creation, and complete ownership of the landing pages and multi-page forms we use to collect patient data.</span></div><div><br></div><div><span><b>Optimize</b></span><span>—You’ll be managing our campaigns from end to end, and expected to continuously run experiments and evaluate new strategies, processes and technologies to continuously improve performance and CPA. You’ll be expected to contribute to ongoing process and systems improvement, to support reliable campaign performance forecasting, efficient campaign setup, and CPA improvement.</span></div><div><br></div><div><span><b>Learn</b></span><span>—We’re looking for someone who’s driven to constantly update their advertising and marketing knowledge with the latest strategies and techniques. In addition to developing an in-depth understanding of clinical trials you’ll need to be able to rapidly develop a thorough understanding of each of our client’s clinical trials, their concerns, and then use that knowledge to create advertising collateral. If you’re intimidated by medical jargon then you need not apply.</span></div><div><br></div><div><span><b>Collaborate</b></span><span>—We’re looking for someone who will provide leadership in our advertising process, works well with the rest of our operations team, and is not afraid of picking up the phone, calling a client, brainstorming and working towards a solution. An important part of this role is to ensure that our successful advertising campaigns are resulting in our client’s success - our advertising funnel is just the first step, and it’s critical that our clients are able to convert the patients we’re providing.</span></div><div><h3><span>What’s in it for you:</span></h3></div><div><span><b>Autonomy</b></span><span>— We don’t have set working hours. We don’t have a holiday policy (you can take your holidays whenever you want). We don’t micromanage or babysit. You’ll be accountable to the rest of the team purely on your results, and not on the number of hours spent working.</span></div><div><br></div><div><span>Our team is remote (we communicate via Slack and Google Hangouts). We set our own hours based on what works for us and our clients. As long as you have a good internet connection and can overlap with our clients’ working hours, you can work from wherever you choose. You will need some flexibility to overlap some of your working hours with our team and clients. </span></div><div><br></div><div><span><b>Innovation</b></span><span>— We’re the first and only company in our industry to guarantee our results. We’ve launched innovative patient recruitment strategies (e.g., our phone screening appointment system, researcher interviews) that provide predictability and certainty in a volatile industry, and we’re constantly improving our service.</span></div><div><br></div><div><span>We apply the same innovative approach to our patient advertising and recruitment process. We’re focused on streamlining client onboarding, client education, and gathering feedback from our clients, and we're always interested in what improvements we can gain from the latest and greatest software tools and technology.</span></div><div><br></div><div><span><b>Impact</b></span><span>— Trialfacts plays an extremely important role in contributing to medical research and driving humanity forward. Our clients—researchers working at universities, pharmaceutical companies, biotech companies, natural medicine companies, hospitals and medical practices—work hard to develop treatments and technology that cure diseases and improve quality of life.</span></div><div><br></div><div><span>We are the only company that solves recruitment problems in a predictable and reliable way—our consistent, results-driven process makes us the only recruitment company that provides a money-back guarantee.</span></div><div><br></div><div><span><b>Growth</b></span><span>— As a member of a small, entrepreneurial team you'll be exposed to many areas of the business. You'll be given the opportunity to learn many new skills and experiment in many new areas, as well as progress and build on what you already know. You'll be continuously testing and implementing new advertising and marketing strategies. You'll have access to courses, books and training programs paid for by Trialfacts.</span></div><div><br></div><div><span><b>Opportunity</b></span><span>— We’re a rapidly growing company, 100% year-on-year via organic growth through repeat business, referrals and new clients. We're an innovative company in an industry ripe for disruption.</span></div><div><br></div><div><span>We offer a salary + results-based compensation package, and the possibility to grow into positions of additional responsibility and/or leadership in the future. The future looks optimistic as we continue to improve and expand on our core service.</span></div><div><br></div><div><h3><span>This position is for you if you:</span></h3><br></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><span><b>Are great at synthesizing information</b></span><span> - whether it’s absorbing a client’s medical and research documents or analyzing vast amounts of data across multiple campaigns and funnel stages, you’ll need to be at home with receiving a high volume of input, honing in on what’s important, and efficiently moving forward. </span></div><div><br></div><div><span><b>Are able to create compelling advertising and landing pages</b></span><span> - after synthesizing large amounts of information you need to be able to have a natural ability to be able to put yourself in the relevant person’s shoes to be able to create effective personas, advertising, landing pages and patient data collection forms.</span></div><div><br></div><div><span><b>Have a passion for testing and making data-driven decisions</b></span><span> - there’s no doubt advertising requires a love of both data and testing. If you’re not comfortable with gathering, manipulating and interpreting data, and constantly testing everything, then please don’t apply. </span></div><div><br></div><div><span><b>Love learning</b></span><span> - we're a team that's driven by learning and improving. &nbsp;We're looking for someone who wants to continuously learn and develop as an advertiser and marketer, grow as a person and constantly improve the service that we provide. If you’re not excited about learning and always taking that next course, then this position is not a good fit for you.</span></div><div><br></div><div><span><b>Are highly organized</b></span><span> - you'll be managing campaigns for many different clients, while also testing, creating and setting up new campaigns, and always learning more. If you're not highly organized and comfortable in a fast-paced environment then you're unlikely a good-fit for this role. </span></div><div><br></div><div><span><b>Look beyond the advertising campaigns</b></span><span> - when a patient converts for us, this is just the first step in our client’s larger funnel. We need to optimize and align what we’re doing, to ensure that we’re getting the right kind of conversions for our clients. If you just want to run ad campaigns and not think about what happens to someone after they sign up, this position is not for you.</span></div><div><br></div><div><span><b>Have design skills (Canva, Photoshop or similar)</b></span><span> - Creating a great experience is essential in marketing. You don’t need formal design experience, but if you don’t know how to make something look good using appropriate color, font and spacing choices, or even worse - don’t think it’s important, then this position is not for you. </span></div><div><br></div><div><span><b>Are proficient in HTML &amp; CSS (any other coding languages are an asset)</b></span><span> - Similar to the above, marketing today relies heavily on technology and automation. You don’t need any formal development experience but if you’re not comfortable with at least HTML &amp; CSS, please don’t apply. Similarly, if you’re not the kind of person that loves testing out new tools and technology, this position is not a good fit.</span></div><div><br></div><div><span><b>Excel at written communication and are not afraid to pick up the phone</b></span><span> - from landing page copy to communicating with clients via email, being able to write well is a must for any Trialfacts position. Being in a remote team, you must also be great at communicating, and if necessary be willing to pick up the phone and speak with our clients. </span></div><div><br></div><div><span><b>Are flexible</b></span><span> - in an entrepreneurial business we sometimes have to wear different hats. We're looking for someone that takes ownership and wants to help grow our company. If you're the kind of person who would rather sit back and say &quot;that's not my responsibility&quot; then please don't apply.</span></div><div><br></div><div><span><b>Are results-driven</b></span><span> - you will be coached and guided, but ultimately you will be responsible for your performance which will directly impact your compensation.</span></div><div><br></div><div><span><b>Are looking for a full-time position</b></span><span> - we’re experiencing growth and we need someone who can fully commit to Trialfacts and get up to speed fairly quickly. We’re not looking for someone who wants to run their own part-time business or freelancing career on the side.</span></div><div><br></div><div><h3><span>Summary</span></h3></div><div><span>Yes, this position description is so long that it needs a summary! Here are the facts:</span></div><div><br></div><ul><li><span><b>Set your own hours:</b></span><span> Choose when and how you work, so long as you are flexible to overlap with our team and clients when necessary. This is a full-time position.</span></li><li><span><b>Work remotely:</b></span><span> We’re a virtual team located around the globe. You can live nearly anywhere or travel with this position. You will need a reliable internet connection.</span></li><li><span><b>Results-based environment:</b></span><span> You’ll be evaluated based on your results. You will not be micro-managed, and you have the flexibility to set your own hours and work however you like, but you need to be meeting our advertisement targets for each client.</span></li><li><span><b>Commitment to learning:</b></span><span> We believe in continuous improvement and growth. You’ll be mentored, guided, and trained by our team and external resources, courses and training programs.</span></li><li><span><b>Contribute something meaningful to the world:</b></span><span> We make a lot of medical research possible that would otherwise fail, and remove the #1 headache faced by researchers in a predictable and reliable manner.</span></li><li><span><b>Trial period:</b></span><span> There will be an initial paid trial period probably lasting 2-3 weeks, but it’s possible it might be longer.</span></li><li><span><b>Compensation:</b></span><span> Compensation will be a monthly salary plus performance-based compensation package.</span></li></ul><div><br></div><div><h3><span><span>Interested in making a difference with us? Please follow the application instructions at the bottom of the&nbsp;</span></span><a href='https://signup.trialfacts.com/advertising-manager/' rel='nofollow'><span>full position description</span></a><span>.</span><br></h3></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><span><br></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please follow the application instructions at <a href='https://signup.trialfacts.com/advertising-manager' rel='nofollow'>https://signup.trialfacts.com/advertising-manager</a>.</p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 14, 2017 4:59:28 AM",
    "tags": [
      "DBG:surround``headquart 3N remot",
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "i773xMoUTpCYI3Px8HY6jQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63027",
    "title": "Advertising Manager",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div><span></span></div><ul><li></li></ul><ul><li></li><li></li><li></li><li></li></ul><div></div><div><br></div><div>Hello—we’re Trialfacts, a remote entrepreneurial company, and without us, a lot of medical research would not be possible. We’re searching for an <b>Advertising Manager</b> to help our our team solve our clients’ biggest problem. If you’re looking for a position where you can <b>set your own hours</b>, <b>take holidays as you see fit</b>, <b>work remotely</b> from home, and <b>help medical research succeed</b>, then please read on. </div><div><br></div><div><span>Today’s highly sophisticated medical system has added nearly 20 years of life expectancy, reduced infant mortality by 90% and maternal mortality by 99%. Polio, leprosy, smallpox, and tuberculosis are practically eradicated, even in the poorest countries in the world. There’s plenty of room for improvement, but a big part of what’s been achieved is due to new medications, medical devices and understanding developed through clinical research. </span></div><div><br></div><div><b>Our clients</b> – medical research organizations, are working hard to continue to develop treatments and devices, increase our understanding, eradicate sickness and improve quality of life. Their biggest challenge is spending half of their time searching for and never being able to recruit enough of the patients required for their clinical trials. </div><div><br></div><div><b>Our company</b> – Trialfacts, removes the biggest hurdle and frustration to conducting their research, by recruiting the patients they require for their clinical trials, and many times thereby saving their research. We’re the only company in the industry to also do this in a predictable and reliable manner, by determining upfront exactly how many patients we can recruit, and backing that up with a money-back guarantee.</div><div><br></div><div><br></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><span><b>Advertise</b></span><span>—You’ll need to create, manage and optimize our Facebook advertising campaigns and funnels. This includes strategy, persona creation, and complete ownership of the landing pages and multi-page forms we use to collect patient data.</span></div><div><br></div><div><span><b>Optimize</b></span><span>—You’ll be managing our campaigns from end to end, and expected to continuously run experiments and evaluate new strategies, processes and technologies to continuously improve performance and CPA. You’ll be expected to contribute to ongoing process and systems improvement, to support reliable campaign performance forecasting, efficient campaign setup, and CPA improvement.</span></div><div><br></div><div><span><b>Learn</b></span><span>—We’re looking for someone who’s driven to constantly update their advertising and marketing knowledge with the latest strategies and techniques. In addition to developing an in-depth understanding of clinical trials you’ll need to be able to rapidly develop a thorough understanding of each of our client’s clinical trials, their concerns, and then use that knowledge to create advertising collateral. If you’re intimidated by medical jargon then you need not apply.</span></div><div><br></div><div><span><b>Collaborate</b></span><span>—We’re looking for someone who will provide leadership in our advertising process, works well with the rest of our operations team, and is not afraid of picking up the phone, calling a client, brainstorming and working towards a solution. An important part of this role is to ensure that our successful advertising campaigns are resulting in our client’s success - our advertising funnel is just the first step, and it’s critical that our clients are able to convert the patients we’re providing.</span></div><div></div><div><span><b>Autonomy</b></span><span>— We don’t have set working hours. We don’t have a holiday policy (you can take your holidays whenever you want). We don’t micromanage or babysit. You’ll be accountable to the rest of the team purely on your results, and not on the number of hours spent working.</span></div><div><br></div><div><span>Our team is remote (we communicate via Slack and Google Hangouts). We set our own hours based on what works for us and our clients. As long as you have a good internet connection and can overlap with our clients’ working hours, you can work from wherever you choose. You will need some flexibility to overlap some of your working hours with our team and clients. </span></div><div><br></div><div><span><b>Innovation</b></span><span>— We’re the first and only company in our industry to guarantee our results. We’ve launched innovative patient recruitment strategies (e.g., our phone screening appointment system, researcher interviews) that provide predictability and certainty in a volatile industry, and we’re constantly improving our service.</span></div><div><br></div><div><span>We apply the same innovative approach to our patient advertising and recruitment process. We’re focused on streamlining client onboarding, client education, and gathering feedback from our clients, and we're always interested in what improvements we can gain from the latest and greatest software tools and technology.</span></div><div><br></div><div><span><b>Impact</b></span><span>— Trialfacts plays an extremely important role in contributing to medical research and driving humanity forward. Our clients—researchers working at universities, pharmaceutical companies, biotech companies, natural medicine companies, hospitals and medical practices—work hard to develop treatments and technology that cure diseases and improve quality of life.</span></div><div><br></div><div><span>We are the only company that solves recruitment problems in a predictable and reliable way—our consistent, results-driven process makes us the only recruitment company that provides a money-back guarantee.</span></div><div><br></div><div><span><b>Growth</b></span><span>— As a member of a small, entrepreneurial team you'll be exposed to many areas of the business. You'll be given the opportunity to learn many new skills and experiment in many new areas, as well as progress and build on what you already know. You'll be continuously testing and implementing new advertising and marketing strategies. You'll have access to courses, books and training programs paid for by Trialfacts.</span></div><div><br></div><div><span><b>Opportunity</b></span><span>— We’re a rapidly growing company, 100% year-on-year via organic growth through repeat business, referrals and new clients. We're an innovative company in an industry ripe for disruption.</span></div><div><br></div><div><span>We offer a salary + results-based compensation package, and the possibility to grow into positions of additional responsibility and/or leadership in the future. The future looks optimistic as we continue to improve and expand on our core service.</span></div><div><br></div><div><br></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><span><b>Are great at synthesizing information</b></span><span> - whether it’s absorbing a client’s medical and research documents or analyzing vast amounts of data across multiple campaigns and funnel stages, you’ll need to be at home with receiving a high volume of input, honing in on what’s important, and efficiently moving forward. </span></div><div><br></div><div><span><b>Are able to create compelling advertising and landing pages</b></span><span> - after synthesizing large amounts of information you need to be able to have a natural ability to be able to put yourself in the relevant person’s shoes to be able to create effective personas, advertising, landing pages and patient data collection forms.</span></div><div><br></div><div><span><b>Have a passion for testing and making data-driven decisions</b></span><span> - there’s no doubt advertising requires a love of both data and testing. If you’re not comfortable with gathering, manipulating and interpreting data, and constantly testing everything, then please don’t apply. </span></div><div><br></div><div><span><b>Love learning</b></span><span> - we're a team that's driven by learning and improving. &nbsp;We're looking for someone who wants to continuously learn and develop as an advertiser and marketer, grow as a person and constantly improve the service that we provide. If you’re not excited about learning and always taking that next course, then this position is not a good fit for you.</span></div><div><br></div><div><span><b>Are highly organized</b></span><span> - you'll be managing campaigns for many different clients, while also testing, creating and setting up new campaigns, and always learning more. If you're not highly organized and comfortable in a fast-paced environment then you're unlikely a good-fit for this role. </span></div><div><br></div><div><span><b>Look beyond the advertising campaigns</b></span><span> - when a patient converts for us, this is just the first step in our client’s larger funnel. We need to optimize and align what we’re doing, to ensure that we’re getting the right kind of conversions for our clients. If you just want to run ad campaigns and not think about what happens to someone after they sign up, this position is not for you.</span></div><div><br></div><div><span><b>Have design skills (Canva, Photoshop or similar)</b></span><span> - Creating a great experience is essential in marketing. You don’t need formal design experience, but if you don’t know how to make something look good using appropriate color, font and spacing choices, or even worse - don’t think it’s important, then this position is not for you. </span></div><div><br></div><div><span><b>Are proficient in HTML &amp; CSS (any other coding languages are an asset)</b></span><span> - Similar to the above, marketing today relies heavily on technology and automation. You don’t need any formal development experience but if you’re not comfortable with at least HTML &amp; CSS, please don’t apply. Similarly, if you’re not the kind of person that loves testing out new tools and technology, this position is not a good fit.</span></div><div><br></div><div><span><b>Excel at written communication and are not afraid to pick up the phone</b></span><span> - from landing page copy to communicating with clients via email, being able to write well is a must for any Trialfacts position. Being in a remote team, you must also be great at communicating, and if necessary be willing to pick up the phone and speak with our clients. </span></div><div><br></div><div><span><b>Are flexible</b></span><span> - in an entrepreneurial business we sometimes have to wear different hats. We're looking for someone that takes ownership and wants to help grow our company. If you're the kind of person who would rather sit back and say 'that's not my responsibility' then please don't apply.</span></div><div><br></div><div><span><b>Are results-driven</b></span><span> - you will be coached and guided, but ultimately you will be responsible for your performance which will directly impact your compensation.</span></div><div><br></div><div><span><b>Are looking for a full-time position</b></span><span> - we’re experiencing growth and we need someone who can fully commit to Trialfacts and get up to speed fairly quickly. We’re not looking for someone who wants to run their own part-time business or freelancing career on the side.</span></div><div><br></div><div></div><div><span>Yes, this position description is so long that it needs a summary! Here are the facts:</span></div><div><br></div><ul><li><span><b>Set your own hours:</b></span><span> Choose when and how you work, so long as you are flexible to overlap with our team and clients when necessary. This is a full-time position.</span></li><li><span><b>Work remotely:</b></span><span> We’re a virtual team located around the globe. You can live nearly anywhere or travel with this position. You will need a reliable internet connection.</span></li><li><span><b>Results-based environment:</b></span><span> You’ll be evaluated based on your results. You will not be micro-managed, and you have the flexibility to set your own hours and work however you like, but you need to be meeting our advertisement targets for each client.</span></li><li><span><b>Commitment to learning:</b></span><span> We believe in continuous improvement and growth. You’ll be mentored, guided, and trained by our team and external resources, courses and training programs.</span></li><li><span><b>Contribute something meaningful to the world:</b></span><span> We make a lot of medical research possible that would otherwise fail, and remove the #1 headache faced by researchers in a predictable and reliable manner.</span></li><li><span><b>Trial period:</b></span><span> There will be an initial paid trial period probably lasting 2-3 weeks, but it’s possible it might be longer.</span></li><li><span><b>Compensation:</b></span><span> Compensation will be a monthly salary plus performance-based compensation package.</span></li></ul><div><br></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><span><br></span></div><p><strong>To apply:</strong> Please follow the application instructions at <a href='https://signup.trialfacts.com/advertising-manager' rel='nofollow'>https://signup.trialfacts.com/advertising-manager</a>.</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 14, 2017 4:59:28 AM",
    "tags": [
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``work 2W from 2W wherev"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "bY5FFEswTQugVbqZso8I6w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30008?r=rss2",
    "title": "ZOE PEPPER: Business Development/Sales Head",
    "content": "<p>Full-time</p><p><strong>(Anywhere (but NYC-bias))</strong> </p><p><strong>ZOE PEPPER</strong></p><p>We are a branding agency for startups. Unlike the traditional agencies, our talents are entirely comprised of the most experienced freelancers in the advertising industry.</p><p>Our goal is to connect clients directly to top senior talents in the advertising industry. We have removed all overheads emblematic of traditional agencies and this allows our clients to work with the very best talents at a lower cost.</p><p>We are looking to hire someone who is a gifted salesperson to assist technically-oriented founders.</p><p>We are based in London but manage clients and talents based in the US and the UK.</p><p><strong>RESPONSIBILITIES</strong></p><ul><li>Design and execute marketing campaigns across digital and offline media</li><li>Scientifically research for leads and develop sales pipeline</li><li>Convert leads into clients</li></ul><p><strong>YOU</strong></p><ul><li>Self-motivated</li><li>Inquisitive</li><li>Problem solver</li></ul><p><strong>BONUS</strong></p><ul><li>Prior experience of working in an advertising agency</li><li>Rudimentary knowledge of programming</li></ul><p>Every member of our team actively shapes our business. We value and invest in continuous learning for all members of the team.</p><p>&nbsp;</p><p></p><p><strong>Job Perks:</strong> Equity up to 10%.</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Nov 13, 2017 6:44:52 PM",
    "tags": [
      "DBG:surround``4N(fulltim, anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "TZ_America",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "TITLE1_sales",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "aFwOAgqORg2QV593kPij4Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3978-sales-specialist-pressable",
    "title": "Sales Specialist @ Pressable",
    "content": "<h2>              Sales Specialist<small> @ Pressable</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-11-13 16:11</p></dd>          <dt><span>Description</span></dt>          <dd><p>Pressable, a leading provider of WordPress hosting, is looking for driven individuals to join our remote team as a Sales Specialist. This is an outbound sales position. Compensation is salary plus commission. In addition to strong technical sales skills, you’ll need a working knowledge of WordPress to succeed in this role.</p><p><strong>Requirements for this role include:</strong></p><ul><li>Identifying leads using technographic data and other means.</li><li>Building a pipeline.</li><li>Travelling to industry events.</li><li>Being a thought leader, sharing opinions based on customer feedback with our team.</li><li>Coordinating with team members and leads to get estimates.</li><li>Working with an Account Manager to ensure that customers are successful and stay with Pressable.</li><li>Reporting to management and executives on a regular basis.</li></ul><p><strong>An Sales Specialist should have the following skills and experiences:</strong></p><ul><li>Familiar with WordPress and the WordPress Community.</li><li>Demonstrable success in B2B technical sales. Non-technical salespersons should not apply.</li><li>A self-starting approach to work.</li><li>Strong troubleshooting and problem solving skills.</li><li>Excellent written and verbal communication skills, possessing the ability to clearly communicate through text-based chat, video conferencing and phone calls.</li></ul><p>Preference will be shown to candidates with experience selling WordPress at a hosting company or digital agency.</p><p>We may invite an applicant to complete a limited-time “trial” project as part of the hiring process. A trial is an opportunity for our team to get hands-on experience working with an applicant and evaluating their work. We pay applicants a standard rate of $15/hour while they work as a contractor to complete their trial project.</p><p>We ask everyone who applies to be authorized to work in the United States. When you apply, please provide a detailed description of your past experience in technical sales.</p><p><strong>Our benefits our great. You can expect:</strong></p><ul><li>Flexibility. Our team is remote, meaning you can work from anywhere you want as long as you have an internet connection.</li><li>Medical, dental, vision, and life insurance for less than $10. We pay 99% of premiums for you and your family.</li><li>401(k) matching. We match your 401(k) contributions up to 6% of your salary.</li><li>A generous time off policy. We want our team members to enjoy a phenomenal work–life balance.</li></ul><p><strong><em>Let us know you’re interested!</em></strong></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>United States</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Nov 13, 2017 6:11:19 PM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "269BXMBOTgGZKUsFYHrzWQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/jobs/5731-internal-tools-manager",
    "title": "InVisionApp: Internal Tools Manager",
    "content": "<div>  <div>    <h2>Internal Tools Manager</h2>      <h4>Posted Nov 10</h4>    <h3>      <span>InVisionApp</span><br>      <span>Headquarters: New York, NY</span><br>        <a href='https://www.invisionapp.com' rel='nofollow'>https://www.invisionapp.com</a>    </h3>  </div>    </div>  <div>    <div><a href='http://www.invisionapp.com/' rel='nofollow'>InVision</a>&nbsp;is the world’s leading design collaboration platform.</div><div><br></div><div>&nbsp;</div><div><br></div><div>We enable companies of all sizes to discover the power of design-driven product development. That’s why more than 2,000,000 designers, product managers, marketers and other stakeholders at so many of the world's most loved<a href='http://www.invisionapp.com/customers' rel='nofollow'>&nbsp;startups, agencies, &amp; corporations</a>&nbsp;use InVision every day, including Uber, Evernote, Twitter, Adobe, Salesforce and many more.</div><div><br></div><div>&nbsp;</div><div><br></div><div>Our Internal Tooling team strives to develop and maintain high quality, scalable tools and integrations, leveraged by User Enablement, Support, Sales, Training, and other teams. Candidates should be excited at the prospect of serving those teams who so faithfully serve our customers everyday.</div><div><br></div><div><h3><strong>Requirements</strong></h3></div><ul><li>THE CHOPS: You describe yourself as a jack-of-all-trades, thoroughly experienced and excited by modern technologies and services. You are a leader who manages through example and prides themselves on organization and results.</li><li>PASSIONATE ABOUT DESIGN: You understand that design makes everything possible. You are able to distinguish ‘great’ design from ‘pretty’ design. You see the difference design thinking can make in the lives of users. And you understand that even something as historically unpolished as internal tools deserve topnotch UX.</li><li>PROBLEM SOLVER: You enjoy learning how to solve problems in the most efficient way possible. Complexity doesn’t scare you. The challenge of distilling something complex into something simple invigorates and excites you.</li><li>BIASED TOWARD ACTION: You are a self-motivated, action-oriented person. You don’t sit on your hands and wait for someone else to fix a problem. If there is something you can do to make a situation better, you do it.</li><li>FOLLOWS THROUGH: From support staff, to product designers, to engineering – you speak the language of each of these archetypes. You are empathetic, concise, and consistent in your communication and follow-through. You ensure that the team own their commitments, collectively and personally.</li><li>PLAYS WELL WITH OTHERS: You recognize the strengths of your teammates and understand that we will only get where we want to go if we work together. You work with leadership to place team members on projects appropriate to their skill level and team needs.</li></ul><div><h3><strong>Your Experience</strong></h3></div><ul><li>5+ years of experience in Product or Engineering Management (or a similar) role.</li><li>Experience as the direct manager of software engineers in an agile, startup environment.</li><li>Strong problem solving and decision-making ability, with a breadth of experience in both client-side and server-side technologies.</li><li>Strong proficiency preferably in Node.js; solid professional experience in one of the following backend languages: Java, Ruby, Python, PHP also preferred.</li><li>Preference for working in rapid development cycles (2-4 weeks).</li><li>Familiarity with common tools like Git, Jira, Confluence, Jenkins/CI.</li><li>Experience with Continuous Integration/Continuous Delivery environments.</li><li>A proven track record of success in working with product managers, engineers, and various stakeholders to accomplish great things.</li><li>Familiar with modern security best practices, solutions, and technologies.</li><li>Understanding of the technical implications of complex and highly scalable applications.</li><li>The ability to dive right into a big project and manage it from start to finish.</li><li>Ability to thrive in a variable and demanding startup environment.</li><li>Comfortable in a native design environment (Sketch, Photoshop, etc.) and have a good grasp on the tools that are representative of the industry.</li></ul><div><h3><strong>Responsibilities</strong></h3></div><ul><li>You will manage a small -- yet very talented! -- team of engineers to deliver and maintain your products. Leadership responsibilities will aim to consume 20% of your time, with the remainder (80%) dedicated to frontline development.</li><li>You will be the internal subject matter expert and product owner for our Internal Tooling team, responsible for designing, developing, and sustaining a suite of tools and systems integrations.</li><li>You will manage the roadmap, refining feature ideas and maintaining existing features to drive business goals and ensure that the needs of your internal customers are being met.</li><li>Engage stakeholders in leadership, data, support, sales, and engineering and translate their needs into requirements for the various projects you'll oversee.</li><li>Coordinate across teams to maintain product and strategy alignment.</li><li>Invest in team growth and morale to build not just a product, but a team.</li><li>Adjust role specializations, process definitions, and other factors to improve scope control, quality, and velocity.</li></ul><div>&nbsp;</div><div><br></div><div><h3><strong>Benefits</strong></h3></div><div>InVision offers an incredibly unique work environment. The company employs a diverse team all over the world. In the United States we have teams including hubs in New York, San Francisco, Austin, Portland, and Boston. Each InVision team member is given the freedom and tools to do their best work from wherever they choose. Among our benefits we offer competitive health plans, 401k, a flexible vacation policy, unlimited Starbucks cards for each employee, and unlimited books related to your profession.</div><div><br></div><div>&nbsp;</div><div><br></div><div>InVision is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.</div><div></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://boards.greenhouse.io/invision/jobs/906166#.WgXqcBNSx-U' rel='nofollow'>https://boards.greenhouse.io/invision/jobs/906166#.WgXqcBNSx-U</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 10, 2017 9:47:22 PM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``work 2W from 2W wherev"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "v3xgTc7jT-SKgkSBBcOYsA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/63255/sales-manager-at-kickdynamic/",
    "title": "Sales Manager",
    "content": "Kickdynamic is changing the way that brands personalize email marketing content.<br /><br />96% of marketers know that personalization in email works, but only 6% are actually doing it regularly. Kickdynamic allows brands to personalize email content quickly and easily - increasing conversion and revenue, and saving massive amounts of time and resource.<br /><br />We work with over 100 brands globally including ASOS, TopShop, MatchesFashion, ASDA, Staples, IHG, Red Bull and with over 100,000 online brands globally - the market opportunity is huge.<br />We are looking for the best sales talent to take advantage of this opportunity and be part of a growing marketing tech company with ambition to be the market leader and expand globally.<br /><br />*What you will do:*<br /><br />* Manage multiple prospects through a clearly defined sales process from lead through to close<br />* Identifying relevant accounts, prospecting, qualification, demo, negotiation, objection handling and closing; all against a contracted revenue £ target<br />* You will be comfortable setting up and running 1-2-1 demos of the Kickdynamic platform<br />* You will be comfortable working with multiple stakeholders within a business from CMO, CRM manager and email designer, to build the right solution to help them all win.<br />* Outbound prospecting is key method to building pipeline, you must be comfortable picking up the phone and calling prospects<br />* You will enjoy the challenge of identifying relevant companies and managing an outbound prospecting process to build your own pipeline through a combination of outbound calls and tactical email<br />* Listen and understand a prospective customer’s challenges, pains and needs, and match those to the Kickdynamic Platform<br />* You understand the critical importance of building strong and clear pipeline. We have a clear pipeline process and you will need to have a clear understand of each deal so we can move it through the pipeline and be accountable for forecasting<br />* Seek feedback at every opportunity from leaders, peers and clients to continuously improve<br /><br />*How you will be successful:*<br /><br />* Prior sales success - You have a provable track record of sales success against a £ contracted revenue target. This track record could be within a software sales environment, but prior success in another target focused role is also highly relevant e.g recruitment, ad sales. Success in a high volume sales environment would be an additional plus<br />* Curiosity - You are naturally curious and enjoy the process of learning about a business's unique challenges and objectives and realize that matching those needs to a solution is what delivers sales success<br />* Ambition - You have big goals and a strong desire to be successful. You get shit done, You are self sufficient in doing so, and you realize that hitting those big goals requires the day to day consistent commitment<br /><br />*What we offer:*<br /><br />* We are a small but quick growing company, so you will have the opportunity to make your mark<br />* An exciting, dynamic and flexible work environment with option to work remotely, and travel to US, EU<br />* Competitive salary and excellent commission structure with no cap on target<br />* We are based in We Work with the best view of London, so free beer taps every day after 4pm!<br />* An ambitious, can do environment - You will be part of a company that has big goals, a strong will to win and a believe that we are on the path to building a market defining company<br /><br />*How to Apply:*<br /><br />Send an email directly to me<br />Tell me about yourself Include links or describe your previous work, or previous projects, or customers.",
    "urlFetchPending": false,
    "published": "Nov 8, 2017 3:30:45 PM",
    "tags": [
      "REMOTE1_50",
      "TITLE1_sales",
      "TZ_unknown",
      "DBG:surround``2N(work, remot) 2N OR(option, avail, allow, abl, possibl, permit)"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "7ZAadz9fSPSUiOdUD5OoFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/63241/exciting-business-development-manager-opportunity-at-trail-app/",
    "title": "Exciting Business Development Manager Opportunity",
    "content": "About us<br />At Trail, we're on a mission to make operations effortless for everyone.<br /><br /><br />Most of us use hospitality, retail and other service-sector businesses every day. Many of us will have had a job working in these sectors at some point. It’s about long hours, tough work and is run on old-fashioned admin tools. At Trail (trailapp.com), we're trying to change that.<br /><br />We’re a passionate team of 15 with a Moorgate office. After 2 years achieving product-market fit, we're now looking for enthusiastic, charismatic and passionate people ready to take us into the next stage of growth.<br /><br />Overview<br />As Business Development Manager you will work with the Head of Business Development prospecting, qualifying and generating new sales leads. You should be a highly motivated, self-starter. Able to identify and develop new business prospects from multiple sources including inbound marketing leads, prospect lists, discovery and individual research. <br /><br /><br />The Business Development Manager is expected to:<br />Develop new business via telephone, email and social media to introduce Trail to prospective clients/partners and identify appropriate buyers within the target market.<br />Follow up on leads and conduct research to identify potential prospects.<br />Conduct a needs analysis and determine pain points to build a solid business case<br />Identify key buying influencers within these prospects to determine budget and timeline.<br />Build and cultivate prospect relationships by initiating communications, meeting clients and conducting follow-up communications in order to move opportunities through the sales funnel. <br />Work with the Head of Business Development to develop and grow the sales<br />pipeline to consistently meet company goals.<br />Manage data for new and prospective clients in Trail’s CRM tool, ensuring all communications are logged, information is accurate and documents are attached.<br /><br />Requirements<br />Experience in hospitality, retail or leisure industry preferred<br />Excellent written and verbal communication skills<br />London based but we do offer remote working at least one day per week<br /><br /><br />Technical Experience<br />Understanding of Cloud-based technology<br />Experience with CRM Software preferred.<br /><br />Package<br />Competitive salary<br />33 days holiday per annum<br />Equity in company<br />MacBook and Phone<br />Great career progression opportunities<br />A great working culture, remote work, trips abroad, work outings and fun!<br /><br />Due to the high volume of applicants we have received for this role we are unable to respond to all applications, if you have not heard back from us within 14 days then unfortunately your application has been unsuccessful on this occasion. ",
    "urlFetchPending": false,
    "published": "Nov 8, 2017 1:04:06 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "REMOTE1_50",
      "TITLE1_sales",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "fmlJ8hJqQVyG-Guhe9agig",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5685-manager-internal-tools",
    "title": "InVision App: Manager, Internal Tools",
    "content": "<div>  <div>    <h2>Manager, Internal Tools</h2>      <h4>Posted Nov  6</h4>    <h3>      <span>InVision App</span><br>      <span>Headquarters: New York, NY</span><br>        <a href='https://boards.greenhouse.io/invision/jobs/906166#.WgDe9EyZO1s' rel='nofollow'>https://boards.greenhouse.io/invision/jobs/906166#.WgDe9EyZO1s</a>    </h3>  </div>    </div>  <div>    <div><a href='http://www.invisionapp.com/' rel='nofollow'>InVision</a> is the world’s leading design collaboration platform.</div><div></div><div>&nbsp;</div><div><br></div><div></div><div>We enable companies of all sizes to discover the power of design-driven product development. That’s why more than 2,000,000 designers, product managers, marketers and other stakeholders at so many of the world's most loved<a href='http://www.invisionapp.com/customers' rel='nofollow'> startups, agencies, &amp; corporations</a> use InVision every day, including Uber, Evernote, Twitter, Adobe, Salesforce and many more.</div><div><br></div><div></div><div>&nbsp;</div><div><br></div><div></div><div>Our Internal Tooling team strives to develop and maintain high quality, scalable tools and integrations, leveraged by User Enablement, Support, Sales, Training, and other teams. Candidates should be excited at the prospect of serving those teams who so faithfully serve our customers everyday.</div><div><br></div><div><h3><strong>Requirements</strong></h3></div><ul><li>THE CHOPS: You describe yourself as a jack-of-all-trades, thoroughly experienced and excited by modern technologies and services. You are a leader who manages through example and prides themselves on organization and results.</li><li>PASSIONATE ABOUT DESIGN: You understand that design makes everything possible. You are able to distinguish ‘great’ design from ‘pretty’ design. You see the difference design thinking can make in the lives of users. And you understand that even something as historically unpolished as internal tools deserve topnotch UX.</li><li>PROBLEM SOLVER: You enjoy learning how to solve problems in the most efficient way possible. Complexity doesn’t scare you. The challenge of distilling something complex into something simple invigorates and excites you.</li><li>BIASED TOWARD ACTION: You are a self-motivated, action-oriented person. You don’t sit on your hands and wait for someone else to fix a problem. If there is something you can do to make a situation better, you do it.</li><li>FOLLOWS THROUGH: From support staff, to product designers, to engineering – you speak the language of each of these archetypes. You are empathetic, concise, and consistent in your communication and follow-through. You ensure that the team own their commitments, collectively and personally.</li><li>PLAYS WELL WITH OTHERS: You recognize the strengths of your teammates and understand that we will only get where we want to go if we work together. You work with leadership to place team members on projects appropriate to their skill level and team needs.</li></ul><div><h3><strong>Your Experience</strong></h3></div><ul><li>5+ years of experience in Product or Engineering Management (or a similar) role.</li><li>Experience as the direct manager of software engineers in an agile, startup environment.</li><li>Strong problem solving and decision-making ability, with a breadth of experience in both client-side and server-side technologies.</li><li>Strong proficiency preferably in Node.js; solid professional experience in one of the following backend languages: Java, Ruby, Python, PHP also preferred.</li><li>Preference for working in rapid development cycles (2-4 weeks).</li><li>Familiarity with common tools like Git, Jira, Confluence, Jenkins/CI.</li><li>Experience with Continuous Integration/Continuous Delivery environments.</li><li>A proven track record of success in working with product managers, engineers, and various stakeholders to accomplish great things.</li><li>Familiar with modern security best practices, solutions, and technologies.</li><li>Understanding of the technical implications of complex and highly scalable applications.</li><li>The ability to dive right into a big project and manage it from start to finish.</li><li>Ability to thrive in a variable and demanding startup environment.</li><li>Comfortable in a native design environment (Sketch, Photoshop, etc.) and have a good grasp on the tools that are representative of the industry.</li></ul><div><h3><strong>Responsibilities</strong></h3></div><ul><li>You will manage a small -- yet very talented! -- team of engineers to deliver and maintain your products. Leadership responsibilities will aim to consume 20% of your time, with the remainder (80%) dedicated to frontline development.</li><li>You will be the internal subject matter expert and product owner for our Internal Tooling team, responsible for designing, developing, and sustaining a suite of tools and systems integrations.</li><li>You will manage the roadmap, refining feature ideas and maintaining existing features to drive business goals and ensure that the needs of your internal customers are being met.</li><li>Engage stakeholders in leadership, data, support, sales, and engineering and translate their needs into requirements for the various projects you'll oversee.</li><li>Coordinate across teams to maintain product and strategy alignment.</li><li>Invest in team growth and morale to build not just a product, but a team.</li><li>Adjust role specializations, process definitions, and other factors to improve scope control, quality, and velocity.</li></ul><div></div><div>&nbsp;</div><div><br></div><div><h3><strong>Benefits</strong></h3></div><div>InVision offers an incredibly unique work environment. The company employs a diverse team all over the world. In the United States we have teams including hubs in New York, San Francisco, Austin, Portland, and Boston. Each InVision team member is given the freedom and tools to do their best work from wherever they choose. Among our benefits we offer competitive health plans, 401k, a flexible vacation policy, unlimited Starbucks cards for each employee, and unlimited books related to your profession.</div><div><br></div><div></div><div>&nbsp;</div><div><br></div><div></div><div>InVision is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.</div><div><br></div><div></div><div>&nbsp;</div><div><br></div><div></div><div>&nbsp;</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://boards.greenhouse.io/invision/jobs/906166#.WgDe9EyZO1s' rel='nofollow'>https://boards.greenhouse.io/invision/jobs/906166#.WgDe9EyZO1s</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 7, 2017 12:22:44 AM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``work 2W from 2W wherev"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "ZLEiIsFTQiW36GsYZl7Izg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29988?r=rss2",
    "title": "Modern Tribe: Business Development Consultant",
    "content": "<p>Full-time</p><p><strong>(Remote)</strong> </p><p><strong>The Opportunity</strong></p><p>Modern Tribe is looking for a seasoned business development consultant person to join our growing team. This position at Modern Tribe will help the company identify leads and close deals in line with our company values. The ideal candidate for this role is someone who has been closing deals and maintaining key relationships for a successful digital agency for 2+ years and has been technically involved in online projects for 5+ years. You’ve been running projects for ages: you’ve done your own sales, have a proven track record writing proposals, know how to work with WordPress, and understand the nuances of the WordPress business world. You’ve sold projects in the $100k – $1 million+ range, and are looking to go bigger. Above all else, your daily attitude + output embody Modern Tribe’s company ethos of “live well and do good work”: you thrive on keeping the team happy and healthy. Matchmaking — not hitting sales numbers — is your jam. You hustle hard, enjoy the game and relish a genuine success. We pride ourselves on solving real problems for people rather than clutter the interwebs with more shit. If you jive with the mission of setting your team up for success, giving them the right flow and the right kind of projects, even if it means rejecting a potentially-lucrative gig…we’d love to hear from you. Modern Tribe is not interested non-technical sales candidates at this time.</p><p><strong>Who We Are </strong></p><p>Modern Tribe, Inc. is a rapidly growing software &amp; design company. We develop custom solutions for some of the world’s largest companies, government institutions and smaller growing organizations. We pride ourselves on our ability to bridge people and technology and to bring the passion and dedication of an entrepreneur to every project. Our team is composed of talented employees and freelancers around North &amp; South America (and a smattering across the globe).</p><p><strong>Who You Are </strong></p><p>We love working with each other because we have built a culture that suits us well. We work primarily with freelancers and coordinate their talents for large projects. To be on our team, you must be:</p><ul><li><strong>HAPPY</strong> Where there is a will, there is a way. Having a positive disposition allows us to achieve great things and to support each other.</li><li><strong>HELPFUL</strong> Always looking for ways that you can help others.</li><li><strong>CURIOUS</strong> It is essential that you have a passion for learning. Technology changes daily, and life has a way of constantly raising the bar.</li><li><strong>ACCOUNTABLE</strong> Our clients expect us to get the right thing done on budget and on time. Communicating expectations and meeting them is the cornerstone of success.</li></ul><p><strong>Personal Competencies </strong></p><ul><li>Impeccable communication + organization skills A deep-seated love for relationship building</li><li>A diverse background that touches on technology, design and/or strategy, not just sales</li><li>Self-motivated, detail oriented</li><li>The ability to prioritize workloads and meet deadlines</li><li>An engaging + compelling writing style Given the level of client communication involved, a near-perfect command of the English language is required</li></ul><p><strong>Knowledge &amp; Experience</strong></p><ul><li>2+ years managing sales for digital agencies</li><li>A strong, proven track record building + managing relationships</li><li>A strong design or technical background — show us that you’ve been in the mix building stuff!</li><li>A demonstrable understanding of current technologies and what solutions will/will not work for a given customer’s needs</li></ul><p><strong>Bonus Points</strong></p><ul><li>A strong command of WordPress is HIGHLY desirable, but not required if you have years of experience selling or working with a similar CMS Experience running web design and development projects &amp; managing the customer relationship</li><li>Experience closing $1 million + in annual sales Proven experience in strategy, design and/or executing major marketing initiatives</li><li>Distributed team experience is important (but not required)</li><li>A confidence + love for working remotely, and the potential social isolation that may bring</li></ul><p><strong>Responsibilities</strong></p><p>Each of Modern Tribe’s team members closes upwards of $1 million in new project work each year. The company provides a healthy pipeline to keep things rolling. Team members are also expected to be out generating leads themselves through speaking at events, blogging, local networking, etc. We don’t do cold calls — we build relationships. The Sales position at Modern Tribe is primarily focused on lead generation and managing the sales funnel through strategic proposals. Specific tasks this will involve include:</p><ul><li>Managing the inbound inquiry funnel (triage emails, answer calls, etc)</li><li>Reviewing + qualifying leads that are a good fit for Modern Tribe</li><li>Helping define + scope projects of all sizes, ranging from $100k to over $1 million++</li><li>Working directly with service team directors / leads to get estimates</li><li>Pitching the final project / proposal to the end customer Building relationships with prospective partners</li><li>Providing regular status updates on daily Sales scrum meetings</li><li>Working directly with Project Management and Strategy to handoff and oversee confirmed projects / upsell opportunities</li><li>Ensuring the internal CRM we use for tracking work stays updated + accurate</li><li>Verifying that that all workflows (proposal templates, estimate templates, etc) are documented and easily accessible</li><li>Maintaining strong, long-term relationships with customers once the project is underway</li></ul><p><strong>Location</strong></p><p>Work from anywhere in the US or Canada; if you are in Central or South America, let’s talk. This will be a 100% remote position. If your working hours are in a timezone outside of the US range, but you work 4+ hours of overlap each day our team might be able to consider your application.</p><p><strong>Compensation</strong></p><p>For this gig we are looking for both full time hires and freelance contract roles of 15-20 hours per week of work. Full time salary between $65,000 – $90,000 USD depending on experience. Keep in mind that Modern Tribe’s sales team does NOT offer commissions at this time.</p><p><strong>Perks</strong></p><p>We believe that distributed working is a way of life. We understand what it means to work remotely. We offer consistency in expectations, payment, and support. We believe in learning from each other and fostering personal growth. You can expect to learn a lot while working with us. (Also, if you work enough with us, we’ll bring you on the team trips.)</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Nov 6, 2017 9:46:21 PM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "TZ_America",
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``2W(100, remot)",
      "TITLE1_sales",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "IJ-u5eg-SeyZnBgSvcDKfw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159519/100-remote-migrations-manager-filevine-llc?a=RuRfQkQclUY",
    "title": "100% Remote Migrations Manager at Filevine LLC (Provo, UT) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise Software, Law Firms</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>The problem that I want you to solve...</strong></p><p>We are a fast growing software company building highly customizable SaaS products.&nbsp; When we close new customers, those customer have legacy systems full of data of varying quality that they want moved to our system.&nbsp; Since our system is highly customizable, some of that is repeatable and some are one off migrations.</p><p>I need a person that could manage a staff of technical people, but also can make the customer experience good one.&nbsp;&nbsp;Setting customer expectations, creating repeatable processes, dealing with internal and external people.&nbsp; That will require a firm hand and the ability to say &quot;no.&quot;.&nbsp; We currently have a backlog of customers not yet onboarded and sales are ramping up.&nbsp; This is currently a weak point in our operation and we need a person that can make this into a strength.&nbsp;&nbsp;</p><p>Challenges include varying data quality in legacy system, varying cooperation from new customer, commitments are important because new customers often have to cease operations on legacy systems and start on Filevine, creating a relatively small window, managing late process requests for changes - all of the usual migration issues.&nbsp; Key is finding the balance in all of this.&nbsp; No customer wants or will pay for perfect data but we want them happy at the end.&nbsp; That can be a moving target.</p><p>Sk<strong>ills &amp; Requirements</strong></p><p>Ability to manage a technical operation and staff - this often means a technical background</p><p>Ability to navigate the balance between pleasing customers and letting them take advantage</p><p>Ability to setup processes that are reliable</p><p>Ability to set and meet&nbsp;commitments</p><p>Ability to properly set expectations properly</p>                    </div>                            <h2>                About Filevine LLC            </h2>            <div><p>Filevine is a private software company with a product that helps law firms manage their practices. &nbsp;Filevine has two physical locations in Provo, UT and Las Vegas, NV for sales and support.&nbsp; &nbsp;&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 100% Remote Work                            </div>                            <div>                                 Jerk-free Environment                            </div>                            <div>                                 Normal stuff like Health Insurance, Paid Time Off and 401K                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_database",
      "DBG:surround``2W(100, remot)",
      "DBG:surround``benefit 2N 2N(remot,work)",
      "TITLE1_sales",
      "REMOTE1_100",
      "TECH2_etl",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "database",
      "etl"
    ]
  },
  {
    "id": "28EpFwYJTX6gjZi1Yk-pBQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/155101/sre-manager-platformsh?a=Q0ZKJIH6fqU",
    "title": "SRE Manager at Platform.sh () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead, Manager</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Continuous Delivery, PaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Directly reporting to our CTO and in close interaction with our Compliance, Engineering and Infrastructure Operations teams, you will be responsible for:</p><ul><li>high availability of platforms, their up-scaling and automatization (auto-remediation, auto-scaling, predictive maintenance, …)</li></ul><ul><li>creating and standardizing systems, tools &amp; processes that will enhance our support and operations efficiency</li></ul><ul><li>improving service quality, discipline and reliability throughout lifecycle</li></ul><ul><li>monitoring operating objectives, streamline and automate intervention</li></ul><ul><li>continuous learning from Operations experience, modeled as software</li></ul><ul><li>supporting technical teams and promoting SRE good practice in the organization</li></ul><ul><li>eventually, creating and managing a team of SREs</li></ul><p><strong>Must have :</strong></p><p><span>The ideal candidate:</span></p><ul><li><span>has proven firm-wide successful experience in managing infrastructure</span></li></ul><ul><li><span>has demonstrated the ability to successfully manage cloud-based infrastructure for a fast growing organization</span></li></ul><ul><li><span>has e</span><span>xperience with containerization technologies</span></li></ul><ul><li><span>has had exposure to cloud services (AWS)</span></li></ul><ul><li><span>understands how an OS works, knows networking, how git works, and the constraints of a distributed system</span></li></ul><ul><li><span>is proficient in Python</span></li><li><span>likes solving problems once, hates anything manual and repetitive</span></li><li><span>ambitious &nbsp;and courageous with a cool head </span></li></ul><p><strong>Nice to have :</strong></p><ul><li><span>experience with Golang !</span></li></ul><ul><li><span>proficiency in Rust, Elixir or Haskell</span></li></ul><ul><li>k<span>nowledge of Magento Ecommerce, Symfony, Drupal, eZ Platform, or Typo3 (a lot of our customers run those)</span></li><li><span>working knowledge of Puppet &amp; Fabric</span></li></ul><ul><li><span>public speaking experience</span></li><li><span>mad Debian skillz !</span></li></ul>                    </div>                            <h2>                About Platform.sh            </h2>            <div><p>Platform.sh offers a groundbreaking hosting and development tool for web applications.</p><p>We’re a European VC-Backed startup with a host of blue-chip Enterprise clients and a string of awards and grants (including €2m from the EU Horizon 2020 program).</p><p>To reinforce our technical prowess, we are looking to grow our engineering team with our sole SRE who has knows Python, has a taste for Go, with good Linux system understanding, and a real hunger for the challenges of building robust, distributed systems.</p><p>If you’re looking for an exciting, high-growth opportunity with an award-winning, cutting-edge company, this could be just the job for you.</p><p>Platform.sh is a PaaS shrouded in a lot of black magic. We can consistently clone a whole running cluster, with its state, databases, indexes in a matter of seconds. We want to get this down to the hundreds of milliseconds domain. Interested? There is more...</p><p>Our external API is pure Hypermedia REST + oAuth on top of Pyramid. It mechanizes the Git layer and needs more features.</p><p>We can consistently generate from the same manifest a Docker container, an LXC one, or VM disk images (AWS, Azure, OpenStack), we want more targets.</p><p>We probably have the highest industry container density. We need to get it higher.</p><p>We support any Python, Ruby, NodeJS, Golang, Java or PHP application, it’s time to roll-out .NET, and Elixir, of course Elixir.</p><p>We need to have more auto-healing on the high-availability clusters. We need more performance out of our multi-protocol ssh proxy. We need to work on our Ceph Implementation; We need to get the Debian package generation streamlined and faster.</p><p>We need… great ideas on how to make Platform.sh even better.</p><p>Interested?</p><p>Join us!</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from home, wherever you are                            </div>                            <div>                                 Safe and friendly working environment                            </div>                            <div>                                 Stock options for everyone                            </div>                            <div>                                 Rest and recovery are essential to health and happiness; we get that                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_python",
      "TECH2_amazon-web-services",
      "TITLE1_sales",
      "REMOTE1_100",
      "TECH2_rust",
      "TZ_unknown",
      "DBG:surround``work 2W from 2W wherev",
      "TECH2_elixir",
      "TECH2_go"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "elixir",
      "go",
      "python",
      "rust"
    ]
  },
  {
    "id": "oJ0WbfsIRwuTNGy91-RKIw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5641-educational-sales",
    "title": "The Art of Applying: Educational Sales",
    "content": "<div>  <div>    <h2>Educational Sales</h2>      <h4>Posted Oct 31</h4>    <h3>      <span>The Art of Applying</span><br>      <span>Headquarters: Austin, TX</span><br>        <a href='http://theartofapplying.com/sales' rel='nofollow'>http://theartofapplying.com/sales</a>    </h3>  </div>    </div>  <div>    <div>Want to&nbsp;<strong>work remotely</strong>&nbsp;in a&nbsp;<strong>fun, fulfilling, and challenging role</strong>&nbsp;for a company that helps high-potential college students and working professionals gain admission to their&nbsp;dream schools and scholarships?</div><div><br></div><div>Want to<strong>&nbsp;earn $5000+ per month</strong>&nbsp;and speak to ambitious dreamers and future leaders from all over the world every day?<span><br></span></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div><span>As one of my Breakthrough Coaches,</span><span>&nbsp;</span><strong>YOU would be the person on our team that the prospective client would speak to first.</strong><span>&nbsp;</span><span>Your job would be to</span><span>&nbsp;</span><strong>listen to the person’s story</strong><span>—both personal and professional,</span><span>&nbsp;</span><strong>ask them lots of questions</strong><span>&nbsp;</span><span>to understand their strengths, weaknesses, and worries (we’ll give you the questions to ask), and then</span><span>&nbsp;</span><strong>address their doubts and fears one by one</strong><span>&nbsp;</span><span>about moving forward.</span></div><div><br></div><div><span>I’m looking for a</span><span>&nbsp;</span><strong>passionate, persuasive, committed person</strong><span>&nbsp;</span><span>who can speak to these</span><span>&nbsp;</span><strong>eager and excited prospective clients</strong><span>&nbsp;</span><span>and help me decide if the client is a great fit for our program as well as help&nbsp;the right people commit to working with us on their grad school applications.</span></div><div><span><br></span></div><div><span><b>Apply to join our team if you have these qualities:</b></span></div><div><span><br></span></div><ul><li><strong>You are available to work full time Monday – Friday from 9 am - 6 pm Central Time.</strong></li><li>You are able to attend our&nbsp;<strong>daily (Monday – Friday) 1-hour sales team</strong>&nbsp;<strong>motivation and mentorship meeting at 9 am CST.</strong></li><li><strong>You value education.</strong>&nbsp;You do not need to have a college degree from a prestigious school nor a graduate degree for this position, but you cannot be a person who thinks that college or grad school is a waste of time.</li><li><strong>You are a positive person.&nbsp;</strong>You know how to find the good in adverse situations. Hearing “no” or “I need to think about it” several times a day can be discouraging, and you need to be able to bounce back from rejection and bring your full self to the next call.</li><li><strong>You are a person who follows through on her commitments.&nbsp;</strong>You don’t jump ship or give up when things get hard.</li><li><strong>You like speaking on the phone.&nbsp;</strong>You know how to connect and communicate well with people you cannot see face-to-face.</li><li><strong>You like people.&nbsp;</strong>You do not have to be an extrovert for this position, but you must like speaking with people (on a 1-on-1 basis), connecting with people, and helping people.</li><li><strong>You are detail-oriented</strong><strong>.</strong>&nbsp;You will be making 3-5&nbsp;90-minute Breakthrough phone calls every single work day. Each call will be with a different person with their own particular story, triumphs, and challenges, but there will be a SCRIPT and a METHOD that you must stick to for EVERY SINGLE CALL.</li><li><strong>You are an honest person with high integrity.&nbsp;</strong>You must be willing to turn people away who are not a good fit for our program, even it means that you won’t get a commission for that sale. Making sure we work with the right people (and not just with anyone) has to be more important to you than making as much money as possible.</li><li><strong>You have consistent access to reliable internet.</strong>&nbsp;Our team is primarily remote, so you’ll need your own laptop and reliable internet connection.</li></ul><div><h2><br></h2></div><div><h2>How to apply:</h2></div><div><br></div><div><h2>STEP ONE: Fill out the application at this link:&nbsp;<a href='http://theartofapplying.com/sales' rel='nofollow'>http://theartofapplying.com/sales</a></h2><h2>STEP TWO: Take the DISC&nbsp;<a href='http://theartofapplying.com/disc' rel='nofollow'>at this link</a><span>&nbsp;and submit your results via the form.</span></h2></div><div><h3><br></h3></div><div><b>About the person hiring for this role:</b></div><div><br></div><div>I’m&nbsp;<strong>Kaneisha Grayson</strong>, and I’m the founder of The Art of Applying. My team and I help people from around the world apply to the&nbsp;<strong>world’s top graduate schools to study business, public policy, law, urban planning, public health, education, and design</strong>. Since 2010, we have helped our clients win over&nbsp;<strong>$9 million in merit scholarships</strong>.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Submit your application to <a href='http://theartofapplying.com/sales' rel='nofollow'>http://theartofapplying.com/sales</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 8:08:56 PM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "IK0Z7kkMSv6CfN7a2Ed2sA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5626-outbound-hosting-sales-commission",
    "title": "Pressable: Outbound Hosting Sales (Commission + Salary)",
    "content": "<div>  <div>    <h2>Outbound Hosting Sales (Commission + Salary)</h2>      <h4>Posted Oct 27</h4>    <h3>      <span>Pressable</span><br>      <span>Headquarters: San Antonio</span><br>        <a href='https://pressable.com/careers/' rel='nofollow'>https://pressable.com/careers/</a>    </h3>  </div>    </div>  <div>    <div>Pressable, a leading provider of WordPress hosting, is looking for driven individuals to join our remote team as a Sales Specialist. This is an outbound sales position. Compensation is salary plus commission. In addition to strong technical sales skills, you’ll need a working knowledge of WordPress to succeed in this role.</div><div><br></div><div>Requirements for this role include:</div><div><br></div><ul><li>Identifying leads using technographic data and other means.</li><li>Building a pipeline.</li><li>Travelling to industry events.</li><li>Being a thought leader, sharing opinions based on customer feedback with our team.</li><li>Coordinating with team members and leads to get estimates.</li><li>Working with an Account Manager to ensure that customers are successful and stay with Pressable.</li><li>Reporting to management and executives on a regular basis.</li></ul><div><br></div><div>An Sales Specialist should have the following skills and experiences:</div><div><br></div><ul><li>Familiar with WordPress and the WordPress Community.</li><li>Demonstrable success in B2B technical sales. Non-technical salespersons should not apply.</li><li>A self-starting approach to work.</li><li>Strong troubleshooting and problem solving skills.</li><li>Excellent written and verbal communication skills, possessing the ability to clearly communicate through text-based chat, video conferencing and phone calls.</li></ul><div><br></div><div>Preference will be shown to candidates with experience selling WordPress at a hosting company or digital agency.</div><div><br></div><div>We may invite an applicant to complete a limited-time “trial” project as part of the hiring process. A trial is an opportunity for our team to get hands-on experience working with an applicant and evaluating their work. We pay applicants a standard rate of $15/hour while they work as a contractor to complete their trial project.</div><div><br></div><div>We ask everyone who applies to be authorized to work in the United States. When you apply, please provide a detailed description of your past experience in technical sales.</div><div><br></div><div>Our benefits our great. You can expect:</div><div><br></div><ul><li>Flexibility. Our team is remote, meaning you can work from anywhere you want as long as you have an internet connection.</li><li>Medical, dental, vision, and life insurance for less than $10. We pay 99% of premiums for you and your family.</li><li>401(k) matching. We match your 401(k) contributions up to 6% of your salary.</li><li>A generous time off policy. We want our team members to enjoy a phenomenal work–life balance.</li></ul><div><br></div><div><strong>Let us know you're interested!</strong></div><div><br></div><div><a rel='nofollow'> Submit Your Application Now</a></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://pressable.com/careers/apply/' rel='nofollow'>https://pressable.com/careers/apply/</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 27, 2017 9:44:24 PM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "D4i67Lj1Q1SSjQveMpUdAg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62325",
    "title": "Sales Assistant",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong><em>US Based Applicants Only. Not hiring in Washington state, Oregon state, San Francisco, or New York.</em></strong><br><br><br></p><p>Simply put, we make websites easier to use. Through a scientific method of determining which site improvements result in actual performance improvements, we replace the old way of designing sites through gut feel and management opinions with designing sites through data. Tactically speaking, clients come to us for both strategic direction and to supplement their internal teams.<br><br><br></p><p>We struggled with what to call this job since while the core of the job is sales assistant, the job will also be what you make of it. We refer to our current sales assistant, Jill Mendoza, as our “Jill of all trades” and she has a small picture of Wonder Woman as the :jill: emoji in our slack instance. Unfortunately, we have grown too big for Jill to be able to do everything, so we need more help.<br><br><br>Here are a few of the many, diverse tasks that you'll be potentially doing:<br><br></p><ul><li>Working to make sure quarterly client reviews are on track, and scheduling them with the clients<br></li><li>Creating sales decks with our CEO and 2 VPs of business development<br></li><li>Creating proposals with our CEO and 2 VPs of business development<br></li><li>Ensuring contracts are signed by all parties and facilitating handoffs between business development and the product management team<br></li><li>Various marketing tasks such as updating the website, sending out newsletters, posting jobs for sales assistants, etc (how meta!)<br></li><li>Helping to arrange team travel and client dinners<br></li><li>Competitive research and general LinkedIn research<br><br><br><br><p>Our most successful candidates have the following skills/experience/traits:<br><br><br></p></li><li>Ability to get things done with little direction<br></li><li>Worked cross-functionally in a highly collaborative environment, preferably in a remote capacity<br></li><li>Genuinely like working with clients and their distributed stakeholder group<br></li><li>Lifelong learner<br><br>If you’re interested in checking out the swell people you’ll be working with, click here <a href='https://crometrics.com/meet-the-team/' rel='nofollow'>to learn more about the team.</a><br><br><em>If you have questions as you go through this, make notes and if we haven’t answered them by the end, feel free to email chris@crometrics.com or tom@crometrics.com.</em><br><br><br></li><li><strong>We’re a remote company.</strong> We are spread out all over the country and enjoy the flexibility remote working affords. Want to go on a mountain bike ride in the middle of the day? Cool, don’t forget your helmet! Need to pick the kids up from school? Nice, you’ve got parent of the year in the bag. We stay connected through Slack and workcations, including one annual trip that is funded by the company.<br></li><li><strong>Our engineers value elegant code, but move fast.</strong> We’re writing code that runs on top of existing websites. Some tests only run for a few days before disappearing (though some do so well they become a permanent part of the client’s site). If “minimum viable product” isn’t in your lexicon, you aren’t a good fit.<br></li><li><strong>Communication is critical.</strong> We’re a remote company. That makes communication — including writing and reading comprehension — extremely important. You’ll work closely with engineers, designers and writers. This is not a simple “write specs and close tickets” gig. Successful applicants enjoy the process of defining and clarifying specs, documenting processes, improving processes, seeing their ideas and work affect millions of users, and uploading custom emoji to Slack.<br></li><li><strong>We’re relentlessly focused on our client’s happiness.</strong> The PM is a client-facing role. Managing a client relationship virtually takes a different type of skill set – the PMs have to be both a strategic partner, the customer (represented by the data), teacher and project manager over the phone/email/Slack, all while delivering an exceptional level of service. This type of interaction is not for everyone, and we completely understand. It’s not easy!<br></li><li><strong>We are not perfect.</strong> At the core of experimentation is the lesson to be learned from the test, whether a win, loss or inconclusive. We extend this concept to everything we do by setting the bar high for our team and fostering an environment of radical candor and constant learning.<br><br>This short essay sums up the philosophy we operate by: This is Professionalism: <a href='http://arches.io/2014/03/this-is-professionalism/' rel='nofollow'>http://arches.io/2014/03/this-is-professionalism/</a> <em>Sound like something you are interested in? Read on.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 26, 2017 12:20:10 AM",
    "tags": [
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "4NyXQ4SAQKSOki7VhM566g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/62825/business-development-associate-at-causalens/",
    "title": "Business Development Associate",
    "content": "Business Development Associate - Full Time (Remote)<br /><br />Summary<br /><br />We are looking for a motivated and high-achieving individual based in Europe to join the team working on expansion of the company in global markets. This is a full time placement with significant opportunities for growth, travel and advancement as one of the first employees of the company.<br /><br />The Company<br /><br />causaLens is high-tech startup based in London. We are bringing machine learning and big data technologies to the World’s leading asset managers. We are an extraordinary team and the founders have worked for some of the most prominent global hedge funds and scientific institutions. <br /><br />Core requirements<br /><br />* Highly capable, self-motivated, collaborative and personable <br />* Strong academic record <br />* Strong commercial skills gained from a professional background <br />* Interest in advanced technologies such as machine learning <br />* Able to demonstrate integrity, drive and natural curiosity<br />* An excellent written and verbal communicator with a high level of business acumen<br />* Ability to effectively work remotely (from home or coworking space) <br /><br />Roles and Responsibilities:<br /><br />* The role is varied and involves a combination of strategic & critical thinking, analysis and engagement with internal and external stakeholders. <br />* You will identify new opportunities and manage the full sales cycle from finding new prospects through to closure.<br />* You will be developing and maintaining value-based relationships with our customers.<br />* You will work directly with the CEO on developing and evaluating new opportunities. <br /><br />Benefits<br /><br />Successful candidate will have the opportunity to join a fast-growing, agile, and international team passionate about innovation and making a difference.  We will offer guidance, mentorship, and opportunities for professional development. <br />",
    "urlFetchPending": false,
    "published": "Oct 25, 2017 7:20:35 AM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "REMOTE1_50",
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "TZ_Europe",
      "TITLE1_sales"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "HvkXsBnORym2o71NIg4m4A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5595-insurance-sales-representative",
    "title": "Auto Insurance Specialists: Insurance Sales Representative",
    "content": "<div>  <div>    <h2>Insurance Sales Representative</h2>      <h4>Posted Oct 23</h4>    <h3>      <span>Auto Insurance Specialists</span><br>      <span>Headquarters: Remote-Georgia</span><br>        <a href='http://www.aisinsurance.com/jobs' rel='nofollow'>www.aisinsurance.com/jobs</a>    </h3>  </div></div>  <div>    <div><b><strong>Insurance Sales Representative</strong></b></div><div></div><div><span>AutoInsurance Specialists</span><span><br></span></div><div></div><div></div><div></div><div><br></div><div></div><div><span>Excellent inside salescareer opportunity with tremendous earning potential for a sales orientedindividual in a stable industry.&nbsp; Greatopportunity with the potential to earn $50k-$70k the first year!</span><span>&nbsp;</span></div><div></div><div><br></div><div></div><div><span>We are currentlyrecruiting dedicated, outgoing professionals who are interested in a salescareer. This position is a full-time remote opportunity that requires a homeoffice in the state of Georgia.&nbsp; The selectedcandidate will receive paid training during which you’ll: </span><span><br></span></div><div></div><div></div><div><span>&nbsp;</span><span><br></span></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Observe &amp; train withexperienced Sales Reps</span><br></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Receive personalizedtraining and ongoing feedback to ensure success in the program</span><br></div><div></div><div></div><div><span><br></span></div><div><span>&nbsp;</span><span><br></span></div><div></div><div></div><div><b><strong>Job Requirements</strong></b><b><strong><br></strong></b></div><div></div><div><b><strong><br></strong></b></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Must be able to work aSaturday-Wednesday schedule</span><br></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>High School diploma or itsequivalent.&nbsp; College degree preferred.</span><br></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Licensed in home state andinsurance experience</span><br></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Sales-driven and goaloriented with a focus on achieving sales success<br></span></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Passion for people anddeveloping sales relationships </span><br></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Home office set-up andprior experience working remotely (or great self-management skills)<br></span></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Excellent oral and writtencommunication skills </span><br></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Ability to be persuasiveover the phone </span><br></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Self-motivated and able towork independently<br></span></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Excellent time management and organizational skills<br></span></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Computer literacy required</span><br></div><div></div><div></div><div><b><strong><br></strong></b></div><div><b><strong><br></strong></b></div><div><b><strong>We Offer a Fantastic Compensation Program and Benefits!</strong></b></div><div><br></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Competitive base pay,commission and bonus compensation<br></span></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Company provided inbound leads<br></span></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;&nbsp; </span></span><span>Benefit package includesmedical, dental, vision, 401k, paid time off</span></div><div><br></div><div></div><div><i><em>Apply today for a career at AIS as a Sales Representative! </em></i></div><div><br></div><div></div><div><b><strong>About Our Company</strong></b></div><div><br></div><div></div><div><span>AIS is one ofthe&nbsp;fastest growing national personal lines insurance agencies&nbsp;thatoffers&nbsp;our customers the best combination of price and quality coverage. Since1968, whatever your insurance needs, we have you covered.&nbsp; </span><span><br></span></div><div></div><div></div><div><span>&nbsp;</span><span><br></span></div><div></div><div></div><div><span>AIS is anindependently-operated and wholly-owned subsidiary of Mercury Casualty Company,a California corporation. We are an equal opportunity employer committed to adiverse workforce and do not discriminate on the basis of race, gender, sexualorientation, age, national origin, religion, disability, veteran status, orother protected status.</span><span><br></span></div><div></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply via direct link:<a href='https://recruiting2.ultipro.com/MER1016MIS/JobBoard/b186b598-4595-4aab-a590-9fe45099a96c/OpportunityDetail?opportunityId=6cfad273-d06a-4f6d-8294-11401ed11dfb' rel='nofollow'>https://recruiting2.ultipro.com/MER1016MIS/JobBoard/b186b598-4595-4aab-a590-9fe45099a96c/OpportunityDetail?opportunityId=6cfad273-d06a-4f6d-8294-11401ed11dfb</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 24, 2017 1:11:15 AM",
    "tags": [
      "DBG:surround``headquart 3N remot",
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "wajIQhLrSGCDvEJzKZCHDQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3941-sales-engineer-open-source-wallaroo-labs",
    "title": "Sales Engineer Open Source @ Wallaroo Labs",
    "content": "<h2>              Sales Engineer Open Source<small> @ Wallaroo Labs</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-23 03:07</p></dd>          <dt><span>Description</span></dt>          <dd><p>Wallaroo Labs is working on a huge idea, and this is a phenomenal opportunity for a person who enjoys challenges. We believe in open source and strive to build on these technologies. Our distributed team is ten people and growing. We had have generated a lot of interest through our product and vision and raised a large seed round with several well-known VCs.</p><p>Faster data, more data sources, and business requirements are driving increasingly sophisticated algorithms and putting more and more demands on data applications. Wallaroo Labs solves these problems with Wallaroo, a data engine for building highly elastic big data applications.</p><p>We are looking for a Sales Engineer to drive the adoption of Wallaroo open-source offering within the developer community. This position is essential to our success; you will be responsible for identifying friction points with Wallaroo and systematically eliminate to improve the developer experience.</p><p>Although Wallaroo's headquarters is in New York, this position can be remote.  Candidates located in a Tech Hub cities or that have deep connections within existing developer networks would prove invaluable in building our community.</p><p><strong>Responsibilities</strong></p><ul><li>Provide support to sales team by running demos via remote session</li><li>Monitor communication channels (HN, Reddit, StackOverflow, Mailing lists, IRC) and interact with the community, answer questions and assist developers.</li><li>Identify and build relationships with the developer community, meetups, and conferences and leverage relationships to evangelize Wallaroo.</li><li>Own problem resolution and participate with the development team to create solutions.</li><li>Publish content from blog posts to video demos.</li></ul><p><strong>Qualities we are looking for</strong></p><ul><li>Experience working on a commercialized open source project (Spark, Cassandra, MongoDB etc.)</li><li>Ability to learn new technologies quickly.</li><li>Comfortable with a variety of programming languages, experience with Python, Go, JavaScript are a plus.</li><li>Familiar with Big Data technologies.</li><li>Desire and ability to work with enterprise clients and our open source community.</li><li>Experience working with open source software, GitHub etc.</li><li>Familiar with software development process in a business setting.</li><li>Outstanding verbal and written communication skills.</li></ul><p><strong>Learn more about Wallaroo</strong></p><ul><li>Corporate site: <a href='http://www.wallaroolabs.com' rel='nofollow'>http://www.wallaroolabs.com</a></li><li>Wallaroo Community Site: <a href='http://www.wallaroolabs.com/community' rel='nofollow'>http://www.wallaroolabs.com/community</a></li><li>Wallaroo Blog: <a href='https://blog.wallaroolabs.com/' rel='nofollow'>https://blog.wallaroolabs.com/</a></li><li>GitHub: <a href='https://github.com/WallarooLabs/wallaroo' rel='nofollow'>https://github.com/WallarooLabs/wallaroo</a></li></ul><p><em>We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:07:17 AM",
    "tags": [
      "REMOTE1_50",
      "DBG:surround``can 2W remot",
      "TITLE1_sales",
      "TZ_unknown",
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "yzk14JeETEWgC64L8FL3Kw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62241",
    "title": "Sales Engineer Open Source",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Wallaroo Labs is working on a huge idea, and this is a phenomenal opportunity for a person who enjoys challenges. We believe in open source and strive to build on these technologies. Our distributed team is ten people and growing. We had have generated a lot of interest through our product and vision and raised a large seed round with several well-known VCs.<br><br>Faster data, more data sources, and business requirements are driving increasingly sophisticated algorithms and putting more and more demands on data applications. Wallaroo Labs solves these problems with Wallaroo, a data engine for building highly elastic big data applications.<br><br>We are looking for a Sales Engineer to drive the adoption of Wallaroo open-source offering within the developer community. This position is essential to our success; you will be responsible for identifying friction points with Wallaroo and systematically eliminate to improve the developer experience.<br><br>Although Wallaroo's headquarters is in New York, this position can be remote. Candidates located in a Tech Hub cities or that have deep connections within existing developer networks would prove invaluable in building our community.<br><br><strong>Responsibilities</strong><br><br></p><ul><li>Provide support to sales team by running demos via remote session<br></li><li>Monitor communication channels (HN, Reddit, StackOverflow, Mailing lists, IRC) and interact with the community, answer questions and assist developers.<br></li><li>Identify and build relationships with the developer community, meetups, and conferences and leverage relationships to evangelize Wallaroo.<br></li><li>Own problem resolution and participate with the development team to create solutions.<br></li><li>Publish content from blog posts to video demos.<br><br><strong>Qualities we are looking for</strong><br><br></li><li>Experience working on a commercialized open source project (Spark, Cassandra, MongoDB etc.)<br></li><li>Ability to learn new technologies quickly.<br></li><li>Comfortable with a variety of programming languages, experience with Python, Go, JavaScript are a plus.<br></li><li>Familiar with Big Data technologies.<br></li><li>Desire and ability to work with enterprise clients and our open source community.<br></li><li>Experience working with open source software, GitHub etc.<br></li><li>Familiar with software development process in a business setting.<br></li><li>Outstanding verbal and written communication skills.<br><br><strong>Learn more about Wallaroo</strong><br><br></li><li>Corporate site: <a href='http://www.wallaroolabs.com' rel='nofollow'>http://www.wallaroolabs.com</a></li><li>Wallaroo Community Site: <a href='http://www.wallaroolabs.com/community' rel='nofollow'>http://www.wallaroolabs.com/community</a></li><li>Wallaroo Blog: <a href='https://blog.wallaroolabs.com/' rel='nofollow'>https://blog.wallaroolabs.com/</a></li><li>GitHub: <a href='https://github.com/WallarooLabs/wallaroo' rel='nofollow'>https://github.com/WallarooLabs/wallaroo</a><br><em>We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:07:17 AM",
    "tags": [
      "REMOTE1_50",
      "DBG:surround``can 2W remot",
      "TITLE1_sales",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "-b4ZuwTsRXqvoO5BA-RE5g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5592-sales-trainer",
    "title": "Remote Year: Sales Trainer",
    "content": "<div>  <div>    <h2>Sales Trainer</h2>      <h4>Posted Oct 23</h4>    <h3>      <span>Remote Year</span><br>      <span>Headquarters: Worldwide</span><br>        <a href='https://remote-year.breezy.hr/p/a55eb89b6038-sales-trainer?source=remoteyear' rel='nofollow'>https://remote-year.breezy.hr/p/a55eb89b6038-sales-trainer?source=remoteyear</a>    </h3>  </div>    </div>  <div>    <div><span><b>Remote Year</b></span></div><div><span><b><br></b></span></div><div>Remote Year brings together communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend a year working, traveling, and exploring 12 cities around the world. Spending one month in each location, communities connect with local cultures and business ecosystems, forming lifelong, borderless personal and professional relationships along the way. Together we will shape the future of work.</div><div><b><br></b></div><div><span><b>Role Description</b></span></div><div><span><b><br></b></span></div><div>We’re looking for an experienced Sales Trainer to educate and train our growing sales team ensuring our reps have the knowledge of the Remote Year product, systems, and processes. Working closely with our Director of Sales Operations, Head of Admissions and Head of Sales, our Sales Trainer will be responsible for executing on the Remote Year sales effectiveness strategy. You will bring your expertise in creating our sales onboarding training and ongoing curriculum for our entire salesforce - touching B2B and B2C Reps, Account Executives, and Customer Success Executives. The Sales Trainer will also be responsible for designing and conducting monthly classes with programs designed to ramp up new sales hires and dedicate specific tracks for each sales team. You’ll be a true sales coach with a passion for process and helping others thrive in an autonomous workplace. You'll drive the statregy towards developing and mentor a team of smart, talented, and passionate sales representatives.</div><div><br></div><div><span><b>Responsibilities:</b></span></div><div><span><b><br></b></span></div><ul><li>Develop a deep understanding of our sales organizations procedures, practices, processes, products, systems, technology, and culture to incorporate into training initiatives for each and every salesperson at Remote Year.<br></li></ul><ul><li>Sales Training - build out a curriculum of formal and informal training sessions covering new hire sales training, product launches, sales skills training, ongoing skill development, sales boot-camps, internal process updates, etc.<br></li><li>Sales Methodology &amp; Onboarding - after learning the sales methodology yourself, build an effective onboarding and ongoing training program to ensure the continuous development of our sales force.<br></li><li>Gather metrics and analyze data to assess sales organization-wide developmental needs to drive &amp; support proactive training initiatives.<br></li><li>Actively search, creatively design and implement effective methods to educate, enhance performance and recognize performance.<br></li><li>Prioritizes coaching and performance management efforts to have the greatest overall impact on the business.<br></li><li>Identifies deficiencies in skills among sales associates, and work with Management teams to improve individual's capabilities through coaching, development, and training.<br></li><li>Builds peer support and strong internal-company relationships with other key management personnel.<br></li></ul><div><br></div><div><span><b>Required Qualifications:</b></span></div><div><span><b><br></b></span></div><ul><li>Minimum 1-3 years building sales training and curriculum programs from scratch, particularly for distributed sales teams.<br></li><li>Previous Leadership experience aligning with the business to identify emerging training needs (re: sales process and/or technical); designing and implement effective learning programs, often working with senior stakeholders.<br></li><li>Strong presentation and project management skills.<br></li><li>Solid understanding of learning tools and platforms, salesforce, project management and sales content creation.<br></li><li>Strong verbal and written communication skills.<br></li><li>Able to perform at a high level, in a fast pace, start-up work environment.<br></li><li>Outstanding analytical, problem-solving, organization, prioritization and multitasking skills.<br></li><li>A flawless record of personal and professional integrity.<br></li></ul><div><br></div><div><b>Preferred Qualifications:</b></div><div><b><br></b></div><ul><li>Bachelor's Degree from an accredited institution in Business, Communications, or Marketing.<br></li><li>Experience with fully distributed workforce.<br></li><li>Experience in an inbound sales environment.<br></li><li>Experience with experience product sales.<br></li><li>Experience with consultative sales approach.<br></li><li>Knowledge of Sandler Sales Methodology.</li></ul><ul></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Submit your resume and drop us a note explaining what excites you about the role and joining the Remote Year team. We love cover letters and read each and every one.</p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 4:42:52 AM",
    "tags": [
      "DBG:surround``headquart 3N remot",
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "f_T7JMSdTX6KNmBkn7ro1Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5576-sales-engineer",
    "title": "iMerit Technology Services: Sales Engineer",
    "content": "<div>  <div>    <h2>Sales Engineer</h2>      <h4>Posted Oct 19</h4>    <h3>      <span>iMerit Technology Services</span><br>      <span>Headquarters: Saratoga, CA</span><br>        <a href='http://www.imerit.net' rel='nofollow'>http://www.imerit.net</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>About iMerit</span><br></div><div></div><div></div><div></div><div><span>iMerit is a unique for-profit company with a social impact mission. We specialize in providing data services to global clients. Founded by successful entrepreneurs in Silicon Valley, we employ marginalized youth and women who have been trained in digital skills. This workforce provides critical services such as data enrichment, sentiment analysis, and data classification.</span></div><div><br></div><div><span>Our customers range from large, enterprise organizations to high-impact tech and e-commerce companies. We work with their most innovative teams in Machine Learning, Computer Vision, Product Experience and Data Science. </span></div><div><br></div><div><span>Our funders include Omidyar Network and the Michael and Susan Dell Foundation. &nbsp;With 800+ employees, we are an agile and fast-paced global startup with growing revenues and hands-on leadership.</span></div><div><br></div><div><span>About the Role</span><br></div><div></div><div></div><div></div><div><span>As a Sales Engineer, you are working closely with the Sales team’s efforts to engage with prospective clients and translate their often custom requirements into a full-fledged end-to-end data processing solution.</span></div><div><br></div><div><span>In order to establish new processes, you will be working with the Sales team, prospective and current clients, and the India-based Project Delivery team. You will also have the opportunity to design, coordinate, and product manage in-house development of custom tools, platforms, and workflows.</span></div><div><br></div><div><span>This is a role for self-directed learners, creative thinkers, and workplace chameleons. You will need to be adaptive, curious and resourceful and enjoy working with a diverse young team.</span></div><div><br></div><div>Location: work remotely from United States. Needs legal work permit for US.</div><div><br></div><div>Salary: $60,000 to $90,000</div><div><br></div><div><span>Responsibilities:</span><br></div><div></div><div></div><div></div><ul><li><span>Work with customers and prospective customers to deeply understand their proposed use case(s) and propose solutions based on iMerit’s core offerings, technology, and workforce capability</span><br></li><li><span>Lead newly engaged customers through any technical sales consultation and project implementation phase, while building trust in the solutions offered by iMerit</span><br></li><li><span>Work as the bridge between Sales, guiding their understanding of project implementation, and Project Delivery (responsible for actually delivering quality work). This requires a strong ability to multi-task, and switch gears between teams with competing priorities. </span><br></li><li><span>Provide consultative proposals and findings to clients in an organized and accessible manner. This includes a combination of data analysis, development of workflow proposals, and the ability to clearly map out process and values provided by the iMerit team. While heavily consultative, the ability to win (and maintain) client trust is of great importance. </span><br></li><li><span>Manage multiple projects simultaneously, including the project design, development, implementation, and delivery</span></li></ul><div><br></div><div><span>Required Experience/Skills:</span><br></div><div></div><div></div><div></div><ul><li><span>Minimum 3 years experience and success working in a customer-facing role</span><br></li><li><span>Prior experience managing a variety of projects and accounts, at different stages of development </span><br></li><li><span>Ability to work interculturally and in a distributed team </span><br></li><li><span>Interest (and openness) to travel (India and California)</span><br></li><li><span>Self-directed learner and hands-on problem solver</span><br></li><li><span>Comfortable working with numbers and data</span><br></li><li><span>Prior experience in Account Management, Project Management, Customer Success or Pre-Sales Consultation</span><br></li><li><span>Desire to learn independently about market trends, technology, and concepts in Machine Learning/Data Science field</span><br></li></ul><div><br></div><div><span>Ideal Candidate Traits/Experience:</span><br></div><div></div><div></div><div></div><ul><li><span>Experience working for an international company</span><br></li><li><span>Experience working with remote teams</span><br></li><li><span>Experience working in/with India</span><br></li><li><span>Prior work history with crowd-sourcing/outsourcing</span><br></li><li><span>Moderate to advanced Excel knowledge</span><br></li><li><span>Basic knowledge of SQL and other databases</span><br></li><li><span>Interest in social impact</span><br></li><li><span>Basic familiarity with programming languages such as HTML, PHP, Python, R</span><br></li><li><span>Based in San Francisco Bay Area a plus (Remote OK)</span></li></ul><div><br></div><div></div><div></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send a cover letter and resume to <a href='mailto:jenny@imerit.net' rel='nofollow'>jenny@imerit.net</a> with subject line: &quot;We Work Remotely - Job Application for [your name here]&quot;</p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 19, 2017 8:46:36 PM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "TZ_America",
      "TITLE1_sales",
      "REMOTE1_100",
      "DBG:surround``remot 3N (team OR compani OR worldwide)"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "wfJ8dgD4RK-PFao6C5yyuA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5513-business-development-consultant",
    "title": "Modern Tribe: Business Development Consultant",
    "content": "<div>  <div>    <h2>Business Development Consultant</h2>      <h4>Posted Oct  9</h4>    <h3>      <span>Modern Tribe</span><br>      <span>Headquarters: Remote</span><br>        <a href='http://m.tri.be/19ry' rel='nofollow'>http://m.tri.be/19ry</a>    </h3>  </div>    </div>  <div>    <div><h3>The Opportunity</h3></div><div><span></span></div><div><span>Modern Tribe</span>&nbsp;is looking for a seasoned business development consultant person to join our growing team. This position at Modern Tribe will help the company identify leads and close deals in line with our company values.</div><div><br></div><div>The ideal candidate for this role is someone who has been closing deals and maintaining key relationships for a successful digital agency for 2+ years and has been technically involved in online projects for 5+ years.</div><div><br></div><div>You’ve been running projects for ages: you’ve done your own sales, have a proven track record writing proposals, know how to work with WordPress, and understand the nuances of the WordPress business world. You’ve sold projects in the $100k – $1 million+ range, and are looking to go bigger.</div><div><br></div><div>Above all else, your daily attitude + output embody Modern Tribe’s company ethos of “live well and do good work”: you thrive on keeping the team happy and healthy. Matchmaking — not hitting sales numbers — is your jam. You hustle hard, enjoy the game and relish a genuine success. We pride ourselves on solving real problems for people rather than clutter the interwebs with more shit. If you jive with the mission of setting your team up for success, giving them the right flow and the right kind of projects, even if it means rejecting a potentially-lucrative gig…we’d love to hear from you.</div><div><br></div><div><span>Modern Tribe is not interested non-technical sales candidates at this time.</span></div><div><h3>Responsibilities</h3></div><div><span></span></div><div>Each of Modern Tribe’s team members closes upwards of $1 million in new project work each year. The company provides a healthy pipeline to keep things rolling. Team members are also expected to be out generating leads themselves through speaking at events, blogging, local networking, etc. We don’t do cold calls — we build relationships.</div><div><br></div><div>The Sales position at Modern Tribe is primarily focused on&nbsp;<span>lead generation</span>&nbsp;and&nbsp;<span>managing the sales funnel</span>&nbsp;through strategic proposals. Specific tasks this will involve include:</div><div><br></div><ul><li>Managing the inbound inquiry funnel (triage emails, answer calls, etc)<br></li><li>Reviewing + qualifying leads that are a good fit for Modern Tribe<br></li><li>Helping define + scope projects of all sizes, ranging from $100k to over $1 million++<br></li><li>Working directly with service team directors / leads to get estimates<br></li><li>Pitching the final project / proposal to the end customer<br></li><li>Building relationships with prospective partners<br></li><li>Providing regular status updates on daily Sales scrum meetings<br></li><li>Working directly with Project Management and Strategy to handoff and oversee confirmed projects / upsell opportunities<br></li><li>Ensuring the internal CRM we use for tracking work stays updated + accurate<br></li><li>Verifying that that all workflows (proposal templates, estimate templates, etc) are documented and easily accessible<br></li><li>Maintaining strong, long-term relationships with customers once the project is underway</li></ul><div><h3>Personal Competencies</h3></div><ul><li>Impeccable communication + organization skills</li><li>A deep-seated love for relationship building<br></li><li>A diverse background that touches on technology, design and/or strategy, not just sales<br></li><li>Self-motivated, detail oriented<br></li><li>The ability to prioritize workloads and meet deadlines<br></li><li>An engaging + compelling writing style<br></li><li>Given the level of client communication involved, a near-perfect command of the English language is required</li></ul><div><h3>Knowledge &amp; Experience</h3></div><ul><li>2+ years managing sales for digital agencies</li><li>A strong, proven track record building + managing relationships</li><li>A strong design or technical background — show us that you’ve been in the mix building stuff!</li><li>A demonstrable understanding of current technologies and what solutions will/will not work for a given customer’s needs</li></ul><div><h3>Bonus Points</h3></div><ul><li>A strong command of WordPress is HIGHLY desirable, but not required if you have years of experience selling or working with a similar CMS</li><li>Experience running web design and development projects &amp; managing the customer relationship</li><li>Experience closing $1 million + in annual sales</li><li>Proven experience in strategy, design and/or executing major marketing initiatives</li><li>Distributed team experience is important (but not required)</li><li>A confidence + love for working remotely, and the potential social isolation that may bring</li></ul><div><h3>Location</h3></div><div>Work from anywhere in the&nbsp;<span>US or Canada</span>; if you are in&nbsp;<span>Central or South America</span>, let’s talk. This will be a 100% remote position. If your working hours are in a timezone outside of the US range, but you work 4+ hours of overlap each day our team might be able to consider your application.</div><div><h3>Compensation</h3></div><div>The sales role at Modern Tribe is a full-time job (35+ hours/weekly). Full time salary between&nbsp;<span>$65,000 – $90,000 USD</span>&nbsp;depending on experience. Keep in mind that Modern Tribe’s sales team&nbsp;<span>does NOT offer commissions</span>&nbsp;at this time.</div><div><h3>Who We Are</h3></div><div><span></span></div><div><span>Modern Tribe, Inc</span>. is a rapidly growing software &amp; design company. We develop custom solutions for some of the world’s largest companies, government institutions and smaller growing organizations. We pride ourselves on our ability to bridge people and technology and to bring the passion and dedication of an entrepreneur to every project. Our team is composed of talented employees and freelancers around North &amp; South America (and a smattering across the globe).</div><div><h3>Who You Are</h3></div><div><span></span></div><div>We love working with each other because we have built a culture that suits us well. We work primarily with freelancers and coordinate their talents for large projects. To be on our team, you must be:</div><div><br></div><ul><li><b>HAPPY -</b>&nbsp;Where there is a will, there is a way. Having a positive disposition allows us to achieve great things and to support each other.</li><li><b>HELPFUL -</b>&nbsp;Always looking for ways that you can help others.</li><li><b>CURIOUS -</b>&nbsp;It is essential that you have a passion for learning. Technology changes daily, and life has a way of constantly raising the bar.</li><li><b>ACCOUNTABLE</b>&nbsp;- Our clients expect us to get the right thing done on budget and on time. Communicating expectations and meeting them is the cornerstone of success.</li></ul><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='http://m.tri.be/19ry' rel='nofollow'>http://m.tri.be/19ry</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 10, 2017 2:46:43 AM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "TZ_America",
      "DBG:surround``2W(100, remot)",
      "TITLE1_sales",
      "REMOTE1_100",
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": []
  },
  {
    "id": "tInMYjXmRJyDHOOlNIdFkQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/jobs/5468-business-book-illustrator-freelance",
    "title": "Gear Stream: Business Book Illustrator - Freelance / Project Based",
    "content": "<div>  <div>    <h2>Business Book Illustrator - Freelance / Project Based</h2>      <h4>Posted Oct  3</h4>    <h3>      <span>Gear Stream</span><br>      <span>Headquarters: Raleigh</span><br>    </h3>  </div>    </div>  <div>    <div>This is a project based, freelance position that can be done remotely from anywhere in the world. &nbsp;</div><div><br></div><div>We prefer candidates from North America and/or Western Europe.</div><div><br></div><div>Project Brief:</div><div>We are nearing completion of a new business book focused on helping traditional companies reinvent themselves for Digital. &nbsp;The book is part strategy, part &quot;how to&quot;, and part case study. &nbsp;The manuscript is approx. 58,000 words. &nbsp;We think there are approx. 20-25 illustrations / tables required for the book. &nbsp;We're not sure, but we're hoping an experienced illustrator can give us help and guidance in this area.</div><div><br></div><div>Ideal Candidate:</div><div>We seek an illustrator who has worked on both traditionally published business books as well as self-published business books. &nbsp;We prefer candidates who have a wide range of illustration styles from conservative to whimsical. &nbsp;&nbsp;</div><div><br></div><div>If Interested Please Contact us and provide the following:</div><div>&nbsp;1 - A link to your portfolio</div><div>&nbsp;2 - A list of prior books you've illustrated</div><div>&nbsp;3 - Rate Guidance</div><div>&nbsp;4 - Current Availability</div><div><br></div><div>&nbsp;</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='mailto:brad.murphy@gearstream.com' rel='nofollow'>brad.murphy@gearstream.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 3, 2017 10:05:33 PM",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "WjC4eBvLTYGQ5S2_jmRxnw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5443-sales-leadership-admissions",
    "title": "Remote Year: Sales Leadership, Admissions",
    "content": "<div>  <div>    <h2>Sales Leadership, Admissions </h2>      <h4>Posted Sep 29</h4>    <h3>      <span>Remote Year</span><br>      <span>Headquarters: Worldwide </span><br>        <a href='https://remote-year.breezy.hr/' rel='nofollow'>https://remote-year.breezy.hr/</a>    </h3>  </div>    </div>  <div>    <div><b>Remote Year</b></div><div><br></div><div>Remote Year brings together communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend a year working, traveling, and exploring 12 cities around the world. Spending one month in each location, communities connect with local cultures and business ecosystems, forming lifelong, borderless personal and professional relationships along the way. Together we are shaping the future of work.</div><div><br></div><div><strong>Role Description</strong></div><div><br></div><div>Our Admissions team is looking for an experienced Sales Manager to manage our growing consumer sales team. Working closely with our Head of Admissions, Head of Sales, and other members of our Leadership team, our Sales Manager will be responsible for executing on the Remote Year consumer sales strategy. &nbsp;You will bring your expertise in motivating sales teams, maximizing pipeline potential, and - ultimately - driving revenue growth. &nbsp;We need a self-starter who helps others thrive in an autonomous workplace who can also develop and mentor a team of smart, talented, and passionate Admission Sales Consultants.</div><div><br></div><div><strong>Responsibilities</strong></div><div><br></div><ul><li>Coach and Develop a high-performing team of Admission Consultants.<br><br></li><li>Recruiting and retaining top talent through various sales-team appropriate engagement mechanisms.<br><br></li><li>Develop the strategy and delivery for training, onboarding, and development of our current and new Admission Consultants.<br><br></li></ul><ul><li>Build a strong feedback loop and process, partnering with our Marketing team to generate new leads as well as our Admissions Associates to move leads up the pipeline.<br><br></li><li>Lead daily sales initiatives, including both strategic elements (processes, quota alignments, targets) and operationally (tools, coaching, hiring needs)<br><br></li><li>Set and monitor KPIs, sales targets, and goals for the team.<br><br></li><li>Collaborate with People Business Partners on compensation packages for all levels of the sales team, onboarding, and other people-related needs.<br><br></li><li>Partner with Sales Ops and Finance to develop financial and operating targets and ensure alignment with a strategic plan.<br><br></li></ul><div><strong>Qualifications</strong></div><div><br></div><ul><li><strong>5-10 years of management experience,</strong>&nbsp;with preference to leading a distributed sales teams or within the private education space.</li><li>A strong familiarity with sales tools and CRMS in particular, Salesforce.<br><br></li><li>Previous startup experience and/or experience working with distributed teams across multiple timezones.<br><br></li><li>Ability to perform well in highly dynamic, rapidly changing environment.<br><br></li><li>Strong analytical and problems-solving ability - must have grit and a love for numbers.<br><br></li><li>Ability to give direct, constructive feedback to your team, peers and co-workers.<br><br></li><li>Ability to travel internationally extensively.<br><br></li></ul><div><strong>To Apply: Drop your resume below, along with a note telling us more on your leadership style, what excites you about the role, and what we're building at Remote Year.&nbsp;</strong></div><div><br></div><div><strong><br></strong></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>To Apply: Drop your resume below, along with a note telling us more on your leadership style, what excites you about the role, and what we're building at Remote Year. </p>  </div>",
    "urlFetchPending": false,
    "published": "Sep 29, 2017 8:34:24 PM",
    "tags": [
      "DBG:surround``headquart 3N remot",
      "TITLE1_sales",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  }
]
}
