{
 "items": [
  {
    "id": "hr4NqrfTTPuViKl4iWlaTw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/158893/desktop-support-tier-ii-academic-analytics?a=RhQf1NSfv8c",
    "title": "Desktop Support, Tier II at Academic Analytics (Miller Place, NY) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Desktop Developer, System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Academic Research</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>The Desktop Support Technician, II is responsible for total support and troubleshooting of the Academic Analytics end-user environment and executing device lifecycle management activities including fulfilling, provisioning, deployment, support and asset disposition.&nbsp; Primary responsibilities will be Tier II issue resolution and support of all desktops, laptops, mobile devices, print services and basic networking.&nbsp; This position interfaces directly with our coworkers and requires excellent customer service skills as well as technical knowledge.</p><p>Responsibilities:</p><ul><li>Install, upgrade, support and troubleshoot printers, computer hardware, Windows 10 OS, Mac OS as well as other authorized desktop applications and peripheral equipment.</li><li>Perform general preventative maintenance tasks on computers, laptops, printers, servers and any other authorized peripheral equipment</li><li>Install, diagnose, repair, maintain, upgrade hardware and equipment to ensure optimal performance.</li><li>Troubleshooting and configuration of Apple products</li><li>Take ownership to remedy tickets and problems assigned, accurately record work performed and troubleshoot issues (in person, by telephone or remote access) in a timely fashion</li><li>Provide direct end user assistance to include familiarizing users with basic software, hardware, peripheral device operation</li><li>Secure network by executing security and access policies</li><li>Work with manager to review current policies, procedures and objectives</li><li>Provide technical support to associates who are traveling or conducting meetings</li><li>Aid in security risk assessment of network</li><li>Provide guidance to tier 1 support staff to assist in their learning</li><li>Hardware and Software procurement management</li></ul><ul><li>Skills/experience needed:<ul><li>Proficient in networks</li><li>Windows Server Administrator experience</li><li>Active Directory Administrator experience</li><li>Proficient in network security</li><li>Barracuda experience</li><li>IIS experience</li><li>Proficient in Windows and Mac OS</li><li>Azure experiencenecessary&nbsp;</li><li>Participate in 24x7 on call</li><li>Experience and proficiency with technical support of Sales Force</li><li>Office 365 administration</li><li>5 years’ experiencedesktop support</li><li>Minimum Bachelor degree or equivalent</li><li>Demonstrates strong customer service skills</li><li>Ability to communicate effectively both in person and over the phone and in writing</li></ul></li></ul>                    </div>                            <h2>                About Academic Analytics            </h2>            <div><p><strong>About Academic Analytics, LLC</strong></p><p>Academic Analytics was founded in 2005, the product of a research project started by Dr. Lawrence Martin in response to universities’ needs for business intelligence techniques.</p><p>Academic Analytics’ data are designed to support university leaders as they strive for excellence. Our data are a useful tool to guide them in understanding strengths and weaknesses, establishing standards, allocating resources, and monitoring performance. Our product continues to evolve to meet the needs of our clients, often a result of requests and feedback we receive. To serve our large and continuously growing community of data users, Academic Analytics hosts user workshops several times a year.</p><p>Academic Analytics is an Equal Opportunity Employer.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Anthem Blue Cross and Blue Shield                            </div>                            <div>                                 EyeMed Plan                            </div>                            <div>                                 Paid Short Term and Long Term Disability                            </div>                            <div>                                 401K Plan with Match- 100% Vested                            </div>                            <div>                                 3 Weeks Paid Time Off                            </div>                            <div>                                 Dental Plan                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TITLE1_support",
      "TECH2_osx",
      "TECH2_sysadmin",
      "TECH2_amazon-web-services",
      "TECH2_linux",
      "REMOTE1_100",
      "TECH2_azure",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "azure",
      "linux",
      "osx",
      "sysadmin"
    ]
  },
  {
    "id": "em87I6O9TGiC_7jCY-dx5Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159024/cloud-services-technical-support-contract-wikimedia-foundation-inc?a=Rkz7zyocRt6",
    "title": "Cloud Services Technical Support (Contract) at Wikimedia Foundation, Inc. (San Francisco, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Education Technology, eLearning, Non-Profit</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><strong>Location: San Francisco, CA or Remote</strong><p><strong>Type:</strong>&nbsp;Contract</p><p><strong>Hours:</strong>&nbsp;20 hours per week</p><p><strong>Duration:</strong>&nbsp;3 months (with possibility for extension)</p><p><strong>Summary:</strong></p><p>The Wikimedia Cloud Services team is looking for a part-time Technical Support specialist to help the Wikimedia movement's volunteer developers to rapidly clarify and resolve their technical questions and issues.</p><p>Come work within the Cloud Services team at the Wikimedia Foundation! We are administering a public OpenStack cloud (Infrastructure as a Service) with a modern Platform as a Service (Kubernetes) running on it. We are dedicated to supporting developers within and outside of the Wikimedia Foundation and upholding&nbsp;<a href='https://www.mediawiki.org/wiki/Code_of_Conduct' rel='nofollow'>the Code of Conduct for Wikimedia technical spaces</a>. Candidates need to be comfortable sharing ideas, providing guidance, following instructions, mentoring volunteers, and communicating in public and asynchronous ways (mailing lists/forums/irc). Our team works remotely and so can you!</p><p><strong>Responsibilities:</strong></p><ul><li>Actively monitor various IRC channels, wikipages, and mailing lists, for support requests</li><li>Help volunteer developers to diagnose and resolve technical issues with our IaaS and PaaS infrastructure and their code</li><li>Communicate clearly and patiently with individuals from our international communities of volunteer developers</li><li>Write, verify, and improve documentation used by volunteer developers and technical staff</li><li>Ensure positive and constructive discussions with the community and the Wikimedia Foundation</li><li>Work and communicate effectively within a small team distributed across multiple time zones</li></ul><p><strong>Requirements:</strong></p><ul><li>Strong interpersonal skills, with track record of modeling good social and development practices</li><li>Experience using a variety of communications and collaboration tools, including wikis, mailing lists, and group chat</li><li>Experience using Linux command line tools</li><li>Ability to understand and explain technical issues</li><li>Intermediate programing experience in one of the following languages: Python, PHP, JavaScript (node.js)</li><li>Ability to work both independently and as part of a distributed team</li></ul><p><strong>Pluses:</strong></p><ul><li>Experience working in the Wikimedia Toolforge or Cloud VPS environments</li><li>Experience with the Wikimedia community, or a similar open source or collaborative community</li><li>Familiarity with MediaWiki and/or MediaWiki APIs</li><li>Ability to read and write multiple (human) languages</li><li>Experience with writing and optimizing SQL queries</li><li>Proficiency in multiple programming languages</li><li>Experience with one or more cloud computing environments (OpenStack, AWS, GCP/GKE, Azure, DigitalOcean, Heroku, etc)</li><li>Experience with Linux systems administration</li></ul><p><strong>Show us your stuff!</strong></p><p>If you have participated in on-line collaborative communities please share links with us. This could be a wiki, web forum, mailing list, GitHub, Stack Exchange, Quora, etc. If you are a software developer with some public source code, send links to that as well. We would love to see your work!</p><p><strong>More Information</strong></p><p>https://wikimediafoundation.org</p><p>https://blog.wikimedia.org</p>                    </div>                            <h2>                About Wikimedia Foundation, Inc.            </h2>            <div><p>The Wikimedia Foundation is the non-profit organization that supports and hosts Wikipedia and several other Wikimedia free knowledge sites.&nbsp;Every month, the Wikimedia sites are accessed by more than a billion unique devices.&nbsp;Wikipedia consists of more than 40 million articles&nbsp;across&nbsp;hundreds of languages. Every month, more than 250,000 volunteer editors contribute to Wikipedia. Based in San Francisco, California, the Wikimedia Foundation is an audited, 501(c)(3) non-profit that is funded primarily through donations and grants. It currently employs over 300 staff members.</p><p>At the Foundation, we build technology to help people everywhere access Wikipedia, across devices and in nearly 300 languages. We engineer privacy for our readers and editors so they can safely and securely explore Wikipedia. We create&nbsp;programs&nbsp;and initiatives to make Wikipedia freely available to more people in more parts of the world. We build&nbsp;new tools&nbsp;for the community of editors so they can continue to improve and grow Wikipedia. Roughly a quarter of our budget goes to supporting the community that&nbsp;make&nbsp;the site possible, including through&nbsp;grantmaking programs&nbsp;that enable volunteers and enrich the information on the sites.</p><p>The Wikimedia Foundation is an equal opportunity employer, and we encourage people with a diverse range of backgrounds to apply.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Fully paid premiums for medical, dental &amp; vision                            </div>                            <div>                                 401(k) Retirement Plan                            </div>                            <div>                                 Short and Long Term Disability Insurance                            </div>                            <div>                                 Life and AD&amp;D Insurance                            </div>                            <div>                                 Flexible Spending Transportation &amp; Parking Plan                            </div>                            <div>                                 Parental Support                            </div>                            <div>                                 Wellness Program ($1800/a year)                            </div>                            <div>                                 Employee Assistance Program (EAP)                            </div>                            <div>                                 Flexible Spending Account Plan                            </div>                            <div>                                 Personal development/education                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TITLE1_support",
      "TECH2_php",
      "TECH2_vps",
      "TECH2_linux",
      "TECH2_javascript",
      "REMOTE1_100",
      "TZ_unknown",
      "TECH2_cloud"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "cloud",
      "javascript",
      "linux",
      "php",
      "vps"
    ]
  },
  {
    "id": "AspEGzErQ5yB85twhLp2UQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/158025/developer-success-engineer-apac-auth0?a=QZNfGgDRlkc",
    "title": "Developer Success Engineer (APAC) at Auth0 (Sydney, Australia) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, IT Security, Software Development / Engineering</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Auth0 provides an enterprise-grade platform that secures billions of log-ins every year. The company makes it easy to implement even the most complex identity solutions for their web, mobile, IoT and internal applications, as well as sophisticated identity management for employees, customers and partners. Auth0 has raised over $54 million from Meritech Capital, NTT DoCoMo, Trinity Ventures, Bessemer Venture Partners, K9 Ventures, Silicon Valley Bank, Founders Co-Op, Portland Seed Fund and NXTP Labs. Thousands of enterprises and millions of users worldwide depend on Auth0 for authentication and authorization of their most mission-critical apps, APIs and IoT devices. &nbsp;&nbsp;Auth0’s top priorities are availability and security The Position: We are seeking individuals with technology support experience to provide complex support services of the Auth0 SaaS solution.&nbsp; Reporting to the Regional Support Manager, this individual will work closely with our customers to provide break-fix support, operational maintenance, and support services.&nbsp;This position is an integral part of Auth0's long-term relationship with its global customers, and the efforts put forth by this individual will directly impact the long-term success of the relationship. In order to succeed in this team, this individual must have the passion and energy to work in an entrepreneurial and fast paced environment. Auth0 has a strict NO JERK policy, so only those who love to collaborate, understand how to give and take constructive feedback and are always looking to make themselves and their peers better need apply.</p><p>Responsibilities:</p><ul><li>Support and maintain customers who have implemented the Auth0 SaaS solution, resolving technical and non-technical customer issues in a timely fashionOperational management of Support tickets</li><li>Build and maintain excellent relationships with clients and achieve the highest level of customer satisfaction</li><li>Work as part of our extended support team in a startup atmosphere, doing whatever it takes to exceed customer expectations</li><li>Use your&nbsp;business and technical analysis skills and knowledge of the Development lifecycle to solve complex issues and promote best practices</li><li>Collaborate with other departments in the company to achieve customer satisfaction</li></ul><p>Requirements:</p><ul><li>Strong analytical and problem solving skills</li><li>Self-starter — able to come up to speed on complex, difficult concepts with minimal assistance</li><li>Ability to quickly context-switch between multiple complex work streamsInstinctive ability to subdivide problems into basic components in order to efficiently pinpoint root cause of issues</li><li>Customer-obsessed attitude — a customer advocate, always going the extra mileTeam player with solid communication and presentation skills</li><li>Proactivity — identify opportunities and take preemptive action against potential problemsContinuous growth — permanently look for areas of improvement, make plans on how to improve them, and execute those plans</li></ul><p>Technical Domain Focus:</p><ul><li>Knowledge of software development fundamentals and common architecturesKnowledge of HTTP, encryption, basic security concepts</li><li>Understanding of authentication and authorization conceptsKnowledge of one or more auth protocols/specifications: OAuth2, OIDC, SAML, WS-FED, LDAP, Azure AD, etc.</li><li>Proficient in at least one programming language; ideally JavaScript</li></ul><p>Experience &amp; Education:</p><ul><li>Min 2 years of technical support and/or software development</li><li>OR 2-5 years of solid experience in a business or technical analyst role for medium to large scale business software implementation projects.</li></ul><p>Location:</p><ul><li>This position will be based in our office in Sydney or we are open to remote candidates with the right background</li></ul>                    </div>                            <h2>                About Auth0            </h2>            <div><p>At Auth0, we exist because we solve a problem that every developer faces. We believe that developers should spend their time innovating instead of writing identity systems and, for that to happen, we are building the best identity platform focusing on two principles: simplicity and power.</p><p>Our ultimate goal is to make the internet safer and we’re looking for people to join us on the journey.</p><p>We are an equal opportunity employer and value diversity at our company. We are transparent about how we run our recruiting process - you can read all about it <a href='https://auth0.com/blog/how-we-hire-engineers/' rel='nofollow'>here</a>. You can also read about our company culture <a href='https://auth0.com/blog/our-culture-and-values-at-auth0/' rel='nofollow'>here</a>.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Competitive Equity                            </div>                            <div>                                 Free Nespresso                            </div>                            <div>                                 Top-of-the-Line Macbooks and other great tools                            </div>                            <div>                                 Embrace Distributed Work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TITLE1_support",
      "TECH2_javascript",
      "REMOTE1_100",
      "TZ_unknown",
      "TECH2_saas"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "javascript",
      "saas"
    ]
  },
  {
    "id": "MsLwxAMpRj-7dbmx2knYIw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/158024/developer-success-engineer-auth0?a=QZLXKK6uaK4",
    "title": "Developer Success Engineer at Auth0 (Bellevue, WA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, IT Security, Software Development / Engineering</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div>Auth0 provides an enterprise-grade platform that secures billions of log-ins every year. The company makes it easy to implement even the most complex identity solutions for their web, mobile, IoT and internal applications, as well as sophisticated identity management for employees, customers and partners. Auth0 has raised over $54 million from Meritech Capital, NTT DoCoMo, Trinity Ventures, Bessemer Venture Partners, K9 Ventures, Silicon Valley Bank, Founders Co-Op, Portland Seed Fund and NXTP Labs.Thousands of enterprises and millions of users worldwide depend on Auth0 for authentication and authorization of their most mission-critical apps, APIs and IoT devices. &nbsp;&nbsp;Auth0’s top priorities are availability and securityThe Position:We are seeking individuals with technology support experience to provide complex support services of the Auth0 SaaS solution.&nbsp; Reporting to the Regional Support Manager, this individual will work closely with our customers to provide break-fix support, operational maintenance, and support services.&nbsp;This position is an integral part of Auth0's long-term relationship with its global customers, and the efforts put forth by this individual will directly impact the long-term success of the relationship. In order to succeed in this team, this individual must have the passion and energy to work in an entrepreneurial and fast paced environment.Auth0 has a strict NO JERK policy, so only those who love to collaborate, understand how to give and take constructive feedback and are always looking to make themselves and their peers better need apply.Responsibilities:<ul><li>Support and maintain customers who have implemented the Auth0 SaaS solution, resolving technical and non-technical customer issues in a timely fashionOperational management of Support tickets</li><li>Build and maintain excellent relationships with clients and achieve the highest level of customer satisfaction</li><li>Work as part of our extended support team in a startup atmosphere, doing whatever it takes to exceed customer expectations</li><li>Use your&nbsp;business and technical analysis skills and knowledge of the Development lifecycle to solve complex issues and promote best practices</li><li>Collaborate with other departments in the company to achieve customer satisfaction</li></ul><p>Requirements:</p><ul><li>Strong analytical and problem solving skills</li><li>Self-starter — able to come up to speed on complex, difficult concepts with minimal assistance</li><li>Ability to quickly context-switch between multiple complex work streamsInstinctive ability to subdivide problems into basic components in order to efficiently pinpoint root cause of issues</li><li>Customer-obsessed attitude — a customer advocate, always going the extra mileTeam player with solid communication and presentation skills</li><li>Proactivity — identify opportunities and take preemptive action against potential problemsContinuous growth — permanently look for areas of improvement, make plans on how to improve them, and execute those plans</li></ul>Technical Domain Focus:<ul><li>Knowledge of software development fundamentals and common architecturesKnowledge of HTTP, encryption, basic security concepts</li><li>Understanding of authentication and authorization conceptsKnowledge of one or more auth protocols/specifications: OAuth2, OIDC, SAML, WS-FED, LDAP, Azure AD, etc.</li><li>Proficient in at least one programming language; ideally JavaScript</li></ul>Experience &amp; Education:<ul><li>Min 2 years of technical support and/or software development</li><li>OR 2-5 years of solid experience in a business or technical analyst role for medium to large scale business software implementation projects.</li></ul>Location:<ul><li>This position will be based in our office in Bellevue, WA or Buenos Aires, Argentina or we are open to remote candidates (in North or South America) with the right background</li></ul>                    </div>                            <h2>                About Auth0            </h2>            <div><p>At Auth0, we exist because we solve a problem that every developer faces. We believe that developers should spend their time innovating instead of writing identity systems and, for that to happen, we are building the best identity platform focusing on two principles: simplicity and power.</p><p>Our ultimate goal is to make the internet safer and we’re looking for people to join us on the journey.</p><p>We are an equal opportunity employer and value diversity at our company. We are transparent about how we run our recruiting process - you can read all about it <a href='https://auth0.com/blog/how-we-hire-engineers/' rel='nofollow'>here</a>. You can also read about our company culture <a href='https://auth0.com/blog/our-culture-and-values-at-auth0/' rel='nofollow'>here</a>.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Competitive Equity                            </div>                            <div>                                 Free Nespresso                            </div>                            <div>                                 Top-of-the-Line Macbooks and other great tools                            </div>                            <div>                                 Embrace Distributed Work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TITLE1_support",
      "TECH2_javascript",
      "REMOTE1_100",
      "TZ_unknown",
      "TECH2_saas"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "javascript",
      "saas"
    ]
  },
  {
    "id": "PKqcalCkSreS_l6Jh6TRsw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/153947/calling-all-developers-we-are-looking-for-two-interworks?a=PD0425vPgY0",
    "title": "Calling All Developers! We are looking for two great people - will train at InterWorks (Oklahoma City, OK) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Desktop Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Data &amp; Analytics, IT Consulting, Product Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>The right fit... That's what we care about more than anything.&nbsp; Do you want to work in a positive environment with a team that cares about their work and craft?&nbsp; Then this might be the job for you. Ultimately we need you to code .NET, but we don't care if you don't know it as long as you have some level of dev chops, whether that's 10 years or 0 years and you've spent time building your own projects.<br><br>Small but mighty... That's how you might describe our cadre of .NET developers. &nbsp;Camaraderie among the team is great and we actively work together to find the best solutions to the programming challenges we encounter.</p><p>We are currently building a suite of products and also re-building and maintaining InterWorks internal software that manages our 175+ person consulting business. &nbsp;Our products are currently being used by 40% of the Fortune 100 companies in the U.S. and countless companies across the globe.</p><p>We are looking for someone who loves coding and working with others. &nbsp;Our company is built on the premise that by hiring people who love what they do and are friendly and kind, we can achieve success no matter what our goal. &nbsp;</p><p>We have offices in OKC, Tulsa, and Stillwater.&nbsp; Our preference is finding someone local, but we are interviewing remote folks as well because finding the right people is our most important goal.</p><p>We'll tell you what technology we use, but we really don't care if you have that much experience in it. &nbsp;What we really care about, is that you 1) Know it and want to keep learning or 2) Don't know it and want to keep learning.</p><p>.NET MVC (Core/4.5)<br>WPF (4.5)<br>TypeScript<br>SQL Server<br>Postgresql</p>                    </div>                            <h2>                About InterWorks            </h2>            <div><p>InterWorks is a business-to-business IT&nbsp;consulting firm based out of Stillwater, Oklahoma with staff in Dallas, Atlanta, Chicago, San Diego, New York, San Francisco, Australia&nbsp;and in Europe. We opened our doors in 1996 to focus on IT&nbsp;networking with an emphasis on customer service. Still focusing on the needs of the customer, we now serve clients by offering network architecture, software development, web strategy and business intelligence services on a national and global scale.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Friendly, Positive Work Environment                            </div>                            <div>                                 Flat Organization, Direct communication to leadership                            </div>                            <div>                                 Matching 401K                            </div>                            <div>                                 Health, Vision, Dental, and Life Insurance                            </div>                            <div>                                 Generous Paid Vacation                            </div>                            <div>                                 Maternity/Paternity Leave                            </div>                            <div>                                 Dependent Care Flexible Spending Account                            </div>                            <div>                                 Laid Back Offices                            </div>                            <div>                                 Regular Catered Lunches                            </div>                            <div>                                 Company Outings                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TITLE1_support",
      "TECH2_user-interface",
      "TECH2_c#",
      "TECH2_sql",
      "TECH2_javascript",
      "REMOTE1_100",
      "TZ_unknown",
      "TECH2_.net"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      ".net",
      "c#",
      "javascript",
      "sql",
      "user-interface"
    ]
  },
  {
    "id": "QgwBCSOxRcK0uxqrnTQagQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/158494/senior-professional-services-engineer-sysdig?a=R9xRPp68oCI",
    "title": "Senior Professional Services Engineer at Sysdig () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Internet Infrastructure, Network Security, Process Monitoring</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Sr. Professional Services Engineer</strong></p><p><strong>Remote, Europe</strong></p><p>Sysdig is currently seeking a Professional Services / Solutions Engineer to join our team. This role can be in the US (Remote) or here locally in San Francisco, or in Europe (Remote) or in our Belgrade or Turin office.</p><p>This individual will be tasked with driving architectural strategy, POCs, and post-sales deployments for our largest most complex customer environments.&nbsp; The Solution Engineer will support Sysdig Sales Engineers as their go-to technical resource for Post Sales hand off.&nbsp;</p><p>Primary Responsibilities:</p><ul><li>Act as an integral member of the Post Sales team including Professional Services, Support and Customer Success, taking responsibility for solving customer issues from a technical perspective.</li><li>Work off/on ­site with strategic customers, delivering solutions architecture consulting, technical guidance, knowledge transfer and establish trusted advisor status.</li><li>Lead proof-of-concepts assisting strategic customers to deploy and integrate Sysdig Monitoring and Security technology into their environments.</li><li>Develop best practices and playbooks for Support Engineers and other Solution Engineers</li><li>Play a key role in formulation of FAQ’s and execution process and procedures.</li><li>Train and support other team members and indirect channel partners 9as required).</li><li>Act as a product enhancement feedback loop with product management and engineering.</li><li>Help triage and document bugs and enhancements requests as seen in the field.</li><li>Act as evangelist of Sysdig technology in EMEA-wide open source and devops community</li></ul><p>Desired Skills &amp; Experience:</p><ul><li>A minimum of three years experience as a Professional Services / Solutions engineer or an enterprises in a similar or related fields (container management, cloud management, systems management, PaaS).</li><li>A minimum of three years experience as a Support Level 2 / Escalations engineer or an enterprises in a similar or related fields.</li><li>Knowledge of cloud infrastructure / container computing and technologies like AWS, Docker, Kubernetes and other tools like Cassandra, Elastic Search etc</li><li>Excellent writing and interpersonal communication/relationship skills.</li><li>Ability to work effectively and manage multiple customer support issues simultaneously.</li><li>Self-motivated with ability to thrive under pressure, self-manage and prioritize activities.</li><li>Previous start-up experience, a plus.</li></ul><p>Technical:</p><ul><li>Understanding of PaaS concepts.</li><li>Understanding Application Monitoring.</li><li>Experience with any of the Scripting languages (Shell, Bash, Perl, Python etc).</li></ul><p>Nice to Have:</p><ul><li>Experience in using or integrating with Systems Management Technology.</li><li>Hands-on experience with PaaS tools or other cloud management software.</li></ul>                    </div>                            <h2>                About Sysdig            </h2>            <div><p>Data monitoring, containers, Security, Microservices</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work in one of our sunny California offices (SF and Davis) or remotely                            </div>                            <div>                                 Competitive starting salaries                            </div>                            <div>                                 Every full-time position earns stock options                            </div>                            <div>                                 Top notch health insurance coverage for full-time employees                            </div>                            <div>                                 Desk and tech setup of your choice (for wherever you work)                            </div>                            <div>                                 IRA with company matching up to 3% of salary                            </div>                            <div>                                 Unlimited vacation policy                            </div>                            <div>                                 Monthly self-improvement grant - spend on yourself however you see fit                            </div>                            <div>                                 Free weekly team lunches and delicious snacks every day of the week                            </div>                            <div>                                 Free monthly house cleaning service                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TITLE1_support",
      "TECH2_docker",
      "TECH2_amazon-web-services",
      "TECH2_cassandra",
      "TECH2_kubernetes",
      "REMOTE1_100",
      "TECH2_mesos",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "cassandra",
      "docker",
      "kubernetes",
      "mesos"
    ]
  },
  {
    "id": "NAp3bzOHRuK1kgf0zyfkJw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/145569/support-analyst-diplomasender?a=MONuLdKNeSY",
    "title": "Support Analyst at DiplomaSender () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Education</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>This position has potential for quick growth in responsibilities. &nbsp;Initially we would like someone who has light SQL skills and can run a query and complete&nbsp;proactive data management. &nbsp;We have a few projects that would include more of a data entry skill set where physical records are converted into digital data. &nbsp;There will also be proactive communication with vendors to discuss data anomalies and eventually the handling of escalated support calls.</p><p>Most of the items have a loose process in place, where the ideal candidate will be able to pick it up where it currently stands, and manage the tasks on a day to day basis, while adding improvements and advising on processes so that any issues can prevented entirely.<br><br>The IT department has a wide range of responsibilities, so as interest is expressed and efficiency added, there will be an&nbsp;anticipated&nbsp;growth in responsibilities.</p><p><strong>Skills &amp; Requirements</strong></p><p>The ideal candidate would have a basic level of SQL skills, the ability to be detail oriented and follow documentation. We encourage the ability to&nbsp;see the big picture for how the documentation can be improved, and proactively preventing future issues.<br><br>Communication from candidate will need to be professional at all times, and be targeted toward internal users, third party vendors, and external customers.</p>                    </div>                            <h2>                About DiplomaSender            </h2>            <div><p>Diploma Sender specializes in document (paper and digital) and data management for Adult Education (commonly known as the GED). We have around 20 employees, and have been in business for a little over&nbsp;7 years. A core value is that family comes first; to enable this, we work as hard as possible during the day, so that we are not needed on evenings or the weekend.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 100% employer paid health insurance for full time employees                            </div>                            <div>                                 Telecommute available                            </div>                            <div>                                 Flexible PTO                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TITLE1_support",
      "TECH2_sql",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "sql"
    ]
  },
  {
    "id": "Fs1O5YH8QO6rUwlOt0NOYQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/132227/customer-success-engineer-in-eu-uk-platformsh?a=IlnxNbWBU9q",
    "title": "Customer Success Engineer in EU / UK at Platform.sh () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Continuous Delivery, PaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Note: we are seeking someone&nbsp;<strong>in Europe or the UK</strong>. The position is remote insofar as work-from-home is expected, but you need to be on the right continent. Thanks!<br><br>Platform.sh the award-winning PaaS solution is looking for a talented customer success engineer who is passionate about site uptime and happy customers.</p><p>Our customers run thousands of web applications in over 100 countries consuming 10s of thousands of CPUs on multiple public clouds. We were shipping containers before Docker, our sales team can explain the CAP Theorem, and our marketing director programs Haskell. We can clone whole running systems, including the data, services, and networking in a matter seconds. The main API to operate and orchestrate our clusters of LXC containers is Git. We're hardcore technologists with equally hardcore customers. We're looking for strong technologists who are good at talking directly to customers.</p><p>Our customers need on-boarding and training before they can master the Platform.sh fu. Can you deliver breathtaking and exhilarating tech demos, and explain the intricacies of command line tools? We run OEM PaaS services for famous brands like Magento Enterprise Cloud Edition and Sensio Cloud - can you help us build and run these vibrant software products?</p><p>As a <strong>Customer Success Engineer, you help with onboarding, provisioning, and training of customers.</strong> You will also be essential for diagnostics and debugging of failing applications and systems, and you have a strong mandate to help us automate and streamline everything we do. You are periodically on call in case disaster strikes. You're our front line, and when our customers think of how great Platform.sh is, they think of you.</p><p><strong>Skills &amp; Requirements</strong></p><p>Responsibilities:</p><ul><li>Assist in onboarding and launches for new clients</li><li>Deploy and configure cloud resources</li><li>Respond to customer inquiries about our product</li><li>Participate in on-call response to high priority tickets and incidents</li><li>Troubleshoot issues pertaining to the infrastructure running customer applications</li><li>Occasionally attend local or international conferences on behalf of Platform.sh</li></ul><p>Must have</p><ul><li>Extensive experience&nbsp;with web applications of various kinds. PHP, Node.js, and Python applications are especially important to our current business</li><li>Experience with IaaS solutions, such as AWS, Microsoft Azure</li><li>Excellent communication and presentation skills: demoing products, explaining value and fielding technical, process and business-related questions</li><li>Ability to do the job in exquisite written and spoken English</li><li>Deep understanding of complete, modern hosting stacks</li><li>Experience with CDNs</li><li>Knowledge of DNS</li><li>Understanding of SSL certificates and encryption</li><li>Ability to use Git</li></ul><p>Nice to have</p><ul><li>Knowledge of Magento Ecommerce, Symfony, Drupal, eZ Platform, or Typo3</li><li>Relational database skills</li><li>Public speaking experience</li><li>Blogging or writing experience</li><li>Experience as a performing musician, competitive athlete, dancer, actor, scout, sailor, or magician</li><li>You love to cook</li><li>Ability to kick ass in Chess or Go</li><li>A passion for photography, painting, or home brewing beer</li></ul>                    </div>                            <h2>                About Platform.sh            </h2>            <div><p>We’re a venture capital funded, award-winning team of hard-core hackers who want to revolutionize the way that developers and agencies build and deploy web applications. We’re mostly distributed, but we meet up daily in cyberspace, and occasionally in Paris, France. &nbsp;We value enthusiasm, team spirit, and a constant desire to expand personal knowledge and contribute to the community. We provide a multi-cultural, casual and balanced work environment. We recently helped launch&nbsp;Magento Enterprise Cloud Edition and the Sensio Cloud on Platform.sh technology.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from home, wherever you are                            </div>                            <div>                                 Safe and friendly working environment                            </div>                            <div>                                 Stock options for everyone                            </div>                            <div>                                 Rest and recovery are essential to health and happiness; we get that                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TECH2_ruby",
      "TITLE1_support",
      "TECH2_python",
      "TECH2_node.js",
      "TECH2_php",
      "REMOTE1_100",
      "TZ_unknown",
      "TECH2_git"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "git",
      "node.js",
      "php",
      "python",
      "ruby"
    ]
  },
  {
    "id": "fVLEgvUcTfyVOefzUOL-ww",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157171/customer-success-engineer-ios-android-js-locuslabs?a=QI2jk4WHzG0",
    "title": "Customer Success Engineer - iOS/Android/JS at LocusLabs (San Francisco, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Mobile Developer</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span>Are you interested in mapping the inside of every building on the planet? &nbsp;So are we!</span></p><p><span>LocusLabs (<a href='http://www.locuslabs.com' rel='nofollow'>http://www.locuslabs.com</a>) is a venture backed San Francisco based startup focused on indoor mapping and location services. &nbsp;After gaining significant traction in the travel industry providing interactive maps of the world's largest airports to several marquee customers, we are now setting our sights on the rest of the planet.</span></p><p><span>A big part of making that happen is to make sure our customers have everything they need to succeed. &nbsp;To that end, we are looking for a developer to work with our customers to understand their use cases and technical requirements then provide them with the support they need. &nbsp;Our SDK products span iOS, Android and web, so knowledge of Java, Objective-C and JavaScript is critical. &nbsp;Given our worldwide customer base, fluency in multiple languages is beneficial.</span></p><p><span>Does the prospect of being able to learn a multitude of new technologies, languages and platforms excite you? &nbsp;Are you interested in traveling the world building relationships with our global customer base? &nbsp;Do you work well on a team and have excellent verbal and written communication skills?</span></p><p><span>If you said yes to one or more of those, we want you on our team!</span></p><p><span>Our goal is to hire the best people possible regardless of physical location and/or work schedules, so we are open to telecommuting and flexible time schedules.</span></p><p><span>JOB DESCRIPTION</span></p><ul><li><span>Member of a very experienced engineering team in an exciting startup environment</span></li><li><span>Work with customers to understand their goals and needs</span></li><li><span>Provide customers with the support they need to succeed: example apps, code snippets, documentation, etc</span></li><li><span>Work with product and engineering teams to identify and prioritize feature requests and bugfixes</span></li></ul>                    </div>                            <h2>                About LocusLabs            </h2>            <div><p>LocusLabs provides the platform and tools that enable apps to be location-aware on a micro level.</p><p>LocusLabs is going a level deeper than existing mapping solutions. We are mapping not only places, but people, products and things using technology that scales. We take painstaking effort to ensure we are creating an indoor location experience that is actually useful to people - not just a set of app features.</p><p>We build maps that matter.</p>            </div>        ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_50",
      "TECH2_javascript",
      "TECH2_ios",
      "TECH2_android",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "android",
      "ios",
      "javascript"
    ]
  },
  {
    "id": "wEU75XlZSAmBuYJaqQmjyA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Professional+Service+Consultant+Cyber+Security+London&c=Acumin+Consulting&l=Home+Based&jk=0788dbf702d4d8d2&rtk=1bu3eptjn17oq6ht&from=rss",
    "title": "Professional Services Consultant – Cyber Security – London - Acumin Consulting - Home Based",
    "content": "<div><b>Professional Services Consultant – Cyber Security – London</b><br><span>Acumin Consulting</span> -<span>Home Based</span><div><span>Full-time,&nbsp;Permanent</span></div></div><span>One of the world leading identity and data protection vendors are seeking a Professional Services Consultant to join their experienced team. The Professional Services Consultant will work closely with enterprise customers across EMEA, implementing the vendor’s suite of Data Protection solutions including encryption, PKI and key management.<br><br><b>Responsibilities:</b><br><ul><li>Working directly with enterprise customers, helping generate revenue and install vendor solutions</li><li>Coordinating with product management and research and development to feedback and help improve vendor solutions</li><li>Occasionally helping out pre-sales as a product specialist for encryption solutions</li><li>Regular travel across EMEA – especially across Northern Europe</li></ul><br><b>Requirements:</b><br><ul><li>Ability to be hands, going into technical detail</li><li>Experience with, and technical skills surrounding cryptography, PKI, encryption, key management, digital signature and HSM</li><li>Problem solving skills with experience in architecture design</li><li>Customer facing and consultative approach</li><li>Experience in networking principles and protocols</li><li>Programming background and experience (Java, C++, .NET, SQL, XML)</li><li>Familiar with Unix/Linux and Windows systems</li><li>Ability to travel up to 50% across EMEA</li></ul><br><b>Benefits:</b><br><br>In return, you will receive a competitive base salary and bonus, plus a full range of benefits. You will have the chance to work with some of the worlds’ best and most innovative products in the IDP space, all whilst working at a company who truly provide great opportunities for career progression. The team is collaborative, well supported and personal accomplishments are celebrated.<br><br>This role will be working from a home office, plus travel.<br><br>Acumin is a member of the Red Snapper Group. The Red Snapper Group acts as an employment agency (permanent) and as an employment business (temporary) - a confidential service to candidates. The Red Snapper Recruitment Group is an equal opportunities employer.</span>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 9:11:52 PM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_50",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "_qNgIUfDQTe9_gb4skqMBw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Professional+Service+Consultant+Cyber+Security+London&c=Acumin+Consulting&l=Home+Based&jk=0788dbf702d4d8d2&rtk=1bu5csft316v50jj&from=rss",
    "title": "Professional Services Consultant – Cyber Security – London - Acumin Consulting - Home Based",
    "content": "<div><b>Professional Services Consultant – Cyber Security – London</b><br><span>Acumin Consulting</span> -<span>Home Based</span><div><span>Full-time,&nbsp;Permanent</span></div></div><span>One of the world leading identity and data protection vendors are seeking a Professional Services Consultant to join their experienced team. The Professional Services Consultant will work closely with enterprise customers across EMEA, implementing the vendor’s suite of Data Protection solutions including encryption, PKI and key management.<br><br><b>Responsibilities:</b><br><ul><li>Working directly with enterprise customers, helping generate revenue and install vendor solutions</li><li>Coordinating with product management and research and development to feedback and help improve vendor solutions</li><li>Occasionally helping out pre-sales as a product specialist for encryption solutions</li><li>Regular travel across EMEA – especially across Northern Europe</li></ul><br><b>Requirements:</b><br><ul><li>Ability to be hands, going into technical detail</li><li>Experience with, and technical skills surrounding cryptography, PKI, encryption, key management, digital signature and HSM</li><li>Problem solving skills with experience in architecture design</li><li>Customer facing and consultative approach</li><li>Experience in networking principles and protocols</li><li>Programming background and experience (Java, C++, .NET, SQL, XML)</li><li>Familiar with Unix/Linux and Windows systems</li><li>Ability to travel up to 50% across EMEA</li></ul><br><b>Benefits:</b><br><br>In return, you will receive a competitive base salary and bonus, plus a full range of benefits. You will have the chance to work with some of the worlds’ best and most innovative products in the IDP space, all whilst working at a company who truly provide great opportunities for career progression. The team is collaborative, well supported and personal accomplishments are celebrated.<br><br>This role will be working from a home office, plus travel.<br><br>Acumin is a member of the Red Snapper Group. The Red Snapper Group acts as an employment agency (permanent) and as an employment business (temporary) - a confidential service to candidates. The Red Snapper Recruitment Group is an equal opportunities employer.</span>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 9:11:52 PM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_50",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "D0qftgLCRje-3DSglUlrPw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Professional+Service+Consultant+Cyber+Security+London&c=Acumin+Consulting&l=Home+Based&jk=0788dbf702d4d8d2&rtk=1bu5jdnsa14bm0uh&from=rss",
    "title": "Professional Services Consultant – Cyber Security – London - Acumin Consulting - Home Based",
    "content": "<div><b>Professional Services Consultant – Cyber Security – London</b><br><span>Acumin Consulting</span> -<span>Home Based</span><div><span>Full-time,&nbsp;Permanent</span></div></div><span>One of the world leading identity and data protection vendors are seeking a Professional Services Consultant to join their experienced team. The Professional Services Consultant will work closely with enterprise customers across EMEA, implementing the vendor’s suite of Data Protection solutions including encryption, PKI and key management.<br><br><b>Responsibilities:</b><br><ul><li>Working directly with enterprise customers, helping generate revenue and install vendor solutions</li><li>Coordinating with product management and research and development to feedback and help improve vendor solutions</li><li>Occasionally helping out pre-sales as a product specialist for encryption solutions</li><li>Regular travel across EMEA – especially across Northern Europe</li></ul><br><b>Requirements:</b><br><ul><li>Ability to be hands, going into technical detail</li><li>Experience with, and technical skills surrounding cryptography, PKI, encryption, key management, digital signature and HSM</li><li>Problem solving skills with experience in architecture design</li><li>Customer facing and consultative approach</li><li>Experience in networking principles and protocols</li><li>Programming background and experience (Java, C++, .NET, SQL, XML)</li><li>Familiar with Unix/Linux and Windows systems</li><li>Ability to travel up to 50% across EMEA</li></ul><br><b>Benefits:</b><br><br>In return, you will receive a competitive base salary and bonus, plus a full range of benefits. You will have the chance to work with some of the worlds’ best and most innovative products in the IDP space, all whilst working at a company who truly provide great opportunities for career progression. The team is collaborative, well supported and personal accomplishments are celebrated.<br><br>This role will be working from a home office, plus travel.<br><br>Acumin is a member of the Red Snapper Group. The Red Snapper Group acts as an employment agency (permanent) and as an employment business (temporary) - a confidential service to candidates. The Red Snapper Recruitment Group is an equal opportunities employer.</span>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 9:11:52 PM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_50",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "kFX86nTMSb-VmalAx_RUVg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5651-client-support-communication-strategist",
    "title": "CafeMedia: Client Support - Communication Strategist",
    "content": "<div>  <div>    <h2>Client Support - Communication Strategist</h2>      <h4>Posted Nov  2</h4>    <h3>      <span>CafeMedia</span><br>      <span>Headquarters: New York, NY</span><br>        <a href='http://www.cafemedia.com/career.php' rel='nofollow'>http://www.cafemedia.com/career.php</a>    </h3>  </div></div>  <div>    <div>This position can be in-office in NYC or remote work-from-home. Remote U.S. candidates are encouraged to apply.</div><div><br></div><div><strong>Our company and mission</strong></div><div>AdThrive helps professional publishers make more money with ads on their site by acting as their trusted expert guide in the Wild-West-like world of online advertising. This means helping them figure out which ad networks to use, strategizing how to place ads on their site, and then actually setting the ads up for them for them. Through our work, we help the best creators and contributors on the web: people who have a passion for their craft (cooking, decorating, parenting, finance, investing) get to write about their passion and be paid to live their dream. We help bloggers leave their full-time jobs and stay home with their kids. We help struggling families pay their bills and find hope. We support the people who are creating the internet!</div><div><br></div><div>As a Client Support &amp; Communication Strategist for AdThrive, you understand the blogging industry and are immersed in current trends. You’re the kind of person who enjoys helping people and going out of your way to make sure they’re happy. You have a keen sense of awareness in regard to the human condition; how people are diverse, how they all need love and kindness. The thought of helping someone in even the smallest way warms you to your core!</div><div><br></div><div>We’re looking for someone who would be happy to spend most of their day crafting up helpful responses to client questions via email, social media and our support ticket system and proactively engaging with them in order to establish and build relationships. This will include analyzing how their ads are performing, coming up with smart, creative ways to frame analytical data so that &quot;non-numbers&quot; type people can understand it, and working with our small team in meetings to strategize and plan so that we can constantly work towards making our services better for our community of bloggers and publishers. Bottom line: Our company’s heart is to serve the best content creators on the web!</div><div><br></div><div><strong>Day in the Life</strong></div><div><br></div><ul><li>Responsible for building and maintaining awesome relationships with clients through written communication</li><li>Drafting up stellar blog &amp; social media posts that will be widely read and shared with publishers</li><li>Refining other drafts&nbsp;in to&nbsp;pure gold</li><li>Crafting thoughtful, personal responses to client questions in our support system (Zendesk)</li><li>Analyzing ad layouts and earnings</li><li>Administrative/data entry tasks</li><li>Being an active member of a distributed team via tools like Slack, G Suite, Zoom, Zendesk, Appear.in and more</li><li>Communicating complex concepts simply and creatively</li><li>Organizing data to find solutions</li><li>Analytical decision making and&nbsp;problem solving</li></ul><div><strong><br></strong></div><div><strong>You’ll do well if you have:</strong></div><div><br></div><ul><li>Patience, grace, a sense of humor, and some moderate GIF sharing abilities</li><li>Excellent writing and communication skills</li><li>A passion for solving tough problems and proposing elegant solutions</li><li>A desire to make everything you touch better</li><li>Genuine desire to help others solve problems and succeed</li><li>High level of comfort working in a&nbsp;fast paced&nbsp;environment</li><li>Creativity in your veins</li><li>A willingness to learn new things and adapt to change</li><li>Familiarity with current blogging trends and insights</li></ul><div><strong><br></strong></div><div><strong>Qualifications:</strong></div><div><br></div><ul><li>1+ years of WordPress or equivalent blogging experience</li><li>Strong written communication skills</li><li>Understanding of people - what makes them tick, picking up what they mean even if it's different than what they said, etc.</li><li>Data comparison/analysis and high levels of comfort with spreadsheets</li><li>Working understanding of Blogging &amp; SEO</li><li>Commitment to AdThrive’s Mission Statement</li></ul><div><br></div><div>We do have a lot of applicants come through for this position. Want to increase your chances of standing out? If so, please address the following points in your email/cover:</div><div><br></div><ol><li>Share an example of your writing somewhere online - your own blog, an article you’ve written for another site, etc.,</li><li>Have you ever participated in an amazing customer support team? Tell us more about that and what made it so memorable?</li><li>Are you driven to learn new things? Tell us about an accomplishment in your life that you’re proud of, or the last time you learned something new.</li><li>Pick one company that you feel represents the best customer service you’ve ever experienced and&nbsp;explain&nbsp;why you chose them.</li><li>Show off your creativity in some way (yep, we’re keeping this vague on purpose)!</li></ol><div></div><div><br></div><div>There is&nbsp;limitless&nbsp;opportunity here for the person who makes themselves valuable. We're a young company and growing fast, so strong leaders and strong performers will have&nbsp;opportunity&nbsp;to grow and see increasing responsibility.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='http://cafemedia.applytojob.com/apply/r81TxtiU5b/Client-Support-Communication-Strategist' rel='nofollow'>http://cafemedia.applytojob.com/apply/r81TxtiU5b/Client-Support-Communication-Strategist</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 4:33:08 PM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_50",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "WyyF4SOPT5GjdEwKqISp4Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Customer+Partner&c=Guidewire+Software&l=Remote&jk=b405205ec36d8692&rtk=1bu3ept3l0k3a50o&from=rss",
    "title": "Customer Partner, GPS - Remote, US - Guidewire Software, Inc. - Remote",
    "content": "<div><b>Customer Partner, GPS - Remote, US</b><br><span>Guidewire Software, Inc.</span> -<span>Remote</span></div><span><b>Job Title:</b> GPS – Customer Partner<br><b>Job Location:</b> Remote - U.S.<br><br><b>Summary:</b><br>We are looking for a Customer Partner to join our Guidewire Production Services (GPS) team.<br><br>We are Guidewire Software, and we're perhaps the best company to work for that you've never heard of. We are proud to be voted a “Top 3” employer on Glassdoor by our own employees, and positioned as a market leader by industry experts like Gartner. We serve the second-largest financial services industry in the world (after banking), worth $2 trillion USD. We build the core applications that companies use to sell insurance policies, settle claims, and bill their customers. We also have a portfolio of products serving the innovative needs of our customers in areas such as data management, digital online portals, and predictive analytics. We serve customers all over the world, helping them handle billions of dollars of business. This is a lucrative and underserved market, and we have grown rapidly through a combination of quality products, excellent service, innovative technology, and a passionate belief in our core values of rationality, collegiality &amp; integrity.<br><br>The applications we build are large and extraordinarily complex, and they have to work reliably. More importantly, they have to be able to be implemented in a strategic and timely manner, and of course in a way that keeps them flexible yet maintainable. We’re looking for an experienced Customer Partner that can build and maintain a strong relationship with our managed services customers, and whom can provide maintenance and implementation leadership on the ground at the customer’s work location. This role will serve as a customer lead and will work directly with the GPS team back in the Dublin office. As the leader and chief customer advocate, you will collaborate closely with an impressive team of peers whose primary goal is our customer’s success. While leadership capability is important, the successful candidate will also have the ability to roll up their sleeves and get involved in the application configuration and integration work that is required to care for the customer’s implementation. We particularly value demonstrated leadership capability, excellent organization skills, negotiation skills to successfully work as a liaison between the customer and the Guidewire GPS team, and of course the ability to work well as part of an overall team.<br><br><b>The Role:</b><br>The Guidewire Services Center in Dublin, Ireland was established to help meet a growing global customer demand for expertise in implementing Guidewire’s products. Recently, you may have heard of the drive for corporate enterprises to deploy applications in the cloud. This trend will impact our customers and industry in the same way it is forcing other industries to evolve. The Guidewire Production Services (GPS) is part of our Guidewire Services Center in Dublin, Ireland. This team will deploy, enhance, and maintain our customer’s Guidewire product instance(s) in a hosted environment. The GPS Customer Partner will serve as a dedicated customer advocate and trusted advisor, and will be responsible for the identification, elaboration, high level design, and prioritization of the customer’s production defects and system enhancements. These defects and enhancements must then be communicated to the GPS team in the Dublin office, so strong project management and communication skills are a must. For the first 2-3 months after go live, the Customer Partner will work on site directly with the customer, but it is expected as time goes on this role will be done on a remote basis with occasional on site visits necessary.<br><br><b>Responsibilities:</b><br>We live by our core principles of integrity, rationality, and collegiality. Your first responsibility is always to adhere to these principles in everything that you do.<br>Authorized to work in the U.S. or Canada, with preference given to somebody located in the Northeastern U.S.<br>This role will require ability to travel onsite to the customer on a scheduled basis. As the Managed Services customer base grows, you may take on responsibilities for other customers that also require occasional travel.<br>This role has potential for occasional travel to the Dublin, Ireland office.<br>Build and expand a working knowledge of Guidewire's suite of products (Core, Digital, and Data Management) in order to understand their key functions, and to be able to guide customer requirements and design sessions<br>Partner with client business teams to understand their functional and technical system requirements and be able to lead the effort to estimate and prioritize these requirements.<br>Ability to manage and direct work efforts of a remote team.<br>Ability to clearly communicate functional and technical requirements to a remote team.<br>Contribute to a team environment that will have both local and remote leadership.<br>Aspects of the position involve commitment to customer SLA’s. While the Customer Partner will work during normal business hours of the customer, occasional high priority work outside of established business hours may be necessary (i.e., to help with urgent customer issues).<br><br><b>Desired Skills/Experience:</b><br>Strong communication and interpersonal skills (mandatory)<br>Applied Project Management experience (mandatory)<br>Demonstrated problem solving skills (mandatory)<br>Ability to prioritize tasks and differentiate between Production issues and future enhancement work<br>Proven ability to influence customers and build relationships, both with “on the ground” resources and those in Management/Executive roles<br>7+ years of working with Guidewire core applications<br>5+ years of experience leading and managing implementation teams (or team tracks) within a Corporate IT or Consulting environment (Guidewire projects preferred)<br>Flexible, enthusiastic approach to work including a strong desire to learn new products and a new business domain<br>Strong Guidewire Configuration skills necessary to assist with development activity<br>Experience working in an environment with cloud/off-premise enterprise applications<br>Experience working with leading cloud platform Infrastructure as a Service (IaaS) providers such as AWS or Microsoft Azure<br>Experience with a commercial customer incident tracking or CRM system<br>Experience using a software defect tracking system such as JIRA<br>Ability to direct work effort based on a dynamic work environment<br><br><b>Requirements:</b><br>Bachelors in Computer Science or equivalent from higher education institution<br>Advanced exposure to broad technical skills such as Object Oriented programming (JAVA , C#, or similar), relational databases (data modeling/SQL), web UI (design and development), XML, application architecture<br>Software development lifecycle exposure (AGILE) preferred<br><br>Why Guidewire?<br>As a team, our mission is to provide distinguished consulting and support services to prospects, partners, and customers which result in 100 percent reference-able customers which guides us in all that we do.<br><br>Guidewire has pursued one mission from its founding as a company in 2001: to be the pre-eminent provider of next-generation core systems — policy, claims, and billing — to the global property-casualty insurance industry. All of our employees understand that we serve only one industry and strive to solve one problem: to enable insurance carriers to migrate completely from legacy systems to a modern core system platform. We have recruited extensively among experts in the industry to ensure that we learn from veterans of insurance system design and implementation. Today, insurance experience is pervasive throughout the Guidewire organization, especially in our Product Management and Implementation Services groups. The company is headquartered in Foster City, California, US with offices in London, Dublin, Paris, Munich, Sydney, Toronto, Tokyo, Hong Kong, and operations in Poland and mainland China. Guidewire is owned by its employees and is publicly traded on the NYSE under the call sign GWRE.</span>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 3:54:54 AM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_50",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "TCHTryuuSjmnUQtrjMRSwQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Customer+Partner&c=Guidewire+Software&l=Remote&jk=b405205ec36d8692&rtk=1bu5csfc20g1977b&from=rss",
    "title": "Customer Partner, GPS - Remote, US - Guidewire Software, Inc. - Remote",
    "content": "<div><b>Customer Partner, GPS - Remote, US</b><br><span>Guidewire Software, Inc.</span> -<span>Remote</span></div><span><b>Job Title:</b> GPS – Customer Partner<br><b>Job Location:</b> Remote - U.S.<br><br><b>Summary:</b><br>We are looking for a Customer Partner to join our Guidewire Production Services (GPS) team.<br><br>We are Guidewire Software, and we're perhaps the best company to work for that you've never heard of. We are proud to be voted a “Top 3” employer on Glassdoor by our own employees, and positioned as a market leader by industry experts like Gartner. We serve the second-largest financial services industry in the world (after banking), worth $2 trillion USD. We build the core applications that companies use to sell insurance policies, settle claims, and bill their customers. We also have a portfolio of products serving the innovative needs of our customers in areas such as data management, digital online portals, and predictive analytics. We serve customers all over the world, helping them handle billions of dollars of business. This is a lucrative and underserved market, and we have grown rapidly through a combination of quality products, excellent service, innovative technology, and a passionate belief in our core values of rationality, collegiality &amp; integrity.<br><br>The applications we build are large and extraordinarily complex, and they have to work reliably. More importantly, they have to be able to be implemented in a strategic and timely manner, and of course in a way that keeps them flexible yet maintainable. We’re looking for an experienced Customer Partner that can build and maintain a strong relationship with our managed services customers, and whom can provide maintenance and implementation leadership on the ground at the customer’s work location. This role will serve as a customer lead and will work directly with the GPS team back in the Dublin office. As the leader and chief customer advocate, you will collaborate closely with an impressive team of peers whose primary goal is our customer’s success. While leadership capability is important, the successful candidate will also have the ability to roll up their sleeves and get involved in the application configuration and integration work that is required to care for the customer’s implementation. We particularly value demonstrated leadership capability, excellent organization skills, negotiation skills to successfully work as a liaison between the customer and the Guidewire GPS team, and of course the ability to work well as part of an overall team.<br><br><b>The Role:</b><br>The Guidewire Services Center in Dublin, Ireland was established to help meet a growing global customer demand for expertise in implementing Guidewire’s products. Recently, you may have heard of the drive for corporate enterprises to deploy applications in the cloud. This trend will impact our customers and industry in the same way it is forcing other industries to evolve. The Guidewire Production Services (GPS) is part of our Guidewire Services Center in Dublin, Ireland. This team will deploy, enhance, and maintain our customer’s Guidewire product instance(s) in a hosted environment. The GPS Customer Partner will serve as a dedicated customer advocate and trusted advisor, and will be responsible for the identification, elaboration, high level design, and prioritization of the customer’s production defects and system enhancements. These defects and enhancements must then be communicated to the GPS team in the Dublin office, so strong project management and communication skills are a must. For the first 2-3 months after go live, the Customer Partner will work on site directly with the customer, but it is expected as time goes on this role will be done on a remote basis with occasional on site visits necessary.<br><br><b>Responsibilities:</b><br>We live by our core principles of integrity, rationality, and collegiality. Your first responsibility is always to adhere to these principles in everything that you do.<br>Authorized to work in the U.S. or Canada, with preference given to somebody located in the Northeastern U.S.<br>This role will require ability to travel onsite to the customer on a scheduled basis. As the Managed Services customer base grows, you may take on responsibilities for other customers that also require occasional travel.<br>This role has potential for occasional travel to the Dublin, Ireland office.<br>Build and expand a working knowledge of Guidewire's suite of products (Core, Digital, and Data Management) in order to understand their key functions, and to be able to guide customer requirements and design sessions<br>Partner with client business teams to understand their functional and technical system requirements and be able to lead the effort to estimate and prioritize these requirements.<br>Ability to manage and direct work efforts of a remote team.<br>Ability to clearly communicate functional and technical requirements to a remote team.<br>Contribute to a team environment that will have both local and remote leadership.<br>Aspects of the position involve commitment to customer SLA’s. While the Customer Partner will work during normal business hours of the customer, occasional high priority work outside of established business hours may be necessary (i.e., to help with urgent customer issues).<br><br><b>Desired Skills/Experience:</b><br>Strong communication and interpersonal skills (mandatory)<br>Applied Project Management experience (mandatory)<br>Demonstrated problem solving skills (mandatory)<br>Ability to prioritize tasks and differentiate between Production issues and future enhancement work<br>Proven ability to influence customers and build relationships, both with “on the ground” resources and those in Management/Executive roles<br>7+ years of working with Guidewire core applications<br>5+ years of experience leading and managing implementation teams (or team tracks) within a Corporate IT or Consulting environment (Guidewire projects preferred)<br>Flexible, enthusiastic approach to work including a strong desire to learn new products and a new business domain<br>Strong Guidewire Configuration skills necessary to assist with development activity<br>Experience working in an environment with cloud/off-premise enterprise applications<br>Experience working with leading cloud platform Infrastructure as a Service (IaaS) providers such as AWS or Microsoft Azure<br>Experience with a commercial customer incident tracking or CRM system<br>Experience using a software defect tracking system such as JIRA<br>Ability to direct work effort based on a dynamic work environment<br><br><b>Requirements:</b><br>Bachelors in Computer Science or equivalent from higher education institution<br>Advanced exposure to broad technical skills such as Object Oriented programming (JAVA , C#, or similar), relational databases (data modeling/SQL), web UI (design and development), XML, application architecture<br>Software development lifecycle exposure (AGILE) preferred<br><br>Why Guidewire?<br>As a team, our mission is to provide distinguished consulting and support services to prospects, partners, and customers which result in 100 percent reference-able customers which guides us in all that we do.<br><br>Guidewire has pursued one mission from its founding as a company in 2001: to be the pre-eminent provider of next-generation core systems — policy, claims, and billing — to the global property-casualty insurance industry. All of our employees understand that we serve only one industry and strive to solve one problem: to enable insurance carriers to migrate completely from legacy systems to a modern core system platform. We have recruited extensively among experts in the industry to ensure that we learn from veterans of insurance system design and implementation. Today, insurance experience is pervasive throughout the Guidewire organization, especially in our Product Management and Implementation Services groups. The company is headquartered in Foster City, California, US with offices in London, Dublin, Paris, Munich, Sydney, Toronto, Tokyo, Hong Kong, and operations in Poland and mainland China. Guidewire is owned by its employees and is publicly traded on the NYSE under the call sign GWRE.</span>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 3:54:54 AM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_50",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "fGBd_vVVT6i2Y9urfbOi1w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Customer+Partner&c=Guidewire+Software&l=Remote&jk=b405205ec36d8692&rtk=1bu5jdnb40g2d4vv&from=rss",
    "title": "Customer Partner, GPS - Remote, US - Guidewire Software, Inc. - Remote",
    "content": "<div><b>Customer Partner, GPS - Remote, US</b><br><span>Guidewire Software, Inc.</span> -<span>Remote</span></div><span><b>Job Title:</b> GPS – Customer Partner<br><b>Job Location:</b> Remote - U.S.<br><br><b>Summary:</b><br>We are looking for a Customer Partner to join our Guidewire Production Services (GPS) team.<br><br>We are Guidewire Software, and we're perhaps the best company to work for that you've never heard of. We are proud to be voted a “Top 3” employer on Glassdoor by our own employees, and positioned as a market leader by industry experts like Gartner. We serve the second-largest financial services industry in the world (after banking), worth $2 trillion USD. We build the core applications that companies use to sell insurance policies, settle claims, and bill their customers. We also have a portfolio of products serving the innovative needs of our customers in areas such as data management, digital online portals, and predictive analytics. We serve customers all over the world, helping them handle billions of dollars of business. This is a lucrative and underserved market, and we have grown rapidly through a combination of quality products, excellent service, innovative technology, and a passionate belief in our core values of rationality, collegiality &amp; integrity.<br><br>The applications we build are large and extraordinarily complex, and they have to work reliably. More importantly, they have to be able to be implemented in a strategic and timely manner, and of course in a way that keeps them flexible yet maintainable. We’re looking for an experienced Customer Partner that can build and maintain a strong relationship with our managed services customers, and whom can provide maintenance and implementation leadership on the ground at the customer’s work location. This role will serve as a customer lead and will work directly with the GPS team back in the Dublin office. As the leader and chief customer advocate, you will collaborate closely with an impressive team of peers whose primary goal is our customer’s success. While leadership capability is important, the successful candidate will also have the ability to roll up their sleeves and get involved in the application configuration and integration work that is required to care for the customer’s implementation. We particularly value demonstrated leadership capability, excellent organization skills, negotiation skills to successfully work as a liaison between the customer and the Guidewire GPS team, and of course the ability to work well as part of an overall team.<br><br><b>The Role:</b><br>The Guidewire Services Center in Dublin, Ireland was established to help meet a growing global customer demand for expertise in implementing Guidewire’s products. Recently, you may have heard of the drive for corporate enterprises to deploy applications in the cloud. This trend will impact our customers and industry in the same way it is forcing other industries to evolve. The Guidewire Production Services (GPS) is part of our Guidewire Services Center in Dublin, Ireland. This team will deploy, enhance, and maintain our customer’s Guidewire product instance(s) in a hosted environment. The GPS Customer Partner will serve as a dedicated customer advocate and trusted advisor, and will be responsible for the identification, elaboration, high level design, and prioritization of the customer’s production defects and system enhancements. These defects and enhancements must then be communicated to the GPS team in the Dublin office, so strong project management and communication skills are a must. For the first 2-3 months after go live, the Customer Partner will work on site directly with the customer, but it is expected as time goes on this role will be done on a remote basis with occasional on site visits necessary.<br><br><b>Responsibilities:</b><br>We live by our core principles of integrity, rationality, and collegiality. Your first responsibility is always to adhere to these principles in everything that you do.<br>Authorized to work in the U.S. or Canada, with preference given to somebody located in the Northeastern U.S.<br>This role will require ability to travel onsite to the customer on a scheduled basis. As the Managed Services customer base grows, you may take on responsibilities for other customers that also require occasional travel.<br>This role has potential for occasional travel to the Dublin, Ireland office.<br>Build and expand a working knowledge of Guidewire's suite of products (Core, Digital, and Data Management) in order to understand their key functions, and to be able to guide customer requirements and design sessions<br>Partner with client business teams to understand their functional and technical system requirements and be able to lead the effort to estimate and prioritize these requirements.<br>Ability to manage and direct work efforts of a remote team.<br>Ability to clearly communicate functional and technical requirements to a remote team.<br>Contribute to a team environment that will have both local and remote leadership.<br>Aspects of the position involve commitment to customer SLA’s. While the Customer Partner will work during normal business hours of the customer, occasional high priority work outside of established business hours may be necessary (i.e., to help with urgent customer issues).<br><br><b>Desired Skills/Experience:</b><br>Strong communication and interpersonal skills (mandatory)<br>Applied Project Management experience (mandatory)<br>Demonstrated problem solving skills (mandatory)<br>Ability to prioritize tasks and differentiate between Production issues and future enhancement work<br>Proven ability to influence customers and build relationships, both with “on the ground” resources and those in Management/Executive roles<br>7+ years of working with Guidewire core applications<br>5+ years of experience leading and managing implementation teams (or team tracks) within a Corporate IT or Consulting environment (Guidewire projects preferred)<br>Flexible, enthusiastic approach to work including a strong desire to learn new products and a new business domain<br>Strong Guidewire Configuration skills necessary to assist with development activity<br>Experience working in an environment with cloud/off-premise enterprise applications<br>Experience working with leading cloud platform Infrastructure as a Service (IaaS) providers such as AWS or Microsoft Azure<br>Experience with a commercial customer incident tracking or CRM system<br>Experience using a software defect tracking system such as JIRA<br>Ability to direct work effort based on a dynamic work environment<br><br><b>Requirements:</b><br>Bachelors in Computer Science or equivalent from higher education institution<br>Advanced exposure to broad technical skills such as Object Oriented programming (JAVA , C#, or similar), relational databases (data modeling/SQL), web UI (design and development), XML, application architecture<br>Software development lifecycle exposure (AGILE) preferred<br><br>Why Guidewire?<br>As a team, our mission is to provide distinguished consulting and support services to prospects, partners, and customers which result in 100 percent reference-able customers which guides us in all that we do.<br><br>Guidewire has pursued one mission from its founding as a company in 2001: to be the pre-eminent provider of next-generation core systems — policy, claims, and billing — to the global property-casualty insurance industry. All of our employees understand that we serve only one industry and strive to solve one problem: to enable insurance carriers to migrate completely from legacy systems to a modern core system platform. We have recruited extensively among experts in the industry to ensure that we learn from veterans of insurance system design and implementation. Today, insurance experience is pervasive throughout the Guidewire organization, especially in our Product Management and Implementation Services groups. The company is headquartered in Foster City, California, US with offices in London, Dublin, Paris, Munich, Sydney, Toronto, Tokyo, Hong Kong, and operations in Poland and mainland China. Guidewire is owned by its employees and is publicly traded on the NYSE under the call sign GWRE.</span>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 3:54:54 AM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_50",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "BOWKHEmyTlSJ6ENfSjV49Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5643-customer-support-engineer",
    "title": "Nookal: Customer Support Engineer",
    "content": "<div>  <div>    <h2>Customer Support Engineer</h2>      <h4>Posted Nov  1</h4>    <h3>      <span>Nookal</span><br>      <span>Headquarters: Gold Coast, QLD, Australia</span><br>        <a href='http://www.nookal.com' rel='nofollow'>www.nookal.com</a>    </h3>  </div>    </div>  <div>    <div>We are looking for a Customer Success Engineer who is resourceful; using troubleshooting and analytical skills to serve our customers via email, chat and phone calls along with the ability to talk new clients through the process of signing up to Nookal.</div><div><br></div><div>In this role you’ll work one-on-one with customers and together with the rest of the support team to help support them in the initial stages of using our system. You’ll be an advocate to help customers get the most out of Nookal. You’ll also love diving into tickets, phone calls or even live chats – anything that can be done to go the extra mile to better serve our customers.</div><div><br></div><div>You care about customers and their success. Not only because their long-term success means that we’ll be more successful as a company, but also because you really love helping people and seeing them succeed. Secondly you’re happy to help new clients out, looking to sign up. You will talk them through the process of how Nookal can help them.</div><div><br></div><div>You’re a fantastic communicator and must be fluent in written English. The importance of communication, especially in a remote team, cannot be overstated. The default should be to over share progress, good things that are happening, customer concerns, and anything you see as an opportunity to improve our company.<br></div><div></div><div><br></div><div>Responsibilities</div><div><br></div><div>This is a full time position working in the East Coast of Australian time zone.&nbsp;</div><div><br></div><div>Combining technical expertise with customer service to resolve questions and issues.</div><div><br></div><div>• Able to communicate clearly in writing for both technical and non-technical people<br></div><div></div><div>• Document and build new tools to improve support flows.<br></div><div></div><div>• Identify patterns - recommend improvements, and filter our unimportant issues.&nbsp;<br></div><div></div><div>• Authoring Success documentation for our customer facing Knowledge base.&nbsp;<br></div><div></div><div>• Assist with successful on-boarding of new customers<br></div><div></div><div>• Detail oriented, to prove this make sure to add to job application headline &quot;I am detailed oriented&quot;.<br></div><div></div><div>• 2+ Years experience in a similar role at another SaaS company<br></div><div></div><div>• Excellent organizational and communication skills.&nbsp;<br></div><div></div><div>• Excellent customer service skills with a polite, patient, caring, calm and professional demeanour.<br></div><div></div><div>• Language requirements, English fluency (written and spoken)<br></div><div></div><div>• Background in the software industry a bonus</div><div><br></div><div>Here’s a list of common tasks that a support agent at Nookal could be asked to participate in day to day.</div><div><br></div><div>• Assist with the data migration from an existing PMS to Nookal<br></div><div></div><div>• Advise a client how best to use Nookal to assist them with their business goals<br></div><div></div><div>• Provide one to one training to help a receptionist use the system<br></div><div></div><div>• Assisting a customer to understand how to manage Third Party/Health Insurance claims<br></div><div></div><div>• Advising a customer how to reset their password<br></div><div></div><div>• Managing our Social Media profile<br></div><div></div><div>• Spend some time with a customer training them in the use of our reporting system</div><div><br></div><div>Technical Skills (Required)&nbsp;</div><div><br></div><div>Being a technical support agent requires proficiency in a number of different areas. A strong understanding of the following are critical to the role -</div><div><br></div><div>• Basic understanding of software development lifecycle (SDLC) methodologies.<br></div><div></div><div>• Understanding JavaScript/PHP/HTML and defect management tools in chrome/Firefox and Safari (in particular).<br></div><div></div><div>• Being a very competent writer with the ability to explain complex topics in easy to understand and concise language [English]</div><div><br></div><div>Reimbursement &amp; Benefits</div><div><br></div><div>We offer competitive salary based on experience of applicants.<br></div><div></div><div></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send a resume to <a href='mailto:darrenr@nookal.com' rel='nofollow'>darrenr@nookal.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 1, 2017 8:14:53 AM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "6TY6sZBnT9ehrW3fIh2tYw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5638-wordpress-support-happiness-engineer",
    "title": "CafeMedia: WordPress Support & Happiness Engineer",
    "content": "<div>  <div>    <h2>WordPress Support &amp; Happiness Engineer</h2>      <h4>Posted Oct 31</h4>    <h3>      <span>CafeMedia</span><br>      <span>Headquarters: New York</span><br>        <a href='http://www.cafemedia.com/career.php' rel='nofollow'>http://www.cafemedia.com/career.php</a>    </h3>  </div></div>  <div>    <div>This position can be in-office in NYC or remote work-from-home. Remote U.S. candidates are encouraged to apply.<br></div><div><span><br></span></div><div><span>AdThrive.com helps serious bloggers make more money with the ads on their site by acting as their trusted expert guide in the wild-west like </span>world<span> of online advertising. This means helping them figure out which ad placements to use, how to develop an ad strategy, and then actually installing that strategy for them. Through our work, we help the best creators and contributors on the web, people who have a passion for their craft (cooking, decorating, parenting, finance, investing) get to write about their passion and be paid to live their dream. We help bloggers leave their full-time jobs and stay home with their kids. We help struggling families pay their bills and find hope. We support the people who are creating the internet!</span></div><div><br></div><div>As an AdThrive Wordpress Support &amp; Happiness Engineer, you’re the kind of person who is passionate about helping people. It shapes your worldview. Perhaps you’re already active in helping people online through the WordPress.com or WordPress.org forums, or contribute&nbsp;to other online communities like GitHub, StackOverflow, StudioPress, etc. The thought of helping families earn enough money for one parent to stay home or to cover their mortgage gives you goosebumps.</div><div><br></div><div>We are looking for people with the right mix of compassion, writing skills, and technical knowledge to connect with creative publishers and get the job done for them.&nbsp; We do this through listening to their needs, understanding their goals, and then guiding them to the best outcome through the use of the advertising strategies we have mastered over time. We’re looking for fast-learning, creative, technically minded team members with a heart to serve the best content creators on the web.</div><div><br></div><div><span>Day in the Life:</span></div><div><br></div><ul><li>Crafting thoughtful, personal responses to client questions in our support system (Zendesk)</li><li>Troubleshooting and fixing problems on client websites (mostly WordPress)</li><li>Analyzing ad layouts and earnings</li><li>Making recommendations for improvements in ad layouts</li><li>Onboarding new clients by installing ads on their sites</li><li>Being an active member of a distributed team via tools like Slack, G Suite, Zoom, Zendesk, Appear.in and more</li><li>Understanding the needs of online publishers and crafting unique solutions to best serve their goals</li><li>Building on our community of support, knowledge, documentation, and resources to help our team serve our publishers</li><li>Working to understand a new development in the community/industry, overcoming new obstacles, and embracing a fast-paced virtual work environment</li></ul><div><span>You’ll do well if you have:</span></div><div><br></div><ul><li>Patience, grace, a sense of humor, and some moderate GIF sharing abilities</li><li>Excellent writing and communication skills</li><li>Working knowledge of WordPress, HTML5, CSS3, and JavaScript</li><li>A knack for taking technical language and making it understandable</li><li>A passion for solving tough problems and proposing elegant solutions</li><li>A desire to make everything you touch better</li><li>Genuine desire to help others solve problems and succeed</li><li>High level of comfort working in a fast paced environment</li></ul><div><span>Qualifications:</span></div><div><br></div><ul><li>2+ years of backend WordPress experience using the following languages: PHP, HTML, CSS, and JavaScript</li><li>Experience editing custom WordPress themes and plugins</li><li>Experience with common plugins such as W3 Total Cache and WooCommerce</li><li>Strong understanding of Google Analytics</li><li>Strong Written Communication (web-based copy, preferred)</li><li>Fluent understanding of online ecosystems (server and client side structure, hosting, CDN’s, pagespeed tests, front-end site optimization)</li><li>Commitment to AdThrive’s Mission Statement</li></ul><div>There is limitless opportunity here for the person who makes themselves valuable. We're a young company and growing fast, so strong leaders and strong performers will have opportunity to grow and see increasing responsibility.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>To apply for this job please fill out the application found at this link: <a href='http://cafemedia.applytojob.com/apply/FJrU10c5uD/WordPress-Support-Happiness-Engineer' rel='nofollow'>http://cafemedia.applytojob.com/apply/FJrU10c5uD/WordPress-Support-Happiness-Engineer</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 4:55:28 PM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_50",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "yip3irETTeCNU_R198Hd1Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5636-customer-advocate",
    "title": "Raisely: Customer Advocate",
    "content": "<div>  <div>    <h2>Customer Advocate</h2>      <h4>Posted Oct 31</h4>    <h3>      <span>Raisely</span><br>      <span>Headquarters: Remote</span><br>        <a href='http://raisely.com' rel='nofollow'>http://raisely.com</a>    </h3>  </div>    </div>  <div>    <div>We’re building the future of how charities engage with their supporters, but tech only gets us so far. We have the greatest impact when we’re helping our customers do amazing things with our products.</div><div><br></div><div>We’re looking for a Customer Advocate to join our growing, worldwide team. We want to find someone who is deeply passionate about technology, thrives on building relationships with customers and cares about a more just and equal world. If you’re all three, we want to meet you.</div><div><br></div><div>We’re looking for someone to take ownership over our customer experience. That means everything from onboarding to support and troubleshooting. You will manage our customer support channels, run demos, write help content and build personal relationships with each organisation using our products.</div><div><br></div><div>This is a full-time, remote role.</div><div><br></div><div><b>On a day-to-day basis you will:</b></div><div><b><br></b></div><ul><li>Communicate with customers over email, phone and video calls.<br></li><li>Welcome and train new customers, partnering with them to create successful fundraising campaigns and use their data well.<br></li><li>Provide technical support, debugging issues, making small HTML/CSS edits and handling complex or custom uses of our products.<br></li><li>Be a vocal advocate for our customers, bringing their feedback right into our product direction.<br></li><li>Strategise and make data-driven decisions to make our products better, and our customers love them more – from our onboarding through to ongoing checkins.<br></li><li>Own our support content, making it the go-to resource<br></li><li>Improve anything. Your job description doesn’t end with these bullet points.</li></ul><div><br></div><div><b>About you:</b></div><div><b><br></b></div><ul><li>You’re a go-getter, you thrive on finding problems and can’t rest until you solve them. You welcome an environment where you can learn and work independently.<br></li><li>You’re a superb communicator – written and verbal. You’re fluent in English with an engaging, conversational and disarming tone.<br></li><li>You’re patient and resilient, motivated by helping people and comfortable dealing with new and challenging situations<br></li><li>You’re deeply technical. You throw away the manual and figure things out for yourself. You know HTML, CSS and understand how computers talk.<br></li><li>You’re not comfortable with the status quo. You’re not in this for a quick dollar, you think the world needs to be better and that technology will get us there.</li></ul><div><br></div><div><b>About us:</b></div><div><b><br></b></div><ul><li>We’re a technology non-profit, working tirelessly to equip the for-purpose sector with products that make us all more impactful.<br></li><li>We’re currently a team of developers/campaigners/communicators that’s 5 strong, based in 4 countries.<br></li><li>We’re not your typical start-up. We’re ruthlessly focussed on our social impact, no one gets bonuses and we can’t make investors richer (we don’t have any).<br></li><li>We want to be diverse and encourage anyone regardless of race, gender, religion, sexuality, ethnicity, age or disability to apply.</li></ul><div><br></div><div><span><b>Requirements:</b></span></div><div><span><b><br></b></span></div><div><span>To do this role well we do need the following:</span></div><div><br></div><ul><li>Ability to work at least 3 hours a day within GMT+10/AEST (most of our customers are there currently).<br></li><li>A working understanding of HTML and CSS to customise people’s websites<br></li><li>Fluent written and spoken English<br></li><li>Appropriate permission to work where you live (we can’t sponsor work visas)</li></ul><div><br></div><div><b>Perks and Benefits:</b></div><div><b><br></b></div><div>We hope you’re excited by our unique blend of skills, our team and what we’re trying to achieve. But, to sweeten the deal, we offer these great benefits:</div><div><br></div><ul><li> <b>Technology</b> – We’ll get you an Apple laptop and screen when you start up.<br></li><li> <b>Salary</b> – We try to pay above-average salaries, adjusted for where you live and your experience. This role pays AU$57,000 - $70,000 a year (including super for Australian employees).<br></li><li>✈️ <b>Retreats</b> – Every year we fly you somewhere pretty (generally in Australia) for our company retreats, with the Agency crew!<br></li><li> <b>Annual</b> <b>Leave</b> – Everyone gets 4 weeks paid leave plus generous sick and compassionate leave.<br></li><li> <b>Work remotely</b> – We’re a remote-first company, live and work wherever you’re happiest. We’ll cover a coworking space if you’d like to work there.<br></li><li>⏰ <b>Flexibility</b> – Set your own hours and days and adjust as you need (as long as we’re still getting back to customers quickly!)<br></li><li> <b>Conferences</b> – We try to get to a digital campaigning or tech conference each year, ideally as a team!</li></ul><div><br></div><div><b>How to apply:</b></div><div><br></div><div>You’ve got this far! We really want to hear from you. Our application process consists of an interview and assessment task, but to kick off please email jobs@agency.sc with answers to the following questions:</div><div><br></div><ol><li>Why would you be a good fit for the Customer Advocate role?<br></li><li>Why do you want to work here over somewhere else?<br></li><li>Look at this list of tasks (https://gist.github.com/tommaitland/193b189f80d15309f4bfc475a3a7e81e) and tell us which two you are excited by, which two you want to learn and the two you don’t want to do.&nbsp;<br></li><li>Tell us about a company who does customer support well, and why you think they’re good.</li><li>Make a basic but neatly styled HTML page with these answers and send us the files or a link.</li></ol><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Email answers to the questions above to <a href='mailto:jobs@agency.sc' rel='nofollow'>jobs@agency.sc</a> with the subject line &quot;Customer Advocate Application&quot;. Feel free to add things like videos or work examples to your application and be creative to help us get to know you!</p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 3:05:34 PM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "XpP2EjQ3SmK5wIyOkLr8bQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5625-customer-support-specialist-available-for",
    "title": "Demio: Customer Support Specialist (Available for PST Hours)",
    "content": "<div>  <div>    <h2>Customer Support Specialist (Available for PST Hours)</h2>      <h4>Posted Oct 27</h4>    <h3>      <span>Demio</span><br>      <span>Headquarters: We're Remote :D</span><br>        <a href='https://demio.com' rel='nofollow'>https://demio.com</a>    </h3>  </div>    </div>  <div>    <div>Welcome! We’re excited to add a new <b>Customer Support Specialist</b> to our team, but not just any specialist.</div><div><br></div><div>We're looking for that someone special (yes, <i>we're hoping that's you</i>... keep reading to see ).</div><div><br></div><div></div><div><span>Someone that shares our same vision. Someone that is willing to join us on our journey to change the way that businesses communicate, market, and sell online. Someone that is process-oriented and driven by seeing customers succeed.</span></div><div><br></div><div></div><div><span>As a young start up (we're just coming up to our one year anniversary), we have tons of amazing users and are adding new great companies every single month.&nbsp; A wonderful customer experience is our primary focus here at Demio... from the customer support, to the onboarding process, to the platform itself, we're working to hard to make it all a delightful experience. While the webinar, web-communication space has been around for a while and continues to grow, we believe that we’re creating an entirely new segment in the market and doing it in a simple way.</span></div><div><br></div><div></div><div><span><b>Demio is a simple but incredibly powerful webinar platform built for SaaS and Software companies.</b> With our platform, companies can generate leads, filter prospects, perform group demos, engaging sales presentations, integrate with their CRM, view advanced webinar reporting, track conversions, and more. It’s truly unlike any other product in the market.&nbsp;</span></div><div><br></div><div></div><div><span>Our team is small, but nimble. We love to employ great people, and&nbsp;we're hoping you might be the right Customer Support Specialist to join us on the team!</span></div><div><br></div><div></div><div><span>However, we’re at the point now where we believe it could be pivotal to find the right person to fill that role. We want someone to join our team who is hungry to make an impact, constantly striving to improve, highly responsible for their actions, focused on output and results, and understands that great companies are built one small step at a time.</span></div><div><br></div><div></div><div><span>While we’re currently based in Tampa, FL, our entire team is remote, and we are happy to offer the ability to work remote with our team from&nbsp;<b>ANYWHERE</b> in the world through our systems in Slack (moving to Basecamp soon) and Trello. We'll do everything we can to make a stress free, easy to navigate operation inside so your role is just as simple as our platform!&nbsp; <b>This position in particular is needed to fill our West Coast time zone from (10AM PST to 7pm PST) Monday through Friday.</b></span></div><div><br></div><div></div><div><span>Not only will you be remote, but we will offer a great starting salary while working with a small, agile team that is hungry and eager to make an impact. Your work will never go unnoticed. Your work will <b>ALWAYS</b> make large waves in the company.</span></div><div><br></div><div></div><div><span>By joining now, you’ll be able to get in on the ground floor of Customer Support and help make some of the major procedures that will ultimately shape our entire company values and growth.&nbsp;</span></div><div><br></div><div></div><div><span>We have a philosophy for our company that revolves around our team: <b>we ONLY work with A-Players</b>. A-Players, in our opinion, are people who cannot accept anything that is less than great.</span></div><div><br></div><div></div><div><span>You’ll be able to work with a passionate, intelligent, and dedicated group of people that will allow you take your skills to the next level. You’ll always be challenged to be the best that you can be.</span></div><div><br></div><div></div><div><span>But hey, we also like to have fun too ; we understand that building a company is quite the journey, and it can be incredibly hard, so we believe that it’s important to enjoy the moments along the way.</span></div><div><br></div><div></div><div><span><b>Skills &amp; Requirements</b></span></div><div><br></div><div></div><div><span>What are we looking for from you? Well here’s a short list, but it will always be growing:</span></div><div><br></div><div></div><ul><li><span>A genuine passion for people and customer support (we truly appreciate all our users and want to give them a great experience)</span></li><li><span>Ability to be online and available <b>Monday through Friday from 10AM PST to 7pm PST </b>everyday&nbsp;</span></li><li><span>Excellent communication/english skills and ability to work well with remote teams (excellent verbal and written english skills)</span></li><li>Knowledge and experience with Intercom, GrooveHQ, or other live chat environments for Ticketing</li><li>Ability to track and manage customer tickets from our Support Desk into tools like Trello and Slack to clearly communicate with our engineering team for any ongoing bug tickets.</li><li><span>Love to take ownership of problems and develops innovative solutions to solve them.</span></li><li>Ability to prioritize and take control of situations at high ticket times to ensure customers are always taken care of.</li><li>Able to respond with a smile (or at least a smile emoji) on even the toughest tickets after a long day (Trust me, we've been there we all do support here at Demio. But, our customer happiness is always #1)</li></ul><div><br></div><div></div><div><span><b>What does the average day look like?</b> Imagine this:&nbsp;</span></div><div><br></div><div>Log in to our Slack (may be Basecamp soon) application when you login and high five the team already on ! Our team is all over the world, but we're always working together to innovate and move the company forward.&nbsp;</div><div><br></div><div>Review any development updates in Slack from your teammates on tickets, bugs, or what's new in the system for that day. Communication is always key here in a fast moving company!</div><div><br></div><div>Log into the Intercom support desk and GrooveHQ email desk and review any open tickets assigned from the day before, or assigned to you now.&nbsp; You'll want to make sure you are keeping customers updated on anything new or fixed on any remaining tickets.&nbsp;</div><div><br></div><div>New ticket in? Awesome! We'll be responding to tickets within our typical 3 - 5 minute span to make sure customers are supported and taken care of along the way.&nbsp; We always approve of GIF's, emoji's, and your personality to shine through to users. We're here to help, but no stuffy support here .</div><div><br></div><div>Found an issue? Let's add any issues/bugs into the proper Development Trello boards and write clear communications on what the problem was, how to produce it, and prioritize it's urgency to the proper engineer. Or, communicate in Slack with the development team on any urgent issues that are going on to solve immediately.&nbsp; It'll be important that you keep communication with the team to the customers live, so they also know what's going on.</div><div><br></div><div>Finally, you'll be communicating with new leads on the Demio website to move through our website, answer any questions, and checkout when they are ready. Yay!&nbsp;</div><div><br></div><div>Then, you can high five your teammates again when you log off and update the teammate coming in to help do the next few hours in Intercom.&nbsp;&nbsp;<br></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div>Once a month, we'll review the tickets, support desk, where to improve and weekly we'll look for better systems to make life even easier for Customers and Team alike!&nbsp;</div><div><br></div><div></div><div><span><b>About Demio</b></span></div><div><br></div><div></div><div><span>At Demio, we are creating a culture of excitement and growth, driven by results. We believe that day-by-day actions &amp; consistencies create lasting success; it’s the little things that matter. We’re creating the freshest, most innovative ideas for software that helps marketers flourish.</span></div><div><br></div><div></div><div><span>Having the freedom to propose and execute even your most out-there ideas for the company and getting all the support and coaching you need to be your best. All in a fun and positive way.</span></div><div><br></div><div></div><div><span><b>About the pay for this position:</b></span></div><div><br></div><div></div><div><span>The salary will be based on experience and your background in Customer Support. We're looking for the RIGHT person, but we want to make sure you are excited about your paycheck too!</span></div><div><br></div><div></div><div><span><b>What to do next:</b></span></div><div><br></div><div></div><div><span>If this sounds exciting to you, and you think working with an awesome startup company sounds great, let’s talk. Shoot us a reply with #DemioRocks in your subject line, and we’ll set up an interview.</span></div><div><br></div><div></div><div><span><b>Here’s what we’ll need in the email:</b></span></div><div><br></div><div></div><div><span>1. Send over a quick review of companies where you've succeeded in Customer Support/Success</span></div><div><br></div><div></div><div><span>2. A résumé is cool but not necessary, feel free to include any and all recommendations from past colleagues or employeers (LinkedIn works :D )</span></div><div><br></div><div></div><div><span>3. Tell us about you personally, stuff you’re into – what your goals are, where you are in life and where you want to be in life. This may not be your dream job, but who knows maybe we can work together to help it become so!</span></div><div><br></div><div></div><div><span>4. What’s your favorite book?</span></div><div><br></div><div></div><div><span>5. BONUS! Include a video of yourself telling us a little bit about yourself – just post it on Vimeo/YouTube/etc. This will greatly increase your chances of an interview! :)</span></div><div><br></div><div></div><div><span>That’s it! We look forward to meeting you!</span></div><div><br></div><div></div><div><span><b>JOB PERKS</b></span></div><div><br></div><div></div><div><span>2 Weeks Paid vacation, Love reading ebooks? (Use our digital library or request new books), Paid Access to Digital Courses for extended training, Free Gym Membership, 1 local Tech Event a month, Working with a truly Mission Driven team motivated by excellence</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>All emails should head over to <a href='mailto:Hiring@Demio.com' rel='nofollow'>Hiring@Demio.com</a> </p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 27, 2017 9:08:17 PM",
    "tags": [
      "TITLE1_support",
      "TZ_America_West",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "US Pacific Time Zone"
    ],
    "tagsNames2": []
  },
  {
    "id": "P8_yEl-qRRGGvMpwm3eNnw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5614-customer-support-specialist",
    "title": "DealDash: Customer Support Specialist",
    "content": "<div>  <div>    <h2>Customer Support Specialist</h2>      <h4>Posted Oct 25</h4>    <h3>      <span>DealDash</span><br>      <span>Headquarters: Helsinki</span><br>        <a href='https://www.dealdash.com/careers' rel='nofollow'>https://www.dealdash.com/careers</a>    </h3>  </div>    </div>  <div>    <div>We are a small team with a big business!&nbsp;<br></div><div></div><div>Our customers come first, and our Customer Support team is at the forefront.<br></div><div></div><div></div><div>Are you passionate about people? Do you want to join an established e-commerce company?&nbsp;</div><div><br></div><div></div><div><b>If you're based in CANADA and interested in remote work, then we are looking for you!</b></div><div><br></div><div></div><div>Our highly-skilled team have the freedom to serve our customers the best way they know how (who wants to read from a script, right?). As a member of this team, you would be responsible for answering customer inquiries through email, chat and phone.</div><div><br></div><div></div><div>Successful applicants will begin with a two-week training period, following which the opportunity to work remotely is available. This is a 5 day per week position with shifts that may be from Mon-Sun and may include evening work.</div><div><br></div><div></div><div>We are looking for highly motivated people, who are capable of independent work and can meet set expectations within deadlines.</div><div><br></div><div></div><div>Your responsibilities include:<br></div><div></div><div></div><ul><li><span></span>Answering customer inquiries via email, phone &amp; chat</li><li><span></span>Optimizing the team's tools and work procedures</li></ul><div></div><div><br></div><div>We're looking to fill this role immediately, so please apply ASAP!</div><div><br></div><div>Live where you've dreamed, work where you're happy.&nbsp;</div><div>Watch the video below to learn more about how our truly remote team works.<br></div><div></div><div>https://vimeo.com/213851005/92231b8925</div><div></div><div></div><div><br></div><div><span></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://dealdash.workable.com/jobs/336726' rel='nofollow'>https://dealdash.workable.com/jobs/336726</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 25, 2017 8:03:53 PM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "4MCSbGuRRey10fLSAsnpMA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62286",
    "title": "WordPress Developer & Support Specialist",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>BuddyBoss is a leading provider of WordPress and BuddyPress driven solutions, for online community platforms. Our products are used in thousands of E-learning sites, MarketPlaces, and other community type platforms. <br><br>We also build custom development solutions for startups and established organizations, to address their specific platform requirements. <br><br>We are seeking ambitious, dynamic, smart and energetic individuals to join our growing team! If you are motivated to deliver high-quality and innovative services, BuddyBoss can offer you a great and fulfilling career opportunity. Here are a few reasons why you’ll love working for BuddyBoss:<br><br></p><ul><li>We work on some really interesting projects, and we are always pushing the boundaries of WordPress and BuddyPress.<br></li><li>We all work remotely. Some of us are traveling throughout the year, working from various countries. Others are working from the comfort of their home.<br></li><li>We try to all meet at least once a year at a fun destination, and we’re always super excited to see each other.<br><br><h3>KEY DUTIES AND RESPONSIBILITIES<br></h3><p><br></p></li><li>Supporting our customers via our support forum &amp; ticketing system and other communication channels<br></li><li>Combining technical expertise with customer service to resolve questions and issues with speed and efficiency<br></li><li>Taking every opportunity to delight our customers and exceed their expectations so much that they HAVE to tell others<br></li><li>Identifying patterns and recommending improvements to management<br></li><li>Handling large amounts of incoming tickets and respond in a timely manner<br></li><li>Keeping constant communication with management regarding<br></li><li>Authoring Success documentation for our customer facing Help Center<br></li><li>Providing suggestions on methodology, processes, and tools to increase team effectiveness<br><br><h3>REQUIRED SKILLS AND EXPERIENCE<br></h3><p><br></p></li><li>Good knowledge in PHP and object orientated programming<br></li><li>Good knowledge of Javascript/jQuery<br></li><li>Experience with Git and other version control systems<br></li><li>Experience with HTML5, Javascript, CSS3 and responsive design<br></li><li>Experience working with BuddyPress<br></li><li>Full knowledge of our products<br></li><li>A can-do attitude<br></li><li>Exceptional time management and organizational skills<br></li><li>Passion for excellence at every level<br></li><li>Superb verbal and written communication skills<br></li><li>Actively stays up to date with the latest trends and techniques in web development and customer support</li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 24, 2017 9:52:15 PM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "SR87T8xoSTSL3nb9cODy9g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5602-technical-success-php-integration",
    "title": "TaxJar: Technical Success - PHP Integration Specialist",
    "content": "<div>  <div>    <h2>Technical Success - PHP Integration Specialist</h2>      <h4>Posted Oct 24</h4>    <h3>      <span>TaxJar</span><br>      <span>Headquarters: Remote, USA</span><br>        <a href='https://www.taxjar.com/jobs' rel='nofollow'>https://www.taxjar.com/jobs</a>    </h3>  </div>    </div>  <div>    <div><i><b>We have an immediate opening on our Technical Success team in the role Integration Specialist</b></i>&nbsp;for someone who wants to make a difference on a growing, experienced team of entrepreneurs. This is a full-time remote position, available to folks located in the US.</div><div><br></div><div>TaxJar is the leading technology solution for busy eCommerce sellers to manage sales tax and is trusted by more than 9,000 businesses. We were founded to help eCommerce owners spend less time on sales tax and more time growing the businesses they love. We’re passionate about creating simple solutions and leveraging technology to solve complicated sales tax issues. We're not just about sales tax though, we're a technology-driven company focused on providing a great experience for both merchants and developers.&quot;</div><div><br></div><div>We offer&nbsp;<a href='https://www.taxjar.com/sales-tax-reporting' rel='nofollow'>TaxJar Reports</a>&nbsp;, a simple web-based reporting tool that organizes sales tax data into return-ready reports by state;&nbsp;<a href='https://www.taxjar.com/autofile/' rel='nofollow'>AutoFile</a>, a service that automatically files sales tax returns; and&nbsp;<a href='https://www.taxjar.com/api' rel='nofollow'>SmartCalcs API</a>, a modern, accurate, sales tax API for developers to outsource sales tax rates and calculations. For developers, we have created an helpful&nbsp;<a href='https://developers.taxjar.com/demo/' rel='nofollow'>API demo environment</a>&nbsp;and also are fanatics about creating and maintaining great API&nbsp;<a href='https://developers.taxjar.com/api/reference/' rel='nofollow'>documentation</a>.</div><div><br></div><div><strong><br></strong></div><div><strong>On the Technical Success team you will:</strong></div><div><br></div><ul><li>Solve technical problems for customers on a daily basis. Our technical success specialists need to be fast learners and get up to speed quickly on our product and integrations.</li><li>Categorize and quickly respond to customer questions and requests via email</li><li>Face debugging issues not only within our own codebase but also with the many technologies employed by our customers.</li><li>Troubleshoot&nbsp;<a href='https://developers.taxjar.com/api/reference/' rel='nofollow'>SmartCalcs API</a>&nbsp;questions, and help customers with&nbsp;<a href='https://www.taxjar.com/guides/sales-tax-guide-for-woocommerce/' rel='nofollow'>WooCommerce plugin</a>&nbsp;and&nbsp;<a href='https://www.taxjar.com/guides/sales-tax-guide-for-magento/' rel='nofollow'>Magento extension</a>&nbsp;questions</li><li>Track all customer requests and trending product issues</li><li>Distill complex issues into underlying causes and work directly with our product development teams to deploy solutions while consistently delivering world-class support.</li><li>Interact with the developers to help identify root causes to bugs and exceptions reported by customers or by our application.</li></ul><ul></ul><div><br></div><div><strong>REQUIREMENTS</strong></div><div><br></div><ul><li>1+ years experience with WooCommerce, Magento, or other open source shopping carts</li><li>Highly-skilled in written and verbal communications</li><li>Experience working with a remote team</li><li>Be challenged weekly to solve new problems</li><li>Extremely patient...sales tax can be painful and our goal is to ease that pain :-)</li><li>Work with PHP, Rails, WordPress, Magento, WooCommerce, and more.</li><li>Help monitor and support 24/7 applications and services</li><li>Approaches success from the customer’s point of view</li><li>Enjoys teaching</li><li>Able to explain complex concepts in easy to understand language</li><li>Interested in understanding the ins-and-outs of sales tax</li><li>Attentive to details, both in communication and in explaining how TaxJar works</li></ul><div><strong><br></strong></div><div><strong>Does TaxJar offer any benefits?</strong><br></div><div></div><div></div><div><span><br></span></div><div>Heck yeah! Visit&nbsp;<a href='http://www.taxjar.com/jobs' rel='nofollow'>www.TaxJar.com/jobs</a>&nbsp;for a full list of benefits that we offer all employees.</div><div><br></div><div>The entire team works remotely from wherever we work best for each team member. For most of us, that's home. For others, that may be a local coffee shop or a summer vacation house. The only requirement is that we're working from a place with WiFi, and we're able to get our work done.</div><div><br></div><div>We love being a distributed team, and are looking for new teammates who will thrive in this unique environment.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Think you got what it takes? Please consider this a first interview when you apply here:  <a href='https://taxjar.workable.com/jobs/596528/candidates/new' rel='nofollow'>https://taxjar.workable.com/jobs/596528/candidates/new</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 24, 2017 5:26:39 PM",
    "tags": [
      "TITLE1_support",
      "TZ_America",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "hI9YqhHVTNyMTDGHSEqq_w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3933-technical-customer-support-weekend-shift-recharge",
    "title": "Technical Customer Support - Weekend Shift @ ReCharge",
    "content": "<h2>              Technical Customer Support - Weekend Shift<small> @ ReCharge</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-21 13:26</p></dd>          <dt><span>Description</span></dt>          <dd><h5>DESCRIPTION</h5><p>ReCharge is a fast moving small team making ecommerce payments easy for everyone. We currently empower thousands of online stores to sell their products on a recurring basis. We’re experiencing incredible growth – from our start 18 months ago we have bootstrapped our way to processing millions of dollars per week.</p><p>We are looking for a Technical Customer Success Engineer who is resourceful; using troubleshooting and analytical skills to serve our customers via email, chat, and occasional phone calls. You are self driven, with a knack for digging deep into problems. You have a sense of urgency and draw satisfaction from going above and beyond to provide solutions. You'll help to find convergence in what customers need so that we can build the highest value product. We get a lot of applicants, so we encourage you to do something that stands out and help us know why your the perfect fit for ReCharge.</p><p><strong>Job Description:</strong></p><ul><li>Combining technical expertise with customer service to resolve questions and issues</li><li>Communicate clearly in writing to both technical and non-technical people</li><li>Document and build new tools to improve support flows</li><li>Identify patterns, recommend improvements, and filter out unimportant issues</li><li>Author documentation for our customer-facing Help Center</li><li>Assist with successful on-boarding of new customers</li></ul><h5>REQUIREMENTS</h5><ul><li>Covering EST, CST or PST hours (Saturday-Wednesday)</li><li>Knowledge of HTML, CSS, Javascript (Knowledge of other programming languages a plus)</li><li><strong>2+ Years experience in a similar role at another SaaS company</strong></li><li>Excellent organizational and communication skills</li><li>Detail oriented. To prove this make sure to add to job application the headline: &quot;I am detail oriented&quot;</li><li>Excellent customer service skills with a polite, patient, caring, calm and professional demeanor</li><li>Language requirements: English fluency (written and spoken)</li><li>Background in the software industry</li></ul><h5>BENEFITS</h5><ul><li>Competitive salaries</li><li>Apple equipment</li><li>Paid time off</li><li>Much more...</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Covering EST, CST or PST hours (Saturday-Wednesday)</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 21, 2017 4:26:52 PM",
    "tags": [
      "TITLE1_support",
      "TZ_America_West",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "US Pacific Time Zone"
    ],
    "tagsNames2": []
  },
  {
    "id": "FTM2IJ5JQbyAK_xDV4Coog",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5547-client-success-manager",
    "title": "Doximity: Client Success Manager",
    "content": "<div>  <div>    <h2>Client Success Manager</h2>      <h4>Posted Oct 14</h4>    <h3>      <span>Doximity</span><br>      <span>Headquarters: San Francisco, CA</span><br>        <a href='https://workat.doximity.com/about/' rel='nofollow'>https://workat.doximity.com/about/</a>    </h3>  </div>    </div>  <div>    <div><span>Doximity is rewiring healthcare and is the&nbsp;</span><a href='http://www.prnewswire.com/news-releases/doximity-is-fastest-growing-company-in-bay-area-per-deloittes-2016-technology-fast-500-300367390.html' rel='nofollow'>6th fastest growing tech company in North America</a><span>. Here's&nbsp;</span><a href='http://doximity-res.cloudinary.com/image/upload/v1504050817/WhyDocsUseDox-NPPA-List-2017_ouu5yu.pdf' rel='nofollow'>how clinicians use Doximity</a><span>. For us, transparency is key, so ensuring your goals and values align with ours is also an important step. Take a closer look at how we&nbsp;</span><a href='https://workat.doximity.com/' rel='nofollow'>Work at Doximity</a><span>.&nbsp;</span></div><div><br></div><div>As the largest physician network in the country,&nbsp;we're in unique position to assist doctors in their careers and clinical practice. Doximity Talent Finder, the platform that enables social physician recruiting on Doximity, is hiring for&nbsp;a results-oriented&nbsp;Client Success Manager to build strong, trusted partnerships with Doximity's healthcare&nbsp;clients.</div><div><br></div><div><strong>Who You Are:&nbsp;</strong><br></div><div>The healthcare industry is nothing new to you&nbsp;and you're&nbsp;ready to join our&nbsp;rapidly growing Talent&nbsp;Solutions team.&nbsp;You've managed client accounts before and are comfortable owning your own accounts with a lot of autonomy. You're ready to embrace&nbsp;a fast-paced,&nbsp;tech savvy, non-corporate environment. You&nbsp;manage multiple project and priorities simultaneously. Your coworkers describe you as&nbsp;detail-oriented, self-motivated, the ultimate problem solver with a “can-do” personality.&nbsp;</div><div><br></div><div>Client Success Managers are dedicated to helping our clients achieve success defining, implementing, and realizing talent needs and goals. You will become an&nbsp;expert in the Doximity product suite, will partner with internal teams to ensure client satisfaction and identify at-risk accounts&nbsp;to contribute to a high rate of subscription renewals. It will take a strong communicator to be successful in this role. Location is flexible&nbsp;with a preference for Eastern or Central time zones.&nbsp;</div><div><br></div><div><strong>Your Responsibilities Will Include:</strong><br></div><ul><li>Cultivating&nbsp;and managing all aspects of relationships with new and existing clients&nbsp;on assigned accounts&nbsp;</li><li>Sharing your expertise in healthcare&nbsp;with our clients to drive their&nbsp;recruitment campaigns</li><li>Understanding&nbsp;client business objectives and&nbsp;supporting them as their primary contact within Doximity</li><li>Responsible and accountable for the successful fulfillment and completion of all client contracts within original contract terms from program kickoff to renewal and expansion&nbsp;</li><li>Strategically partnering with sales to position for&nbsp;upsell&nbsp;and&nbsp;renewal opportunities</li><li>Producing client reports and&nbsp;working with sales partners to present results to clients</li><li>Assisting in maintaining and improving internal documents and communication processes&nbsp;</li></ul><div><strong><br></strong></div><div><strong>Required Experience &amp; Skills:</strong><br></div><ul><li>Success being personally accountable for and exceeding assigned client and project expectations</li><li>Exceptional attention to detail, written and verbal communication, and time&nbsp;management skills</li><li>Experience developing, tracking and analyzing email campaign, utilizing copywriting and data analysis skills</li><li>Highly organized, able to coordinate large amounts of information across multiple projects (and timezones!)</li><li>Enthusiasm to help grow our business and be an energetic team player</li><li>Willingness to travel to client&nbsp;meetings,&nbsp;conferences and company offsites (estimated 20%)</li><li>Can work independently and solve problems creatively</li><li>Experience&nbsp;working with&nbsp;Excel and Keynote/PowerPoint</li><li>BS/BA 4 year degree</li></ul><div><strong><br></strong></div><div><strong>Preferred Experience &amp; Skills:</strong><br></div><ul><li>Prior experience working remotely</li><li>2-5 years of work experience in client success or account management</li><li>Prior experience in healthcare from a client, recruitment, clinical or marketing perspective</li></ul><div><strong><br></strong></div><div><strong>Benefits &amp; Perks:</strong><br></div><ul><li><span>Comprehensive benefits including: medical, vision, dental, Life/ADD, 401k, flex spending accounts</span></li><li><span>Stock, pre-IPO stock incentives</span></li><li><span>3+ weeks of PTO</span></li><li><span>12 company holidays, including company shutdown in December</span></li><li><span>Team trips to fun places like Lake Tahoe, Sonoma, Seattle and Park City</span></li><li><span>Sabbatical after 5 years</span></li></ul><div><strong><br></strong></div><div><strong>About Doximity:</strong><br></div><div>Doximity is the leading social network for healthcare professionals with over 70% of U.S. doctors as members. We have strong revenues, profits, real market traction, and were putting a dent in the inefficiencies of our $2.5 trillion U.S. healthcare system.<br></div><div>After the iPhone, Doximity is the fastest adopted product by doctors of all time. Our founder, Jeff Tangney, is the founder &amp; former President and COO of Epocrates (IPO in 2010), and Nate Gross is the founder of digital health accelerator RockHealth. Our investors include top venture capital firms who've invested in Box, Salesforce, Skype, SpaceX, Tesla Motors, Twitter, Tumblr, Mulesoft, and Yammer. Our beautiful office&nbsp;is located in SoMa San Francisco.</div><div><br></div><div><span>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.&nbsp;</span><span>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply on our jobs page: <a href='https://workat.doximity.com/positions/?gh_jid=859878' rel='nofollow'>https://workat.doximity.com/positions/?gh_jid=859878</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 14, 2017 11:08:09 PM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_100",
      "TZ_America_East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East timezone"
    ],
    "tagsNames2": []
  },
  {
    "id": "ReHCtGh6S1qzNfALq8se3g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobs.github.com-remote",
    "url": "http://jobs.github.com/positions/4ab7ad30-a550-11e7-817e-4bfb19210eee",
    "title": "Full Time: Enterprise Support Manager at GitHub in Remote-Europe",
    "content": "<p>More and more companies are using GitHub Enterprise, so the Support team is growing. When our customers have problems, they contact us and it is our goal to help them as quickly and awesomely as possible. We're looking for an Enterprise Support Manager, in Europe, who will be responsible for the oversight and performance of a distributed staff answering customer support requests, triaging issues, and providing solutions. Candidates must have current working authorization and permanently reside in one of the following countries in which we are set up as an employ in Europe: Austria, Denmark, England, France, Germany, Ireland, Netherlands, Northern Ireland, Scotland, Spain, Sweden, Switzerland, and Wales.</p><p>The position reports to the Director of Enterprise Support and works closely with other teams and leaders across the company.</p><p>GitHub works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers, customers, and interview candidates.</p><p><strong>Responsibilities:</strong></p><ul><li>Manage, mentor, and coach team members</li><li>Provide career development planning and guidance</li><li>Meet 1-1 with team members on a regular basis</li><li>Hire, onboard, and train new team members</li><li>Maintain cross-team communication between Support, Engineering, and Sales</li><li>Work with the Enterprise Support Director on the development and execution of team strategy</li><li>Work with Enterprise Support managers/teams to foster cross-team collaboration</li><li>Facilitate the implementation of new processes to improve customer support</li><li>Promote and build upon the unique collaborative culture of Enterprise Support</li><li>Handle and follow-up on customer escalations</li><li>Collect and analyze support metrics to drive improvements</li></ul><p><strong>Minimum Qualifications:</strong></p><p>Candidates must have current working authorization and permanently reside in one of the following countries in which we are set up as an employ in Europe: Austria, Croatia, Denmark, England, France, Germany, Ireland, Netherlands, Northern Ireland, Scotland, Spain, Sweden, Switzerland, and Wales.</p><ul><li>Experience leading a globally distributed team</li><li>Experience in technical support</li><li>Experience with personnel hiring</li><li>Stellar written and oral communication skills</li><li>Excellent problem-solving skills</li><li>At least 2-3 years of experience working with and troubleshooting Linux servers</li><li>Ability to look through and understand code (Ruby / Bash)</li><li>Enthusiasm for working directly with customers</li><li>Passionate about creating and fostering good support practices</li><li>Strong empathy for GitHub users and GitHub Support</li></ul><p><strong>Preferred Qualifications:</strong></p><ul><li>Scaled a quickly growing support team</li><li>Experience working and managing remotely</li><li>Knowledge of Git and GitHub</li></ul><p><strong>Who We Are:</strong></p><p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over fifteen million people use GitHub to build amazing things together. With the collaborative features of GitHub.com and GitHub Business, it has never been easier for individuals and teams to write faster, better code.</p><p><strong>What We Value:</strong></p><p>Collaboration: We believe the best work is done together. Empathy: We believe in putting people first. Quality: We believe in setting the standard for excellence. Positive Impact: We believe in making the world a better place through our work. Shipping: We believe in creating things for the people using them.</p><p><strong>Why You Should Join:</strong></p><p>At GitHub, we constantly strive to create an environment that allows our employees (Hubbers) to do the best work of their lives. We've designed one of the coolest workspaces in San Francisco (HQ), where over half of our Hubbers work, snack, and create daily. The other half of our Hubbers work remotely in 18 countries across the globe.</p><p>We are also committed to keeping Hubbers healthy, motivated, focused and creative. We've designed our top-notch benefits program with these goals in mind. In a nutshell, we've built a place where we truly love working, we think you will too.</p><p>GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!</p><p>*Please note that benefits vary by country, if you have any questions, please don't hesitate to ask your Recruiter!</p>",
    "urlFetchPending": false,
    "published": "Oct 11, 2017 10:56:32 PM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "vsnisCwySmyeRWLJJJB1pg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobs.github.com-remote",
    "url": "http://jobs.github.com/positions/1a48a4c2-08d6-11e7-9335-d8030a289cc9",
    "title": "Full Time: Enterprise Support Engineer; Japanese Language (Remote- Japan) at GitHub in Remote-Japan",
    "content": "<p>GitHub is looking for full-time Enterprise Support Engineers to provide Japanese-language support for our customers in Japan.</p><p>More and more companies are using GitHub Enterprise, so our global Enterprise Support Team is quickly growing. When our customers have problems, they contact us and it is our goal to help them as quickly, and awesomely as possible. We're looking for Japanese language Enterprise Support Engineers to join our Asia Pacific Support team. This role is remote, but candidates must currently be located in Australia, Japan, or New Zealand and possess legal working authorization.</p><p>At GitHub, we take support seriously, and this is not an entry-level position. Our Enterprise Support Engineers are responsible for helping our GitHub Enterprise customers who have our product installed and managed in the customer's virtualization environment. Your main responsibility will be to work with our customers to solve support tickets. Tickets are usually opened by internal system administrators, and can include investigating load or networking issues, debugging application errors, and discussing feature requests. You'll also work with our engineering team to prioritize issues and development, and our documentation team to improve customer-facing resources. You don’t need to be a Git expert, but you do need to have technical experience and a passion for helping people.</p><p>The position reports to an Enterprise Support Manager and works closely with other teams and leaders across the company. GitHub works remotely and asynchronously as much as possible. While this role does not require you to live near one of our offices, it will require some travel to meet with co-workers or attend company events.</p><h2>Responsibilities:</h2><ul><li>Solve complex customer support tickets often involving Linux servers, source code, and web application issues</li><li>Effectively communicate technical information to customers and engineering groups at GitHub</li><li>Work proactively with customers on activities such as coordinating upgrades, communicating upcoming features, and ensuring their installation is running smoothly</li><li>Identify bugs and improvements in the GitHub Enterprise codebase</li><li>Manage urgent customer outages during business hours</li></ul><h2>Minimum Qualifications:</h2><ul><li>Current legal working authorization in Japan</li><li>Experience with Linux</li><li>General understanding of how modern web applications work</li><li>Prior experience providing technical support</li><li>Excellent problem-solving skills</li><li>Familiarity with some flavor of production-level virtual machine (e.g., VMware ESX, Xen, KVM)</li><li>Enthusiasm for working directly with customers</li><li>Stellar Japanese and grammar skills</li><li>Business level English skills</li></ul><h2>Preferred Qualifications:</h2><ul><li>Worked closely with large complex customer accounts</li><li>Familiarity with Git and GitHub</li><li>Experience with phone support</li><li>The ability to look through and understand code (Ruby / Bash)</li><li>Previous experience as a Linux System Administrator</li><li>Previous experience providing on-site consulting or professional services</li></ul><h2>Who We Are:</h2><p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over fifteen million people use GitHub to build amazing things together. With the collaborative features of GitHub.com and GitHub Business, it has never been easier for individuals and teams to write faster, better code.</p><h2>What We Value:</h2><p>Collaboration: We believe the best work is done together. Empathy: We believe in putting people first. Quality: We believe in setting the standard for excellence. Positive Impact: We believe in making the world a better place through our work. Shipping: We believe in creating things for the people using them.</p><h2>Why You Should Join:</h2><p>At GitHub, we're committed to quality, collaboration, experimentation...and shipping!</p><p>We constantly strive to create an environment that allows our employees (Hubbers) to do the best work of their lives. We've designed one of the coolest workspaces in San Francisco (HQ), where over half of our Hubbers work, snack, and create daily. The other half of our Hubbers work remotely in 18 countries across the globe. Additionally, we enable Hubbers who are not based in HQ, to have the flexibility to work in ways that are most effective for them (at home, in a workspace, etc).</p><p>We are also committed to keeping Hubbers healthy, motivated, focused and creative. We've designed our top-notch benefits program with these goals in mind. In a nutshell, we've built a place where we truly love working, we think you will too.</p><p>GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!</p><p>*Please note that benefits vary by country, if you have any questions, please don't hesitate to ask your Recruiter!</p>",
    "urlFetchPending": false,
    "published": "Oct 11, 2017 7:48:51 PM",
    "tags": [
      "TITLE1_support",
      "TZ_Asia",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "Asia timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "sbbMxPY1SHuo338pxa4TxQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobs.github.com-remote",
    "url": "http://jobs.github.com/positions/58ee0586-9824-11e7-86ab-b95eba4a2e2a",
    "title": "Full Time: Enterprise Support Engineer at GitHub in Remote-United States",
    "content": "<p>More and more companies are using GitHub Enterprise, so the support team is growing. When our customers have problems, they contact us and it is our goal to help them as quickly and awesomely as possible. We're looking for Enterprise Support Engineers, in North America, to support our GitHub Enterprise product installed and managed in the customer's virtualization environment.</p><p>Your main responsibility will be to work with our customers to solve support tickets. Tickets are usually opened by internal system administrators, and can include investigating load or networking issues, debugging application errors, and discussing feature requests. You'll also work with our engineering team to prioritize issues and development, and our documentation team to improve customer-facing resources. You don’t need to be a Git expert, but you do need to have technical experience and a passion for helping people.</p><p>The position reports to an Enterprise Support Manager and works closely with other teams and leaders across the company.</p><p>GitHub works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers or attend company events.</p><p><strong>What you will be responsible for:</strong></p><ul><li><p>Solve complex customer support tickets often involving Linux servers, source code, and web application issues</p></li><li><p>Effectively communicate technical information to customers and engineering groups at GitHub</p></li><li><p>Work proactively with customers on activities such as coordinating upgrades, communicating upcoming features, and ensuring their installation is running smoothly</p></li><li><p>Identify bugs and improvements in the GitHub Enterprise codebase</p></li><li><p>Manage urgent customer outages during business hours</p></li></ul><p><strong>You Must Have:</strong></p><ul><li><p>Legal working authorization in the US</p></li><li><p>Currently residing in the US</p></li><li><p>General understanding of how modern web applications work</p></li><li><p>Prior experience providing technical support</p></li><li><p>Excellent problem solving skills</p></li><li><p>Familiarity with some flavor of production-level virtual machine (e.g., VMware ESX, Xen, KVM)</p></li><li><p>Enthusiasm for working directly with customers</p></li><li><p>Stellar English and grammar skills</p></li></ul><p><strong>Bonus points for:</strong></p><ul><li><p>Worked closely with large complex customer accounts</p></li><li><p>Familiarity with Git and GitHub</p></li><li><p>Experience with phone support</p></li><li><p>Ability to look through and understand code (Ruby / Bash)</p></li><li><p>Previous experience as a Linux System Administrator</p></li><li><p>Previous experience providing on-site consulting or professional services</p></li></ul><p><strong>Who we are and what we value:</strong></p><p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster. Collaboration We believe the best work is done together. Empathy We believe in putting people first. Quality We believe in setting the standard for excellence. Positive Impact We believe in making the world a better place through our work. Shipping We believe in creating things for the people using them.</p><p>GitHub is committed to building a diverse workforce and strongly encourages applications from people of color and other groups currently underrepresented in tech. We are looking for candidates who:</p><ul><li><p>Display a strong commitment to building an inclusive tech environment</p></li><li><p>Have demonstrated resilience and resourcefulness both in and outside of the workplace</p></li><li><p>Can bring a new perspective based on unique educational, professional, and lived experiences</p></li><li><p>Can effectively communicate with people from disparate backgrounds</p></li><li><p>Have experience mentoring/coaching/teaching, particularly in environments with diverse students/participants</p></li></ul><p>We have a lot of exciting things to do, and we’re looking for the right people to grow with us!</p><p><strong>Why you should join:</strong></p><p>At GitHub, we're committed to collaboration, experimentation, and always staying classy.</p><p>Because of this unique perspective, we've established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.</p><p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits* are out of this world.</p><p>In a nutshell, we've built and are growing a place where we truly love working, and we think you will too.</p><p>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there's anything we can do to make the interview process better for you; we're happy to accommodate.</p><p>*Please note that benefits vary by country, if you have any questions don't hesitate to ask your recruiter!</p>",
    "urlFetchPending": false,
    "published": "Oct 11, 2017 4:39:13 AM",
    "tags": [
      "TITLE1_support",
      "TZ_America",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "qWeHRBJtSSixa6pLd1JYhQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/54642/customer-experience-assistant-at-harrys/",
    "title": "Customer Experience Assistant",
    "content": "*UK CX Assistant full-time - 5 days a week including Saturday and Sunday* <br /><br />Harry’s is a men’s grooming brand that was built out of respect for quality craftsmanship, simple design, modern convenience and for guys who know they shouldn’t have to overpay for a great shave. We are able to deliver exceptional value and experiences to our customers because we are vertically integrated. From grinding steel into fine razors blades at our factory in Germany to selling our products directly to customers on our website and select retailers, we own the entire process.<br /><br />Since launching in early 2013, we have been blown away by the customer response to our brand. Today, we have over 3 million customers and are growing fast. We’re now looking to bring amazing people, like you, together to redefine the way people interact with brands online and in stores across the country.<br /><br />*About the Team*<br />At Harry's, the customer is at the heart of everything that we do. The Customer Experience Team serves as the bridge between Harry's and the amazing people who use our products. We're the voice of Harry's to our customers and advocates for our customers to the rest of the Harry's team. From new products to marketing initiatives to our website, everything we do is directly influenced by our customers. As a Customer Experience Assistant you'll drive that change, and have a lot of fun doing it!<br /><br />*About the Role*<br />As a Customer Experience Assistant you will work directly with our customers as we continue to grow our brand in the UK, answering their questions about everything from delivery times to how often they should shave. You will also work closely with the Customer Experience Team at Headquarters in New York to develop and execute creative ideas for improving the customer experience overall. The UK operation has grown very quickly and now requires someone who can work from home answering customers during the weekends, as well as from the office for three days during the week.<br /><br />*What you will accomplish:*<br />* Thrive in a fast-paced environment tackling an array of customer issues via phone, email and chat<br />* Become an expert on our products and spread the love of Harry's everywhere<br />* Deliver above-and-beyond customer service by surpassing our customer's everyday expectations<br />* Be the primary contact for Harry’s customers who get in touch over the course of the weekend<br />* Find new and interesting ways to make our customers smile<br />* Create instant rapport with our customers<br />* Strategise ways to improve our service, streamline our processes, and better serve our customers<br />* Master our internal management system in order to efficiently and effectively manage customer relationships<br />* Coordinate with CX Management to channel customer feedback to all areas of the business such as technology, marketing, design and product teams<br />* Identify customer trends in real time and communicate to the CX team and other departments<br />* Dive in wherever needed as we launch our UK operations<br /><br />*This should describe you:*<br />* Clear communicator via our customer service channels – both on email and phone. You can explain how to use an iPhone to your Grandma. And get her on Instagram too.<br />* Empathetic to the extreme - you have the ability to meet the customer where they are and immediately put yourself in their shoes<br />* A knack for building rapport with people quickly and easily<br />* A strong work ethic and an entrepreneurial spirit<br />* Eager to learn, grow, and develop your professional skills<br />* Ability to problem solve and think on your feet, with analytical skills a huge, huge plus<br />* You take initiative to solve problems and get the job done<br />* General awesomeness and a sense of humor<br />* Strong start-up mentality, which a &quot;no task is too small&quot; attitude<br />* Self-motivated and grit to get things done, even when there’s no-one else around<br />* Flexible outlook and keenness to support other areas of the UK team as required<br />* Able to work weekends<br /><br />*Here's who you'll work with:*<br />* Report directly to the UK Customer Experience Manager<br />* Work with awesome CX Assistants, in your office and across the pond in the US, who work hard and make the everyday fun<br />* Work with the rest of your UK-based team to build and grow the Harry's team culture",
    "urlFetchPending": false,
    "published": "Oct 10, 2017 8:32:13 AM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_50",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "8u487zwkSZa40SnpsElOEg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5505-exceptional-customer-support-specialist",
    "title": "QuickMail.io: Exceptional Customer Support Specialist",
    "content": "<div>  <div>    <h2>Exceptional Customer Support Specialist</h2>      <h4>Posted Oct  9</h4>    <h3>      <span>QuickMail.io</span><br>      <span>Headquarters: World</span><br>        <a href='https://quickmail.io/jobs/' rel='nofollow'>https://quickmail.io/jobs/</a>    </h3>  </div>    </div>  <div>    <div><h2>WE’RE GROWING AGAIN!</h2><h3><br></h3></div><div></div><div></div><div></div><div></div><div><h4>How is this job different?</h4></div><div>Working for a self-funded startup like QuickMail means a lot of freedom and ability to build close bonds with each user. We strive to be anti-corporate, we remove all possible walls between the users and us to truly deliver an exceptional experience.</div><div><br></div><div>We don’t have investors to please, just our users.</div><div><br></div><div>FAST is the mantra here, we want people who can think and work fast.</div><div><br></div><div>You’ll get plenty of hands-on experience since there are so many things to do.</div><div><br></div><div>Pro-activity &amp; curiosity as well as personal development is highly valued and not only encouraged but mandatory.</div><div><br></div><div><h4>Who we are</h4></div><div>QuickMail is a sales automation tool for sending B2B cold emails. Small and medium businesses use it to reach out to potential customers in their market and grow their business.</div><div><br></div><div>We hit product market fit very fast and are growing quickly. We need help from enthusiastic people who want to be part of this journey.</div><div><br></div><div>We are a 100% customer funded start-up, so decisions are made fast between the team for the good of the customers.</div><div><br></div><div>We care about helping our customers deeply,&nbsp;so if this means recommending another tool more suited to their needs, so be it.</div><div><br></div><div>Check out our values here:&nbsp;<a href='http://quickmail.io/values/' rel='nofollow'>http://quickmail.io/values/</a>&nbsp;and unlike most corporate BS, we do stand by this. Please don’t apply if this doesn’t resonate with you, you won’t be happy here.</div><div><br></div><div><h4>The work</h4></div><div>We work remotely and cover US hours. We are metrics and result driven, we are more focus on achievement than business or being busy.</div><div><br></div><div>This is a full-time position.</div><div><br></div><div>Your primary responsibilities will be to make sure user problems are resolved and ensuring the help documentation is up to date.</div><div><br></div><div><h4>Requirements</h4></div><div>You have great critical reasoning skills, while acting fast in a self-reliable manner.</div><div><br></div><div>You are tech savvy with a good internet connection.</div><div><br></div><div>You have empathy for users experiencing problems.</div><div><br></div><div>You relish challenges and are persistent.</div><div><br></div><div>Excellent writing (email &amp; live chat).</div><div><br></div><div>Previous experience working remotely is highly valued.</div><div><br></div><div>Must have at least 2 years in customer support&nbsp;role and in case I ask for it, the magic word to show me you read this page is banana.</div><div><br></div><div><h4>You will…</h4></div><div>Get to grow the customer success and support department.<br></div><div></div><div></div><div></div><div></div><div></div><div>Work directly with the founder who understands the importance of delighting users.<br></div><div></div><div></div><div></div><div></div><div></div><div>Work remotely from anywhere in the world. No need to commute to work (you just need a good and stable internet connection at all time).<br></div><div></div><div></div><div></div><div></div><div></div><div>You’ll grow tremendously if you can keep up with the pace</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Read our core values first: <a href='https://quickmail.io/values/' rel='nofollow'>https://quickmail.io/values/</a> - If this looks like you, send an email to <a href='mailto:jobs@quickmail.io' rel='nofollow'>jobs@quickmail.io</a> with this exact subject: “I’m a unicorn”, and containing absolutely nothing else but a link to your linked in profile.</p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 9, 2017 6:37:17 PM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "5KZKkmtDRveZHmQqU3UYIA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3919-technical-support-and-customer-success-disco",
    "title": "Technical Support and Customer Success @ DISCO",
    "content": "<h2>              Technical Support and Customer Success<small> @ DISCO</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-09 05:28</p></dd>          <dt><span>Description</span></dt>          <dd><h3>Who we are</h3><p>We're a music tech startup based in Melbourne. Our app, DISCO, helps people and companies who work with music manage their music assets and workflow.</p><h3>The role</h3><p>We're looking for someone to join us in a support and customer success role. </p><p>The role will primarily involve providing technical support to our customers and assisting them with getting set up on the platform and managing their assets. It will also involve some administrative tasks and working with the sales, product and development teams to grow the product and our customer base.</p><p>There's lots of opportunities to learn and do new things in a supportive environment.</p><p>We're looking for someone part time initially. For the right person, this could quickly grow into a long term, full time position as we grow.</p><p>While we don't necessarily need you to have experience in a start up environment, we are looking for someone technically adept who learns quickly, communicates clearly and is keen to pursue a career in software.</p><p>We work in a distributed team, headquartered in Melbourne. You would need to have at least 3-4 hours crossover with Australian Eastern Standard Time business hours.</p><p>Please provide a cover letter that tells us about:</p><ul><li><p>what technical experience you have</p></li><li><p>why you're interested in working in a software startup</p></li><li><p>what makes good user experience.</p></li></ul><p>Please note cover letters need to address all three of these points for us to consider your application.</p><p>This is a great opportunity to join a strong, supportive team and develop your career in software.</p><h3>What we need</h3><p>Things we need:</p><ul><li><p>very strong attention to detail</p></li><li><p>very good written and verbal communication skills (you proof things before you send them; you can write quickly and accurately with the right tone and sound like a human)</p></li><li><p>curiosity and willingness to read up on things you don't know about, and stay on top of trends in technology and things that affect our start up and your role within it</p></li><li><p>strong technical fluency (you pick up new things quickly and like to know how things work)</p></li><li><p>excellent analytical skills (able to troubleshoot problems quickly and efficiently)</p></li><li><p>extremely organised, and able to set up systems for yourself and others</p></li><li><p>able to work independently and quickly, and multi task.</p></li></ul><h3>Benefits</h3><p>Supportive environment, and strong opportunities for growth and advancement within the team. Flexible working hours, and capacity to take ownership and drive key initiatives within the business.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Crossover with AEST required: need to be able to work, at a minimum, 7-11am AEST year round</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 9, 2017 8:27:40 AM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_100",
      "TZ_America_East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East timezone"
    ],
    "tagsNames2": []
  },
  {
    "id": "Y3g-lLMGQx-CB5NLDjRzmQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62108",
    "title": "Technical Support Engineer (Enterprise Customer Success)",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>We're looking for a Technical Support Engineer to join our growing team with the goal of making our customers successful. If you love solving tech problems, enjoy working with all types of customers from around the world (startups to corporations), and love variety, this job has it all.<br><br>The Technical Support Engineer contributes to the team’s mission of making customers successful and enabling them to realize business value, so they remain customers for life. We have high expectations around giving our customers quick, accurate, and awesome support so they can focus on doing what they do best. In addition to answering customer questions, support tasks include leading projects to drive efficiency, documenting knowledge so customers can self-solve questions, and develop tools that allow our client to be more satisfied with Piwik and InnoCraft.<br><br><br></p><h3>What you will do:<br></h3><p><br></p><ul><li>Deliver happiness to every customer you interact with by answering their questions via phone and email (or by any means necessary).<br></li><li>Guide customers through implementation, onboarding, business reviews, renewal and anything that comes in-between.<br></li><li>Become more knowledgeable about our web &amp; mobile analytics products than anyone else, and become an expert in the larger analytics space.<br></li><li>Debug customer issues, keeping ownership of cases until resolution while engaging other teams as needed.<br></li><li>Develop your skills in cutting-edge web technologies (JavaScript, jQuery, CSS, HTML, mobile development, etc.), used on our customers’ websites and apps.<br></li><li>Ensure that Piwik and InnoCraft are delivering business value.<br></li><li>Contribute to improving our processes, systems, and customer interactions by initiating and driving innovative projects to help our clients become even more successful.<br></li><li>Availability to be on call for emergency issues that arrive during off hours.<br><br><br><h3>Within your first few months, you should should expect the following:<br></h3><p><br></p></li><li>30 days: Learn how to answer customer questions, be familiar with Piwik solutions, positioning, competition, and product suite. Internalize our success stories, our systems and our processes. You’ll shadow every possible sales and customer success meetings with existing clients.<br></li><li>60 days: Begin to take on your own portfolio of accounts and lead onboarding processes for new customers. Become fluent in their history, their goals with Piwik, and define a plan to make these accounts successful.<br></li><li>90 days: You’ll be fully ramped and executing against your portfolio of customers. You’ll have ownership over the engagement, retention, and growth of these clients.<br><br><br><h3>Requirements:<br></h3><p><br></p></li><li>Customer-orientation and excellent communication skills<br></li><li>Ability to manage multiple priorities, commitments and projects.<br></li><li>Excellent technical troubleshooting skills<br></li><li>Self-motivated, directed and passionate about what you do. Strives for results.<br></li><li>Experience in client-side web development (JavaScript, Jquery, HTML, CSS, AJAX)<br></li><li>Willingness to participate on-call rotation during off-hours and weekends<br></li><li>Experience working or using web analytics (eg. Piwik or Google Analytics)<br></li><li>(Bonus) Familiar with programming language like PHP<br></li><li>(Bonus) Experience with databases and SQL queries<br><br><br><h3>Location<br></h3><p><br></p></li><li>Remote work position.<br></li><li>As our customers are mostly located in Europe, your work day must match the working day in CET. We will consider applicants from UTC-4 timezone (USA or Canada or South america East coast) and in Europe timezones.<br><br><br><h3>Benefits<br></h3><p><br></p></li><li>A rewarding salary<br></li><li>Working with fun and energetic people<br></li><li>A good work/life balance<br></li><li>Remote work<br></li><li>Part time possible<br></li><li>Flexible hours<br></li><li>A huge “playground” to grow your skillset<br></li><li>Immediate impact<br><br><br><h3>About InnoCraft and Piwik<br></h3><p><br>At <a href='https://www.innocraft.com/' rel='nofollow'>InnoCraft</a>, we offer analytics products &amp; services to enable our users to grow their business. We believe in openness, privacy and 100% data ownership and we created <a href='https://piwik.org' rel='nofollow'>Piwik</a> to fulfil our mission to liberate analytics.<br><br>Our team is filled with customer focused individuals that champion and support our products used by a growing list of customers globally. We challenge one another every day and hold ourselves accountable for our work product as well as our customer's overall success. We all enjoy the interactions with the customers, problem solving, digging into complex issues, and actively championing for customers within InnoCraft. We wake up every morning asking ourselves how we can improve the customer's experience, the quality of our product, the quality of our support system, or our individual weaknesses. We are not scared of challenges, nor do we back down or get deterred by tough problems. When problems seem the hardest we are at our best, we work harder to find the root cause and a solution. We are acombination of passion and persistence.We feel that through our roles we can positively impact millions of end-users and their experience with Piwik Analytics and InnoCraft products.<br><br><br></p><h5>Apply online <strong><a href='https://piwik.org/jobs/' rel='nofollow'>Apply online here</a></strong>.<br></h5><p><br>We’re looking forward to receiving your application!</p></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 9, 2017 6:59:10 AM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_50",
      "TZ_Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "Europe timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "6Pmm_UVbS2eHZl714TAQFQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62089",
    "title": "WordPress Developer & Support Specialist",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>View the full posting at: <a href='https://cornershopcreative.com/help-wanted-wordpress-developer-support-specialist/' rel='nofollow'></a><a href='https://cornershopcreative.com/help-wanted-wordpress-developer-support-specialist/' rel='nofollow'>https://cornershopcreative.com/help-wanted-wordpress-developer-support-specialist/</a><br>Cornershop Creative (<a href='https://cornershopcreative.com' rel='nofollow'></a><a href='https://cornershopcreative.com' rel='nofollow'>https://cornershopcreative.com</a>) is seeking an awesome, U.S.-based WordPress developer to join our distributed team.The core responsibility for this position will be investigating, troubleshooting, and coding solutions for WordPress-based websites and applications for our non-profit and small business clients. The person occupying this role will spend his or her time making iterative changes and bug fixes to design, functionality, and backend improvements of the dozens of websites Cornershop manages and maintains. Tasks may include setting up WordPress custom post types, fields and taxonomies; troubleshooting server errors and migrating sites to hosts; and minor HTML, CSS (SASS), and JS coding for custom themes. Additionally, this position may be responsible for developing and maintaining custom WordPress plugins.<br>Our ideal candidate is a hard-working, curious troubleshooter comfortable working independently with little supervision, but who also enjoys working as part of a team that includes developers and non-developers. Since we're a distributed shop, you’ll get to work from home! Cool, right?<br><strong>Specifically, the things we’re looking for include:</strong><br></p><ul><li>Experience with receiving potentially vague end-user bug reports, recreating the issues, and diving into the codebase to quickly identify root causes</li> <li>Significant experience with WordPress theming: template hierarchy, hooks, WP_Query, etc.</li> <li>Strong knowledge of HTML5 markup and CSS3</li> <li>Ability to write CSS/SASS for cross-browser, responsive design (not just by using Bootstrap)</li> <li>Decent JavaScript skills (particularly in jQuery and/or the Node.js ecosystem)</li> <li>Experience managing codebases and deploying websites onto third-party hosts via git, and/or sFTP, making DNS record changes, etc</li> <li>Past experience with quickly and effectively maintaining/troubleshooting/supporting code written by other developers</li> <li>Familiarity with command line tools like git, gulp and wp-cli</li> <li>Ability to laugh at our stupid jokes (and the occasional good one)</li> <li>Familiarity with current (and evolving) best practices in front-end dev regarding semantics, performance, cross-browser consistency, etc.</li> <li>Ability to not lose your s#!% when you occasionally get feedback like “can we make the logo bigger?” or “change the padding by 1px” (and then getting asked to change it back), which may happen despite our best efforts </li> <li>Willingness to work in a fast-paced environment (we keep pretty busy!) and manage a workload of several projects at a time</li> <li>Superb written and oral communication skills</li></ul></span></td><td></td><td><a rel='nofollow'>30d</a></td><td><a href='mailto:jobs%40cornershopcreative.com?subject=Application%20for%20Wordpress%20Developer%20%26%20Support%20Specialist%20at%20Cornershop%20Creative&amp;body=Hi%21%0A%0AI%27d%20like%20to%20apply%20for%20your%20position%20for%20a%20Wordpress%20Developer%20%26%20Support%20Specialist%20at%20Cornershop%20Creative' rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 6, 2017 12:16:26 AM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "u_aj60XORyCctgy5unKX5w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29876?r=rss2",
    "title": "Cornershop Creative: WordPress Developer & Support Specialist",
    "content": "<p>Full-time</p><p><strong>(Virtual, US Only)</strong> </p><p>Cornershop Creative (<a href='https://cornershopcreative.com' rel='nofollow'>https://cornershopcreative.com</a>) is seeking an awesome, U.S.-based WordPress developer to join our distributed team.</p><p>The core responsibility for this position will be investigating, troubleshooting, and coding solutions for WordPress-based websites and applications for our non-profit and small business clients. The person occupying this role will spend his or her time making iterative changes and bug fixes to design, functionality, and backend improvements of the dozens of websites Cornershop manages and maintains. Tasks may include setting up WordPress custom post types, fields and taxonomies; troubleshooting server errors and migrating sites to hosts; and minor HTML, CSS (SASS), and JS coding for custom themes. Additionally, this position may be responsible for developing and maintaining custom WordPress plugins.</p><p>Our ideal candidate is a hard-working, curious troubleshooter comfortable working independently with little supervision, but who also enjoys working as part of a team that includes developers and non-developers. Since we're a distributed shop, you’ll get to work from home! Cool, right?</p><p><strong>Specifically, the things we’re looking for include:</strong></p><ul><li>Experience with receiving potentially vague end-user bug reports, recreating the issues, and diving into the codebase to quickly identify root causes</li><li>Significant experience with WordPress theming: template hierarchy, hooks, WP_Query, etc.</li><li>Strong knowledge of HTML5 markup and CSS3</li><li>Ability to write CSS/SASS for cross-browser, responsive design (not just by using Bootstrap)</li><li>Decent JavaScript skills (particularly in jQuery and/or the Node.js ecosystem)</li><li>Experience managing codebases and deploying websites onto third-party hosts via git, and/or sFTP, making DNS record changes, etc</li><li>Past experience with quickly and effectively maintaining/troubleshooting/supporting code written by other developers</li><li>Familiarity with command line tools like git, gulp and wp-cli</li><li>Ability to laugh at our stupid jokes (and the occasional good one)</li><li>Familiarity with current (and evolving) best practices in front-end dev regarding semantics, performance, cross-browser consistency, etc.</li><li>Ability to not lose your s#!% when you occasionally get feedback like “can we make the logo bigger?” or “change the padding by 1px” (and then getting asked to change it back), which may happen despite our best efforts</li><li>Willingness to work in a fast-paced environment (we keep pretty busy!) and manage a workload of several projects at a time</li><li>Superb written and oral communication skills</li></ul><p><strong>Other stuff we’d love it if you’re good at, but aren’t requirements:</strong></p><ul><li>Working with and customizing BuddyPress</li><li>Troubleshooting mySQL performance issues (and writing performant queries)</li><li>Familiarity with Apache/nginx configuration, tuning and troubleshooting</li><li>Ability to understand and work with common third-party REST APIs</li><li>Develop ingenious scripts to facilitate complicated cross-platform content migrations</li><li>Using Photoshop and understanding challenges in designing for the web</li><li>Working with nonprofit CRM tools such as Salsa, Luminate Online, Engaging Networks, Blue State Digital, and Classy</li><li>Remembering to un-mute yourself before talking on conference calls</li><li>Being passionate about progressive causes</li><li>Writing basic bash scripts and performing other devops/Linux sysadmin kinds of stuff</li></ul><p>Cornershop Creative is an award-winning online services agency committed to listening carefully to our non-profit and small business clients and helping them achieve their goals. Our designs are beautiful, and our websites are creative and innovative. Learn more about us at<a href='http://cornershopcreative.com/' rel='nofollow'> https://cornershopcreative.com/</a>.</p><p>To apply, send an email to <a href='mailto:jobs@cornershopcreative.com' rel='nofollow'>jobs@cornershopcreative.com</a> with the following:</p><ul><li>Your résumé, which should include an indication of which American state you live and work in</li><li>A brief cover letter, explaining why you’re excited about this opportunity</li><li>Links to work you’ve done that we should see, such as recent websites, git repos, or contributed plugins/modules/themes</li><li>Ideal salary range</li></ul><p>&nbsp;</p><p><strong>U.S. Applicants only!</strong></p><p>Please be sure to include all of these items — to save everyone valuable time <em>we’ll throw out incomplete applications</em>. Thanks for understanding.</p><p>Cornershop is an equal opportunity employer.</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Oct 6, 2017 12:10:07 AM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "_C4wlYqURxC2dOyIBOIb-A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "smashingmagazine.com-programming",
    "url": "http://jobs.smashingmagazine.com/j/WordPress-Developer-Support-Specialist/2503651",
    "title": "WordPress Developer & Support Specialist - Cornershop Creative - (Virtual, US Only) - FullTime",
    "content": "<li>          <a rel='nofollow'>                 Cornershop Creative</a>              (Virtual, US Only)          </li><li>                  Fulltime Job        </li><h2>WordPress Developer &amp; Support Specialist</h2><p>Cornershop Creative (<a href='https://cornershopcreative.com' rel='nofollow'>https://cornershopcreative.com</a>) is seeking an awesome, U.S.-based WordPress developer to join our distributed team.</p><p>The core responsibility for this position will be investigating, troubleshooting, and coding solutions for WordPress-based websites and applications for our non-profit and small business clients. The person occupying this role will spend his or her time making iterative changes and bug fixes to design, functionality, and backend improvements of the dozens of websites Cornershop manages and maintains. Tasks may include setting up WordPress custom post types, fields and taxonomies; troubleshooting server errors and migrating sites to hosts; and minor <span>HTML</span>, <span>CSS</span> (<span>SASS</span>), and JS coding for custom themes. Additionally, this position may be responsible for developing and maintaining custom WordPress plugins.</p><p>Our ideal candidate is a hard-working, curious troubleshooter comfortable working independently with little supervision, but who also enjoys working as part of a team that includes developers and non-developers. Since we’re a distributed shop, you’ll get to work from home! Cool, right?</p><p><strong>Specifically, the things we’re looking for include:</strong><br><br></p><ul><br><br><li>Experience with receiving potentially vague end-user bug reports, recreating the issues, and diving into the codebase to quickly identify root causes</li><br><br><li>Significant experience with WordPress theming: template hierarchy, hooks, WP_Query, etc.</li><br><br><li>Strong knowledge of HTML5 markup and CSS3</li><br><br><li>Ability to write <span>CSS</span>/<span>SASS</span> for cross-browser, responsive design (not just by using Bootstrap)</li><br><br><li>Decent JavaScript skills (particularly in jQuery and/or the Node.js ecosystem)</li><br><br><li>Experience managing codebases and deploying websites onto third-party hosts via git, and/or sFTP, making <span>DNS</span> record changes, etc</li><br><br><li>Past experience with quickly and effectively maintaining/troubleshooting/supporting code written by other developers</li><br><br><li>Familiarity with command line tools like git, gulp and wp-cli</li><br><br><li>Ability to laugh at our stupid jokes (and the occasional good one)</li><br><br><li>Familiarity with current (and evolving) best practices in front-end dev regarding semantics, performance, cross-browser consistency, etc.</li><br><br><li>Ability to not lose your s#!% when you occasionally get feedback like “can we make the logo bigger?” or “change the padding by 1px” (and then getting asked to change it back), which may happen despite our best efforts </li><br><br><li>Willingness to work in a fast-paced environment (we keep pretty busy!) and manage a workload of several projects at a time</li><br><br><li>Superb written and oral communication skills</li></ul><p><strong>Other stuff we’d love it if you’re good at, but aren’t requirements:</strong><br><br></p><ul><br><br><li>Working with and customizing BuddyPress</li><br><br><li>Troubleshooting mySQL performance issues (and writing performant queries)</li><br><br><li>Familiarity with Apache/nginx configuration, tuning and troubleshooting</li><br><br><li>Ability to understand and work with common third-party <span>REST</span> APIs</li><br><br><li>Develop ingenious scripts to facilitate complicated cross-platform content migrations</li><br><br><li>Using Photoshop and understanding challenges in designing for the web</li><br><br><li>Working with nonprofit <span>CRM</span> tools such as Salsa, Luminate Online, Engaging Networks, Blue State Digital, and Classy</li><br><br><li>Remembering to un-mute yourself before talking on conference calls</li><br><br><li>Being passionate about progressive causes</li><br><br><li>Writing basic bash scripts and performing other devops/Linux sysadmin kinds of stuff</li></ul><p>Cornershop Creative is an award-winning online services agency committed to listening carefully to our non-profit and small business clients and helping them achieve their goals. Our designs are beautiful, and our websites are creative and innovative. Learn more about us at<a href='http://cornershopcreative.com/' rel='nofollow'> https://cornershopcreative.com/</a>.</p><p>To apply, send an email to <a href='mailto:jobs@cornershopcreative.com' rel='nofollow'>jobs@cornershopcreative.com</a> with the following:<br><br></p><ul><br><br><li>Your résumé, which should include an indication of which American state you live and work in</li><br><br><li>A brief cover letter, explaining why you’re excited about this opportunity</li><br><br><li>Links to work you’ve done that we should see, such as recent websites, git repos, or contributed plugins/modules/themes</li><br><br><li>Ideal salary range</li></ul><p>&nbsp;</p><p><b>U.S. Applicants only!</b></p><p>Please be sure to include all of these items — to save everyone valuable time <i>we’ll throw out incomplete applications</i>. Thanks for understanding.</p><p>Cornershop is an equal opportunity employer.</p><h3>How to apply</h3>",
    "urlFetchPending": false,
    "published": "Oct 6, 2017 12:04:45 AM",
    "tags": [
      "TITLE1_support",
      "TECH2_Programming",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "Programming"
    ]
  },
  {
    "id": "EPte4SK0R3i999CLC3sQcg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5477-customer-success-manager-north",
    "title": "Close.io: Customer Success Manager - North America",
    "content": "<div>  <div>    <h2>Customer Success Manager - North America</h2>      <h4>Posted Oct  4</h4>    <h3>      <span>Close.io</span><br>      <span>Headquarters: San Francisco</span><br>        <a href='https://close.io' rel='nofollow'>https://close.io</a>    </h3>  </div>    </div>  <div>    <div><span>At Close.io&nbsp;</span><span>we’re building the sales communication platform of the future. We’ve built a next-generation CRM that eliminates manual data entry and helps sales teams close more deals. We’re looking to hire a Customer Success Manager to join our team and work with our rapidly expanding customer base.</span></div><div><br></div><div><span>The Close.io&nbsp;</span><span>Success Team is the face of our company, acting as the bridge between where the product is today and where the product is heading for the future. The Customer Success Manager (CSM) has dual responsibilities: on-board larger customers to help them set up for success and deepen relationships with our existing customers to increase the value they get from our service. They will be responsible for building and improving all processes related to customer on-boarding, growth and overall success with Close.io.&nbsp;</span></div><div><br></div><div><h4>KEY RESPONSIBILITIES</h4></div><ul><li>Virtually train and onboard new and existing customers</li><li>Communicate effectively with all Close.io customers, including CEOs and VP level executives</li><li>Identify expansion opportunities and up-sell customerS</li><li>Host in person customer events, some travel required</li><li>Create FAQs, white papers, videos, and host webinars</li></ul><div><h4>YOU SHOULD...</h4></div><ul><li>Have a minimum of 1 year in B2B SaaS experience (customer success, account management, or support)</li><li>Act as a trusted advisor for our customers through frontline sales experience of minimum 1 year</li><li>Have excellent written and verbal communication skills</li><li>Be able to slice and dice customer data in Excel (vlookups, pivots, conditionals)</li><li>Have the ability to create high fidelity customer presentations (Keynote, PPT)</li><li>Be available to work normal U.S. business hours</li></ul><div><h4>BONUS POINTS IF YOU...</h4></div><ul><li>You have experience working in a startup environment or as a remote worker</li></ul><div><h4>WHY WORK WITH US...?!</h4></div><ul><li>We’re a very small team doing very big things! Your work will make a huge impact and your voice will be heard</li><li>Competitive salary, healthcare, dental, and retirement benefits package</li><li>Work remotely</li><li>2x all-expense paid worldwide team retreats annually</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://jobs.lever.co/close.io/e0cf4b26-d851-4835-bfc1-395a8bf61cc1?lever-origin=applied&amp;lever-source%5B%5D=WeWorkRemotelyCSM' rel='nofollow'>https://jobs.lever.co/close.io/e0cf4b26-d851-4835-bfc1-395a8bf61cc1?lever-origin=applied&amp;lever-source%5B%5D=WeWorkRemotelyCSM</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 4, 2017 5:50:39 PM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "wB90LD-BTGq33D68U-SLlw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-1",
    "url": "http://www.indeed.com/viewjob?t=Technical+Support+Engineer&c=Red+Hat&l=Remote&jk=71a83cc81e73249f&rtk=1bu3epspb0noo5o7&from=rss",
    "title": "Technical Support Engineer - OpenShift.io - Red Hat, Inc. - Remote",
    "content": "<div><b>Technical Support Engineer - OpenShift.io</b><br><span>Red Hat, Inc.</span> -<span>Remote</span></div><span>At Red Hat, we connect an innovative community of customers, partners, and contributors to deliver an open source stack of trusted, high-performing solutions. We offer cloud, Linux, middleware, storage, and virtualization technologies, together with award-winning global customer support, consulting, and implementation services. Red Hat is a rapidly growing company supporting more than 90% of Fortune 500 companies.<br><br><b>Job summary</b>The Red Hat OpenShift.io Support Engineering team is looking for a Technical Support Engineer on the US East Coast. In this role, you will collaborate with our customers' top developers and architects to understand, troubleshoot, and resolve issues with OpenShift.io, an online development environment for building container-based applications. You'll also partner closely with Red Hat's development and technical support engineering teams to help resolve issues quickly and efficiently. Preferred work locations are Raleigh, NC or Westford, MA. Well-qualified, home-based candidates on the US East Coast will also be considered for a remote position.<br><br><b>Primary job responsibilities</b><ul><li>Understand, troubleshoot, and debug customer issues to ensure they are able to realize maximum value from Red Hat's OpenShift.io</li><li>Partner with the Eclipse Che and OpenShift Origin communities to develop and review patches and test cases</li><li>Guide customer-facing support cases, exceed customer expectations, and provide outstanding customer service</li><li>Maintain technical knowledge of all aspects of our technology and market</li><li>Share your knowledge gained from troubleshooting issues by contributing to the global Red Hat knowledge management system</li><li>Work closely with Red Hat development engineering and assist production support engineers and technical account managers</li><li>Maintain a commitment to providing the best experience possible for Red Hat customers</li></ul><br><b>Required skills</b><ul><li>Experience with OpenShift, Docker, Kubernetes, and other container tools</li><li>Software engineering experience with programming languages, like Java, Python, Ruby, C++, and experience writing patches and pull requests</li><li>Ability and desire to quickly learn new languages and technologies</li><li>Bachelor's degree in computer science, computer engineering, or technology-related discipline, or equivalent experience within the enterprise IT</li></ul>The following experience will be considered a plus:<br><ul><li>Java development experience</li><li>Experience with Apache Maven, including working behind proxies, repository settings, and dependency management</li><li>Experience with RESTful APIs</li><li>Experience developing in a Linux or UNIX-like environment</li><li>Experience supporting Software-as-a-Service (SaaS) applications</li><li>Virtualization with VMware, EC2, Google Cloud Platform, Docker, Microsoft Azure, or Red Hat OpenStack</li><li>Experience with application servers like Apache Tomcat, JBoss AS, or WildFly</li><li>Networking experience, including software-defined networking</li><li>Experience with Infrastructure-as-a-Service (IaaS) environments, like Red Hat OpenStack, Microsoft Azure, and Amazon Web Services (AWS)</li><li>Upstream involvement in open source projects, including submitting patches for upstream inclusion</li></ul></span>",
    "urlFetchPending": false,
    "published": "Oct 4, 2017 1:58:19 PM",
    "tags": [
      "TITLE1_support",
      "TZ_America",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "yQmwnTEtTUGwRvRhPwFLOQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-1",
    "url": "http://www.indeed.com/viewjob?t=Technical+Support+Engineer&c=Red+Hat&l=Remote&jk=71a83cc81e73249f&rtk=1bu5csf1l0kg80sf&from=rss",
    "title": "Technical Support Engineer - OpenShift.io - Red Hat, Inc. - Remote",
    "content": "<div><b>Technical Support Engineer - OpenShift.io</b><br><span>Red Hat, Inc.</span> -<span>Remote</span></div><span>At Red Hat, we connect an innovative community of customers, partners, and contributors to deliver an open source stack of trusted, high-performing solutions. We offer cloud, Linux, middleware, storage, and virtualization technologies, together with award-winning global customer support, consulting, and implementation services. Red Hat is a rapidly growing company supporting more than 90% of Fortune 500 companies.<br><br><b>Job summary</b>The Red Hat OpenShift.io Support Engineering team is looking for a Technical Support Engineer on the US East Coast. In this role, you will collaborate with our customers' top developers and architects to understand, troubleshoot, and resolve issues with OpenShift.io, an online development environment for building container-based applications. You'll also partner closely with Red Hat's development and technical support engineering teams to help resolve issues quickly and efficiently. Preferred work locations are Raleigh, NC or Westford, MA. Well-qualified, home-based candidates on the US East Coast will also be considered for a remote position.<br><br><b>Primary job responsibilities</b><ul><li>Understand, troubleshoot, and debug customer issues to ensure they are able to realize maximum value from Red Hat's OpenShift.io</li><li>Partner with the Eclipse Che and OpenShift Origin communities to develop and review patches and test cases</li><li>Guide customer-facing support cases, exceed customer expectations, and provide outstanding customer service</li><li>Maintain technical knowledge of all aspects of our technology and market</li><li>Share your knowledge gained from troubleshooting issues by contributing to the global Red Hat knowledge management system</li><li>Work closely with Red Hat development engineering and assist production support engineers and technical account managers</li><li>Maintain a commitment to providing the best experience possible for Red Hat customers</li></ul><br><b>Required skills</b><ul><li>Experience with OpenShift, Docker, Kubernetes, and other container tools</li><li>Software engineering experience with programming languages, like Java, Python, Ruby, C++, and experience writing patches and pull requests</li><li>Ability and desire to quickly learn new languages and technologies</li><li>Bachelor's degree in computer science, computer engineering, or technology-related discipline, or equivalent experience within the enterprise IT</li></ul>The following experience will be considered a plus:<br><ul><li>Java development experience</li><li>Experience with Apache Maven, including working behind proxies, repository settings, and dependency management</li><li>Experience with RESTful APIs</li><li>Experience developing in a Linux or UNIX-like environment</li><li>Experience supporting Software-as-a-Service (SaaS) applications</li><li>Virtualization with VMware, EC2, Google Cloud Platform, Docker, Microsoft Azure, or Red Hat OpenStack</li><li>Experience with application servers like Apache Tomcat, JBoss AS, or WildFly</li><li>Networking experience, including software-defined networking</li><li>Experience with Infrastructure-as-a-Service (IaaS) environments, like Red Hat OpenStack, Microsoft Azure, and Amazon Web Services (AWS)</li><li>Upstream involvement in open source projects, including submitting patches for upstream inclusion</li></ul></span>",
    "urlFetchPending": false,
    "published": "Oct 4, 2017 1:58:19 PM",
    "tags": [
      "TITLE1_support",
      "TZ_America",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "America timezones"
    ],
    "tagsNames2": []
  },
  {
    "id": "KaxREOBfS0iQQcirvxpa4w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/61898/customer-support-executive-at-payasugym/",
    "title": "Customer Support Executive",
    "content": "DESCRIPTION:<br /><br />PayAsUGym is an online marketplace (think Rightmove or AirBnB but for fitness) and is one of the fastest growing companies in the UK. Since launch in 2011 the company has successfully established the largest gym network in the country with more than 2,700 participating gyms, health clubs and fitness studios and over 500,000 registered users.<br />This full time role will require you to deliver exceptional support to our customers via email, chat or phone regarding our products or service.<br />This role represents an excellent opportunity for someone who is resilient, creative and interested in a fast growth, technology based fitness start up.<br /><br />KEY RESPONSIBILITIES:<br /><br />Customer Support: You will primarily be responsible for handling inbound and outbound customer service queries and complaints, via phone, email and Live Chat on the website, identifying problems quickly and resolving them to provide the best possible outcome for the customer.<br />You will also be responsible for keeping a team of remote agents up to date with issues and changes on the website.<br /><br />Cross-department communication: Working with the Operations team to resolve issues between the venue and the user.<br />You will also be required to closely liaise with the Development team to understand website changes, and how these will impact the customer experience.<br />You will be required to assist the Marketing team for periods of time, by contacting customers via phone, to provide information for marketing projects.<br /><br />Assist with ad-hoc projects:<br />As a fast growing start-up business our world moves pretty quickly which means everyone in the team needs to be ready and willing to support the wider business meet its goals through ad-hoc projects which will involve working with other departments in the business. This means you will get experience working alongside the Sales, Account Management, and Business Operations teams.<br /><br /><br />DESIRED SKILLS:<br />As you will be dealing directly with our customers, you must be polite, reliable and resilient. You must also have a clear and concise writing style and it is vital that you are friendly and confident on the phone.<br />We pride ourselves on delivering a consistently outstanding service, which leads the industry and underpins our reputation in the marketplace. You must also have a strong ability to use MS Office and web-based customer service software such as Zendesk.<br /><br /><br />EXPERIENCE:<br />2 years relevant customer experience<br />SALARY: £20-25k per annum dependent upon experience<br /><br />WORKING HOURS: Monday-Friday, normal working hours are 9am-6pm<br /><br />LOCATION: Fulham, SW6<br /><br />BENEFITS:<br />Unlimited holiday<br />2 duvet days per year<br />Free access to all fitness services listed on PayAsUGym",
    "urlFetchPending": false,
    "published": "Sep 26, 2017 8:52:43 AM",
    "tags": [
      "TITLE1_support",
      "REMOTE1_100",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": []
  },
  {
    "id": "GmcSPteETPOWOQM6BNLh9g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/61537/customer-success-manager-csm-at-whatusersdo/",
    "title": "Customer Success Manager (CSM)",
    "content": "* Do you want to *know everything* about your *prospects' plans and digital roadmap*?<br />* Are you great at *understanding their needs* and *communicating a service* to digital people?<br />* Can you *manage a sales pipeline*, expectations and a *busy pitch and demo schedule*?<br />* Can you *guide your prospects* with best practice and deliver a great outcome for them?<br />* Do you have a proven successful track record of *achieving sales quotas*?<br /><br />If the answer to all of that is a resounding *YES*, then you’re who we’re looking for to join our team.<br /><br />We’ve got clients who want to understand their users’ digital (websites, apps etc) user experiences, we’ve got the users who will offer their opinions and feedback – what we need is someone to work with our prospects to help us understand their requirements, translating this into how our UX Testing platform services them which gives them the insights and outcomes they need.<br /><br />_Who will you be working with?_<br /><br />Internally you’ll work most closely with our UX Research team and our lead-gen marketing team, who have a wealth of client knowledge and will work with you to help you to get to grips with what we do, who your prospects are and how to shape the pitch and proposition to your sectors and potential prospects.<br /><br />You will be pitching at digital professionals from UX to Customer Insight and eCommerce to Marketing. Our clients are mainly mid-large recognisable brand names (our website has a few listed if you’re interested) across every sector from supermarkets to travel to financial services – but there is plenty of market to go at and a great commission structure to reward your efforts.<br /><br />_How do we do all this?_<br /><br />We talk to our clients, we scope out the work to be done, we programme their research and then deliver a range of testing projects all aimed at ensuring our clients improve digital conversions, customer engagement, retention and satisfaction. Our user research platform is where it all happens – from the experience capture to the analysis, to the sharing of insight – available in your browser whenever you need it.<br /><br />_What makes us different?_<br /><br />It’s never solely our opinion – we’re totally impartial. We believe that the only opinion that matters is the customers’ – not ours, not yours – only theirs. And we’re fast, with results in days not weeks or months!<br /><br />_What do we want from you?_<br /><br />At WhatUsersDo.com, we believe that sales is more than a job, it’s a calling! Our sales team is about more than just closing deals; it’s about taking ownership of a relationship and identifying the value for the client. We believe in solving the KEY problems facing our customers everyday – how do they improve sales and satisfaction and their overall customer experience. We bring the user to their table in a fast, easy, cost competitive and actionable way and the end result is that our customers love WhatUsersDo.com… AND IT SHOWS.  Our growth so far has been tremendous (85% growth year on year) we want you to be part of this year’s growth.<br /><br />As a person you are a 'larger' contract hunter with a proven track record closing benefit led deals in excess of £10-£30K per annum with senior level buyers at mid-large level companies.  If you are Intelligent, quick-witted and persistent & understand how to evangelize a product while broadening a customer’s perception of its value then you will fit right in.<br /><br />You will sweat the details and the nuances and know that an obsession with tone, type and targeting delivers results time after time. You own your sales process (we will also train you on what’s been working so far) and you obsess over optimizing every piece of it. You know that securing a relationship is more than just the pitch deck and a broad smile – we will arm you with case studies, insight reports (specific to the client) and full UX consultancy support and back-up.<br /><br />_What are some of the things you will be doing?_<br /><br />* Generate new business opportunities to fuel your pipeline<br />* Drive commercial opportunities from qualified expressions of interest<br />* Passionately evangelize remote user research & testing to mid-large company & Enterprise business leaders<br />* Conduct game changing product demo’s<br />* Manage full sales-cycle in a consultative manner, including contract negotiations, proposal creation etc<br />* Optimize pipeline while meeting the weekly/monthly activity goals you are set<br />* Prioritize opportunities and manage your time & resources appropriately<br />* Coach team members and accept coaching whenever it is given<br />* Do something amazing to build the growth every week<br /><br />_Skills & expertise?_<br /><br />Really strong digital skills and expertise you may have worked in some of the following sectors? -  eCommerce, Analytics, Customer Insight, Market Research, Web Design, CRM, Software, Payment, Email, SaaS or digital Agency<br /><br />* Entrepreneurial mindset<br />* Proven successful track record of achieving sales quotas<br />* Obvious passion, intelligence, humour and wit<br />* 3 - 7+ years of sales experience or provable track record of exceeding a consistent quota<br />* Able to thrive in a maturing environment—moves quickly, thinks strategically and is good at tactical execution<br />* Passion for web technologies and great User Experience<br />* Excellent written & verbal communication skills<br />* Ability to multi-task, prioritize and manage time effectively<br /><br />_Bonus Qualifications:_<br /><br />* Network of contacts in leadership roles in eCommerce, marketing, UX, digital, user research or customer insights<br />* Experience selling to Travel, digital agencies, eCommerce, financial services, public sector or web/mobile gaming companies<br /><br />WhatUsersDo was set up over five years ago so anyone, in any size or type of organisation, can remotely gather user research from across the world with real people. Today our remote user experience testing platform is used by leading organisations such as Virgin Atlantic, Deckers & Money Advice Service to radically improve their understanding of peoples’ digital experiences and to drive user research improvement through insight (rather than just rely on hunches, instinct or opinion).<br /><br />We are based in North London (right next door to a pub & a theatre!) and there is coffee and cake ongoing. It’s a nice new open plan office with a very friendly bunch of digital professionals - you will fit right in!<br /> <br />*Competitive Salary - + Competitive Commission: For Right Candidate (OTE £50K+)*<br /><br />No recruitment agencies please! – No really, please don’t call",
    "urlFetchPending": false,
    "published": "Sep 13, 2017 12:09:08 PM",
    "tags": [
      "TITLE1_support",
      "TZ_Europe",
      "REMOTE1_100"
    ],
    "tagsNames1": [
      "100% remote",
      "Europe timezones"
    ],
    "tagsNames2": []
  }
]
}
