{
 "items": [
  {
    "id": "hSLndmnWRcmeqXM5I9zlxw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/171379/software-engineer-cloud-platforms-suse?a=VtsFMAUwJ3i",
    "title": "Software Engineer - Cloud Platforms at SUSE (Nürnberg, Germany) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Computer Software, Enterprise Software, OpenStack</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>1k-5k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>At SUSE we’re building the next-generation cloud platforms based on Kubernetes and Cloud Foundry. <strong>The SUSE Cloud Application Platform engineering team</strong> is looking for a Software Engineer to join us&nbsp; on the journey in designing and building these platforms.You will be actively contributing to the Cloud Foundry open source project and delivering the world's best enterprise grade application hosting platform.</p><p>At SUSE we're strongly committed to open source and contribute to numerous free and open projects and initiatives. We embrace and believe in the open source innovation model and the open source business model. As a member of the SUSE Cloud Application Platform team you will have the opportunity to contribute to and be part of various open source projects like Cloud Foundry, Kubernetes, and Helm. You will work together with the communities for these projects and strive to continuously advance the state of the art to meet customer requirements.</p><p>Curiosity and good teamwork are two of the values that drive us as a development team. If you are passionate about these values too, you are likely a great fit for us. As a team, we're constantly finding ways to improve ourselves. We pride ourselves on our communication and teamwork – we're all in this together!</p><p>Come join us if you have hands-on experience building complex distributed systems and API driven web services. A deep technical passion and enjoying learning the latest technologies and programming languages like Docker, Kubernetes and Go is a plus.</p><p><strong>Qualifications:</strong></p><p><strong>Education and Experience:</strong></p><ul><li>Bachelor or Master's degree in Computer Science, Information Systems, or equivalent experience</li></ul><p><strong>Knowledge and Skills:</strong></p><p>At least 2 years’ software engineering or equivalent experience:</p><ul><li>Hands-on software development experience in a variety of programming languages</li><li>Experience and/or interest in Agile methodologies</li><li>Excellent analytical and problem solving skills</li><li>Experience of working in Linux based environments</li><li>Experience working on production, shipping code</li><li>Excellent written and verbal communication skills</li><li>Ability to effectively communicate product architectures and design proposals</li></ul><p><strong>Bonus qualifications:</strong></p><ul><li>Knowledge of Cloud Foundry, OpenShift, Kubernetes, Apache Mesos, Docker containers</li><li>Knowledge of, or desire to learn, Go, Ruby, and Java</li><li>Performance instrumentation, analysis and tuning</li><li>Experience and/or interest in Test Driven Development (TDD)</li><li>Experience with open source development</li><li>Experience with Cloud Computing (OpenStack, AWS, or Azure) and/or Distributed Systems</li><li>Experience working with a distributed team. You will be expected to engage with team members across many time zones and cultures.</li></ul>                    </div>                            <h2>                About SUSE            </h2>            <div><p>We are a global technology business where the diversity of our employees inspires innovation. We value the individual contribution and expertise of our people across roles and functions.&nbsp; With strong and accessible leaders, we expect our people to collaborate and deliver market-leading solutions to our customers.</p><ul><li>We enable you to succeed. SUSE is an Open Source pioneer and market leader. You will learn from industry experts and bring the latest technology to market; regardless of your role.</li><li>Manage your future: We set the expectations and you find the solutions! You are encouraged to discover our people, business, communities and customers to deliver exceptional results.</li><li>We empower you to be bold. In a culture founded on collaboration and knowledge-sharing, you will be responsible for exceeding your own goals, and work across boundaries and hierarchies to deliver success for our customers.</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Collaborative Working enviroment                            </div>                            <div>                                 Home, virtual office                            </div>                            <div>                                 Good secondary benefits                            </div>                            <div>                                 Truly international enviroment and working culture                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 15, 2018 2:07:51 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "p9vIP3xEQcOoG8u0dSk_GQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/172738/summer-software-engineering-internship-snowplow-analytics-ltd?a=VVIDGOrpGYE",
    "title": "Summer Software Engineering Internship at Snowplow Analytics Ltd (London, UK) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Internship</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Student, Junior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Customer Data Platform, Data &amp; Analytics, Mobile Analytics</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Summer Software Engineering Internship</strong></p><p><strong>Remote, UTC up to +/- 5</strong></p><p>At Snowplow, we are on a mission to empower people to differentiate with data. We provide both the technology and services to enable our customers to not only take control of their data, but allow them to do amazing things with that control.</p><p>As part of that effort, we're changing the way that people do digital analytics by moving companies away from a one-size-fits-all mindset and enabling them to collect and own their data themselves.</p><p><strong>The Opportunity</strong></p><p>We’re looking for 2 open source Software Engineering Interns this Summer (May through August), for an 8-16 week paid internship, building on our previous successful Winter &amp; Summer internships.</p><p>Our interns work directly on and contribute to projects within the&nbsp;<a href='https://github.com/snowplow' rel='nofollow'>Snowplow open source stack</a>. We have lots of ideas for cool projects to do around Snowplow - and if you have any suggestions of your own, we would love to hear them!</p><p>This is a paid internship; we will consider remote candidates who are up to UTC +/- 5 hours maximum. Most of our engineering team works remotely so you certainly won’t be the only one!</p><p><strong>Does this sound like you?</strong></p><p>A Snowplow intern loves coding, enjoys experimenting with new technologies and is happiest working “in the open” on community/team projects. In terms of programming languages, we’ be particularly interested in hearing from you if you love Scala or have experience with big data frameworks.</p><p>However, our stack consists of Scala, Golang, JavaScript, Objective-C, C#, Java, Python - so, whatever languages you like working in, we can probably find something interesting for you to do. Technologies and tools we use at Snowplow include Spark, Kafka, Elasticsearch, Kinesis and Redshift.</p><p><strong>To apply</strong></p><p>If you’re interested, please send in your CV along with a summary about a piece of software you are proud to have written.<strong>Here are some do’s for your application:</strong></p><ul><li>Do tell us a little bit about yourself - what you are passionate about, what you are looking for in an internship</li><li>Do share any public profiles or contributions you have on open-source, libre or community projects</li><li>Do share links to publically available code written by you (perhaps something on GitHub or Bitbucket?)</li><li>Do suggest specific projects/initiatives/features that you would like to work on in your internship (it’s okay if you don’t know!)</li></ul><p><strong>Some don’ts:</strong></p><ul><li>Please don’t share any proprietary or commercial software with us</li><li>Please don’t attach any code to your application (but it’s okay to tell us about code that you&nbsp;<em>could</em>&nbsp;share later on)</li></ul><p>And that’s it! We look forward to receiving your applications and hearing about all of your amazing ideas.</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Competitive salary &amp; equity                            </div>                            <div>                                 MacBook Pro                            </div>                            <div>                                 25 days holiday plus bank holidays                            </div>                            <div>                                 Remote/flexible working                            </div>                            <div>                                 Regular meetups/offsites                            </div>                            <div>                                 Two fantastic company Away Weeks a year                            </div>                            <div>                                 Continuous supply of Pact Coffee                            </div>                            <div>                                 Convenient Shoreditch office location                            </div>                            <div>                                 Awesome activities such as Shuffleboard and building Lego robots                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 15, 2018 2:07:51 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH1/go",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "go",
      "mobile"
    ]
  },
  {
    "id": "Js01KOTWS96pyoIcYQf0Wg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/cycloid_io/jobs/110871-cloud-devops-container-engineer-with-go-development-backend-working-in-remote-in-north-south-america-on-cycloid-io-devops-platform-with-ci-cd-container-pipeline-devops-services",
    "title": "Cloud DevOps Container Engineer with Go development backend working in remote in North/South America on cycloid.io: DevOps platform with CI/CD container pipeline & DevOps services",
    "content": "<div><h2>Cloud DevOps Container Engineer with Go development backend working in remote in North/South America on cycloid.io: DevOps platform with CI/CD container pipeline &amp; DevOps services at Cycloid</h2><div>Germany, Southern Europe, Western Europe, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Machine Learning, Automation, Continuous Integration, Managed Services, Continuous Deployment, AWS/EC2/ELB/S3/DynamoDB, AWS Cloud Services, Docker, Ansible, Sensu, AWS, Kubernetes, Terraform, PACER, concourse, Go</div><div>Compensation</div><div>$40K–$100K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>You are a passionate DevOps, which is the most important, with a major expertise in Operations with troubleshooting. You believe that containers (Kubernetes &amp; Docker) are the future. Pacer, Ansible, Terraform, Prometheus are well-known to you.<br> <br>On the Ops side, you have a successful experience in a Cloud provider certifications are preferred.</p><p>You love to design architecture, collaborate with developers to fix problems and provide long-term solutions. Providing service and automation on Cloud is a pleasure and with your experience, you understand why public cloud is the solution.</p><p>On the Dev/R&amp;D side, you want to be a change-maker by developing products that will facilitate DevOps and Cloud adoption for our customers. </p><p>The main difference between a SysOps and a DevOps is that you have an experience in development and that you are able to contribute to Cycloid product roadmap. </p><p>If you have an experience in Development: C / C++, Golang would be better, or any another concrete experience/language. </p><p>If not, you will work then 50% on services &amp; 50% R&amp;D to improve both your skills and break the monotony.</p><p>You can decide to work on-site in Paris or on remote whenever you are located in Europe but all the organization is in an asynchronous manner, keeping a good team culture through Slack and conference meetings. </p><p>You like to identify problems, are capable of commenting in a constructive, positive &amp; open way to the team. Mindset is what is the most important.</p><p>You have adequate written and oral communication skills in English, any others languages would be a plus.</p><p>Cycloid is committed to having equality between women and men. In that way, we strongly encourage women's application. </p><p>The salary will depend on your skills and location.</p></div>",
    "urlFetchPending": false,
    "published": "Apr 13, 2018 1:49:33 AM",
    "tags": [
      "AWS Cloud Services",
      "AWS/EC2/ELB/S3/DynamoDB",
      "Ansible",
      "Automation",
      "Backend Developer",
      "Continuous Deployment",
      "Continuous Integration",
      "DevOps",
      "Docker",
      "Full Time",
      "Germany",
      "Machine Learning",
      "Managed Services",
      "REMOTE1/100",
      "Remote OK",
      "Sensu",
      "Southern Europe",
      "Systems Engineer",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/Europe",
      "Western Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "J9huHM8xQgWUwmzYrSG3IQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/cycloid_io/jobs/139351-cloud-devops-container-engineer-with-go-backend-development-working-in-remote-in-europe-or-on-site-in-paris-on-cycloid-devops-platform-with-ci-cd-container-pipeline-services-on-aws",
    "title": "Cloud DevOps Container Engineer with Go backend development working in remote in Europe or on-site in Paris on Cycloid: DevOps platform with CI/CD container pipeline & Services on AWS",
    "content": "<div><h2>Cloud DevOps Container Engineer with Go backend development working in remote in Europe or on-site in Paris on Cycloid: DevOps platform with CI/CD container pipeline &amp; Services on AWS at Cycloid</h2><div>France, United Kingdom, Spain, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Automation, Continuous Integration, Managed Services, Continuous Deployment, AWS/EC2/ELB/S3/DynamoDB, AWS Cloud Services, Docker, Ansible, Sensu, AWS, Kubernetes, Terraform, PACER, concourse, Prometheus, Go</div><div>Compensation</div><div>€40K–€100K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>You are a passionate DevOps, which is the most important, with a major expertise in Operations with troubleshooting. You believe that containers (Kubernetes &amp; Docker) are the future. Pacer, Ansible, Terraform, Prometheus are well-known to you.<br> <br>On the Ops side, you have a successful experience in a Cloud provider certifications are preferred.</p><p>You love to design architecture, collaborate with developers to fix problems and provide long-term solutions. Providing service and automation on Cloud is a pleasure and with your experience, you understand why public cloud is the solution.</p><p>On the Dev/R&amp;D side, you want to be a change-maker by developing products that will facilitate DevOps and Cloud adoption for our customers. </p><p>The main difference between a SysOps and a DevOps is that you have an experience in development and that you are able to contribute to Cycloid product roadmap. </p><p>If you have an experience in Development: C / C++, Golang would be better, or any another concrete experience/language. </p><p>If not, you will work then 50% on services &amp; 50% R&amp;D to improve both your skills and break the monotony.</p><p>You can decide to work on-site in Paris or on remote whenever you are located in Europe but all the organization is in an asynchronous manner, keeping a good team culture through Slack and conference meetings. </p><p>You like to identify problems, are capable of commenting in a constructive, positive &amp; open way to the team. Mindset is what is the most important.</p><p>You have adequate written and oral communication skills in English, any others languages would be a plus.</p><p>Cycloid is committed to having equality between women and men. In that way, we strongly encourage women's application. </p><p>The salary will depend on your skills and location.</p></div>",
    "urlFetchPending": false,
    "published": "Apr 13, 2018 1:49:33 AM",
    "tags": [
      "AWS",
      "AWS Cloud Services",
      "AWS/EC2/ELB/S3/DynamoDB",
      "Ansible",
      "Automation",
      "Backend Developer",
      "Continuous Deployment",
      "Continuous Integration",
      "DevOps",
      "Docker",
      "France",
      "Full Time",
      "Managed Services",
      "REMOTE1/100",
      "Remote OK",
      "Sensu",
      "Spain",
      "Systems Engineer",
      "TECH1/c",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/Europe",
      "United Kingdom"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "c",
      "go"
    ]
  },
  {
    "id": "iK2zbpstQrKzcwY8kipA9A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/351437-backend-engineer",
    "title": "Backend Engineer",
    "content": "<div><h2>Backend Engineer at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$100K–$180K<br>0.001%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ConsenSys is a venture production studio and the leading technology firm in blockchain globally. We deliver products, solutions and platforms built using blockchain technology to transform how business is done in complex network of buyers, suppliers and consumers.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, the music industry, security, and infrastructure, and more. To accomplish this we've built out a flat organizational structure which we call the ConsenSys Mesh: a network of individuals &amp; teams working autonomously and towards the same goal. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p>About Balanc3 at ConsenSys:</p><p>The Balanc3 team is building and developing financial reporting products on the Ethereum blockchain. We're leading the accounting initiatives in the blockchain industry through our accounting software platform, full service partnerships, and accounting industry involvement. We have brought together leaders in both the accounting and blockchain industries to inform the design of our products. </p><p>About the Role:</p><p>We're seeking a Backend Engineer who is a self-starter and quick learner with a keen interest in Ethereum and blockchain technologies. Our ideal candidate is one who communicates effectively and consistently ships high quality, well-tested code.</p><p>Responsibilities:</p><p>Design and implement backend services - APIs, web services<br>Integrate with developed frontends<br>Collaborate with the team with well communicated and documented processes<br>Develop high-quality software design and architecture<br>Identify, prioritize and execute tasks in the software development lifecycle<br>Develop tools and applications by producing clean, efficient code<br>Automate tasks through appropriate tools and scripting<br>Review and debug code<br>Perform validation and verification testing<br>Collaborate with internal teams and vendors to fix and improve products<br>Document development phases and monitor systems<br>Ensure software is up-to-date with latest technologies<br>Requirements:</p><p>At least six years of backend engineering experience, a large portion of which was in a team environment<br>Programming Languages: Node, GoLang, Rust<br>Fintech experience is a strong plus<br>Blockchain / Ethereum experience a strong plus<br>Database experience: MongoDB, Redis, Postgres<br>Here are some of the perks of being part of a unique organization like ConsenSys:</p><p>The forefront of a revolution. At ConsenSys we fundamentally believe that a next generation of technologies presents the opportunity to create a more just and equitable society.<br>A dynamic startup environment. ConsenSys is a thought leader in the blockchain space and we are absorbing a significant portion of the mindshare. This is both exciting and challenging, as we learn to scale our organization while adhering to the principles of decentralization.<br>Continuous learning. You’ll be constantly exposed to new languages, frameworks and ideas from your peers and as you work on different projects -- challenging you to stay at the top of your game.<br>Deep technical challenges. This entire ecosystem is about 10 years old. Ethereum itself is still a toddler. There is much work to be done before these platforms can scale to the order of millions or billions of users. ConsenSys is building the technology platforms that can get us to those next thresholds of scale.<br>Click here for the latest updates from ConsenSys.</p></div>",
    "urlFetchPending": false,
    "published": "Apr 12, 2018 1:57:26 AM",
    "tags": [
      "Backend Developer",
      "Brooklyn",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "ArK3xKBfTbmL7giUtE8RfA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4326-senior-developer-activestate",
    "title": "Senior Developer @ ActiveState",
    "content": "<h2>              Senior Developer<small> @ ActiveState</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-04-06 13:08</p></dd>          <dt><span>Description</span></dt>          <dd><p>If you know Python, Perl, or Tcl you've probably heard of ActiveState's language distros. Now we’re building an ambitious language distribution platform so that no engineer ever has to suffer dependency hell again, and we need your help to do it!</p><p><strong>This position is open to full-time telecommuters anywhere in North America.</strong> You can also choose to work from our headquarters in beautiful Vancouver, BC.</p><h5>WHAT YOU’LL BE DOING</h5><p>As a Senior Developer on the Languages Team, you will be helping us build a highly scalable, 100% automated build system for multiple languages across multiple platforms. We’re also creating microservice APIs for other teams to code against as we build our big new thing.</p><p>Our day to day work practices are centered around GitHub, pull requests, code review, CI for testing, and agile development with Pivotal Tracker as our project management tool. We’re always looking to improve our practices and we expect you to help us to do so.</p><p>We’re a polyglot company building our system using Golang, Docker, Kubernetes, DCOS, CircleCI, and other modern tools. Quality is as important as speed. We’re building for the long run, so you’ll need to enjoy writing tests and documentation too.</p><p>Our team is scattered around the US and Canada, so we coordinate with each other and the rest of the company using Slack for chat, Highfive for video calls and screen sharing, Pivotal Tracker, and Google Drive.</p><p>We like to use open source software whenever possible, and we also like to contribute back to the open source ecosystem. We embrace open sourcing both libraries and tools developed in-house as long as those are not mission-critical code.</p><h5>WORKING AT ACTIVESTATE</h5><p>ActiveState has a collaborative, respectful, and professional culture. We’re all about working together to find the best solutions, and making sure that the experience of doing so is positive for everyone involved. There is a commitment from the CEO on down to making work at ActiveState a great experience for all of us.</p><p>Our company is a team of 35+ and growing, with 2/3rds of the positions in technical roles including software development and QA. We maintain a set of core, overlapping hours, but we’re flexible with specific start and end times and are understanding about appointments and life events.</p><p>Our vision is to have an ActiveState solution on every device on every planet, so we certainly don’t lack for ambition! But even though we’re ambitious we don’t expect work to become your life. We know you will do your best work in a positive environment free from death marches.</p><h5>WHAT’S IN IT FOR YOU</h5><ul><li>Working for a stable and growing company that offers the environment and personal growth potential of a start-up.</li><li>The chance to work with a smart, passionate team of people.</li><li>The chance to work on a project that will change the work lives of developers around the world.</li><li>Competitive salary, bonus, and stock option plan.</li><li>Comprehensive benefits package and health/wellness credit program.</li></ul><h5>REQUIREMENTS</h5><ul><li>Experience creating and maintaining complex software systems along with the ability to design non-trivial applications and components from scratch.</li><li>The ability to write clean, well-tested code with clear documentation.</li><li>Deep experience with at least one programming language, and shallow experience with several.</li><li>Excellent written and spoken skills, both technical and non-technical. You’ll need to work closely with your developer teammates, as well as be able to have coherent conversations with people from QA, sales, marketing, and other parts of the company.</li><li>A willingness to engage in the process of defining our work through conversations with product management, other engineering teams, and the rest of the company.</li><li>The ability to help others on the team become better at their jobs through mentoring, thoughtful code reviews, and generally being a team player.</li></ul><h5>ASSETS</h5><p>If you have experience with any of the following please make sure to highlight it in your cover letter:</p><ul><li>Agile processes, including breaking large projects up into smaller stories, estimation, working in branches (GitHub Flow), code review, and CI.</li><li>Golang code, especially large code bases.</li><li>Microservices and message queues.</li><li>Docker, Mesos, DCOS, Kubernetes.</li><li>C or C++ code and debugging compiler issues across platforms.</li><li>Perl, Python, Tcl, or Ruby, especially an understanding of their respective language communities and their toolchains.</li><li>Big iron operating systems including Solaris, AIX, and HP-UX.</li><li>Build tools such as make, autotools, bazel, etc.</li></ul><h5>HOW TO APPLY</h5><p>Please submit your contact info, resume, and a cover letter below. Submissions without a cover letter will not be considered. We look forward to hearing from you!</p><p>We are committed to creating a welcoming environment for everyone at ActiveState and we welcome applicants from all walks of life.</p><p>Even if you don’t feel you meet every exact requirement, we still would love to hear from you and why you think you would be an awesome addition to our team and we encourage you to apply.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>This position is open to full-time telecommuters anywhere in North America.</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Apr 6, 2018 4:08:55 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "go"
    ]
  },
  {
    "id": "Jwb_almUQq2zxDwW2QPtqA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "unicornhunt.io",
    "url": "https://unicornhunt.io/jobs/data-engineer-at-x-team",
    "title": "Data Engineer",
    "content": " <b>About X-Team:</b> <br><br>&nbsp;“Motivated developers, ready to join your team.”  X-Team is an international company founded in Melbourne, Australia that helps companies scale their development teams by providing them with extraordinary developers from around the world.<br><br>  We are 100% remote and believe in building a world where developers can have access to an environment of growth and incredible opportunities regardless of where they live. Our culture is based around the proactive, selfless values that make up every X-Teamer.  We are a community of people dedicated to unleashing our potential every day. Learn more about how we can help you learn and grow at https://x-team.com/unleash/<br><br>  <b>About You:</b> <br><br>&nbsp;The right individual will be self-driven. Someone who cares about maintainability of the code, automation, deployment processes and how to enable innovation through fostering a growing culture of Open Source. You will go beyond just coding and help to shape the engineering culture and best practices. <p><br></p> <b>Most important:</b><ul><li>Experience with high volume data processing and storage, both real-time and historical</li><li>Experience with implementing big data Edge services and security</li><li>Proficiency in programming / scripting languages (Java, Python, C++, Golang)</li><li>Experience with AWS EC2, AWS ECS, Docker, Terraform, Ansible</li><li>Experience with ElasticSearch, Flink, Logstash, Kafka, DynamoDB</li></ul><ul></ul> <b>Nice to have:</b> <ul><li>Experience with working remotely</li></ul> <b>Personal:</b> <ul><li>Possess a spirit of generosity</li></ul> <b>Perks:</b> <ul><li>We’ll provide up to $2,500 in funding for your learning and growth through our Unleash program, which provides opportunities to unleash your potential through initiatives that help you grow as a developer and explore your passions more each day. (http://x-team.com/unleash)</li></ul> <b>FAQ:<br><br></b>  Who is X-Team meant for? <br>&nbsp;- Any freelance developers with experience working on high-scale, remote teams and projects with a motivated, proactive attitude and compassionate, team-player heart. If you've worked with freelancing platforms before, that's not what we are. <br><br>X-Team is a community of all likeminded people, carefully chosen to ensure we are able to create an environment of the most motivated people in the world who come together to unleash their potential. What we've created is truly special and not a faceless platform. X-Team is where developers go to feel truly at home together, while becoming more motivated than they've ever been.<br><br>  What are you hiring for right now? <br>&nbsp;- We are hiring for Data Engineers to fill some exciting new opportunities we have. We're also hiring for a variety of other skills, such as PHP, React, React Native, Cryptocurrency/blockchain, Node.js, Salesforce, DevOps, and Golang.<br><br>  Will I get a job immediately after applying? <br>&nbsp;- If your skills, experience and values align with a current opening we have, your chances of getting hired immediately are high. If we discover you're qualified but all opportunities have been taken, we'll continue to work with you to help you get a role in X-Team. The key is having the most relevant, in-demand skills when you apply.<br><br>  What kind of opportunities do you provide? <br>&nbsp;- We provide full-time opportunities that last, on average, for 10 months. After your role ends (and so long as you've performed well), we continue to give you work internally with us until we find you a new opportunity. This ensures that X-Team can be a stable work option for you as a freelancer. ",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 9:06:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go"
    ]
  },
  {
    "id": "Fky6wAaLRAen2bClb54d2g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16742282",
    "title": "Loom Network | Go Backend Engineer | Asia | Remote | Full-time",
    "content": "<div>                  <span>Loom Network | Go Backend Engineer | Asia | Remote | Full-time<p>Loom Network(Techstars '18) famous for Cryptozombies. Is looking for senior Go backend engineerings to work remotely on scaling blockchain software for Ethereum. We have our own core blockchain technologies, and looking for devs that are interested in consensus, distributed computing, and databases.</p><p>Knowledge of Go is required. Bonus if you know k8s, Raft, Paxos or other consensus systems. Solidity bonus also.</p><p>Please email hiring@loomx.io with your resume.</p><p>Check our website <a href='https://loomx.io' rel='nofollow'>https://loomx.io</a> or read one of our blog posts about our tech. <a href='https://medium.com/loom-network' rel='nofollow'>https://medium.com/loom-network</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 10:00:06 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "HTlGPup2Tk2bKg3U19oYnw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16741537",
    "title": "Abot | Full-Stack Engineer | Venice, CA | Full Time, Onsite, Remote OK",
    "content": "<div>                  <span>Abot | Full-Stack Engineer | Venice, CA | Full Time, Onsite, Remote OK<p>Abot automates customer service for eCommerce companies using machine learning. We integrate directly into existing tools and work out-of-the-box with a 15-minute setup.</p><p></p><pre><code>  * Early stage company with experienced founding team  * You'll work directly with the CEO/CTO as first engineering hire  * No corporate bullshit. You do you.  * Golang stack we're proud of, very little technical debt  * Our office is steps from the beach</code></pre>No prior Go or ML experience is necessary. No degree required. If you love building things, that's good enough for us. Let's build some amazing technology and have fun doing it.<p>Shoot me an email with a link to a project that you built or are excited about: evan @ abotlabs.com.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 6:00:07 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "_uq3OdxjRs2eoqgukvnHSQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16741111",
    "title": "InfluxData | Software Engineer | SF | REMOTE or ONSITE | Full-time",
    "content": "<div>                  <span>InfluxData | Software Engineer | SF | REMOTE or ONSITE | Full-time<p>We are a time series database, looking for experienced Golang SWEs to work on InfluxDB.</p><p>I'm on this team, I work remotely. Company is growing fast, everyone is smart and nice.</p><p>Email me directly jacob.marble@influxdata.com</p><p><a href='https://www.influxdata.com/blog/why-i-joined-influxdata-jacob/' rel='nofollow'>https://www.influxdata.com/blog/why-i-joined-influxdata-jaco...</a></p><p><a href='https://www.influxdata.com/careers/' rel='nofollow'>https://www.influxdata.com/careers/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 5:00:06 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "jlewoLSyTc66xweIvVSSmQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16738640",
    "title": "Kentik | Software Engineer | San Francisco | Onsite/Remote | Full-Time | kentik.com",
    "content": "<div>                  <span>Kentik | Software Engineer | San Francisco | Onsite/Remote | Full-Time | kentik.com<p>Who wants to build a database? A specialized database. Kentik is a tool to ingest and process network metadata: how many bytes, how many packets, are your tcp sessions suddenly seeing an uptick in re-transmits, how does your window size look, are you under attack, did you just get BGP high-jacked?</p><p>We wrote a custom database in go, which at its heart works by taking a time range, storing all events by time-slice and then at query time querying each time segment in parallel. This is hidden behind a Postgres front end using the foreign data wrapper interface PG provides. A data visualization layer on top distills the inputs down into actionable intelligence.</p><p>The end result of all this is that when anything changes on your network you get a slack message.</p><p>Interested? We're hiring for multiple roles, including:</p><p>* Full stack JS engineer working in a react code base. Work up from postgres -&gt; node -&gt; client browser.</p><p>* System engineer fluent in go and/or rust. Build fault tolerant distributed applications capable of handling billions of data points per day.</p><p>* Product manager. You are working with customers and employees to influence product strategy and shepherd projects to completion.</p><p><a href='https://www.kentik.com/careers' rel='nofollow'>https://www.kentik.com/careers</a> to apply. We are a split team 50% based in SF and 50% full time remote.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 10:58:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go"
    ]
  },
  {
    "id": "o-wQSbHpRWK4UCeBOGVyNQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16738116",
    "title": "Seed (YC W15) | Backend Engineers | Full Time | REMOTE (US Only) | https://seed.co/",
    "content": "<div>                  <span>Seed (YC W15) | Backend Engineers | Full Time | REMOTE (US Only) | <a href='https://seed.co/' rel='nofollow'>https://seed.co/</a><p>We’re taking on the challenge of modernizing small business banking. We build beautiful, easy-to-use tools for banking, invoicing, expense tracking, and more, so our members can focus on helping their businesses thrive. Those tools also need to integrate smoothly with often-antiquated banking systems, and be bank-level secure. It’s a huge challenge, but one we enjoy tackling every day. Our customers love us, and we're just getting started.</p><p>As part of the Backend Engineering team you'd be building the core of platform, with no shortage of tough problems.</p><p>Tech Stack: Golang, Docker, AWS, Terraform &amp; Packer for Ops.</p><p>We are a fully remote team and constantly use Slack/Zoom/Github to keep in touch.</p><p>Process:</p><p>Phone intro, phone screen, technical interview with the team (either onsite in Portland/San Fran or remote), decision. We strive to complete this process within 2 weeks if a candidates schedule permits.</p><p>Apply: <a href='https://seed.co/jobs/' rel='nofollow'>https://seed.co/jobs/</a></p><p>Feel free to reach out to me at benji at seed.co if you have any questions.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 10:14:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "wb-xee69Q2eAIq5wr-3VTw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/x-team-data-engineer",
    "title": "X-Team: Data Engineer",
    "content": "<div>  <div>    <h2>Data Engineer</h2>      <h4>Posted Apr  2</h4>    <h3>      <span>X-Team</span><br>      <span>Headquarters: Remote</span><br>        <a href='https://x-team.com/remote-data-engineer-jobs/?utm_source=weworkremotely&amp;utm_medium=board&amp;utm_campaign=wwr-q4-18' rel='nofollow'>https://x-team.com/remote-data-engineer-jobs/?utm_source=weworkremotely&amp;utm_medium=board&amp;utm_campaign=wwr-q4-18</a>      <br>      <a rel='nofollow'>View all X-Team jobs →</a>    </h3>  </div>    </div>  <div>    <div><b>About X-Team:</b></div><div><br></div><div>“Motivated developers, ready to join your team.”</div><div><br></div><div>X-Team is an international company founded in Melbourne, Australia that helps companies scale their development teams by providing them with extraordinary developers from around the world.</div><div><br></div><div>We are 100% remote and believe in building a world where developers can have access to an environment of growth and incredible opportunities regardless of where they live. Our culture is based around the proactive, selfless values that make up every X-Teamer.</div><div><br></div><div>We are a community of people dedicated to unleashing our potential every day. Learn more about how we can help you learn and grow at https://x-team.com/unleash/</div><div><br></div><div><b>About You:</b></div><div>The right individual will be self-driven. Someone who cares about maintainability of the code, automation, deployment processes and how to enable innovation through fostering a growing culture of Open Source. You will go beyond just coding and help to shape the engineering culture and best practices.</div><div><br></div><div><b>Most important:</b></div><div><b><br></b></div><ul><li>Experience with high volume data processing and storage, both real-time and historical<br></li><li>Experience with implementing big data Edge services and security<br></li><li>Proficiency in programming / scripting languages (Java, Python, C++, Golang)<br></li><li>Experience with AWS EC2, AWS ECS, Docker, Terraform, Ansible<br></li><li>Experience with ElasticSearch, Flink, Logstash, Kafka, DynamoDB<br></li></ul><div><b><br></b></div><div><b>Nice to have:</b></div><ul><li>Experience with working remotely</li></ul><div><br></div><div><b>Personal:</b></div><ul><li>Independent, self-motivated<br></li><li>Fluent in English, written and spoken<br></li><li>Proven track record of always learning and growing.<br></li><li>Proactive attitude<br></li><li>Possess a spirit of generosity</li></ul><div><br></div><div><b>Perks:</b></div><ul><li>Get the chance to work with big brands like Riot Games, Fox Broadcasting, Kaplan Inc., etc.<br></li><li>Live and work in one of our roaming hacker houses (X-Outposts) around the world. http://x-outpost.com<br></li><li>Work from anywhere as part of a community of digital nomads.<br></li><li>Join our vibrant community, filled with opportunities to learn new skills together in study groups, join clubs (photography, gaming, etc.) and get free camera equipment/games/conferences/courses/massages/etc., charitable fundraisers, fitness &amp; yoga programs (+gym membership), etc. This is the community to be in if you're a remote developer.<br></li><li>We’ll provide up to $2,500 in funding for your learning and growth through our Unleash program, which provides opportunities to unleash your potential through initiatives that help you grow as a developer and explore your passions more each day. (http://x-team.com/unleash)</li></ul><div><br></div><div><b>FAQ:</b></div><div>Who is X-Team meant for?</div><div>- Any freelance developers with experience working on high-scale, remote teams and projects with a motivated, proactive attitude and compassionate, team-player heart. If you've worked with freelancing platforms before, that's not what we are. X-Team is a community of all likeminded people, carefully chosen to ensure we are able to create an environment of the most motivated people in the world who come together to unleash their potential. What we've created is truly special and not a faceless platform. X-Team is where developers go to feel truly at home together, while becoming more motivated than they've ever been.</div><div><br></div><div>What are you hiring for right now?</div><div>- We are hiring for Data Engineers to fill some exciting new opportunities we have. We're also hiring for a variety of other skills, such as PHP, React, React Native, Cryptocurrency/blockchain, Node.js, Salesforce, DevOps, and Golang.</div><div><br></div><div>Will I get a job immediately after applying?</div><div>- If your skills, experience and values align with a current opening we have, your chances of getting hired immediately are high. If we discover you're qualified but all opportunities have been taken, we'll continue to work with you to help you get a role in X-Team. The key is having the most relevant, in-demand skills when you apply.</div><div><br></div><div>What kind of opportunities do you provide?</div><div>- We provide full-time opportunities that last, on average, for 10 months. After your role ends (and so long as you've performed well), we continue to give you work internally with us until we find you a new opportunity. This ensures that X-Team can be a stable work option for you as a freelancer.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://x-team.com/remote-data-engineer-jobs/?utm_source=weworkremotely&amp;utm_medium=board&amp;utm_campaign=wwr-q4-18' rel='nofollow'>https://x-team.com/remote-data-engineer-jobs/?utm_source=weworkremotely&amp;utm_medium=board&amp;utm_campaign=wwr-q4-18</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 10:04:11 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "frontend",
      "go"
    ]
  },
  {
    "id": "dBT27MNCQaOTXehg7EAFfg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16737687",
    "title": "Canonical | Software Engineer | Full Time | REMOTE Canonical is the company behind Ubuntu Linux. We are a globally distributed team ...",
    "content": "<div>                  <span>Canonical | Software Engineer | Full Time | REMOTE<p>Canonical is the company behind Ubuntu Linux. We are a globally distributed team passionate about open source.</p><p>Canonical is hiring for roles across engineering and elsewhere: <a href='https://grnh.se/8kfpq1yt1' rel='nofollow'>https://grnh.se/8kfpq1yt1</a>. Our typical tech stack includes python and golang, and products are generally open source, and openly developed.</p><p>Here's some of the open roles:</p><p>- Software Engineer, Juju: <a href='https://grnh.se/r22x7qu01' rel='nofollow'>https://grnh.se/r22x7qu01</a>Looking for go developer who has networking experience to join our juju engineering team. Juju is a modeling and software orchestration tool that is capable of deploying to clouds, containers or bare metal.</p><p>- Software Engineer, JAAS: <a href='https://grnh.se/svkwm76u1' rel='nofollow'>https://grnh.se/svkwm76u1</a>Looking for go developer who wants to work on SAS offering for modeling software. Challenges include distributed computing, distributed trust models, and availability across public clouds.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 9:37:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "v6g-oSY_TQSM3hbH_Xwwcw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/moveon-org-full-stack-software-engineer",
    "title": "MoveOn.org: Full Stack Software Engineer",
    "content": "<div>  <div>    <h2>Full Stack Software Engineer</h2>      <h4>Posted Apr  2</h4>    <h3>      <span>MoveOn.org</span><br>      <span>Headquarters: Virtual</span><br>        <a href='http://www.moveon.org' rel='nofollow'>www.moveon.org</a>      <br>      <a rel='nofollow'>View all MoveOn.org jobs →</a>    </h3>  </div></div>  <div>    <div><span></span></div><div><span>MoveOn.org</span><br></div><div><span>FULL STACK SOFTWARE ENGINEER</span><br></div><div><span>Full-time</span><span> •&nbsp;Starts ASAP and ends Nov 30 •&nbsp;Competitive pay • Excellent benefits</span><br></div><div><span>Work from anywhere in the continental U.S.</span></div><div><br></div><div><span>Our country is in a crisis, and stakes in 2018 couldn’t be higher. Since Donald Trump took office, MoveOn members have been a pillar of the resistance to the radical policies coming out of Congress and the White House. In this election, MoveOn will mobilize a grassroots wave to take back our government and create a nation where all can thrive—one marked by justice, sustainability, economic security, peace, and mutual care</span></div><div><br></div><div><span>MoveOn.org’s </span><a href='https://front.moveon.org/plans-for-15-mil-resist-and-win/' rel='nofollow'><span>“Resist &amp; Win”</span></a><span> 2018 election program centers on recruiting, training, and supporting hundreds of volunteer leaders in more than 100 congressional districts to mobilize thousands of volunteers to join them in strategic movement building and voter engagement actions—paired with the power of our cutting-edge Video Lab, Analytics, Technology, and Digital Campaigning teams. </span></div><div><br></div><div><span>We are determined to make the 2018 elections a turning point, helping Democrats win the U.S. House to create a roadblock to Trump and Republicans’ ability to advance their toxic agenda, while building the movement for racial, economic, immigrant, and climate justice, and electing new progressive champions who can help lead our country to a better future in races down ballot across the country. </span></div><div><br></div><div><span>With millions of members nationwide and a 20-year track record of winning electoral and progressive issue campaigns and breaking new digital and field organizing ground, MoveOn is uniquely suited to power the progressive wave it will take to win back control of the House in 2018 and strengthen our collective movement. </span></div><div><br></div><div><span>Responsibilities:</span></div><div><br></div><ul><li><span>Write code and lead projects that span the entire software stack, including prototyping, rich front-end apps, APIs, high-performance back-end applications, database design, and cloud architecture.</span><br><br></li><li><span>Create and contribute to open source projects that share MoveOn’s innovations with the larger developer community.</span><br><br></li><li><span>Research and adopt new technologies and programming languages to improve our work.</span><br><br></li><li><span>Contribute to software architecture discussions and decisions.</span><br><br></li><li><span>Come up with ideas for new innovative distributed-organizing applications.</span><br><br></li><li><span>Learn, grow, and succeed in your career.</span><br><br></li></ul><div><span>Required skills and experience:</span></div><div><br></div><ul><li><span>Fluent in at least one front-end programming language and web development platform, and at least one back-end programming language and web development platform.</span><br><br></li><li><span>Interested in learning and diving into new languages, tools, and frameworks.</span><br><br></li><li><span>Familiar with agile software development methodologies.</span><br><br></li><li><span>Curious, fearless learner and problem solver.</span><br><br></li><li><span>A determined, thorough, and relentless finisher, able to reliably drive tasks and projects from idea to completion, production, scaling, and beyond.</span><br><br></li><li><span>Ability to be effective in an organization whose staff all work remotely.</span><br><br></li></ul><div><span>Reports to:</span><span> Chief Technology Officer</span></div><div><br></div><div><span>Classification, Salary, and Benefits:</span><span> Full-time; highly competitive salary includes benefits such as 100%-employer-paid premiums for medical, dental, and vision insurance for all staff and their children; employer-paid premiums for life insurance for all staff; 13.32 hours accrued vacation per month; 6.66 hours accrued sick leave per month; floating and all-staff holidays; and reimbursement of home office expenses. &nbsp;</span></div><div><br></div><div><em>MoveOn.org Civic Action and MoveOn.org Political Action provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran, in accordance with applicable federal, state, and local laws.</em><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Go to <a href='https://grnh.se/4j15ysc61' rel='nofollow'>https://grnh.se/4j15ysc61</a> to submit an application</p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 9:24:51 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "mgQQnZfjSr-IB7bOPa6XAA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16737051",
    "title": "Datawire | Telepresence OSS Engineer | Full-time | REMOTE and ONSITE (Boston)",
    "content": "<div>                  <span>Datawire | Telepresence OSS Engineer | Full-time | REMOTE and ONSITE (Boston)<p>Datawire is a Boston-based startup that builds open source tools so that developers can code faster on Kubernetes. Our tools include Telepresence (<a href='https://www.telepresence.io' rel='nofollow'>https://www.telepresence.io</a>) for local development; Forge (<a href='https://forge.sh' rel='nofollow'>https://forge.sh</a>) for build/deployment; and Ambassador (<a href='https://www.getambassador.io' rel='nofollow'>https://www.getambassador.io</a>), an API Gateway for Kubernetes.</p><p>We're looking for a systems engineer who has a strong understanding of systems and networking. This is <i>not</i> a job if you consider yourself a &quot;full-stack engineer&quot;. If you would be comfortable hacking on a VPN client, consider yourself a strong candidate :-). We're looking for someone who's fluent in at least one of Python/Golang/C. Kubernetes experience a huge plus, but not required.</p><p><a href='https://www.datawire.io/careers/' rel='nofollow'>https://www.datawire.io/careers/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 8:51:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "xFHsfgp2TM247SHywToA0g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16736706",
    "title": "CyberArk (Conjur team) | Front End / Backend / DevOps / Security | REMOTE (OR ONSITE NEWTON, MA) | FULL-TIME",
    "content": "<div>                  <span>CyberArk (Conjur team) | Front End / Backend / DevOps / Security | REMOTE (OR ONSITE NEWTON, MA) | FULL-TIME<p>The CyberArk Conjur team helps people write super reliable software that's hard to hack. We're building tools that make the best security practices convenient for developers, ops, and security teams. We're hiring engineering managers, product owners, and of course, engineers.</p><p>ABOUT US</p><p>We're a fast-growing team, thanks to the increasing success of our product: the Conjur appliance secures the entire software development and deployment lifecycle for companies who want to ship features as fast as possible without increasing their risk of security breaches.</p><p>We are looking for experienced software engineers to join our team. Conjur engineers work on a wide variety of projects, from integrations with some of today's most popular DevOps tools to moonshot projects that seek to revolutionize the way engineering teams factor in security when deploying applications.</p><p>We know that if you're a professional engineer, experience with specific tools or languages can usually be picked up quickly. That being said, Conjur engineers are using the following tools on a more-or-less daily basis:- Ruby, Rails, Golang, Postgres, and JS - Docker, Git, and Jenkins - Kubernetes, OpenShift, Cloud Foundry - Puppet, Chef, Ansible</p><p>FOR MORE INFORMATION</p><p>conjur.org (our secret service, AGPLv3)<a href='https://www.conjur.com/careers/engineering/puzzle' rel='nofollow'>https://www.conjur.com/careers/engineering/puzzle</a> (our coding puzzle)conjur.org/blog (our blog, which talks more about who we are and what we do)<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 8:23:05 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/go",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go",
      "ruby"
    ]
  },
  {
    "id": "tt7vayvkQ2S2whZqpBvpuQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16736485",
    "title": "Kolide | Early-Stage | Full-time | Remote first, Onsite optional | Somerville, MA | https://kolide.com/",
    "content": "<div>                  <span>Kolide | Early-Stage | Full-time | Remote first, Onsite optional | Somerville, MA | <a href='https://kolide.com/' rel='nofollow'>https://kolide.com/</a><p>Kolide is an early-stage startup with a mission to build the world’s next generation endpoint security and infrastructure analytics platform. At it’s core, Kolide enables you to ask computers important questions, get back immediate answers, and take decisive action. Kolide does all this by leveraging the awesome power of Facebook’s osquery framework and extending it with built-in security and operations expertise. You'll have the opportunity to work on open-source software with the creators of osquery, led by a former FireEye executive.</p><p>Our Current Stack:</p><p></p><pre><code>  * Go  * Javascript  * Kubernetes  * C++</code></pre>Roles we are hiring for:<p></p><pre><code>  * Site Reliability Engineer   * Software Engineer: Backend, Frontend, and Host   * Security Engineer </code></pre>Contact us at jobs@kolide.co | More info: <a href='https://kolide.com/careers' rel='nofollow'>https://kolide.com/careers</a><span>              </span><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 8:05:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "ghIWPzvoRpOYBo3gHeM4_A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16735461",
    "title": "Job: Software Engineer, Remote (Golang desirable) Sensible Code build software for economists and statisticians to access modern ...",
    "content": "<div>                  <span>Job: Software Engineer, Remote (Golang desirable)<p>Sensible Code build software for economists and statisticians to access modern data science techniques and machine learning.</p><p>We’re looking for a software engineer to work on TableBuilder, our super-fast statistical table builder for big, confidential datasets. Key things to know about this job:</p><p></p><pre><code>  - Full stack web development using Go and AWS  - Work with the UK’s well-regarded Office for National Statistics  - Create world-leading anonymisation algorithms for large datasets  - Flexible, fully remote working</code></pre>More info and how to apply here: <a href='https://medium.com/@SensibleCode/job-software-engineer-golang-desirable-1fd3301d5a0d' rel='nofollow'>https://medium.com/@SensibleCode/job-software-engineer-golan...</a><span>              </span><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 6:39:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "mG_CoNIaQwunc-YdvomJXw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/cycloid_io/jobs/117869-cloud-devops-container-engineer-with-go-development-backend-working-in-remote-in-europe-or-on-site-in-paris-on-cycloid-io-devops-platform-with-ci-cd-container-pipeline-devops-services",
    "title": "Cloud DevOps Container Engineer with Go development backend working in remote in Europe or on-site in Paris on cycloid.io: DevOps platform with CI/CD container pipeline & DevOps Services",
    "content": "<div><h2>Cloud DevOps Container Engineer with Go development backend working in remote in Europe or on-site in Paris on cycloid.io: DevOps platform with CI/CD container pipeline &amp; DevOps Services at Cycloid</h2><div>Europe, Sweden, Israel, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Machine Learning, Automation, Continuous Integration, Managed Services, Continuous Deployment, Continuous Delivery, AWS/EC2/ELB/S3/DynamoDB, Docker, Ansible, Sensu, AWS, Kubernetes, Terraform, PACER, concourse, Go</div><div>Compensation</div><div>$40K–$100K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>You are a passionate DevOps, which is the most important, with a major expertise in Operations with troubleshooting. You believe that containers (Kubernetes &amp; Docker) are the future. Pacer, Ansible, Terraform, Prometheus are well-known to you.<br> <br>On the Ops side, you have a successful experience in a Cloud provider certifications are preferred.</p><p>You love to design architecture, collaborate with developers to fix problems and provide long-term solutions. Providing service and automation on Cloud is a pleasure and with your experience, you understand why public cloud is the solution.</p><p>On the Dev/R&amp;D side, you want to be a change-maker by developing products that will facilitate DevOps and Cloud adoption for our customers. </p><p>The main difference between a SysOps and a DevOps is that you have an experience in development and that you are able to contribute to Cycloid product roadmap. </p><p>If you have an experience in Development: C / C++, Golang would be better, or any another concrete experience/language. </p><p>If not, you will work then 50% on services &amp; 50% R&amp;D to improve both your skills and break the monotony.</p><p>You can decide to work on-site in Paris or on remote whenever you are located in Europe but all the organization is in an asynchronous manner, keeping a good team culture through Slack and conference meetings. </p><p>You like to identify problems, are capable of commenting in a constructive, positive &amp; open way to the team. Mindset is what is the most important.</p><p>You have adequate written and oral communication skills in English, any others languages would be a plus.</p><p>Cycloid is committed to having equality between women and men. In that way, we strongly encourage women's application. </p><p>The salary will depend on your skills and location.</p></div>",
    "urlFetchPending": false,
    "published": "Mar 26, 2018 6:46:19 PM",
    "tags": [
      "AWS/EC2/ELB/S3/DynamoDB",
      "Ansible",
      "Automation",
      "Backend Developer",
      "Continuous Delivery",
      "Continuous Deployment",
      "Continuous Integration",
      "DevOps",
      "Docker",
      "Europe",
      "Full Time",
      "Israel",
      "Machine Learning",
      "Managed Services",
      "REMOTE1/100",
      "Remote OK",
      "Sensu",
      "Sweden",
      "Systems Engineer",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "iHVCTi78TRqcT4ZsUQMs-A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/171171/senior-backend-developer-golang-remote-teamwork?a=Vp8wNqWNdQs",
    "title": "Senior Backend Developer (Golang) - Remote at Teamwork (Cork, Ireland) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Collaboration Tools, Customer Service, Project Management</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>About Us</strong></p>At Teamwork.com, we pride ourselves on creating the best software, working with outstanding people, and going above and beyond for our customers. That excellence has been rewarded with hundreds of thousands of amazing customers all across the globe and millions of users who sign in every day to trust us with getting their businesses organized and running productively. We’re a profitable, entirely self-funded business with no investors or outside influences beyond one: our customers and what's best for them. It’s a responsibility that we take very seriously. We’re a company of action, full of triers and doers: we try things, we make mistakes, and we learn from them.<p>Growing this company from Cork with an extremely talented team of people is an amazing journey to be a part of. We’re a place to work unlike any other, and our incredible campus is a testament to our unique, creative way of doing things:&nbsp;<a href='https://www.youtube.com/playlist?list=PLAN4i3TBOs8XR6bzrq_x35SB6FR9BJv6y' rel='nofollow'>see for yourself</a>.</p>We're looking for an experienced back end developer to join our team and help us create our super-cool, super-secret new product.<p></p><p><strong>Must Have</strong></p><ul><li>Experience with Go.</li><li>Knowledge of REST and developing APIs.</li><li>Experience with MySQL/MariaDB.</li><li>Working knowledge of cloud infrastructure services, preferably AWS.</li><li>Good communication skills.</li></ul><p><strong>Nice to Have</strong></p><p>Experience with any of the following:</p><ul><li>JSON API.</li><li>Kubernetes.</li><li>RabbitMQ / AMQP.</li><li>Redis or similar for caching.</li></ul><p><strong>Perks and Benefits</strong></p>Working at Teamwork.com isn't like a normal job. We believe in hiring only the best and then looking after them like they deserve. On top of a great financial package, we do everything possible to make Teamwork.com a great place to work.<p></p>We believe in paying a competitive salary: earn what you're worth, with regular reviews. We’re committed to your long-term future at the company, and we’re passionate about helping you to improve and enhance your skills.<p>You have unparalleled freedom in how you do your job. Spot something that needs improving? Off you go, make it happen. You’ll be given only the very best equipment so that, whatever your role, you'll have the very best kit to help you do your best work.</p>We're invested in your health and happiness. We offer full health insurance and income protection to all our employees, so you can rest assured that you and your loved ones will be taken care of, no matter what happens.<p>We offer an unmatched work environment, that’s built to make life easy and is constantly improved. We also have an incredible campus unlike anything you’ve seen before (unless you’ve already checked out our&nbsp;<a href='https://www.youtube.com/playlist?list=PLAN4i3TBOs8XR6bzrq_x35SB6FR9BJv6y' rel='nofollow'>YouTube channel</a>). Discounted travel schemes and a Bike to Work scheme make it even easier to get to us, and catered lunches and plenty of in-house snacks and refreshments mean that you’ll always stay refreshed and refuelled.</p>We take work-life balance very seriously: we’ll set you up with a subsidized gym membership at the gym of your choice, as well as weekly gym classes at the gym downstairs. We also have an in-house games room, for when you want to take a quick break or challenge a co-worker, and regular company-sponsored lunches, movie nights, and nights out.<p>Sounds epic? Join the journey at Teamwork.com.</p><em>Teamwork.com is an equal opportunities employer.</em><p>                    </p></div>                            <h2>                About Teamwork            </h2>            <div><p><strong>Teamwork.com</strong> is an online and mobile application that is used by hundreds of thousands of businesses world-wide to help them get work done. Customers include Walt Disney, Forbes, Puma, Harvard and many more. We are based in sunny Cork, Ireland but also have staff scattered throughout the world.&nbsp;</p><p><a href='https://www.teamwork.com/perks-and-benefits' rel='nofollow'>Check out our Perks and Benefits here.</a></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Happiness Initiatives                            </div>                            <div>                                 Free Gym Membership                            </div>                            <div>                                 Only the Best Tech                            </div>                            <div>                                 Competitive Salaries                            </div>                            <div>                                 Regular Staff Lunches                            </div>                            <div>                                 No Clock Watching, work on your own time.                            </div>                            <div>                                 Discounted Travel                            </div>                            <div>                                 Wellness Days/Massage Days                            </div>                            <div>                                 Own Door Office                            </div>                            <div>                                 After 12 months you get 6 Weeks' Holidays                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "1N1TV87WTMCQjPqKrOSXZw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/170411/go-developer-contract-ems-software?a=V9kLEzQLuYo",
    "title": "Go Developer (Contract) at EMS Software (Centennial, CO) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise Software</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Leveraged by millions of users every day, EMS Software manages some of the highest profile spaces in the world (including the NASDAQ bell). We are consistently delivering new features to our suite of products. We want to tackle bigger challenges and accomplish some truly amazing things. Our team is always improving our codebase and operations footprint and we have amassed a sizeable backlog of interesting challenges and product initiatives. Our team needs to grow to enable even greater success in our industry, and that's where you come in.</p><p><strong>Responsibilities</strong></p><ul><li>As our Middle Tier developer you will be part of a 4-5 person agile development team</li><li>Your team currently develops and maintains our newly introduced middle tier in our pursuit to transform our technology stack into a multi tenant PAAS solution</li><li>You will embrace developing within our CI/CD pipeline and have the opportunity to improve it</li><li>Your code will efficiently process millions of customers bookings both in our own cloud and on premise installations</li><li>You will work with your development lead, the front end team and product management team during the identification, development and implementation of the work involved</li><li>You will work with our Quality Engineering Architect to make sure changes made are safe and assertable</li></ul><p><strong>Required Experience</strong></p><ul><li>1-3 years production Golang experience</li><li>5+ years backend/middle tier development experience</li><li>1+ years unit tests experience</li><li>1+ years of SQL experience</li><li>Experience working within an Agile SDLC process</li><li>Strong interpersonal, written, and oral communication skills</li><li>Technical documentation skills</li><li>Ability to present ideas in user-friendly language</li><li>Self-motivated and directed, with keen attention to detail</li><li>Able to prioritize and execute tasks in a high-pressure environment</li><li>Devops mentality is a PLUS</li></ul>                    </div>                            <h2>                About EMS Software            </h2>            <div><p>EMS Software offers the most comprehensive, cutting-edge platform to enable innovative work and learning environments. We make it easier to connect people with space, resources, and technology – allowing them to collaborate flawlessly, make informed business decisions, and get more out of each day.</p><p><em>EMS Software is proud to be an Equal Opportunity Employer. Applicants are considered for all positions without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, ancestry, marital or veteran status. We are committed to hiring a diverse and talented workforce, supporting integrity in the workplace and an entrepreneurial atmosphere.</em></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Medical, dental and vision plans                            </div>                            <div>                                 Physical fitness reimbursement plan and on-site fitness center                            </div>                            <div>                                 Self-Directed PTO                            </div>                            <div>                                 Flexible work environment and remote work options                            </div>                            <div>                                 Competitive compensation and employer-matched 401(k) savings plan                            </div>                            <div>                                 &quot;Bug hunts,&quot; casual dress code, open floor plan, collaboration spaces                            </div>                            <div>                                 Two blocks from the Arapahoe Village Center RTD Station                            </div>                            <div>                                 Walking distance to numerous bars, restaurants and coffee shops                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "Bs151vmiRx2v-Yhe-viC9Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4275-backend-engineer-vividcortex",
    "title": "Backend Engineer @ VividCortex",
    "content": "<h2>              Backend Engineer<small> @ VividCortex</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-03-16 20:25</p></dd>          <dt><span>Description</span></dt>          <dd><h5>About VividCortex</h5><p>VividCortex is a groundbreaking database monitoring platform that gives developers and DBAs deep visibility into the database. Our solution is delivered as software-as-a-service and helps our customers see and analyze the work their databases are doing in unprecedented detail. It addresses critical issues in measuring and managing today's large, distributed, diverse storage tiers composed of multiple different clustered products, all working together.</p><p>We have a fast-growing customer base of well-known companies, and a tremendous reputation in our market for delivering a high-quality, innovative solution for database performance problems that are common in thousands of enterprises. Is it time for you to take a leap into an exciting start-up?</p><h5>About the Role</h5><p>VividCortex is looking for an experienced software engineer to help us build and improve the platform that ingests, secures, and analyzes the massive amounts of performance and other data we measure from our customers' database servers. Our platform is written in Go and hosted on the AWS cloud. It uses Kafka, Redis, and MySQL for data storage and analysis. We are a DevOps organization building a 12-factor microservices application; we practice small, fast cycles of rapid improvement and full exposure to the entire infrastructure, but we don't take anything to extremes.</p><p>The position offers excellent benefits, a competitive base salary, and the opportunity for equity. Diversity is important to us, and we welcome and encourage applicants from all walks of life and all backgrounds.</p><p>This position is based in the United States. Although the Charlottesville, VA area is the preferred location, remote candidates will be considered.</p><h5>Responsibilities:</h5><ul><li>Discover, define, document, and design selected portions of our infrastructure, whether that's public APIs, internal services, background worker tasks, statistical computations, or the like.</li><li>Write code, tests, and deployment manifests and artifacts, using CircleCI, Git and GitHub, pull requests, issues, etc. Collaborate with peers on code review and approval.</li><li>Deploy, observe, and operate the systems you build. Use ChatOps, VividCortex, Ansible, the Unix command line, and other tools to do this.</li><li>Measure and improve the code and system as it runs in production.</li><li>Help provide customer support, and you'll help other departments, such as Sales, as needed.</li><li>Rotate through on-call duty.</li><li>Understand and enact our security posture and practices; security is part of everyone's job here.</li><li>Continually seek to understand and improve performance, reliability, resilience, scalability, and automation. Our goal is that systems should scale linearly with our customer growth, and the effort of maintaining the systems should scale sub-linearly.</li><li>Contribute to a culture of blameless learning, responsibility, and accountability.</li><li>Self-manage your workload, collaborating and working independently as needed. Be present and online during your team's normal working hours, and attend and participate in team calls and meetings.</li></ul><h5>Qualifications:</h5><ul><li>You are collaborative, self-managing, and experienced in general development, deployment, and operation of modern API-powered web applications using continuous delivery and Git in a Unix/Linux environment.</li><li>SaaS multitenant experience is a bonus.</li><li>Experience with enterprise security is a plus.</li><li>Experience with Go and MySQL is very beneficial.</li><li>Bash scripting experience is desirable.</li><li>A 4-year degree from an accredited university.</li></ul><p><strong><em>Note to Agencies and Recruiters: VividCortex has a strict company policy against engaging with unsolicited contact from agencies or recruiters.  Unsolicited resumes and leads are property of VividCortex and VividCortex explicitly denies that any information sent to VividCortex can be construed as consideration.</em></strong></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>United States</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Mar 16, 2018 10:25:31 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "kFbE6eLQQNGieDKK-WwmZA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16523023",
    "title": "Square: Developer Platform, San Francisco + Seattle + NYC + Remote. Full Time. ONSITE + REMOTE. VISA sponsorship.",
    "content": "<div>                  <span>Square: Developer Platform, San Francisco + Seattle + NYC + Remote. Full Time. ONSITE + REMOTE. VISA sponsorship.<p>This is our team: Developer Platform. We are hiring! <a href='https://www.squareup.com/developers' rel='nofollow'>https://www.squareup.com/developers</a></p><p>Here are all the open positions: <a href='https://careers.smartrecruiters.com/Square/dev-platform' rel='nofollow'>https://careers.smartrecruiters.com/Square/dev-platform</a></p><p>Fullstack Engineers - we use mostly Go, Ruby, and JS and create the platform that makes Square a Platform, we also own several products, and are releasing many new primitives for devs to build businesses on top of Square</p><p>Frontend Engineers - owning eCommerce API for websites to accept payments (and do card on file) without PCI effort, dev experience, dev portal, and new not-yet-released products!</p><p>Android and iOS Engineers - opening up Square's Hardware, so anyone can build their own Point of Sale, plus new not-yet-released products!</p><p>Technical Writer for the platform - be the voice and create an industry leading dev experience</p><p>Also hiring for Product Analyst, Technical Program Manager, Product Manager, SDKs and Examples team (in Seattle).</p><p>Note we are considering remote candidates only for the Technical Writer role.</p><p>Interview process is a phone screen or two, then onsite, then offer.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 5, 2018 8:18:09 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go",
      "mobile"
    ]
  },
  {
    "id": "g3LXYrhiTGCwDOXdCSGpvA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16496754",
    "title": "Seed (YC W15) | Backend Engineers | Full Time | REMOTE (US Only) | https://seed.co/",
    "content": "<div>                  <span>Seed (YC W15) | Backend Engineers | Full Time | REMOTE (US Only) | <a href='https://seed.co/' rel='nofollow'>https://seed.co/</a><p>We’re taking on the challenge of modernizing small business banking. We build beautiful, easy-to-use tools for banking, invoicing, expense tracking, and more, so our members can focus on helping their businesses thrive. Those tools also need to integrate smoothly with often-antiquated banking systems, and be bank-level secure. It’s a huge challenge, but one we enjoy tackling every day. Our customers love us, and we're just getting started.</p><p>As part of the Backend Engineering team you'd be building the core of platform, with no shortage of tough problems.</p><p>Tech Stack: Golang, Docker, AWS, Terraform &amp; Packer for Ops.</p><p>We are a fully remote team and constantly use Slack/Zoom/Github to keep in touch.</p><p>Process:</p><p>Phone intro, phone screen, technical interview with the team (either onsite in Portland/San Fran or remote), decision. We strive to complete this process within 2 weeks if a candidates schedule permits.</p><p>Apply: <a href='https://seed.co/jobs/' rel='nofollow'>https://seed.co/jobs/</a></p><p>Feel free to reach out to me at benji at seed.co if you have any questions.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 11:58:07 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "ZdekLb-JRQ--MckGqngLoQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16495116",
    "title": "Kentik | Software Engineer | San Francisco | Onsite/Remote | Full-Time | kentik.com",
    "content": "<div>                  <span>Kentik | Software Engineer | San Francisco | Onsite/Remote | Full-Time | kentik.com<p>Kentik is a database company masquerading as a network BI tool: <a href='https://www.kentik.com/inside-the-kentik-data-engine-part-1' rel='nofollow'>https://www.kentik.com/inside-the-kentik-data-engine-part-1</a>. We wrote a custom database in go, which at its heart works by taking a time range, storing all events by time-slice and then at query time querying each time segment in parallel. This is hidden behind a Postgres front end using the foreign data wrapper interface PG provides. Then we tried to sell this product and quickly realized that we need a data-visualization layer.</p><p>We're hiring someone primarily to work on our network anomaly detection product -- <a href='https://www.kentik.com/ddos-detection/' rel='nofollow'>https://www.kentik.com/ddos-detection/</a>. This would be kinda a split role, working in a React framework on the client side, node, and then a go codebase which processes traffic data, checks if there's anything to alert on, and then if so does some set of actions.</p><p><a href='https://www.kentik.com/careers' rel='nofollow'>https://www.kentik.com/careers</a> if you are interested.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 9:12:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go"
    ]
  },
  {
    "id": "lqBzkOdNT9CMSznMT6sAOA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16493838",
    "title": "Loom Network | Go Backend Developer - Blockchain | Bangkok | Remote | https://loomx.io",
    "content": "<div>                  <span>Loom Network | Go Backend Developer - Blockchain  | Bangkok | Remote | <a href='https://loomx.io' rel='nofollow'>https://loomx.io</a><p>Loom Network (TechStars Winter '18) makers of Cryptozombies <a href='https://cryptozombies.io' rel='nofollow'>https://cryptozombies.io</a> is looking for Senior backend Go developers. We are building blockchain infrastructure software in Go. This is high performance distributed programming, knowledge of things like Raft, Consensus or Blockchain tech is ideal. Any experience with Solidity is a bonus.</p><p>We don't write white papers we ship products. Join a team thats spread out across the world, with offices in Bangkok, Pune and soon to be Osaka.</p><p>Loom Network builds core blockchain technology that allows other companies to build games, or social apps on the blockchain.</p><p>Send your GitHub and Resume to hiring@loomx.io<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 7:10:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "2961tP4tSD2-uFBcdJWhYQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30360?r=rss2",
    "title": "X-Team: Java Developer",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><h2>About X-Team</h2><p>“Motivated developers, ready to join your team.”</p><p>X-Team is an international company founded in Melbourne, Australia that helps companies scale their development teams by providing them with extraordinary developers from around the world.</p><p>We are 100% remote and believe in building a world where developers can have access to an environment of growth and incredible opportunities regardless of where they live. Our culture is based around the proactive, selfless values that make up every X-Teamer.</p><p>We are a community of people dedicated to unleashing our potential every day. Learn more about how we can help you learn and grow at https://x-team.com/unleash/</p><p>&nbsp;</p><h2>About You:</h2><p>The right individual will be self-driven. Someone who cares about maintainability of the code, automation, deployment processes and how to enable innovation through fostering a growing culture of Open Source. You will go beyond just coding and help to shape the engineering culture and best practices.</p><p>&nbsp;</p><h2>Most important:</h2><p>- Strong knowledge of Java Back End development</p><p>- Experience with RESTful web services</p><p>- Experience with integration patterns</p><p>- Experience with relational and graph databases</p><p>- Experience storing and indexing data</p><p>- Code optimization and performance improvements</p><p>- Write well designed, testable, efficient code</p><p>- A passion and curiosity for creating and building things</p><p>&nbsp;</p><h2>Nice to have:</h2><p>- Experience with working remotely</p><p>&nbsp;</p><h2>Personal:</h2><p>- Independent, self-motivated</p><p>- Fluent in English, written and spoken</p><p>- Proven track record of always learning and growing.</p><p>- Proactive attitude</p><p>- Possess a spirit of generosity</p><p>&nbsp;</p><h2>Perks:</h2><p>- Get the chance to work with big brands like Riot Games, Fox Broadcasting, Kaplan Inc., etc.</p><p>- Live and work in one of our roaming hacker houses (X-Outposts) around the world. http://x-outpost.com</p><p>- Work from anywhere as part of a community of digital nomads.</p><p>- Join our vibrant community, filled with opportunities to learn new skills together in study groups, join clubs (photography, gaming, etc.) and get free camera equipment/games/conferences/courses/massages/etc., charitable fundraisers, fitness &amp; yoga programs (+gym membership), etc. This is the community to be in if you're a remote developer.</p><p>- We’ll provide up to $2,500 in funding for your learning and growth through our Unleash program, which provides opportunities to unleash your potential through initiatives that help you grow as a developer and explore your passions more each day. (http://x-team.com/unleash)</p><p>&nbsp;</p><h2>FAQ:</h2><p>Who is X-Team meant for?</p><p>- Any freelance developers with experience working on high-scale, remote teams and projects with a motivated, proactive attitude and compassionate, team-player heart. If you've worked with freelancing platforms before, that's not what we are. X-Team is a community of all likeminded people, carefully chosen to ensure we are able to create an environment of the most motivated people in the world who come together to unleash their potential. What we've created is truly special and not a faceless platform. X-Team is where developers go to feel truly at home together, while becoming more motivated than they've ever been.</p><p>&nbsp;</p><p>What are you hiring for right now?</p><p>- We are hiring for Java developers to fill some exciting new opportunities we have. We're also hiring for a variety of other skills, such as PHP, React, React Native, Cryptocurrency/blockchain, Node.js, Salesforce, DevOps, and Golang.</p><p>&nbsp;</p><p>Will I get a job immediately after applying?</p><p>- If your skills, experience and values align with a current opening we have, your chances of getting hired immediately are high. If we discover you're qualified but all opportunities have been taken, we'll continue to work with you to help you get a role in X-Team. The key is having the most relevant, in-demand skills when you apply.</p><p>&nbsp;</p><p>What kind of opportunities do you provide?</p><p>- We provide full-time opportunities that last, on average, for 10 months. After your role ends (and so long as you've performed well), we continue to give you work internally with us until we find you a new opportunity. This ensures that X-Team can be a stable work option for you as a freelancer.</p><p>&nbsp;</p><p></p><p><strong>Job Perks:</strong> Visit http://x-team.com/join to learn more.</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Feb 28, 2018 4:14:44 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TECH1/java",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go",
      "java"
    ]
  },
  {
    "id": "ngItLibHTXy2alpP8bP7aQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4171-salesforce-engineer-simple",
    "title": "Salesforce Engineer @ Simple",
    "content": "<h2>              Salesforce Engineer<small> @ Simple</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-26 19:21</p></dd>          <dt><span>Description</span></dt>          <dd><h5>The Company</h5><p>We’re a tech company that’s changing how people bank and think about their finances. We value empathy, curiosity, craft and efficacy. Our mission is to help people feel confident with their money. We do that by bringing humanity, elegance and ease to the consumer banking experience. And we make banking beautiful.</p><h5>The Job</h5><p>You'll work with various groups within Simple, including Customer Operations and individual product engineering teams, as well as our external Salesforce engineering partner.</p><h5>The Team</h5><p>The Salesforce development team is a new group within Simple’s Engineering organization.  It will be a small team that is responsible for working with product engineering teams, as they create amazing new customer-facing features, to build out Salesforce-specific components that support these new features in our internal customer service application.  This team will also be responsible for Salesforce administrative duties in support of the changing needs of the Customer Operations teams, as well as the ongoing maintenance of the Salesforce app.</p><p>You'll work with various groups within Simple, including Customer Operations and individual product engineering teams, as well as our external Salesforce engineering partner.</p><p>While Simple is based in Portland, Oregon, most of our engineering team works remotely, which means both local and remote candidates will be considered.</p><h5>About You</h5><p>You value open, active collaboration and work well with others, helping teammates who need it, and asking for the help, in turn, when you need it. You’re excited to pick up new skills, techniques, and technologies, and love to share what you’ve learned. You enjoy solving difficult problems such as occur in distributed systems, care about metrics, monitoring, and testing. You’re excited about working closely with people across the organization, from your direct teammates to members of ops, and customer service. You want to be a part of building something beautiful and meaningful, even if user interface isn’t your specialty. You respond well to change, and can navigate the ambiguity and fluidity of shifting customer needs.</p><h5>What You’ll Do All Day</h5><p>You will be a member of a team of Salesforce Engineers, doing project-based work, as well as supporting existing custom Salesforce deployments.  You'll implement, debug, deploy and support features for a custom Salesforce application. You will be writing code using Salesforce custom development technologies, like Apex and Lightning, as well as some Javascript.  Simple is built on a REST-based service oriented architecture, so the majority of the interaction between Salesforce and Simple will be via our API endpoints.</p><ul><li>You’ll develop custom Salesforce screens and workflows using Apex triggers &amp; classes, Javascript, Lightning Components, etc.</li><li>Support and maintain existing custom Salesforce application, which includes working with QA and Customer Operations to troubleshoot issues and fix bugs</li><li>Partner with engineering teams to agree on strategies and mechanics for integrating with Simple’s backend system</li><li>Work in close alignment with Salesforce Administrator, and can perform various administrative tasks when required, such as workflow configuration and external object modification</li></ul><h5>We’d Like To See</h5><ul><li>2+ years of professional experience developing Salesforce applications, using Apex, Visualforce pages and Lightning Components</li><li>Salesforce certification, with one or more of the following:<ul><li>Platform Developer I or II</li><li>Platform App Builder</li><li>Service Cloud Consultant</li></ul></li><li>Hands on experience with:<ul><li>RESTful web services/JSON, SF External Objects, SF Service Cloud, SF Communities</li></ul></li><li>Bachelor's Degree or equivalent professional experience</li></ul><h5>Details</h5><p>We recognize the dire lack of diversity in our industry, and we’re not okay with it. We actively seek to address it with our hiring and retention processes, as well as our office culture. If you’re on the fence about whether you’re a fit, we say go for it, and apply!</p><h5>Why Simple’s a Great Place to Work</h5><ul><li>Based in Portland, Oregon-- a beautiful place to live and work (or just see in the background if you work remotely).</li><li>Competitive salary and benefits package.</li><li>A supportive and nurturing place to work. We actively consider how we can improve employees’ quality of life--both inside and outside the office.</li><li>Committed to hiring quality human beings. Simple is a place where others will watch out for you and help you learn. We actually like and respect each other.</li><li>We give a damn about what we do, both as individual contributors and as a company on a mission to change banking. We’re passionate and nerdy about our work; in fact we’re kind of that way about things outside of work, too.</li></ul><p>In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. Email our team at <a href='mailto:careers@simple.com' rel='nofollow'>careers@simple.com</a> if you need an accommodation in the application process.</p><p>A background check will be required for this opportunity.</p><p>Simple provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, or genetics. In addition to federal law requirements, Simple complies with all applicable state and local laws governing nondiscrimination in employment in every location in which the company has employees. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</p><p>By submitting this application, you certify that the facts contained in your application are true and complete to the best of your knowledge. If you are employed, false statements on your application will be grounds for termination.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>United States</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 9:21:18 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TECH1/nodejs",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go",
      "nodejs"
    ]
  },
  {
    "id": "NtqXHmTlSeGLf13eEPftsg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/invision-sr-software-engineer-api-studio",
    "title": "InVision : Sr. Software Engineer, API (Studio)",
    "content": "<div>  <div>    <h2>Sr. Software Engineer, API (Studio)</h2>      <h4>Posted Feb 26</h4>    <h3>      <span>InVision </span><br>      <span>Headquarters: Remote </span><br>        <a href='https://boards.greenhouse.io/invision/jobs/626854#.WpRIkRPwb-Y' rel='nofollow'>https://boards.greenhouse.io/invision/jobs/626854#.WpRIkRPwb-Y</a>      <br>      <a rel='nofollow'>View all InVision  jobs →</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>InVision is the Digital Product Design platform used to make the world’s best customer experiences. We provide design tools and educational resources for teams to navigate every stage of the product design process, from ideation to development. &nbsp;&nbsp;</span></div><div><br></div><div><span>Today, more than 3.5 million people use InVision to create a repeatable and streamlined design workflow; rapidly design and prototype products before writing code, and collaborate across their entire organization. That includes more than 80 percent of the Fortune 100, and organizations like Airbnb, Amazon, HBO, Netflix, Slack, Starbucks and Uber, who are now able to design better products, faster.</span></div><div><br></div><div><span>InVision is a fully distributed company with employees in 25 countries around the world. The company has raised more than $235 million in funding from leading investors including Accel, ICONIQ, FirstMark, Tiger Global, Battery Ventures, and Spark Capital. Visit us at</span><a href='https://www.invisionapp.com/' rel='nofollow'><span> InVisionApp.com</span></a><span> and</span><a href='https://www.invisionapp.com/blog' rel='nofollow'><span>InVisionApp.com/blog</span></a><span>.</span></div><div><br></div><div><span>You are someone who loves building software that people love using. You want to make things that excite people, and add joy to their lives. You want to work with a team to accomplish something bigger than you could on your own. You will be joining a team that values getting things done, helping others get things done, and building towards an amazing future.</span></div><div><br></div><div><span>Our customers are designers and engineers who care about details. They expect more from their tools than just a set of features. Our job is to remove every bit of friction that holds back their creativity and productivity.</span></div><div><br></div><div><span>You like to go really deep because you love to unravel things, both to understand how they work and to use them beyond what others thought was possible. You love both new and interesting things but also things that are proven to work because you’ve been burned by the new and shiny before. You aren’t afraid to tackle any problem head on with the support of talented people to help. You enable people to do their best and achieve things together they never thought possible. Because you care. Because you genuinely want to deliver something that people love.</span></div><div><br></div><div><span>You would be a great fit if you:</span></div><div><br></div><ul><li><span>Have designed and built a production API.</span><br><br></li><li><span>Care about your craft, and releasing quality reliable software.</span><br><br></li><li><span>Have supported your software in production.</span><br><br></li><li><span>Care deeply about the team you work with on a daily basis and want everyone around you happy, healthy, and doing their best work. You look for opportunities to grow and mentor those around you and actually care about making them better.</span><br></li></ul><div><br></div><div><span>You are interested in working somewhere you can:</span></div><div><br></div><ul><li><span>Build tools to make tools and help others make amazing things.</span><br><br></li><li><span>Advance the state of the art of design and prototyping.</span><br><br></li><li><span>Work on products used by a discerning and enthusiastic user base.</span><br><br></li><li><span>Take ownership of your work, because you care greatly about how your work impacts users and customers.</span><br><br></li><li><span>Grow as an engineer by solving hard problems with a talented and supportive team.</span><br><br></li><li><span>Be a part of an organization that is remote first at its core. An organization that proves you can build an industry shifting, sustainable, business while also being 100% remote.</span><br></li></ul><div><br></div><div><span>We are actively building a diverse team and value your experience. If that sounds like you, we want you here. &nbsp;We need you here. We have ambitious goals for products that we think will genuinely make a difference for our customers. You’ll help us achieve those goals.</span></div><div><br></div><div><span> </span></div><div><br></div><div><span>Please submit a cover letter that tells us why this sounds like you along with your resume.</span></div><div><br></div><div><span>Benefits:</span></div><div><br></div><div><span> </span></div><div><br></div><div><span>InVision offers an incredibly unique work environment. The company employs a diverse team all over the world. In the United States we have team members throughout 40+ states including New York, San Francisco, Austin, Portland, and Boston. Each InVision team member is given the freedom and tools to do their best work from wherever they choose. The benefits we offer in the United States include competitive health plans and a 401k plan.</span></div><div><br></div><div><span> </span></div><div><br></div><div><span>Some InVision-wide benefits offered to all employees across the globe include a flexible vacation policy, monthly coffee shop stipends, annual allowances for books related to your profession, and home office setup &amp; wellness reimbursements. InVision is an international employer so some benefit offerings will vary from country to country. Please ask our recruiting team about the benefits and perks package available in your country.</span></div><div><br></div><div><span> </span></div><div><br></div><div><em>InVision is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.</em></div><div><br></div><div><em><br></em></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://boards.greenhouse.io/invision/jobs/626854#.WpRIkRPwb-Y' rel='nofollow'>https://boards.greenhouse.io/invision/jobs/626854#.WpRIkRPwb-Y</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 8:14:01 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "bYkCjz5YT82CW8jrTcQkzg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/169077/senior-software-engineer-api-studio-invisionapp?a=UHB1WtMdNCg",
    "title": "Senior Software Engineer, API (Studio) at InVisionApp  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Collaboration Tools, Computer Software, Design</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>InVision is the Digital Product Design platform used to make the world’s best customer experiences. We provide design tools and educational resources for teams to navigate &nbsp;every stage of the product design process, from ideation to development. &nbsp;&nbsp;</p><p>Today, more than 3.5 million people use InVision to create a repeatable and streamlined design workflow; rapidly design and prototype products before writing code, and collaborate across their entire organization. That includes more than 80 percent of the Fortune 100, and organizations like Airbnb, Amazon, HBO, Netflix, Slack, Starbucks and Uber, who are now able to design better products, faster.</p><p>InVision is a fully distributed company with employees in 25 countries around the world. The company has raised more than $235 million in funding from leading investors including Accel, ICONIQ, FirstMark, Tiger Global, Battery Ventures, and Spark Capital. Visit us at<a href='https://www.invisionapp.com/' rel='nofollow'>&nbsp;InVisionApp.com</a>and<a href='https://www.invisionapp.com/blog' rel='nofollow'>InVisionApp.com/blog</a>.</p><p>You are someone who loves building software that people love using. &nbsp;You want to make things that excite people, and add joy to their lives. &nbsp;You want to work with a team to accomplish something bigger than you could on your own. &nbsp;You will be joining a team that values getting things done, helping others get things done, and building towards an amazing future.</p><p>Our customers are designers and engineers who care about details. They expect more from their tools than just a set of features. Our job is to remove every bit of friction that holds back their creativity and productivity.</p><p>You like to go really deep because you love to unravel things, both to understand how they work and to use them beyond what others thought was possible. &nbsp;You love both new and interesting things but also things that are proven to work because you’ve been burned by the new and shiny before. &nbsp;You aren’t afraid to tackle any problem head on with the support of talented people to help. &nbsp;You enable people to do their best and achieve things together they never thought possible. &nbsp;Because you care. Because you genuinely want to deliver something that people love.</p><p><strong>You would be a great fit if you:</strong></p><ul><li>Care about your craft, and releasing quality reliable software.</li><li>Have designed and built a production API.</li><li>Have supported your software in production.</li><li>Care deeply about the team you work with on a daily basis and want everyone around you happy, healthy, and doing their best work. &nbsp;You look for opportunities to grow and mentor those around you and actually care about making them better.</li></ul><p><strong>You are interested in working somewhere you can:</strong></p><ul><li>Build tools to make tools and help others make amazing things.</li><li>Advance the state of the art of design and prototyping.</li><li>Work on products used by a discerning and enthusiastic user base.</li><li>Take ownership of your work, because you care greatly about how your work impacts users and customers.</li><li>Grow as an engineer by solving hard problems with a talented and supportive team.</li><li>Be a part of an organization that is remote first at its core. &nbsp;An organization that proves you can build an industry shifting, sustainable, business while also being 100% remote.</li></ul><p>We are actively building a diverse team and value your experience. If that sounds like you, we want you here. &nbsp;We need you here. &nbsp;We have ambitious goals for products that we think will genuinely make a difference for our customers. &nbsp;You’ll help us achieve those goals.</p><p>Please submit a cover letter that tells us why this sounds like you along with your resume.</p><p><strong>Benefits:</strong></p><p>InVision offers an incredibly unique work environment. The company employs a diverse team all over the world. In the United States we have team members throughout 40+ states including New York, San Francisco, Austin, Portland, and Boston. Each InVision team member is given the freedom and tools to do their best work from wherever they choose. The benefits we offer in the United States include competitive health plans and a 401k plan.</p><p>Some InVision-wide benefits offered to all employees across the globe include a flexible vacation policy, monthly coffee shop stipends, annual allowances for books related to your profession, and home office setup &amp; wellness reimbursements. InVision is an international employer so some benefit offerings will vary from country to country. &nbsp;Please ask our recruiting team about the benefits and perks package available in your country.</p><p><em>InVision is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.</em></p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Premium Medical, Dental, Vision                            </div>                            <div>                                 Flexible time off policy                            </div>                            <div>                                 Remote, work from home                            </div>                            <div>                                 Gym memebership                            </div>                            <div>                                 unlimited Starbucks                            </div>                            <div>                                 unlimited Amazon books                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 23, 2018 10:10:12 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "sUfq2DRyQcyzl3GkVBWOeQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4153-software-engineer-frontend-go-cycloid",
    "title": "Software Engineer Frontend / Go @ Cycloid",
    "content": "<h2>              Software Engineer Frontend / Go<small> @ Cycloid</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-21 04:11</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>ABOUT US</strong></p><p>We cherish empowerment of our collaborators, so as a company we provide a working environment that allows each and everyone to contribute in their best way.</p><p>Our purpose: we want to simplify DevOps and Cloud adoption, empower people (dev, ops, project manager, CTO) to focus on what matters.</p><p>Our goal is to simplify the work of people who have some unbelievable challenges ahead.</p><p>Cycloid team works on three connected activities:</p><ul><li>we develop cycloid.io: a DevOps platform which integrates a service catalogue, a continuous integration, continuous delivery container pipeline, logs centralisation and tracking price.</li><li>we provide services on AWS as your DevOps team: Design / Audit / Build / Migrate / Managed Services / DevOps As A Service</li><li>we co-develop Cloud-ready application on GO / Vuejs with our customers.</li></ul><p>We are splitting the work between people who have the same skills because to break the monotony, share the knowledge and avoid that we get bored when we have to work on non-fancy things.</p><p>We develop and test our code, we don’t have people dedicated to writing tests, we believe that the same people who implement features, fix bugs, etc, must implement the tests. We do code reviews, we don’t merge into mainstream any substantial code without being reviewed and approved.</p><p>For all the above reasons we are a teal organization. What does it mean?</p><p>Everyone at Cycloid meets once every quarter at our headquarter in France to define collectively the strategy/road map/features for the coming quarter. Then, everyone defines their own agenda and priorities that to achieve his own goal.</p><p>We are fully transparent on revenues, salaries and believe that everybody should have the same variable plan.</p><p>We have signed millions since our creation in April 2015, we are 100% self-funded and have neither external investors nor bank credits.</p><p>We take the time that we need to build useful products and provide great services.</p><h5>SKILLS</h5><p>You are a passionate software engineer, which is the most important, with several years of experience crafting software, would be better, and with:</p><ul><li>at least one year of experience in web frontend development and with a good understanding of the architecture of the web applications, Javascript and DOM API. Our current development is with VueJS, but we believe that if you understand the web and you have experience developing web applications, you should be able familiar with it without any problem in a few weeks.</li><li>broad experience in back-end development and HTTP APIs. Preferably, you have some experience with Go or it doesn't look weird to you, knowledge of distributed systems and simplicity and familiar with the UNIX philosophy.</li></ul><p>We are splitting the work 50% Frontend 50% Backend to break the monotony.</p><p>But what is really important is that we are looking for more than just a developer.</p><p>We are looking for a person who can build with us new features, can bring some new ideas on what could be a great DevOps dashboard/pipeline to simplify the work of users. If you don't have any ideas, it will be a challenge because we don't have a product manager and we are trying to work without it due to our culture. We want to empower people.</p><p>You are, of course, a team player and know how to work in remote even if you can work at Cycloid office in Paris if you are in Paris. You can decide to work on remote wherever you are located but all the organization is in an asynchronous manner, keeping a good team culture through Slack and conference meetings.</p><p>You have adequate written and oral communication skills in English, any others languages would be a plus.</p><p><em>Cycloid is committed to having equality between women and men. In that way, we strongly encourage women's application.</em></p><p><strong>What do we expect that you send to us?</strong></p><p>Your CV or a LinkedIn profile or a personal website where we can know more about your professional experience. If you have relevant public open source contributions, then you have a huge plus; your contributions to open source projects, created by you or by others, are very important for us, however because you may have quite a few contributions, send us a selection of them, linking the repositories of the projects, the relevant issues and pull/merge requests that you have contributed implementing, reporting, commenting and/or reviewing.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Remote in EMEA</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 21, 2018 6:11:20 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go"
    ]
  },
  {
    "id": "ro6KtMe8S5uU1dhutsQFaw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16339417",
    "title": "Horizon State | Melbourne AU, Wellington NZ | Full time/Contract | Onsite & Remote.",
    "content": "<div>                  <span>Horizon State | Melbourne AU, Wellington NZ | Full time/Contract | Onsite &amp; Remote.<p>Redesigning democracy on the Blockchain.</p><p>We want engineers who have a broad set of skills, because you’ll need to be comfortable performing in different areas. You may be coding in the morning, testing someone else’s code before lunch, designing a screen in the afternoon and jumping on a conference call with a customer in the early evening.</p><p>We don’t mind what technologies you develop with. We’re not just looking for Java, C#, JS, Solidity, Golang or any other specific language. If you don’t use anything in our stack but make a good case and seem like a great fit—we’ll still consider you.</p><p>Apply: instantregret@horizonstate.com</p><p>Details: <a href='https://medium.com/horizonstate/horizon-state-is-hiring-d0a81b22ff7' rel='nofollow'>https://medium.com/horizonstate/horizon-state-is-hiring-d0a8...</a></p><p>Company: <a href='https://horizonstate.com' rel='nofollow'>https://horizonstate.com</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 9, 2018 2:00:07 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "jFCHb9e-T22ARFutkHMN7w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16339506",
    "title": "Horizon State | Melbourne AU, Wellington NZ | Full time/Contract | Onsite & Remote.",
    "content": "<div>                  <span>Horizon State | Melbourne AU, Wellington NZ | Full time/Contract | Onsite &amp; Remote.<p>Redesigning democracy on the Blockchain.</p><p>We want engineers who have a broad set of skills, because you’ll need to be comfortable performing in different areas. You may be coding in the morning, testing someone else’s code before lunch, designing a screen in the afternoon and jumping on a conference call with a customer in the early evening.</p><p>We don’t mind what technologies you develop with. We’re not just looking for Java, C#, JS, Solidity, Golang or any other specific language. If you don’t use anything in our stack but make a good case and seem like a great fit—we’ll still consider you.</p><p>Apply: instantregret@horizonstate.com</p><p>Details: <a href='https://medium.com/horizonstate/horizon-state-is-hiring-d0a81b22ff7' rel='nofollow'>https://medium.com/horizonstate/horizon-state-is-hiring-d0a8...</a></p><p>Company: <a href='https://horizonstate.com' rel='nofollow'>https://horizonstate.com</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 9, 2018 2:00:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "DFSG_Y0QRlGpQREiYgB-SQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/footprintlabs/jobs/104145-backend-engineer-go-golang",
    "title": "Backend Engineer - Go (Golang)",
    "content": "<div><h2>Backend Engineer - Go (Golang) at Footprint</h2><div>San Francisco, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Go (Golang), Go</div><div>Compensation</div><div>$100K–$175K<br>0.25%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Footprint is transforming communication between corporations and their network of stores, branches, and franchise affiliates. </p><p>Between a corporation and its customer communities, too. </p><p>WHO WE ARE<br>We're an early stage product team with expertise in mobile, web, and APIs. </p><p>We're building the Footprint core app and our API across all platforms, all devices. </p><p>Our technology stack is mainly based on Go (Golang) on the backend and Javascript and React on the frontend. </p><p>We have a opportunities for skilled and entrepreneurial engineers who believe the same thing we do: By pushing communication to the edges, real-time messaging will become the OS for the enterprise; apps and chat bots will integrate natively inside; search will bring all data and communications into a single place--available everywhere. </p><p>OUR ENGINEERING ENVIRONMENT<br>We're a distributed bunch relying on a design and API-first approach to product development. We ship software all throughout the day and all around the world.  Our team sizes are kept small. Each individual engineer owns their QA, code quality, and deployments. We ship through a CI/CD mainline. </p><p>WHO YOU ARE<br>- A Senior Developer ready to design and implement awesome new features through innovation and data-driven iterations<br>- Someone who wants to push limits of product innovation using the latest advancements in technology and methods - working closely with product managers, designers and other engineering teams<br>- Someone that works best in an environment with a sense of urgency and can rapidly iterate on product/platform features<br>- Someone who can work in a distributed, continuous integration environment</p><p>QUALIFICATIONS<br>- Strong algorithms, data structures and coding background<br>- Disciplined approach to testing and quality assurance<br>- Experience with web infrastructure and distributed systems<br>- Experience with software engineering best practices (e.g. unit testing, code reviews, design documentation)</p><p>TO APPLY<br>Write a quick cover letter</p></div>",
    "urlFetchPending": false,
    "published": "Feb 8, 2018 12:57:56 AM",
    "tags": [
      "Backend Developer",
      "Full Time",
      "Go",
      "Go (Golang)",
      "REMOTE1/100",
      "Remote OK",
      "San Francisco",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "fcT1EqzcQWK-h790965U6Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/152168/go-developer-spideroak?a=P20ErrTYCis",
    "title": "Go developer at SpiderOak (Kansas City, MO)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Security Software, Secure Messaging, Secure Back Up</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>About the team</strong></p><p>We are working hard in our 2.0 version of the Semaphor messaging system and platform. The software stack for the backend is PostgreSQL and Go. We are looking to expand our team to help us develop the microservices behind Semaphor.</p><p>We are a small team comprised of talented polyglot developers that have chosen Go as their main tool for the past several years to bring Semaphor to life.</p><p><strong>Responsibilities</strong></p><ul><li>Implement already written specifications for distributed services in Go.</li><li>Design and specify new services. We have a lot of work already architected, but there's still a lot to go in the roadmap.</li><li>Iterate over our current codebase to improve it and fix bugs.</li><li>Take ownership of the tasks assigned, regardless of their scope. Working on bug fixes doesn't entail less ownership than writing a new service from scratch.</li></ul><p><strong>Requirements</strong></p><ul><li>2+ years experience in developing services in Go.</li><li>Familiarity with TDD.</li><li>Experience using Docker.</li></ul><p><strong>Nice to have</strong></p><ul><li>Familiarity with multiplatform development. Our client side Go codebase runs in Windows, macOS, Linux, Android and iOS.</li><li>Experience with Kubernetes.</li><li>Some Python skills, all our integration tests are written in Python.</li><li>Familiarity with development focused on security.</li></ul><p>Still interested? Email us your resume (plain text preferred) to <a href='mailto:jobs@spideroak-inc.com' rel='nofollow'>jobs@spideroak-inc.com</a></p>                    </div>                            <h2>                About SpiderOak            </h2>            <div><p>SpiderOak has been working for the past 10+ years bringing security and privacy to consumers and enterprises. First in the backup area with SpiderOak ONE, and now expanding to group messaging with Semaphor.</p><p>We are a remote friendly company, but if you are local to Kansas City you are always welcome to work from the office. Significant overlap with US Central time zone required. You will be expected to communicate regularly with the rest of your team, working out problems and collaborating in a daily basis to drag projects across the finish line. The ability to take lead on projects falling under your responsibility is paramount. While we do not use a strict Agile methodology, you must be comfortable working closely with the rest of the company to ensure an iterative process. We require a basic working proficiency in the written and spoken English language, and the ability to travel to the United States 1-4 times a year for team meet-ups.</p><p>Much as we believe in internet privacy for all, we do not discriminate in who we choose to be part of our team. We know no boundaries based on race, ethnic origin, religion, gender, sexuality, or other terms humans use to separate the 'us' from the 'them'. If you can do the job and communicate readily, we will be happy to work with you.</p><p>We offer a compensation package including paid vacation, holiday, and personal time for all, and US workers enjoy a full benefits package including medical, dental, vision, life, and short and long term disability insurance.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Paid time off and corporate holidays                            </div>                            <div>                                 Full medical, dental, vision                            </div>                            <div>                                 Company provided hardware                            </div>                            <div>                                 Work from anywhere in the world                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "_L_EIZseRimsRw6aaR-PTg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/144595/lead-azure-developer-fugue-inc?a=MuxR43sMZji",
    "title": "Lead Azure Developer at Fugue Inc (Washington, DC)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Computing, DevOps, Security Software</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Job Overview</strong></p><p>The Lead Azure Software Engineer will be the go to SME for the Azure cloud within Fugue. You will be mixing reliable industry standards and techniques with a generous dose of your own creativity to pioneer the new solutions in the Azure space of Fugue. We are looking for highly motivated team members who face challenges head-on and are able to work in an innovative, complex, and dynamic environment.</p>                    </div>                            <h2>                About Fugue Inc            </h2>            <div><p>Fugue is a venture-backed software company developing an infrastructure-level operating system for cloud computing. Initially available on Amazon Web Services (AWS), Fugue builds, optimizes, and enforces cloud infrastructure—continuously and automatically. The company has raised a total of $34MM from investors including New Enterprise Associates, The Maryland Venture Fund, and Core Capital Partners. With offices in Frederick, MD, Washington, DC, New York, and Silicon Valley, Fugue is rapidly expanding its talented, high performing team. We are looking for an accomplished Customer Support Engineer to join us!&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Medical, Dental, and Vision plans - some plans fully company paid                            </div>                            <div>                                 401(k) savings plan                            </div>                            <div>                                 Company paid Life, Short and Long Term Disability                            </div>                            <div>                                 Open PTO - use what you need when you need it                            </div>                            <div>                                 Remote Friendly                            </div>                            <div>                                 Flexible Work Schedule                            </div>                            <div>                                 Free Lunch 3-days per week in offices                            </div>                            <div>                                 You're an adult, so we treat you like one!                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "Q9MtHy-CTHGf4uJK0E69_g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/166783/backend-engineer-driver-experience-heetch?a=TVTHwyWUeQg",
    "title": "Backend Engineer - Driver Experience at Heetch (Paris, France)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Carsharing, Marketplace, Transportation</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><em>*** Heetch offers remote first positions for its Technical team which means you can be based in Paris or anywhere else you want in Europe like 90% of our tech team.</em></p><p><em>&nbsp;We are still a young structure and we are not ready to work with people outside EU for timezone considerations but will keep you posted on that ;)***</em></p><p><strong>DRIVER EXPERIENCE TEAM @HEETCH</strong></p><p>The top priority of our user-driven team is the happiness of our drivers. From the moment they decide to join us until they enter our marketplace, drivers will be using our products. And our mission is to make sure they get the stellar experience they deserve.</p><p>Given our very large business scope(drivers acquisition, retention and well-being), our team is working side by side with frontend, mobile, product and design teams, allowing us to build features that will empower drivers with new ways to drive and earn.</p><p>From the inside, we’re a caring full-stack team of engineers(IOS, Android, Frontend, Backend, QA) who share the same values:</p><p>• <strong>Transparency</strong>: We discuss everything openly.</p><p>• <strong>Team Unity </strong>: No one is left behind.</p><p>• <strong>Move Fast</strong> : No need to demonstrate for day, just do it.</p><p>• <strong>Knowledge Sharing </strong>: Whether it's organizational, cultural or tech, we're eager to learn!</p><p>•<strong> It's OK to fail </strong>: Succeed together, learn together.</p><p>With the many new challenges we’re facing every day, our team is seeking a product aficionado that will help us take our services to the next level. Our ideal candidate is someone who loves building softwares people genuinely love using, have strong problem-solving skills and great empathy for users.</p><p>What Happens Next Will Surprise You ! </p><p><strong>CHALLENGES YOU’LL BE FACING WITH US</strong></p><p>• Design a flexible driver onboarding flow allowing our international team to easily launch new cities.</p><p>• Provide an optimized solution for company executives to manage their fleet.</p><p>• Build tools that significantly improve our communication with our drivers.</p><p><strong>RESPONSIBILITIES</strong></p><p>• Deploy, monitor and maintain your microservices in production.</p><p>• Design well-tested, and scalable software to handle millions of users.</p><p>• Participate in Code Reviews and provide feedback to your colleagues.</p><p>• Leave code better than you found it.</p><p>• Create a positive environment for the people around you.</p><p>• Lead by example.</p><p>• Share knowledge with your team and help them grow.</p><p><strong>REQUIREMENTS</strong></p><p>• Solid experience as a Backend Engineer.</p><p>• Comfortable building softwares in a polyglot environment (Ruby or Elixir).</p><p>• Delivers elegant APIs that are easy to use.</p><p>• Designs performant systems for high throughput workloads.</p><p>• Awareness and understanding of technical constraints.</p><p>• Not afraid of leaving your technical comfort zone.</p><p>• Bonus : Knowledge in Event Driven Design or DDD, CQRS+ES, Golang</p><p><strong>PERKS</strong></p><p>• Stocks.</p><p>• Paid conference attendance/travel.</p><p>• Heetch credits.</p><p>• A Spotify subscription.</p><p>• Medical care.</p><p>• Code retreats and company retreats.</p><p>• Travel budget (visit your remote coworkers and our offices).</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Full remote (in Europe only) and flexible ways of working                            </div>                            <div>                                 Paid conferences attendance/travel                            </div>                            <div>                                 Periodic team meetups                            </div>                            <div>                                 Stocks                            </div>                            <div>                                 Heetch credits                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/gamedev",
      "TECH1/go",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "gamedev",
      "go",
      "mobile"
    ]
  },
  {
    "id": "5T4fy-6NSqygLaaHiHGc_Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156878/backend-engineer-ride-marketplace-golang-heetch?a=QBWAtjecyWc",
    "title": "Backend Engineer - Ride & Marketplace (Golang) at Heetch (Paris, France)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Carsharing, Marketplace, Transportation</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><em>*** Heetch offers remote first positions for its Technical team which means you can be based in Paris or anywhere else you want in Europe like 90% of our tech team.</em></p><p><em>&nbsp;We are still a young structure and we are not ready to work with people outside EU for timezone considerations but will keep you posted on that ;)***</em></p><p><strong><br>RIDE &amp; MARKETPLACE @HEETCH</strong></p><p>The mission of the Ride &amp; Marketplace team is quite simple: <strong>make passengers and drivers meet, and get there where they need to be. </strong></p><p>“Transportation is a serious business”</p><p>— Jason Statham as Frank Martin<br><br></p><p>Our team is responsible for providing the best ride experience, by building both the smoothest ordering experience, and the platform and algorithms responsible for real-time execution and online optimization of Heetch's marketplace across all our markets(matching, dynamic pricing, ETA, heatmaps)</p><p>Our impact on the business and on the experience of both passengers and drivers is unprecedented. Every ride must be reliable, efficient, and affordable, and we're building the algorithms that make that possible by optimizing supply and demand.</p><p>We have high standards and high expectations on our output, we ship fast and we scale our work for all markets.</p><p>To achieve this, we’re all working together amongst Product, Mobile &amp; Backend Devs, Design, Data Analysts &amp; Scientists, and Ops team to successfully target structural next steps, deliver, track and iterate<br><br></p><p><strong>HOW WE WORK</strong></p><p><strong>Mindset</strong></p><p>• Move fast not furious. </p><p>• Don’t be scared of failure, learn from it and try again.</p><p>• Unit and functional tests are as important as code.</p><p>• Code is always evolving we do not think in versions.</p><p>• We’re not just here to push code, product ownerships equally spread amongst the team.<br><br></p><p><strong>Tech Stack</strong></p><p>• Microservices.</p><p>• Docker with Mesos &amp; Marathon.</p><p>• We ship new services on a weekly basis (at least we try to ).</p><p>• Services owned by our teams are written in Go.</p><p>• We follow community guidelines and best practices.</p><p>• Kafka.<br><br></p><p><strong>Team Life</strong></p><p>• <strong>Work wherever you want</strong>: we’ve always been remote first but also have a shiny new office in Paris, London, Stockholm, Milan, Bruxelles and Casablanca.</p><p>• <strong>Open communication</strong>: everything is public within the team.</p><p>• <strong>You are not alone</strong>: we use Slack and video calls every day.</p><p><em>• </em><strong>Continuous improvement</strong>: weekly team retrospective and strong Speak Up value.<br><br></p><p><strong>REQUIREMENTS</strong></p><p>• Experience with microservices in production.</p><p>• +5years as a software engineer.</p><p>• Eager to learn Go.</p><p>• Exposure with real-time problematics.</p><p>• Event driven mindset.<br><br></p><p><strong>Bonus</strong></p><p>• Professional experience in Go.</p><p>• Exposure to Geo related problematics.<br><br></p><p><strong>PERKS</strong></p><p>• Stocks.</p><p>• Paid conference attendance/travel.</p><p>• Heetch credits.</p><p>• A Spotify subscription.</p><p>• Medical care.</p><p>• Code retreats and company retreats.</p><p>• Travel budget (visit your remote coworkers and our offices).</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Full remote (in Europe only) and flexible ways of working                            </div>                            <div>                                 Paid conferences attendance/travel                            </div>                            <div>                                 Periodic team meetups                            </div>                            <div>                                 Stocks                            </div>                            <div>                                 Heetch credits                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "tD_zJqgITA2Zq-txJxaIUg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/166318/go-developer-ems-software?a=TMef5wE7RSg",
    "title": "GO Developer at EMS Software (Centennial, CO)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise Software</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Leveraged by millions of users every day, EMS Software manages some of the highest profile spaces in the world (including the NASDAQ bell). We are consistently delivering new features to our suite of products. We want to tackle bigger challenges and accomplish some truly amazing things. Our team is always improving our codebase and operations footprint and we have amassed a sizeable backlog of interesting challenges and product initiatives. Our team needs to grow to enable even greater success in our industry, and that's where you come in.</p><p><strong>Responsibilities</strong></p><ul><li>As our Middle Tier developer you will be part of a 4-5 person agile development team</li><li>Your team currently develops and maintains our newly introduced middle tier in our pursuit to transform our technology stack into a multi tenant PAAS solution</li><li>You will embrace developing within our CI/CD pipeline and have the opportunity to improve it</li><li>Your code will efficiently process millions of customers bookings both in our own cloud and on premise installations</li><li>You will work with your development lead, the front end team and product management team during the identification, development and implementation of the work involved</li><li>You will work with our Quality Engineering Architect to make sure changes made are safe and assertable</li></ul><p><strong>Required Experience</strong></p><ul><li>1-3 years production Golang experience</li><li>5+ years backend/middle tier development experience</li><li>1+ years unit tests experience</li><li>1+ years of SQL experience</li><li>Experience working within an Agile SDLC process</li><li>Strong interpersonal, written, and oral communication skills</li><li>Technical documentation skills</li><li>Ability to present ideas in user-friendly language</li><li>Self-motivated and directed, with keen attention to detail</li><li>Able to prioritize and execute tasks in a high-pressure environment</li><li>Devops mentality is a PLUS</li></ul>                    </div>                            <h2>                About EMS Software            </h2>            <div><p>EMS Software offers the most comprehensive, cutting-edge platform to enable innovative work and learning environments. We make it easier to connect people with space, resources, and technology – allowing them to collaborate flawlessly, make informed business decisions, and get more out of each day.</p><p><em>EMS Software is proud to be an Equal Opportunity Employer. Applicants are considered for all positions without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, ancestry, marital or veteran status. We are committed to hiring a diverse and talented workforce, supporting integrity in the workplace and an entrepreneurial atmosphere.</em></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Medical, dental and vision plans                            </div>                            <div>                                 Physical fitness reimbursement plan and on-site fitness center                            </div>                            <div>                                 Self-Directed PTO                            </div>                            <div>                                 Flexible work environment and remote work options                            </div>                            <div>                                 Competitive compensation and employer-matched 401(k) savings plan                            </div>                            <div>                                 &quot;Bug hunts,&quot; casual dress code, open floor plan, collaboration spaces                            </div>                            <div>                                 Two blocks from the Arapahoe Village Center RTD Station                            </div>                            <div>                                 Walking distance to numerous bars, restaurants and coffee shops                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "-QK39G_sRc6lSUMvtfzRuQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/194692-lead-software-developer-consensys-enterprise",
    "title": "Lead Software Developer - ConsenSys Enterprise",
    "content": "<div><h2>Lead Software Developer - ConsenSys Enterprise at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$120K–$200K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Apply Here - <a href='https://consensys.net/open-positions/?bzid=32f59ccd09da' rel='nofollow'>https://consensys.net/open-positions/?bzid=32f59ccd09da</a></p><p>Our developers envision a world where decentralized technologies play a pivotal role in transforming society. At ConsenSys Enterprise, we have been delivering blockchain software solutions to major global institutions for the past two years.</p><p>As consultants, we work on-site with our clients to ensure we’re delivering the best possible solution. Our Lead Dev plays an important role in leading these projects to success.</p><p>Curious what makes a developer a Lead within ConsenSys? A lead is:</p><p>Often the day-to-day primary point of contact with our clients</p><p>Able to strategically lead a project team to successful delivery</p><p>Excited to mentor, influence and lead a team of ConsenSys employees as well as engage and advise clients</p><p>An expert in at least one language or domain, and maybe in 2 or more</p><p>Owner of the technical recommendations to the client - both on technology/tool choices as well as architecture</p><p> </p><p>We believe that to flourish in this role, you have the following competencies::</p><p>Technical Skills</p><p>Core blockchain concepts. Blockchain is a new field of technology that is rapidly evolving. If you are not yet fully immersed in the technology, you should be willing to dive deep down the rabbit hole.</p><p>Architecture. You should be comfortable working with your team to craft a design: choosing the appropriate technology and designing a solution that both answers the problem at hand, and stays within constraints.</p><p>Coding. Our Leads never go post-technical.  We think that it’s important for technical leadership to continue to code.  Our clients don’t all work in one language or platform, and neither do we. As a lead, we’re looking for a breadth of experience in multiple languages, and expertise in one or two: Javascript is high on our list. (Other notables: Python, Java, Haskell, Golang) You should also be up to speed on practices like TDD, continuous integration, pairing, and infrastructure automation.</p><p>Understanding and often playing a major part in the entire cycle of software consulting and delivery, from ideation, to project conception, to UX, to code, to testing, to deployment, and around again.  </p><p>Agile. We believe strongly in agile delivery practices, having implemented them for ourselves and our clients to great success. You should be very comfortable working with Agile, Lean and Continuous Delivery practices -- and love it as much as we do.</p><p>Soft Skills</p><p>Mentoring a team and bringing them up to speed on new languages and skills. We all learn from each other, but with the breadth of technical experience you’ll bring to the table, you’ll be an invaluable teacher to your less-experienced peers.</p><p>Thinking big and acting fast. You’ll need a startup mentality with enterprise awareness. That means you can manage competing priorities, that you’re ready to pivot or adjust plans quickly, and that you understand the role you and your team play in major organizations’ tech strategies.</p><p>Influencing priorities, for both the team and the client. You understand both the business problem and the technical solution, and you’re able to advocate for excellence and effect change when necessary.</p><p>Finesse. As consultants, we navigate within our client’s organizations to influence big decision makers and win trust. In this job, you’ll be using your people skills as much as your coding skills. Managing client expectations and ensuring the team meets deadlines is critical.</p><p>And here are some of the perks of being part of a unique organization like ConsenSys:</p><p>The forefront of a revolution. At ConsenSys we fundamentally believe that a next generation of technologies presents the opportunity to create a more just and equitable society. We believe that there is an opportunity to bring the remaining 2 billion unbanked people into the global economy and to radically transform our society for the enrichment of humankind.</p><p>A dynamic startup environment. ConsenSys is a thought leader in the blockchain space and we are absorbing a significant portion of the mindshare. This is both exciting and challenging, as we learn to scale our organization while adhering to the principles of decentralization.</p><p>Continuous learning. You’ll be constantly exposed to new languages, frameworks and ideas from your peers and as you work on different projects -- challenging you to stay at the top of your game.</p><p>Deep technical challenges. This entire ecosystem is less than 10 years old. Ethereum itself is still a toddler. There is much work to be done before these platforms can scale to the order of millions or billions of users. ConsenSys is building the technology platforms that can get us to those next thresholds of scale.</p><p>ConsenSys was just named a Top 100 FinTech company by KPMG's 2016 Fintech Innovators report</p></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:40:39 PM",
    "tags": [
      "Brooklyn",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Software Engineer",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "sBmUU0m7RFKPOgQmT6GR3Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16287679",
    "title": "Circonus | Multiple Positions | Remote, Full-time | https://www.circonus.com/",
    "content": "<div>                  <span>Circonus | Multiple Positions | Remote, Full-time | <a href='https://www.circonus.com/' rel='nofollow'>https://www.circonus.com/</a><p>Circonus is a software company that is changing the way the world monitors both IT infrastructure and the business it powers. Our SaaS and On-­Premise solutions enable companies to combine monitoring, alerting, event processing, and predictive analytics into a unified solution. Visualize any data, in any application, from any system, in real ­time.</p><p>Circonus is seeking to fill multiple roles.</p><p>* Systems Engineer <a href='https://jobs.lever.co/circonus/01f7ba3f-772d-4487-9607-32307188f9c3' rel='nofollow'>https://jobs.lever.co/circonus/01f7ba3f-772d-4487-9607-32307...</a></p><p>* Go (Golang) Senior Software Engineer <a href='https://jobs.lever.co/circonus/e2f69c78-3417-4520-864e-8a272dcec8e9' rel='nofollow'>https://jobs.lever.co/circonus/e2f69c78-3417-4520-864e-8a272...</a></p><p>* Technical Account Manager <a href='https://jobs.lever.co/circonus/5342c10c-ae13-45f6-816f-cfbee20ee252' rel='nofollow'>https://jobs.lever.co/circonus/5342c10c-ae13-45f6-816f-cfbee...</a></p><p>* Visual Designer <a href='https://jobs.lever.co/circonus/beee6767-164b-4ee0-8f13-b1663c85f335' rel='nofollow'>https://jobs.lever.co/circonus/beee6767-164b-4ee0-8f13-b1663...</a></p><p>All of our positions include a discretionary PTO policy, health insurance, gym reimbursement, a generous 401K, the opportunity for a bonus and more.</p><p>Apply directly via <a href='https://jobs.lever.co/circonus' rel='nofollow'>https://jobs.lever.co/circonus</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 4:00:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "mpJvAGP_QnuemrPsOQDKVA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16286009",
    "title": "Square: Developer Platform, San Francisco + Seattle + Remote. Full Time. ONSITE + REMOTE. VISA sponsorship.",
    "content": "<div>                  <span>Square: Developer Platform, San Francisco + Seattle + Remote. Full Time. ONSITE + REMOTE. VISA sponsorship.<p>This is our team: Developer Platform. We are hiring! <a href='https://www.squareup.com/developers' rel='nofollow'>https://www.squareup.com/developers</a></p><p>Here are all the open positions: <a href='https://careers.smartrecruiters.com/Square/dev-platform' rel='nofollow'>https://careers.smartrecruiters.com/Square/dev-platform</a></p><p>Fullstack Engineers - we use mostly Go, Ruby, and JS and create the platform that makes Square a Platform, we also own several products, and are releasing many new primitives for devs to build businesses on top of Square</p><p>Frontend Engineers - owning eCommerce API for websites to accept payments (and do card on file) without PCI effort, dev experience, dev portal, and new not-yet-released products!</p><p>Android Engineers - opening up Square's Hardware, so anyone can build their own Point of Sale, plus new not-yet-released products!</p><p>Technical Writer for the platform - be the voice and create an industry leading dev experience</p><p>Also hiring for Product Analyst, Technical Program Manager, Product Manager, SDKs and Examples team (in Seattle).</p><p>Note we are considering remote candidates only for the Technical Writer role.</p><p>Interview process is a phone screen or two, then onsite, then offer.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 11:20:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/mobile",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go",
      "mobile",
      "ruby"
    ]
  },
  {
    "id": "P6zWbvaBSfa3j6Fmd3_8Ag",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16286013",
    "title": "Kentik | Software Engineer | San Francisco | Onsite/Remote, Full-Time | kentik.com",
    "content": "<div>                  <span>Kentik | Software Engineer | San Francisco | Onsite/Remote, Full-Time | kentik.com<p>Kentik is a database company masquerading as a network BI tool: <a href='https://www.kentik.com/inside-the-kentik-data-engine-part-1' rel='nofollow'>https://www.kentik.com/inside-the-kentik-data-engine-part-1</a>. We wrote a custom database in go, which at its heart works by taking a time range, storing all events by time-slice and then at query time querying each time segment in parallel. This is hidden behind a Postgres front end using the foreign data wrapper interface PG provides. Then we tried to sell this product and quickly realized that we need a data-visualization layer.</p><p>We're hiring someone primarily to work on our network anomaly detection product -- <a href='https://www.kentik.com/ddos-detection/' rel='nofollow'>https://www.kentik.com/ddos-detection/</a>. This would be kinda a split role, working in a React framework on the client side, node, and then a go codebase which processes traffic data, checks if there's anything to alert on, and then if so does some set of actions.</p><p><a href='https://www.kentik.com/careers' rel='nofollow'>https://www.kentik.com/careers</a> if you are interested.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 11:20:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go"
    ]
  },
  {
    "id": "Q38A0jSaRn-8d2IbWK3kgg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16285438",
    "title": "Seed (YC W15) | Backend Engineers | Full Time | REMOTE (US Only) | https://seed.co/",
    "content": "<div>                  <span>Seed (YC W15) | Backend Engineers | Full Time | REMOTE (US Only) | <a href='https://seed.co/' rel='nofollow'>https://seed.co/</a><p>We’re taking on the challenge of modernizing small business banking. We build beautiful, easy-to-use tools for banking, invoicing, expense tracking, and more, so our members can focus on helping their businesses thrive. Those tools also need to integrate smoothly with often-antiquated banking systems, and be bank-level secure. It’s a huge challenge, but one we enjoy tackling every day. Our customers love us, and we're just getting started.</p><p>As part of the Backend Engineering team you'd be building the core of platform, with no shortage of tough problems.</p><p>Tech Stack: Golang, Docker, AWS, Terraform &amp; Packer for Ops.</p><p>We are a fully remote team and constantly use Slack/Zoom/Github to keep in touch.</p><p>Process:</p><p>Phone intro, phone screen, technical interview with the team (either onsite in Portland/San Fran or remote), decision. We strive to complete this process within 2 weeks if a candidates schedule permits.</p><p>Apply: <a href='https://seed.co/jobs/' rel='nofollow'>https://seed.co/jobs/</a></p><p>Feel free to reach out to me at benji at seed.co if you have any questions.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 10:17:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "PI4gJ5fTSUacZVnbHJLKRA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283822",
    "title": "AdRoll | San Francisco | On-site/remote | Full-time If you like developing open-source code, languages such as Python, Go, JS, ...",
    "content": "<div>                  <span>AdRoll | San Francisco | On-site/remote | Full-time<p>If you like developing open-source code, languages such as Python, Go, JS, C, D, Lua, Erlang, AWS, petabytes of data, and distributed low-latency systems, this may be your dream job.</p><p>This time we are particularly interested in finding full stack web developers with good JavaScript experience and experienced developers, tech leads and data scientists with great math knowledge and coding skills. This is a really unique opportunity to get to work with a massive scale (thousands of instances on AWS), low latency (real-time bidding with 100ms max latency and 70B requests daily, real-time machine learning with 1ms max latency), mission-critical systems (this is how we make money) and enjoy working on a strong frontend development team (<a href='http://tech.adroll.com/blog/frontend/2017/08/29/how-to-run-a...' rel='nofollow'>http://tech.adroll.com/blog/frontend/2017/08/29/how-to-run-a...</a>).</p><p>Learn more about us here <a href='http://tech.adroll.com/blog/' rel='nofollow'>http://tech.adroll.com/blog/</a></p><p>I am happy to tell you more over coffee in SF or by email, dialtone@adroll.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:39:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/go",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "go",
      "other"
    ]
  }
]
}
