{
 "items": [
  {
    "id": "_QhnRxTlT9SPC87MfZjHMw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/169225/software-engineer-mediawiki-wikimedia-foundation-inc?a=UKFPg9rx3Rm",
    "title": "Software Engineer (MediaWiki) at Wikimedia Foundation, Inc. (San Francisco, CA) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Education Technology, eLearning, Non-Profit</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div>Location: San Francisco, CA or Remote<p><strong>Summary</strong></p><p>The Wikimedia Foundation is looking for a Software Engineer to join the MediaWiki Platform Team. The MediaWiki Platform Team is responsible for maintenance and development of the MediaWiki core, the platform that powers Wikipedia and other Wikimedia Foundation websites. MediaWiki is a PHP/MySQL web application that has been incrementally developed over the past 15 years to become a richly featured wiki engine, and the basis for hundreds of extensions and skins. MediaWiki is an open source product with a vibrant volunteer community.</p><p>We are looking for a Software Engineer who will work collaboratively with our feature teams to provide great new features to our users. You will also work with SRE and Performance teams to ensure MediaWiki continues to scale and remain highly available for the millions of users who depend on us.</p><p><strong>Description</strong></p><ul><li>Design, develop, test, and deploy new features and improvements to MediaWiki.</li><li>Triage, diagnose, and fix reported bugs in MediaWiki</li><li>Maintain extensions to the PHP engine.</li><li>Partner with Foundation staff and volunteers on software design, development, review, testing and evaluation.</li><li>Help identify and implement best practices in engineering processes across the team.</li><li>Work and communicate effectively within a small team distributed across multiple time zones.</li></ul><p><strong>Requirements</strong></p><ul><li>Relevant Bachelor's degree OR 5 years software development experience</li><li>Proficient in PHP and MySQL</li></ul><p><strong>Pluses</strong></p><ul><li>Substantial code samples which you can show us</li><li>Experience with Linux, memcached, Redis, content distribution networks</li><li>Experience with C/C++ and JavaScript</li><li>Familiarity with web protocols and standards: HTML, CSS, HTTP</li><li>Experience with open source software development</li><li>Experience with MediaWiki or Wikimedia projects</li></ul><p><em>The Wikimedia Foundation is an equal opportunity employer, and we encourage people with a diverse range of backgrounds to apply.</em></p><p><strong>Benefits &amp; Perks *</strong></p><ul><li>Fully paid medical, dental and vision coverage for employees and their eligible families (yes, fully paid premiums!)</li><li>The Wellness Program provides reimbursement for mind, body and soul activities such as fitness memberships, baby sitting, continuing education&nbsp;and much more</li><li>The 401(k) retirement plan offers matched contributions at 4% of annual salary</li><li>Flexible and generous time off - vacation, sick and volunteer days, plus 19 paid holidays - including the last week of the year.</li><li>Family friendly! 100% paid new parent leave for seven weeks plus an additional five weeks for pregnancy, flexible options to phase back in after leave, fully equipped lactation room.</li><li>For those emergency moments - long and short term disability, life insurance (2x salary) and an employee assistance program</li><li>Pre-tax savings plans for health care, child care, elder care, public transportation and parking expenses</li><li>Telecommuting and flexible work schedules available</li><li>Appropriate fuel for thinking and coding (aka, a pantry full of treats) and monthly massages to help staff relax</li><li>Great colleagues - diverse staff and contractors speaking dozens of languages from around the world, fantastic intellectual discourse, mission-driven and intensely passionate people</li></ul><p><em>* for benefits eligible staff, benefits may vary by location</em></p><p><strong>More Information</strong></p><p><a href='https://wikimediafoundation.org' rel='nofollow'>https://wikimediafoundation.org</a></p><p><a href='https://blog.wikimedia.org' rel='nofollow'>https://blog.wikimedia.org</a></p>                    </div>                            <h2>                About Wikimedia Foundation, Inc.            </h2>            <div><p><strong>About the Wikimedia Foundation</strong></p><p>The Wikimedia Foundation is the nonprofit organization that supports Wikipedia, the other Wikimedia free knowledge projects, and our mission of free knowledge for every single person. We help bring new knowledge to people around the world, lower barriers to participation, and make it easier for everyone to share what they know. We do this by keeping the Wikimedia projects fast, secure, and available to all, protecting the values and policies that allow free knowledge projects like Wikipedia to thrive, building new features and tools to make it easy to read, edit, and share from the Wikimedia sites, and by supporting the communities of volunteers who make the projects possible.</p><p>At the Foundation, we build technology to help people everywhere access Wikipedia, across devices and in nearly 300 languages. We engineer privacy for our readers and editors so they can safely and securely explore Wikipedia. We create&nbsp;programs&nbsp;and initiatives to make Wikipedia freely available to more people in more parts of the world. We build&nbsp;new tools&nbsp;for the community of editors so they can continue to improve and grow Wikipedia. Roughly a quarter of our budget goes to supporting the community that make the site possible, including through&nbsp;grantmaking programs&nbsp;that enable volunteers and enrich the information on the sites.</p><p>The Wikimedia Foundation is an equal opportunity employer, and we encourage people with a diverse range of backgrounds to apply.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Fully paid premiums for medical, dental &amp; vision insurance premiums                            </div>                            <div>                                 401(k) with 4% matching contribution                            </div>                            <div>                                 7-12 weeks parental leave with 100% pay + lactation room                            </div>                            <div>                                 Wellness Program ($1800 annual) to promote wellness &amp; personal growth                            </div>                            <div>                                 Pre-tax savings plans for Transportation &amp; Parking                            </div>                            <div>                                 Flexible work schedules and remote working options                            </div>                            <div>                                 Pet Friendly office                            </div>                            <div>                                 Commitment to diversity &amp; inclusion throughout the employee lifecycle                            </div>                            <div>                                 12 days vacation, 19 days holiday, 2 days volunteer work and more!                            </div>                            <div>                                 Lean more at https://wikimediafoundation.org/wiki/Work_with_us                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "php"
    ]
  },
  {
    "id": "3Hk1jD80RquRLI2XBXxq-Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/1159-experienced-php-developer",
    "title": "Experienced PHP Developer",
    "content": "Experienced PHP&nbsp;Developer - Jobmote<div><div><h2>Experienced PHP&nbsp;Developer</h2><h5>Entermotion</h5></div></div><div><div><div><div></div></div><div><div><div><p><strong>About Us</strong><br>Entermotion is a creative design and web development studio. We work on a variety of projects for our clients, from application development to identity design. We also have a few self-released products and are always looking to do more.</p><p>We’re a small but diverse remote team, with people located in seven different cities across three continents.</p><p><strong>What’s the Job?</strong><br>We’re looking for a PHP developer to work on our web apps and websites. Your work would be divided into these focus points:</p><ul><li>Structuring new web app projects from the ground up, working on prototypes, modeling, and APIs</li><li>Adding and maintaining features on our existing web applications</li><li>Occasionally maintaining and working on our simpler website projects</li></ul><p>Our existing projects are built on custom in-house frameworks, so experience with a custom setup is highly regarded.</p><p>We manage products in different SaaS industries, from healthcare to project management.</p><p><strong>Skills</strong><br>The main focus of the job will be backend work, but some frontend skills will be necessary to get work done in our small team set up. Knowing your way around JavaScript and CSS layouts are a must (Bootstrap for the most part, although not exclusively).</p><p>Here’s a set of skills we would like to see in a potential candidate. You don’t need to cross off everything on this list, but the more the better! Please call attention to any additional skills you have that you think would be interesting for our workflow!</p><ul><li>Deep experience with PHP and MySQL (OOP, MVC)</li><li>Experience working on custom frameworks</li><li>DevOps experience</li><li>Experience on 3rd party integrations (AWS, Twilio, Stripe, etc)</li><li>Strong knowledge of HTML5, CSS3, and JavaScript</li><li>Notions of responsive designs</li><li>Experience working in a remote team (or willingness to make the move!)</li><li>If you have other specific skills, we want to hear about them</li></ul><p><strong>Position</strong></p><ul><li>This is a remote position!</li><li>We’re flexible with schedules</li><li>We would like an individual willing to commit 40 hours a week. Contract work would extend a minimum of 6 months assuming competency. Possibly extending to full-time employment with the right candidate.</li></ul><p><strong>How to Apply</strong><br>Apply via Authentic Jobs interface and make sure to include:</p><ul><li>5 bullet points about why you would be a good fit</li><li>Salary expectations</li><li>Links to past work (or notes about it, if you can’t share links)</li></ul><p>We would rather have a quick, short email than a long resume to get going!</p><p><strong>ATTENTION!</strong><br>Individuals ONLY. No recruiters or agencies please.</p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "Mar 19, 2018 6:20:40 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "php"
    ]
  },
  {
    "id": "U5cq7MhbTVOfyf9kJIn7oQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/67183/part-time-developer-wordpressphp-experience-preferrable-at-seo-with-love/",
    "title": "Part-time developer (Wordpress/php experience preferrable)",
    "content": "I am looking for a  long-term partnership with a smart developer! :)<br /><br />I am a digital marketing freelancer and quite often need to implement small dev changes on my clients' websites. Most of my clients are on Wordpress and some are on Shopify, so relevant experience is crucial.<br /><br />The amount of work would vary and you may expect to work around 2 to 10 hours a month. I would always agree the deadlines with you in advance therefore it is all very flexible. <br /><br />If you have any examples of your previous work- please send them across!<br /><br />I am based in Birmingham, but this is a 100% remote position therefore you can be based anywhere else in the world :)<br />",
    "urlFetchPending": false,
    "published": "Mar 17, 2018 3:30:31 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "dtGryS6DR9-1dYP4tfSujQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/bluespark-senior-drupal-engineer",
    "title": "Bluespark: Senior Drupal Engineer",
    "content": "<div>  <div>    <h2>Senior Drupal Engineer</h2>      <h4>Posted Mar 16</h4>    <h3>      <span>Bluespark</span><br>      <span>Headquarters: Raleigh, NC</span><br>        <a href='http://www.bluespark.com' rel='nofollow'>www.bluespark.com</a>      <br>      <a rel='nofollow'>View all Bluespark jobs →</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>Role: Senior Developer or Tech Lead</span><br></div><div><h4><span>Purpose</span></h4></div><div><span>Envisioning project or client success and working with other roles to energize that vision</span></div><div><br></div><div><h4><span>Accountabilities</span></h4></div><ul><li><span>Creating software that our clients and their customers love.</span><br><br></li><li><span>Getting clients to envision the possibilities the Internet holds for their business</span><br><br></li><li><span>Scaling the vision to the budget</span><br><br></li><li><span>Coaching team on methodologies and documentation</span><br><br></li><li><span>Research. Technical Planning.</span><br><br></li><li><span>Contributing to open source projects.</span><br><br></li><li><span>Squashing bugs.</span><br><br></li><li><span>Providing technical insight to strategists and designers in the early stages of the project.</span><br><br></li><li><span>Advising clients and others on technical implementation details of a project.</span><br><br></li><li><span>Interpreting project requirements.</span><br><br></li><li><span>Working with other developers to create project estimates.</span><br><br></li><li><span>Collaborating with developers and other roles.</span><br><br></li></ul><div><h4><span>Competencies</span></h4></div><ul><li><span>Perpetually curious, always learning</span><br><br></li><li><span>Grit</span><br><br></li><li><span>Excellent communication habits</span><br><br></li><li><span>Well-spoken, critical thinker</span><br><br></li><li><span>Opinionated, but open to being wrong</span><br><br></li><li><span>Superior client service skills</span><br><br></li><li><span>Professional and disciplined remote collaboration</span><br><br></li><li><span>An excellent sense of humor</span><br><br></li><li><span>Contributes to open source, with high-quality examples</span><br><br></li><li><span>BONUS: Interested in writing blog posts and books; interest in speaking at conferences</span><br><br></li></ul><div><h4><span>Desired Experience</span></h4></div><ul><li><span>Software design</span><br><br></li><li><span>Drupal site building techniques</span><br><br></li><li><span>Drupal 8 APIs and Plugins system</span><br><br></li><li><span>JavaScript frameworks</span><br><br></li><li><span>HTML</span><br><br></li><li><span>CSS</span><br><br></li><li><span>Front-end frameworks, and api endpoint integrations</span><br><br></li><li><span>iOS and Android application development</span><br><br></li><li><span>Responsive design and development</span><br><br></li><li><span>Solr</span><br><br></li><li><span>MySQL</span><br><br></li><li><span>Site audits</span><br><br></li><li><span>Performance troubleshooting</span><br><br></li><li><span>Remote working</span><br><br></li><li><span>BONUS: PHP OOP / Symfony</span><br></li></ul><div></div><div></div><div><br></div><div><h4><span>Compensation &amp; Benefits</span></h4><br></div><div><span>Health Insurance.</span><span> We cover 100% of your health insurance and 25% of your family insurance.</span></div><div><br></div><div><span>25 Days PTO.</span><span> The time does not transfer from year-to-year because we want you to take ALL of it every year. &nbsp;We believe that happy, well-rested people are the best people to work with.</span></div><div><br></div><div><span>Winter Holiday Shutdown.</span><span> Bluespark completely shuts down the last week of December. It’s the end of the year, we should enjoy ourselves a bit. </span></div><div><br></div><div><span>Sick time as needed</span><span>—does not count against your PTO.</span></div><div><br></div><div><span>Parental Leave.</span><span> 12 weeks of maternity, paternity, and adoption leave for new parents broken up as follows: 8 weeks of 100% paid parental leave within 12 months after the birth of the child. You can extend this period with PTO. The last four weeks are a transition period where you work half-time and are paid 50% of your salary. Eligibility begins after 1 year of employment, limited to once per year.</span></div><div><br></div><div><span>Work from anywhere.</span><span> Travel around the world or work from the comfort of your home. You just need a stable Internet connection.</span></div><div><br></div><div><span>Flexible schedule.</span><span> Our schedules are pretty flexible. Need to run an errand in the middle of the day? Totally cool. We have people who put in their eight hours in a single shot. Others who break it up throughout the day. </span></div><div><br></div><div><span>Reasonable schedules.</span><span> It’s sad that we even need to list this as a benefit. But we don’t expect more than 40 hours of work in a week. We don’t do “crunch times” during projects. </span></div><div><br></div><div><span>Autonomy.</span><span> A big part of working at Bluespark is being part of a community of expert practitioners. People who actually enjoy what they're doing. Because of that, we actively nurture a culture of connected autonomy—that is, you are the expert and we trust your expertise. We have systems, methods, processes, and best practices, but these are there to help you do your job better—not be yoke that hold you back from doing great work. As such, break the rules, go off script—and tell us what you learned and what we, as a company, can do to improve. &nbsp;</span></div><div><br></div><div><span>Salary</span><span> commensurate with location, role, and experience.</span></div><div><span><br></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://bluespark.bamboohr.com/jobs/view.php?id=3' rel='nofollow'>https://bluespark.bamboohr.com/jobs/view.php?id=3</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 17, 2018 12:30:51 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "tGMjxMYTQeaPIwiHKmkeqg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/manageflitter-tech-lead-engineering-lamp-stack",
    "title": "ManageFlitter: Tech Lead - Engineering - LAMP Stack",
    "content": "<div>  <div>    <h2>Tech Lead - Engineering - LAMP Stack</h2>      <h4>Posted Mar 14</h4>    <h3>      <span>ManageFlitter</span><br>      <span>Headquarters: Sydney Australia</span><br>        <a href='https://manageflitter.com/careers' rel='nofollow'>https://manageflitter.com/careers</a>      <br>      <a rel='nofollow'>View all ManageFlitter jobs →</a>    </h3>  </div>    </div>  <div>    <div><h3><br></h3></div><ul><li><i><b>Flexible/remote work friendly environment</b></i></li><li><i><b>Smart collaborative team</b></i></li><li><i><b>Work on a platform used by thousands daily</b></i></li><li><i><b>Technology first organisation</b></i><br><br></li></ul><div>ManageFlitter –&nbsp;<a href='https://workable.com/nr?l=http%3A%2F%2Fmanageflitter.com' rel='nofollow'>http://manageflitter.com</a>&nbsp;– is a multi-award winning established SaaS Social Media management product. Since 2010 ManageFlitter has been used by over 4 million people around the world with paid customers from over 100 countries.</div><div><br></div><div><span>Our headquarters are in the Sydney CBD but we have team members based around the world. This role can be onsite, remote or a mix of both. Our remote friendly work culture and processes have been in place for a couple of years and is working well.</span><br></div><div></div><div></div><div></div><div></div><div></div><div></div><div><span><br></span></div><div><span>We have a “no ahole” rule and we work hard at creating an organisation where everyone can do their best work.</span><br></div><div></div><div></div><div></div><div></div><div></div><div></div><div><span><br></span></div><div><span>We believe that Social Media is changing the world and we love being part of that change. We have big plans for the next few years (rework of product and site in progress) and we are building out our team for the next stage of our journey.</span><br></div><div></div><div></div><div></div><div></div><div></div><div></div><div><span><br></span></div><div><span>We are looking for someone with outstanding technical experience, a mature attitude and a preference for working with a small smart team to join us in the role of Technical Lead on our production platform ManageFlitter. There will also potentially be opportunity to work on our new yet to be released product ManageSocial (Node/React/Lamda).</span><br></div><div></div><div></div><div></div><div></div><div></div><div></div><div><span><br></span></div><div><span>This role includes hands-on development work as well as mentoring, building out the team when applicable, code reviews and systems architectural design. You will work directly with the CEO as well as the development, product and support team.</span><br></div><div></div><div></div><div></div><div></div><div></div><div></div><div><span><br></span></div><div><span>Some of your technical responsibilities will include backend components of new feature implementation, existing codebase support and refactoring, focusing on high availability, scalability and performance.</span></div><div><br></div><div><strong>Further details about working at ManageFlitter:</strong></div><div><br></div><div></div><ul><li>Work on a very large technology platform that performs complex, high volume operations and serves thousands of users every day.</li><li>We believe in using the right tool for the job.</li><li>You will be working extensively with the ManageFlitter database of Twitter users which is one of the largest databases of Twitter users outside of Twitter.</li><li>The CEO and team are always very open to fresh ideas and there is no hard line management hierarchy.</li><li>There is no formal dress code.</li><li>Work on site or remote.</li><li>We believe in providing you with the best tools for your jobs and will provide a computer and monitors of your choice.</li><li>Comfortable central Sydney CBD based offices with lots of natural light.</li></ul><div><br></div><div><strong>Role Overview:</strong></div><div><br></div><div></div><ul><li>Strategise with the business and product teams to determine priorities and goals.</li><li>Lead technical discussions and decisions.</li><li>Advocate best practice software engineering principles within the team.</li><li>Drive process in an agile environment.</li><li>Fill the role of a Scrum master, directing various ceremonies, e.g. Planning sessions, retrospectives, Sprint showcases, etc.</li><li>Ensure a constant operational awareness of the platform health and team effectiveness.</li><li>Identify gaps in capabilities and be involved in the hiring process.</li><li>Analyse data in order to help identify areas for improvement in the product, process and team.</li><li>Mentor the team in both engineering and process related areas.</li><li>Actively developing the application.</li></ul><div><h3><br></h3></div><div><span><b>Requirements:</b></span></div><div><br></div><ul><li>At least 10 years relevant experience in a software development role (preferably working with PHP).</li><li>Experience designing and building complex software solutions and related infrastructure.</li><li>Experience building, configuring and maintaining a LAMP stack.</li><li>Strong background in OO development in PHP with a proficient understanding of fundamental principles such as TDD, DDD, SOLID, DRY and KISS.</li><li>Thorough understanding of core underlying technologies (Operating systems, TCP/IP, DNS, HTTP, TLS/SSL).</li><li>Familiarity working with Amazon AWS services (e.g. RDS, DMS, S3, EC2, CloudWatch, CloudSearch, ElasticSearch, etc) and Rackspace Cloud.</li><li>Working experience with Linux.</li><li>Experience with system monitoring tools.</li><li>Experience with configuration management systems such as SaltStack, Ansible, Chef or Puppet.</li><li>Familiarity with popular server software packages (MySQL, PostgreSQL, Redis, Memcached, Beanstalkd, Apache, Nginx)</li><li>Mature attitude.</li><li>Experience leading and managing a technical team.</li><li>Excellent written and verbal communication skills.</li><li>Exceptional attention to detail and the ability to manage multiple high priority projects and tasks.</li><li>Passion for solving complex technical problems.</li><li>Enjoy working in a fast moving environment.<br><br><br></li></ul><div><span><b>Bonus Skills:</b></span></div><div><br></div><ul><li>Strong working knowledge of the Twitter API</li><li>Experience working with large datasets in MySQL</li><li>DevOps experience</li><li>Experience building an online product</li><li>Has contributed to open source projects (provide examples if available)</li><li>Comprehensive understanding and experience with system security</li><li>Experience with horizontal scaling / clustering of a relational database such as PostgreSQL or MySQL</li><li>Relevant University degree</li><li>Twitter user</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply at:<a href='https://www.workable.com/j/B73043B511' rel='nofollow'>https://www.workable.com/j/B73043B511</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 14, 2018 3:45:57 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "LzHV8rPGRymFDZ57YeQidQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/pressable-wordpress-developer",
    "title": "Pressable: WordPress Developer",
    "content": "<div>  <div>    <h2>WordPress Developer</h2>      <h4>Posted Mar 14</h4>    <h3>      <span>Pressable</span><br>      <span>Headquarters: San Antonio</span><br>        <a href='https://pressable.com/careers/concierge-wordpress-engineer/' rel='nofollow'>https://pressable.com/careers/concierge-wordpress-engineer/</a>      <br>      <a rel='nofollow'>View all Pressable jobs →</a>    </h3>  </div>    </div>  <div>    <div>Do you enjoy building websites for people who do cool things with WordPress?</div><div><br></div><div>We’re looking for talented web developers and designers who are interested in working with a small Concierge team to build custom WordPress sites for a wide range of influential partners. These partners include, but aren’t limited to: social causes, musicians, bloggers, and podcasts. The Concierge team does everything from building WordPress sites from scratch to complex migrations to providing support and guidance. As a Concierge WordPress Engineer, your primary duties will include:</div><div><br></div><ul><li>Building custom WordPress sites for our partners hosted on Pressable, WordPress.com or self-hosting.</li><li>Conducting code reviews for existing WordPress sites.</li><li>Migrating partner sites to the best hosting platform that suits their needs.</li><li>Troubleshooting and performing maintenance on previously-launched partner sites, and adding new features as needed.</li><li>Teaming-up with agencies and contractors to assist with development on some projects.</li><li>Joining in on phone calls with our partners.</li></ul><div><span><br></span></div><div>We require a Concierge WordPress Engineer to have the following skills:</div><div><br></div><ul><li>Strong knowledge of HTML, CSS/Sass, and WordPress.</li><li>Ability to write a WordPress theme from scratch, in PHP.</li><li>Familiarity with and adherence to the WordPress Theme Development Standards. Experience with the Underscores or Components starter themes a strong plus.</li><li>Familiarity with different hosting platforms.</li><li>Good customer service skills -- you’ll be communicating directly with our partners.</li><li>Strong teamwork and collaboration skills using popular tools (Slack, Google Drive, Zoom, etc.)</li><li>A strong desire to work on websites for clients.</li><li>Good troubleshooting skills.</li><li>Self-starter who can manage time and projects efficiently.</li><li>Understanding of Open Source and the various licenses around it.</li></ul><div><span><br></span></div><div>A major plus if you have any of the following skills:</div><div><br></div><ul><li>Design: illustration, creating visual mock-ups, typography, wireframing the flows and UX of a complex site.</li><li>Advanced development skills: JavaScript, jQuery, PHP beyond WordPress themes.</li><li>Familiarity with servers and systems operations.</li><li>Experience with site migrations.</li><li>Writing and documentation skills; the ability to teach people.</li><li>Experience with WordPress.com, WooCommerce, WordPress.com VIP, and Jetpack.</li><li>Familiarity with GitHub and/or SVN, WP-CLI, and local development environments.</li></ul><div><span><br></span></div><div>The job is remote, meaning you can work from anywhere you want as long as you have an internet connection! We ask everyone who applies to be authorized to work within the United States.</div><div><br></div><div>We may invite an applicant to complete a limited-time “trial” project as part of the hiring process. A trial is an opportunity for our team to get hands-on experience working with an applicant and evaluating their work. We pay applicants a standard rate of $15/hour while they work as a contractor to complete their trial project.</div><div><br></div><div>When you apply, we ask that you provide a portfolio of the sites you have worked on. You can include URL of sites you’ve worked on if you don’t have your own portfolio.</div><div><br></div><div><strong>Let us know you're interested!</strong></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://pressable.com/careers/apply/?position=concierge_wordpress_engineer' rel='nofollow'>https://pressable.com/careers/apply/?position=concierge_wordpress_engineer</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 14, 2018 5:27:25 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "IBdW4P_AR1qxv2OI8e4WQw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4237-senior-full-stack-php-developer-manageflitter",
    "title": "Senior Full Stack PHP Developer @ ManageFlitter",
    "content": "<h2>              Senior Full Stack PHP Developer<small> @ ManageFlitter</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-03-07 01:03</p></dd>          <dt><span>Description</span></dt>          <dd><h5>DESCRIPTION</h5><p>ManageFlitter - <a href='http://manageflitter.com' rel='nofollow'>http://manageflitter.com</a> – is a multi-award winning SaaS social media management product. ManageFlitter is used by nearly 4 million people around the world and with paid customers from over 100 countries.</p><p>We have huge plans for the next couple of years and some exciting new projects are close to fruition - including our new product ManageSocial - <a href='http://managesocial.com' rel='nofollow'>http://managesocial.com</a> .</p><p>ManageFlitter is headquartered in Sydney with a technical team across Europe, South America and Canada.</p><p>We are looking for someone with outstanding technical experience and a preference for working with a small smart team to join us at ManageFlitter.</p><p>Whilst this role is remote you will need at least 3-4 hours crossover per day with the Sydney Australia timezone (AEDT).</p><p>The successful candidate will have a strong bias for action and an ability to clearly describe a complex technical solution to non-technical colleagues.</p><h5>REQUIREMENTS</h5><ul><li>Excellent English written and verbal communication skills</li><li>At least 5+ years commercial experience with PHP, MySQL, Linux and Open SourceTechnologies</li><li>Proven commercial experience with HTML, CSS / SASS and JavaScript / jQuery</li><li>Experience maintaining, debugging, refactoring and improving legacy, monolithic PHP applications</li><li>Strong background in OO development in PHP with a proficient understanding of fundamental principles such as TDD, DDD, SOLID, DRY and KISS</li><li>Working knowledge of OO design patterns and architecture patterns (e.g. MVC, ETL, )</li><li>Experience building, configuring and maintaining a LAMP stack</li><li>DevOps experience architecting solutions that scale</li><li>Experience working with AWS cloud services including EC2, S3, RDS, CloudSearch and DynamoDB</li><li>Experience working with configuration management tools such as Puppet, Chef and SaltStack</li><li>Proficient with shell scripting and the Unix / Linux CLI</li><li>Practical knowledge of modern frameworks and libraries (Symfony2, Silex, Doctrine, etc)</li><li>Experienced writing unit and integration tests with PHPUnit</li><li>Familiar with Redis, Memcached, PostgreSQL and Beanstalkd</li></ul><h5>BONUS SKILLS</h5><ul><li>Strong working knowledge of the Twitter API</li><li>Experience working with large datasets in MySQL (&gt; 5 TB)</li><li>Experience with other scripting or OO languages, e.g. Python, GoLang, jRuby</li><li>Experience working in Agile / Scrum workflows</li><li>Experience working with Rackspace cloud services</li><li>Experience writing technical specifications and documentation</li><li>Has contributed to open source projects (give examples if available)</li><li>Experience using Vagrant / Docker</li></ul><h5>BENEFITS</h5><p>We have worked hard to curate a smart, hard-working but easy going team. Our goal is to create an environment where each team member can do their best work. We are proud to say that we think we are well on our way to achieving this goal.</p><p>Paid annual leave is included in your salary package as well as time off for your local public holidays in your country from where you are working from.</p><p>To find out more about our team you can go to:<a href='https://manageflitter.com/careers' rel='nofollow'>https://manageflitter.com/careers</a></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Whilst this role is remote you will need at least 3-4 hours crossover per day with the Sydney Australia timezone (AEDT).</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Mar 7, 2018 3:03:49 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/Asia"
    ],
    "tagsNames1": [
      "Asia time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "Chl0SbHqRziGx7zmwlk3DQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30388?r=rss2",
    "title": "Elegant Themes: WordPress Theme & Plugin Developer",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><p><strong>About Our Company</strong></p><p>ElegantThemes.com&nbsp;is a leader in WordPress Theme &amp; Plugin Development. We have been building the top premium WordPress themes and plugins&nbsp;for the past 8 years&nbsp;and we maintain&nbsp;the largest customer bases in the ecosystem. 480,000 users, freelance developers and web design agencies depend on our beautiful designs&nbsp;and we work hard everyday to make sure we are creating the best WordPress products on the web. Divi, our flagship theme and page builder plugin is pushing the boundaries and has inspired an absolutely amazing community to form around it. A focus on community is a core part of our culture&nbsp;and it makes our work environment&nbsp;is a truly rewarding one.</p><p><br><strong>Job Description</strong></p><p>As a WordPress Developer at Elegant Themes, you will be working with a small and agile team&nbsp;made up of talented devs from all around the world. We work with git, chat on Slack and our team structure is flat and open.&nbsp;Self-motivated individuals&nbsp;tend to thrive best here, and we are looking for someone&nbsp;filled with inspiration and who isn't afraid to take initiative.</p><p>This position is for someone with a deep understanding of WordPress. You have built your own themes and plugins before&nbsp;and possibly even contributed to WordPress Core. You enjoy finding elegant solutions to complex problems&nbsp;and are familiar with the WordPress motto - &quot;code is poetry.&quot; You are up-to-date with the latest and greatest trends and technologies because you are engaged in the open source community and you enjoy building software that pushes the web forward. While WordPress is a PHP-based application, our flagship product uses a front-end interface built with React.js and Flux. A&nbsp;good amount of your time will be spent developing with Javascript.<br><br>This is a full time position available to both on-site and remote employees. Employment includes full benefits, paid vacation, a competitive salary and unlimited espresso brewed from our Rocket Cellini Premium Plus v2!<br><br></p><p><strong>Responsibilities</strong></p><ul><li>Be creative and contribute based on your own merit.</li><li>Be a positive, humble and contributing member to our small team.&nbsp;</li><li>Take the initiate to better yourself as a developer and to apply that knowledge to better our products and help our team succeed.&nbsp;</li></ul><p><br><strong>Required Experience</strong></p><ul><li>Complete understanding of the WordPress core software and its functions at the code level.</li><li>Experience building WordPress themes/plugins.</li><li>Mastery of WordPress coding and security&nbsp;best practices.</li></ul><p><br><strong>Required Skills</strong></p><ul><li>PHP</li><li>CSS</li><li>HTML</li><li>MYSQL</li><li>JAVASCRIPT</li><li>GIT</li></ul><p><br><strong>Bonus Qualifications</strong></p><ul><li>REACT</li><li>JQUERY</li><li>BACKBONE</li><li>REDUX</li><li>GRUNT</li><li>GULP</li><li>SASS</li><li>A history of open source software contribution</li></ul><p>&nbsp;</p><p><strong>Learn More</strong><br><br>Learn more about life at Elegant Themes, including our full list of perks and benefits:&nbsp;http://www.elegantthemes.com/careers/</p><p></p><p><strong>Job Perks:</strong> Healthcare, dental, 401k, paid vacation .</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Mar 5, 2018 11:23:54 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "p_pnXZQ-TL22iEmJypseYA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16495815",
    "title": "Motion Array | Senior Full-stack Developer | Remote | Full Time with flexible schedule | $100 - $130k",
    "content": "<div>                  <span>Motion Array | Senior Full-stack Developer | Remote | Full Time with flexible schedule | $100 - $130k<p>Motion Array was founded in 2012 as a side project, and has since grown to become a leading marketplace for video creators. We’re expanding beyond the marketplace and looking to offer multiple web apps that will aid in the video creator’s workflow.</p><p>That being said, we need your help if you’re a kick-ass, senior, full stack Laravel developer with strong JS skills. (Vue in particular)</p><p>Please email us at support@motionarray.com if you're interested or have questions.</p><p>Site: <a href='https://motionarray.com' rel='nofollow'>https://motionarray.com</a><span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 10:19:08 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "php"
    ]
  },
  {
    "id": "qVO4eMyCR3G2LDBUrw5s3g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16494144",
    "title": "Software Engineer @ Quartzy | Palo Alto, CA | ONSITE or REMOTE - US | Full-time | https://www.quartzy.com/ Apply here: https://boards.greenhouse.io/quartzy/jobs/149496?gh_jid=1494... About us: ...",
    "content": "<div>                  <span>Software Engineer @ Quartzy | Palo Alto, CA  | ONSITE or REMOTE - US  | Full-time | <a href='https://www.quartzy.com/' rel='nofollow'>https://www.quartzy.com/</a><p>Apply here:<a href='https://boards.greenhouse.io/quartzy/jobs/149496?gh_jid=149496#.Wpg0UZPwbOQ' rel='nofollow'>https://boards.greenhouse.io/quartzy/jobs/149496?gh_jid=1494...</a></p><p>About us: Quartzy is the world’s #1 lab management platform. Every day, hundreds of thousands of scientists from all over the world improve the efficiency of their research by using Quartzy. Our team is passionate about accelerating scientific research through well-designed, meaningful tools for labs and companies alike.</p><p>About the team: We work in two-week sprints and ship code many times per day. New engineers start code reviews their first day, and push code to production in their first week. Quartzy exists to accelerate science, and our engineers are where the acceleration starts: they solve real problems day by day, working hand-in-hand with our product team. Our platform and our marketplace APIs give research labs the tools they need to stay lean, save money and spend where it really matters.</p><p>Stack: php7 (laravel)/mysql<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 7:34:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "KhBtoYZ7Q--RgGuD366vcA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/155931/senior-php-developer-prezly?a=QifKPjthV60",
    "title": "Senior PHP Developer at Prezly  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Communications, Public Relations</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Please read&nbsp;<a href='https://medium.com/@gijsnelissen/tips-for-recruiting-engineers-8fff75857d78' rel='nofollow'>this medium post</a>&nbsp;before you apply</strong></p><p>Our services are built around a core of PHP, postgres, React, Redux with millions of people per day using some aspect of the system. We're big believers in devops/CI - building, testing, and deploying to any of our environments are as simple as pushing a commit to a git branch.</p><p>We're a&nbsp;product company first: This means that in addition to product and business development plans, we put emphasis on continual improvement of our stack and infrastructure. Current projects include API'ing our full application suite and introducing micro services</p><p>All of the technology is built and maintained by this small development team, so from day 1, software you write will be used by people from all over the world.</p><p>You will need to be able to work independently and remote. That being said we already have a functioning remote team in place and the right tools to make you an essential part of it:</p><p>- Daily standups&nbsp;<br>- The right tools: Slack, Jenkins, Google docs, Zoom.us, ...&nbsp;<br>- Visit our HQ in Belgium, Europe a few times per year.</p><p>More information at&nbsp;<a href='https://www.prezly.com/careers' rel='nofollow'>https://www.prezly.com/careers</a></p><p>Core requirements:&nbsp;<br>- 5+ years of professional PHP development.&nbsp;<br>-&nbsp;Strong understanding of OO patterns (doing PHP in wordpress&nbsp;won't cut it :-) )<br>- Up to date with everything that's going on with PHP 7.0+<br>- Have played with ORM's such as Doctrine, Propel or Eloquent<br>- Excellent problem solving, critical thinking, and communication skills.&nbsp;<br>- Hustler attitude.</p><p>Bonus points for:</p><p>- roven ability to mentor / manage engineers and drive a product forward.&nbsp;<br>- Knowledge of&nbsp;devops, AWS, kubernetes<br>- react/javascript skills<br>- Agile development methodologies.</p><p>Personal characteristics:&nbsp;<br>- Ability to be productive with limited resources.&nbsp;<br>- Team-oriented person who loves to collaborate and hustle</p><p><strong>Please read&nbsp;<a href='https://medium.com/@gijsnelissen/tips-for-recruiting-engineers-8fff75857d78' rel='nofollow'>this medium post</a>&nbsp;before you apply</strong></p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Compact team: because we're compact, any team member has a big impact                            </div>                            <div>                                 Flexible hours: there is life outside work                            </div>                            <div>                                 Unlimited vacation time: We evaluate on value, not on desk time                            </div>                            <div>                                 Travel: Come to our office and meet us                            </div>                            <div>                                 Slow weeks:Every two months, we allocate two weeks to take a step back                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 7:03:19 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "cDkEQXPmRv-D_8EL8NWciQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4172-director-of-web-development-bodhi-tree",
    "title": "Director of Web Development @ Bodhi Tree",
    "content": "<h2>              Director of Web Development<small> @ Bodhi Tree</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-26 21:14</p></dd>          <dt><span>Description</span></dt>          <dd><h5>DESCRIPTION</h5><p><strong>About Bodhi Tree</strong></p><p>Founded in 1970, Bodhi Tree was an iconic bookstore in Hollywood that became a leading seller of educational, metaphysical, spiritual, mystical, creative, and life improvement books, courses, events, artisan goods and wellness products for sanctuary, ceremony and sensuality. The world’s best-known authors, musicians, artists, visionaries, and wisdom teachers shopped and taught at the iconic, original store on Melrose Avenue in Los Angeles—considered by many to be the birthplace of the modern conscious living movement.</p><p>Today, combining social impact with elevated aesthetics, Bodhi Tree is expanding through technology and media to build a marketplace and global media company specializing in integrative well-being, spiritual fulfillment and self-realization.</p><p><strong>About Bodhi Tree Technology</strong></p><p>BodhiTree.com and our digital infrastructure has been completely overhauled over the last year, with a recent relaunch of our ecommerce store. There are upwards of 15,000 unique products in the store, and every few months we are adding thousands of new books and products. We have a team of developers, consultants, and a wide variety of artists and content creators collaborating on the content and the experience.</p><p>The ecommerce system is built with Shopify Plus, and a completely custom integration with Wordpress via the Shopify Buy Button API. We extensively use advanced custom fields, and other elements to query shopify directly within Wordpress and edit/display the content for our end users.</p><p>There are a wide range of technical, logistical and strategic challenges with complex ecommerce systems, and we are looking for a Director of Web Development who is extremely familiar with our tech stack, the business, the category, and feels they can lead a team of technical experts and artists to continue to grow this business into a streamlined e-commerce company that stays true to the roots of our community and mission.</p><h5>REQUIREMENTS</h5><p><strong>Principal Duties and Responsibilities</strong></p><p>Position type: Full-time (includes some evenings and weekends)</p><p>Experience: Mid-senior level</p><p>Location: Remote with occasional travel to Los Angeles</p><p>Reports to: CEO, works closely with the existing technical leadership team</p><p>Start Date: April 2018</p><p>As the Bodhi Tree Director of Web Development, you will be the leader of a growing digital team and in charge of all digital systems, integrations, the websites, and all budget/scoping/execution decisions at the company around digital systems.</p><p>We are committed to building a world-class digital business and are looking for a Director of Web Development who can not only manage web teams and consultants, but push code and make regular code updates through Git and monitor code quality, and plan our sprints and timelines.</p><p>In this position you will be able to utilize or create innovative and exciting digital tools and help us streamline and automate an extremely complex and growing business. Your efforts will touch a wide variety of tools and technologies, and our existing team is eager to have a full-time Director who organizes and streamlines the department, while upleveling and adding sophistication to all parts of our digital ecosystem.</p><p><strong>Responsibilities Include:</strong></p><p>The Director of Web Development (DWD) must possesses both intellectual and emotional intelligence, be experienced in their profession, methodical and detail-oriented, while also possessing strong drive and innovative thinking. Our team culture encourages ongoing communication with other team members, and we're willing to give and receive constructive feedback to find the right solution.</p><ul><li>Manage the day-to-day of digital efforts - all of our websites, e-commerce technologies, and digital tools will be under your purview, working closely with our existing teams and consultants who built the systems, motivating and inspire them to work together effectively and deliver their best work</li><li>Adjust and optimize budgets and sprint planning, with strong development planning skills to help us meet timing expectations</li><li>Demonstrate strong analytical skills in measuring and reporting on marketing programs and KPIs, working alongside our optimization and marketing team to ensure that the website and ecommerce engine is streamlined and reporting key information accurately</li><li>Strong understanding about data silos and the importance of automating data syncs between our CRM + Ecommerce engine and all the secondary sources of data</li><li>Develop and implement structured development plans in transparent systems</li><li>Evaluate, recommend, and manage ongoing relationships with current developers and consultants</li><li>Communicate and collaborate with other team leaders to understand how all teams in the organization rely on the Web Development Team. Keep everyone informed about team's progress, and actively solicit and implement feedback from other departments</li><li>Develop pro-active ideas and solutions to meet business objectives and to streamline digital systems</li><li>Attend team meetings and department calls</li><li>Monitor activities of competitors and other enterprise Shopify Plus clients to ensure best practices are being used</li><li>For the Director of Web Development (DWD) position, we need someone who possesses both intellectual and emotional intelligence. The DWD must be experienced in their profession, methodical and detail-oriented, while also possessing strong drive and innovative thinking. Our team culture encourages lots of communication with other team members, and we're willing to give and receive constructive feedback to find the right solution.</li><li>Manage servers and systems</li><li>Execute special projects as needed</li></ul><p><strong>Technical Expertise</strong></p><ul><li>High-level web development skills, with the ability to do web development work single-handedly when necessary.</li><li>Strong experience with ecommerce, ideally Shopify.</li><li>Administration of an enterprise Wordpress infrastructure</li><li>Ability to code in many web development languages, such as HTML, JavaScript, CSS, PHP, mySQL, Shopify’s liquid code, etc. Our organization primarily uses HTML/Javascript/CSS/PHP but our stack varies to some degree and there are a wide range of technologies we need to vet and consider.</li><li>At least one effective management method for web development teams</li><li>Automation CRMs/Email providers such as Salesforce, Infusionsoft and Klaviyo (We use Klaviyo)</li><li>E-Commerce solutions with Shopify and custom Shopify development</li><li>Preferably some skill with Photoshop, Illustrator or other design apps for wireframing/visualizations</li><li>Experience with wireframing and website development</li><li>Experience with APIs and WordPress plugin development</li><li>Experienced in integrating the technologies used for Internet marketing</li><li>Ability to do the bulk of web development work single-handedly but also tasking the work to our other developers and consultants to ensure timely and high-quality deliveries</li><li>Server management familiarity, and ability to confidently plan and prepare for traffic surges.</li></ul><p><strong>Background Expectations</strong></p><ul><li>5+ years’ experience on a web development and ecommerce team, preferably with at least 10 team members</li><li>5+ years’ experience as a leader of a web development group, team or sub-team</li><li>3+ years managing a web development team budget</li><li>3+ years of managing a large ecommerce store or similar sales funnel experience</li></ul><h5>BENEFITS</h5><p><strong>Compensation &amp; Benefits</strong></p><ul><li>Competitive salary commensurate upon experience</li><li>Healthcare + other benefits can be discussed during the hiring process</li></ul><p><strong>Commitment to Diversity</strong></p><p>Bodhi Tree seeks individuals of all ethnic and racial backgrounds and we are committed to maximizing the diversity of our organization, as we want to engage all those who can contribute to this effort.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 11:14:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "kVfQIsJpSbq5d9fv6ayBLA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168585/sr-web-developer-php-to-make-events-more-awesome-sched?a=UxmLsgWlOUM",
    "title": "Sr Web Developer (PHP) to make events more awesome at Sched (Austin, TX) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Sched is a 100% remote company focused on helping event organizers. Learn about who we are, what we're looking for and how you can grow with us!</p><p><strong>REQUIRED EXPERIENCE</strong></p><ul><li>Outstanding at communication. We are a 100% remote team and this means everything</li><li>Highly experienced with PHP, MySQL, HTML, JS</li><li>3+ years working on a product team (freelance-only is not a good fit)</li><li>Experience spec/sizing work required and shipping time-sensitive solutions.</li><li>Comfortable working in a legacy codebase and making improvements along the way.</li></ul><p><strong>WHAT WE DO<br></strong>Events are where we go to be inspired by those who've followed their dreams, learn from the people who want us to succeed, build life-long friendships and discover new opportunities.</p><p>Our goal is to help organizers succeed in building more of these unforgettable events. Thousands of events depend on Sched, like tech conferences, comic conventions, music festivals, yoga festivals, professional development days and even furry conventions. Seriously, there is an event for everything.</p><p>You'll be building something that makes a real difference to our customers. Here's actual feedback about what you'll be building:</p><ul><li>I wonder what the world did before Sched...</li><li>Sched completely revolutionized our convention.</li><li>Sched is pretty fuckin' awesome.</li><li>Using Sched is something I actively LOOK FORWARD TO whenever we're getting ready to put on another event.</li></ul><p><strong>WHAT YOU'LL DO<br></strong>Plan, build and ship features &amp; improvements to help event organizers run better events. Working together as a small team means you will have a substantial impact on our product and company success.</p><p><strong>LOCATION<br></strong>We are 100% remote! You can work from anywhere in the world. Some of our team use the flexibility to work from home. Some of our team use it to travel. It's up to you. Our founder has&nbsp;<a href='https://nomadlist.com/@gtmcknight' rel='nofollow'>lived in Airbnbs for the past 6 years.</a></p><p>We get together throughout the year in incredible places like Bali, Tokyo, Berlin and Mykonos, all covered by Sched. Part work, part vacation, we call them&nbsp;<a href='https://www.instagram.com/explore/tags/schedcation/' rel='nofollow'>#schedcations</a>.</p><p><strong>PAY &amp; BENEFITS<br></strong>This is a full-time position. Salary is dependent on experience. Benefits include paying you to take vacation, conferences stipends, equipment when needed and flexible hours.</p>                    </div>                            <h2>                About Sched            </h2>            <div><p>Events are where we go to be inspired by those who've followed their dreams, learn from the people who want us to succeed, build life-long friendships and discover new opportunities.</p><p>Our goal is to help organizers succeed in building more of these unforgettable events. Thousands of events depend on Sched, like tech conferences, comic conventions, music festivals, yoga festivals, professional development days and even furry conventions. Seriously, there is an event for everything.</p>            </div>        ",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 9:31:15 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "3WxsmMb3S8yBMzBEqovLXw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/autoagent-data-solutions-llc-telecommute-senior-php-software-developer",
    "title": "Autoagent Data Solutions LLC: Telecommute Senior PHP Software Developer",
    "content": "<div>  <div>    <h2>Telecommute Senior PHP Software Developer</h2>      <h4>Posted Feb 26</h4>    <h3>      <span>Autoagent Data Solutions LLC</span><br>      <span>Headquarters: Boca Raton, FL</span><br>        <a href='https://www.ziprecruiter.com/job/8c830f03' rel='nofollow'>https://www.ziprecruiter.com/job/8c830f03</a>      <br>      <a rel='nofollow'>View all Autoagent Data Solutions LLC jobs →</a>    </h3>  </div></div>  <div>    <div></div><div>Autoagent Data Solutions is looking for a professional andexperienced Senior PHP Developer that can help support our web-based taxprocessing portal and growing customer base. You will be part of an efficient,but small team, responsible for managing, developing, and enhancing ourapplication using modern coding practices. Our ideal applicant will be awell-rounded and motivated developer with good communication and technicalskills. <br></div><div></div><div></div><div></div><div>&nbsp;</div><div></div><div><b>What We Need:Development</b><br></div><div></div><div></div><ul><li>At least 8 years of relevant experience building customapplications in PHP, MSSQL/MySQL, jQuery, and Bootstrap<br></li><li>Experience working with large databases – ours contains 500+million rows<br></li><li>Proficient in troubleshooting, debugging and solving programmaticproblems<br></li><li>Experience using version control in a team environment suchas GIT<br></li><li>Experience working and parsing large data files<br></li></ul><div><br></div><div><b>What We Need:Communication</b><br></div><div></div><ul><li>Strong communication skills – all employees provide customersupport<br></li><li>Team player – our company treats employees like family<br></li><li>Ability to write and maintain documentation<br></li></ul><div><br></div><div><b>What We Need: WorkEthic</b><br></div><div></div><ul><li>Strong willingness to learn and keep learning<br></li><li>Goal oriented and respects time management<br></li><li>Self-motivated and productive working remotely<br></li></ul><div><br></div><div><b>About Autoagent DataSolutions</b><br></div><div></div><div>Autoagent DataSolutions offers mortgage lenders, tax servicers, property managers, andprivate payers access to our patented web-based portal designed to simplifyescrow and property tax processing and payments to tax collectors across the UnitedStates. Our 22+ year old company isstable, growing, and profitable. We’ve revolutionized the delivery of freshdata between organizations by solving traditional problems with web-based toolsand reporting.</div><div><br></div><div><b>What We Provide<br></b></div><div></div><ul><li>Competitivesalary<br></li><li>Quarterly performancebonuses<br></li><li>Full health,dental, and vision insurance<br></li><li>401(k) withcompany contributions<br></li><li>Opportunity to work from home (100% telecommute)<br></li><li>Mobile phone and internet reimbursement<br></li><li>Balance work and life with our vacation policy and officeholidays<br></li><li>Annual company meet up</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://www.ziprecruiter.com/job/8c830f03' rel='nofollow'>https://www.ziprecruiter.com/job/8c830f03</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 8:07:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "php"
    ]
  },
  {
    "id": "Y34bf879TiCmIxX3FlmcIg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4164-software-engineer-ii-civicplus",
    "title": "Software Engineer II @ CivicPlus",
    "content": "<h2>              Software Engineer II<small> @ CivicPlus</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-26 14:24</p></dd>          <dt><span>Description</span></dt>          <dd><p>CivicPlus strives to make local government work better. We currently have over 2,500+ clients and growing. CivicPlus has been an INC. 5000 fastest growing company for the past six years! Part of CivicPlus’ strategy is to continue to grow exponentially as we strive to be THE integrated software solution to make governments work better.  Due to all our recent product suite additions and more anticipated growth in the future, we are looking for talented individuals to join our software development team. We are looking for an experienced professional with programming and software engineering background. This is a fun, high-energy position that is at the forefront of CivicPlus’ product success!</p><p>The Software Engineer II is responsible to analysis, design, develop and test software solutions for the company’s products.  This position is also responsible to provide maintenance and support to existing code following company’s standards and best code practices. The Software Engineer II, with little help, will be able to abstract requirements to innovate solutions to enhance our products within our environment. </p><h5>We offer you....</h5><ul><li>An informal, social workplace where enthusiasm and talent are rewarded</li><li>The chance to work with some of the best colleagues and most creative minds in the world</li><li>Competitive pay and benefits</li><li>The ability to leave a legacy used by millions of American and Canadian citizens</li></ul><h5>We'll expect you to...</h5><ul><li>Abstract requirements to analyze and design innovative new software solutions for enhancement of the company’s products. Utilize Test Driven Development (TDD)</li><li>Develop code using best practices and current software patterns.</li><li>Follow company’s code standards to fix product issues (bugs)</li><li>Read, understand, debug products code to find and solve current software problems.</li><li>Perform roll outs to clients as needed</li><li>Test software solutions appropriately before deliver to testing team.</li><li>May be asked to perform other duties as assigned</li><li>Learn to mentor other engineers</li></ul><h5>What you'll likely need to succeed...</h5><ul><li>At least 1.5 years of experience with MVC and C# or PHP</li><li>At least 1.5 years of experience with MySQL</li><li>At least 1.5 years of experience with JavaScript, Ajax, JSON</li><li>Writing unit tests and testable code.</li><li>At least 1.5 years of experience with source control management</li><li>Bachelors of Science in Computer Science or related field or 3.5yrs of relevant experience.</li></ul><h5>Physical Requirements...</h5><ul><li>Able to work at a computer and monitor for extended periods of time</li><li>Able to lift at least 10 lbs. of weight</li></ul><h5>Job Location</h5><ul><li>Manhattan, Kansas, United States</li></ul><p><strong><em>Role can be remote, reporting to Manhattan, KS office.</em></strong></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 4:24:32 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "dotnet",
      "frontend",
      "php"
    ]
  },
  {
    "id": "I9_FtchDRbmXaMdyscoYbw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/66584/lead-developer-at-ideal-flatmate/",
    "title": "Lead Developer",
    "content": "*We’re looking for a Lead Developer to join Ideal Flatmate to lead our technology strategy, mentor our team of developers and ensure that we build a best-in-class customer experience.*<br /><br />Ideal Flatmate is an online flat matchmaking service that brings together compatible flatmates using a simple 20-question survey and an algorithm. The site has grown fast since launching in 2016, and now attracts over 100,000 users per month. More information can be found at www.idealflatmate.co.uk.<br /><br />Our stack currently comprises a PHP web application hosted on AWS, but we’re open minded about alternative technology choices going forward so long as they make good business sense. <br /><br />*What you’ll be responsible for:*<br /><br />* Being the subject matter expert across the full technology stack, including development tooling and infrastructure.<br />* Providing technical leadership to the remote development team.<br />* Making well-reasoned strategic technology decisions and communicating them with the founders and development team.<br />* Contributing to the product development and delivering a top notch customer experience.<br /><br />*Projects you could be working on:*<br /><br />* The development of a new native mobile app and accompanying service layer<br />* Migrating our infrastructure to an orchestration service like Elastic Beanstalk and Docker containers<br />* Rewriting our flatmate matching algorithm utilising machine learning techniques and services<br /><br />*You should apply if:*<br /><br />* You want to work as part of small team, solving really interesting technology and user experience challenges and seeing the results of your work quickly.<br />* You’ve got experience working within in a team of developers and are feeling ready to take the lead in a team of your own. <br />* You’re comfortable rolling up your sleeves and working with PHP (expert level not essential)<br />* You have excellent communication skills and are comfortable working with remote developers.<br />* You are flexible; our requirements and opinions sometimes change more often than bigger, older companies. <br />* You’re ambitious. This role is the natural precursor to a CTO/VP Engineering role either here, or someplace else!<br /><br /><br />*To apply, please send a CV or LinkedIn profile and a brief cover note*",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 11:35:48 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "php"
    ]
  },
  {
    "id": "-odYU3dWTIKoBfYpEDfpew",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/66584/lead-developer-at-high-growth-proptech-startup-at-ideal-flatmate/",
    "title": "Lead Developer at High Growth Proptech Startup",
    "content": "*We’re looking for an ambitious Lead Developer to join Ideal Flatmate to work directly with the founders, development team and our advisory CTO to build the number one flatsharing website in the UK.*<br /><br />*This role would suit a capable and driven developer who is looking to take the next step up in their career.*<br /><br />*This is a fantastic opportunity to join the team at a key moment in our growth. We are backed by industry experts and have seen our user-base 10x in the last 4 months.*<br /><br />Ideal Flatmate is an online flat matchmaking service that brings together compatible flatmates using a simple 20-question survey and an algorithm. The site has grown fast since launching in 2016, and now attracts over 100,000 users per month. More information can be found at www.idealflatmate.co.uk.<br /><br />Our stack currently comprises a PHP web application hosted on AWS, but we’re open minded about alternative technology choices going forward so long as they make good business sense. <br /><br />*What you’ll be responsible for:*<br /><br />* Being the subject matter expert across the full technology stack, including development tooling and infrastructure.<br />* Providing technical leadership to the remote development team.<br />* Making well-reasoned strategic technology decisions and communicating them with the founders and development team.<br />* Contributing to the product development and delivering a top notch customer experience.<br /><br />*Projects you could be working on:*<br /><br />* The development of a new native mobile app and accompanying service layer<br />* Migrating our infrastructure to an orchestration service like Elastic Beanstalk and Docker containers<br />* Rewriting our flatmate matching algorithm utilising machine learning techniques and services<br /><br />*You should apply if:*<br /><br />* You want to work as part of small team, solving really interesting technology and user experience challenges and seeing the results of your work quickly.<br />* You’ve got experience working within in a team of developers and are feeling ready to take the lead in a team of your own. <br />* You’re comfortable rolling up your sleeves and working with PHP (expert level not essential)<br />* You have excellent communication skills and are comfortable working with remote developers.<br />* You are flexible; our requirements and opinions sometimes change more often than bigger, older companies. <br />* You’re ambitious. This role is the natural precursor to a CTO/VP Engineering role either here, or someplace else!<br /><br /><br />*To apply, please send a CV or LinkedIn profile and a brief cover note*",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 11:35:48 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "php"
    ]
  },
  {
    "id": "LZ7PA7DrSqufz__ve4N6_Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/892-lead-developer-python-php",
    "title": "Lead Developer (Python/PHP)",
    "content": "Lead Developer&nbsp;(Python/PHP) - Jobmote<div><div><h2>Lead Developer&nbsp;(Python/PHP)</h2><h5>Parklink Development Limited</h5></div></div><div><div><div><div><div><p></p><h2><strong>Lead Developer [PHP/Python]</strong></h2><p>Parklink Limited seeks a skilled, motivated candidate to fill the position of remote Lead Technician fluent in Python and PHP, who loves the challenges of high-availabilty SaaS and working with hardware.</p><h3><strong>About us</strong></h3><p>Parklink Development Limited provides RFID duplication devices to locksmiths and security professionals.</p><p>Our flagship product is ‘<a href='https://rebadge.eu' rel='nofollow'><em>Rebadge</em></a>’. It’s a patented machine that duplicates RFID badges for customers. Before Rebadge, it was impossible to duplicate consumer RFID badges. Since the launch of Rebadge, literally hundreds of thousands of people have been able to make copies of their badges, and the number increases every day.</p><p>Each machine is an embedded linux system running Python + Qt, and tethered online.<br>Supporting the machines is a RESTful API (CakePHP).<br>There is also a full back-office system for client management, machine management, billing, etc.</p><p>We’ve got over 2,000 machines online (Check out our coverage map here: <a href='https://rebadge.eu' rel='nofollow'>https://rebadge.eu</a>)</p><p>We’ve recently expanded into Australian and US markets. With this growth comes new challenges, and this is where your expertise comes in.</p><p>The team currently consists of three staff - the founding partners operating in the roles of CTO and COO, and a technical support role. The succesful candidate would be the fourth member on the team. The company structure is based in Hong Kong, but the partners are EU based.</p><p>We are a highly optimised / lean company. The successful candidate will have the ability to work autonomously on a constantly evolving product and rapidly expanding client base. You will work on a real product that is used by thousands of people daily.&nbsp;</p><p>Working for us means you’ll be able to flex your development muscles, and you’ll have a real impact on a real product that exists in the real-world, used by thousands of people every day. It’s an exciting possibility.</p><p><strong>We are not another boring SaaS company.</strong> We create, manufacture and deploy real hardware on a global scale, with back and front end code managing it all. You’ll have a chance to get your hands onto hardware, software, development and deployment. If you’re driven, curious, and a hacker at heart, this position is for you.&nbsp;</p><p>We will provide you with all the training and tools you need, an annual travel budget, and a dynamic, fair and respectful work environment.&nbsp;</p><p>Reciprocatively, we are seeking to work with someone that is honest, skilled, self-motivated, and reliable.</p><h3>Tasks:</h3><p>As a lead technician, your tasks will be divided into two categories:</p><ol><li>Backend Development (CakePHP)</li><li>Embedded Development (Python)</li></ol><h4>Backend Development</h4><p>Our systems (API + Back-office) are based on the CakePHP framework, backed by a geographically Distributed High-Availability LAMP stack (Europe + Asia)</p><p>The RESTful API provides the interface to the network of machines, and the back office provides administration functionality for us and our clients.</p><h5>Backend Development Tasks</h5><ul><li>Maintaining &amp; Developing the API [PHP / CakePHP]</li><li>Maintaining &amp; Developing the Administration Interface [PHP / CakePHP]</li><li>Maintaining &amp; Optimisation of the Database [MySQL]</li></ul><p>We have short, medium and long term goals, and milestones setup for our system. You’re coming into a stable, clean, code base that we’ll give you all necessary training on.</p><p>Our frameworks are under GitHub source control, with a CI environment for staging and production.</p><p>&nbsp;We will provide necessary development environments (VirtualBox environment).</p><h4>Embedded Development&nbsp;</h4><p>We have 2000+ networked machines deployed. Each machine is powered by a Raspberry Pi 3, with dual-frequency RFID readers and touch screen. We have a custom linux deployment running the client software, written in Python + Qt [Pyside]</p><p>The software is under clean, stable, and under active development.&nbsp;</p><h5>Embedded Development Tasks</h5><ul><li>Maintaining &amp; Developing machine software [Python]</li><li>Developing / Deploying a Unit Testing framework [Python / FrogLogic Squish]</li><li>Development / Maintenance of System scripts / enviroment [Linux / Bash]</li></ul><p>We will provide all necessary training + hardware required to get started on the&nbsp; systems.</p><h3>Skill / Experience Requirements</h3><h4>Technical Skills</h4><ul><li><strong>Python 3</strong> [Fluent]<ul><li>QT / PySide Experience Bonus</li><li>Ability to write, respect &amp; maintain unit tests</li></ul></li><li><p><strong>PHP 5/6/7</strong> &nbsp; [Fluent]</p><ul><li>OOP (PSR-1 &amp; 2) Obligatory</li><li>CakePHP Experience Bonus</li><li>Ability to write, respect &amp; maintain unit tests (CodeCeption, PHPUnit)<br></li></ul></li><li><p><strong>Git</strong> /GitHub competancy</p><ul><li>Fluent with Git, respecting &amp; maintaining development procedures (issue branch, code review, pull request, merge, etc)<br></li></ul></li><li><p><strong>Database</strong> (Mysql)</p><ul><li>Query optimisation for high load environments<br></li></ul></li><li><p><strong>High Traffic, High Availability Clusters</strong> &nbsp;</p><ul><li>Experience with distributed server clusters and writing highly optimised code for high-load environments - understanding the requirements of high-load environments<br></li></ul></li><li><p><strong>Linux Familiarity</strong></p><ul><li>Intermediate configuration &amp; administration tasks (SSH, Bash, etc)</li><li>Rasbian Experience Bonus<br></li></ul></li><li><p><strong>Hardware Familiarity</strong></p><ul><li>Raspberry PI</li><li>Serial / UART<br></li></ul></li><li><p><strong>NFC Familiarity</strong> &nbsp;[Bonus]</p><ul><li>13.56 (Mifare, libNFC, etc)</li><li>125KHz (T55, EM4XX etc)&nbsp;</li></ul></li></ul><h4>Personal Skills</h4><ul><li>English (Fluency in written + spoken)</li><li>Ability to communicate clearly and efficiently</li><li>Ability to work autonomously &amp; self-motivate</li><li>Ability to integrate into an existing team &amp; structure</li></ul><h4>Time Requirements</h4><ul><li>This is a full time, remote position (8 hours per day, 5 days per week)</li><li>Reachable during work hours via phone / slack</li></ul><h3>Compensation</h3><ul><li><strong>40000EU per year</strong></li><li><strong>2kEU</strong> Hardware Allowance</li><li>Annual <strong>Travel Allowance</strong></li><li>We will provide all training required</li><li>We will provide all hardware necessary (Devices, parts, badges, etc)</li><li><strong>Flexible time off</strong> : 25 Paid Vacation days + 11 Paid Public Holidays</li></ul><h3>Application Pre-requisites</h3><ul><li>Your updated CV</li><li>A brief email explaining who you are, why you fit the position, and how your experience is relevant.</li><li>A link to your GitHub/GitLab account</li><li>An overview of your side projects that you work on / contribute to.</li></ul><p>We will take time to study each application with diligence - please take the time to read over the position requirements carefully.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Feb 25, 2018 12:21:48 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "60UF3Q-mRQuv9YroOMObDg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30348?r=rss2",
    "title": "Parklink Development Limited: Lead Developer (Python/PHP)",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><h2><strong>Lead Developer [PHP/Python]</strong></h2><p>Parklink Limited seeks a skilled, motivated candidate to fill the position of remote Lead Technician fluent in Python and PHP, who loves the challenges of high-availabilty SaaS and working with hardware.</p><h3><strong>About us</strong></h3><p>Parklink Development Limited provides RFID duplication devices to locksmiths and security professionals.</p><p>Our flagship product is '<a href='https://rebadge.eu' rel='nofollow'><em>Rebadge</em></a>'. It's a patented machine that duplicates RFID badges for customers. Before Rebadge, it was impossible to duplicate consumer RFID badges. Since the launch of Rebadge, literally hundreds of thousands of people have been able to make copies of their badges, and the number increases every day.</p><p>Each machine is an embedded linux system running Python + Qt, and tethered online.<br>Supporting the machines is a RESTful API (CakePHP).<br>There is also a full back-office system for client management, machine management, billing, etc.</p><p>We've got over 2,000 machines online (Check out our coverage map here: <a href='https://rebadge.eu' rel='nofollow'>https://rebadge.eu</a>)</p><p>We've recently expanded into Australian and US markets. With this growth comes new challenges, and this is where your expertise comes in.</p><p>The team currently consists of three staff - the founding partners operating in the roles of CTO and COO, and a technical support role. The succesful candidate would be the fourth member on the team. The company structure is based in Hong Kong, but the partners are EU based.</p><p>We are a highly optimised / lean company. The successful candidate will have the ability to work autonomously on a constantly evolving product and rapidly expanding client base. You will work on a real product that is used by thousands of people daily.&nbsp;</p><p>Working for us means you'll be able to flex your development muscles, and you'll have a real impact on a real product that exists in the real-world, used by thousands of people every day. It's an exciting possibility.</p><p><strong>We are not another boring SaaS company.</strong> We create, manufacture and deploy real hardware on a global scale, with back and front end code managing it all. You'll have a chance to get your hands onto hardware, software, development and deployment. If you're driven, curious, and a hacker at heart, this position is for you.&nbsp;</p><p>We will provide you with all the training and tools you need, an annual travel budget, and a dynamic, fair and respectful work environment.&nbsp;</p><p>Reciprocatively, we are seeking to work with someone that is honest, skilled, self-motivated, and reliable.</p><h3>Tasks:</h3><p>As a lead technician, your tasks will be divided into two categories:</p><ol><li>Backend Development (CakePHP)</li><li>Embedded Development (Python)</li></ol><h4>Backend Development</h4><p>Our systems (API + Back-office) are based on the CakePHP framework, backed by a geographically Distributed High-Availability LAMP stack (Europe + Asia)</p><p>The RESTful API provides the interface to the network of machines, and the back office provides administration functionality for us and our clients.</p><h5>Backend Development Tasks</h5><ul><li>Maintaining &amp; Developing the API [PHP / CakePHP]</li><li>Maintaining &amp; Developing the Administration Interface [PHP / CakePHP]</li><li>Maintaining &amp; Optimisation of the Database [MySQL]</li></ul><p>We have short, medium and long term goals, and milestones setup for our system. You're coming into a stable, clean, code base that we'll give you all necessary training on.</p><p>Our frameworks are under GitHub source control, with a CI environment for staging and production.</p><p>&nbsp;We will provide necessary development environments (VirtualBox environment).</p><h4>Embedded Development&nbsp;</h4><p>We have 2000+ networked machines deployed. Each machine is powered by a Raspberry Pi 3, with dual-frequency RFID readers and touch screen. We have a custom linux deployment running the client software, written in Python + Qt [Pyside]</p><p>The software is under clean, stable, and under active development.&nbsp;</p><h5>Embedded Development Tasks</h5><ul><li>Maintaining &amp; Developing machine software [Python]</li><li>Developing / Deploying a Unit Testing framework [Python / FrogLogic Squish]</li><li>Development / Maintenance of System scripts / enviroment [Linux / Bash]</li></ul><p>We will provide all necessary training + hardware required to get started on the&nbsp; systems.</p><h3>Skill / Experience Requirements</h3><h4>Technical Skills</h4><ul><li><strong>Python 3</strong> [Fluent]<ul><li>QT / PySide Experience Bonus</li><li>Ability to write, respect &amp; maintain unit tests</li></ul></li><li><strong>PHP 5/6/7</strong>&nbsp; [Fluent]<ul><li>OOP (PSR-1 &amp; 2) Obligatory</li><li>CakePHP Experience Bonus</li><li>Ability to write, respect &amp; maintain unit tests (CodeCeption, PHPUnit)<br><br></li></ul></li><li><strong>Git</strong>/GitHub competancy<ul><li>Fluent with Git, respecting &amp; maintaining development procedures (issue branch, code review, pull request, merge, etc)<br><br></li></ul></li><li><strong>Database</strong> (Mysql)<ul><li>Query optimisation for high load environments<br><br></li></ul></li><li><strong>High Traffic, High Availability Clusters</strong>&nbsp;<ul><li>Experience with distributed server clusters and writing highly optimised code for high-load environments - understanding the requirements of high-load environments<br><br></li></ul></li><li><strong>Linux Familiarity</strong><ul><li>Intermediate configuration &amp; administration tasks (SSH, Bash, etc)</li><li>Rasbian Experience Bonus<br><br></li></ul></li><li><strong>Hardware Familiarity</strong><ul><li>Raspberry PI</li><li>Serial / UART<br><br></li></ul></li><li><strong>NFC Familiarity</strong>&nbsp;[Bonus]<ul><li>13.56 (Mifare, libNFC, etc)</li><li>125KHz (T55, EM4XX etc)&nbsp;</li></ul></li></ul><h4>Personal Skills</h4><ul><li>English (Fluency in written + spoken)</li><li>Ability to communicate clearly and efficiently</li><li>Ability to work autonomously &amp; self-motivate</li><li>Ability to integrate into an existing team &amp; structure</li></ul><h4>Time Requirements</h4><ul><li>This is a full time, remote position (8 hours per day, 5 days per week)</li><li>Reachable during work hours via phone / slack</li></ul><h3>Compensation</h3><ul><li><strong>40000EU per year / ~$50,000 USD</strong></li><li><strong>2kEU</strong> Hardware Allowance / <strong>$2450 USD</strong></li><li>Annual <strong>Travel Allowance</strong></li><li>We will provide all training required</li><li>We will provide all hardware necessary (Devices, parts, badges, etc)</li><li><strong>Flexible time off</strong>: 25 Paid Vacation days + 11 Paid Public Holidays</li></ul><h3>Application Pre-requisites</h3><ul><li>Your updated CV</li><li>A brief email explaining who you are, why you fit the position, and how your experience is relevant.</li><li>A link to your GitHub/GitLab account</li><li>An overview of your side projects that you work on / contribute to.</li></ul><p>We will take time to study each application with diligence - please take the time to read over the position requirements carefully.</p><p></p><p><strong>Job Perks:</strong> - 36 days of paid holiday per year- Hardware development budget- Annual travel budget</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Feb 24, 2018 11:35:25 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "rUWI4NVfSvOBTzR1sQXTVw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4155-french-web-hosting-support-hostpapa",
    "title": "French Web Hosting Support @ HostPapa",
    "content": "<h2>              French Web Hosting Support<small> @ HostPapa</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-21 16:37</p></dd>          <dt><span>Description</span></dt>          <dd><h5>Job Summary</h5><p>We’re looking for an amazing person who is committed to helping others. We work with web hosting customers from all over the world, and with that comes an endless amount of challenges and learning experiences.</p><p><strong>Open Schedules - Toronto Time</strong></p><p>Monday-Friday 10AM-7PM</p><p>Saturday-Wednesday 10AM-7PM</p><h5>Responsibilities and Duties</h5><p>So, what can you do for our customers?</p><ul><li>Solve their web technology problems using chat, email and phone.</li><li>Install, configure, maintain and solve errors for content managements systems including, WordPress, Drupal, Joomla, etc.</li><li>Explain how DNS and web design tools work.</li><li>Provide customers with a “WOW!” experience</li></ul><h5>Qualifications and Skills</h5><ul><li><strong>Must have experience working in the web hosting industry</strong></li><li>In-depth experience with cPanel</li><li>Ability to troubleshoot website and email problems</li><li>Great communication skills</li><li>Driven to be the best and you have examples to prove it</li><li><strong>Must be fluent in French and English</strong></li></ul><h5>Benefits and Perks</h5><p>So what are the advantages to working with a pretty amazing tech company?</p><ul><li><strong>Ability to work from anywhere in the world</strong>. You can travel and work in a new city every month. Work and travel without ever using your vacation time. This is a remote position. </li><li><strong>Flexible Vacation</strong>. Never get denied a vacation request ever again.</li><li><strong>Paid Education</strong>. We care about your career. We will help you gain new skills, and guide you on where you want to go.</li><li><strong>Company events</strong>. We include every team member, no matter where they live.</li></ul><p>Come work with a fun, driven, and amazing team at HostPapa!</p><p><em>HostPapa is committed to providing accommodations for people with disabilities. If you require an accommodation, we will work with you to meet your needs. Accommodation may be provided in all parts of the hiring process.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 21, 2018 6:36:51 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "aTo1uowuS_2qJK_sXwMLpg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/797-jr-shopify-and-wordpress-front-end-web-developer-remote-only",
    "title": "Jr. Shopify and Wordpress Front End Web Developer (Remote Only)",
    "content": "Jr. Shopify and Wordpress Front End Web Developer (Remote&nbsp;Only) - Jobmote<div><div><h2>Jr. Shopify and Wordpress Front End Web Developer (Remote&nbsp;Only)</h2><h5>Slicedbread Agency</h5></div></div><div><div><div><div><div><p></p><p><strong>(Full Time Contractor - REMOTE ONLY)</strong></p><p>&nbsp;</p><p>Who We Are</p><p>We are Slicedbread - a boutique digital creative, marketing, and advertising agency based in Santa Monica, California. With the endlessly evolving digital landscape that is the world wide web, we are constantly striving to find creative and inspiring ways to communicate with the broader audience through the tools and platforms that helped us make information so widely accessible. With commitment, perseverance, hard work, and most importantly, the right team, we have no doubt that our unique methods toward online marketing and advertising will pave the way for more efficient, effective, and meaningful relationships that can be built between people from all walks of life.</p><p><strong>&nbsp;</strong></p><p>What We Want</p><p>We are looking for a full-time, Shopify and Wordpress Front End Web Developer that not only has a passion for their craft, but also the desire to grow with our team and the drive to constantly challenge the status quo. Our team comprises of individuals that never settles for complacency and we seek to find like-minded individuals that share the same philosophies in their skill and in their environments. This front end web developer _ <strong>must</strong> _ have experience working with Shopify’s Liquid language as well as Wordpress’s PHP framework. He/she will also need to be comfortable with Waterfall style work environments and using collaborative version control infrastructures (Git) with different team members.</p><p><strong>&nbsp;</strong></p><p>We’d like to talk to you if:</p><ul><li></li></ul><p>You are a front end web developer who specializes with Shopify and Wordpress.</p><ul><li></li></ul><p>You see development as part of design and UX.</p><ul><li></li></ul><p>You believe there is more than one “right” solution to any challenge.</p><ul><li></li></ul><p>You believe that testing is as important as coding.</p><ul><li></li></ul><p>You value expression of intent as much as performance in your code.</p><p><strong>&nbsp;</strong></p><p>The Ideal Candidate Should Have:</p><ul><li></li></ul><p>1-2 years of working experience developing in Shopify and Wordpress.</p><ul><li></li></ul><p>Proficient in front end web development languages such as HTML, CSS3/SASS, and jQuery/Javascript.</p><h3>- Proficient in Shopify’s “Liquid” language. (Knowledge of ThemeKit is a bonus)</h3><p>Proficient in the front end needs within PHP.</p><ul><li></li></ul><p>Proficient in front-end frameworks, specifically Bootstrap and Zurb.</p><ul><li></li></ul><p>Proficient in using and altering MySQL databases.</p><ul><li></li></ul><p>Proficient in using version control (Git) from the command line.</p><ul><li></li></ul><p>Proficient in extracting using Photoshop to extract assets from PSDs.</p><ul><li></li></ul><p>Familiarity with server structures, specifically Apache and Nginx.</p><ul><li></li></ul><p>Familiarity with Agile and Waterfall work environments.</p><p><strong>&nbsp;</strong></p><p>Nice to haves:</p><ul><li></li></ul><p>Familiarity with PHP and JavaScript backend.</p><ul><li></li></ul><p>Familiarity with other additional platforms:</p><ul><li></li></ul><p>Drupal</p><ul><li></li></ul><p>Magento</p><ul><li></li></ul><p>BigCommerce</p><ul><li>Prestashop<h3>- Proficient in working with servers such as AWS and Media Temple.</h3></li></ul><p>Proficient with SSH from the command line.</p><ul><li></li></ul><p>Proficient in setting up development and staging environments.</p><ul><li></li></ul><p>Proficient with build tools such as Gulp/Grunt.</p><ul><li></li></ul><p>Proficient in systems administrative tasks, such as cache setup/configuration, server load balancing, CDN technologies, etc.</p><ul><li></li></ul><p>Familiarity with deployment services and processes such as RightScale.</p><p>&nbsp;</p><p>What we offer in return:</p><p>&nbsp;</p><ul><li></li></ul><p>A highly collaborative work environment that takes a team first approach.</p><ul><li></li></ul><p>Freedom to work in the comfort of your home office, cafe, etc.</p><ul><li></li></ul><p>Flexible remote work schedule and hours that make sense for your time zone and daily life, as long as delivery dates are met.</p><ul><li></li></ul><p>Opportunity to explore self-directed projects/experiments/etc. during slower seasons</p><ul><li></li></ul><p>Paid vacation, holidays, sick days (it’s important to take time off to recharge).</p><h3>- Eligible for project completion-based commissions after probationary period. </h3><p>Really awesome people. No joke.</p><p>&nbsp;</p><p><strong><em>Applicants will receive a test to demonstrate certain competencies and will need to have completed within a certain timeframe. The details of the test will be provided to applicants separately.</em></strong></p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Feb 20, 2018 8:21:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "it6iRnRuTtaoiTJw2robfA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30329?r=rss2",
    "title": "Slicedbread Agency: Jr. Shopify and Wordpress Front End Web Developer (Remote Only)",
    "content": "<p>Full-time</p><p><strong>(Remote)</strong> </p><p><span><span><span><strong>(Full Time Contractor - REMOTE ONLY)</strong></span></span></span></p><p>&nbsp;</p><p><span>Who We Are</span></p><p><span>We are Slicedbread - a boutique digital creative, marketing, and advertising agency based in Santa Monica, California. With the endlessly evolving digital landscape that is the world wide web, we are constantly striving to find creative and inspiring ways to communicate with the broader audience through the tools and platforms that helped us make information so widely accessible. With commitment, perseverance, hard work, and most importantly, the right team, we have no doubt that our unique methods toward online marketing and advertising will pave the way for more efficient, effective, and meaningful relationships that can be built between people from all walks of life. </span></p><p><strong>&nbsp;</strong></p><p><span>What We Want</span></p><p><span>We are looking for a full-time, Shopify and Wordpress Front End Web Developer that not only has a passion for their craft, but also the desire to grow with our team and the drive to constantly challenge the status quo. Our team comprises of individuals that never settles for complacency and we seek to find like-minded individuals that share the same philosophies in their skill and in their environments. This front end web developer <em><strong>must </strong></em>have experience working with Shopify's Liquid language as well as Wordpress's PHP framework</span><span>. He/she will also need to be comfortable with Waterfall style work environments and using collaborative version control infrastructures (Git) with different team members. </span></p><p><strong>&nbsp;</strong></p><p><span>We’d like to talk to you if:</span></p><ul><li><p><span>You are a front end web developer who specializes with Shopify and Wordpress.</span></p></li><li><p><span>You see development as part of design and UX.</span></p></li><li><p><span>You believe there is more than one “right” solution to any challenge.</span></p></li><li><p><span>You believe that testing is as important as coding.</span></p></li><li><p><span>You value expression of intent as much as performance in your code.</span></p></li></ul><p><strong>&nbsp;</strong></p><p><span>The Ideal Candidate Should Have:</span></p><ul><li><p><span>1-2 years of working experience developing in Shopify and Wordpress.</span></p></li><li><p><span>Proficient in front end web development languages such as HTML, CSS3/SASS, and jQuery/Javascript.</span></p></li><li><span>Proficient in Shopify’s “Liquid” language. (Knowledge of ThemeKit is a bonus)</span></li><li><p><span>Proficient in the front end needs within PHP.</span></p></li><li><p><span>Proficient in front-end frameworks, specifically Bootstrap and Zurb.</span></p></li><li><p><span>Proficient in using and altering MySQL databases. </span></p></li><li><p><span>Proficient in using version control (Git) from the command line.</span></p></li><li><p><span>Proficient in extracting using Photoshop to extract assets from PSDs.</span></p></li><li><p><span>Familiarity with server structures, specifically Apache and Nginx.</span></p></li><li><p><span>Familiarity with Agile and Waterfall work environments.</span></p></li></ul><p><strong>&nbsp;</strong></p><p><span>Nice to haves:</span></p><ul><li><p><span>Familiarity with PHP and JavaScript backend.</span></p></li><li><p><span>Familiarity with other additional platforms:</span></p></li><ul><li><p><span>Drupal</span></p></li><li><p><span>Magento</span></p></li><li><p><span>BigCommerce</span></p></li><li><span>Prestashop</span></li></ul><li><span>Proficient in working with servers such as AWS and Media Temple.</span></li><li><p><span>Proficient with SSH from the command line.</span></p></li><li><p><span>Proficient in setting up development and staging environments.</span></p></li><li><p><span>Proficient with build tools such as Gulp/Grunt.</span></p></li><li><p><span>Proficient in systems administrative tasks, such as cache setup/configuration, server load balancing, CDN technologies, etc. </span></p></li><li><p><span>Familiarity with deployment services and processes such as RightScale.</span></p></li></ul><p>&nbsp;</p><p><span>What we offer in return:</span></p><p>&nbsp;</p><ul><li><p><span>A highly collaborative work environment that takes a team first approach.</span></p></li><li><p><span>Freedom to work in the comfort of your home office, cafe, etc.</span></p></li><li><p><span>Flexible remote work schedule and hours that make sense for your time zone and daily life, as long as delivery dates are met. </span></p></li><li><p><span>Opportunity to explore self-directed projects/experiments/etc. during slower seasons</span></p></li><li><p><span>Paid vacation, holidays, sick days (it’s important to take time off to recharge). </span></p></li><li><span>Eligible for project completion-based commissions after probationary period. </span></li><li><p><span>Really awesome people. No joke.</span></p></li></ul><p>&nbsp;</p><p><strong><em><span>Applicants will receive a test to demonstrate certain competencies and will need to have completed within a certain timeframe. The details of the test will be provided to applicants separately.</span></em></strong></p><p></p><p><strong>Job Perks:</strong>  </p><p><strong>Apply:</strong> Please submit your cover letter and resume with your application. Applicants will receive a test to demonstrate certain competencies and will need to have completed within a certain timeframe. The details of the test will be provided to applicants separately.</p>",
    "urlFetchPending": false,
    "published": "Feb 20, 2018 8:09:07 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "1xVFmldOQemeNrzSa-VK_A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/artbees-veteran-wordpress-developer",
    "title": "Artbees: Veteran WordPress Developer",
    "content": "<div>  <div>    <h2>Veteran WordPress Developer</h2>      <h4>Posted Feb 20</h4>    <h3>      <span>Artbees</span><br>      <span>Headquarters: Istanbul, Turkey</span><br>        artbees.net      <br>      <a rel='nofollow'>View all Artbees jobs →</a>    </h3>  </div>    </div>  <div>    <div><h3>DESCRIPTION</h3></div><div>Artbees is looking for a full-time Veteran WordPress Developer. We are specialized in building WordPress themes and plugins, so a strong familiarity and interest in WordPress and its platform is a must. Your major responsibility as a Full Stack Developer will be to extend the capabilities of WordPress by building tools and modules that will make website building a fun and interactive experience. If you’re passionate about WordPress, writing clean, well-documented code and are interested in tackling a series of new, exciting projects, we want to talk to you.</div><div><br></div><div><h3>REQUIREMENTS</h3></div><ul><li>Minimum of 5 years experience coding skills with WordPress</li><li>Professional level backend and frontend coding skills</li><li>Hands on custom WordPress development at scale</li><li>An excellent Knowledge of PHP</li><li>Deep understanding of WordPress architecture, developing custom themes, custom content types and creating custom plugins</li><li>Fluid knowledge of JavaScript (we do not mean jQuery, you must write great Vanilla JS)</li><li>Ability to work with Git</li><li>Ability to work with CI tools (Jenkins, Ansible)</li><li>Experience creating, building and working with APIs</li><li>Knowledge in WordPress security and optimization</li><li>Familiar with Agile and Scrum workflows</li><li>Excellent time management skills</li><li>Strong oral and written communication skills in English</li><li>Have had a team work experience (with developers and QA team)</li></ul><div><br></div><div><strong>RESPONSIBILITIES</strong></div><div><br></div><ul><li>Design, develop, and maintain the technical architecture of applications</li><li>Ability to quickly shift between multiple projects and technologies</li><li>Must be highly organized; capable of developing and meeting the project deadline</li><li>Write clean code and test it throughout the development process to ensure the top-tier quality</li></ul><div><h3>BENEFITS</h3></div><ul><li>Competitive salaries</li><li>We cover the cost of your learning materials</li><li>Flexible and fair time off policy</li><li>Birthday surprises</li><li>Spotify subscription gifts</li></ul><div><br></div><div>* We need to learn about your most accomplished projects. If you do not have a well-developed LinkedIn profile or online presence, we expect a CV attached to your application or a link to your online portfolio.</div><div><br></div><div><strong>We welcome on-site and remote applicants from all over the world with the exception of individuals living in or between the following time zones: UTC -10:00 and UTC -5:00.</strong></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply here:<a href='https://artbees.workable.com/jobs/334815' rel='nofollow'>https://artbees.workable.com/jobs/334815</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 20, 2018 10:35:42 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "0ZYiveKhT7KeuXTerivblA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168349/software-engineer-contributors-wikimedia-foundation-inc?a=UsswupU9xok",
    "title": "Software Engineer (Contributors) at Wikimedia Foundation, Inc. (San Francisco, CA) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Education Technology, eLearning, Non-Profit</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Location: San Francisco, CA or Remote</strong></p><p><strong>Summary:</strong></p><p>Wikimedia Foundation is looking for a talented Software Engineer to join the Contributors department working to resolve complex challenges in creative ways.</p><p>You will join the Contributors Department, where we build collaborative, inclusive tools for creating and editing free knowledge. You’ll be working on exciting products, such as features for editor collaboration, discussion, and multimedia contribution. These teams are working on ambitious projects that are transforming the way users are able to contribute to Wikipedia and other projects.</p><p><strong>Responsibilities:</strong></p><ul><li>Help develop tools that empower users to create, curate, and collaborate on content</li><li>Take ownership of multiple areas of both back-end and front-end code</li><li>Review code changes made by staff and community members</li><li>Document software, and help the team specify and document user-facing behavior, supporting the work of QA Engineers</li><li>Participate in cross-departmental engineering projects</li><li>Maintain production software, including deployed legacy codebases</li><li>Deploy software and configuration changes to production environments</li></ul><p>&nbsp;<strong>Requirements</strong>:</p><ul><li>JavaScript</li><li>PHP</li><li>B.S. or M.S. Computer Science or equivalent experience</li><li>Comfortable working in a highly collaborative, consensus-oriented environment</li><li>Comfortable working in a partly remote, distributed team across various time zones</li><li>Willing to travel occasionally - sometimes internationally - for team and organizational meetings</li><li>Proficient English speaker&nbsp;</li></ul><p><strong>Pluses</strong>:</p><ul><li>Front-end technologies including JavaScript, jQuery, HTML and CSS targeting desktop and mobile browsers</li><li>MySQL or other relational database experience</li><li>Experience with building highly-scalable server applications</li><li>Experience using and contributing to Wikimedia or MediaWiki projects</li><li>Experience with Node.js</li><li>Knowledge of developing and debugging in Linux/Unix (LAMP) environments, especially with Puppet (or similar tools)</li><li>Experience working on open source, collaborative development projects</li><li>Understanding of free culture / free software / open source principles</li><li>Fluency in languages other than English</li></ul><p><strong>Benefits &amp; Perks *</strong></p><ul><li>Fully paid medical, dental and vision coverage for employees and their eligible families (yes, fully paid premiums!)</li><li>The Wellness Program provides reimbursement for mind, body and soul activities such as fitness memberships, baby sitting, continuing education&nbsp;and much more</li><li>The 401(k) retirement plan offers matched contributions at 4% of annual salary</li><li>Flexible and generous time off - vacation, sick and volunteer days, plus 19 paid holidays - including the last week of the year.</li><li>Family friendly! 100% paid new parent leave for seven weeks plus an additional five weeks for pregnancy, flexible options to phase back in after leave, fully equipped lactation room.</li><li>For those emergency moments - long and short term disability, life insurance (2x salary) and an employee assistance program</li><li>Pre-tax savings plans for health care, child care, elder care, public transportation and parking expenses</li><li>Telecommuting and flexible work schedules available</li><li>Appropriate fuel for thinking and coding (aka, a pantry full of treats) and monthly massages to help staff relax</li><li>Great colleagues - diverse staff and contractors speaking dozens of languages from around the world, fantastic intellectual discourse, mission-driven and intensely passionate people</li></ul><p><em>* for benefits eligible staff, benefits may vary by location</em></p><p><strong>More Information</strong></p><p><a href='https://wikimediafoundation.org' rel='nofollow'>https://wikimediafoundation.org</a></p><p><a href='https://blog.wikimedia.org' rel='nofollow'>https://blog.wikimedia.org</a></p>                    </div>                            <h2>                About Wikimedia Foundation, Inc.            </h2>            <div><p><strong>About the Wikimedia Foundation</strong></p><p>The Wikimedia Foundation is the non-profit organization that supports and hosts Wikipedia and several other Wikimedia free knowledge sites.&nbsp;Every month, the Wikimedia sites are accessed by more than a billion unique devices.&nbsp;Wikipedia consists of more than 40 million articles across hundreds of languages. Every month, more than 250,000&nbsp;volunteer editors contribute to Wikipedia. Based in San Francisco, California, the Wikimedia Foundation is an audited, 501(c)(3) non-profit that is funded primarily through donations and grants. It currently employs over 300&nbsp;staff members.</p><p>At the Foundation, we build technology to help people everywhere access Wikipedia, across devices and in nearly 300 languages. We engineer privacy for our readers and editors so they can safely and securely explore Wikipedia. We create&nbsp;programs&nbsp;and initiatives to make Wikipedia freely available to more people in more parts of the world. We build&nbsp;new tools&nbsp;for the community of editors so they can continue to improve and grow Wikipedia. Roughly a quarter of our budget goes to supporting the community that make the site possible, including through&nbsp;grantmaking programs&nbsp;that enable volunteers and enrich the information on the sites.</p><p>The Wikimedia Foundation is an equal opportunity employer, and we encourage people with a diverse range of backgrounds to apply.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Fully paid premiums for medical, dental &amp; vision insurance premiums                            </div>                            <div>                                 401(k) with 4% matching contribution                            </div>                            <div>                                 7-12 weeks parental leave with 100% pay + lactation room                            </div>                            <div>                                 Wellness Program ($1800 annual) to promote wellness &amp; personal growth                            </div>                            <div>                                 Pre-tax savings plans for Transportation &amp; Parking                            </div>                            <div>                                 Flexible work schedules and remote working options                            </div>                            <div>                                 Pet Friendly office                            </div>                            <div>                                 Commitment to diversity &amp; inclusion throughout the employee lifecycle                            </div>                            <div>                                 12 days vacation, 19 days holiday, 2 days volunteer work and more!                            </div>                            <div>                                 Lean more at https://wikimediafoundation.org/wiki/Work_with_us                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 18, 2018 11:18:35 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs",
      "php"
    ]
  },
  {
    "id": "dYut0KFgTf-PUMDRW_eYbA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/167882/senior-application-engineer-float?a=UiKuckwCPg4",
    "title": "Senior Application Engineer at Float (New York, NY) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Float is seeking a Senior Application Engineer who is excited at the prospect of working with a small, highly-skilled engineering team to scale a fast-growing SaaS product. The ideal candidate is a talented, reliable PHP programmer who is also experienced with, and enthusiastic about, node.js server-side development.</p><p>You will help us develop new features and maintain our codebase while supporting a wide variety of technologies. You should be familiar with modern microservice development and its associated benefits (and challenges) in creating stable, performant, rapidly deployable services.</p><p>This is a 100% remote position. You’ll report directly to our CTO, who is based in New York.</p><p><br></p><p><strong>About You</strong><br><br></p><ul> <li>You are passionate about data and developing applications that communicate through elegantly designed, well-defined systems that meet defined business goals.</li> <li>You're a great communicator, naturally curious and comfortable diving in and helping out without ego.</li> <li>You'll have strong experience in a collaborative environment working with web applications, preferably B2B SaaS apps.</li> </ul><p>You should consider yourself an expert in:</p><ul> <li>PHP 7: native and MVC framework, e.g., Yii/Yii2 (5+ years)</li> <li>Server-side JavaScript: Node.js application development</li> <li>REST API management, tools and documentation</li> <li>Relational and NoSql database development: MySql, MongoDB</li> <li>Source control workflow: Git, GitHub, GitFlow</li> <li>Microservices architecture and deployment</li> </ul><br><p><strong>Benefits</strong></p><br><p><strong>About Our Team</strong></p><p><br>Float is the leading resource scheduling application for agencies, studios and firms. Since 2012, it’s been helping teams in more than 150 countries keep track of who’s working on what and when including NASA, Vice, Buzzfeed and RGA. </p> <p>We’re profitable and 100% funded by our customers. Our team of twelve includes members in New York, Dallas, Cleveland, Australia, Portugal and Ukraine. We encourage people of different backgrounds, perspectives and locations to enhance our team and deliver their best work.</p> <p><a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fwww.float.com' rel='nofollow'>www.float.com</a></p>                    </div>                            <h2>                About Float            </h2>            <div><p>Float is a fast-growing, New York-based startup, with a global team delivering one of the world's leading SaaS-based resource scheduling solutions. Since 2012, teams have been relying on Float to schedule more than one million tasks including NASA, Nike, RGA and Vice.</p><p><br></p><p>Float has a small, growing, international team that includes members in New York, Australia, Portugal and Ukraine. </p><p><br></p><p><a href='http://www.float.com' rel='nofollow'>www.float.com</a></p><p><br></p>            </div>        ",
    "urlFetchPending": false,
    "published": "Feb 18, 2018 11:18:35 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "nodejs",
      "php"
    ]
  },
  {
    "id": "nX62rtkCS4S98IJQL94eSA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/164284/back-end-engineer-php-modus-create?a=T5W5U3LYGBO",
    "title": "Back End Engineer - PHP at Modus Create  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>At Modus Create you will collaborate with a cross-functional Scrum team to deliver high quality innovative products in short sprint cycles. You thrive in an independent, distributed environment. If you’ve got the chops and want to ditch the cubicle, apply to the best lean startup development team on the planet.</p><p>This contract role may be performed from a remote location and requires a level of effort estimated at 40 hours per week.&nbsp;</p><p><strong>Responsibilities</strong></p><ul><li>Upgrade legacy PHP and Laravel MVC Framework based system</li><li>Develop and integrate Microservices</li><li>Collaborate daily on a distributed, cross functional agile team</li></ul><p><strong>Required Experience</strong></p><ul><li>3-5 + yrs PHP development on the backend</li><li>Strong experience using Laravel MVC Framework</li><li>Must be familiar with PSRs</li><li>Previous experience using PHPUnit</li><li>Documentation tools such as Swagger</li><li>Must have previous experience building and integrating Microservices</li><li>Strong foundation of OOP principles</li><li>ORM for interacting with DB's for example Eloquent (comes with Laravel)</li><li>Experience upgrading legacy code a plus</li><li>Experience using JIRA for issue tracking</li><li>Strong experience using GitHub in a professional environment</li><li>Previous consulting experience is a plus</li><li>Be able to communicate effectively in English</li></ul><p><strong>Let’s Talk about You</strong></p><p><strong>You value outcomes above all else:</strong>&nbsp;You have a proven track record shipping great mobile and web products. By understanding the big picture, you articulate strategy and vision with strong written and verbal communication.</p><p><strong>You Lead by Doing:&nbsp;</strong>You realize that the big picture is worthless without getting your hands dirty in the technical details for strategic and tactical problem solving. You understand the value of situational leadership and can adapt to the needs and strength of your team. &nbsp;</p><p><strong>You Love Work, Growth and Learning:&nbsp;&nbsp;</strong>&nbsp;You dream of working in a culture that values hard work, continued learning and innovation with a commitment to building amazing products for clients and their end users. You’ll stop learning when you are dead, and until then you desire to gain deeper knowledge in technology and business.</p><p><strong>Let’s Talk About Us</strong></p><p>Modus Create is a Product Studio offering consulting services and SaaS products for strategic planning, design and execution of web-based and mobile products. We work across multiple industries with Fortune 1000, ISVs, and startups to validate, plan and launch new products. Headquartered in Reston, VA, we are a bootstrapped team that has grown from 2 to 100 people in 26 countries in 6&nbsp;years, committed to building the best product consulting firm on the planet. We offer a highly collaborative, autonomous and effective working environment. We love and believe in what we do. This is your chance to be part of building something great.</p><p><strong>Why Modus Create</strong></p><ul><li>Competitive compensation</li><li>Ability to work remotely / telecommute</li><li>Working side-by-side with thought leaders in emerging tech</li></ul><p><strong>Do you have what it takes to join the DC area's most awesome tech company? Let’s start a conversation.</strong></p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Company-provided, top notch hardware, software and services                            </div>                            <div>                                 Competitive compensation &amp; benefits                            </div>                            <div>                                 Ability to expense technical books                            </div>                            <div>                                 GitHub repos for your projects                            </div>                            <div>                                 A chance to get your personal projects sponsored                            </div>                            <div>                                 Travel if you like, stay at home if your don't                            </div>                            <div>                                 Assisted continuous self-development                            </div>                            <div>                                 Talk at meetups                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 18, 2018 11:18:35 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "Okly_-MvQZaYi98MHPQ9lg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/sched-sr-web-developer-php-to-make-events-more-awesome",
    "title": "Sched: Sr Web Developer (PHP) to make events more awesome",
    "content": "<div>  <div>    <h2>Sr Web Developer (PHP) to make events more awesome</h2>      <h4>Posted Feb 17</h4>    <h3>      <span>Sched</span><br>      <span>Headquarters: Earth</span><br>        <a href='https://sched.com' rel='nofollow'>https://sched.com</a>    </h3>  </div></div>  <div>    <div>Learn about who we are, what we're looking for and how you can grow with us:</div><div><br></div><div><b>REQUIRED EXPERIENCE</b></div><ul><li>Outstanding at communication. We are 100% remote and communication means everything.<br></li><li>Highly experienced with PHP, MySQL, HTML, JS<br></li><li>3+ years working on a product team (freelance-only is not a good fit)<br></li><li>Experience sizing work required and shipping time-sensitive solutions.<br></li><li>Comfortable working in a legacy codebase and making improvements along the way.</li></ul><div><br></div><div><b>WHAT WE DO</b></div><div>Events are where we go to be inspired by those who've followed their dreams, learn from successful people, build life-long friendships and discover new opportunities.</div><div><br></div><div>Our goal is to help organizers succeed in building more of these unforgettable events. Thousands of events depend on Sched, like tech conferences, comic conventions, music festivals, yoga festivals, professional development days and even furry conventions. Seriously, there is an event for everything.</div><div><br></div><div>You'll be building something that makes a real difference to our customers. Here's actual feedback about what you'll be building:</div><div><br></div><ul><li>I wonder what the world did before Sched...<br></li><li>Sched completely revolutionized our convention.<br></li><li>Sched is pretty fuckin' awesome.<br></li><li>Using Sched is something I actively LOOK FORWARD TO whenever we're getting ready to put on another event.</li></ul><div></div><div><br></div><div><b>WHAT YOU'LL DO</b></div><div>Plan, build and ship features &amp; improvements to help event organizers run better events. Working together as a small team means you will have a substantial impact on our product and company success.</div><div><br></div><div><b>LOCATION</b></div><div>We are 100% remote! You can work from anywhere in the world. Some of our team use the flexibility to work from home. Some of our team use it to travel. It's up to you. Our founder has lived in Airbnbs for the past 6 years.</div><div><br></div><div>We get together throughout the year in incredible places like Bali, Tokyo, Berlin and Mykonos, all covered by Sched. Part work, part vacation, we call them #schedcations.</div><div><br></div><div><b>PAY &amp; BENEFITS</b></div><div>Salary is dependent on experience. Generous benefits include paying you to take vacation, conferences stipends, equipment when needed and flexible hours. This is a full-time position.</div><div><br></div><div><b>HOW TO APPLY<br></b></div><div>You will be asked these 4 questions in the application process:</div><div>1. About Yourself -- What should we know about you? Include social media or personal sites that help us get to know you.</div><div>2. Your Experience -- Why are you a great fit for Sched? Do you have the required experience? Show us.</div><div>3. Accomplishment -- Describe a recent team accomplishment that you are proud of and why.</div><div>4. Ask us one thoughtful question about Sched.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://sched.breezy.hr/p/5a29b82a6d4a-sr-web-developer-php/apply' rel='nofollow'>https://sched.breezy.hr/p/5a29b82a6d4a-sr-web-developer-php/apply</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 17, 2018 8:28:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "3-4dyhR4SzKD3wgUdAZeDQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/66348/magento-website-developer-at-willow-hall/",
    "title": "Magento Website Developer",
    "content": "*Responsible for:*<br /><br />We are looking for a positive, enthusiastic and motivated Magento website developer who is looking to work in a fast-paced environment, developing and protecting a growing website.<br /><br />*Responsibilities:*<br /><br />* Ensuring the website platform performs well, follows good coding practices and conforms to required standards whilst delivering a seamless customer experience<br />* Manage and implement marketing campaigns on our website<br />* Manage and implement all programming and content tickets<br />* Website project and ticket management<br />* Highlight potential risks or malfunctions and act proactively to resolve issues<br />* Seek opportunities for improvement and suggest new projects<br />* Monitor and report on Google Analytics metrics<br /><br />*Skills & Experience:*<br /><br />* Magento Certified<br />* 3+ years’ Magento 1.x responsive development experience (desktop and mobile) having used it on previous e- commerce sites on a commercial level<br />* Good knowledge of PHP, MySQL, SQL Server, Java Script, HTML, CSS and an understanding of UE/UX<br />* Source control (Git is preferable, or similar will be acceptable)<br />* Fluent with Agile processes, Git and Deployment routes<br />* Use of WordPress, Apache, NginX, cPanel<br />* Experience with other platforms such as WordPress, Drupal, Joomla would be beneficial<br />* A high level understanding of SEO<br />* Good experience writing testable code, unit tests and using test automation.<br />* An understanding of Magento 2<br />* Agile, Waterfall or Prince 2 accredited (preferred) and demonstrates a methodical way of working, with the ability to cope with competing demands in a fast paced environment<br />* Knowledge of all current browser types in use<br />* Strong problem-solving skills<br />* Technically-minded with an eye for detail<br />* Excellent communicator and in particular the ability to communicate technical concepts to non‐technical staff and stakeholders<br />* Solid technical background with an ability to address accessibility and compatibility issues with Magento and Salesforce<br />* Experience managing offshore developers, holding them to account<br />* Educated to degree level, preferably in Computer Science, Digital Marketing or other relevant field<br />* A self-starting coder, with great organisation and time tracking skills<br />* Knowledge of E-commerce best practices including increasing conversion rates and reducing exits<br />* Basic server management is also a bonus<br /><br />*Line Management:*<br /><br />No internal line management but potential minimal offshore agency management<br /><br />*Other Key interfaces:*<br /><br />Head of Customer Services, Head of Trade & Operations, Agencies<br /><br />*Location & Hours:*<br /><br />Twickenham. Hours can be flexible depending on the candidate. Possible remote working 1 dpw but depends on the candidate.",
    "urlFetchPending": false,
    "published": "Feb 17, 2018 7:41:41 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "ypalgF0VTBOaLpbVXN0RYQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobs.github.com-remote",
    "url": "http://jobs.github.com/positions/abd5f1c6-10d5-11e8-91b7-ebcc71368d7c",
    "title": "Full Time: Senior Backend Developer with PHP (Homeoffice / flexible) at Digistore24 GmbH in Remote",
    "content": "<p><strong>This is a full-time remote position, we accept applications from anywhere in the world.</strong></p><p><strong>&gt;&gt; Check out <a href='https://jobs.digistore24.com/senior-back-end-developer/lp//' rel='nofollow'>our job video</a> and <a href='https://jobs.digistore24.com/en/jobs/' rel='nofollow'>our careers page</a> to see if we would be a good fit.&lt;&lt;</strong></p><p><em>At Digistore24 we develop software that has an impact on thousands of small and medium sized businesses every day. If you are man of action who loves to work in a small, family-like team and who has the passion and work ethic to develop great software products, we are the right fit for you.</em></p><p>We are one of the fastest growing software companies in Europe. Our core platform is an automation solution developed by a small and extremely competent team. It provides a complete infrastructure to over 100.000 entrepreneurs to build a scalable online business with millions of customers.</p><p><strong>The Job</strong></p><p>We are looking for an experienced back-end developer with high motivation and a keen interest in our business use case. You know a good deal about PHP and Sympfony, you are able to think and read into complex topics and - if you get stuck, ask the right people the right questions - proactively.</p><p>In addition, you are able to design meaningful solutions to problems within short time. Last but not least, you understand which systems your project is involved in, and make sure that interactions with these systems are stable and reliable. You should also bring with you:</p><ul><li>Excellent knowledge of web development technologies (LAMP, Symfony, AngularJS)</li><li>Several years of object oriented web development experience in PHP</li><li>Min. 5 years of experience along with a proven track record of successfully delivering high quality web software at scale</li><li>Experience in improving architecture and code quality by refactoring</li><li>Ability to develop automated tests with phpUnit.</li><li>Work well under pressure, developing key features for high volume, business critical systems</li><li>Experience and desire to work in an agile environment</li><li>Interest in being challenged in a fast-paced environment while having fun at the same time</li><li>Good English language skills with German being an asset</li></ul><p><strong>The Benefits</strong></p><p>If you bring that to the table and identify with our culture, you are welcome as a valuable member of our team. We are looking for long-term relationships and we try to get you into the project that suits you the most.</p><p>We give so that you can contribute. If that scares you off, very well - then you do not make a bad investment and either do we. If you like our approach, then we would be really happy to hear from you.</p><p><strong>Your Application</strong></p><p>We do not want to assess your skills and motivation solely based on diplomas and certificates. Show us what you did. We are interested in all projects of your previous occupations, own projects, your code on Github, etc.</p><p>Please send your application <a href='https://jobs.digistore24.com/senior-back-end-developer/lp/' rel='nofollow'>via our jobs page</a> and upload your resume (PDF) as well as all the work samples you think are necessary.</p><p>When everything goes well, we will get back to you and have a short phone call. The next steps will be:</p><ul><li>a code test</li><li>an interview with our CEO and the tech team</li><li>a final feedback and a job offer within 2 weeks time</li></ul><p>If you have questions concerning this position, don’t hesitate to send an e-mail to <a href='mailto:jobs@digistore24.com' rel='nofollow'>jobs@digistore24.com</a></p>",
    "urlFetchPending": false,
    "published": "Feb 13, 2018 5:51:22 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "uL0z7JkBRiCeD2UAVWcQFA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/703-web-developer-php-wordpress",
    "title": "Web Developer (PHP - Wordpress)",
    "content": "Web Developer (PHP -&nbsp;Wordpress) - Jobmote<div><div><h2>Web Developer (PHP -&nbsp;Wordpress)</h2><h5>Perch</h5></div></div><div><div><div><div><div><p><a href='http://perch.is' rel='nofollow'>Perch</a> is a progressive design and development shop based in Little Rock, Arkansas. We’re currently celebrating our 4th birthday (we just got through the terrible 2s/3s and are finally to the point that we’re feeding ourselves and only intermittently wetting the bed…). The core of what we do is designing and developing beautiful things for humans. That translates to everything from marketing websites, UI/UX design, web apps, and a little bit of everything in between. Our clients range from startups to mom-and-pop shops to mid- to large-sized companies. Ultimately, we do all things web in order to serve the needs of our clients. We have a roster of great clients, but we’ve felt the pinch as both us and our clients have grown.</p><p>That’s where you come in.</p><p>&nbsp;</p><p><strong>Who, What, Why: We’re not unicorn hunters, but…</strong></p><p>We’re looking for a remote, experienced developer whose primary skills are in Wordpress/PHP. The vast majority of our projects are built using Wordpress, so this is a core, must-have, demonstrable skill. Most of our projects have a pretty significant amount of custom back-end and database work, so we need more than just a really great front-end dev who knows how to build Wordpress sites.</p><p>&nbsp;</p><p>Here’s the thing, front-end developers — we’ve got nothing but love for you. We really do. No doubt, we very much need someone with an eye for and proficiency in front-end development, but it’s not the <em>primary</em> skillset we need.</p><p>&nbsp;</p><p>Dare we use the elusive “full-stack developer” word here… Here’s the thing: we’re not searching for a unicorn or a mythical creature in the forest, but we do certainly need a developer who has a handle on all facets of the development process: from server management to databases to interacting/using APIs to both front- and back-end development. We know there’s a lot of awesome devs out there who possess these skills (because we’ve had some that have been been part of our team!) and that’s what we’re looking for now.</p><p><strong>&nbsp;</strong></p><p><strong>Small Shop, Big Perks</strong></p><p>From the very beginning of Perch, we’ve really focused on creating a company culture where people want to work. One of the ways we do that is by providing some pretty sweet perks. Here’s a few of the biggies:</p><ul><li>Fridays off (yep, a true 32-hour work week)</li><li>You pick bonus compensation: 2% bonus in December (first year) OR 2% added to salary (on hire)</li><li>Generous time off policy: 12 discretionary days</li><li>New MacBook Pro</li><li>Work from anywhere &amp; relatively flexible hours</li><li>Super laid-back, casual environment</li><li>No meticulous time-tracking (woo hoo!)</li></ul><p>(Here’s some fine print: If you’re looking for health benefits or a 401k, we’re not quite there in terms of the life of our company. BUT…we think some of the other perks we offer help to sweeten the deal.) <strong>&nbsp;</strong></p><p>&nbsp;</p><p><strong>The Basics: Required Skills/Qualifications</strong></p><ul><li>Demonstrable experience building WordPress themes/plugins</li><li>Understanding of all things WordPress: WP installation, coding &amp; security best practices, Custom Post Types, Advanced Custom Fields, etc</li><li>PHP, Sass and/or LESS, CSS3, HTML5, MySQL, JavaScript (jQuery is generally sufficient)</li><li>LAMP server management and domain management</li><li>Git version control</li><li>Comfortable using (or willing to learn) Sketch (for design hand-off)</li></ul><p>&nbsp;</p><p><strong>Day-to-day: What You’d Actually Be Doing</strong></p><ul><li>Building custom websites, web apps, etc (front-end and back-end)</li><li>Working alongside design to plan and execute projects</li><li>Handling existing support tickets/issues</li><li>Supporting existing sites/projects</li><li>Managing dev and production servers</li><li>Domain management</li><li>Training clients (CMS)</li><li>Collaborating on estimates/proposals</li></ul><p>&nbsp;</p><p><strong>When you Apply</strong></p><p>This is your opportunity to stand out. Please let us know you care. We’re a small team, so finding someone we can relate to and feel good about working alongside makes a huge difference. And knowing you actually want this position is a big bonus.</p><p>If that’s you, please submit the following:</p><ul><li>An introduction to yourself. It doesn’t have to be a novella, but a little something about where you live, what you like to do, and why development excites you will go a long way.</li><li>Link to your portfolio and/or examples of your work (both front- and back-end work)</li><li>Link to your resumé (primarily to show work history)</li><li>Salary requirement</li><li>A link to the weirdest/dumbest/most awesome thing you’ve seen online lately. (For example, <a href='https://www.youtube.com/watch?v=nfxpwbWBNuU' rel='nofollow'>this piece of cinematic excellence</a>.)</li></ul></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Feb 12, 2018 11:22:51 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "hNq_iUtzQiysReLjtC6qsQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30298?r=rss2",
    "title": "Perch: Web Developer (PHP - Wordpress)",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><p><a href='http://perch.is' rel='nofollow'>Perch</a> is a progressive design and development shop based in Little Rock, Arkansas. We're currently celebrating our 4th birthday (we just got through the terrible 2s/3s and are finally to the point that we're feeding ourselves and only intermittently wetting the bed…). The core of what we do is designing and developing beautiful things for humans. That translates to everything from marketing websites, UI/UX design, web apps, and a little bit of everything in between. Our clients range from startups to mom-and-pop shops to mid- to large-sized companies. Ultimately, we do all things web in order to serve the needs of our clients. We have a roster of great clients, but we’ve felt the pinch as both us and our clients have grown.</p><p>That’s where you come in.</p><p>&nbsp;</p><p><strong>Who, What, Why: We're not unicorn hunters, but…</strong></p><p>We're looking for a remote, experienced developer whose primary skills are in Wordpress/PHP. The vast majority of our projects are built using Wordpress, so this is a core, must-have, demonstrable skill. Most of our projects have a pretty significant amount of custom back-end and database work, so we need more than just a really great front-end dev who knows how to build Wordpress sites.</p><p>&nbsp;</p><p>Here’s the thing, front-end developers — we've got nothing but love for you. We really do. No doubt, we very much need someone with an eye for and proficiency in front-end development, but it's not the *primary* skillset we need.</p><p>&nbsp;</p><p>Dare we use the elusive &quot;full-stack developer&quot; word here… Here's the thing: we're not searching for a unicorn or a mythical creature in the forest, but we do certainly need a developer who has a handle on all facets of the development process: from server management to databases to interacting/using APIs to both front- and back-end development. We know there's a lot of awesome devs out there who possess these skills (because we've had some that have been been part of our team!) and that's what we're looking for now.</p><p><strong>&nbsp;</strong></p><p><strong>Small Shop, Big Perks</strong><strong></strong></p><p>From the very beginning of Perch, we’ve really focused on creating a company culture where people want to work. One of the ways we do that is by providing some pretty sweet perks. Here’s a few of the biggies:</p><ul><li>Fridays off (yep, a true 32-hour work week)</li><li>You pick bonus compensation: 2% bonus in December (first year) OR 2% added to salary (on hire)</li><li>Generous time off policy: 12 discretionary days</li><li>New MacBook Pro</li><li>Work from anywhere &amp; relatively flexible hours</li><li>Super laid-back, casual environment</li><li>No meticulous time-tracking (woo hoo!)</li></ul><p>(Here's some fine print: If you're looking for health benefits or a 401k, we're not quite there in terms of the life of our company. BUT…we think some of the other perks we offer help to sweeten the deal.)<strong>&nbsp;</strong></p><p>&nbsp;</p><p><strong>The Basics: Required Skills/Qualifications</strong></p><ul><li>Demonstrable experience building WordPress themes/plugins</li><li>Understanding of all things WordPress: WP installation, coding &amp; security best practices, Custom Post Types, Advanced Custom Fields, etc</li><li>PHP, Sass and/or LESS, CSS3, HTML5, MySQL, JavaScript (jQuery is generally sufficient)</li><li>LAMP server management and domain management</li><li>Git version control</li><li>Comfortable using (or willing to learn) Sketch (for design hand-off)</li></ul><p>&nbsp;</p><p><strong>Day-to-day: What You’d Actually Be Doing</strong></p><ul><li>Building custom websites, web apps, etc (front-end and back-end)</li><li>Working alongside design to plan and execute projects</li><li>Handling existing support tickets/issues</li><li>Supporting existing sites/projects</li><li>Managing dev and production servers</li><li>Domain management</li><li>Training clients (CMS)</li><li>Collaborating on estimates/proposals</li></ul><p>&nbsp;</p><p><strong>When you Apply </strong></p><p>This is your opportunity to stand out. Please let us know you care. We’re a small team, so finding someone we can relate to and feel good about working alongside makes a huge difference. And knowing you actually want this position is a big bonus.</p><p>If that’s you, please submit the following:</p><ul><li>An introduction to yourself. It doesn’t have to be a novella, but a little something about where you live, what you like to do, and why development excites you will go a long way.</li><li>Link to your portfolio and/or examples of your work (both front- and back-end work)</li><li>Link to your resumé (primarily to show work history)</li><li>Salary requirement</li><li>A link to the weirdest/dumbest/most awesome thing you’ve seen online lately. (For example, <a href='https://www.youtube.com/watch?v=nfxpwbWBNuU' rel='nofollow'>this piece of cinematic excellence</a>.)</li></ul><p></p><p><strong>Job Perks:</strong> Fridays off (yep, a 32-hour work week) • You pick compensation: 2% bonus in December (first year) OR 2% added to salary (on hire) • Generous time-off policy • New MacBook Pro • Work from anywhere • No meticulous time-tracking (woo hoo!)</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Feb 12, 2018 10:46:09 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "tlQkb1HkQ4iZMdNo-_Hvyw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/kickboard-lead-engineer",
    "title": "Kickboard: Lead Engineer",
    "content": "<div>  <div>    <h2>Lead Engineer</h2>      <h4>Posted Feb 12</h4>    <h3>      <span>Kickboard</span><br>      <span>Headquarters: New Orleans</span><br>        <a href='https://www.kickboardforschools.com/careers/apply/lead-engineer' rel='nofollow'>https://www.kickboardforschools.com/careers/apply/lead-engineer</a>    </h3>  </div></div>  <div>    <div><span></span></div><div><span>At Kickboard, we’re looking for an ambitious, thoughtful and experienced software engineer to lead our growing engineering team. In this role, you’ll be fully responsible for the engineering side of our company, including engineering process, architecture, team management, recruitment, and growth.</span></div><div><br></div><div>&nbsp;</div><div><br></div><div><span><b>This could be a perfect fit if...</b></span></div><div><br></div><ul><li><span>You enjoy the technical challenge of improving the quality and architecture of a legacy PHP codebase to meet the needs of modern software applications</span><br><br></li><li><span>The opportunity to step into a leadership role, to help fellow engineers develop new skills and advance in their careers, and still be able to roll up your sleeves and write code alongside your team excites you</span><br><br></li><li><span>Your team describes you as someone who knows when to let them work through problems, when to jump in to help, and what questions to ask to create clarity and forward motion</span><br><br></li><li><span>You want to build technology that helps educators create transformative learning environments for their students</span><br></li></ul><div><br></div><div><span>Kickboard works to give educators the tools they need to create safe and happy schools where students and staff thrive. Promoting equity is a priority for Kickboard both internally and within the schools we serve, and we are intentional about creating a diverse and inclusive environment for teammates to do their best work. </span></div><div><br></div><div><b><span>Respons</span><span>ibilities:</span></b></div><ul><li><span>In the first 12 months, you’ll likely spend 75% of your time on software development, and 25% on people and process management. That ratio should shift in year 2.</span><br><br></li><li><span>Write code every day. Develop, test, and deploy features across the entire stack</span><br><br></li></ul><ul><li><span>Manage the agile development process </span><br><br></li><li><span>Lead the charge on automation, continuous integration, and security</span><br><br></li><li><span>Lead a distributed team of full stack engineers</span><br><br></li><li><span>Recruit, build and scale the engineering team, with support from HR</span><br><br></li><li><span>Shape and define the engineering culture </span><br><br></li><li><span>Collaborate closely with our product team to define, plan, and prioritize our product roadmap</span><br><br></li><li><span>Network externally and attend/present/host at local meetups and national conferences to help build our brand awareness </span><br><br></li></ul><div><span><b><br></b></span></div><div><span><b>Your technical expertise includes…</b></span></div><div><br></div><div><span><i>If you have some but not all of this experience, we encourage you to apply anyway.</i></span></div><div><br></div><ol><li><span>Developing, maintaining and scaling SaaS web applications using an Object Oriented framework and typical database infrastructure</span><br><br></li><li><span>Developing with PHP especially around web APIs</span><br><br></li><li><span>Developing with Javascript with proficiency supporting front end frameworks such as React.js and Angular.js</span><br><br></li><li><span>Migrating services to AWS or similar cloud services</span><br><br></li><li><span>Familiarity with administering Linux based cloud hosted servers</span><br><br></li><li><span>Adoption of continuous integration and automated deployment</span><br><br></li><li><span>Working with git or other version control software </span><br><br></li><li><span>Enthusiasm for incorporating testing methodologies</span><br></li></ol><div></div><div><br></div><div><span><b>Your management/leadership expertise includes...</b></span></div><div><br></div><ol><li><span>Leading agile/scrum teams</span><br><br></li><li><span>Taking complex ideas/features and creating realistic plans/schedule for team to adhere to </span><br><br></li><li><span>Technical planning and drafting technical requirements from business requirements &nbsp;</span><br><br></li><li><span>Performing code reviews to ensure quality for entire project</span><br><br></li><li><span>Keeping a remote team on the same page and motivated</span><br><br></li><li><span>Mentoring and growing a team of high-achieving, curious engineers </span><br><br></li></ol><div>&nbsp;</div><div><br></div><div><span><b>Benefits:</b></span></div><div><br></div><ul><li><span>Competitive salary and stock options</span><br><br></li><li><span>Work alongside colleagues who love to learn and grow</span><br><br></li><li><span>Comprehensive health insurance plan</span><br><br></li><li><span>401(k) retirement plan</span><br><br></li><li><span>Generous parental leave policy</span><br><br></li><li><span>Three weeks paid vacation plus 10 company holidays</span><br></li></ul><div><br></div><div><span><b>How to apply:</b></span></div><div><br></div><div><b>Please submit your resume and a cover letter that addresses the following:</b></div><div><b><br></b></div><ol><li><b><span>Why you want to be Lead Engineer at Kickboard</span><br></b><br></li><li><span><b>The team you’re most proud of supporting, and your role in helping it succeed</b></span><br></li></ol><div></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div><span><b>Equal Opportunity Employer</b></span></div><div><br></div><div><span>Kickboard is a strong team because of the diverse backgrounds of our staff. This includes professional background, domain expertise, culture, race/ethnicity, sexual orientation, gender identity and expression, language, political beliefs, and hobbies. We strongly encourage women, minorities, and people from underrepresented backgrounds to apply. Kickboard will consider for employment qualified applicants with arrest and conviction records, pursuant to applicable law.</span><span></span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://www.kickboardforschools.com/careers/apply/lead-engineer' rel='nofollow'>https://www.kickboardforschools.com/careers/apply/lead-engineer</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 12, 2018 7:56:42 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet",
      "frontend",
      "php"
    ]
  },
  {
    "id": "M5uT1GlqRS-7AcnZD0l_Ew",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/66099/php-developer-devops-at-leading-investment-banking-based-fintech-at-issufy/",
    "title": "PHP Developer - DevOps at leading investment banking based fintech",
    "content": "PHP Developer - DevOps at leading investment banking based fintech<br /><br />This is a fantastic opportunity to be at the cutting edge of financial technology with a team that is leading the development of the investment banking industry. Issufy is a fast growing and innovative financial technology startup company operating in the investment banking space with a unique and sophisticated product base. We deal with the largest banks and asset managers in the world. Based in Central London (City area), we have a leading team comprised of leading investment bankers, investment professionals and technologists. This is a full time role is based in Central London – please do not apply if you are not based in London (or are willing to relocate to London).<br /><br />As an Issufy professional you will help take the lead in managing the software development process from specification to development, testing and stakeholder sign-off to deployment, working with a PHP, Java, JavaScript and SQL based tech stack. We are passionate about making sure we work in a technology-driven environment and you will have the chance to work with senior leadership and exert a great deal of influence on the technical future. For the successful candidate, and with time, there are significant potential leadership opportunities available in a fast paced, high intensity environment with lots of learning.<br /><br />As the successful Issufy-er, your day-to-day will include:<br />    Working on secure web applications and robust systems in investment banking. <br />    Improving existing applications by enhancing cloud performance, security, reliability. <br />    Building scalable deployment pipelines to allow rapid software release - all whilst up skilling yourself with technologies such as Docker and cloud<br />    Designing scalable and maintainable components of technical solutions to meet customer. functional/non-functional requirements. Working on an agile, cross-functional team consisting of developers, testers, business consultants, UE consultants, and PMs.<br />    Working with the latest in cloud infrastructure and helping maintain and monitor Issufy’s cloud infrastructure.<br /><br />As our ideal Issufy-er, you will have:<br />    At least 2-3 years of professional working experience<br />    Good understanding of command line with linux/ubuntu and Amazon Web Services (AWS)<br />    Experience with LAMP stack, Elastic search and Caching Technologies<br />    Good experience of managing PostgreSQL backup, recovery and security. Experience in optimizing existing database queries. <br />    Experience with GIT<br />    Knowledge of Elastic Beanstalk and experience of CI/CD and continuous testing activities<br />    Experience designing, developing, and consuming RESTful APIs.<br />    Good web application development experience with experience working on legacy code.<br />    knowledge/experience with OOP (object oriented programming) in PHP.<br />    Good understanding of MVC frameworks such as Laravel 5.x.<br />    Excellent communication skills, both written and verbal.<br /><br />Nice to have, but non-essentials:<br />    Experience with JavaScript frameworks such as AngularJS.<br />    TDD (Test Driven Development) knowledge using PHPUnit.<br />    Knowledge of programming patterns / practice.<br />    Experience of working with remote team<br />For more information please contact us and ask for Nawaz or Latif on 020 8528 1819 or info@issufy.co.uk<br />",
    "urlFetchPending": false,
    "published": "Feb 11, 2018 4:14:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "V3DJCozsRJaasALqThBmfA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/167488/backend-developer-lingoda-gmbh?a=UayyDyrnzFe",
    "title": "Backend Developer at Lingoda GmbH (Berlin, Germany)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>eLearning, Language Services, Online Education</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Who are we looking for?</strong></p><p>We are looking for an outstanding Backend Developer to be part of our growing team. The position is full time working remotely from home or from our Berlin office. Do you have experience in the following?</p><ul><li>You love developing software and you love to learn every day</li><li>You have at least 3 years of solid experience creating web applications using PHP, Symfony, Doctrine</li><li>You know how to rebase, merge and fork in Git</li><li>You are passionate about code quality. Writing tests and documentation belong to your natural workflow</li><li>You have experience working in an agile team using SCRUM, Kanban or similar methodologies</li><li>A history of active contributions to open source projects is a plus.</li></ul><p><strong>What do we offer?</strong></p><ul><li>A dynamic and highly motivated team and flat hierarchies</li><li>Use of Open Source technologies (all of our team members are regular contributors to the Open Source community)</li><li>Regular technical exchange with other Berlin-based startups</li></ul><p><strong>How to apply?</strong></p><ul><li>Send your application, including CV and references of previous projects to <a href='mailto:it-jobs@lingoda.com' rel='nofollow'>it-jobs@lingoda.com</a></li></ul>                    </div>                            <h2>                About Lingoda GmbH            </h2>            <div><p>Lingoda is the market leader of live language classes with real teachers. Our mission is to shape the future of language learning by making it easier and more accessible. Our students take online classes, whenever and wherever they want. Currently, we offer German, Spanish, French and English classes.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work remotely                            </div>                            <div>                                 Free language classes                            </div>                            <div>                                 Regular social events                            </div>                            <div>                                 Free coffee                            </div>                            <div>                                 Relocation support                            </div>                            <div>                                 Friendly working hours                            </div>                            <div>                                 Opportunities to grow                            </div>                            <div>                                 A vibrant international team from over 24 different nationalities                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 10, 2018 9:59:56 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "ggI0Q2LaQleMRhlzHo1rKQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16346011",
    "title": "SEEKING FREELANCER LOCATION: Remote, Eastern Europe or Asia time zone ROLE: Senior full-stack PHP developer SKILLS: PHP, ...",
    "content": "<div>                  <span>SEEKING FREELANCER<p>LOCATION: Remote, Eastern Europe or Asia time zone</p><p>ROLE: Senior full-stack PHP developer</p><p>SKILLS: PHP, JavaScript, HTML, CSS/SASS, Scala (optional)</p><p>DETAILS: Looking for a developer with backend PHP and frontend JavaScript experience. Extremely interested in developers with experience or with an interest in learning Scala.</p><p>Ability to work both in a team setting and independently is very important. Developer will be joining a widely distributed team but will be expected to work roughly normal business hours in his/her time zone. Occasional late-night or early-morning meetings may be required, but not often.</p><p>Especially interested in developers based in Europe and Asia-Pacific time zones. This is a full-time (~40h/week) freelance position that is expected to last most of 2018.</p><p>CONTACT: cmiller11101@gmail.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 10, 2018 8:00:03 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "RFMzIKF2Q-OPoC44rNGKWg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4129-full-stack-wordpress-developer-pt-to-ft-agtech-guide",
    "title": "Full Stack Wordpress Developer (PT to FT) @ AgTech Guide",
    "content": "<h2>              Full Stack Wordpress Developer (PT to FT)<small> @ AgTech Guide</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-10 05:14</p></dd>          <dt><span>Description</span></dt>          <dd><h3>About AgTech Guide</h3><p>We are an independently funded company, building an agriculture technology (AgTech) information, data and review platform for the $7 Trillion food &amp; agriculture industry. You can think of it as TripAdvisor for farm technology (with some elements of consumer reports, wirecutter and many other review sites).</p><h3>The Work</h3><p>We are looking for a developer to come onto our project part-time / half-time. There is opportunity to move to full-time as well based on mutual fit. We require a minimum availability of 15 hours per week.</p><p>Our wordpress site is a <strong>Custom</strong> Wordpress <strong>Genesis framework</strong> theme, some familiarity with Genesis is absolutely required.</p><p>We have many many things to build, fix and design on front and back end. Some include - Payment, Subscription management, permissions, dynamic layouts pulling in information from related post types (we're using ACF), and much more.</p><p>There are many things to style as we build them. We hope you can handle the small things front end, and we'll hire a front-end dev / designer to pair you with for more advanced design.</p><h3>Benefits</h3><ul><li>Pay is competitive based on skill level, experience, location, time zone and availability</li><li>For Part-time, we'll set a fixed number of hours per month and pay weekly or bi monthly, plus do an optional overtime rate.</li><li>We believe in flexibility and high quality of life. All we care about is that quality work gets done and that we communicate effectively.</li></ul><h3>Requirements:</h3><ul><li>Proficient in English</li><li>Minimum of 5 total years coding, minimum 3 years experience coding skills with WordPress</li><li>Experience with Genesis Framework</li><li>Experience developing custom themes, custom post types and creating custom plugins</li><li>Professional level backend and frontend coding skills</li><li>Experience with wordpress at scale</li><li>Excellent knowledge of mysql and managing databases for WP optimization</li><li>An excellent knowledge of PHP</li><li>Good knowledge of JS and jQuery</li><li>Ability to work with Git</li><li>Experience creating, building and working with APIs</li><li>Knowledge in WordPress security and optimization</li><li>Excellent time management skills and ongoing communication about how things are going relative to deadlines</li><li>Strong oral and written communication skills in English</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>We just need to have 2 hours overlap at some point each day. We are on MST in Denver, Colorado.</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 9, 2018 8:57:57 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "ZybMIBj7RR6632BiGGJ9KA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/659-backend-developer",
    "title": "Backend Developer",
    "content": "Backend Developer - Jobmote<div><div><h2>Backend Developer</h2><h5>Lingoda GmbH</h5></div></div><div><div><div><div><div><p><strong>Who are we looking for?</strong></p><p>We are looking for an outstanding Backend Developer to be part of our growing team. The position is full time working remotely from home or from our Berlin office. Do you have experience in the following?</p><ul><li>You love developing software and you love to learn every day</li><li>You have at least 3 years of solid experience creating web applications using PHP, Symfony, Doctrine</li><li>You know how to rebase, merge and fork in Git</li><li>You are passionate about code quality. Writing tests and documentation belong to your natural workflow</li><li>You have experience working in an agile team using SCRUM, Kanban or similar methodologies</li><li>A history of active contributions to open source projects is a plus.</li></ul><p><strong>What do we offer?</strong></p><ul><li>A dynamic and highly motivated team and flat hierarchies</li><li>Use of Open Source technologies (all of our team members are regular contributors to the Open Source community)</li><li>Regular technical exchange with other Berlin-based startups</li></ul><p><strong>How to apply?</strong></p><ul><li>Send your application, including CV and references of previous projects to <a href='mailto:it-jobs@lingoda.com' rel='nofollow'>it-jobs@lingoda.com</a></li></ul></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Feb 8, 2018 6:21:22 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "NZ5RFTzcR_WSsfIzvgegQA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/help-scout-php-engineer",
    "title": "Help Scout: PHP Engineer",
    "content": "<div>  <div>    <h2>PHP Engineer</h2>      <h4>Posted Feb  7</h4>    <h3>      <span>Help Scout</span><br>      <span>Headquarters: remote</span><br>        <a href='http://www.helpscout.com/careers' rel='nofollow'>www.helpscout.com/careers</a>    </h3>  </div>    </div>  <div>    <div>PHP is at the heart of Help Scout’s web app. It touches nearly everything, and also powers our back-end administration application. Your work will empower over 8,000 businesses around the world to provide great customer service, and will support other senior engineers on your team.</div><div></div><div><br></div><div><h4>Tools we use</h4></div><ul><li>PHP 7.x</li><li>Lumen, Laravel, and Symfony</li><li>Backbone.js, Marionette.js, and React.js</li><li>Node.js</li><li>RabbitMQ</li><li>Redis</li><li>Pusher</li><li>Java(APIs)</li><li>MySQL, PostgreSQL, and MongoDB</li></ul><div><h4>About the role</h4></div><ul><li>The engineering team currently has thirty-four talented engineers. &nbsp;You will be working on one of the Help Scout web app teams, which currently has 6 engineers (PHP, JavaScript). On a typical day you may help a customer with an issue, work on a new feature, create a third party integration or enhance back-end tools to support our growth team. On any given project, you will be communicating with internal APIs, integrating with 3rd party services, optimizing processes using Redis, RabbitMQ, various AWS services, and wrapping it all up in support of a Backbone/Marionette or React front end.</li><li>Our engineering teams work in two-week iterations, communicate mostly via Slack and are committed to&nbsp;<a href='https://www.helpscout.net/blog/agile-remote-teams/' rel='nofollow'>remote, agile development</a>. When you are ready, you’ll create and send a pull request with test cases and tag your team for review (often over a video and screen-sharing session).&nbsp;</li><li>We have invested heavily in local Docker development and cloud-based continuous integration and delivery so you can get setup fast and your development branch can be easily tested on environments that closely match production. You’ll work autonomously for the most part and we trust you to get work done when/where you can be productive.</li><li>Your team performs engineering support when a question can’t be answered by our top-notch in-house support team and passes triage. We’ll get you up-to-speed with engineering support so you can help our customers and improve the product along the way.</li></ul><div><h4>About you</h4></div><ul><li>You are very experienced with modern PHP development practices and open source frameworks. You’ve worked on these sorts of projects at scale and feel confident solving complex problems. You view “best practices” as a starting point for critical thinking, rather than a dogma to follow.&nbsp;</li><li>You have created a single page application using Backbone (or a similar framework) and can write JavaScript from scratch to implement a feature. Marionette and/or React experience is a bonus, but not required. We can help you pick it up.</li><li>Your code is not only reliable and performant for customers, but can be read, maintained and understood easily by other engineers on your team. The&nbsp;<a href='https://www.python.org/dev/peps/pep-0020/' rel='nofollow'>Zen of Python</a>&nbsp;resonates with you for any language.</li><li>You believe in writing unit and integration tests and have at least tried TDD. You like owning the quality of the code you write— QA doesn’t mean throwing it over the wall for someone else to test. You understand that some things are too costly to automate and must be manually tested to get it right.&nbsp;</li><li>You take pride in your work and ownership of the solutions you build. When a team member or customer is in need, you feel a sense of urgency to understand their pain and thoughtfully help.</li><li>You are curious and constantly learning. Believing that “a rising tide lifts all ships,” you make everyone around you better sharing what you have learned and looking for ways to improve both yourself and the team. &nbsp;</li><li>You are a humble professional who wants to be challenged by the work and not the workload. You are willing to ask for help when necessary and unafraid to say “I don’t know.” At the same time, you have the confidence to take on complex and challenging problems.</li><li>You are proactive about solving problems and improving things. You take the initiative to build tools and processes that will help everyone. When working in the codebase, you leave things better than you found them.</li><li>You are an excellent communicator who can write and speak with empathy for our customers and team. You can easily communicate complex ideas to both technical and non-technical audiences. Clear communication is super important in a remote culture like ours.</li><li>You believe remote teams are the future of work, or are at least excited about the idea. You have experience working with remote teams or can adjust your work/management style to be remote-friendly.</li><li>You can work anywhere in the world as long as you have 4+ hours of overlap time with Boston, MA (9AM- 6PM ET).</li></ul><div><h4>Benefits</h4></div><ul><li><span>Competitive Salary</span>- We pay at or above market salary in most cases and evaluate a lot of research to make sure everyone is paid well. The formula we use to calculate all salaries is public to employees and is improved upon regularly.</li><li><span>Work anywhere</span>- We’ll fly you to Boston for a week of new employee on-boarding and buy your home office furniture or help you pay for a co-working space. You can work anywhere in the world as long as you have 4+ hours of overlap time with Boston, MA (9AM- 6PM ET).</li><li><span>Health and dental insurance</span>- We cover you and your family's health/dental insurance 100%. If you are based in the US, we'll cover you on our Aetna policy.</li><li><span>Long-term/Short-term Disability Insurance &amp; Life Insurance</span>- we cover 100% of the premiums for LT/ST Disability insurance and base Life Insurance. You also have the option to purchase supplementary life insurance through our provider.</li><li><span>International Benefit Stipend</span>- If you’re based outside the US, you’ll receive a monthly stipend that goes towards covering medical insurance, long and short-term disability, and accountant costs.</li><li><span>Flexible vacation</span>- Take time off when you need it, we trust you.</li><li><span>Paid parental leave, including adoption</span>- 12 weeks if you have or adopt a baby, 4 weeks if your partner has a baby.</li><li><span>401k with 1% match</span>- 1% Retirement Plan matching for both US and International Employees</li><li><span>Personal development stipend</span>- Up to $1,800 per year to improve your craft</li><li><span>Great tools</span>- Each employee receives a Mac laptop and 27'' display (or equivalent). We’ll also purchase any of the software or hardware you need.</li><li><span>Complete transparency</span>- Everyone has full access to business metrics and financial information about the company.</li></ul><div></div><div><br></div><div><span>About Us</span></div><div><br></div><div>Help Scout is made by roughly 70 people in 40+ cities around the world, all with a passion for excellence in their craft.</div><div><br></div><div>We come from diverse backgrounds and are united by an enthusiasm for great products and delightful customer experiences.</div><div><br></div><div>Since launching in April of 2011, Help Scout now powers 8,000+ support teams in over 140 countries. Our&nbsp;<a href='https://www.helpscout.net/' rel='nofollow'>software</a>&nbsp;is used and trusted by businesses of every shape and size.</div><div><br></div><div><span>Designed to go the distance</span></div><div><br></div><div>Our mission is to foster the world’s customer-centric businesses by providing tools that serve customers in the most human, helpful way. While growth is important, team and values are paramount. We’re always striving to do impactful work we’re proud of in lieu of chasing overnight success.</div><div><br></div><div><span>We’re builders without borders</span></div><div><br></div><div>Our entire team is free to work remotely from wherever they choose. We overcome remote challenges through transparency, trust, and video conferencing. The reward is worth the effort—we’ll take talent, skill, and diverse perspectives over local geography any day.</div><div><br></div><div>Above all, we want Help Scout to be a place where passionate people can do their very best work. You won’t find any ping-pong tables or kegerators here. Instead, you’ll be surrounded by driven, supportive teammates who will push you to be better. We take work/life harmony seriously, too, as we want every career at Help Scout to be a long and satisfying one.</div><div><br></div><div><span>Diversity &amp; Inclusion</span></div><div>We are an equal opportunity employer and are committed to building a company that embraces and celebrates&nbsp;<a href='https://www.helpscout.net/blog/diversity-inclusion/' rel='nofollow'>diversity and inclusion</a>. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, or disability status.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://jobs.lever.co/helpscout/7926fad7-1fab-4018-95db-0fd7c27e7988' rel='nofollow'>https://jobs.lever.co/helpscout/7926fad7-1fab-4018-95db-0fd7c27e7988</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 8, 2018 12:07:04 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend",
      "php"
    ]
  },
  {
    "id": "XSVuEmvLQCqHokaTb-wTmw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workingnomads.co",
    "url": "https://www.workingnomads.co/jobs/senior-ui-developer-modern-tribe",
    "title": "Senior UI Developer",
    "content": "<p><strong>Modern Tribe</strong>&nbsp;is&nbsp;looking for a talented&nbsp;<strong>Frontend&nbsp;Developer</strong>&nbsp;to join our team.</p><p>We’re currently working on high-profile WordPress implementations that range between conventional to seriously bleeding edge. We will want to see plugin code examples – public plugins are ideal. We want people that are able to develop code that can withstand high profile sites and intense loads. You should be comfortable working as part of a team – your code will have to integrate into an existing architecture. If tightly optimized code get’s you excited – you’re probably a good fit.</p><p>Do you have a dog eared copy of&nbsp;<a href='http://ejohn.org/blog/secrets-of-the-javascript-ninja-released/' rel='nofollow'>‘Secrets of the JavaScript Ninja’</a>&nbsp;beside your bed? Would you be excited to work on large scale WordPress projects that actually require your JavaScript&nbsp;skills? Would you be stoked to push the limits of where JavaScript and WordPress can play nicely together?</p><p>The opportunity calls for a mixed set of skills. We need someone with expert level CSS skills, impeccable WordPress experience, and solid JavaScript &amp; PHP skills. Experience building sites with extremely large loads is a plus. We like our stuff to run fast and smooth.</p><p><strong>Who We Are</strong></p><p><strong>Modern Tribe, Inc</strong>. is a rapidly growing software &amp; design company. We develop custom solutions for some of the world’s largest companies, government institutions and smaller growing organizations. We pride ourselves on our ability to bridge people and technology and to bring the passion and dedication of an entrepreneur to every project. Our team is composed of talented employees and freelancers around North &amp; South America (and a smattering across the globe).</p><p><strong>Who You Are</strong></p><p>We love working with each other because we have built a culture that suits us well. We work primarily with freelancers and coordinate their talents for large projects. To be on our team, you must be:</p><ul><li><strong>HAPPY&nbsp;</strong>Where there is a will, there is a way. Having a positive disposition allows us to achieve great things and to support each other.</li><li><strong>HELPFUL&nbsp;</strong>Always looking for ways that you can help others.</li><li><strong>CURIOUS&nbsp;</strong>It is essential that you have a passion for learning. Technology changes daily, and life has a way of constantly raising the bar.</li><li><strong>ACCOUNTABLE&nbsp;</strong>Our clients expect us to get the right thing done on budget and on time. Communicating expectations and meeting them is the cornerstone of success.</li></ul><p><strong>Personal Competencies</strong></p><ul><li>Strong communication skills</li><li>Experience working as part of a remote team</li><li>Self-motivated, detail-oriented</li><li>Strong organizational skills</li><li>A methodical approach to all tasks</li><li>Ability to prioritize workloads and meet deadlines</li><li>Fluent English speaker</li></ul><p><strong>Knowledge &amp; Experience</strong></p><ul><li>Experience with LESS or Sass</li><li>Experience with es2015 and Babel</li><li>Comfort in advanced JavaScript projects</li><li>Mid level to advanced PHP Skills</li><li>GIT</li><li>Experience with extending and customizing the WordPress media manager and other JavaScript in the WordPress&nbsp;admin</li><li>Experience with API requests and parsing responses in JavaScript</li></ul><p><strong>Bonus Points</strong></p><ul><li>Knowledge of WordPress theming best practices</li><li>Examples of plugins / code that you’ve released to the open source community</li><li>Proficiency at local environment development</li><li>Experience with JavaScript templating. We like: Angular, Backbone, Handlebars, React and Underscores templating. Basically we hope you will be pro at one of the many different templating options out there right now.</li></ul><p><strong>Responsibilities</strong></p><ul><li><strong>ARCHITECT&nbsp;</strong>Work with design team to architect and document theme solutions using best practices</li><li><strong>ADAPT&nbsp;</strong>Integrate code into existing theme architecture</li><li><strong>COLLABORATE&nbsp;</strong>Coordinate with designers, back-end developers and other theme devs</li><li><strong>PERFORM&nbsp;</strong>Produce code solutions that load quickly and smoothly</li><li><strong>REVIEW&nbsp;</strong>Be a part of QA team and optimize / review other team members’ code</li></ul><p><strong>Location</strong></p><p>Work from anywhere in&nbsp;<strong>North, Central or South America</strong>. Please do not apply if your timezone is outside of the US range and if you are not totally fluent in English. You just need a computer and a strong wifi signal to support daily video chats with the Tribe.</p><p><strong>Compensation</strong></p><p>Pay range is between&nbsp;<strong>$50-$80</strong>&nbsp;US per hour commensurate with qualifications and experience. We are currently looking for both&nbsp;<strong>Full Time</strong>&nbsp;devs and&nbsp;<strong>freelance contractors</strong>&nbsp;about&nbsp;<strong>15-20 hours a week</strong>&nbsp;for this gig.</p><p><strong>Inclusion Statement</strong></p><p><strong>Modern Tribe is committed to a culture that embraces diversity and inclusion.</strong>&nbsp;We foster an environment of collaboration, open engagement, fairness and respect regardless of differences in age, race, disability, national origin, gender identity, religion, sexual orientation or veteran status. As a hybrid workspace ranging from distributed contractors to traditional employees, we value the unique perspectives and experiences of our global team.</p><p>We come from all walks of life. We are small business owners. We are tattoo aficionados and 80’s movie buffs and ex-pats. We are homeschool teachers. We are single parents. We are musicians, college drop-outs, and entrepreneurs. We are travelers, feminists, runners, volunteers, and makers. We are a Modern Tribe.</p><p>Everyday we strive to fulfill our motto: live well and do good work. We hope you will consider joining us.</p><p><strong>Perks</strong></p><p>We believe that distributed working&nbsp;is a way of life. We understand what it means to&nbsp;work remotely.&nbsp;We offer consistency in expectations, payment, and support. We believe in learning from each other and fostering personal growth. You can expect to learn a lot while working with us.</p><p>(Also, if you work enough with us, we’ll bring you on the&nbsp;<a href='https://tri.be/team-trip-2016/' rel='nofollow'>team trips</a>.)</p>",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 11:43:35 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "php"
    ]
  },
  {
    "id": "BGxYvFA2Tlqkqz-OiOXkJw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workingnomads.co",
    "url": "https://www.workingnomads.co/jobs/veteran-wordpress-developer-artbees",
    "title": "Veteran WordPress Developer",
    "content": "<p>Artbees is looking for a full-time Veteran WordPress Developer. We are specialized in building WordPress themes and plugins, so a strong familiarity and interest in WordPress and its platform is a must. Your major responsibility as a Full Stack Developer will be to extend the capabilities of WordPress by building tools and modules that will make website building a fun and interactive experience.If you’re passionate about WordPress, writing clean, well-documented code and are interested in tackling a series of new, exciting projects, we want to talk to you.</p><p><strong>REQUIREMENTS</strong></p><ul><li>Minimum of 5 years experience coding skills with WordPress</li><li>Professional level backend and frontend coding skills</li><li>Hands on custom WordPress development at scale</li><li>An excellent Knowledge of PHP</li><li>Deep understanding of WordPress architecture, developing custom themes, custom content types and creating custom plugins</li><li>Fluid knowledge of JavaScript (we do not mean jQuery, you must write great Vanilla JS)</li><li>Ability to work with Git</li><li>Ability to work with CI tools (Jenkins, Ansible)</li><li>Experience creating, building and working with APIs</li><li>Knowledge in WordPress security and optimization</li><li>Familiar with Agile and Scrum workflows</li><li>Excellent time management skills</li><li>Strong oral and written communication skills in English</li><li>Have had a team work experience (with developers and QA team)</li></ul><p>&nbsp;</p><p><strong>Responsibilities</strong></p><ul><li>Design, develop, and maintain the technical architecture of applications</li><li>Ability to quickly shift between multiple projects and technologies</li><li>Must be highly organized; capable of developing and meeting the project deadline</li><li>Write clean code and test it throughout the development process to ensure the top-tier quality</li></ul><p><strong>BENEFITS</strong></p><ul><li>Competitive salaries</li><li>We cover the cost of your learning materials</li><li>Flexible and fair time off policy</li><li>Birthday surprises</li><li>Spotify subscription gifts</li></ul><p>* We need to learn about your most accomplished projects. If you do not have a well-developed LinkedIn profile or online presence, we expect a CV attached to your application or a link to your online portfolio.</p><p>* Your salary will be set up to $3.5K.</p><p><strong>We welcome on-site and remote applicants from all over the world with the exception of individuals living in or between the following time zones: UTC -10:00 and UTC -5:00.</strong></p>",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 11:23:09 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "T6XAYOj5QuKJmTsidUEAkQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4125-full-stack-wordpress-developer-artbees",
    "title": "Full-stack WordPress Developer @ Artbees",
    "content": "<h2>              Full-stack WordPress Developer<small> @ Artbees</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-06 21:00</p></dd>          <dt><span>Description</span></dt>          <dd><p>Artbees is looking for a full-time Veteran WordPress Developer. We are specialized in building WordPress themes and plugins, so a strong familiarity and interest in WordPress and its platform is a must. Your major responsibility as a Full Stack Developer will be to extend the capabilities of WordPress by building tools and modules that will make website building a fun and interactive experience.If you’re passionate about Wordpress, writing clean, well-documented code and are interested in tackling a series of new, exciting projects, we want to talk to you.</p><h3>Requirements</h3><ul><li>Minimum of 5 years experience coding skills with WordPress</li><li>Professional level backend and frontend coding skills</li><li>Hands on custom WordPress development at scale</li><li>An excellent Knowledge of PHP</li><li>Deep understanding of Wordpress architecture, developing custom themes, custom content types and creating - - - custom plugins</li><li>Fluid knowledge of JavaScript (we do not mean jQuery, you must write great Vanilla JS)</li><li>Ability to work with Git, CI tools (Travis, CircleCI,..)</li><li>Experience creating, building and working with APIs</li><li>Knowledge in WordPress security and optimization</li><li>Familiar with Agile and Scrum workflows</li><li>Excellent time management skills</li><li>Strong oral and written communication skills in English</li><li>Have had a team work experience (with developers and QA team)</li></ul><h3>Responsibilities</h3><ul><li>Design, develop, and maintain the technical architecture of applications</li><li>Ability to quickly shift between multiple projects and technologies</li><li>Must be highly organized; capable of developing and meeting the project deadline</li><li>Write clean code and test it throughout the development process to ensure the top-tier quality</li></ul><h3>Benefits</h3><ul><li>Competitive salaries</li><li>We cover the cost of your learning materials</li><li>Paid travel &amp; Accommodation to headquarters</li><li>Flexible and fair time off policy</li><li>Birthday surprises</li></ul><p>We need to learn about your most accomplished projects. we expect a CV attached to your application that explains what you were busy at in the past few years.</p><p><strong>We welcome on-site and remote applicants from all over the world with the exception of individuals living in or between the following time zones: UTC -10:00 and UTC -5:00.</strong></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Remote, except time zones between: UTC -10:00 and UTC -5:00.</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 6, 2018 10:47:27 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "S5qibKYNRB2htuuhrbIrvg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159480/write-quality-code-that-scales-as-our-new-backend-savvii-managed-wordpress?a=Ru2YERQCHbW",
    "title": "Write quality code that scales as our new backend dev at Savvii Managed WordPress Hosting (Nijmegen, Netherlands)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer, System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Services, Network Engineering, Web Hosting</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><em>Do words like GIT, Ruby, AMQP, Docker,&nbsp;PHP,&nbsp;Composer, PHP unit and Redis make your developer heart beat faster? Do these technologies hold few secrets for you and are you capable of converting ideas into working and secure applications? If so, then we want to meet you.</em></p><p>We are looking for a creative developer to develop and maintain our back-end systems and web applications. In this position, you will work as part of a professional and enthusiastic team on optimising and developing our REST API, provisioning tools, client portals, ordering systems and other (web-based) applications.</p><p><strong>Who are you?</strong></p><ul><li>Minimum higher vocational education (HBO) work and thinking level, with relevant work experience.</li><li>You are fluent in either PHP or Ruby and are willing to study other languages.&nbsp;Knowledge of Linux and WordPress is a prerequisite</li><li>Familiar with current (web) technologies such as Docker, Elasticsearch, Rails or AMQP. Knowledge of testing frameworks and deployment strategies.</li><li>A team player:&nbsp;Curious, enterprising and creative.</li></ul><p><strong>Job description</strong></p><ul><li>As a member of a team, you will work on automation, features and maintenance for a hosting platform with which we serve thousands of clients</li><li>You will work using Scrum tools to improve our platform in an agile manner</li><li>You believe in as much automation of processes as possible to ensure the highest possible level of uniformity and quality across the entire hosting platform</li><li>You can serve as a technical consultant for both internal departments and clients</li></ul><p><strong>You and Savvii</strong></p><p>Starting on your first day at the company, you will be an essential part of a professional team. Your future? You will shape your own future by continuously developing yourself and by proactively seizing opportunities. We believe that your added value is greatest if you enjoy your work. We consider personal development, responsibility and substantial challenges to be essential to ensure the enjoyment of the work. Because we give you the space to utilize your talents to their full extent and through the sparring opportunities with skilled colleagues, you will continually work on your own development.</p><p><strong>What makes it attractive for you to work for us?</strong></p><ul><li>Competitive salary that grows in tandem with your ambition</li><li>Informal work environment in a modern building equipped with lounge and roof terrace or a remote position</li><li>New Macbook Pro or Dell XPS laptop to enable you to work smoothly</li><li>Challenging work with your own responsibilities and growth potential</li><li>Training opportunities</li><li>Time to visit conferences</li><li>Time to contribute to Open Source</li><li>Time to experiment with new web technologies, such as in the form of hackathons</li><li>100% travel allowance when travelling by public transport</li><li>Supplemental: chair massage by a real professional, company fitness programme, free fruit and media library</li></ul>                    </div>                            <h2>                About Savvii Managed WordPress Hosting            </h2>            <div><p><strong>About your team</strong></p><p>Our dev team consists of 4 developers based in Nijmegen. We are also open to remote colleagues. Will you be the first of many new colleagues?</p><p>We believe in trying lots of new things, but in a way that is stable and scales across thousands of sites and servers. Things like TDD, (internal) penetration tests, code reviews and CI are our way of guaranteeing code quality.</p><p>There is room to contribute to Open Source projects, visit conferences and enhance your public speaking skills.</p><p>We are working with SCRUM, the team has either control about scope or planning.</p><p>What unites us is a love of games, tinkering with computers and electronics and throwing the occasional LAN or VR party at the office.</p><p><strong>About Savvii</strong></p><p>Savvii is&nbsp;<em>the</em>&nbsp;Managed WordPress host in Europe. Only hosting, only WordPress. Full stop.</p><p>This focus enables us to offer our clients the best hosting. We innovate continuously in the area of speed, scalability, security and convenience.</p><p>Our company is made up of young people with a passion for technology, gadgets and the latest developments on the Internet. As an organisation, we place a high value on commitment and we ensure that you can demonstrate an entrepreneurial character. At our company, you are allowed to make mistakes. We are open about that: internally and towards our clients. We also believe in sharing: for example, we organise the WordPress meet-up Nijmegen, sponsor and organise WordCamps and we also speak at WordCamps and other conferences.</p><p>Are you the candidate that we’re looking for? If so, don’t wait any longer and apply. A Certificate of Good Behaviour [<em>Verklaring Omtrent Gedrag</em>] will also be required as part of the application procedure.</p><p>For more information, please contact Lisa Nellestijn, our HR advisor, at +31(0)24-3605040. Of course, you can always&nbsp;<a href='https://www.savvii.eu/contact/' rel='nofollow'>stop by</a>&nbsp;for a cup of coffee or tea to get an impression of the pleasant working atmosphere.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Chair Massage                            </div>                            <div>                                 Free fruit                            </div>                            <div>                                 Remote working                            </div>                            <div>                                 MacBook Pro's                            </div>                            <div>                                 Contribution to your sports and excercise costs                            </div>                            <div>                                 Attending conferences                            </div>                            <div>                                 Contributing to Open Source initiatives                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "ZUuF_j1rQ3ehbgI1VvDvpQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159591/php-entwickler-m-w-to-break-limits-in-inpsyde-gmbh?a=Rwm4E7B6DSg",
    "title": "PHP Entwickler (m/w) to break limits in WordPress! Liebe Herausforderungen! at Inpsyde GmbH ()",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise Web Solutions, Web Design, Web Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Du bist erfahrene/r oder talentierter Webentwickler/in auf den man sich verlassen kann, kennst dich mit objekt-orientierter PHP-Programmierung aus und möchtest zusammen mit anderen Top WordPress Entwicklern anspruchsvolle WordPress-Projekte mit höchster Code-Qualität im B2B-Bereich umsetzen?</p><p>Dann kannst du dir sicherlich vorstellen unter anderem an folgenden <strong>spannenden Projekten</strong> zu arbeiten:</p><ul><li>In einem mehrsprachigen WooCommerce-Shop mit Anbindung an externe Dienste wie zum Beispiel SAP Business One</li><li>Weiterentwicklung und Support bekannter freier Plugins (z.B. <a href='https://backwpup.de/' rel='nofollow'>BackWPup</a> oder <a href='https://multilingualpress.org/' rel='nofollow'>MultilingualPress</a>)</li><li>Gestalten/Entwickeln maßgeschneiderter hoch performanter und sicherer Plugins, Schnittstellen und Themes für unsere Kunden, Dienstleister und die Community</li></ul><p><strong>Dich erwartet:</strong></p><ul><li>arbeiten im Homeoffice (wir sind 100% Remote)</li><li>flexible Arbeitszeiten</li><li>sehr erfahrene WordPress Experten und Top SE User als Kollegen</li><li>als WordPress VIP Partner, direkter Draht zu WooCommerce und WP Core Entwickler</li><li>ganz nah am Puls der neuesten WordPress-Entwicklung und Technologien</li><li>spannende und außergewöhnliche Projekte</li><li>kleines Team in einem agilen Umfeld</li><li>wöchentlicher Wissenaustausch und Vorträge von Kollegen in einer Videokonferenz</li><li>tolle Kollegen, mit denen es jeden Tag Freude macht zusammenzuarbeiten</li><li>Besuche und Vorträge auf WordCamps und WooConf</li><li>flache Hierachien und kurze Entscheidungswege</li></ul><p>Eintrittsdatum: So schnell wie möglich. Aber bei guten Entwicklern warten wir gerne.</p><p>Klingt alles interessant für dich? Dann bewerbe dich jetzt inkl. deiner Gehaltsvorstellungen, frühestmögliches Eintrittsdatum, Link zu deinem GitHub Account damit wir uns deine Code-Qualität anschauen können!</p>                    </div>                            <h2>                About Inpsyde GmbH            </h2>            <div><p>Arbeite mit unserem tollen Team von WordPress Experten&nbsp;und Top Usern auf WordPress Stack Exchange zusammen. Tausche dich aus, lerne von Ihnen oder lass dich gemeinsam im Team zu Höchstleistungen verleiten.</p><p>Im Gegensatz zu gewöhnlichen Arbeitgebern <strong>arbeitest du bei uns remote</strong> an immer neuen Herausforderungen in der WordPress Welt, wo du willst – in der Nähe deiner Kaffeemaschine, im Park oder an deinem Lieblingsort. Das bedeutet auch, dass du deine Arbeitszeiten flexibel einteilen kannst.</p><p>Via Slack, Hangout und Zoom kommunizierst du mit deinen Kollegen, während du unter anderem mit deiner Hardware und deinem Lieblingskaffee deine Arbeitsumgebung selbst gestaltest.</p><p>Oder treffe dich mit Kollegen auf WordCamps, Meetups oder WooConfs weltweit um sich dort auch mit anderen Entwicklern auszutauschen oder im Auftrage der Firma Vorträge zu halten.</p><p>Entwickle WordPress Plugins oder Webseiten für internationale Firmen wie Facebook, Mercedes, Parship oder WooCommerce Erweiterungen für E-Commerce Größen wie PayPal. Aber auch für Mittelstandsunternehmen, die Webseiten oder Plugins nicht von der Stange benötigen.&nbsp;</p><p>Auch beteiligst du dich an der Mitarbeit an Plugins, die wir auf wordpress.org zur Verfügung stellen, wie zum Beispiel BackWPup mit über 5 Millionen Downloads und über 600.000 aktive User.</p><p>In kleinen Teams, einem Projektleiter und direktem Draht zum Chef kannst du dich und deine Ideen wertvoll einbringen.</p><p>Bewirb dich als PHP-Entwickler/in! Viele aufregende Möglichkeiten warten auf dich!</p><p>Werde Inpsyder!</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Homeoffice und flexible Arbeitszeiten - Wir Vertrauen unserem Team!                            </div>                            <div>                                 Keine langen Anfahrtszeiten! Vom Frühstückstisch in 1 Min. am Rechner!                            </div>                            <div>                                 28 Tage Urlaub                            </div>                            <div>                                 Immer in der Nähe der Familie um die man sich jederzeit kümmern kann.                            </div>                            <div>                                 Zuhause essen wo es am besten schmeckt anstatt labriges Kantinenfutter                            </div>                            <div>                                 Wir arbeiten mit Spaß! Flache Hierachien und gegenseitiger Respekt!                            </div>                            <div>                                 Nutzung der Tools deiner Wahl!                            </div>                            <div>                                 Kostenloses Spazierengehen, um den Kopf manchmal frei zu kriegen                            </div>                            <div>                                 Abwechslungsreiche Aufgaben mit speziellem Twist und Herausforderungen                            </div>                            <div>                                 Immer am Puls der WP-Entwicklung mit direkten Draht zu WP-Experten!                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "ZLlYXE4wRqagT1zA5xtF-g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/143266/software-developer-c-c-plus-plus-zf-friedrichshafen-ag?a=M2UyZA578RO",
    "title": "Software developer C/C++ at ZF Friedrichshafen AG (Pilsen, Tschechien)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Automotive, Autonomous Driving, Safety Technology</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>10k+ people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>WHY JOIN ZF?</strong></p><p>ZF operates a global network of technical centers worldwide where we employ engineers, researchers, designers and technicians. Our global network allows us to develop active and passive automotive safety technologies, while continuously improving existing products and systems.</p><p>Employees use sophisticated testing and computer simulation equipment. We have advanced engineering and research and development programs for next-generation products in all of our segments.</p><p>ZF is disciplined and innovative in our approach to research and development, employing various tools to improve efficiency and reduce cost, such as Six Sigma, &quot;follow-the-sun&quot; (a 24-hour a day engineering program that utilizes our global network) and other e-Engineering programs.</p><p>The safety technologies market is hot, and ZF is at the forefront. Come join the global leader in automotive safety and apply today!</p><p>The Software Team is responsible for the development and release of software for a number of high profile and challenging global applications with European, North American and Chinese vehicle manufactures. A senior software engineer is required to support this development striving for customer delight with timely deliveries, novel system functions and high quality software.</p><p><strong>Your task:</strong></p><ul><li>SW requirements analysis</li><li>SW design in UML language</li><li>Programming of systems of automotive components in C and C++</li><li>Programming of SW for testing support for those systems</li><li>Integration to customer products and laboratory testing</li><li>Problems monitoring, analysis and solving</li></ul><p><strong>Skills &amp; Requirements</strong></p><p><strong>Your profile:</strong></p><ul><li>Degree in a field of electronic, electrotechnic, applied science filed etc.</li><li>Knowledge of programming a single chip uC (SoC), electric drives and performing electronics</li><li>Good knowledge of English or German language</li><li>Knowledge of real-time SW development for automotive components is an advantage</li><li>Knowledge of C and C++ is an advantage</li></ul><p><strong>Are you interested?</strong></p><p>Please apply online with full application documents (Resume, motivation for the position, references and certificates) indicating your salary expectations and your earlist staring date.&nbsp;Questions in advance will be answered by Mr. Ondrej Pohanka.</p>                    </div>                            <h2>                About ZF Friedrichshafen AG            </h2>            <div><p><strong>We offer:</strong></p><ul><li>Trainings and workshops</li><li>A very interesting job – working on automotive future</li><li>Language lessons (English, German)</li><li>Flexible working hours</li><li>25 days of holidays</li><li>Home office</li><li>Annual bonuses</li><li>Annual salary raise</li><li>Benefits: commuting allowances, pension/life insurance allowances</li><li>Lunches in our amazing canteen</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible working time models                            </div>                            <div>                                 Numerous opportunities for professional development, training, expert                            </div>                            <div>                                 30 vacational days                            </div>                            <div>                                 Employees profit from various discounts                            </div>                            <div>                                 Christmas and Holiday Pay                            </div>                            <div>                                 Catering facilities on-site                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c",
      "php"
    ]
  },
  {
    "id": "zJier6sxSoqJeRYSQQ9vRQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/167088/full-stack-developer-telecommute-i-will-teach-you-to-be-rich?a=U2eTvD7TizC",
    "title": "Full Stack Developer (Telecommute) at I Will Teach You To Be Rich (New York, NY)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><em><strong>Live your Rich Life from anywhere. &nbsp;100% remote position. &nbsp;</strong></em></p><p><strong><span>The Giant Hairy Problem You'll Be Solving</span></strong></p><p>The best of all worlds: a development role in a startup environment without the risk of small organizations or the inflexibility of large ones.</p><p>We're looking for a seasoned full stack developer to join our team to create services that power incredible user experiences.</p><p>This could be a dream position for the right person. Read the description below to see if it's what you've been looking for and find out how to apply.</p><p><span><strong>You'll Work On Projects Like</strong></span></p><p>A Full Stack Developer at IWT is able to work in all parts of an application from backend services to middle tier and the front-end app. You will be developing new solutions to complex problems and work within our existing frameworks, while keeping an open mind to potential process improvements and scalability.</p><p>You will be a critical member of the engineering team; with that comes the responsibility of mentoring team members and establishing architectural principles and design patterns. You'll be translating functional requirements into functional applications. You'll be doing more than just bug hunting; you'll be proactively identifying bottlenecks and devising solutions to them.</p><p>You will also be interfacing with IWT's own home-grown solutions as well as with several third party API's. Expect to be immediately thrown into the deep end and getting into the code right away.</p><p>Compensation is commensurate with experience. Perks include health coverage, 401k with match, technology and education stipends, the ability to live anywhere in the US, and work with some of the most interesting people in the world.</p><p><strong>What We're Looking For</strong></p><p>At IWT we love hard problems that others&nbsp;can't&nbsp;solve,&nbsp;won't&nbsp;solve, or&nbsp;don't even want to try&nbsp;solving.&nbsp;&nbsp;We want to work with people&nbsp;who love big challenges, too.&nbsp;People who want to be the best they can possibly&nbsp;be and fight every day to make it happen.&nbsp;We call them top performers and we all share the same values:</p><ul><li>Obsessed with excellence</li><li>No ego</li><li>Outstanding communication</li><li>We drive results</li><li>Learn fast, grow fast</li><li>Be weird</li></ul><p>If you're a good fit for this opportunity, then you'll have:</p><ul><li>Broad Experience: You will be working in every aspect of the stack, from top to bottom in a variety of languages.<ul><li>Extremely comfortable in PHP and experience with Ruby</li><li>Intimately familiar with CakePHP or Rails</li><li>Lots of practical experience with&nbsp;HTML, CSS, JavaScript, and MySQL</li><li>Experience with AWS&nbsp;</li><li>Well rounded DevOps and performance tuning experience</li><li>Experience with Salesforce or Marketo is a definite plus</li></ul></li><li>Hands On: You are naturally curious and want to understand how things work. You also aren't afraid to get your hands dirty and don't want to pass things off as &quot;not my job&quot; when issue arise.</li><li>Agile: Able to work iteratively and a willingness to change priorities based on changing business dynamics</li><li>A vision for the future: A knowledge of industry best practices and an eye toward the future and improving our processes continuously.</li><li>Able to work remotely with your own phone, computer and high speed internet access in place.</li><li>This is a full-time, 100% remote position. Must be US based.</li></ul><p><strong>About Us</strong></p><p>For the past 13 years, we've quietly built a private company that has become one of the leaders in online education and self-developmentt. Over 1 million Top Performers read us every month for advice on money, entrepreneurship, careers, relationships, and personal productivity. &nbsp;We build no-BS personal-development brands that deliver real results. &nbsp;We tell the truth about how the world works -- even when it's uncomfortable to hear.&nbsp;We value trust over short-term sales. &nbsp;We're selective and demanding about who we serve. &nbsp;</p><p>We're a high performance team of exceptionally talented and diverse individuals, and we nurture each other's personalities, creativity and obsessions to bring forth unique content, products and services to the market. Our goal is to help millions of people live richer, more fulfilling lives. And it takes an entire team committed to something bigger than themselves to make that kind of impact.</p><p>We are seeking high caliber individuals who want to help push us to the next level. If you like to move quickly and have a bias for action, you'll fit right into our fast-paced, results-based environment. We're a 100% remote/virtual team environment where you can work from wherever you are. We're excited to work alongside the best in the world to make a difference in millions of people's lives.</p>                    </div>                            <h2>                About I Will Teach You To Be Rich            </h2>            <div>For the past 13 years, we’ve quietly built a private company that has become one of the leaders in online education and self-development. Over 1 million Top Performers read us every month for advice on money, entrepreneurship, careers, and relationships.            </div>        ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "php",
      "ruby"
    ]
  },
  {
    "id": "liBJF9uxSzqyg9G2bdY9MA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/166319/wordpress-engineer-xwp?a=TMfx13bv2so",
    "title": "WordPress Engineer at XWP (Remote, OR)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong><em>About XWP</em></strong><br></p><p>XWP provides complex, large-scale WordPress solutions. We are one of a select few WordPress.com VIP Featured Partners and have been endorsed by Automattic. XWP is a place where engineers find challenging work, service-focused and collaborative teammates, and opportunities to grow. We have a passion and enthusiasm for what we do and a sincere care for each other and our clients. We work remotely and are distributed globally.</p> <p>This is an invitation for the right person to join our growing group of WordPress Engineers and help us deliver exceptional client experiences. </p><p><strong><em>Your invitation awaits if you…</em></strong></p><ul> <li>Care deeply about the quality of your work and the experience you build for your teammates and clients</li> <li>Are often looked up to by other engineers, but wish to have teammates that you can learn more from technically to help you grow</li> <li>Enjoy the challenge of solving problems within time and requirements constraints that come with client engagements</li> <li>Find great satisfaction in writing smart code that embodies WordPress coding standards and best practices</li> <li>Want to be surrounded by people who champion your work, support you in solving project challenges, recognize your successes and celebrate them with you</li> <li>Actively push yourself to learn new technologies so that you grow as an engineer and serve better</li> <li>Get excited about contributing to open source and give back to the WordPress community</li> </ul><p><strong><em>As a WordPress Engineer you will...</em></strong></p><ul> <li>Contribute to a team culture that empowers each team member, and the team as a whole, to be our best, collaborate effectively, share knowledge and grow</li> <li>Actively seek a full understanding of the business and technical requirements for your areas of contribution</li> <li>Plan the best architectural approach to achieving desired outcomes, seek and implement feedback of the team on your plan</li> <li>Execute your plan by building plugins, themes, and extending WordPress Core through patches and feature plugins that embody best practices in PHP and JavaScript (OOP, separation of concerns, test-driven development, REST API services, etc)</li> <li>Support your team members with feedback, ideas, and through peer code review</li> </ul><p><strong><em>Success in the role looks like ...</em></strong></p><ul> <li>Clients who are delighted with the solutions and services you deliver</li> <li>Teammates who appreciate your timely communication and quality work</li> <li>You keep growing as an engineer and in your pursuit of excellence in service and craftsmanship</li> </ul><p><strong><em>You will enjoy...</em></strong></p><ul> <li>Trust and support from your colleagues (we look out for each other and work together towards our shared goals and vision)</li> <li>Rewards of a highly collaborative culture </li> <li>Joys of remote work: schedule flexibility, skip the commute, more time for family and interests outside of work</li> <li>The chance to play a part in helping XWP achieve its full potential and make a meaningful difference for our clients, team members and the WordPress community</li> </ul><p><strong><em>Are you intrigued?</em></strong><br></p><p><a href='https://xwp.workable.com/jobs/180134/candidates/new' rel='nofollow'>Apply now</a> and tell us about yourself, what this role will mean to you, and why you are who we want to work with.</p><p>If you don't believe you are who we are looking for, please share this with anyone you know who might be.</p><p><em>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em><br></p>                    </div>                            <h2>                About XWP            </h2>            <div><p>XWP is a leading provider of complex, large-scale WordPress solutions. We are one of a select few WordPress VIP Featured Partners, endorsed by Automattic as a quality service provider. </p><p>Our team is service-focused, results-driven and highly collaborative, combining our unique strengths and abilities and a passion and enthusiasm for what we do with a sincere care for each other and our clients. We work remotely and are distributed globally.</p><p>If you're interested in joining our team, please apply! (You'll find an Apply link at the bottom of each position page.) Each listed position represents either a current need or an area in which we are frequently hiring new team members.</p><p>Questions? Send them to join at xwp dot co.</p>            </div>        ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "990TBUZoSTiLptqUB9JTLA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/142249/linux-full-stack-developers-remote-development-vnn-inc?a=LHLuoQE2yeA",
    "title": "Linux Full Stack Developers (remote development) at VNN Inc (Grand Rapids, MI)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Education, E-Sports, Publishing</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>VNN is looking for experienced Linux full stack/PHP/Javascript Application developers. People who can make insightful, rapid, every-day decisions needed in a startup environment.</p><p>VNN enables athletic departments to leverage social technologies to promote their sports teams, in doing so crafting a unique and memorable experience for athletes. This person will be comfortable joining a small team leading that charge, based on a keen understanding of VNN’s business goals and strategy.</p><p>We need those who thrive on the pace of a start-up and embrace the many different roles they will have to play. Yet you will still be able to adapt processes and maintain strong design principles, making the trade-offs needed to meet timely delivery schedules.</p><p>While you’ll be responsible to work with a small team to ensure the successful execution of our technology strategy, you shouldn’t view yourself as a simple “developer”. Your success will also result from cultivating an ongoing relationship with operations, sales, marketing, technology partners, and advertisers leveraging those unique insights to craft user experience. Being able to work independently and in collaborative phases is a must.</p><p>While development is 100% a remote team, we prefer candidates who will travel to Grand Rapids, Michigan for the occasional in person planning meetings and company celebrations 2 or 3 times a year.</p><p><strong>Skills &amp; Requirements</strong></p><p>The ideal candidate can currently describe themselves or wish to develop into the type of software professional defined here: <a href='https://www.laurencegellert.com/2012/08/what-is-a-full-stack-developer' rel='nofollow'>What is a Full Stack Developer?</a></p><p>Preferred qualifications:</p><ul><li>4+ years experience application programming languages including PHP/MySQL&nbsp;</li><li>Ability to program in various scripting languages: Angular, React, Ansible, NodeJS, Javascript etc</li><li>Working knowledge of LAMP or equivalent Linux Stack</li><li>Ability to change directions and priorities often and quickly</li><li>Strong written and spoken communication skills needed for the success of a remote group that leverages Slack and Hangouts</li><li>Interested in sports or related activities</li></ul>                    </div>                            <h2>                About VNN Inc            </h2>            <div><p>VNN Inc is a rapidly growing, highly progressive company that is reshaping high school sports media from the ground up.&nbsp; Regardless of the role, the VNN team embraces the power of storytelling, and works to bring clarity, beauty and fun to technology that enables fans to share the stories of high school athletes.&nbsp; We are a company of 60 passionate makers and hustlers, who believe in the disruptive impact the right team and technology can have on an industry.&nbsp; Our work begins with a deep understanding of the parents, athletes, coaches and administrators that make up high school sports, and ends with simple fun products that impact real people across the country.&nbsp;</p><p>Working with our tight-knit team, you won’t have to worry about big company bureaucracy or not having an impact, the code you work on will be used by thousands on a daily basis.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Free Snacks                            </div>                            <div>                                 Great working environment                            </div>                            <div>                                 Get Paid What you Deserve                            </div>                            <div>                                 Health Care                            </div>                            <div>                                 Flexible Remote Team                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "php"
    ]
  },
  {
    "id": "D3zMqMISRJ6Jw7m3AYRiDg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/166118/senior-software-developers-avaaz-foundation?a=TI4pwyZnJks",
    "title": "Senior Software Developers at Avaaz Foundation ()",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Non-Profit</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Avaaz is changing the world, and we’ll give you the means to change it, too. Our team is a place to exercise your creativity and your leadership while building never-before-seen tools for one of the world’s top online activism organizations. You can let your imagination run wild figuring out how to grow the platform and tools, improve rapid-iterative processes and integrate new technologies.</p><p>We are a nimble team working on creating opportunities to bring about the world most people everywhere want -- one of justice, peace, and freedom. The work environment is quite unique: whether you’re in the office or working from home, our collaborative culture ensures everyone is heard and treated respectfully, with a strong focus on personal development.</p><p>Our tech build comprises the latest technologies (cloud computing, distributed systems, big data) using great languages (Python, PHP, JS) with proven and cutting-edge datastores (MySQL, Redshift, MongoDB, Redis, Memcache). At Avaaz, your work will have an impact on a huge scale: we have more than 40 million members, who have taken over 200 million actions, told over 500 million friends about Avaaz campaigns and donated more than $50 million online.</p><p>&nbsp;Our global and distributed tech team creates beautiful, efficient code that works across browsers, platforms, and localizations. It’s backed by developers with a proven track record of designing, building and debugging large web applications.&nbsp;</p><p>We’re roaming the world in the search for challenge-driven hard-working developers and senior developers with excellent spoken and written communication in English who are able to adapt and learn, with talents for creativity and abstract thinking. The quest is for people who fit that profile; we know specific skills can always be trained and developed. &nbsp;</p><p><br>Let’s chat -- I’m pretty sure you’ll want to join us.</p><p>We are currently hiring senior developers in the Americas, EU and African timezones.</p><p>Salary is competitive in the nonprofit space with generous benefits but we can not match corporate tech salaries.</p><p>APPLY HERE:&nbsp;<a href='https://secure.avaaz.org/en/hiring/#op-45362-senior-software-developers' rel='nofollow'>https://secure.avaaz.org/en/hiring/#op-45362-senior-software-developers</a></p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Work Remotely                            </div>                            <div>                                 Salary varies with location and experience, but is highly competitive                            </div>                            <div>                                 5 weeks paid vacation per year                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "-icinViyTBqsrOrVHQnAVQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165040/software-engineer-that-does-drupal-platformsh?a=TlEHkOIvJ9m",
    "title": "Software Engineer that does Drupal at Platform.sh ()",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Continuous Delivery, PaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span>Platform.sh, the Continuous Deployment PaaS, is seeking a backend Drupal developer with strong experience in Drupal 7 and e-commerce technologies (including Drupal Commerce and Magento). But you will have opportunities to work on many other technologies (from API proxies in NodeJS or Golang to Python libraries). &nbsp;We don’t expect you to be an expert in all-the-things but we are looking for someone that would love to have a chance to work in a polyglot environment.</span></p><p><span><br></span><span>With your intimate knowledge of user authentication workflows (such as OAuth 2), deep knowledge about security processes, and mastery of transactional workflows, you will help build, improve, and maintain the Platform.sh internal billing and user management tool (aka Accounts).</span></p><p><span>Required:</span></p><ul><li><span>Be a really really good dev that likes testing, understands how an OS works, knows networking, how git works has a very good grasp of security</span></li><li><span>Minimum of 5+ years’ experience in working with Drupal.</span></li><li><span>Strong experience with maintaining and extending complex Drupal sites (you write Drush make files on the back of napkins and revert Features in your dreams)</span></li><li><span>Strong knowledge of Git workflows (code review based on pull/merge requests, submodules, automated deployments), and you can explain to a 5 year old what rebase means.</span></li><li><span>Strong experience with integrating external services to Drupal (extra points if you have “The API is the product” tattooed on your arm)</span></li><li><span>Familiar with Behat/Mink test suite and automated test workflows.</span></li><li><span>Familiar with Agile development methodology.</span></li><li><span>Be proficient in at least one programming language other than PHP and Javascript</span></li></ul><p><span>Would be really great if you had:</span></p><ul><li><span>Go Lang Practice</span></li><li><span>Python Experience</span></li><li><span>Good Networking background (routing/protocols)</span></li><li><span>Good grasp of practical security and cryptography</span></li><li><span>Good knowledge of how the Web works (Hacking Nginx with Lua a plus).</span></li><li><span>Good understanding of how database systems and search engines work</span></li><li><span>A good notion on distributed systems (consensus protocols like Raft/Paxos, eventual consistency models, gossip protocols)</span></li><li><span>Good understanding of virtualization and containers</span></li><li><span>Mad Debian Skills</span></li></ul>                    </div>                            <h2>                About Platform.sh            </h2>            <div><p><span>Platform.sh is a groundbreaking hosting and development tool for web applications. We’re a European VC-Backed startup with a host of blue-chip Enterprise clients and a string of awards and grants (including €2m from the EU Horizon 2020 program). To reinforce our technical prowess, we are looking to grow our engineering team. If you’re looking for an exciting, high-growth opportunity with an award-winning, cutting-edge company, this could be just the job for you</span></p><p><span>For its groundbreaking PaaS solution </span><a href='https://platform.sh/' rel='nofollow'><span>https://platform.sh</span></a><span> is looking for a Pythonian Cloud Engineer with a taste for Go, good Linux system understanding, and a real hunger for the challenges of building robust, distributed systems.</span></p><p><span>Platform.sh is a PaaS shrouded in a lot of black magic (we can consistently clone a whole running cluster, with its state, databases, indexes in a matter of seconds). We want to get this down to the hundreds of milliseconds domain. Interested? There is more...</span></p><p><span>Our external API is pure Hypermedia REST + oAuth on top of Pyramid. It mechanizes the Git layer and needs more features.</span></p><p><span>We can consistently generate from the same manifest a Docker container, an LXC one, or VM disk images (AWS, Azure, OpenStack), we want more targets.</span></p><p><span>We probably have the highest industry container density. We need to get it higher.</span></p><p><span>We support any Python, Ruby, NodeJS or PHP application, it’s time to roll-out Java and .NET, and Elixir, of course Elixir.</span></p><p><span>We need to have more auto-healing on the high-availability clusters. We need more performance out of our multi-protocol ssh proxy. We need work on our Ceph Implementation; We need to get the Debian package generation streamlined and faster. We need… great ideas on how to make Platform.sh even better. Interested? Join us!</span></p><p><span>We are searching in North America. Occasional travel to cool places like Paris, France, may be required.</span></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from home, wherever you are                            </div>                            <div>                                 Safe and friendly working environment                            </div>                            <div>                                 Stock options for everyone                            </div>                            <div>                                 Rest and recovery are essential to health and happiness; we get that                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "4hvvlUUYSkWbke-mIDzNdA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16285092",
    "title": "Invoiced | Backend and Frontend Software Engineers | Austin, TX | Remote ok | Full-time | https://invoiced.com/careers Invoiced is a startup that helps companies ...",
    "content": "<div>                  <span>Invoiced | Backend and Frontend Software Engineers | Austin, TX | Remote ok | Full-time | <a href='https://invoiced.com/careers' rel='nofollow'>https://invoiced.com/careers</a><p>Invoiced is a startup that helps companies modernize and automate their billing processes. We work with companies that have high-volume or complex billing processes that have recently outgrown/broken their current billing system.</p><p>We are looking for both backend and frontend engineers that are passionate about delivering high-quality, testable code (because who likes getting a bill for the wrong amount?). The ideal candidate should be comfortable shipping production-level code in a fast-moving environment. We are currently a team of two developers supporting over 15,000 businesses that rely on our software to get paid.</p><p>What we use: PHP (Symfony 4), MariaDB, Redis, AWS, AngularJS</p><p>Reach out to us at founders@invoiced.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 9:38:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "XTSPNKgFQ_KbGm9dPat3tg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283716",
    "title": "Born Again Media | Medellin, Colombia | REMOTE | Wordpress Developer | Full Time | $14k - $18k",
    "content": "<div>                  <span>Born Again Media | Medellin, Colombia | REMOTE | Wordpress Developer | Full Time | $14k - $18k<p>Born Again Media is a digital marketing company looking for a talented developer with experience in Wordpress to help us turn designs into clean Wordpress code.</p><p>Although the position is fully remote, we're giving priority to applicants from Colombia, where most of the team is based right now.</p><p>Learn more, and apply at <a href='https://jobs.bornagainmedia.com/o/wordpress-developer' rel='nofollow'>https://jobs.bornagainmedia.com/o/wordpress-developer</a> . Make sure to mention HN in your application.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:28:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "IiMvo4dETbyOCEddVUMQ3w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4114-back-end-engineer-php-modus-create",
    "title": "Back End Engineer - PHP @ Modus Create",
    "content": "<h2>              Back End Engineer - PHP<small> @ Modus Create</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-01 16:17</p></dd>          <dt><span>Description</span></dt>          <dd><p>At Modus Create you will collaborate with a cross-functional Scrum team to deliver high quality innovative products in short sprint cycles. You thrive in an independent, distributed environment. If you’ve got the chops and want to ditch the cubicle, apply to the best lean startup development team on the planet.</p><p>This contract role may be performed from a remote location and requires a level of effort estimated at 40 hours per week. </p><p><strong>Responsibilities</strong></p><ul><li>Upgrade legacy PHP and Laravel MVC Framework based system</li><li>Develop and integrate Microservices</li><li>Collaborate daily on a distributed, cross functional agile team</li></ul><p><strong>Required Experience</strong></p><ul><li>3-5 + yrs PHP development on the backend</li><li>Strong experience using Laravel MVC Framework</li><li>Must be familiar with PSRs</li><li>Previous experience using PHPUnit</li><li>Documentation tools such as Swagger</li><li>Must have previous experience building and integrating Microservices</li><li>Strong foundation of OOP principles</li><li>ORM for interacting with DB's for example Eloquent (comes with Laravel)</li><li>Experience upgrading legacy code a plus</li><li>Experience using JIRA for issue tracking</li><li>Strong experience using GitHub in a professional environment</li><li>Previous consulting experience is a plus</li><li>Be able to communicate effectively in English</li></ul><p><strong>Let’s Talk about You</strong></p><p><strong>You value outcomes above all else:</strong> You have a proven track record shipping great mobile and web products. By understanding the big picture, you articulate strategy and vision with strong written and verbal communication.</p><p><strong>You Lead by Doing:</strong> You realize that the big picture is worthless without getting your hands dirty in the technical details for strategic and tactical problem solving. You understand the value of situational leadership and can adapt to the needs and strength of your team.  </p><p><strong>You Love Work, Growth and Learning:</strong>   You dream of working in a culture that values hard work, continued learning and innovation with a commitment to building amazing products for clients and their end users. You’ll stop learning when you are dead, and until then you desire to gain deeper knowledge in technology and business.</p><p><strong>Let’s Talk About Us</strong></p><p>Modus Create is a Product Studio offering consulting services and SaaS products for strategic planning, design and and execution of web-based and mobile products. We work across multiple industries with Fortune 1000, ISVs, and startups to validate, plan and launch new products. Headquartered in Reston, VA, we are a bootstrapped team that has grown from 2 to 100 people in 26 countries in 6 years, committed to building the best product consulting firm on the planet. We offer a highly collaborative, autonomous and effective working environment. We love and believe in what we do. This is your chance to be part of building something great.</p><p><strong>Why Modus Create</strong></p><ul><li>Competitive compensation</li><li>Ability to work remotely / telecommute</li><li>Working side-by-side with thought leaders in emerging tech</li></ul><p>Do you have what it takes to join the DC area's most awesome tech company? Let’s start a conversation.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>You must be willing to co-work a significant portion of the day with clients' business hours - GMT-5. This is a full-time, contract position that may be performed from a remote location.</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 6:17:11 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "vXuBm74CTICLd7VFqKV0AQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/65603/hands-on-cto-for-storemates-the-airbnb-of-storage-at-storematescouk/",
    "title": "Hands on CTO for Storemates 'the Airbnb of Storage'",
    "content": "Storemates is part of the exciting sharing Economy. We are the 'Airbnb of Storage', connecting people with space. <br /><br />We have 4000 storage spaces around the UK offering an affordable friendly, local, green alternative to expensive self-storage. Our mission is to create a fantastic marketplace that helps everyone rent out their attics, garages, sheds, spare rooms, driveways to the many people looking for extra storage space.<br /><br />We have received investment to build and improve our platform with the aim to create an amazing user experience packed with innovative functionality. As the CTO of Storemates, can you help lead the technical transformation of our company to become a leading online storage solution in the next 3 years.<br /><br />The role involves:<br /><br />· Developing the strategic vision for our technology<br />· Overseeing our remote developer team<br />· Being an excellent communicator to our non-tech orientated board<br />· Managing our next phase of our site growth and app development.<br />.Some hands-on 'developer work' at times.<br /><br />Your experience must cover all of these:<br /><br />· At least 5 years in technical teams<br />· Independently resourceful<br />· Patient (with non techies!) with exceptional communication skills<br /><br />You should have experience of at least 3 of these:<br /><br />· Delivered IT Projects<br />· Day to day maintenance and support of IT Systems<br />· Line Management Duties<br />· Operations<br />· Programming<br />· Scripting<br />· SQL<br />· LAMP stack<br />· Working with marketing<br />· Business Analysis<br /><br />We are looking for someone who can work flexibly with us on a part-time basis and be part of the senior board too. Minimum of 6 days a month.<br /><br />Working with Storemates is also hugely rewarding and fun. We are in the press constantly with our unique solution to space and are popular spokespeople for the booming 'Sharing Economy'. The senior team is also very experienced, contagiously enthusiastic and will be committed to your support and development. Our special advisers include senior execs from John Lewis, Airbnb, M&S and Visa. This will be a great opportunity to learn and develop new skills and build your networks.<br /><br />The successful candidate will receive a lucrative equity stake of our fast-growing company and the offer of a paid contract once revenue targets are met, hopefully, between 6-12 months after appointment as our operation starts to scale.<br /><br />Please do get in touch!",
    "urlFetchPending": false,
    "published": "Jan 28, 2018 4:27:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "pUA7LpX6RjyER5XZCk6ldQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4105-full-stack-developer-i-will-teach-you-to-be-rich",
    "title": "Full Stack Developer @ I Will Teach You To Be Rich",
    "content": "<h2>              Full Stack Developer<small> @ I Will Teach You To Be Rich</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-01-24 03:47</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong><em>Live your Rich Life from anywhere. 100% remote position.</em></strong></p><p><strong>The Giant Hairy Problem You’ll Be Solving</strong></p><p>The best of all worlds: a development role in a startup environment without the risk of small organizations or the inflexibility of large ones.</p><p>We’re looking for a seasoned full stack developer to join our team to create services that power incredible user experiences.</p><p>This could be a dream position for the right person. Read the description below to see if it’s what you’ve been looking for and find out how to apply.</p><p><strong>You’ll Work On Projects Like</strong></p><p>A Full Stack Developer at IWT is able to work in all parts of an application from backend services to middle tier and the front-end app. You will be developing new solutions to complex problems and work within our existing frameworks, while keeping an open mind to potential process improvements and scalability.</p><p>You will be a senior member of the engineering team; with that comes the responsibility of mentoring team members and establishing architectural principles and design patterns. You’ll be translating functional requirements into functional applications. You’ll be doing more than just bug hunting; you’ll be proactively identifying bottlenecks and devising solutions to them.</p><p>You will also be interfacing with IWT’s own home-grown solutions as well as with several third party API’s. Expect to be immediately thrown in the deep end and getting into the code right away.</p><p>Compensation is commensurate with experience. Perks include health coverage, 401k with match, technology and education stipends, the ability to live anywhere in the US, and work with some of the most interesting people in the world.</p><p><strong>What We're Looking For</strong></p><p>At IWT we love hard problems that others can't solve, won't solve, or don't even want to try solving.  We want to work with people who love big challenges, too. People who want to be the best they can possibly be and fight everyday to make it happen. We call them top performers and we all share the same values:</p><ul><li>Obsessed with excellence</li><li>No ego</li><li>Outstanding communication</li><li>We drive results</li><li>Learn fast, grow fast</li><li>Be weird</li></ul><p><strong>If you're a good fit for this opportunity, then you'll have:</strong></p><ul><li>Broad Experience: You will be working in every aspect of the stack, from top to bottom in a variety of languages.</li><li>Comfortable in PHP and extremely deep in Ruby</li><li>Intimately familiar with CakePHP or Rails</li><li>Lots of practical experience with HTML, CSS, JavaScript, and MySQL</li><li>Experience with AWS</li><li>Well rounded DevOps and performance tuning experience</li><li>Experience with Salesforce or Marketo is a definite plus</li><li>Hands On: You are naturally curious and want to understand how things work. You also aren’t afraid to get your hands dirty and don’t want to pass things off as “not my job” when issue arise.</li><li>Agile: Able to work iteratively and a willingness to change priorities based on changing business dynamics</li><li>A vision for the future: A knowledge of industry best practices and an eye toward the future and improving our processes continuously.</li><li>Able to work remotely with your own phone, computer and high speed internet access in place.</li><li>This is a full-time, 100% remote position. Must be US based.</li></ul><p><strong>About Us</strong></p><p>For the past 12 years, we’ve quietly built a private company that has become one of the leaders in online education and self development. Over 1 million Top Performers read us every month for advice on money, entrepreneurship, careers, relationships, and personal productivity.  We build no-BS personal-development brands that deliver real results.  We tell the truth about how the world works -- even when it’s uncomfortable to hear. We value trust over short-term sales.  We’re selective and demanding about who we serve.  </p><p>We’re a high performance team of exceptionally talented and diverse individuals, and we nurture each other’s personalities, creativity and obsessions to bring forth unique content, products and services to the market. Our goal is to help millions of people live richer, more fulfilling lives. And it takes an entire team committed to something bigger than themselves to make that kind of impact.</p><p>We are seeking high caliber individuals who want to help push us to the next level. If you like to move quickly and have a bias for action, you’ll fit right into our fast-paced, results-based environment. We’re a 100% remote/virtual team environment where you can work from wherever you are. We’re excited to work alongside the best in the world to make a difference in millions of people’s lives.</p><p>If you think you’d be a great addition to our team, click the “Apply Now” button below to submit your application.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>United States</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Jan 24, 2018 5:47:03 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "php",
      "ruby"
    ]
  },
  {
    "id": "IIAtbzslQWahMH0Q3uoxXA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30211?r=rss2",
    "title": "Parklink Development Limited: Lead Technician (Python/PHP)",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><p><strong>Role:</strong> Lead Technician [PHP/Python]</p><p><strong>TLDR:<br></strong>Parklink Limited seeks a skilled, motivated&nbsp;candidate to fill the position of <strong>remote Lead Technician&nbsp;</strong>skilled in <strong>Python and PHP,</strong>&nbsp;who loves the challenges of <strong>high-availabilty&nbsp;SaaS</strong> and&nbsp;<strong>working with hardware.</strong></p><p><strong>Overview:</strong></p><p>Parklink Development Limited provides RFID duplication devices to locksmiths and security professionals.</p><p>We currently have over 2000 devices deployed and 250,000 badges copied per year. As we greow, we are seeking a skilled &amp; motivated remote lead technician to assist with software development and technical support.</p><p>We are a highly optimised / lean company. The successful candidate will have the ability to work autonomously on a constantly evolving product and rapidly expanding client base. You will work on a real product that is used by thousands of people daily. You will be challenged to write and maintain clean, optimised code for such an environment.</p><p>We are not another boring SaaS company. We create, manufacture and deploy real hardware on a global scale, with back and front end code managing it all. You'll have a chance to get your hands onto hardware, software, development and deployment. If you're driven, curious, and a hacker at heart, this position is for you.</p><p>The successful candidate will interface with our distributors (Europe and Australia) to rapidly and professionaly troubleshoot and resolve any technical issues they may encounter.</p><p><strong>Tasks:</strong></p><p>As a lead technician, your tasks will be divided into two categories:</p><ol><li>SaaS Development (CakePHP)</li><li>Embedded Development (Python)</li></ol><p><strong>SaaS Development<br></strong>Our system is backed by a Geographically Distributed High-Availability LAMP stack (Europe + Asia) with all systems redundant and failover ready. The system serves the API to our machine network, and the back office to our clients for admin.</p><p>Tasks include</p><ul><li>Maintaining &amp; Developing the API [PHP / CakePHP]</li><li>Maintaining &amp; Developing the&nbsp;Administration Interface [PHP / CakePHP]</li><li>Maintaining &amp; Optimisation of the Database</li></ul><p>We have short, medium and long term goals, and milestones setup for our system. You're coming into a stable, clean, code base that we'll give you all necessary training on.</p><p>Our frameworks are under GitHub source control, with a CI environment for staging and production.</p><p>&nbsp;We will provide necessary development environments (VirtualBox environment).</p><p><strong>Embedded Development</strong>&nbsp;<br>We have 2000+ deployed networked, touch-screen machines deployed. Each machine is backed by a RPI, with NFC readers and touch screen. We have a custom linux deployment, and the embedded software is Python + Qt [Pyside]</p><p>The software is under clean, stable, and under active development.&nbsp;</p><p>Tasks include</p><ul><li>Maintaining &amp; Developing machine software [Python]</li><li>Developing / Deploying a Unit Testing framework [Python /&nbsp;ForgLogic Squish]</li></ul><p>We will provide all necessary training + hardware required to get started on the&nbsp; systems.</p><p><strong>Technical skills</strong> required:&nbsp;</p><ul><li><strong>Python 3</strong> [Fluent]<ul><li>QT / PySide Experience Bonus</li><li>Ability to write, respect &amp; maintain unit tests<br><br></li></ul></li><li><strong>PHP 5/6/7&nbsp;</strong>&nbsp;[Fluent]<ul><li>OOP (PSR-1 &amp; 2) Obligatory</li><li>CakePHP Experience Bonus</li><li>Ability to write, respect &amp; maintain unit tests (CodeCeption, PHPUnit)<br><br></li></ul></li><li><strong>Git/GitHub competancy</strong><ul><li>Fluent with Git, respecting &amp; maintaining development procedures (issue branch, code review, pull request, merge, etc)<br><br></li></ul></li><li><strong>Database (Mysql)</strong><ul><li>Query optimisation for high load environments<br><br></li></ul></li><li><strong>High Traffic, High Availability Clusters&nbsp;</strong><ul><li>Experience with distributed server clusters and writing highly optimised code for high-load environments<br><br></li></ul></li><li><strong>Linux Familiarity</strong><ul><li>Intermediate configuration &amp; administration tasks (SSH, Bash, etc)</li><li>Rasbian Experience Bonus<br><br></li></ul></li><li><strong>Hardware Familiarity</strong><ul><li>Raspberry PI</li><li>Serial / UART<br><br></li></ul></li><li><strong>NFC Familiarity</strong> Bonus<ul><li>13.56 (Mifare, libNFC, etc)</li><li>125KHz (T55, EM4XX etc)&nbsp;</li></ul></li></ul><p><strong>Personal Skills:</strong></p><ul><li><strong>Languages:</strong><ul><li>English</li><li>Fluency in written + spoken</li></ul></li><li><strong>Personality:</strong><br><ul><li>Ability to communicate clearly and efficiently</li><li>Ability to work autonomously &amp; self-motivate</li><li>Ability to integrate into an existing team &amp; structure</li></ul></li></ul><p><strong>Time Requirements:</strong></p><ul><li>This is a full time, remote position (8 hours per day, 5 days per week)</li><li>Reachable during work hours via phone / slack</li></ul><p><strong>Compensation:</strong></p><ul><li>40000EU per year</li><li>2kEU Hardware Allowance</li><li>We will provide all training required</li><li>We will provide all hardware necessary (Devices, parts, badges, etc)</li><li>Flexible time off: 25 Paid Vacation days + 11 Paid Public Holidays</li></ul><p><strong>What we need:</strong></p><ul><li>Your updated CV</li><li>A brief email explaining who you are, why you fit the position, and how your experience is relevant.</li><li>A link to your GitHub/GitLab account</li><li>An overview of your side projects that you work on / contribute to</li></ul><p></p><p><strong>Job Perks:</strong> - 36 days of paid holiday per year- Hardware development budget</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Jan 17, 2018 2:41:34 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "xWMcnVSFQ6Wu0fjU1LRRkQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4070-wordpress-developer-artbees",
    "title": "WordPress Developer @ Artbees",
    "content": "<h2>              WordPress Developer<small> @ Artbees</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-01-04 13:17</p></dd>          <dt><span>Description</span></dt>          <dd><p>Artbees is looking for Web Developers willing to collaborate hourly-based or salary-based.</p><p><strong>Qualifications</strong></p><ul><li>Minimum of 3 years experience in coding with WordPress</li><li>Professional level frontend coding skills (coding clean and maintainable HTML&amp;CSS)</li><li>A good Knowledge of PHP</li><li>Good understanding of WordPress architecture, developing custom themes, custom content types and creating custom plugins</li><li>Fluid knowledge of JavaScript</li><li>Familiarity with WooCommerce and Visual Composer plugins</li><li>Familiarity with web design standards and trends</li><li>Strong oral and written communication skills in English</li></ul><p>*We need to learn about your most accomplished projects. we expect a CV attached to your application or a link to your online portfolio.</p><p>For on-site collaboration we accept applications from <strong>Turkey</strong>.</p><p>For remote collaboration we accept applications from <strong>all around the world</strong>, with the exception of individuals living in or between the following time zones: UTC -10:00 and UTC -5:00.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Jan 4, 2018 3:13:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  }
]
}
