{
 "items": [
  {
    "id": "rSVliWuFRPiyrKxKuB5yvw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/139662/senior-full-stack-magician-avant8-pty-ltd?a=KPYr8a6dYIM",
    "title": "Senior Full Stack Magician at Avant8 Pty Ltd () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Finance, Healthcare, Social Networking</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are looking for a developer well versed in HTML, CSS, Javascript, and PHP. While these are required as foundational languages, being the first and primary developer for the projects you will be working on, you can enjoy the flexibility of working with any framework. We’re flexible, so even if you primarily work with C# or any other languages, but have experience developing web applications, send us your CV! :)</p><p>Although based in Australia, Avant8 has presence in the US and leverages it to deal with domestic brands and investors, specializing in turning around their distressed digital assets. Our team creates innovative solutions that work well under pressure allowing for new business models to tested rapidly in any market.</p><p>We’re looking for A-players, and part of that involves autonomy. You will be assigned tasks, both small and large, and a general time frame, but given the autonomy and freedom to schedule your own daily tasks as long as you complete what needs to get done. We understand and respect that you know development better than we do and it’s not our place to call unnecessarily strict or irrational deadlines and ways of completing tasks. This may be a good place to add that you should, when applying, mention in the cover letter your favorite food and, if you’re feeling ambitious, include a picture: this is to weed out applicants who mindlessly apply en masse to listings.</p><p>Given the above mentioned autonomy and freedom, you will be expected to debrief with a daily summary of what was accomplished, problems you ran into, what’s planned for the coming days, and maybe a joke or two. :)</p><p>We are a fun, friendly, and closely knit team, and although geographically distant, we have a strong work ethos and communicate regularly allowing for a very friendly and efficient work environment. Being a part of a new division within an established company, you get the best of both worlds in terms of job security and company culture. We work hard and expect the same from all of our team members.</p><p>We work hard, but we also play hard. You should come with a great sense of humor and a smile on your face, because you’ll have a few laughs and enjoy your time working with us. We reward hard work with a variety of perks incorporated in our flexible working environment.</p>                    </div>                            <h2>                About Avant8 Pty Ltd            </h2>            <div><p>We are Australia-based Avant8 Pty Ltd. and we are looking for a motivated full-stack developer to join a new sector in our company that focuses on building digital assets in high trafficked industries, including but not limited to medical (health, wellness), finance, and social.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote working                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH2/css",
      "TECH2/html",
      "TECH2/javascript",
      "TECH2/mysql",
      "TECH2/php",
      "TITLE1/dev",
      "TZ/Asia"
    ],
    "tagsNames1": [
      "100% remote",
      "Asia time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "css",
      "html",
      "javascript",
      "mysql",
      "php"
    ]
  },
  {
    "id": "D-bwlgUIRCeLLFu-l6IcVg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/128299/senior-distributed-database-engineer-stardog-union?a=H1HJjJyDrcA",
    "title": "Senior Distributed Database Engineer at Stardog Union (Arlington, VA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Databases, Enterprise Software, Information Technology</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Stardog is the world's leading Knowledge Graph platform for the Enterprise. Turn data into knowledge faster and easier. Stardog lets you query, search, and analyze enterprise data, wherever it is, using scalable, cutting-edge Knowledge Graph technology.<br><br></p><p>The future has always been distributed and the future is arriving now. If you know&nbsp;that Raft isn't just a flotation device, then you could be a great fit for Stardog.</p><p>Responsibilities:</p><ul><li>Help design and build storage and query evaluation over a large distributed&nbsp;database</li><li>Develop and implement algorithms for distributed transactions over very large&nbsp;clusters</li><li>Implement and optimize graph algorithms over distributed indexes&nbsp;</li><li>Work on integration with DCOS frameworks like Mesos</li></ul><p><strong>Skills &amp; Requirements</strong></p><ul><li>5+ years programming experience, ideally in Java</li><li>Strong computer science fundamentals, with advanced knowledge of&nbsp;data structures, algorithms and software design</li><li>Experience building distributed databases&nbsp;and service-oriented architectures</li><li>Knowledge of&nbsp;Spark, Storm, Flink, DCOS frameworks like Mesos</li><li>Ability&nbsp;to work in&nbsp;a distributed team mainly&nbsp;communicating&nbsp;over email, chat, and&nbsp;phone</li><li>Experience with&nbsp;graph technologies or databases&nbsp;is a plus</li></ul>                    </div>                            <h2>                About Stardog Union            </h2>            <div><p>Our culture is based on engineering excellence, mutual respect, collegiality in all things, rigor in design, research, implementation, and testing. We care deeply about work-life balance and productivity in the short and long run. In sum, if you remove the unnecessary, the distracting, and the tedious, what you're left with is a healthy 40 hour week full of wins</p><p><em>We are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</em></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Health care including dental &amp; vision, some plans fully company paid                            </div>                            <div>                                 401k                            </div>                            <div>                                 3 weeks vacation                            </div>                            <div>                                 Remote work available for qualified candidates                            </div>                            <div>                                 Top of the line hardware                            </div>                            <div>                                 Flexible work schedule                            </div>                            <div>                                 Company paid life and disability benefits                            </div>                            <div>                                 Well stocked kitchen, snacks, lunch, and most importantly, coffee                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH1/java",
      "TECH2/apache-flink",
      "TECH2/apache-spark",
      "TECH2/dcos",
      "TECH2/distributed-computing",
      "TECH2/distributed-database",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "apache-flink",
      "apache-spark",
      "bigdata-ml",
      "dcos",
      "distributed-computing",
      "distributed-database",
      "java"
    ]
  },
  {
    "id": "ABdUVLjnTNuXsRpKcvHBrg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/167064/data-engineer-txodds?a=U1JXf2cVcAw",
    "title": "Data Engineer at TXODDS (London, UK) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>DevOps, System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Data Science, Gambling</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>TXODDS</strong></p><p>TXODDS is a dynamic player in the Sports data business looking to grow aggressively in the next 18 months. It is seeking a number of developers and engineers to join a team responsible for the operation, development and maintenance of our current and future systems.</p><p>The technology platform is currently undergoing a period of reinvestment and the selected candidates will contribute to this. You will be able to work independently on distributed platforms, contribute effectively to team discussions/decisions and clearly communicate impediments when they arise.</p><p><strong>Data Engineer</strong></p><p>We are looking for an experienced Data Engineer to work on collecting, storing, processing, and analysing our huge sets of data.</p><p>Alongside the on-going maintenance of our existing data storage systems, you’ll be developing and implementing upgrades and enhancements to the data and the supporting systems architecture.</p><p>We require a candidate who genuinely cares about data, in particular, about its security, safety, availability, quality and consistency.</p><p>The candidate should be able to have good time management skills, track their tasks in JIRA, be dependable and reliable in their job, and be a good communicator.</p><p><strong>Responsibilities</strong></p><ul><li>Consolidating, securing and optimising our existing data storage solutions, including data designs and architectures.</li><li>Monitoring performance and determining suitable application / infrastructure enhancements.</li><li>Working with operations to ensure the 24/7 availability of data services.</li><li>Designing and developing resources and frameworks as required by application and business demand.</li></ul><p><strong>Required Skills.</strong></p><ul><li>Expert / DBA level skills with a variety of RDMS including MySQL, Postgres, MSSQL, Oracle etc.</li><li>Experience of managing Hadoop cluster(s) and associated services.</li><li>Experience with building stream-processing systems.</li><li>Strong and low-level Linux (Centos) skills.</li><li>Experience working with configuration management systems such as Puppet and Ansible.</li></ul><p><strong>Bonus Skills</strong></p><ul><li>Experience with the Cloudera service stack, in particular, Impala, Sqoop and Oozie.</li><li>Knowledge of public cloud ( AWS, Azure, GCP) technologies and capabilities.</li><li>Experience with NoSQL databases, such as Cassandra or MongoDB.</li><li>Knowledge of various ETL techniques and frameworks, such as Flume.</li><li>Experience with various messaging systems, such as Kafka, ActiveMQ or RabbitMQ.</li></ul>                    </div>                            <h2>                About TXODDS            </h2>            <div><p>TXODDS is a&nbsp;market leader in providing real-time odds information to the betting industry. Working with many of the industry's biggest names our services are in use at the front line of trading rooms globally, where the focus lies on real time, accurate and relevant data.&nbsp;</p><p>With offices in different locations in Europe and China, you can expect regular meetups with the rest of the team. We offer:</p><ul><li>Highly competitive salary based on experience level</li><li>An attractive position in an international and dynamic company</li><li>Challenging tasks in a highly professional and stimulating environment</li></ul><p>Please drop us a note to introduce yourself!</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Great London location                            </div>                            <div>                                 Remote working flexibility                            </div>                            <div>                                 Latest technologies                            </div>                            <div>                                 Flexible hours                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH2/devops",
      "TECH2/hadoop",
      "TECH2/linux",
      "TECH2/mysql",
      "TECH2/postgresql",
      "TECH2/sysadmin",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "devops",
      "hadoop",
      "linux",
      "mysql",
      "postgresql",
      "sysadmin"
    ]
  },
  {
    "id": "1aIGB5ktRwC_0x97mpiQ-A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/166527/python-developer-for-swedens-best-ai-team-tenfifty-ab?a=TQzG0d9exFe",
    "title": "Python Developer For Sweden's Best AI Team at Tenfifty AB (Göteborg, Sweden) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Data Science, Machine Learning, Web Crawling</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>For our development team, we are looking for a Python developer with at least a few years experience. You will help develop pilots, projects and services for our customers, hosted on Linux using&nbsp;<em>Kubernetes</em>&nbsp;and&nbsp;<em>Google Cloud Platform</em>. The majority of these projects are related to&nbsp;<em>artificial intelligence</em>,&nbsp;<em>machine learning</em>&nbsp;and/or&nbsp;<em>data science</em>, while some are related to&nbsp;<em>web crawling</em>.</p><p>You can take on and finish tasks with a large degree of independence. As we are still a small and growing company (eight developers per January 2018), you need to have a broad technical competence and be flexible about your projects.</p><p>Each project usually have two developers working as a mini-team, but we communicate about challenges with everyone. We need both people skilled in putting code into production and those who specialize in ML, but for us it is important that everyone can code. For this position the actual Python programming is the important part.&nbsp;You make us extra happy if you have data science experience, a strong AI/ML background and/or statistical knowledge, but this is not required.</p><p>Recently we have worked on projects including speech to text, video OCR, text based recommendation systems, price prediction, a customer support mail-bot and generally a lot of fun and open ended challenges with a high success rate.</p><p>We offer a large degree of freedom. Pick your own equipment, OS, IDE, etc. You can choose to work from home. We offer a bonus and pension program. You will be working in a pleasant environment with other highly skilled Python programmers and machine learning experts.</p><p>Our developers can currently choose to work from home up to three days a week. So far we have preferred to meet in person to discuss projects now and then, but we are interested in working with full time remote developers as well.</p>                    </div>                            <h2>                About Tenfifty AB            </h2>            <div><p>We are all about putting cutting edge machine learning into production and real use for our clients.</p><p>As of January 2018 we are a growing team of eight developers who work on (mostly) machine learning projects. We specialize in doing customized AI and ML solutions, often based on our existing code platform, that go beyond the &quot;fun pilot&quot;-stage and deliver real value. Usually we do a pilot to determine quality and feasibility, followed by a main project where we put models, etc into production, offered as a subscription service.</p><p>Many&nbsp;of us have well over a decade of experience doing Python and machine learning in practice, with solid mathematical and programming background. We always try to stay on the cutting edge, hosting and attending ML-meetups and seminars, reading papers, etc. In our projects we balance new&nbsp;methods that are fun/important to learn with more mature methods that we know will work in practice.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible hours                            </div>                            <div>                                 Flexible location                            </div>                            <div>                                 Stock options                            </div>                            <div>                                 Fitness and health program                            </div>                            <div>                                 Pension program                            </div>                            <div>                                 Expert colleagues                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/python",
      "TECH2/google-cloud-platform",
      "TECH2/linux",
      "TECH2/python-3.x",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "google-cloud-platform",
      "linux",
      "python",
      "python-3.x"
    ]
  },
  {
    "id": "bBSR7cJ6QJ2u-k7uwuLRGQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165747/software-engineer-thorn?a=TAm8iRhJp8A",
    "title": "Software Engineer at Thorn (San Francisco, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Non-Profit, start up, Web Technology</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Thorn is searching for software engineers to join our engineering team to help build technology to defend children from sexual abuse. The team’s current areas of focus include human trafficking, dark web child abuse/exploitation content, and social media platform safety.</p><p>You will work on our dark web investigation tool, as well as a variety of other projects. Examples of projects include our Child Finder Service, in which we apply computer vision to find missing children, and our Industry Toolkit, which will be used to clean online communities of child abuse. You will also participate in broad exploration to fight child abuse and trafficking. The work spans engineering and data science topics from security to artificial intelligence — including adaptive crawling, statistical analysis, search, machine learning (NLP, computer vision, sentiment analysis), data pipeline development, and UX design.</p><p><strong><strong>Requirements:</strong></strong></p><ul><li><p>Professional software development experience</p></li><li><p>Adept at quickly learning new technologies</p></li><li><p>Experience implementing, testing, and deploying code to production</p></li><li><p>Skilled at rapidly prototyping applications</p></li><li><p>Ability to collaboratively solve problems with internal and external stakeholders</p></li><li><p>Clear, efficient, and eloquent communicator — we are a distributed team, so written communication is crucial, from Slack to pull requests</p></li></ul>                    </div>                            <h2>                About Thorn            </h2>            <div><p>Working at Thorn gives you the&nbsp;opportunity to apply your&nbsp;skills, expertise and passions to directly impact the lives of vulnerable and abused children. Our staff&nbsp;tackles&nbsp;dynamic, quickly evolving problems with our network of partners from tech companies, NGO’s and law enforcement agencies. &nbsp;If you are able to bring clarity to complexity and lightness to heavy problems, you might be a great fit for our team.</p><p>At Thorn, we combine the nimbleness of a startup with the mission and values of a non-profit. Engineers are empowered. They move fast and have authority and responsibility over how our products are designed and built. Our success is measured by how many children we’ve helped save, how many cases we’ve contributed to solving and how much harm we’ve prevented. Through focused and persistent effort, we can stop online child sexual abuse.</p><ul><li>Challenging work that allows you to learn and apply your skills to life-changing products.</li><li>Collaboration with experts who provide real world feedback to the tools you make.</li><li>Clear goals, unclear solutions, and the opportunity to make a big mark on our products.</li><li>Competitive salary.</li><li>Fully covered health care for you and your family.</li><li>Matched 401[k].</li><li>Flexible work schedules and locations.</li><li>Monthly team and individual wellness sessions.</li><li>Flexible vacation policy, standard holidays and three weeks off as a company, one for Thanksgiving, two between Christmas and the first week of the new year.</li><li>Amazing, amazing, amazing coworkers.</li><li>While the majority of our technical team is based in San Francisco, we are a distributed team that supports remote work. We’re together as a full team at least once a quarter. When we’re together there are fun team events, and one engineer is also a comedy writer, so that’s a plus for all the time we spend on Slack.</li></ul><p>Thorn is a strong and flexible team because of the diverse backgrounds of our staff. This includes professional background, subject matter expertise, culture, race/ethnicity, sexual orientation, gender identity and expression, language, hobbies, etc. We strongly encourage women, minorities, and people from underrepresented backgrounds to apply. Your skills are needed here.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible vacation policy                            </div>                            <div>                                 Fully covered health insurance                            </div>                            <div>                                 Competitive salaries                            </div>                            <div>                                 401K plan                            </div>                            <div>                                 Paid maternity/paternity leave                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH2/amazon-web-services",
      "TECH2/docker",
      "TECH2/node.js",
      "TECH2/python",
      "TECH2/reactjs",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "bigdata-ml",
      "docker",
      "node.js",
      "python",
      "reactjs"
    ]
  },
  {
    "id": "jtF7MSesRSqHfBKlmKZLGw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/166085/data-analyst-paris-hq-peopledoc?a=THnRUfe366c",
    "title": "Data Analyst (Paris HQ) at PeopleDoc (Paris, France) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Student, Junior, Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Data Scientist, System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>HR Services, SaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Data being at the center of our mission, our Data Team is looking to improve and innovate our data management practices and tools to bring added value to our client and develop our Data analytics solution.&nbsp;</p><p>To complete this mission, PeopleDoc is looking for a Data Analyst to join his Data Team, actually composed of 6 people, 4 DBAs and 2 Data Engineers.</p><p><strong>Responsibilities:</strong></p><ul><li>Build and maintain dashboards for clients based on their requirements (currently using ZohoReports)</li><li>Build and maintain internal dashboards (currently using Superset)</li><li>Work closely with other teams and support them with data that can help them to take the right decisions</li><li>Be involved in our data warehouse project in order to make data available to everyone inside the company</li><li>Mine in our data to identify and perform meaningful analysis</li></ul><p>The position is open at Paris and can be remote in France or Germany.</p><p>&nbsp;<strong>The successful candidate will be required to:</strong></p><ul><li>Work with DBAs as development team and the whole R&amp;D team</li><li>Be curious and proactive</li><li>Love sharing his/her knowledge with other&nbsp;</li></ul><p><strong>Competencies required:</strong></p><ul><li>SQL knowledge</li><li>Previous experience with a data visualization tool is a plus (Tableau, ZohoReports, Superset, QlikView…)</li><li>Team player, creative and able to set his own priorities</li></ul>                    </div>                            <h2>                About PeopleDoc            </h2>            <div><p>Here are PeopleDoc, we believe that employees should receive the same level of services as the company’s best customers. Our unique “state of the art” HR Service Delivery platform provides HR teams with the tools they need to provide a great services while considerably decreasing the manual work behind the scenes and allowing companies to go paperless in their administration.</p><p>The PeopleDoc HR Service Delivery platform helps HR teams more easily answer employee requests on demand, automate employee processes, and manage compliance across multiple locations. Our cloud solutions include case management, process automation and employee file management. 100% software as a service, PeopleDoc solutions integrate with existing HR systems, can be implemented in 8-12 weeks, and are designed for agile ongoing use by HR teams serving diverse workforces. PeopleDoc serves more than 500 clients with employees in 165 countries in nine languages with a 100% customer retention rate. More information is available at <a href='http://www.people-doc.com.&nbsp;&nbsp;' rel='nofollow'>http://www.people-doc.com.&nbsp;&nbsp;</a>;</p><p><strong>Our solutions:</strong></p><ul><li>HR Service Delivery platform</li><li>Employee File Management</li><li>Case Management &amp; Employee Portal with personalized knowledge base</li><li>Process Automation</li><li>Advanced Analytics</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Great equipment (choice of Mac or Lenovo)                            </div>                            <div>                                 Employee Stock Option Plan                            </div>                            <div>                                 Flex Office                            </div>                            <div>                                 Allowance for Training/Seminars                            </div>                            <div>                                 Health Plan                            </div>                            <div>                                 New Office located in the heart of Paris                            </div>                            <div>                                 Generous Vacation Plan (25 vacation + 10 RTT)                            </div>                            <div>                                 Subsidized Meal Tickets                            </div>                            <div>                                 Subsidized Commuting                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH2/data-analysis",
      "TECH2/data-visualization",
      "TECH2/postgresql",
      "TECH2/sql",
      "TECH2/sysadmin",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "data-analysis",
      "data-visualization",
      "postgresql",
      "sql",
      "sysadmin"
    ]
  },
  {
    "id": "0T8DRNwFRIiy-DXMduh0nA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/133810/back-end-data-engineer-clevertech?a=ISihwY3d6BG",
    "title": "Back End Data Engineer at Clevertech () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong><strong>DESCRIPTION:</strong></strong></p><p><span>Clevertech is looking for a Back End Data Engineer to join our global team. </span></p><p><span>This role has database design and implementation responsibilities including alternative data structures such as nosql, redis, elasticsearch and more. Clevertech looks for craftsmen developers who take ownership of their code.</span></p><p><span>You can deliver quickly while being clever to avoid missteps. You have an effective positive attitude that shines as you show you care about client and colleague concerns. You are always learning and are a transparent communicator even when it is challenging. You thrive on challenging yourself daily and seek to surround yourself with like minded individuals.</span></p><p><strong><strong>REQUIREMENTS:</strong></strong></p><ul><li><span>5+ years experience with complex data structures.</span></li><li><span>You have deep experience in the latest libraries and programming techniques.</span></li><li><span>You have accomplishments that showcase your capabilities by their success and technical depth.</span></li><li><span>You own new features from idea to completion. </span></li><li><span>Work well with a core team to design and execute major new features.</span></li><li><span>Familiar with SQL/NoSQL databases like MongoDB and their declarative query languages is a plus</span></li><li><span>Enjoy contributing to a fast moving exciting project</span></li><li><span>Strong experience using GitHub in a professional environment</span></li><li><span>Strong communicator and fluent in English with excellent written and verbal communication skills.</span></li><li><span>Thrive and excel in our diverse, distributed and agile team environment</span></li></ul><p><strong><strong>BENEFITS</strong></strong></p><p><strong><span>Own Your Time</span></strong></p><p><span>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting. </span></p><p><strong><span>Recharge Time</span></strong></p><p><span>We insist that you take recharge time. We are closed for major holidays and require that you take at least two weeks a year to refresh.</span></p><p><strong><span>Care For Yourself</span></strong></p><p><span>You’ll receive a monthly stipend that goes towards covering medical insurance, accountant costs, or joining a gym!</span></p><p><span>Focused Work</span></p><p><span>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams. </span></p><p><strong><span>Learn at your edges</span></strong></p><p><span>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</span></p><p><span>And of course, if you speak at a tech conference, we cover all expenses.</span></p><p><strong><span>Clevertech Swag</span></strong></p><p><span>And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</span></p><p><span>Want to learn more about Clevertech and the team? Check out </span><a href='http://why.clevertech.biz/' rel='nofollow'><span>why.clevertech.biz</span></a><span>.</span></p><p><br><br><br></p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Full-Time Telecommuting                            </div>                            <div>                                 Flexible Schedules                            </div>                            <div>                                 Paid Time Off                            </div>                            <div>                                 Ability to Work with Cutting-Edge Technology                            </div>                            <div>                                 Opportunity to Work with and Learn from Top Developers                            </div>                            <div>                                 Contribute to Open Source                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH2/elasticsearch",
      "TECH2/nosql",
      "TECH2/redis",
      "TECH2/redux",
      "TECH2/sql",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "elasticsearch",
      "nosql",
      "redis",
      "redux",
      "sql"
    ]
  },
  {
    "id": "ww8tEA5-TlKFldSdKrwrsg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16299480",
    "title": "SpankChain (ethereum + porn) is hiring: - front/back/full-stack devs - smart contract devs (ETH) - UI/UX designers - ...",
    "content": "<div>                  <span>SpankChain (ethereum + porn) is hiring:<p>- front/back/full-stack devs</p><p>- smart contract devs (ETH)</p><p>- UI/UX designers</p><p>- project managers</p><p>- technical customer support</p><p>- community manager</p><p>- social media</p><p>We have offices in LA and Toronto, and half our team is remote.</p><p>Email me your CV: hello@spankchain.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 10:35:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "yOcYr75ZSESd0UDil3Fm-A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/305420-data-scientist-bounties",
    "title": "Data Scientist - Bounties",
    "content": "<div><h2>Data Scientist - Bounties at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Data Science, Machine Learning, Data Science, Python, Perl, R, NLP</div><div>Compensation</div><div>$90K–$120K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ConsenSys is a venture production studio focused on building and scaling tools and enterprise software products powered by Ethereum. Our mission is to use these solutions to power the emerging economic, social, and political operating systems of the planet.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, security and infrastructure, and more. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p> <br>About the Bounties Network:</p><p>Bounties have existed for thousands of years as a tool to incentivize the completion of tasks; now the Bounties Network creates an open standard to manage bounties on all tasks, paying in any Ethereum token. We’re working to make it cheaper and easier to outsource work to the free market, so organizations can organize dynamically around what needs to get done. Visit <a href='https://bounties.network' rel='nofollow'>https://bounties.network</a> for more details.</p><p>About the Role</p><p>Developers at the Bounties Network will focus on building quickly, continuously iterating and shipping new updates.  Developers at the Bounties Network should be passionate about bringing blockchain applications to the tourist users—  the mainstream. On the Bounties Network team, you’ll enjoy an inclusive and open culture, centred around constantly exchanging positive and negative feedback. We are always iterating and improving our work, our culture, and ourselves. As a Data Scientist at the Bounties Network, you’ll help architect the off-chain systems needed to create meaningful on-chain experiences.</p><p> <br>Requirements:</p><p>* Familiarity with continuous integration and deployment<br>* Basic knowledge of relational and non-relational data stores like Postgres, MySQL, MongoDB, etc.<br>* Experience programming with Python (SKLearn, Scipy, Numpy), R<br>* Must be able to work autonomously and be self-motivated</p></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:40:39 PM",
    "tags": [
      "Brooklyn",
      "Data Science",
      "Data Scientist",
      "Full Time",
      "Machine Learning, Data Science, Python, Perl, R",
      "NLP",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "nPxoq60kTPWYvNYBvMMMJQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Software+Sales+Representative&c=Ranorex&l=Remote&jk=0b6e9aa9f8b489d2&rtk=1c5g89oku144k3lk&from=rss",
    "title": "Software Sales Representative - Ranorex - Remote",
    "content": "<div><b>Software Sales Representative</b><br><span>Ranorex</span>     -<span>Remote</span>    </div><span><p><b>Job Summary</b></p><p>Ranorex develops high-quality test automation products helping more than 3000 companies worldwide ensuring the quality of their products and IT systems. Our award-winning test automation tools continue to set new standards for software quality assurance through functional testing of the user interface of <b>desktop, web and mobile applications</b> .</p><p>We are looking for an experienced <b>Software Sales Representative</b> with the ability to <b>work remote</b> to further grow our customer base in the UK region via phone and e-mail.</p><p><b>Responsibilities and Duties</b></p><ul><li>Maintain excellent knowledge of our portfolio of products and services in order to understand customers’ needs</li><li>Manage existing accounts to ensure sustainable customer satisfaction</li><li>Following up with new clients to ensure success of first test automation projects</li><li>Working with sales and engineering to ensure client concerns are addressed</li><li>Documenting customers’ needs using Sales Force</li><li>Developing and managing customer relations</li><li>Qualifying new leads and identifying business potential for both prospective and existing clients</li></ul><p><b>Qualifications and Skills</b></p><ul><li>1-2 years of software and/or technology sales</li><li>Bachelor degree in BA or IT related field</li><li>Outstanding written and verbal communication skills</li><li>Excellent customer service skills</li><li>Strong organizational skills, attention to detail, and a passion for accuracy</li><li>Ability to work independently and a high degree of self-motivation</li><li>Flexibility to thrive in a small office environment</li></ul><p><b>Interested?</b></p><p>Please send your CV and cover letter to: jobs(at)ranorex.com. We thank all applicants for their interest, however only those candidates selected for an interview will be contacted.</p><p>Job Type: Full-time</p><p>Required experience:</p><ul><li>Sales: 1 year</li></ul><p>Required education:</p><ul><li>Bachelor's</li></ul></span>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 12:27:15 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "-jdqfmTbTLeJRxA3dCs39g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Software+Sales+Representative&c=Ranorex&l=Remote&jk=0b6e9aa9f8b489d2&rtk=1c5gchuka92paene&from=rss",
    "title": "Software Sales Representative - Ranorex - Remote",
    "content": "<div><b>Software Sales Representative</b><br><span>Ranorex</span>     -<span>Remote</span>    </div><span><p><b>Job Summary</b></p><p>Ranorex develops high-quality test automation products helping more than 3000 companies worldwide ensuring the quality of their products and IT systems. Our award-winning test automation tools continue to set new standards for software quality assurance through functional testing of the user interface of <b>desktop, web and mobile applications</b> .</p><p>We are looking for an experienced <b>Software Sales Representative</b> with the ability to <b>work remote</b> to further grow our customer base in the UK region via phone and e-mail.</p><p><b>Responsibilities and Duties</b></p><ul><li>Maintain excellent knowledge of our portfolio of products and services in order to understand customers’ needs</li><li>Manage existing accounts to ensure sustainable customer satisfaction</li><li>Following up with new clients to ensure success of first test automation projects</li><li>Working with sales and engineering to ensure client concerns are addressed</li><li>Documenting customers’ needs using Sales Force</li><li>Developing and managing customer relations</li><li>Qualifying new leads and identifying business potential for both prospective and existing clients</li></ul><p><b>Qualifications and Skills</b></p><ul><li>1-2 years of software and/or technology sales</li><li>Bachelor degree in BA or IT related field</li><li>Outstanding written and verbal communication skills</li><li>Excellent customer service skills</li><li>Strong organizational skills, attention to detail, and a passion for accuracy</li><li>Ability to work independently and a high degree of self-motivation</li><li>Flexibility to thrive in a small office environment</li></ul><p><b>Interested?</b></p><p>Please send your CV and cover letter to: jobs(at)ranorex.com. We thank all applicants for their interest, however only those candidates selected for an interview will be contacted.</p><p>Job Type: Full-time</p><p>Required experience:</p><ul><li>Sales: 1 year</li></ul><p>Required education:</p><ul><li>Bachelor's</li></ul></span>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 12:27:15 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "G2nwn1FWTjKRRJHNTBkIZw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Software+Sales+Representative&c=Ranorex&l=Remote&jk=0b6e9aa9f8b489d2&rtk=1c5gm7ns49ma3ej6&from=rss",
    "title": "Software Sales Representative - Ranorex - Remote",
    "content": "<div><b>Software Sales Representative</b><br><span>Ranorex</span>     -<span>Remote</span>    </div><span><p><b>Job Summary</b></p><p>Ranorex develops high-quality test automation products helping more than 3000 companies worldwide ensuring the quality of their products and IT systems. Our award-winning test automation tools continue to set new standards for software quality assurance through functional testing of the user interface of <b>desktop, web and mobile applications</b> .</p><p>We are looking for an experienced <b>Software Sales Representative</b> with the ability to <b>work remote</b> to further grow our customer base in the UK region via phone and e-mail.</p><p><b>Responsibilities and Duties</b></p><ul><li>Maintain excellent knowledge of our portfolio of products and services in order to understand customers’ needs</li><li>Manage existing accounts to ensure sustainable customer satisfaction</li><li>Following up with new clients to ensure success of first test automation projects</li><li>Working with sales and engineering to ensure client concerns are addressed</li><li>Documenting customers’ needs using Sales Force</li><li>Developing and managing customer relations</li><li>Qualifying new leads and identifying business potential for both prospective and existing clients</li></ul><p><b>Qualifications and Skills</b></p><ul><li>1-2 years of software and/or technology sales</li><li>Bachelor degree in BA or IT related field</li><li>Outstanding written and verbal communication skills</li><li>Excellent customer service skills</li><li>Strong organizational skills, attention to detail, and a passion for accuracy</li><li>Ability to work independently and a high degree of self-motivation</li><li>Flexibility to thrive in a small office environment</li></ul><p><b>Interested?</b></p><p>Please send your CV and cover letter to: jobs(at)ranorex.com. We thank all applicants for their interest, however only those candidates selected for an interview will be contacted.</p><p>Job Type: Full-time</p><p>Required experience:</p><ul><li>Sales: 1 year</li></ul><p>Required education:</p><ul><li>Bachelor's</li></ul></span>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 12:27:15 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "BDtUmgvQTvePr-gMzEDaXw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Software+Sales+Representative&c=Ranorex&l=Remote&jk=0b6e9aa9f8b489d2&rtk=1c5gsus169tlkba1&from=rss",
    "title": "Software Sales Representative - Ranorex - Remote",
    "content": "<div><b>Software Sales Representative</b><br><span>Ranorex</span>     -<span>Remote</span>    </div><span><p><b>Job Summary</b></p><p>Ranorex develops high-quality test automation products helping more than 3000 companies worldwide ensuring the quality of their products and IT systems. Our award-winning test automation tools continue to set new standards for software quality assurance through functional testing of the user interface of <b>desktop, web and mobile applications</b> .</p><p>We are looking for an experienced <b>Software Sales Representative</b> with the ability to <b>work remote</b> to further grow our customer base in the UK region via phone and e-mail.</p><p><b>Responsibilities and Duties</b></p><ul><li>Maintain excellent knowledge of our portfolio of products and services in order to understand customers’ needs</li><li>Manage existing accounts to ensure sustainable customer satisfaction</li><li>Following up with new clients to ensure success of first test automation projects</li><li>Working with sales and engineering to ensure client concerns are addressed</li><li>Documenting customers’ needs using Sales Force</li><li>Developing and managing customer relations</li><li>Qualifying new leads and identifying business potential for both prospective and existing clients</li></ul><p><b>Qualifications and Skills</b></p><ul><li>1-2 years of software and/or technology sales</li><li>Bachelor degree in BA or IT related field</li><li>Outstanding written and verbal communication skills</li><li>Excellent customer service skills</li><li>Strong organizational skills, attention to detail, and a passion for accuracy</li><li>Ability to work independently and a high degree of self-motivation</li><li>Flexibility to thrive in a small office environment</li></ul><p><b>Interested?</b></p><p>Please send your CV and cover letter to: jobs(at)ranorex.com. We thank all applicants for their interest, however only those candidates selected for an interview will be contacted.</p><p>Job Type: Full-time</p><p>Required experience:</p><ul><li>Sales: 1 year</li></ul><p>Required education:</p><ul><li>Bachelor's</li></ul></span>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 12:27:15 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "_1fNdPe1RNukngaMx9QFeQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16288281",
    "title": "SpankChain is also hiring: - front/back/full-stack devs - smart contract devs (ETH) - UI/UX designers - project ...",
    "content": "<div>                  <span>SpankChain is also hiring:<p>- front/back/full-stack devs</p><p>- smart contract devs (ETH)</p><p>- UI/UX designers</p><p>- project managers</p><p>- technical customer support</p><p>- community manager</p><p>- social media</p><p>We have offices in LA and Toronto, and half our team is remote.</p><p>Email me your CV: hello@spankchain.com</p><p>P.S. If you get an offer from PornHub for their &quot;top secret project&quot; (aka, pornhub ICO), let us know! We'll beat their offer.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 6:00:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "_6UG0w3nQWa3vJJGYQNJvA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/health-hero/jobs/53251-senior-software-engineer",
    "title": "Senior Software Engineer",
    "content": "<div><h2>Senior Software Engineer at Health Hero</h2><div>San Francisco, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Machine Learning, Ruby, RESTful Services, PostgreSQL, Natural Language Processing, REST APIs, Ruby on Rails, REST, Bootstrap, Voice Recognition, Linode, Slim, Deep Learning</div><div>Compensation</div><div>$110K–$190K<br>1.0%–6.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>It's fun to work in a company where people truly believe in what they're doing. At Health Hero, we're committed to bringing passion and customer focus to the business of enterprise health &amp; wellness. We work hard, and we're serious about health &amp; having fun.</p><p>Responsibilities:</p><p>Health Hero is seeking a senior Ruby on Rails engineer with an affinity for Go/Golang (or to learn) to support the next phase of growth of our platform: Scaling to hundreds of thousands of patients &amp; employees all over the world over the next year.</p><p>As our senior engineer, your code will enable a magical health engagement experience: Engaging people in their health via mobile, devices, web, phone calls (voice), text, and chatbots. All by doing in the simplest and most fun way possible with a great user experience, gamification, and empathy built into the product. Your team's technology will make that possible.</p><p>You will work closely with our Founder/CEO, VP of Service Delivery, and CTO to define the future of the company's technology. He or she will manage their own team, including new integrated systems &amp; API projects.</p><p>This is a role for a brilliant and experienced technology leader with a mindset for growth &amp; user empathy.</p><p>Our primary software stack involves Ruby on Rails, Linode, PostgreSQL, Javascript, React Native, Bootstrap, AI, ML, DL, &amp; 10+ API integrations via REST. </p><p>- Build Golang/Go-based Microservices<br>- Set up continuous development, containerization, and delivery methods to our clients<br>- Build autonomous, highly scalable, and integrated Microservices <br>- Design a scalable solution to improve our software, using the latest technologies in NLP &amp; ML <br>- Develop a cycle and side-effect prediction engine using user input data <br>- Build out a two-sided marketplace to connect patients &amp; employees to the best multi-channel health experiences.<br>- Collaborate with peers to define product vision, roadmap &amp; ship new features <br>- Develop, test, and iterate on prototypes quickly<br>- Passion for meeting with clients &amp; iterating rapidly to delight them<br>- Experience and/or passion &amp; curiosity for machine learning, algorithms, data science<br>- History of leading a tech team in a startup environment<br>- At least 4+ years experience with Ruby on Rails<br>- At least 4+ years experience with JavaScript<br>- Eye for great design&nbsp;<br>- Experience designing and implementing browser-based user interfaces using AJAX, REST, and/or JSON. Relational Database experience: PostgreSQL, etc<br>- Experience scaling high traffic websites (architecture/database)<br>- Personal projects that show an aptitude for engineering and product sense<br>- Experience with server administration and Amazon Web Services (EC2 / S3). Linode, EngineYard, or Heroku cloud platforms</p><p>Skills Needed:</p><p>- Excellent communication skills<br>- Responsive and super dependable&nbsp;<br>- Experience managing onshore and offshore developers<br>- Experience with agile, iterative, and test-driven development methods<br>- Ability to work with little direction in a fast paced start-up environment<br>- Wants to make meaning in their life by helping to improve the health of others<br>- Previous experience using ERB, Slim, and many RESTful API integrations</p><p>Nice to have:</p><p>- React Native (or a willingness to learn React Native)<br>- Into fitness or quantified self<br>- Data Science expertise<br>- Voice application expertise</p><p>Please include GitHub, Stack Overflow, and/or Twitter accounts if available.</p><p>About Health Hero:</p><p>We are a passionate team. We exist to improve the lives of millions of people around the world. We are talking about saving real lives here, and doing so in the simplest, most rewarding, and loving way possible.</p><p>Vision: To be the health engagement platform of choice for payers &amp; providers</p><p>Mission: By providing the best health engagement experiences</p><p>Values: Love, Greatness, Unity</p><p>Patient Engagement: 1-minute demo - <a href='https://youtu.be/nMbYlbzIQlc' rel='nofollow'>https://youtu.be/nMbYlbzIQlc</a><br>Employee Wellness: 1-minute demo - <a href='https://youtu.be/mP44y08sEeY' rel='nofollow'>https://youtu.be/mP44y08sEeY</a></p><p>Are you ready to Hero Up?</p><p><a href='http://www.gohealthhero.com/' rel='nofollow'>http://www.gohealthhero.com/</a></p></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 10:10:57 PM",
    "tags": [
      "Bootstrap",
      "Full Time",
      "Full-Stack Developer",
      "Machine Learning",
      "Natural Language Processing",
      "PostgreSQL",
      "REMOTE1/100",
      "REST",
      "REST APIs",
      "RESTful Services",
      "Remote OK",
      "Ruby",
      "Ruby on Rails",
      "San Francisco",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown",
      "Voice Recognition"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "frontend",
      "ruby"
    ]
  },
  {
    "id": "SqF_gxhgTDCyQaPsQJNuZw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16285040",
    "title": "Imgur | San Francisco | Full Time | Data Analyst, Android Engineer | ONSITE/REMOTE",
    "content": "<div>                  <span>Imgur | San Francisco | Full Time | Data Analyst, Android Engineer | ONSITE/REMOTE<p>Imgur is the best place to share and enjoy the most awesome images on the Internet. Every day, millions of people use Imgur to be entertained and inspired by funny, heartwarming and helpful images and stories from all around the world. Come have an impact on the lives of millions of people, while working in a fun and collaborative environment. We have a small engineering team, so each engineer is responsible for solving challenges at a massive scale.</p><p>Our tech stack consists of PHP, Go, Node, Redis, Memcached, MySQL, DynamoDB, and is all hosted on AWS. Our interview process is short and sweet. It consists of a phone screen with a recruiter, followed by a Skype coding interview, followed by a half day on site interview. Interested? Check out our open positions!</p><p><a href='http://imgur.com/jobs' rel='nofollow'>http://imgur.com/jobs</a> If you have any questions about the open positions or want to know what it's like to work at Imgur (I'm one of the full stack devs) feel free to e-mail me at max@you know where.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 9:33:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "SIBECKpZQ_Skl5A2mol4Iw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283974",
    "title": "Thorn | San Francisco or Remote (US based) | Full-time | $100k - $150k | Software Engineer",
    "content": "<div>                  <span>Thorn | San Francisco or Remote (US based) | Full-time | $100k - $150k | Software Engineer<p>Thorn is a non-profit focused on building technology to defend children from sexual abuse. Working at Thorn gives you the opportunity to apply your skills, expertise and passions to directly impact the lives of vulnerable and abused children. Our staff tackles dynamic, quickly evolving problems with our network of partners from tech companies, NGO’s and law enforcement agencies. If you are able to bring clarity to complexity and lightness to heavy problems, you might be a great fit for our team.</p><p>You will work on our dark web investigation tool, as well as a variety of other projects. Examples of projects include our Child Finder Service, in which we apply computer vision to find missing children, and our Industry Toolkit, which will be used to clean online communities of child abuse. You will also participate in broad exploration to fight child abuse and trafficking. The work spans engineering and data science topics from security to artificial intelligence — including adaptive crawling, statistical analysis, search, machine learning (NLP, computer vision, sentiment analysis), data pipeline development, and UX design.</p><p>Requirements:</p><p>- Professional software development experience</p><p>- Adept at quickly learning new technologies</p><p>- Experience implementing, testing, and deploying code to production</p><p>- Skilled at rapidly prototyping applications</p><p>- Ability to collaboratively solve problems with internal and external stakeholders</p><p>- Clear, efficient, and eloquent communicator — we are a distributed team, so written communication is crucial, from Slack to pull requests</p><p>Apply today! <a href='http://grnh.se/mdial42' rel='nofollow'>http://grnh.se/mdial42</a></p><p>For more general information about Thorn, see <a href='https://www.wearethorn.org/' rel='nofollow'>https://www.wearethorn.org/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:56:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "kzyusLrZTBO07tUJI5Ny2Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283679",
    "title": "ExecVision | Sr Software Engineer | Arlington, VA | Full-Time | On-Site or Remote",
    "content": "<div>                  <span>ExecVision | Sr Software Engineer | Arlington, VA | Full-Time | On-Site or Remote<p>We're building conversation analytics to help our clients understand and use what's going on in their phone calls. Our tech stack: React, Python, Kotlin, Postgres, ElasticSearch, Keras, Tensorflow. We're looking for full stack engineers with either Python, Java, or Kotlin, some frontend experience, and a passion for creating great product.</p><p>careers@execvision.io<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:25:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "frontend",
      "mobile"
    ]
  },
  {
    "id": "deNxDOB4ScSf9GVtIHBvwQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/65113/full-stack-developer-at-searchsmartly/",
    "title": "Full-stack developer",
    "content": "Property search is a frustrating process for all parties involved. In the future, buyers and renters will be instantly matched to the homes that best meet their needs, saving hours of otherwise wasted time researching properties and neighbourhoods. SearchSmartly is that future. <br /><br />SearchSmartly is an angel-backed, MVP-stage startup and the winner of the London Business School Launchpad (2017) competition. Our team has a broad background in technology, strategy, sales, and real estate from firms such as Microsoft, Salesforce, BCG, Red Bull Racing F1 Team, Citi, and Countrywide.<br /><br />Job Description:<br /><br />From day one, you’ll make key technical product decisions and will have a key voice in evolving our prototype into a commercial SaaS product. <br />You’ll take ownership of our full technology stack, and will apply machine learning to help predict buyer and renter needs. <br />Entrepreneurial spirit is a key aspect of this position - there is a strong possibility for your role to quickly grow into an equity-heavy CTO position. <br />In this position, you’ll also take on additional responsibilities to shape our long-term product roadmap.<br /><br />Our ideal candidate is someone that... <br />…has a ‘get shit done’ attitude <br />…is numerically-driven to test hypotheses and iterate on the product <br />…is comfortable with owning work streams from data collection and preprocessing to integration into models <br />…is able to work reasonably autonomously (remote working is fine) while providing regular team updates <br />…is available ASAP (an initial part-time role is possible)<br /><br />Although experienced candidates are preferred, we will also consider recent graduates.<br /><br />What We're Building:<br /><br />Our first product is a tool for estate agents that lowers their costs and lifts revenues by allowing agents to quickly capture, address, and predict buyer’s and renter’s property requirements. This tool allows applicants to be instantly matched to the homes that don't simply meet their budgets, but also their underlying lifestyle needs.",
    "urlFetchPending": false,
    "published": "Jan 15, 2018 12:35:34 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "ekW6DombRnixLbNcH94i3Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/shooju/jobs/97048-customer-facing-data-engineer",
    "title": "Customer-Facing Data Engineer",
    "content": "<div><h2>Customer-Facing Data Engineer at Shooju</h2><div>Earth, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Python, Javascript, Customer Service, Data Analysis, SQL, R, Microsoft Excel, ElasticSearch</div><div>Compensation</div><div>$70K–$120K<br>0.4%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Please apply if you:</p><p>* are very comfortable in Excel<br>* are even more comfortable in Python<br>* love tinkering with file formats, big data files, database interfaces, APIs, etc<br>* love figuring out how to automate that tinkering even more<br>* get a bit bored of core coding and prefer to be closer to the people (&quot;the business&quot; or &quot;the client&quot;)<br>* get excited about over-delivering on expectations<br>* and like the flexibility of working remotely with an international team</p></div>",
    "urlFetchPending": false,
    "published": "Jan 12, 2018 10:03:02 PM",
    "tags": [
      "Customer Service",
      "Data Analysis",
      "Data Scientist",
      "Earth",
      "ElasticSearch",
      "Full Time",
      "Javascript",
      "Microsoft Excel",
      "Python",
      "R",
      "REMOTE1/100",
      "Remote OK",
      "SQL",
      "Software Architect",
      "Software Engineer",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "UzyLofz1RJKPMnvWOvQPlQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Security+Data+Scientist&c=Redbud+Global+Services&l=Work+at+Home&jk=e6eab076079429c8&rtk=1c5g89o025i96838&from=rss",
    "title": "Security Data Scientist - Redbud Global Services, Inc. - Work at Home",
    "content": "<div><b>Security Data Scientist</b><br><span>Redbud Global Services, Inc.</span>     -<span>Work at Home</span>    <div>        <span>Full-time,&nbsp;Other</span>        </div></div><span><p><b>Job Summary</b></p><p>Our client specializes in User and Entity Behavioral Analytics (UEBA) for information security. They have spent the last year building a platform which captures detailed information about interactions between users, systems, applications and devices. We are now looking for an experienced Security Data Scientist who can transform our data into valuable insights and augment their platform.</p><p>In this role, you will work closely with the CTO to understand the objectives of their customers and shape the Data Science road map and vision for the company Platform. You will analyze data, choose analytical techniques and develop novel approaches to machine learning within our market. This is a senior position and we expect the person filling it to be able to start contributing in a practical manner very quickly.</p><p><b>Qualifications</b></p><ul><li>Strong Communication and Problem-Solving Skills</li><li>A self-motivated and organized player. We are a team which believes in supporting each other as peers rather than a “top-down” hierarchy.</li><li>Ability to work well in a rapid agile development environment and create proof of concept implementations; engaging the development team and external Data Science shops to create a production ready outcome.</li><li>An applied Machine Learning (ML) background with proven experience in the areas of classification, clustering, neural networks etc.</li><li>Proficiency in Machine Learning Toolkits and/or Programming Languages which may include all or a subset of Python, Java, Scala, Spark, Tensor Flow. Spark is currently a preferred toolset.</li><li>Proficiency in Amazon Web Services (AWS) is an asset.</li><li>A background in the Security Space is an asset.</li></ul><p>This is a full-time telecommute position, with occasional visits to our headquarters in the Detroit area. If this sounds like you and you want to change how organizations can protect themselves from hackers and malicious users please contact us with information about yourself and why this position is a good match for you.</p><p>Job Type: Full-time</p><p>Required experience:</p><ul><li>Machine Learning: 3 years</li><li>Python: 3 years</li><li>Java: 3 years</li><li>Scala: 3 years</li><li>Spark: 3 years</li><li>Tensor Flow: 3 years</li></ul></span>",
    "urlFetchPending": false,
    "published": "Jan 11, 2018 7:03:26 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "AOk09CuUQBSx0IUmmnaArQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/164322/elm-developer-redelastic-inc?a=T6J5a0ebaKI",
    "title": "Elm Developer at RedElastic Inc. (Toronto, ON, Canada) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>RedElastic is seeking a talented Elm Developer on contract to help us deliver the next generation of user experiences to our client. We need a leader to keep us sharp on all corners of front end architecture and development. The role offers a chance to work with the latest technologies an industry leading rate. </p> <ul> <li>Architect the front-end of our client's website, contributing both code and user experience suggestions</li> <li>Contribute to the internal body of knowledge such as design, code, and API documentation</li> <li>Enhance our processes and practices for team collaboration around planning, design, and requirements gathering for new product features</li> <li>Review all code for correctness, style, and security</li> <li>Favour empirical evidence over hunches by using analytics and other methods such as A/B testing to identify the ideal upgrades to platform level code and feature level code</li> <li>Coach and mentor our clients' developers, leading by example and embracing the principles of servant leadership</li> </ul><br><p><strong>Benefits</strong></p><br><p>RedElastic is a small company without the bureaucracy of traditional consulting firms. We're very selective about who we hire, and even more selective about the client work we take on. This means you'll have a direct impact on the type of work we do as a team, together. RedElastic is a consulting company started by technologists, for technologists.</p><p><strong>The benefits of working at RedElastic:</strong></p><ul> <li>Top-shelf compensation (contract basis)</li> <li>We will consider fully remote candidates, or you can work in our office Downtown Toronto (your choice!)</li> <li>The ability to make a difference without the traditional boundaries of an enterprise role; create unique and compelling solutions without a hint of micromanagement</li> <li>Take your career to the next level by participating in conferences, contributing to our blog, or even working on a book with us (we’ll help you achieve your career goals in any way we can)</li> </ul>                    </div>                            <h2>                About RedElastic Inc.            </h2>            <div><p>RedElastic is a software consulting firm specializing in full-stack development, distributed computing, and big data. Our mission is to change the face of consulting. We're bringing the best and brightest developer talent in Canada under one roof in order to work on the most interesting problems in computing. If you have an interest in distributed systems and machine learning, along with the desire to work on challenging projects in order to take us both to the next level, we’d love to hear from you.</p>            </div>        ",
    "urlFetchPending": false,
    "published": "Jan 4, 2018 10:12:25 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "o3NuReWkSAqMnB73UIXrDQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/164297/data-engineer-lynx-analytics?a=T6cQXSLPUbu",
    "title": "Data Engineer at Lynx Analytics (Düsseldorf, Germany) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data, Data &amp; Analytics</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong><strong>Job Title: </strong>Data Engineer</strong></p><p><strong><strong>Location: Europe ( Germany / Netherlands/ Budapest/ Poland)&nbsp;</strong></strong></p><p><strong><strong>Remote working available&nbsp;</strong></strong></p><p><strong><strong>About the company</strong></strong></p><p>Founded in 2010, Lynx Analytics is a predictive analytics company run by world-class quantitative marketing scientists and industry experienced data scientists. Our focus is on solving big challenges primarily through the deployment of our proprietary big graph analytics platform, which is based on a powerful Hadoop and Apache Spark back-end.</p><p>Our head office is in Singapore and we have operations in Hong Kong, USA, Hungary, Indonesia and presence in a few other southeast Asian countries. Our teams' qualifications are global, including Professors, PhDs, MScs, and MBAs from Ivy League, INSEAD and NUS, as well as experience at blue-chip tech and analytics companies, and other start-ups. It is the combination of our insightful frameworks, product development capabilities, and these qualifications, which are the true value of Lynx's proposition.</p><p>Lynx Analytics technology is already deployed across the region for various clients, and there is significant growth potential for the company as well as numerous career opportunities as we scale up our operations.</p><p><strong><strong>Job description</strong></strong></p><p>Lynx Analytics is looking for a Software Engineer to work on automating and productizing advanced big data transformation and analytics pipelines. You would be working with standard big data technologies (Hadoop, Spark, etc) as well as our proprietary big graph analysis framework. The ideal candidate would be someone with onsite B2B experience while dealing with enterprise technology deployment. He/she should be able to liaise with internal technology teams and work in a multi-stakeholder environment.</p><p><strong><strong>Requirements</strong></strong></p><ul><li>Strong programming skills</li><li>Solid knowledge of Python and Java</li><li>Good understanding of the Linux operating system including basic sysadmin and shell scripting abilities</li><li>SQL</li><li>Experience in project delivery in a B2B setting</li><li>Good problem solving skills</li><li>Fluency in English</li><li>Willingness to travel</li></ul><p><strong><strong>Desirable:</strong></strong></p><ul><li>Experience in Big Data</li><li>Experience in data science or analytics</li><li>Industry experience in working for a big enterprise (like our clients)</li></ul><p><strong><strong>What we offer:</strong></strong></p><ul><li>Opportunity to work on creating innovative, bleeding edge data science pipelines using our state of the art, in-house built big graph tool</li><li>Work closely with the developers of the (big graph) tool you will be building upon</li><li>Be a member of a very strong team with mathematicians, ex-Googlers, Ivy League professors, INSEAD alumni business people and telco industry experts</li><li>Startup atmosphere</li><li>Competitive salary</li><li>Stock options for employees</li><li>Opportunity to travel (South East Asia, US, Europe, ...)</li><li>Flexible working hours, family-friendly workplace</li></ul>                    </div>                            <h2>                About Lynx Analytics            </h2>            <div><p>Lynx Analytics is a global company, but this page is set up to highlight our Budapest office at the moment. It is a fast-growing research &amp; development lab with around 10 engineers currently.</p><p>The details below all apply to the Budapest office, and some of them apply to the company as a whole as well.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Public transportation to the office                            </div>                            <div>                                 Entirely flexible hours                            </div>                            <div>                                 Great restaurants nearby                            </div>                            <div>                                 New hire will sit next to CTO                            </div>                            <div>                                 Backed by revenue + investment                            </div>                            <div>                                 Starcraft and board games                            </div>                    ",
    "urlFetchPending": false,
    "published": "Jan 4, 2018 10:12:25 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "t4gm5YnpQ_Ck_NVHBp4NGA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16057796",
    "title": "Takt | Dev Ops, Infrastructure Security, Engineering Manager, Project Manager, Customer Success, Marketing Analyst, Data Analyst ...",
    "content": "<div>                  <span>Takt | Dev Ops, Infrastructure Security, Engineering Manager, Project Manager, Customer Success, Marketing Analyst, Data Analyst | San Francisco, CA | REMOTE or ONSITE, FULLTIME | Takt uses machine learning to provide personalization to fortune 500s. We are a bunch of happy polyglots, mostly functional, with a strong emphasis on Haskell and Scala.<p>I’ve been a senior engineer at Takt for over a year now and I love it. We have great benefits and are well taken care of. If you’d like to get in our hiring pipeline let me know with and email at schell@takt.com.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 5:00:06 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "8IsmURqGQ5SnoN4nFkGAJg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16057547",
    "title": "Doximity | Data Engineer, Data Scientist, Software Engineer, DevOps Engineer | San Francisco | REMOTE & ONSITE, FULL-TIME ...",
    "content": "<div>                  <span>Doximity | Data Engineer, Data Scientist, Software Engineer, DevOps Engineer | San Francisco | REMOTE &amp; ONSITE, FULL-TIME | Salary $110k+ &amp; Equity | <a href='https://work.doximity.com' rel='nofollow'>https://work.doximity.com</a><p>We're helping doctors communicate more effectively to enhance the quality of care. Doximity is the largest professional network of Healthcare professionals with adoption by over 75% of all U.S. Clinicians. Started in 2011, we've raised $82MM from DFJ, Emergence, and Morgenthaler Ventures. Our R&amp;D team is about 120 people roughly 50% of which is fully distributed. We have one of the richest healthcare data sets ever compiled.</p><p></p><pre><code>  Tech Stack: Web: Ruby, Rails, Vuejs, Go, iOS, Android   Data Stack: Redshift, Kafka, Spark, Python, Airflow, Neo4j  DevOps Stack: AWS, Terraform, Chef, Nginx</code></pre>We are looking for Full-stack software engineers, Data Engineers, Data Scientists, and DevOps Engineers to help build, maintain, and continue to scale our current infrastructure. I am the VP, Engineering at Doximity and have been with the company for almost 7 years.<p>Apply directly: <a href='https://work.doximity.com/positions/' rel='nofollow'>https://work.doximity.com/positions/</a> - Remote positions within the U.S. and Canada only.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 4:00:05 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "XuXprzQQRjOQ43fGcRtX8w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16057371",
    "title": "CrowdStaffing | Software Engineers | Montreal, QC | ONSITE or REMOTE | Full-time",
    "content": "<div>                  <span>CrowdStaffing | Software Engineers | Montreal, QC | ONSITE or REMOTE | Full-time<p>Crowdstaffing (crowdstaffing.com) Harness the Collective Intelligence of Thousands of Skilled Recruiters to Hire Amazing Talent</p><p>We are looking to find software developers to expand new features in candidate modeling and job matchings. If you have experience in NLP, Machine Learning or Algorithmic Game Theory and are comfortable implementing your solutions in code, please send a email to meng@crowdstaffing.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 3:00:06 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "mpYaKMcsSHGwVNpGAngbjg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16053547",
    "title": "Oxeon | Healthcare Data Scientist | San Mateo, CA | Onsite or Remote (US only), Contract | $110-$150 /hour | https://www.oxeonpartners.com Entrepreneurial ...",
    "content": "<div>                  <span>Oxeon | Healthcare Data Scientist | San Mateo, CA | Onsite or Remote (US only), Contract | $110-$150 /hour | <a href='https://www.oxeonpartners.com' rel='nofollow'>https://www.oxeonpartners.com</a><p>Entrepreneurial data scientist needed to find insights and patterns in large healthcare data sets that will be used to assist cancer diagnosis and treatment decision making.</p><p>We are currently working with the a number of the nation’s most recognized oncologists and working with two large cohorts of medical records containing tens of millions of patient data points.</p><p>Oxeon conceives, designs and validates new business concepts to then create and launch new healthcare technology and services companies, either in partnership with a strategic partner (e.g. large health systems) or as an independent de novo company. Our team is small, moves quickly and works with our network of the nation’s leading healthcare executives to source innovative ideas, hone them into compelling new businesses.</p><p>CONTACT: ds@oxeonpartners.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 7:42:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "MyOkUfZbTpWi8SfcoM7fug",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16052560",
    "title": "Endjin| UK | Full-Time, Remote w. London meetings | https://endjin.com",
    "content": "<div>                  <span>Endjin| UK | Full-Time, Remote w. London meetings | <a href='https://endjin.com' rel='nofollow'>https://endjin.com</a><p>Do you think you would like to come and explore what is happening in data, analytics and business transformation with us in 2018?</p><p>Are you the kind of person that just can't leave a question unanswered? Do you really want to know how things work, and share that knowledge with your team and the wider community? Do you understand how people and technology can come together to craft something special, each reshaping the other?</p><p>Endjin are hiring developers at all levels, from apprentices to seniors, to work on exciting projects with clients from all over the world, in verticals from retail to financial services, utilities and media.</p><p>We build modern data platforms in the cloud, and use them to help businesses adopt machine learning, data science, and automation.</p><p>We increase our value by using our products, blueprints and library of intellectual property, sharing the benefit with our clients and partners.</p><p>We also structure innovation programmes, process improvement, and DevSecOps, as well as delivering production-ready code, cloud infrastructure, and thought-leadership content.</p><p>We value life-long learning and an eye for quality. We will help you to find the best learning techniques, tools, and team-working, so that you can achieve your potential, and deliver the best value to our clients; while balancing your personal goals and home life.</p><p>Our employees have a mutual respect, regardless of where they are in their career. Ideas are developed by the whole team, from interns to seniors.</p><p>Equally, our clients pass the &quot;nice to work for&quot; test (and usually do so with flying colours). As part of that, we try to understand the ethical implications of the work we undertake. We seek to do the best we can for each other, for our profession, clients, and for the world at large.</p><p>With no external investors, endjin has been built as a sustainable, lifelong business: we are a company to retire out of, not exit at the expense of the employees.</p><p>You can work remotely from anywhere in the UK, and we hold meet-ups in London on a regular basis. You design your ideal working environment, and we will make it happen together.</p><p>Apart from a real passion for learning, you probably dream in data - how it can be represented, handled, secured and manipulated. A bit of maths improves your day. You know a couple of programming languages pretty well (we do a lot of C# and Typescript, but you may know R, or Python too). You love working with other people, but value the opportunity to spend time in your own head, thinking things through.</p><p>You can learn more about our projects at <a href='https://endjin.com' rel='nofollow'>https://endjin.com</a>, see a video about our career development pathways <a href='https://vimeo.com/200191869' rel='nofollow'>https://vimeo.com/200191869</a> or read our blog <a href='https://blogs.endjin.com' rel='nofollow'>https://blogs.endjin.com</a></p><p>Contact us on hello-at-endjin-dot-com if you think this looks like a good opportunity for you.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 5:58:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "chTYK-8pR3mDGbWTSNY1xQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Vice+President+Engineering&c=Crossover&l=Remote&jk=5100560f064ea9f9&rtk=1c303l19j4f0j96q&from=rss",
    "title": "Vice President of Engineering - Crossover - Remote",
    "content": "<div><b>Vice President of Engineering</b><br><span>Crossover</span>     -<span>Remote</span>    <div>        <span>                $100 a day</span>        </div></div><span>If you are a world-class software engineering leader with the intellectual curiosity and desire to execute to a drastically differentiated cutting edge new software engineering process; if you have a passion for metrics-driven approach to high quality software development; if you possess senior organizational leadership, combined with the deep technical experience necessary to manage software engineering for a portfolio of software companies generating $100M annually — this role is for you.<br><br>Company Description:<br><br>Aurea Software is a fast growing enterprise software company that delivers transformative customer experience through a variety of world class software products. The Aurea leadership team manages product management and engineering delivery for a collection of affiliated solutions, as such, a VP of Engineering will have the opportunity to lead a true multi-product, multi-domain, multi-team organization.<br><br>Aurea is a company with a long-term view on delivering customer success at a high level of efficiency and profitability. Aurea is a company with a strategy to grow both through expansion of its core business and through acquisition of additional software companies. Today we serve companies such as Disney, British Airways, PayPal, and Bank of America, helping them transform their customers’ experiences.<br><br>Job Description:<br><br>The Vice President of Engineering will serve as a key member of the global executive team for Aurea or one of its affiliated sister companies and will be responsible for quarterly high-quality product delivery. As part of the leadership team, you will be expected to run an engineering organization using a revolutionary and radically differentiated process. With a focus on small, great global teams, productivity, factory-like process, and quantifiable business impact, you will be expected to drive higher levels of value and productivity from your engineering organization than most companies would expect to achieve. You must build, develop and engage a team from a global talent pool. In doing so, you must set an agenda for the function where the teams effectively and efficiently solve some of the most challenging software problems with engineers distributed around the globe. You will leverage your personal technical depth as a as a former developer and architect in order to set a personal standard for Computer Science excellence, to push your teams and to assess the talent base you need to maintain.<br><br>Key Responsibilities:<br><ul><li>Drive rigorous, regular product releases across multiple, complex software products<br><br></li><li>Establish world-class standards and technical operations to deliver consistent, high-quality products across dispersed, global teams<br><br></li><li>Implement engineering management strategies to achieve world-class productivity and cost efficiency<br><br></li><li>Engage with customers and product managers to ensure that product delivery obsessively aligns with customer value creation<br><br></li></ul><ul><li>Transform existing teams of engineers and architects and development managers into a highly effective engineering function, including upgrading and reorganizing our talent as required<br><br></li><li>Engage and align top talent through strong recruitment, mentoring, hands-on architectural leadership and career management<br><br></li><li>Lead product technical due diligence and engineering talent assessment for 2-4 acquired or to-be-acquired companies each year<br><br></li><li>Transform acquired engineering teams into an effective and efficient global model to increase quality and reduce cost over pre-acquisition benchmarks<br><br></li></ul>Required Experience and Education:<br><ul><li>Bachelor’s Degree in Computer Science (MS or PhD preferred) is absolutely mandatory.<br><br></li><li>15+ years of engineering experience leading multiple teams across multiple products and technologies — this is a global leadership role for a seasoned software development leader, not a first executive role for a great software development manager<br><br></li><li>A huge plus if your experience is Software Engineering focused instead or product management<br><br></li><li>Proven experience in building high-performance teams and scalable best engineering practices<br><br></li><li>Spent 5 years in hands-on C++, Java or .NET architecture and programming in a hands-on, development-intensive individual contributor role<br><br></li><li>Recent experience with DevOps and Cloud architecture. We live in the Cloud.<br><br></li><li>Experience with high-end enterprise systems deployed in environments of Global 100corporation complexity<br><br></li></ul>Total compensation: $200,000/year<br><br>Location: Global<br><br>We’re one of the few legitimate companies offering high-paying jobs that are 100% remote, work from home. You never have to fight traffic to the office again and you have the freedom to choose when and where you put in your 40 hours to be most effective each week.<br><br>To qualify, please provide a resume/CV demonstrating the required experience and skills. From there, to help us find the top 1% of talent, there will be a series of interviews and online skills examinations. We realize these are challenging and can require a decent amount of time - so we thank you in advance for your efforts.</span>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 1:24:17 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/c",
      "TECH1/dotnet",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "c",
      "dotnet"
    ]
  },
  {
    "id": "r2wHTgr4QBG54H2z3TDdFQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/150168/data-engineer-casumo?a=OmqkNPkxeQo",
    "title": "Data Engineer at Casumo (Swieqi, Malta) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Casino, Entertainment, Gaming</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>What would be your role?</strong></p><p>Casumo is moving forward at a fast pace and the data we are processing is growing in size and variety each day. We are looking for colleagues who are eager to jump onto a moving wagon and work on interesting challenges, supporting our growing mission as things change and evolve on a daily basis.</p><p>Being a data engineer in Casumo means being part of a highly self-organized team, distributed across five European countries.</p><p>Although dispersed, our data team is keeping things tight - your tasks would be to work on third party integrations, consume information coming from a number of in-house data sources, provide engineering services to our data scientists and marketeers, deal with the challenges of our distributed systems, but above all, take care of the stability and performance of our data platform.</p><p><strong>Who are you?</strong></p><p>Since we are highly distributed geographically, you need to be a strong communicator, &nbsp;self-driven and self-motivated.</p><p>We are looking for autonomous people, but our team comes before our singularities - you should be a team player but able to drive your own initiatives and manage your workload.</p><p>You should also be prepared to work in the geekiest team in the company (with the best sense of humour).</p><p>Your background, ideally?&nbsp;Hadoop, Spark, AWS developer, batch processing, API integrations,&nbsp;SQL expert, data transformations and data heavy lifting, in general.</p><p><strong>Data engineer at Casumo, profile and required skills:&nbsp;</strong></p><ul><li>Strong skills in either Java, Scala, Python, Bash, SQL but familiar with all of them</li><li>Hadoop ecosystem, Spark, Hive, and data warehousing in general.</li><li>Broad knowledge of AWS cloud computing services (EMR, Data Pipelines, Redshift, …)</li><li>Experience in real-time processing or a big interest in it</li><li>Take care of the small details in order to make the big picture more beautiful</li><li>Have a desire to take full ownership of features and code, from inception of ideas to deployment, maintenance and keeping it running</li><li>Appreciate the concepts and principles underlying open-source culture and good software development</li><li>A person who loves to play with code and tools, understands the need of quality and cares about it</li></ul>                    </div>                            <h2>                About Casumo            </h2>            <div><p><strong>What is Casumo?</strong></p><p>Casumo as a company is a technology startup formed in 2012, Casumo as a product is a recognized and award-winning online casino. Casumo as a concept though, is literally a whole new universe. We’re not working with casino; we’re working on changing what the common perception of casino is. Through design, technology &amp; innovation we aim to disrupt a young, but in many ways immature, industry by ignoring rules.</p><p>Following initial success and growth Casumo is wholly committed to its focus on great technology as the driving force behind the way we work. We all share the responsibility of finding the right tools which allow us to preserve and fully embrace our belief in highly-networked and collaborative organizations over&nbsp;command and control hierarchy.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 300+ days of sun                            </div>                            <div>                                 Choose your hardware                            </div>                            <div>                                 Brand new funky offices                            </div>                            <div>                                 Great insurance &amp; medical plans                            </div>                            <div>                                 Passionate and talented collegues                            </div>                            <div>                                 Fully stocked soda fridge                            </div>                            <div>                                 Autonomous teams                            </div>                            <div>                                 Flexible organization                            </div>                    ",
    "urlFetchPending": false,
    "published": "Jan 1, 2018 5:18:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "7Wp1HkuBQuW-N3zHg5mYCA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/164238/senior-robotics-specialist-aeolus-robotics?a=T4YNdV0MPNS",
    "title": "Senior Robotics Specialist at Aeolus Robotics (South San Francisco, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Embedded Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Artificial Intelligence, Consumer Electronics, Robotics</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Job Responsibilities</strong><br><br>Lead and/or collaborate in the design, development, and testing of robot algorithms, in one or more of these areas: <br><br>- Robot motion, especially reactive planning and replanning techniques, and machine learning for skill acquisition.<br>- Robot vision, SIFT and other approaches to both face and object recognition, vision processing in service of SLAM, and surface modeling in service of manipulation.<br>- Manipulation and grasping, especially software compliant approaches that are compatible with a variety of grips and objects, e.g. a cupping motion, a pinching action, and a more generic grasp.<br>- Hardware design, especially of compliant end-effectors.&nbsp;</p><p><strong>About you</strong></p><p>You are looking for the place to stretch yourself, able to work within a senior, highly performant product team, and aren’t afraid of a challenge. &nbsp;You are a self-starter with the motivation and skills needed to effectively operate on your own time in your own way while being responsive to the needs of your teammates and the team as a whole.</p><p>You love working on the metal and/or deep in low-level or scaled algorithmic code. &nbsp;You are effective at quickly understanding and operating on algorithms taken from research in AI, Robotics, and Vision, or you have have experience with sensors, motors, and other devices. &nbsp;You are comfortable working alongside experts in these areas, or are an expert yourself. You have a proven track record of delivering ideas into working prototypes at high velocity. &nbsp;You have commercial/agile development teaming experience. &nbsp;You've architected some serious systems and may have even been a team lead.</p><p><strong>Flexible Hours &amp; 100% Remote Work</strong></p><p>These roles permit flexible working hours and are 100% remote. &nbsp;You will work in a scrum-based agile development cycle. Whether you prefer contract work or a permanent position, we can accommodate you. You will be working alongside founders, researchers, and engineers to design and build first-generation robotic solutions for mass consumer adoption.</p><p><strong>Skill Set</strong></p><p>Candidates for senior leadership positions should have a PhD in a relevant area, and 5+ years of experience in both designing robotic solutions, and directing a team to implement them. Recruiting a team is also a job opportunity/role.<br>Candidates for developer positions should have an MS or PhD, and experience building significant robotic systems.</p><p><strong>Experience with<br></strong><br>-&gt; c / c++ and ROS<br>-&gt; Robotics or/and Computer vision&nbsp;or/and Machine learning</p>                    </div>                            <h2>                About Aeolus Robotics            </h2>            <div><p>Aeolus Robotics was founded to bring the first generation of household robot assistants to life, and to market. Integrating Taiwanese manufacturing prowess and Silicon Valley AI genius, we are breaking ground in general-purpose consumer robotics with capability in unstructured “human” spaces. &nbsp;Our CTO, an expert in AI and machine learning, was a member of the DARPA team that conceived and managed the Watson AI project. Still operating largely in stealth mode, we have got additional key members and breakthrough technological approaches to ensure success in this challenging field.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Roles permit flexible working hours and can be 100% remote.                            </div>                            <div>                                 Contract work or a permanent position: we can accommodate you.                            </div>                            <div>                                 Build first-generation robotic solutions for mass consumer adoption.                            </div>                    ",
    "urlFetchPending": false,
    "published": "Jan 1, 2018 5:18:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "dpthmyXjT8G0os-fx72F6w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63989",
    "title": "Data Engineer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>What would be your role?</strong></p><br><p>Casumo is moving forward at a fast pace and the data we are processing is growing in size and variety each day. We are looking for colleagues who are eager to jump onto a moving wagon and work on interesting challenges, supporting our growing mission as things change and evolve on a daily basis.</p><br><p>Being a data engineer in Casumo means being part of a highly self-organized team, distributed across five European countries.</p><br><p>Although dispersed, our data team is keeping things tight - your tasks would be to work on third party integrations, consume information coming from a number of in-house data sources, provide engineering services to our data scientists and marketeers, deal with the challenges of our distributed systems, but above all, take care of the stability and performance of our data platform.</p><br><p><strong>Who are you?</strong></p><br><p>Since we are highly distributed geographically, you need to be a strong communicator, &nbsp;self-driven and self-motivated.</p><br><p>We are looking for autonomous people, but our team comes before our singularities - you should be a team player but able to drive your own initiatives and manage your workload.</p><br><p>You should also be prepared to work in the geekiest team in the company (with the best sense of humour).</p><br><p>Your background, ideally?&nbsp;Hadoop, Spark, AWS developer, batch processing, API integrations,&nbsp;SQL expert, data transformations and data heavy lifting, in general.</p><br><p><strong>Data engineer at Casumo, profile and required skills:&nbsp;</strong></p><br><ul><br><li>Strong skills in either Java, Scala, Python, Bash, SQL but familiar with all of them</li><br><li>Hadoop ecosystem, Spark, Hive, and data warehousing in general.</li><br><li>Broad knowledge of AWS cloud computing services (EMR, Data Pipelines, Redshift, …)</li><br><li>Experience in real-time processing or a big interest in it</li><br><li>Take care of the small details in order to make the big picture more beautiful</li><br><li>Have a desire to take full ownership of features and code, from inception of ideas to deployment, maintenance and keeping it running</li><br><li>Appreciate the concepts and principles underlying open-source culture and good software development</li><br><li>A person who loves to play with code and tools, understands the need of quality and cares about it</li><br></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 29, 2017 5:08:08 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "0AtOt6JaQuuN0On5qoq7wA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Big+Data+Automation+Test+Engineer&c=CSRA&l=Remote&jk=6d8ed3166aef74b2&rtk=1c2p4rb2o0j051va&from=rss",
    "title": "Big Data Automation Test Engineer - CSRA - Remote",
    "content": "<div><b>Big Data Automation Test Engineer</b><br><span>CSRA</span>     -<span>Remote</span>    <div>        <span>                Indeed salary estimate: $97,000 - $124,000 a year - </span>        <span>Full-time,&nbsp;Other</span>        <span></span>        </div></div><span><p><b>Clearance Level Must Currently Possess:</b></p>No Active Clearance Required<p><b>Clearance Level Must Be Able to Obtain:</b></p>No Active Clearance Required<p><b>Suitability:</b></p>Agency Specific<p><b>Job Family:</b></p>Engineering &amp; Sciences<p><b>Job Description:</b></p><p>Automation Test Engineer Job Description</p><p>CSRA, a Federal marketplace leader in next-generation IT solutions and professional services, is seeking highly qualified and motivated IT professionals like you who are eager to contribute to our client mission. CSRA, teaming with its alliance partners, provides the Federal Aviation Administration (FAA) with cost-effective cloud, innovative, next-gen IT services; data center consolidation and cloud migration capabilities to drive its mission forward.</p><p><br><b>JOB DESCRIPTION</b></p><p>This role requires an Automation Test Engineer who can drive strategy and implementation of a complex set of processes and solutions for the customer. The role requires an individual who wants to perform cutting edge work in Agile, Behavior &amp; Test Driven Development, and DevOps. You will help to lead &amp; implement the test automation efforts for the FAA Enterprise Information Management (EIM) Enterprise Capability (EC.) – automating test cases, conducting hands on testing and writing test cases, while working with other testers, developers and stakeholders.</p><p><b>RESPONSIBILITIES AND DUTIES</b></p><ul><li>Automate functional testing using best-of-breed test automation tools such as Cucumber, Selenium, HP Quick Test Pro (QTP), Performance Tools, and SOAP UI</li><li>Institutionalize continuous improvement of product quality and rapid delivery by integrating industry standard test automation best practices and tools</li><li>Introduce test-driven development (TDD) and behavior-driven development (BDD) methodologies and practices to the Team</li><li>Assess processes for automation versus manual testing, establish automation framework, and script the automated processes for a web-based solution</li><li>Integrate these automated tests into our Continuous Integration platform</li></ul><ul><li>Use repository (e.g., ServiceNow, Atlassian JIRA, etc.) to record defects and write test scripts</li><li>Conduct and track results of smoke, functional, integration, performance, and regression testing as needed</li><li>Participate in peer reviews of documents</li></ul><p><b>QUALIFICATIONS AND SKILLS</b></p><p>Desired:</p><ul><li>Years of Experience: 8 years of IT experience with at least 2 years of intensive and progressive experience demonstrating the required proficiency levels related to position.</li><li>Required Education: Bachelor’s or equivalent in information sciences, engineering, or equivalent;</li><li>Strong experience in automating GUI and API performance and functional testing using best-of-breed test automation tools such as Cucumber, Selenium, HP Quick Test Pro (QTP), Performance Tools, and SOAP UI</li><li>Experience in an Agile environment with test-driven development (TDD) and behavior driven development (BDD)</li><li>Experience in testing data and ingestion pipelines in a Hadoop stack</li><li>Experience in testing configurations in virtual server environments</li><li>Experience with Ansible, AWS</li><li>Experience in integrating automated tests with a Continuous Integration platforms such as Atlassian Bamboo, Jenkins</li><li>Experience in programming test automation scripts in languages such as Java (preferred), Ruby, or Python, C#</li><li>Experience in testing web-based and mobile applications and solutions, including integration / interfaces</li><li>Permanent Residency or US Citizenship Required</li><li>Ability to work independently and produce results, given general priorities, required.</li></ul><p>DESIRED QUALIFICATIONS: BS or equivalent + 5 yrs related experience, or MS + 3 yrs related experience</p><p><b># of Openings:</b></p>1<p><b>Scheduled Weekly Hours:</b></p>40<p>T <b>elecommuting Options:</b></p>Some Telecommuting Allowed<p><b>Work Location:</b></p>USA VA Home Office (VAHOME)<p><b>Additional Work Locations:</b></p><p><b>CSRA is committed to creating a diverse environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</b></p></span>",
    "urlFetchPending": false,
    "published": "Dec 22, 2017 10:13:47 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "oCg4UPwnSDSdUN2lKl-n7Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/163698/data-scientist-machine-learning-scrapinghub?a=STKEcwkYF8c",
    "title": "Data Scientist - Machine Learning at Scrapinghub () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Data Scientist</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Scrapinghub&nbsp;are looking for experienced individuals who are passionate about data science and enjoy working in a collaborative environment. You will get the chance to work with one of the most advanced and comprehensive web crawling and scraping infrastructures in the world, leveraging massive data sets with cutting edge technology.</p><p><strong>Responsibilities</strong></p><ul><ul><li>You will apply your data science and engineering skills to analyze large volumes of complex data, model challenging problems, and develop algorithms to solve our internal and client needs.</li><li>You will work and experiment with state-of-the-art web crawling, data processing and machine learning technologies.</li><li>Some of the problems you’ll be working on include classification, named entity recognition, record matching of semi-structured data.</li><li>You will work in collaboration with other data scientists and engineers across Scrapinghub to design and build creative solutions to challenging problems.</li><li>You will work on projects that span the whole organization, including areas such as Product, Professional Services and Growth.</li></ul></ul><p><strong>Required Skills:</strong></p><ul><li>Strong machine learning background (natural language processing, classification, computer vision, deep learning, etc.)</li><li>Hands-on experience in Data Science projects (data preparation, feature selection, target metrics, model evaluation, validation, etc.).</li><li>Strong coding ability, ideally in python.</li><li>Experience with any of these tools is a plus: sklearn, pytorch, tensorflow, theano, pandas, jupyter, spacy, gensim, vowpal wabbit, crfsuite, hadoop, spark, AWS.</li><li>Please send source code that shows your programming ability well. If you have many projects on github (or similar) please tell us which we should look at.</li></ul>                    </div>                            <h2>                About Scrapinghub            </h2>            <div><p>Founded in 2010, Scrapinghub is a fast growing and diverse technology business turning web content into useful data with a cloud-based web crawling platform, off-the-shelf datasets, and turn-key web scraping services.</p><p>We’re a globally distributed team of over 100 Scrapinghubbers working from over 30 countries who are passionate about scraping, web crawling, and data science.</p><p>As a new Scrapinghubber, you will:</p><p>Become part of a self-motivated, progressive, multi-cultural team.</p><p>Join a team with huge opportunity to make a difference</p><p>Have the freedom to work from&nbsp;<a href='http://blog.scrapinghub.com/2015/05/12/traveling-tips-for-remote-workers/' rel='nofollow'>wherever you want</a>.</p><p>Have the opportunity to go to conferences and meet with the team from across the globe.</p><p>Get the chance to work with cutting-edge open source technologies and tools.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible working hours                            </div>                            <div>                                 Remote working                            </div>                            <div>                                 Paid time off                            </div>                            <div>                                 Paid open source work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 19, 2017 7:47:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "AMJz2pvKQJCyMsavDSUdVw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/gyandhan/jobs/115836-senior-data-scientist",
    "title": "Senior Data Scientist",
    "content": "<div><h2>Senior Data Scientist at GyanDhan</h2><div>Delhi, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>₹1500K–₹2000K<br>0.0%–1.0%</div></div><h3>Job Description</h3><div><p>Reporting to the Chief Risk Officer, the senior data scientist will be responsible for leading the efforts on improving the first version of GyanDhan's proprietary algorithm, which helps lending partners make better offers to students who want to pursue higher studies.</p><p>The ideal candidate can think big picture, and is comfortable with getting his/her hands dirty with data. The candidate should be resourceful in getting the data needed to support one's hypothesis. 3-4 years of prior experience in predictive modeling is required.</p><p>Do you appreciate the difference between causation and correlation? <br>If you answered yes, can see through the hype of Big Data while knowing how to effectively use it, we want you here!</p></div>",
    "urlFetchPending": false,
    "published": "Dec 15, 2017 4:19:38 PM",
    "tags": [
      "Data Scientist",
      "Delhi",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "HWJ48hQsQnG0B0Mx9rdIuw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8519-data-analyst",
    "title": "Data Analyst",
    "content": "Data Analyst - Jobmote<div><div><h2>Data Analyst</h2><h5>Zapier</h5></div></div><div><div><div><div><div><p>Hi there! We're looking for a Data Analyst to join the data team at Zapier. Interested in helping grow a product that helps the world automate their work so they can get back to living? Then read on…</p><p>Even though our job description may seem like we are looking for a specific candidate, the role inevitably ends up tailored to the individual who applies and joins. Regardless of how well you feel you fit our description, we encourage you to apply if you love to collaborate with data scientists, engineers, and business or operations experts to understand and address their data needs.</p><p>We're a widespread remote team of 100+ people, located in thirteen countries, that think computers should do more work. For the past six years, Zapier has been helping people across the world automate the boring and tedious parts of their job. We do that by helping everyone connect the web applications they already use and love.</p><p>We get together 2-3 times per year for a company retreat, and benefits include great healthcare, dental and vision coverage, 401k retirement plan with company match, profit sharing and 14 weeks paid leave for new parents.</p><p><strong>To be considered for this role, please complete the application on&nbsp;<a href='https://zapier.workable.com/j/70A176813D' rel='nofollow'>Jobs @ Zapier</a></strong></p><p>We're not accepting applications from agencies.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 15, 2017 2:01:30 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "NlJIgPNeQr-EkjG_DgwK4w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/jobs/5958-data-analyst",
    "title": "Zapier: Data Analyst",
    "content": "<div>  <div>    <h2>Data Analyst</h2>      <h4>Posted Dec 14</h4>    <h3>      <span>Zapier</span><br>      <span>Headquarters: San Francisco</span><br>        <a href='https://zapier.workable.com/j/70A176813D' rel='nofollow'>https://zapier.workable.com/j/70A176813D</a>    </h3>  </div>    </div>  <div>    <div>Hi there! We're looking for a Data Analyst to join the data team at Zapier. Interested in helping grow a product that helps the world automate their work so they can get back to living? Then read on…</div><div><br></div><div>Even though our job description may seem like we are looking for a specific candidate, the role inevitably ends up tailored to the individual who applies and joins. Regardless of how well you feel you fit our description, we encourage you to apply if you love to collaborate with data scientists, engineers, and business or operations experts to understand and address their data needs.</div><div><br></div><div>We're a widespread remote team of 100+ people, located in thirteen countries, that think computers should do more work. For the past six years, Zapier has been helping people across the world automate the boring and tedious parts of their job. We do that by helping everyone connect the web applications they already use and love.</div><div><br></div><div>We get together 2-3 times per year for a company retreat, and benefits include great healthcare, dental and vision coverage, 401k retirement plan with company match, profit sharing and 14 weeks paid leave for new parents.</div><div><b><br></b></div><div><b><span>To be considered for this role, please complete the application on&nbsp;</span><a href='https://zapier.workable.com/j/70A176813D' rel='nofollow'>Jobs @ Zapier</a></b></div><div><br></div><div>We're not accepting applications from agencies.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://zapier.workable.com/j/70A176813D' rel='nofollow'>https://zapier.workable.com/j/70A176813D</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 15, 2017 1:06:06 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "YitnRmtvQ4Cl2aTnYyv3ZA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/remote-jobs/zapier-data-scientist",
    "title": "Zapier: Data Scientist",
    "content": "<div>  <div>    <h2>Data Scientist</h2>      <h4>Posted Jan 15</h4>    <h3>      <span>Zapier</span><br>      <span>Headquarters: San Francisco</span><br>        <a href='https://zapier.workable.com/j/87C73C5441' rel='nofollow'>https://zapier.workable.com/j/87C73C5441</a>    </h3>  </div>    </div>  <div>    <div>Hi there! We're looking for a Data Scientist to join the data team at Zapier. Interested in helping grow a product that helps the world automate their work so they can get back to living? Then read on…</div><div><br></div><div>Even though our job description may seem like we are looking for a specific candidate, the role inevitably ends up tailored to the individual who applies and joins. Regardless of how well you feel you fit our description, we encourage you to apply if you love to collaborate with data scientists, engineers, and business or operations experts to understand and address their data needs.</div><div><br></div><div>We're a widespread remote team of 100+ people, located in thirteen countries, that think computers should do more work. For the past six years, Zapier has been helping people across the world automate the boring and tedious parts of their job. We do that by helping everyone connect the web applications they already use and love.</div><div><br></div><div>We get together 2-3 times per year for a company retreat, and benefits include great healthcare, dental and vision coverage, 401k retirement plan with company match, profit sharing and 14 weeks paid leave for new parents.</div><div><b><br></b></div><div><b><span>To be considered for this role, please complete the application on&nbsp;</span></b><a href='https://zapier.workable.com/j/87C73C5441' rel='nofollow'><b>Jobs @ Zapier</b></a></div><div><br></div><div>We're not accepting applications from agencies.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://zapier.workable.com/j/87C73C5441' rel='nofollow'>https://zapier.workable.com/j/87C73C5441</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 15, 2017 1:06:06 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "WDcFKsqsQ2Wb_o911E-9xw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/162778/data-pipeline-developer-for-the-democratic-commons-mysociety?a=SACCBH79D1u",
    "title": "Data Pipeline Developer for the Democratic Commons at mySociety (London, UK) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>mySociety is looking for an experienced developer with Ruby skills to work on our Democratic Commons project: a concept of open and shared democratic data where anyone can contribute, and anyone can benefit. We’re creating the core infrastructure, tools and data that will kickstart the Democratic Commons because we believe that the data that allow people to hold their own governments to account should be freely available to all.</p><p>This is a fast-moving project with an ambitious timeline for the next year, so we’re looking for someone who can hit the ground running and will thrive in a dynamic environment. We’ll be working with a varied range of partners around the world; from volunteers and small NGOs to deep established engagements with Wikidata and Facebook.</p><p>To be a good fit, you will be comfortable working with partners both big and small, listening to their needs and helping to translate those into plans, tickets and concrete features that you can implement. You’ll come with the ability to discuss and explain technical concepts to non-expert stakeholders and will enjoy working on a variety of different kinds of problems, while thinking about the bigger picture.</p><p><br></p> <p><em>No recruiters or agencies, please.</em></p><p> </p><p><strong>Key responsibilities </strong></p><p>You will be:</p><ul> <li>Working within a small but growing development team to design, build and maintain a large-scale distributed architecture for sourcing and updating basic political information and making it freely available </li> <li>Developing the infrastructure that will allow the team to deliver datasets for countries at an escalating pace through the first year of the project</li> <li>Creating scrapers and tools that enable partners around the world to populate and correct data</li> <li>Communicating with partners to iterate and improve the tools and ensure they are fit for purpose for different levels of capability</li> <li>Contributing to a team culture of agile innovation focused on creative and responsive solutions to the challenges of a project with a growing scale</li> </ul><p></p><p><strong>About mySociety</strong></p><p>Since 2003 mySociety have built and grown a series of democratic and civic websites and apps, including<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Ffixmystreet.com' rel='nofollow'> FixMyStreet.com</a>,<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Fwhatdotheyknow.com' rel='nofollow'> WhatDoTheyKnow.com</a>,<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Fwritetothem.com' rel='nofollow'> WriteToThem.com</a> and<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Ftheyworkforyou.com' rel='nofollow'> TheyWorkForYou.com</a> which are used by more than 10 million people each year. Whilst we continue to run our sites in the UK, we also help groups in over 40 other countries to establish and make a success of their own, similar sites.</p><p>Our charitable work is made possible by major grants from funders such as the<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fomidyar.com' rel='nofollow'> Omidyar Network</a>, the<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fwww.hewlett.org' rel='nofollow'> Hewlett Foundation</a>, and<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttps%252525253A%252525252F%252525252Fwww.digitalnewsinitiative.com%252525252F' rel='nofollow'> Google</a>, who support our desire to share software, knowledge and good practice for the benefit of the global Civic Technology community. We work across three thematic areas, developing online services in Freedom of Information, Democracy and Better Cities.</p><p>Our growing research team aims to establish how, whether and when Civic Technology can make a difference, and share these learnings widely with civil society and governments. Our project management style aims to minimise pain and distraction, and leave people to get on with doing great work, normally in small teams.</p><p>Our commercial subsidiary mySociety Ltd delivers off-the-shelf services for local authority and other clients in the UK and abroad, along with commercial access to our data services and custom development work and consultancy. Its profits are reinvested into the work of the charity.</p> <p><br></p> <p><strong>Deadlines and dates</strong></p><p>The application deadline is 10am GMT on Friday 15th December and interviews will take place the first week of January 2018. We will aim to notify applicants of whether or not they will be invited to interview by Friday 22nd December.</p> <p><strong>Application instructions</strong></p><p>Your application should consist of a CV and covering statement.</p><p>Use your covering letter to show us why your skills make you a good fit for this role. We’re also going to want to see some samples of work that best represent you, so if you have examples online, let us know where to find them. </p><br><p><strong>Benefits</strong></p><br><p>Salary is in the range of £43,000 to £52,000 depending on experience, plus pension (3% employer contribution, 5% employee). This is a one year fixed-term contract.</p> <p>We expect you to be based in the UK and you need to have the right to work in this country (sorry, but we can’t offer help with visas or relocation expenses).</p> <p>mySociety is an adaptable, understanding employer and we have some great benefits including 25 days off per year (plus bank holidays), a new laptop, flexible working patterns, a yearly annual retreat and regular company meetups in cities up and down the country. Read more at<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttps%253A%252F%252Fwww.mysociety.org%252Fcareers' rel='nofollow'> www.mysociety.org/careers</a>.</p> <p>We welcome people who are committed to making a difference, but we take work life balance very seriously and we celebrate the idea of quality, not quantity of working hours: if you work more than your contracted hours then we insist on time off in lieu to compensate.</p> <p>Most of our staff work remotely whilst still seeing each other face to face as often as we can. We work from home, co-working spaces, or small offices. We have small clusters of people around Bristol and London and would particularly like to hear from people based near those cities, but will accept applicants from anywhere in the United Kingdom. We ask that you are willing to travel to other parts of the country to see colleagues and clients perhaps a dozen times a year. You can read more about what it’s like working at mySociety at <a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttps%253A%252F%252Fwww.mysociety.org%252Fabout%252Fcareers%252Fculture%252F' rel='nofollow'>https://www.mysociety.org/about/careers/culture/.</a></p>                    </div>                            <h2>                About mySociety            </h2>            <div><p>mySociety is a not-for-profit social enterprise, based in the UK and working internationally. We make websites and tools that empower citizens… like <a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fwww.writetothem.com' rel='nofollow'>WriteToThem</a>, <a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fwww.fixmystreet.com' rel='nofollow'>FixMyStreet</a>, <a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fwww.whatdotheyknow.com' rel='nofollow'>WhatDoTheyKnow</a>, <a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fwww.theyworkforyou.com' rel='nofollow'>TheyWorkForYou</a>, and <a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fwww.alaveteli.org' rel='nofollow'>Alaveteli</a>.</p><p><br></p><p>You can read more about why you might want to work for us on our <a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttps%25252525253A%25252525252F%25252525252Fwww.mysociety.org%25252525252Fabout%25252525252Fcareers%25252525252F' rel='nofollow'>careers page</a>, or <a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Feepurl.com%25252525252F8YHJP' rel='nofollow'>sign up to our jobs mailing list</a> to hear about new positions.</p><p><br></p><p>Got questions? <a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttps%25252525253A%25252525252F%25252525252Fmedium.com%25252525252Ffrom-mysociety%25252525252Fask-us-what-its-like-to-work-at-mysociety-2a0037bab439' rel='nofollow'>Ask us anything</a>.<br></p><p><br></p>            </div>        ",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 10:59:50 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "xxqkL6UdQQSOW0uqsUTzow",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/64319/data-scientist-at-hiver/",
    "title": "Data Scientist",
    "content": "*Data Scientist* <br />Do you want to join an exciting early stage start-up into the intelligent event technology space? Do you dream about building and growing the data science function of our product? Are you motivated by working in a fast-paced dynamic environment? We’re looking for a mid-level Data Scientist to join our team based in London (with some remote work possible). This is a 6-month project initially with scope to become a permanent role after that. <br /><br />*Must Haves*<br /><br />* Strong mathematical skills<br />* Strong applied statistics skills, such as distributions, statistical testing, regression<br />* Core Data Science skills<br />* Ability to learn quickly <br />* Practical experience of Python<br />* Ability to suggest ideas, test them and iterate on them <br />* At least 2 years commercial experience<br />* Excellent English language communication, in particular the ability to explain complex analytical ideas to non experts<br /><br /><br />*Nice to Haves*<br /><br />* Knowledge of core Python data science libraries such as SciPy, numpy, Pandas, Plotly etc<br />* Good understanding of graph theory<br />* The ability to suggest, design and build static visualisations and other outputs that can be used by customers<br />* Experience with Jupyter notebooks<br />* Knowledge of Machine Learning techniques<br />* Experience with signal processing<br />* Experience with solving geolocation based problems<br /><br />*Culture and Personality*<br /><br />* Willing to work hard but also have fun<br />* Good sense of humour<br />* Entrepreneurial spirit<br />* An appetite to achieve great things<br /><br />*About Hiver*<br /><br />Hiver provides intelligent networking technology designed to improve event-goer's experience and engagement at events by enhancing the way attendees interact with each other. Hiver solves the issue of name forgetting at events - which 80% of event goers report experiencing. As users interact, anonymous data from these improved interactions is presented to the event organiser so they can better understand the composition and quality of the event, giving them the tools to improve event by event as well as quantitatively market the engagement of their event over other conferences.Hiver was a part of London Business School and Deloitte Incubator and of Google Best in British Campus Exchange as is now a member of the Entrepreneurial Spark London Hub.<br /><br />Learn more at www.hivertech.com <br /><br />No agencies please.",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 4:46:29 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "Z0_PefvfSZ-jxecVW2RAiA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/veraxis/jobs/41923-data-analytics-and-machine-learning-developer",
    "title": "Data Analytics and Machine Learning Developer",
    "content": "<div><h2>Data Analytics and Machine Learning Developer at VerAxis</h2><div>London, San Francisco, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$90K–$150K<br>1.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Requirements:</p><p>Deep experience in machine learning software development and data analytics creative development as you will need to create and develop people analytics measures in our game and shape our game design as we scale up.</p><p>About Us:</p><p>We think the future of AI, not just people analytics, is in games that learn about their players as they provide an evolutionary environmental equivalence for multi-agent competition.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 10:04:07 PM",
    "tags": [
      "Full Time",
      "London",
      "REMOTE1/100",
      "Remote OK",
      "San Francisco",
      "Software Engineer",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "dJrAqHOZSeCT7rlCRTP-ww",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/mati-biometrics/jobs/135734-machine-learning-research-dnn-engineer",
    "title": "Machine Learning Research / DNN Engineer",
    "content": "<div><h2>Machine Learning Research / DNN Engineer at Mati Biometrics</h2><div>San Francisco, Saint Petersburg, Russia, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$60K–$130K<br>0.11%–4.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>------ Job Description ------ <br>We're looking for scientifically minded, highly ambitious people to take on a challenging role of improving and designing our custom deep neural networks.</p><p>You'll work in a small dynamic team to implement your new machine learning techniques across a range of applications. This work consists of 1) implementing state-of-the-art Deep learning research, 2) making application-specific customizations, and 3) compressing nets to run on computationally limited devices. </p><p>Ideally you have an experience in collecting and preparing your own dataset, have implemented object detection with a CNN for feature extraction, and have improved forward run time / parameter redundancy of an existing network.</p><p>If you are a high-energy, ambitious, learning machine, with a significant knowledge of deep learning architectures don’t hesitate and just reach out to us, we would love to talk to you!</p><p>------ Job Description ------<br>- Design, develop and optimize DNNs (CNN, RNN etc.) in collaboration with our other machine learning engineers<br>- Explore novel applications for DNNs<br>- Curate and improve the dataset<br>- Test approaches on embedded platforms that optimize run time and size</p><p>------ Desired Requirements ------<br>- Strong mathematical background<br>- Excellent C++, Python skills<br>- Graduate work focused on signal processing, machine learning, deep learning or related math grad work<br>- History of projects in object detection/classification using a convolutional neural net<br>- Experience with parallel or accelerated computing (OpenCL, CUDA)<br>- Experience writing unit tests and testable code<br>- Healthy awareness of current ML/deep learning/CVPR research literature <br>- Fluency with current frameworks (Caffe, Theano, Torch, Tensor Flow)<br>- Familiarity with traditional Computer Vision methods</p></div>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 9:48:48 AM",
    "tags": [
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Russia",
      "Saint Petersburg",
      "San Francisco",
      "Software Engineer",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "2OncWm8WSoiE_6L5gtccyg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/141116/freelance-expert-interviewer-karat?a=LkcSbeLCa0o",
    "title": "Freelance Expert Interviewer at Karat () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><strong>Interviewing is broken. &nbsp;Karat professionalizes interviewing.</strong><br><br><strong>About Karat</strong><br><br>Karat has reengineered technical hiring to ensure that great talent gets noticed by great companies. &nbsp;&nbsp;We augment engineering organizations by conducting the first-rounds of technical interviews on their behalf. Our service saves material engineering time and drives a highly responsive and consistent experience for candidates. &nbsp;Karat continuously invests in cutting edge interview methodologies with an aim of reducing bias and letting candidates demonstrate their true ability.<br><br>We operate as strategic partners for engineering leaders at the world's leading technology companies including Jet, MuleSoft, Roblox, Intuit, Ten-X, Minted and many more. &nbsp;&nbsp;As the gold standard of technical interviewing, our well-funded company is scaling quickly to meet our growing list of client's needs. &nbsp;Come join us!<br><br><strong>Join our elite community of Expert Interviewers.</strong><br><br>Karat’s Expert Interviewers are recognized and rewarded for doing a first-class job as top assessors of technical talent. &nbsp;Every interviewer in the network is an accomplished engineer. &nbsp;Our interviewers include development managers from big-tech companies, start-up engineers and freelancers covering the full technology stack.<br><br><strong>Flexible, high impact work that is compensated at highly competitive rates.</strong><br><br>As an Expert Interviewer, you will be compensated at highly competitive rates for your interviewing expertise. &nbsp;The time commitment is flexible---many of our interviews happen on nights and weekends. &nbsp;Some experts do 10 interviews/week while others do over 25 interviews/week. &nbsp;You can work from anywhere, anytime. &nbsp;You will sharpen your interviewing skills and transform the interviewing experience for every candidate and company.                    </div>                            <h2>                About Karat            </h2>            <div><p><strong>Interviewing is broken. &nbsp;Karat professionalizes interviewing.</strong></p><ul><li>Karat is on a mission to assess the world's talent. &nbsp;We are the first dedicated marketplace for technical interviewers. Karat's network of seasoned engineers conduct the first rounds of technical interviews for elite engineering companies. Our robust platform saves teams thousands of valuable hours while allowing them to focus on the top performing candidates. &nbsp;Karat's unique approach recognizes that people are central to the hiring process and that they can be supercharged by leveraging machine learning and our rich database of the world's interviews.</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Hours - You own your schedule                            </div>                            <div>                                 Work from anywhere                            </div>                            <div>                                 Transparent compensation                            </div>                            <div>                                 Bonus programs                            </div>                            <div>                                 Regular company outings                            </div>                            <div>                                 Access to a world-class community of expert interviewers                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "FalzHnjdRXKQCyhF9BFh1Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/64232/quantitative-analyst-at-causalens/",
    "title": "Quantitative Analyst",
    "content": "Summary<br /><br />We are looking for a motivated and high-achieving individual based anywhere in Europe to join the team working on an exciting new Big Data/Machine Learning platform. This is a full time placement with significant opportunities for growth and advancement as one of the first employees of the company.<br /><br />The Company<br /><br />causaLens is high-tech startup based in London. We are bringing machine learning and big data technologies to the World’s leading asset managers. We are an extraordinary team and the founders have worked for some of the most prominent global hedge funds and scientific institutions. <br /><br />Core requirements<br /><br />* Experience building financial models<br />* In-depth understanding of the operation of financial markets <br />* Highly capable, self-motivated, collaborative and personable<br />* Strong academic record<br />* Interest in advanced technologies such as machine learning<br />* Ability to demonstrate integrity and drive <br />* Naturally curious and effective problem solver<br />* An excellent written and verbal communicator with a high level of business acumen<br />* Ability to effectively work independently and remotely (from home or coworking space)<br /><br />Roles and Responsibilities<br /><br />This is an exciting role for a smart, creative person to build sophisticated models using the causaLens platform. <br /><br />Benefits<br /><br />Successful candidate will have the opportunity to join a fast-growing, agile, and international team passionate about innovation and making a difference.  We will offer guidance, mentorship, and opportunities for professional development.",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 5:32:59 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "1k437blzRZGdJ0ic3T0RUQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/infinium-robotics/jobs/36569-computer-vision-engineer",
    "title": "Computer Vision Engineer",
    "content": "<div><h2>Computer Vision Engineer at Infinium Robotics</h2><div>Singapore, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>C++, Computer Vision, Machine Vision, Optical Flow</div><div>Compensation</div><div>$50K–$70K<br>0.5%–2.0%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div>No description available.</div>",
    "urlFetchPending": false,
    "published": "Dec 7, 2017 12:25:28 AM",
    "tags": [
      "C++",
      "Computer Vision",
      "Full Time",
      "Hardware Engineer",
      "Machine Vision",
      "Optical Flow",
      "REMOTE1/100",
      "Remote OK",
      "Singapore",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "5SWcKgp7T52Hyu7x3F-vVw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/simon-data/jobs/113300-senior-software-engineer-core-data",
    "title": "Senior Software Engineer, Core & Data",
    "content": "<div><h2>Senior Software Engineer, Core &amp; Data at Simon Data</h2><div>New York City, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Python, Data Visualization, Hadoop, Machine Learning, SQL, Amazon Web Services, Amazon S3, Amazon Redshift, Data Engineering</div><div>Compensation</div><div>$95K–$175K<br>0.1%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Successful engineering teams are built on trust and purpose. At Simon Data we take that literally. We take pride in what we do every day and how we do it. Providing great software to our customers is rewarding and energizing. We've found a rapidly expanding sweet spot in marketing software and are diversifying our engineering team to keep up with the demand. </p><p>New engineers are welcomed into a team of smart and passionate engineers who love data and writing pragmatic code. We believe that you code better when you know how your work connects to the product and our clients. We also believe that you code better when you're surrounded by other engineers who want you to succeed. This attitude is core to our values.</p><p>As a Core &amp; Data Software Engineer, you'll be exposed to the core of our software and the data it keeps. From your first day on the job, you'll have the opportunity to:</p><p>- Interface with data from dozens of clients, each of which have upwards of a terabyte of data (SQL technologies). <br>- Own the build out our data pipe, aggregating data from both structured and unstructured sources (Hadoop, Spark, HDFS, EMR, Redshift). <br>- Scale and optimize our client facing data warehouse that provides real-time interactivity across millions of rows of data (Redshift, Elasticsearch).<br>- Lead development of statistical models and predictive technology to improve our experimentation and segmentation tooling (Machine learning, D3). <br>- Develop critical features to in our python software stack. <br>- Collaborate with an engineering team who is passionate about quality, staying ahead of the curve, and teamwork.</p><p>Our clients rely on us for accurate data and availability. Making mistakes in our business has direct effects on our clients' customers. We take both of these facts very seriously. At odds with this, Simon embraces the startup ethos of keeping lean and focused. We move quickly (continuous deployment) and emphasize experimentation to test hypotheses. To help us keep a high bar of quality, you'll bring a mindset for creativity and fault tolerance to your work every day.</p><p>Simon's engineering team is distributed across four states; we welcome engineers working at our New York City offices as well as remote employees.</p><p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability.</p><p>We'd love to meet you and learn more about your career goals.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 5:19:10 PM",
    "tags": [
      "Amazon Redshift",
      "Amazon S3",
      "Amazon Web Services",
      "Data Engineering",
      "Data Visualization",
      "Full Time",
      "Hadoop",
      "Machine Learning",
      "New York City",
      "Python",
      "REMOTE1/100",
      "Remote OK",
      "SQL",
      "Software Engineer",
      "TECH1/apple",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "bigdata-ml"
    ]
  },
  {
    "id": "N6pN0kPhSM2jeWNNLBeo1g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/citizengage/jobs/126616-machine-learning-engineer",
    "title": "Machine Learning Engineer",
    "content": "<div><h2>Machine Learning Engineer at Citizengage</h2><div>Bengaluru, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>₹400K–₹1000K<br>No Equity</div></div><h3>Job Description</h3><div><p>You will work on core algorithms for extracting trends, predictions, statistics &amp; information from various data sources, &amp; integrate that information into feeding back other algorithms &amp; making meaningful decisions at multiple levels.</p><p>Should be intellectually curious about problems &amp; finding solutions that are innovative. This involves proposing, prototyping, proving the utility of scaling &amp; instrumenting model evaluation techniques.</p><p>Our systems input data from various data sources, &amp; we need a Machine Learning Cognitive computing to turn that data into a processed base for forecasts, calculations, measurements, control &amp; monitoring. Sometimes our data turns into heteroskedacity based on Auxilary Regression, &amp; machine learning side of it should get us insight.</p><p>You understand Econometric terms like Bernoullis Random Variable, Casual Effect, Conditional Variance, Confidence interval etc. We used sparse regression for predicting cost projections, wavelet theory for trend analysis, &amp; data frequency model. We also like the prospect of LSTMs/Recurrent Neural Network architectures, language independent NLP techniques, ensemble methods for time series, graph-based learning etc.</p><p>Our ideal candidate would fit many of the below:<br>- Have 2-4 years of work experience<br>- Have a PhD/MS in Machine Learning, Statistics, CS or a related field. Or B.Tech/BE/MTech/MS in CS, Math, or related, with experience implementing machine learning systems in industry <br>- Understand importance of model evaluation/testing techniques &amp; the statistics behind them <br>- Experience with econometrics, time series analysis or a strong regression background along with a good understanding of how time series regression differs from cross-sectional studies <br>- Python/Scikit-Learn expert, &amp; you've atleast tinkered with Spark MLLib/GraphLab </p><p>Regular Coursera or Edx certified ML guys may apply however, you need to have built large scale ML in an enterprise or a business environment applied to solve a problem.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 7:24:15 AM",
    "tags": [
      "Bengaluru",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Software Engineer",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "vLTc0eeKTWaA433Y2Mt7vA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/6lt/jobs/43622-cto-or-senior-search-engineer-position-for-a-search-startup",
    "title": "CTO or Senior Search engineer Position for a Search Startup.",
    "content": "<div><h2>CTO or Senior Search engineer Position for a Search Startup. at 6LT</h2><div>Istanbul, Remote · Full Time</div></div><div><div>Skills</div><div>C++, Java, Hadoop, Big Data, SOLR, Search, Distributed Systems, R, Infrastructure, Lucene, Information Retrieval, Apache Solr, Apache Spark, ElasticSearch </div><div>Compensation</div><div>$20K–$65K<br>1.0%–15.0%</div></div><h3>Job Description</h3><div><p>We are building a SaaS based search solution and aiming to become a Search solution for enterprises. Located in Istanbul, Turkey we have plan to open an office in San Francisco.</p><p>We are looking for a senior software engineers who has interest and expertise in Search, Information retrieval and enterprise search market. He/she might be the change to become lead architect/CTO of the company according to expertise.&nbsp;</p><p>Only obligation is a proven team lead expertise in software development at least 4 years. BSc in software/computer/electronics engineering degree is a plus however, welcome drop-outs!</p><p>We seek &quot;honest&quot; and hard-working people to join a global team. Up to 25% equity is negotiable.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 12:39:33 AM",
    "tags": [
      "Big Data",
      "C++",
      "Distributed Systems",
      "Engineering Manager",
      "Full Time",
      "Hadoop",
      "Infrastructure",
      "Istanbul",
      "Java",
      "Lucene",
      "R",
      "REMOTE1/100",
      "Remote OK",
      "SOLR",
      "Search",
      "Software Engineer",
      "TECH1/bigdata-ml",
      "TECH1/c",
      "TECH1/java",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "c",
      "java"
    ]
  },
  {
    "id": "IiT9wa8DSNeZQ1pbsbSOmA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/pilotly/jobs/120366-viewer-insights-lead",
    "title": "Viewer Insights Lead",
    "content": "<div><h2>Viewer Insights Lead at Pilotly</h2><div>Oakland, Los Angeles, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Data Analysis, Market Research, Entertainment, Qualitative and Quantitative Research</div><div>Compensation</div><div>$65K–$85K<br>0.0%–0.5%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Imagine knowing which TV programs attract what type of audience or knowing which product placements had the most impact on viewers last night. Conducting content tests regularly, Pilotly Market Insights (PMI) measures viewers engagement with as many programs as possible to develop research norms that will help us in understand viewer engagement with a variety of creative content, product placements and market promotions.<br> <br>We are growing and looking for a Research Lead to join our team who can pave the path for our internal research practice. This position will be responsible for managing client research, data, questionnaires, panelists recruiting and data synthesis. You’ll work on research projects with our internal and external viewer teams, prepare data reports, make suggestions for future client needs and have direct communication with our clients, helping to ensure successful project executions.</p><p>==Responsibilities==<br>-Create in-depth research analyses through hands-on exploration of our databases; decide on the correct analytic approach(es)</p><p>-Oversee preparation and review of reports, decide the best way to present the data within a power point format </p><p>-Work to create new research solutions, such as automated reporting, by coordinating with our CTO and data science team</p><p>-Initiate discussion / raise questions when elements of the data are inconsistent with prior findings or expectations</p><p>-Gain larger understanding of media entertainment space and recommend ways to best incorporate research findings with client business needs</p><p>-Participate in panelists recruitment strategy, helping to build a diverse panel of viewers for future research screenings</p><p>==Qualifications==</p><p>- BA/BS preferably in social sciences, market research, statistics, marketing or economics<br>- 3 years or more experience in Media research<br>- Knowledge of television and advertising <br>- Ability to own and lead a client presentation with minimal senior support/supervision<br>- Very strong quantitative, data tabulation, analytic thinking and data mining skills<br>- Excellent skills with Microsoft Office suite of products<br>- Knowledge of databases a plus<br>- Knowledge of Google Docs is a plus</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 12:05:19 AM",
    "tags": [
      "Business Analyst",
      "Data Analysis",
      "Data Scientist",
      "Entertainment",
      "Full Time",
      "Los Angeles",
      "Market Research",
      "Oakland",
      "Qualitative and Quantitative Research",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown",
      "User Researcher"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "FDZ607GATuGiw9vrnagaYQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/cirqle-3/jobs/25493-chief-architect",
    "title": "Chief architect",
    "content": "<div><h2>Chief architect at The Cirqle</h2><div>Amsterdam, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Java, Machine Learning, SOLR, Apache Solr</div><div>Compensation</div><div>$50K–$70K<br>0.5%–2.5%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Our chief architect will take on all the challenges surrounding the scaleability of our infrastructure. We have built a product that is used by thousands of retailers, publishers and consumers but this is just a beginning. </p><p>In the near future we would like to expand on our reporting system, providing our clients with insight into their sales and the behavior of their customers. This will require a number crunching engine that should be quite fun to implement. Another plan of ours is to implement a recommendation engine for our product database, that is why we are looking for an engineer with experience in the field of data processing and machine learning.</p><p>Skills:<br>Solid understanding of software architecture principles<br>Ability to implement a well structured REST API<br>Understanding of how to implement and deploy a scalable, reliable application<br>Experience with the following, the more you know, the better: Java, AWS, Apache Solr, PostgreSQL, recommendation systems</p></div>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 8:50:56 PM",
    "tags": [
      "Amsterdam",
      "Apache Solr",
      "Backend Developer",
      "Full Time",
      "Full-Stack Developer",
      "Java",
      "Machine Learning",
      "REMOTE1/100",
      "Remote OK",
      "SOLR",
      "Software Engineer",
      "TECH1/bigdata-ml",
      "TECH1/java",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "java"
    ]
  },
  {
    "id": "B3rt94ufRqGoetjDMX5veg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/health-hero/jobs/53251-software-engineer",
    "title": "Software Engineer",
    "content": "<div><h2>Software Engineer at Health Hero</h2><div>San Francisco, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Machine Learning, Ruby, RESTful Services, PostgreSQL, Natural Language Processing, REST APIs, Ruby on Rails, REST, Bootstrap, Voice Recognition, Linode, Slim, Deep Learning</div><div>Compensation</div><div>$80K–$140K<br>0.05%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>It's fun to work in a company where people truly believe in what they're doing. At Health Hero, we're committed to bringing passion and customer focus to the business of enterprise health &amp; wellness. We work hard, and we're serious about health &amp; having fun.</p><p>Responsibilities:</p><p>Health Hero is seeking a senior Ruby on Rails engineer to support the next phase of growth of our platform: Scaling to hundreds of thousands of patients &amp; employees all over the world over the next year.</p><p>As our senior engineer, your code will enable a magical health engagement experience: Engaging people in their health via mobile, devices, web, phone calls (voice), text, and chatbots. All being doing in the simplest and most fun way possible with a great user experience, gamification, and empathy built into the product. Your team's technology will make that possible.</p><p>You will work closely with our Founder/CEO, VP of Service Delivery, and CTO to define the future of the company's technology. He or she will manage their own team, including new integrated systems &amp; API projects.</p><p>This is a role for a brilliant and experienced technology leader with a mindset for growth &amp; user empathy.</p><p>Our primary software stack involves Ruby on Rails, Linode, PostgreSQL, Javascript, React Native, Bootstrap, AI, ML, DL, &amp; 10+ API integrations via REST. </p><p>- Design a scalable solution to improve our software, using the latest technologies in NLP &amp; ML <br>- Develop a cycle and side-effect prediction engine using user input data <br>- Build out a two-sided marketplace to connect patients &amp; employees to the best multi-channel health experiences.<br>- Collaborate with peers to define product vision, roadmap &amp; ship new features <br>- Develop, test, and iterate on prototypes quickly<br>- Passion for meeting with clients &amp; iterating rapidly to delight them<br>- Experience and/or passion &amp; curiosity for machine learning, algorithms, data science<br>- History of leading a tech team in a startup environment<br>- At least 4+ years experience with Ruby on Rails<br>- At least 4+ years experience with JavaScript<br>- Eye for great design&nbsp;<br>- Experience designing and implementing browser-based user interfaces using AJAX, REST, and/or JSON. Relational Database experience: PostgreSQL, etc<br>- Experience scaling high traffic websites (architecture/database)<br>- Personal projects that show an aptitude for engineering and product sense<br>- Experience with server administration and Amazon Web Services (EC2 / S3). Linode, EngineYard, or Heroku cloud platforms</p><p>Skills Needed:</p><p>- Excellent communication skills<br>- Responsive and super dependable&nbsp;<br>- Experience managing onshore and offshore developers<br>- Experience with agile, iterative, and test-driven development methods<br>- Ability to work with little direction in a fast paced start-up environment<br>- Wants to make meaning in their life by helping to improve the health of others<br>- Previous experience using ERB, Slim, and many RESTful API integrations</p><p>Nice to have:</p><p>- React Native (or a willingness to learn React Native)<br>- Into fitness or quantified self<br>- Data Science expertise<br>- Voice application expertise</p><p>Please include GitHub, Stack Overflow, and/or Twitter accounts if available.</p><p>About Health Hero:</p><p>We are a passionate team. We exist to improve the lives of millions of people around the world. We are talking about saving real lives here, and doing so in the simplest, most rewarding, and loving way possible.</p><p>Vision: To be the health engagement platform of choice for payers &amp; providers</p><p>Mission: By providing the best health engagement experiences</p><p>Values: Love, Greatness, Unity</p><p>Patient Engagement: 1-minute demo - <a href='https://youtu.be/nMbYlbzIQlc' rel='nofollow'>https://youtu.be/nMbYlbzIQlc</a><br>Employee Wellness: 1-minute demo - <a href='https://youtu.be/mP44y08sEeY' rel='nofollow'>https://youtu.be/mP44y08sEeY</a></p><p>Are you ready to Hero Up?</p><p><a href='http://www.gohealthhero.com/' rel='nofollow'>http://www.gohealthhero.com/</a></p></div>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 8:30:33 PM",
    "tags": [
      "Bootstrap",
      "Full Time",
      "Full-Stack Developer",
      "Machine Learning",
      "Natural Language Processing",
      "PostgreSQL",
      "REMOTE1/100",
      "REST",
      "REST APIs",
      "RESTful Services",
      "Remote OK",
      "Ruby",
      "Ruby on Rails",
      "San Francisco",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown",
      "Voice Recognition"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "frontend",
      "ruby"
    ]
  },
  {
    "id": "2oiQyw7kRkCkBEe4hnMiHg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/dataquest/jobs/301516-student-success-lead",
    "title": "Student Success Lead",
    "content": "<div><h2>Student Success Lead at Dataquest</h2><div>San Francisco, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Customer Service, SQL, Community Management, Teaching / Instruction</div><div>Compensation</div><div>$55K–$75K<br>0.1%–0.2%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>At Dataquest, we teach data science to hundreds of thousands of students worldwide.  We help students deeply learn concepts, build projects, and gain the confidence to start new careers (<a href='https://www.dataquest.io/stories' rel='nofollow'>https://www.dataquest.io/stories</a>).  We're all self-taught engineers, data scientists, and marketers, and we're eager to help others take the same journey that we did.  Read more about our philosophy here (<a href='https://www.dataquest.io/blog/the-perfect-data-science-learning-tool/' rel='nofollow'>https://www.dataquest.io/blog/the-perfect-data-science-learning-tool/</a>), and read what students think here (<a href='https://www.switchup.org/bootcamps/dataquest' rel='nofollow'>https://www.switchup.org/bootcamps/dataquest</a>).</p><p>We're looking for someone who can help support our students in having an optimal learning experience.</p><p>This includes:</p><p>* Owning and organizing our student support process<br>* Answering non-technical questions from students over email and intercom<br>* Looking up student billing and progress information using tools like stripe and mode analytics<br>* Adjusting student accounts using proprietary tools and standard tools like stripe<br>* Asking the appropriate team member for help on technical questions<br>* Investigating bug reports, creating tickets, and messaging when bugs are fixed<br>* Managing support-related tools like Intercom and Delighted<br>* Coordinating with larger teams to set the correct pricing and invoice properly<br>* Managing contractors who assist with student support<br>* Fostering student community in forums and on Slack</p><p>Students will spend several months learning on Dataquest, and they'll typically reach out several times during their learning journey to ask technical or career based questions, report bugs, or share their stories.</p><p>We value our students highly, and we're looking for someone that can empathize with students and help them on their learning journey.  We'd like to hire someone who sees student support as a learning product and a way to help students build their capabilities over time.  If you get excited by helping people learn, this is a good role for you.  We have an NPS of 60, and we'd like to see this go up over time.</p><p>There's substantial latitude and room to define the role and how it grows.  You'll be able to do everything from defining the types of automatic messages we send to students as they learn to dreaming up new product features that will let students get help on their own.  As a result, we're looking for people with previous teaching or support experience.</p><p>Although you don't need to be technical for this role, knowing some SQL, and wanting to learn more, will be a plus.</p><p>This role can be either fully remote or onsite in San Francisco.</p></div>",
    "urlFetchPending": false,
    "published": "Nov 28, 2017 10:22:28 PM",
    "tags": [
      "Community Management",
      "Customer Service",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "SQL",
      "San Francisco",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown",
      "Teaching / Instruction"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "oDdmtkr5Q96yPi1on5SneA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/clickdesti-com/jobs/126867-artificial-intelligence-machine-learning-algorithm-php-android-developer-python",
    "title": "Artificial Intelligence, Machine Learning,algorithm,php,android developer,python",
    "content": "<div><h2>Artificial Intelligence, Machine Learning,algorithm,php,android developer,python at PickInterest.com</h2><div>New Delhi, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Python, PHP, Machine Learning, Artificial Intelligence, Algorithms, Facebook Graph API</div><div>Compensation</div><div>₹15K–₹20K<br>5.0%–15.0%</div></div><h3>Job Description</h3><div>No description available.</div>",
    "urlFetchPending": false,
    "published": "Nov 22, 2017 10:21:17 PM",
    "tags": [
      "Algorithms",
      "Artificial Intelligence",
      "Backend Developer",
      "Facebook Graph API",
      "Frontend Developer",
      "Full Time",
      "Machine Learning",
      "New Delhi",
      "PHP",
      "Python",
      "REMOTE1/100",
      "Remote OK",
      "Software Engineer",
      "TECH1/bigdata-ml",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "php"
    ]
  }
]
}
