{
 "items": [
  {
    "id": "_QhnRxTlT9SPC87MfZjHMw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/169225/software-engineer-mediawiki-wikimedia-foundation-inc?a=UKFPg9rx3Rm",
    "title": "Software Engineer (MediaWiki) at Wikimedia Foundation, Inc. (San Francisco, CA) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Education Technology, eLearning, Non-Profit</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div>Location: San Francisco, CA or Remote<p><strong>Summary</strong></p><p>The Wikimedia Foundation is looking for a Software Engineer to join the MediaWiki Platform Team. The MediaWiki Platform Team is responsible for maintenance and development of the MediaWiki core, the platform that powers Wikipedia and other Wikimedia Foundation websites. MediaWiki is a PHP/MySQL web application that has been incrementally developed over the past 15 years to become a richly featured wiki engine, and the basis for hundreds of extensions and skins. MediaWiki is an open source product with a vibrant volunteer community.</p><p>We are looking for a Software Engineer who will work collaboratively with our feature teams to provide great new features to our users. You will also work with SRE and Performance teams to ensure MediaWiki continues to scale and remain highly available for the millions of users who depend on us.</p><p><strong>Description</strong></p><ul><li>Design, develop, test, and deploy new features and improvements to MediaWiki.</li><li>Triage, diagnose, and fix reported bugs in MediaWiki</li><li>Maintain extensions to the PHP engine.</li><li>Partner with Foundation staff and volunteers on software design, development, review, testing and evaluation.</li><li>Help identify and implement best practices in engineering processes across the team.</li><li>Work and communicate effectively within a small team distributed across multiple time zones.</li></ul><p><strong>Requirements</strong></p><ul><li>Relevant Bachelor's degree OR 5 years software development experience</li><li>Proficient in PHP and MySQL</li></ul><p><strong>Pluses</strong></p><ul><li>Substantial code samples which you can show us</li><li>Experience with Linux, memcached, Redis, content distribution networks</li><li>Experience with C/C++ and JavaScript</li><li>Familiarity with web protocols and standards: HTML, CSS, HTTP</li><li>Experience with open source software development</li><li>Experience with MediaWiki or Wikimedia projects</li></ul><p><em>The Wikimedia Foundation is an equal opportunity employer, and we encourage people with a diverse range of backgrounds to apply.</em></p><p><strong>Benefits &amp; Perks *</strong></p><ul><li>Fully paid medical, dental and vision coverage for employees and their eligible families (yes, fully paid premiums!)</li><li>The Wellness Program provides reimbursement for mind, body and soul activities such as fitness memberships, baby sitting, continuing education&nbsp;and much more</li><li>The 401(k) retirement plan offers matched contributions at 4% of annual salary</li><li>Flexible and generous time off - vacation, sick and volunteer days, plus 19 paid holidays - including the last week of the year.</li><li>Family friendly! 100% paid new parent leave for seven weeks plus an additional five weeks for pregnancy, flexible options to phase back in after leave, fully equipped lactation room.</li><li>For those emergency moments - long and short term disability, life insurance (2x salary) and an employee assistance program</li><li>Pre-tax savings plans for health care, child care, elder care, public transportation and parking expenses</li><li>Telecommuting and flexible work schedules available</li><li>Appropriate fuel for thinking and coding (aka, a pantry full of treats) and monthly massages to help staff relax</li><li>Great colleagues - diverse staff and contractors speaking dozens of languages from around the world, fantastic intellectual discourse, mission-driven and intensely passionate people</li></ul><p><em>* for benefits eligible staff, benefits may vary by location</em></p><p><strong>More Information</strong></p><p><a href='https://wikimediafoundation.org' rel='nofollow'>https://wikimediafoundation.org</a></p><p><a href='https://blog.wikimedia.org' rel='nofollow'>https://blog.wikimedia.org</a></p>                    </div>                            <h2>                About Wikimedia Foundation, Inc.            </h2>            <div><p><strong>About the Wikimedia Foundation</strong></p><p>The Wikimedia Foundation is the nonprofit organization that supports Wikipedia, the other Wikimedia free knowledge projects, and our mission of free knowledge for every single person. We help bring new knowledge to people around the world, lower barriers to participation, and make it easier for everyone to share what they know. We do this by keeping the Wikimedia projects fast, secure, and available to all, protecting the values and policies that allow free knowledge projects like Wikipedia to thrive, building new features and tools to make it easy to read, edit, and share from the Wikimedia sites, and by supporting the communities of volunteers who make the projects possible.</p><p>At the Foundation, we build technology to help people everywhere access Wikipedia, across devices and in nearly 300 languages. We engineer privacy for our readers and editors so they can safely and securely explore Wikipedia. We create&nbsp;programs&nbsp;and initiatives to make Wikipedia freely available to more people in more parts of the world. We build&nbsp;new tools&nbsp;for the community of editors so they can continue to improve and grow Wikipedia. Roughly a quarter of our budget goes to supporting the community that make the site possible, including through&nbsp;grantmaking programs&nbsp;that enable volunteers and enrich the information on the sites.</p><p>The Wikimedia Foundation is an equal opportunity employer, and we encourage people with a diverse range of backgrounds to apply.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Fully paid premiums for medical, dental &amp; vision insurance premiums                            </div>                            <div>                                 401(k) with 4% matching contribution                            </div>                            <div>                                 7-12 weeks parental leave with 100% pay + lactation room                            </div>                            <div>                                 Wellness Program ($1800 annual) to promote wellness &amp; personal growth                            </div>                            <div>                                 Pre-tax savings plans for Transportation &amp; Parking                            </div>                            <div>                                 Flexible work schedules and remote working options                            </div>                            <div>                                 Pet Friendly office                            </div>                            <div>                                 Commitment to diversity &amp; inclusion throughout the employee lifecycle                            </div>                            <div>                                 12 days vacation, 19 days holiday, 2 days volunteer work and more!                            </div>                            <div>                                 Lean more at https://wikimediafoundation.org/wiki/Work_with_us                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "php"
    ]
  },
  {
    "id": "zuby6xLCRGOU5PH-24mHRg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/169530/senior-mobile-developer-hubstaff?a=UR11fdCw7AI",
    "title": "Senior Mobile Developer at Hubstaff  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Mobile Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Computer Software, Electronic Time Tracking, SaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are looking for a talented mobile engineer to join our passionate development team. You will help tackle challenging problems and assist with the ongoing development of our mobile applications (ios, android).</p><p>The position will report directly to our lead architect and work closely with our other engineers. You’ll be able to work 100% remotely.</p><p>You’ll be a good fit if you:</p><ul><li>Are self-disciplined and have a great work ethic</li><li>Have good time management skills</li><li>Communicate well</li><li>Love to learn new things</li><li>Can work until at least 1pm EST M - F</li><li>Have at least five years of experience in mobile development</li><li>Have at least 3 years experience working with C++</li></ul><p>Requirements:</p><ul><li>Java</li><li>Objective-C</li><li>iOS SDK</li><li>Android SDK</li><li>Comfortable writing C++</li><li>Using C++ libraries in iOS</li><li>Android NDK (marshalling data from a C++ lib)</li><li>CMake</li><li>SQLite</li><li>Strong experience with client/server interactions and network request handling</li><li>Unit tests</li><li>Memory profiling</li><li>Built many types of app UIs</li><li>Familiar with auto layout, collection views, paging, etc. on iOS and equivalents on Android</li><li>Git</li><li>Advanced debugging skills</li><li>Writing design docs</li><li>Wireframing</li></ul><p>Bonus:</p><ul><li>Familiarity with the nuances of writing location-tracking apps in iOS and Android that run in the background</li><li>Managing local queues and offline support</li><li>Know the Android and iOS HIG and design guidelines</li><li>Apple Watch SDK</li></ul>                    </div>                            <h2>                About Hubstaff            </h2>            <div><p>Hubstaff is quickly becoming one of the leading solutions in the evolving time tracking space.<br>We are looking for a talented server-side architect to join our passionate development team. You will help tackle challenging problems and assist with the ongoing development of our platform.</p><p>We’re a 100% remote team, that takes care to do good upfront design (specs and wireframes) before starting to code and have a lot of fun working on the project. We also spend the time to write unit tests to ensure we have great code coverage.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible schedule                            </div>                            <div>                                 Remote / Work from home                            </div>                            <div>                                 Annual retreat                            </div>                            <div>                                 Job security / Long term                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "mobile"
    ]
  },
  {
    "id": "qVFnroLqS6G3mRj5_RGe1Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/170661/java-c-plus-plus-engineer-clevertech?a=Vex3BMqcaEE",
    "title": "Java/ C++ Engineer at Clevertech  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>DESCRIPTION</strong></p><p>Clevertech is looking for a Java Engineer to join our global team. This role has database design and implementation responsibilities including alternative data structures such as nosql, redis, elasticsearch and more. Clevertech looks for craftsmen developers who take ownership of their code.</p><p>You can deliver quickly while being clever to avoid missteps. You have an effective positive attitude that shines as you show you care about client and colleague concerns. You are always learning and are a transparent communicator even when it is challenging. You thrive on challenging yourself daily and seek to surround yourself with like minded individuals.</p><p><strong>REQUIREMENTS</strong></p><ul><li>Programming skills– You are comfortable writing code in multiple languages, confident in choosing the right strongly or dynamically typed language for the job. Preferred language familiarity: C++, Java, NodeJS, Ruby, Scala, and/or Go.</li><li>Database skills – You understand the use cases for relational and non-relational data, you’ve implemented code against several different database platforms.</li><li>Development experience - Java Web Applications, Service Oriented Architecture and Micro-Services.</li><li>Knowledge of micro-services networking, load balancing, and service discovery concepts and technologies.</li><li>Conduct code walk-throughs, peer reviews, and produce technical documentation.</li><li>Bachelor’s Degree in Computer Science/Engineering or equivalent years of hands-on coding experience.</li><li>Strong communicator and fluent in English with excellent written and verbal communication skills.</li><li>Knowledge of Agile Methodologies</li></ul><p><strong>BENEFITS</strong></p><p><strong>Own Your Time</strong></p><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travelers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting.</p><p><strong>Recharge Time</strong></p><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p><strong>Care For Yourself</strong></p><p>You’ll receive a health/wellness monthly stipend that goes towards covering medical insurance, dental insurance or joining a gym!</p><p><strong>Focused Work</strong></p><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams.</p><p><strong>Learn at your edges</strong></p><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here. And of course, if you speak at a tech conference, we cover all expenses.</p><p><strong>Clevertech Swag</strong></p><p>And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over Slack.</p><p>Want to learn more about Clevertech and the team? Check out&nbsp;<a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p>                    </div>                            <h2>                About Clevertech            </h2>            <div><p><strong>We’re always looking for smart, driven, entrepreneurial developers to join our team.</strong></p><p><strong>If you like new ideas and want to work with a virtual but absurdly talented group of people in a learning-friendly environment, check out the open positions.</strong></p><p><strong>No matter what you do at Clevertech, you'll play a part in transforming ideas into software that changes the world.</strong></p><p><strong>Just answer a few quick questions and learn a little more about our culture.</strong></p><p><strong>We’re waiting for you, and ready to do great things together!</strong></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Full-Time Telecommuting                            </div>                            <div>                                 Flexible Schedules                            </div>                            <div>                                 Paid Time Off                            </div>                            <div>                                 Ability to Work with Cutting-Edge Technology                            </div>                            <div>                                 Opportunity to Work with and Learn from Top Developers                            </div>                            <div>                                 Contribute to Open Source                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/java",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c",
      "java"
    ]
  },
  {
    "id": "ETSuB7o-SPaJ73-xxYJG3w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/170660/technical-product-lead-clevertech?a=VevLGfSP04w",
    "title": "Technical Product Lead at Clevertech  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Technical Product Lead</strong></p><p><strong>DESCRIPTION:</strong></p><p>Clevertech is looking for a permanent Full-Time Technical Lead to join our worldwide team. Clevertech looks for craftsmen developers who take ownership of their code. You can deliver quickly while being clever to avoid missteps.</p><p>You have an effective positive attitude that shines as you show your care about the client’s concerns as well as a colleague’s concerns. You are always learning and are a transparent communicator even when it is challenging.</p><p>Our technical product leaders spend much of their time in the code. Develop world class software products for the most exclusive companies in the world. 75% of your time leading the technical strategy in the code; 25% of your time in meetings organizing and unlocking the other devs</p><p>You set the mood on the team. Not only internally but also with our clients. You get excited about getting the best out of team member and have demonstrated successful product launches.</p><p><strong>REQUIREMENTS:</strong></p><ul><li><p>7+ years of experience in software development teams. New tools are great, but fundamentals of data structures, design patterns, and programming practices are what deliver projects.</p></li><li><p>Has led a product meeting that has technical implications with Fortune 500 executives sitting around a conference room table</p></li><li><p>Deep knowledge of Javascript and language agnostic as we utilize other technologies such as Python, Clojure, Go, C# and on occasion Java or C++ .</p></li><li><p>Well qualified applicants will have deep experiences in the latest libraries and programming techniques. You have accomplishments that showcase your capabilities.</p></li><li><p>Excellent self-starter who collaborates effectively with all stakeholders, and has the ability to work in a fast-paced team.</p></li></ul><p><strong>BENEFITS</strong></p><p><strong>Own Your Time</strong></p><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting.</p><p><strong>Recharge Time</strong></p><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p><strong>Care For Yourself</strong></p><p>You’ll receive a health/wellness stipend that can go towards covering medical insurance, dental insurance, or joining a gym!</p><p><strong>Learn at your edges</strong></p><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here. And of course, if you speak at a tech conference, we cover all expenses.</p><p><strong>Clevertech Swag</strong></p><p>And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p><p>Want to learn more about Clevertech and the team? Check out&nbsp;<a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p>                    </div>                            <h2>                About Clevertech            </h2>            <div><p><strong>We’re always looking for smart, driven, entrepreneurial developers to join our team.</strong></p><p><strong>If you like new ideas and want to work with a virtual but absurdly talented group of people in a learning-friendly environment, check out the open positions.</strong></p><p><strong>No matter what you do at Clevertech, you'll play a part in transforming ideas into software that changes the world.</strong></p><p><strong>Just answer a few quick questions and learn a little more about our culture.</strong></p><p><strong>We’re waiting for you, and ready to do great things together!</strong></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Full-Time Telecommuting                            </div>                            <div>                                 Flexible Schedules                            </div>                            <div>                                 Paid Time Off                            </div>                            <div>                                 Ability to Work with Cutting-Edge Technology                            </div>                            <div>                                 Opportunity to Work with and Learn from Top Developers                            </div>                            <div>                                 Contribute to Open Source                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "hXsD3G66QYOD6vT83aEV4g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/1094-java-c-engineer",
    "title": "Java/ C++ Engineer",
    "content": "Java/ C++ Engineer - Jobmote<div><div><h2>Java/ C++ Engineer</h2><h5>Clevertech</h5></div></div><div><div><div><div></div></div><div><div><div><p><strong>DESCRIPTION</strong></p><p>Clevertech is looking for a Java Engineer to join our global team. This role has database design and implementation responsibilities including alternative data structures such as nosql, redis, elasticsearch and more. Clevertech looks for craftsmen developers who take ownership of their code.</p><p>You can deliver quickly while being clever to avoid missteps. You have an effective positive attitude that shines as you show you care about client and colleague concerns. You are always learning and are a transparent communicator even when it is challenging. You thrive on challenging yourself daily and seek to surround yourself with like minded individuals.</p><p><strong>REQUIREMENTS</strong></p><ul><li>Programming skills– You are comfortable writing code in multiple languages, confident in choosing the right strongly or dynamically typed language for the job. Preferred language familiarity: C++, Java, NodeJS, Ruby, Scala, and/or Go.</li><li>Database skills – You understand the use cases for relational and non-relational data, you’ve implemented code against several different database platforms.</li><li>Development experience - Java Web Applications, Service Oriented Architecture and Micro-Services.</li><li>Knowledge of micro-services networking, load balancing, and service discovery concepts and technologies.</li><li>Conduct code walk-throughs, peer reviews, and produce technical documentation.</li><li>Bachelor’s Degree in Computer Science/Engineering or equivalent years of hands-on coding experience.</li><li>Strong communicator and fluent in English with excellent written and verbal communication skills.</li><li>Knowledge of Agile Methodologies</li></ul><p><strong>BENEFITS</strong></p><p><strong>Own Your Time</strong></p><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travelers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting.</p><p><strong>Recharge Time</strong></p><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p><strong>Care For Yourself</strong></p><p>You’ll receive a health/wellness monthly stipend that goes towards covering medical insurance, dental insurance or joining a gym!</p><p><strong>Focused Work</strong></p><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams.</p><p><strong>Learn at your edges</strong></p><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here. And of course, if you speak at a tech conference, we cover all expenses.</p><p><strong>Clevertech Swag</strong></p><p>And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over Slack.</p><p>Want to learn more about Clevertech and the team? Check out&nbsp;<a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "Mar 13, 2018 5:20:46 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/java",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "java"
    ]
  },
  {
    "id": "V9WES16TQhmdO8cTI2BjxQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobs.github.com-remote",
    "url": "http://jobs.github.com/positions/10319492-2218-11e8-9a54-4736562032b8",
    "title": "Full Time: TECHNICAL PRODUCT LEAD at Clevertech in Remote",
    "content": "<p><strong>DESCRIPTION:</strong>Clevertech is looking for a Tech Lead to join our worldwide team. Clevertech looks for craftsmen developers who take ownership of their code. You can deliver quickly while being clever to avoid missteps.</p><p>You have an effective positive attitude that shines as you show your care about the client’s concerns as well as a colleague’s concerns. You are always learning and are a transparent communicator even when it is challenging.</p><p>Our technical product leaders spend much of their time in the code. Develop world class software products for the most exclusive companies in the world. 75% of your time leading the technical strategy in the code; 25% of your time in meetings organizing and unlocking the other devs</p><p>You set the mood on the team. Not only internally but also with our clients. You get excited about getting the best out of team member and have demonstrated successful product launches.</p><p><strong>REQUIREMENTS:</strong></p><ul><li><p>7+ years of experience in software development teams. New tools are great, but fundamentals of data structures, design patterns, and programming practices are what deliver projects.</p></li><li><p>Has led a product meeting that has technical implications with Fortune 500 executives sitting around a conference room table</p></li><li><p>Deep knowledge of Javascript and language agnostic as we utilize other technologies such as Python, Clojure, Go, C# and on occasion Java or C++ .</p></li><li><p>Well qualified applicants will have deep experiences in the latest libraries and programming techniques. You have accomplishments that showcase your capabilities.</p></li><li><p>Excellent self-starter who collaborates effectively with all stakeholders, and has the ability to work in a fast-paced team.</p></li></ul><p><strong>BENEFITS:</strong></p><p><em>Own Your Time</em>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting.</p><p><em>Recharge Time</em>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p><em>Care For Yourself</em>You’ll receive a health/wellness stipend that can go towards covering medical insurance, dental insurance, or joining a gym!</p><p><em>Focused Work</em>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams.</p><p><em>Learn at your Edges</em>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here. And of course, if you speak at a tech conference, we cover all expenses.</p><p><em>Clevertech Swag</em>And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p><p>Want to learn more about Clevertech and the team? Check out <a href='https://youtu.be/KwOz-y4uuWk' rel='nofollow'>https://youtu.be/KwOz-y4uuWk</a></p>",
    "urlFetchPending": false,
    "published": "Mar 7, 2018 5:01:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "ZSZ-g5E3TAGnQXKnYm7OrA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workingnomads.co",
    "url": "https://www.workingnomads.co/jobs/technical-product-lead-clevertech-18901",
    "title": "Technical Product Lead",
    "content": "<p><strong>DESCRIPTION:</strong></p><p>Clevertech is looking for a Tech Lead to join our worldwide team. Clevertech looks for craftsmen developers who take ownership of their code. You can deliver quickly while being clever to avoid missteps.</p><p>You have an effective positive attitude that shines as you show your care about the client’s concerns as well as a colleague’s concerns. You are always learning and are a transparent communicator even when it is challenging.</p><p>Our technical product leaders spend much of their time in the code. Develop world class software products for the most exclusive companies in the world. 75% of your time leading the technical strategy in the code; 25% of your time in meetings organizing and unlocking the other devs</p><p>You set the mood on the team. Not only internally but also with our clients. You get excited about getting the best out of team member and have demonstrated successful product launches.</p><p><strong>REQUIREMENTS:</strong></p><ul><li><p>7+ years of experience in software development teams. New tools are great, but fundamentals of data structures, design patterns, and programming practices are what deliver projects.</p></li><li><p>Has led a product meeting that has technical implications with Fortune 500 executives sitting around a conference room table</p></li><li><p>Deep knowledge of Javascript and language agnostic as we utilize other technologies such as Python, Clojure, Go, C# and on occasion Java or C++ .</p></li><li><p>Well qualified applicants will have deep experiences in the latest libraries and programming techniques. You have accomplishments that showcase your capabilities.</p></li><li><p>Excellent self-starter who collaborates effectively with all stakeholders, and has the ability to work in a fast-paced team.</p></li></ul><p><strong>BENEFITS</strong></p><p>Own Your Time</p><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting.</p><p>Recharge Time</p><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p>Care For Yourself</p><p>You’ll receive a health/wellness stipend that can go towards covering medical insurance, dental insurance, or joining a gym!</p><p>Focused Work</p><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams.</p><p>Learn at your edges</p><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here. And of course, if you speak at a tech conference, we cover all expenses.</p><p>Clevertech Swag</p><p>And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p><p>&nbsp;</p><p>Want to learn more about Clevertech and the team? Check out&nbsp;https://youtu.be/KwOz-y4uuWk</p>",
    "urlFetchPending": false,
    "published": "Mar 6, 2018 6:10:27 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "FfV3lHEES2-EyyZSU0iwUA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/66766/lead-game-cheat-developer-c-at-advanced-gaming-solutions/",
    "title": "Lead Game Cheat Developer C++",
    "content": "Hello,<br /><br />We are currently looking to hire developer's / development team. <br /><br />We are looking for some very experienced developers to create hacks / provide currently build hacks to our user base. We have a few thousand paying active customers mainly to our PUBG hack.<br /><br />Loader required - user can login and inject the selected cheat into the game securely and undetected.<br /><br />*Salary*<br />Salary is all depending on skill we are very flexible <br /><br />*Skills & Requirements:*<br />C++<br />C<br />ASM<br />Memory static Addresses & Offsets <br />DLL injection<br />Anticheat Bypasses<br />Reverse Engineering<br />Encryption<br />Windows Server<br /><br />*Games required:*<br />BF1<br />BF3<br />BF4<br />black squad<br />rainbow six seige<br />rust<br />h1z1<br />h1z1 just survive<br />h1z1 king of the kill<br />warface<br />arma 3<br />arma 2 / dayz mod<br />war thunder<br />world of warships<br />dayz standalone<br />dead by day light<br />ark survival evolved<br />the newz<br />pladins<br />dirty bomb<br />PUBG<br />etc......<br /><br />The job can be remote or in our office. *You must be able to bypass the anti cheat systems.*<br /><br /><br /><br /><br /><br />*We look forwards to hearing from you*",
    "urlFetchPending": false,
    "published": "Mar 5, 2018 4:25:36 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "llnwYWdMTsKVz4ZhlQIH8A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16500348",
    "title": "Wikitude | Software Engineer - iOS | Salzburg, Austria | ONSITE, REMOTE | Type: Full time | € 33k-45k p.a. + fringe benefits",
    "content": "<div>                  <span>Wikitude | Software Engineer - iOS | Salzburg, Austria | ONSITE, REMOTE |  Type: Full time | € 33k-45k p.a. + fringe benefits<p>Wikitude is building and providing one of the major mobile augmented reality SDKs out in the market.</p><p>Responsibilities and tasks will include• Design and implementation of features for the Wikitude SDK for iOS• Maintain and update relevant iOS sample apps• Contribute to Wikitude SDK core features (C++)• Working on the next generation of augmented reality for mobile devices</p><p>More details: <a href='https://www.wikitude.com/about/jobs-career/software-engineer-ios/' rel='nofollow'>https://www.wikitude.com/about/jobs-career/software-engineer...</a></p><p>Wikitude |Technical QA Engineer | Salzburg, Austria | ONSITE | Type: Full time | € 33k-45k p.a. + fringe benefits</p><p>Responsibilities and tasks will include• Build the QA team for production releases of our SDK• Define and work on test strategy and test setup</p><p>More details: <a href='https://www.wikitude.com/about/jobs-career/job-opening-technical-qa-engineer-full-time/' rel='nofollow'>https://www.wikitude.com/about/jobs-career/job-opening-techn...</a></p><p>Location: Salzburg, Austria in the center of Europe has a great quality of living. Salzburg lies directly at the gate to the Alps. Within 25 mins you can reach great mountain areas as well as beautiful lake side. The vicinity to Munich and Vienna make it easy to travel abroad. Costs of living are way lower compared to Silicon Valley (I know the salary range looks ridiculous to someone from the US - however salary@Wikitude is above Austria industry average).</p><p>To apply send your CV and cover letter to jobs@wikitude.com Phil - CTO, Wikitude - happy to answer any questions<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 2, 2018 1:00:08 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/c",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "c",
      "mobile"
    ]
  },
  {
    "id": "EAizOOVYQV2r1jWsxaxkOw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16494127",
    "title": "SUSE | Software Engineer | REMOTE (worldwide) or ONSITE | Full Time",
    "content": "<div>                  <span>SUSE | Software Engineer | REMOTE (worldwide) or ONSITE | Full Time<p><i>Debug Infrastructure Developer (Linux/GDB)</i></p><p>As SUSE Labs toolchain developer you will be working with the community to improve the Linux toolchain (mainly GCC, GDB, binutils and glibc), concentrating on debugging facilities. Your responsibilities will include fixing implementation problems, discussing design ideas and implementing them when concluded as viable and feasible. You will be presenting your work by providing whitepapers or articles or by giving presentations at technical conferences.</p><p>10% of your work time will be reserved for general open source work. This is not limited to toolchain issues and you can chose freely on what projects to spend it on.</p><p>The team is widely distributed around the world, and most of its members are working remotely. If you want to work from a SUSE office instead, that is fine as well.</p><p><i>How to apply</i></p><p>Preferably, submit all relevant information in a single PDF file, so that no important detail is lost in transit. Give us some time to process your application. Expect the interview to be done over phone. Form submission for this position at <a href='https://jobs.suse.com/job/nuremberg/debug-infrastructure-developer-flexible-location-worldwide/3486/7030697' rel='nofollow'>https://jobs.suse.com/job/nuremberg/debug-infrastructure-dev...</a></p><p>This is not the only job opening currently available at SUSE, see suse.com/jobs<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 7:33:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "tRMdrIwdTyi9_H2-L63mhw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/169226/tech-lead-product-lead-clevertech?a=UKH7bFYUeru",
    "title": "Tech Lead/Product Lead at Clevertech  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>DESCRIPTION:</strong></p><p>Clevertech is looking for a Tech Lead to join our worldwide team.Clevertech looks for craftsmen developers who take ownership of their code. You can deliver quickly while being clever to avoid missteps.</p><p>You have an effective positive attitude that shines as you show your care about the client’s concerns as well as a colleague’s concerns. You are always learning and are a transparent communicator even when it is challenging.</p><p>Our product tech leads spend much of their time in the code. Develop world class software products for the most exclusive companies in the world.</p><ul><li>75% of your time leading the technical strategy in the code;</li><li>25% of your time in meetings organizing and unlocking the other devs</li></ul><p><br>You set the mood on the team. Not only internally but also with our clients. You get excited about getting the best out of team member and have demonstrated successful product launches.</p><p>REQUIREMENTS:</p><ul><li>You have actually led a team of developers</li><li>7+ years of experience in software development teams. New tools are great, but fundamentals of data structures, design patterns, and programming practices are what deliver projects.</li><li>Has led a product meeting that has technical implications with Fortune 500 executives sitting around a conference room table</li><li>Deep knowledge of Javascript and language agnostic as we utilize other technologies such as Python, Clojure, Go, C# and on occasion Java or C++ .</li><li>Well qualified applicants will have deep experiences in the latest libraries and programming techniques. You have accomplishments that showcase your capabilities.</li><li>Excellent self-starter who collaborates effectively with all stakeholders, and has the ability to work in a fast-paced team.</li></ul><p><br><br></p><p><strong>BENEFITS</strong></p><p><strong>Own Your Time</strong></p><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting.</p><p><strong>Recharge Time</strong></p><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p><strong>Care For Yourself</strong></p><p>You’ll receive a health/wellness stipend that goes towards covering medical insurance, dental insurance, or joining a gym!</p><p><strong>Focused Work</strong></p><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams.</p><p><strong>Learn at your edges</strong></p><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</p><p>And of course, if you speak at a tech conference, we cover all expenses.</p><p><strong>Clevertech Swag</strong></p><p>And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p><p>Want to learn more about Clevertech and the team? Check out <a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p><p><br><br></p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Full-Time Telecommuting                            </div>                            <div>                                 Flexible Schedules                            </div>                            <div>                                 Paid Time Off                            </div>                            <div>                                 Ability to Work with Cutting-Edge Technology                            </div>                            <div>                                 Opportunity to Work with and Learn from Top Developers                            </div>                            <div>                                 Contribute to Open Source                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 7:03:19 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "aP6iYU_KQ2uczsyO4qe1IA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4198-senior-c-c-software-engineer-airtame",
    "title": "Senior C/C++ Software Engineer @ Airtame",
    "content": "<h2>              Senior C/C++ Software Engineer<small> @ Airtame</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-03-01 03:54</p></dd>          <dt><span>Description</span></dt>          <dd><h5>The role</h5><p>As a Senior C/C++ Software Engineer at Airtame, you and your team will be responsible for developing the core of our wireless streaming software, which is responsible for capturing, encoding and transmitting audio and video data, then receiving, decoding and rendering the content on the Airtame device. This is low-level software which runs under CPU, memory and time constraints, requiring significant focus on performance, concurrency, and resource lifecycles.</p><p>Our talented engineers are given significant ownership and responsibility over projects. We value rapid iteration, continuous integration and testing, and we are serious about producing <a href='http://blog.airtame.com/code-quality-at-airtame/' rel='nofollow'>high-quality, maintainable software</a>. Frequent code reviews, linting, and pairing are all integral components of our engineering culture. We encourage experimenting with new technologies and constantly challenge ourselves to improve our code, processes, and systems.</p><h5>Requirements</h5><ul><li>Proven experience developing highly performant software in C or C++</li><li>Deep understanding of concurrency, memory management and object lifecycles</li><li>Experience developing cross-platform native code is a big plus</li><li>Experience with network protocols and security is a big plus</li><li>Experience with Windows APIs development is a plus</li><li>Experience with real-time low-level programming is a plus</li><li>Experience with assembly and embedded programming is a plus</li><li>Experience designing C/C++ APIs/libraries is a plus</li><li>Excellent English communication skills</li></ul><h5>Perks</h5><ul><li>Be part of a top-notch engineering culture which thrives on learning and having fun</li><li>Daily catered lunch, fridge full of sodas, snacks, and great coffee</li><li>Slacklining, fussball, hackathons, meetups, parties and many more events</li><li>Perfect office location in the heart of Copenhagen (around the corner from Rådhuspladsen)</li><li>Competitive salary</li><li>Your choice of hardware</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 5:54:12 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "mGONqOghR8WNwQstXeAezQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/910-tech-lead-product-lead",
    "title": "Tech Lead/Product Lead",
    "content": "Tech Lead/Product Lead - Jobmote<div><div><h2>Tech Lead/Product Lead</h2><h5>Clevertech</h5></div></div><div><div><div><div><div><p><strong>DESCRIPTION:</strong></p><p>Clevertech is looking for a Tech Lead to join our worldwide team.Clevertech looks for craftsmen developers who take ownership of their code. You can deliver quickly while being clever to avoid missteps.</p><p>You have an effective positive attitude that shines as you show your care about the client’s concerns as well as a colleague’s concerns. You are always learning and are a transparent communicator even when it is challenging.</p><p>Our product tech leads spend much of their time in the code. Develop world class software products for the most exclusive companies in the world.</p><ul><li>75% of your time leading the technical strategy in the code;</li><li>25% of your time in meetings organizing and unlocking the other devs</li></ul><p>You set the mood on the team. Not only internally but also with our clients. You get excited about getting the best out of team member and have demonstrated successful product launches.</p><p>REQUIREMENTS:</p><ul><li>You have actually led a team of developers</li><li>7+ years of experience in software development teams. New tools are great, but fundamentals of data structures, design patterns, and programming practices are what deliver projects.</li><li>Has led a product meeting that has technical implications with Fortune 500 executives sitting around a conference room table</li><li>Deep knowledge of Javascript and language agnostic as we utilize other technologies such as Python, Clojure, Go, C# and on occasion Java or C++ .</li><li>Well qualified applicants will have deep experiences in the latest libraries and programming techniques. You have accomplishments that showcase your capabilities.</li><li>Excellent self-starter who collaborates effectively with all stakeholders, and has the ability to work in a fast-paced team.</li></ul><p><strong>BENEFITS</strong></p><p><strong>Own Your Time</strong></p><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting.</p><p><strong>Recharge Time</strong></p><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p><strong>Care For Yourself</strong></p><p>You’ll receive a health/wellness stipend that goes towards covering medical insurance, dental insurance, or joining a gym!</p><p><strong>Focused Work</strong></p><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams.</p><p><strong>Learn at your edges</strong></p><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</p><p>And of course, if you speak at a tech conference, we cover all expenses.</p><p><strong>Clevertech Swag</strong></p><p>And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p><p>Want to learn more about Clevertech and the team? Check out <a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Feb 27, 2018 2:21:49 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "EJftAF8DR3CJT5cssRbMFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4170-full-stack-hugo-insurance",
    "title": "Full Stack @ Hugo Insurance",
    "content": "<h2>              Full Stack<small> @ Hugo Insurance</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-26 14:42</p></dd>          <dt><span>Description</span></dt>          <dd><p>We've built a microservice architecture that allows us to rapidly scale to accommodate ever-increasing user needs. Your job is to build new services that enhance the customer experience or our internal tooling while maintaining our standards of performance and robustness.</p><p>You'll collaborate closely with our CEO, CTO, DevOps, and Front End engineers to build across our tech stack and deliver best-in-class insurance technology.</p><p>As with all of our engineers, you will test, QA, deploy, and maintain your own code within our continuous integration framework. That means pushing a change to production on your first day, and continuing to improve our services from then on. As you learn, you'll be able to keep the team informed on emerging best practices, and champion ideas you believe in.</p><p><strong><em>We pay competitive salaries. We're serious about remote work and flexible hours. Equity and benefits included. All negotiable.</em></strong></p><h5>REQUIREMENTS</h5><ul><li>Experience building and maintaining distributed systems</li><li>Fundamentals in data structures, algorithm design, problem solving, and complexity analysis</li><li>Demonstrated debugging and troubleshooting skills</li><li>Advanced knowledge of C++ or Java</li><li>Experience with Git or another distributed version control system</li></ul><h5>IDEAL CANDIDATE</h5><ul><li>5+ years of engineering experience</li><li>Excited to work in a rigorous CI environment that favors robust, performant code vs. quick hacks</li><li>Contributions to open source projects</li><li>Advanced knowledge of JavaScript</li><li>Proficient with Git/Github and Jenkins </li><li>Deeply motivated to build things that make a real difference to everyday lives</li></ul><h5>Working at Hugo</h5><p>Whether you're an engineer, a designer, or an adjuster, every position at Hugo requires three things: estimating how much work a given task will take, when you will be finished with it, and what it means for our members. These three things let us work flexibly because we are consistently improving our forecasting ability and staying motivated to deliver for our members. </p><p>What does that mean for the day-to-day? It means a single team check-in at 9AM PT where you discuss your tasks for the day and any help you will need. Then, you're free to complete that task at your own pace and on your own schedule. We do a weekly retrospective to assess team performance, and a bi-weekly sprint planner. </p><p>Every team seeks to get something out into the wild every day - whether it's a paper prototype or a full deployment to production.</p><p>We take your personal development seriously - the better you are, the better we can deliver for our members and community. As part of your onboarding, we'll discuss your development goals and how we can contribute. That includes everything from blog posts to conferences and sponsored meet-ups. </p><p>Hugo is an EEO employer that actively pursues and hires a diverse workforce, and will consider for employment qualified applicants with arrest and conviction records. Our salaries, perks, and benefits are all negotiable. We don’t judge people based on schools or degrees.</p><h5>Our application process</h5><p>Our goal is to take as little of your time as possible - and be transparent throughout.</p><p>Every candidate answers 3 relevant entry-level questions. Technical and design hires submit 2 portfolio pieces. Please do not send a resume or &quot;about me&quot;.</p><p>If things work out, we will invite you to a 30 minute call where we will discuss your prior experience and future goals, and roles you've enjoyed or found frustrating. </p><p>If that call goes well, we will invite you to a 30 minute call to discuss your area of expertise and work habits.</p><p>From there, you will be provided an area-specific problem to solve in your own time (with as much or as little support from us as desired), followed by a two-on-one review and debrief call. We then check references and prepare to make an offer!</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 4:42:23 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "VTkaLnOHS_eAQrEnnDrYeg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30344?r=rss2",
    "title": "Very: Sr. Software Engineer Full Stack",
    "content": "<p>Full-time</p><p><strong>(Remote or Chattanooga, TN)</strong> </p><p>Interviewing for a new company is a serious time commitment for all parties involved. Please take the time to read this and thoughtfully consider if we would be a good fit for one another. This is a full-time position. You must be located in the continental U.S. No contractors or agencies. Seriously.</p><p><strong>Why We Started Very</strong></p><p>Not to oversimplify things, but our mission is to become the best IoT, blockchain, and machine learning product development shop in the world. We do this by hiring the best and investing heavily in them, both personally and professionally.</p><p><strong>We Fully Embrace Working Remotely</strong></p><p>About 30% of our team works out of our HQ in Chattanooga, TN, and the other 70% work remotely from various locations across the United States. We consider ourselves best-practitioners of the remote-first movement and believe a great team shouldn’t be restricted by geography.</p><p><strong>What You’ll Be Working On</strong></p><p>Very is first and foremost a software consultancy, we tackle hard problems for clients who need a targeted, senior team to come in and provide specific solutions. We are focusing heavily on building out products that have applications in one of the three following areas: 1) data science &amp; machine learning, 2) Internet of Things, and 3) blockchain. We’ve found that in each of these areas, the use of the underlying technology will drive the development of the core services , but that 75% of the work often still lives in the realm of modern web development.</p><p>At Very, there is a never ending supply of variety to the types of projects we work on. In the last year we’ve built solutions that touch e-commerce, trust management (finance), beer distribution, point of sale systems, ICO’s, identifying fake news, and much more.</p><p>You’ll spend 80% of your week (Monday through Thursday) designing and building a product or platform for one of our clients. The other 20% of your week (Friday) will be spent contributing to our open source projects, internal products, learning, teaching, and participating in internal operations of all flavors.</p><p>Project teams are small and usually made up of one or two pairs of engineers, a UX engineer, a product manager, and the client who serves as the product owner. We spend most of our time building new products, with the goal of helping our clients take it to market. We are often further engaged by our clients to continue iterating on the product once it is live. The high cost of context switching is real, so we do our best to keep teams together throughout the duration of their projects (typically 3-6 months), but have found it valuable to rotate pairing partners when it makes reasonable sense.</p><p>We are always exploring new tools, languages, and technologies. We feel strongly that it’s a good idea to use the best tool for the job and not see everything as a nail. We also try our best to standardize our technology and tooling across project teams so it’s easier to rotate and practice collective code ownership. We are currently building products and platforms using the following tools / platforms:</p><ul><li><p>React &amp; React Native</p></li><li><p>Swift &amp; Objective C</p></li><li><p>Elixir, Phoenix, and Nerves</p></li><li><p>Arduino (embedded C/C++)</p></li><li><p>Ethereum / Solidity</p></li><li><p>Ruby on Rails</p></li><li><p>Python</p></li><li><p>Pandas</p></li><li><p>Serverless</p></li><li><p>AWS (and a dash of Heroku where it makes sense)</p></li></ul><p>Given that we work on quite a bit of greenfield projects, there is often room to experiment with new patterns and tools (within reason). We don’t expect applicants to know our entire toolchain, but rather to be capable, flexible, and self-directed.</p><p><strong>This Role: Senior Full-Stack Software Engineer</strong></p><p>As a full-stack engineer at Very, you will work on a wide variety of projects and stacks. This job is a great fit for pragmatic polyglot programmers with a functional bend. Over the last few years, we’ve shipped countless Ruby on Rails projects and are at the tail end of moving to Elixir for the bulk of our services. Additionally, we have a strong Python contingent who are utilizing the serverless framework for the development of highly targeted microservices / systems as well as for data science and machine learning projects.</p><p>We value well-tested, reusable code and expect our engineers to be as good of practitioners as they are leaders and teachers.</p><p><strong>How We Operate</strong></p><p>We are believers in transparency and openness. In terms of organizational structure and governance, we are a <a href='http://www.holacracy.org/' rel='nofollow'>holacracy</a>. It’s worked pretty well for the us the last few years. When it comes to development processes, we do our best to adhere as closely to <a href='http://www.extremeprogramming.org/' rel='nofollow'>Extreme Programming</a> as possible. We believe in hiring capable, responsible professionals. We don’t micromanage and trust everyone to work hard, experiment, learn from their mistakes, and contribute to each other and the company in a sustainable manner. We have no venture funding or external investors, which affords us the ability to be nimble and run our company in the best interest of our team as a whole.</p><p><strong>How You’ll Be Compensated</strong></p><p>We believe in a transparent, fair compensation structure and have developed our own open salary formula. Depending on your skill and experience, you can expect to make somewhere between $80,000 and $135,000 upon joining the company. We have many health plans available through UHC—prices and plans vary based on your region—as well as vision and dental. We currently contribute a large portion to each plan, again, amounts vary based on region. As an added benefit, Very provides 1X Earnings Basic Life &amp; AD&amp;D. We have a 401k program that we’ll provide a 2% match on after a few months working with us. Lastly, 35% of the company’s ownership is reserved for a team member options pool.</p><p></p><p><strong>Apply:</strong> This is a full-time employment opportunity for a single individual. We’re not looking for contractors, part-time individuals, or agencies of any kind. Applicants must be located in the continental United States. Thanks!To apply, please send us a note to jobs-aj@verypossible.com with &quot;Sr. Software Engineer Full Stack&quot; in the subject line. Please include the following:1. What’s most important to you from a company culture and operating environment?2. What are the biggest things that de-motivate you and make you unhappy when it comes to being an engineer working on teams within a company?3. Your resume4. Code samples with comments explaining what you did and how you architected the code.</p>",
    "urlFetchPending": false,
    "published": "Feb 23, 2018 8:42:55 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/c",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "c",
      "ruby"
    ]
  },
  {
    "id": "bY7O7W9JRqqMSQPS5eoDhA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30343?r=rss2",
    "title": "Very: Senior Software Engineer JavaScript",
    "content": "<p>Full-time</p><p><strong>(Remote or Chattanooga, TN)</strong> </p><p>Interviewing for a new company is a serious time commitment for all parties involved. Please take the time to read this and thoughtfully consider if we would be a good fit for one another. This is a full-time position. You must be located in the continental U.S. No contractors or agencies. Seriously.</p><p><strong>Why We Started Very</strong></p><p>Not to oversimplify things, but our mission is to become the best IoT, blockchain, and machine learning product development shop in the world. We do this by hiring the best and investing heavily in them, both personally and professionally.</p><p><strong>We Fully Embrace Working Remotely</strong></p><p>About 30% of our team works out of our HQ in Chattanooga, TN, and the other 70% work remotely from various locations across the United States. We consider ourselves best-practitioners of the remote-first movement and believe a great team shouldn’t be restricted by geography.</p><p><strong>What You’ll Be Working On</strong></p><p>Very is first and foremost a software consultancy, we tackle hard problems for clients who need a targeted, senior team to come in and provide specific solutions. We are focusing heavily on building out products that have applications in one of the three following areas: 1) data science &amp; machine learning, 2) Internet of Things, and 3) blockchain. We’ve found that in each of these areas, the use of the underlying technology will drive the development of the core services , but that 75% of the work often still lives in the realm of modern web development.</p><p>At Very, there is a never ending supply of variety to the types of projects we work on. In the last year we’ve built solutions that touch e-commerce, trust management (finance), beer distribution, point of sale systems, ICO’s, identifying fake news, and much more.</p><p>You’ll spend 80% of your week (Monday through Thursday) designing and building a product or platform for one of our clients. The other 20% of your week (Friday) will be spent contributing to our open source projects, internal products, learning, teaching, and participating in internal operations of all flavors.</p><p>Project teams are small and usually made up of one or two pairs of engineers, a UX engineer, a product manager, and the client who serves as the product owner. We spend most of our time building new products, with the goal of helping our clients take it to market. We are often further engaged by our clients to continue iterating on the product once it is live. The high cost of context switching is real, so we do our best to keep teams together throughout the duration of their projects (typically 3-6 months), but have found it valuable to rotate pairing partners when it makes reasonable sense.</p><p>We are always exploring new tools, languages, and technologies. We feel strongly that it’s a good idea to use the best tool for the job and not see everything as a nail. We also try our best to standardize our technology and tooling across project teams so it’s easier to rotate and practice collective code ownership. We are currently building products and platforms using the following tools / platforms:</p><ul><li><p>React &amp; React Native</p></li><li><p>Swift &amp; Objective C</p></li><li><p>Elixir, Phoenix, and Nerves</p></li><li><p>Arduino (embedded C/C++)</p></li><li><p>Ethereum / Solidity</p></li><li><p>Ruby on Rails</p></li><li><p>Python</p></li><li><p>Pandas</p></li><li><p>Serverless</p></li><li><p>AWS (and a dash of Heroku where it makes sense)</p></li></ul><p>Given that we work on quite a bit of greenfield projects, there is often room to experiment with new patterns and tools (within reason). We don’t expect applicants to know our entire toolchain, but rather to be capable, flexible, and self-directed.</p><p><strong>This Role: Senior Software Engineer // Javascript</strong></p><p>Over the past few years, we’ve seen client-side engineering emerge as its own discipline, and we are looking for individuals who thrive in the front end and want to further their practice. Ideal candidates not only have a solid engineering background, but a passion for client-side development as well.</p><p>We value well-tested, reusable code and expect our engineers to be as good of practitioners as they are leaders and teachers.</p><p><strong>How We Operate</strong></p><p>We are believers in transparency and openness. In terms of organizational structure and governance, we are a <a href='http://www.holacracy.org/' rel='nofollow'>holacracy</a>. It’s worked pretty well for the us the last few years. When it comes to development processes, we do our best to adhere as closely to <a href='http://www.extremeprogramming.org/' rel='nofollow'>Extreme Programming</a> as possible. We believe in hiring capable, responsible professionals. We don’t micromanage and trust everyone to work hard, experiment, learn from their mistakes, and contribute to each other and the company in a sustainable manner. We have no venture funding or external investors, which affords us the ability to be nimble and run our company in the best interest of our team as a whole.</p><p><strong>How You’ll Be Compensated</strong></p><p>We believe in a transparent, fair compensation structure and have developed our own open salary formula. Depending on your skill and experience, you can expect to make somewhere between $80,000 and $135,000 upon joining the company. We have many health plans available through UHC—prices and plans vary based on your region—as well as vision and dental. We currently contribute a large portion to each plan, again, amounts vary based on region. As an added benefit, Very provides 1X Earnings Basic Life &amp; AD&amp;D. We have a 401k program that we’ll provide a 2% match on after a few months working with us. Lastly, 35% of the company’s ownership is reserved for a team member options pool.</p><p>&nbsp;</p><p>&nbsp;</p><p></p><p><strong>Apply:</strong> This is a full-time employment opportunity for a single individual. We’re not looking for contractors, part-time individuals, or agencies of any kind. Applicants must be located in the continental United States. Thanks!To apply, please send us a note to jobs-aj@verypossible.com with &quot;Senior Software Engineer -- Javascript&quot; in the subject line. Please include the following:1. What’s most important to you from a company culture and operating environment?2. What are the biggest things that de-motivate you and make you unhappy when it comes to being an engineer working on teams within a company?3. Your resume4. Code samples with comments explaining what you did and how you architected the code.</p>",
    "urlFetchPending": false,
    "published": "Feb 23, 2018 8:42:55 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/frontend",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "c",
      "frontend",
      "mobile"
    ]
  },
  {
    "id": "1HPJIqi4T0iVq4PcDTk-KA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168087/senior-database-engineer-stardog-union?a=Un0LoUSeOIw",
    "title": "Senior Database Engineer at Stardog Union (Arlington, VA) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Databases, Enterprise Software, Information Technology</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Stardog is the world's leading Knowledge Graph platform for the Enterprise. Turn data into knowledge faster and easier. Stardog lets you query, search, and analyze enterprise data, wherever it is, using scalable, cutting-edge Knowledge Graph technology.</p><p>We're looking for a talented database engineer to join our team to help us build and grow the Stardog Knowledge Graph. You will work on the backend team *building* and evolving the storage layer within Stardog, help with its integration into other parts of the system, such as query optimization, and work on designing and implementing the next generation of features for this part of the Stardog Knowledge Graph.<br><br>If you care deeply about optimization, mechanical sympathy, endian-ness, and you're not afraid of cmake, this is the job for you. If you're a database administrator, this is not the right fit.</p><p>Responsibilities</p><ul><li>Work as a member of the team building our next-generation backend storage system</li><li>Help extend query optimization to better leverage&nbsp;the backend</li><li>Implement new features based on new capabilities&nbsp;being added to the storage&nbsp;system</li></ul><p>Requirements</p><ul><li>5+ years programming experience, C++ preferred, Java is a plus</li><li>Strong computer science fundamentals, with advanced knowledge of&nbsp;data structures, algorithms and software design</li><li>Knowledge of database fundamentals, joins, scans, planning, etc.&nbsp;</li><li>Previous experience with RocksDb is a major plus</li><li>Ability&nbsp;to work in&nbsp;a distributed team mainly&nbsp;communicating&nbsp;over email, chat, and&nbsp;phone</li><li>Experience with&nbsp;graph technologies or databases&nbsp;is a plus</li></ul>                    </div>                            <h2>                About Stardog Union            </h2>            <div><p>Our culture is based on engineering excellence, mutual respect, collegiality in all things, rigor in design, research, implementation, and testing. We care deeply about work-life balance and productivity in the short and long run. In sum, if you remove the unnecessary, the distracting, and the tedious, what you're left with is a healthy 40 hour week full of wins</p><p><em>We are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</em></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Health care including dental &amp; vision, some plans fully company paid                            </div>                            <div>                                 401k                            </div>                            <div>                                 3 weeks vacation                            </div>                            <div>                                 Remote work available for qualified candidates                            </div>                            <div>                                 Top of the line hardware                            </div>                            <div>                                 Flexible work schedule                            </div>                            <div>                                 Company paid life and disability benefits                            </div>                            <div>                                 Well stocked kitchen, snacks, lunch, and most importantly, coffee                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 18, 2018 11:18:35 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "ZkZBctjYSl2iDWkwZi4M3Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/167201/software-engineer-android-numbrs?a=U4AzlVX7Aqc",
    "title": "Software Engineer, Android at Numbrs (Zürich, Schweiz)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Mobile Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Finance</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Responsibilities include but are not limited to developing, releasing, monitoring and maintaining native Android applications. Applicants are also expected to participate in after-hours work.</p><p><strong><strong>All candidates will have</strong></strong></p><ul><li>a Bachelor's or higher degree in technical field of study</li><li>a minimum of two years' experience developing, monitoring and troubleshooting native Android applications with significant interaction with backend systems</li><li>expert level knowledge and hands-on experience with Java and the Android SDK</li><li>experience collaborating with UI/UX designers</li><li>excellent troubleshooting and creative problem-solving abilities</li><li>excellent written and oral communication and interpersonal skills</li></ul><p><strong><strong>Ideally, candidates will also have<br></strong></strong></p><ul><li>experience with RxJava or other asynchronous and event-based paradigms</li><li>experience with Kotlin</li><li>experience with at least one backend language such as Go, C/C++, Java and Scala</li></ul><p><strong><strong>Location: Remote or Zurich, Switzerland</strong></strong></p>                    </div>                            <h2>                About Numbrs            </h2>            <div><p>Numbrs’ focus is on developing products to manage banking transactions and assets. The platform provides banking services for the consumer, as well as the development and implementation of banking software towards financial institutions. We are currently looking for a Senior Software Engineer, Web, at the earliest possible start date, to strengthen our position in the industry.</p><p><strong>What we offer</strong></p><ul><li>Technology - Only the most cutting-edge technologies are used and we are constantly innovating. Our technical architecture is based on the use of Microservices, a block chain technology, and a proprietary machine learning technology.</li><li>Self-development - We offer to our employees a clear career chances by offering an experts and manager career path that ensures equal development opportunities.</li><li>Work / life balance - Work/life balance is important to us, which is why we offer flexible work schedules.</li><li>Salary - We offer highly competitive salaries. Our salary formula adjusts to your experience and cost of living.</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 free breakfast, lunch and snacks                            </div>                            <div>                                 coffee and drinks                            </div>                            <div>                                 pool and kicker                            </div>                            <div>                                 modern workplace                            </div>                            <div>                                 paid vacation                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 5, 2018 10:25:19 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/java",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "c",
      "java",
      "mobile"
    ]
  },
  {
    "id": "hMMQ3dlwTbSTlMQ_gNb49g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/166141/gui-focused-senior-developer-for-gene-cloning-gsl-biotech?a=TIy3RDmYEJq",
    "title": "GUI-Focused Senior Developer for Gene Cloning Software at GSL Biotech ()",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Biotechnology, Computer Software</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Work remotely to enhance SnapGene, cross-platform desktop molecular biology software that is making science move faster. You will have the opportunity to work on all aspects of the product from developing new functionality to adding features to supporting customers’ specific needs. By joining our small and motivated team, you will play a key role in designing and developing innovative&nbsp;user interfaces for the molecular biology community. Our approach combines advanced principles of human-computer interaction with sophisticated algorithms to produce a rich user experience. By using Qt and C++ we provide our customers with a responsive interface even when working with large datasets. We use clean organized scripts to automate common tasks such as setting up a development environment, building all required libraries, and generating nightly builds. If you have a passion for creating best-in-class software that is a joy to use, and a desire to help accelerate scientific discovery and medical product development, this job is for you.</p><p><strong>Skills &amp; Requirements</strong></p><p>Required:</p><ul><li>Bachelors or Masters in Computer Science, or equivalent experience</li><li>2+ years experience developing object-oriented software (C++ preferred)</li><li>Experience working with a GUI toolkit (Qt preferred)</li><li>Ability to interact remotely with a cross-functional team to develop solutions to challenging problems</li><li>Commitment to creating reliable and maintainable code</li></ul><p>Preferred:</p><ul><li>Experience developing cloud-based services</li><li>Experience developing mobile apps</li><li>Familiarity with version control software (preferably Git or SVN)</li><li>Scripting experience (preferably Bash, Python, and PHP)</li><li>Knowledge of molecular biology</li></ul><p><em>Please note: &nbsp;W</em><em>e can only hire developers who are legally allowed to work in the US.</em></p>                    </div>                            <h2>                About GSL Biotech            </h2>            <div><p>GSL Biotech is a self-funded and profitable company that develops and markets molecular biology software called SnapGene. This product was born of frustration, conceived by a cell biologist who realized that a huge amount of effort was being wasted because existing software was less efficient than pen and paper. SnapGene was released in 2012 and has experienced quick adoption in the scientific community, with thousands of active user groups in virtually every major&nbsp;research institution and in numerous pharma/biotech companies worldwide.</p><p>From the beginning, we have rigorously adhered to principles of human-computer interaction, with the goal of creating beautiful and responsive software. Our multi-talented and collegial team consists of scientists, developers, marketers, and business professionals, all of whom participate in business and product decisions.</p><p>GSL Biotech combines the excitement of working at a young and nimble company with the benefits of stability and steady growth. We value innovation and pragmatism, and encourage healthy debate on all key decisions. All team members work remotely.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive pay                            </div>                            <div>                                 Up to 20% company contribution to SEP after 1 year                            </div>                            <div>                                 Up to 10% bonus potential in year 1                            </div>                            <div>                                 15 days vacation/person emergency time off per year                            </div>                            <div>                                 Use the best tools                            </div>                            <div>                                 Work from home                            </div>                            <div>                                 Be part of a small, fast-moving team, and help science move faster                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 5, 2018 10:25:19 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "Uzcyaji_QOaulIxNRCFqNA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/143354/full-stack-engineer-ruby-java-c-plus-plus-for-all-action-verb?a=M4K0DLs0a9a",
    "title": "Full-Stack Engineer (Ruby, Java, C++) For All-Remote Holacracy-Powered Company at Action Verb ()",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise Software, Security Software, Web Hosting</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Hi! We’re Action Verb.</p><p>We build two Infrastructure-as-a-Service Platforms that Engineering and Marketing professionals use to power their products and services.</p><p>Our products include <a href='https://brickftp.com/' rel='nofollow'>BrickFTP</a>, a hosted file sharing service for business, and <a href='https://vaeplatform.com/' rel='nofollow'>Vae Platform</a>, a unique web hosting platform with an integrated CMS system.</p><p>Our company consists of 8 full time USA-based Engineers, as well as sales and support outposts in France, Germany, and Latin America. We’re looking to grow our family by one or two faces.</p><p>Our infrastructure platforms are used by over 2,000 enterprises and SMBs, including Mozilla, Canonical, UPS, DirecTV, GoPro, Marriott, and more.</p><p>We’ve been able to achieve the rare combination of high double-digit annual growth and industry leading profitability.</p><p>We do it by aggressively recruiting the absolute best and brightest engineers and structuring our company in a way that makes them want to work here forever.</p><p>It’s easy to say, but exceptionally hard to execute. Here’s how we do it.</p><p><strong>We are one of the early adopters of <a href='http://www.holacracy.org/' rel='nofollow'>Holacracy</a></strong>, a new style of running an organization in a self-organizing manner that draws inspiration from agile software development and lean manufacturing processes.</p><p>Rather than hiring people for exactly one job description, we instead look to find well rounded team members with skills in software engineering, design, marketing, sales, and our other needs who are interested in filling multiple roles within the organization.</p><p><strong>As a self-organizing team, our people have multiple roles and our role descriptions are regularly updated via small iterations.</strong> As their interests change and our needs change, the roles people fill change dynamically over time.</p><p><em>&quot;Most startups believe in iteration of their products. Now they need to apply the same thinking to their organizations.&quot;<br>– Adam Pisoni, Yammer co-founder &amp; CTO</em></p><p><a href='https://actionverb.com/holacracy' rel='nofollow'>Learn more about our Holacracy practice.</a></p><p>Holacracy is not unstructured: you’ll have a clear understanding of your current roles and responsibilities, as well as a set of rules and processes for changing those roles and responsibilities in real time.</p><p>Even though Holacracy is a lot to learn, we have a great onboarding process and the rest of our team will guide you through your first few months. You’ll also have the opportunity to attend a weeklong official Holacracy training event at our expense.</p><p>We also practice Open Book Management, meaning that we share the exact details of our Balance Sheet and P&amp;L Statement with our entire team in real-time, ensuring that <strong>our staff has the data they need to treat the business as if it were their own.</strong></p><p><a href='https://actionverb.com/open-book-management' rel='nofollow'>Learn more about Open Book Management.</a></p><p><strong>Our team members work from home and choose their own hours</strong>, allowing them to make time for family, recreation, vacations, or anything that is important to them.</p><p>Every team member gets 10 company-wide holidays per year as well as 20 paid time off days intended to be used for vacations. Go have fun. Don’t work all the time.</p><p><strong>Our team members also work hard, are constantly learning, and accomplish a ton for the company in the time that they are working.</strong></p><p>Our team spends at least 12 days together face-to-face per year at four quarterly meetings that are hosted all over the country. We try to do these meetings in cities that are fun to visit. In the last few years, we’ve been to Austin, Orlando, Minneapolis, San Diego, Las Vegas, New York City, and Detroit.</p><p>As you might expect from a company that is so open, we also post our salary information right here in the job post. <strong>We will pay you $100,000 in your first year, plus a great benefits package, and a $2,500 signing bonus to purchase a new computer.</strong></p><p>After your first year with Action Verb, we will update your salary based on the value that you have been able to demonstrate for the company. We continue to update salary levels every year. It is possible to reach a pay level of double the starting salary if you come in and absolutely crush it.</p><p>We fully pay for your health insurance (exact plan details depend on your state of residence), and we’ll pick up the tab for 50% of your spouse or family if they wish to also join the healthcare plan. We want your family to be healthy.</p><p>We recognize that other companies may offer higher initial salary offers or signing bonuses, but at Action Verb, <strong>we know that for our ideal candidate, the exact level of pay is just one criteria by which they choose where to work.</strong> Our goal is to offer the greatest work environment possible and pay people well enough to make it possible for them to join the team. Come learn our way of working, take on as many roles as you can, and establish yourself as a valuable asset to us. Then after your first year, we’ll re-evaluate your salary and make sure it’s more than fair, given the value you’ve been able to generate for the company.</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Fully Remote Company! Work From Home, or Anywhere.                            </div>                            <div>                                 20 Vacation Days Per Year                            </div>                            <div>                                 $2,500 Signing Bonus To Purchase A New Computer                            </div>                            <div>                                 100% Employee Health Coverage, including Dental and Vision                            </div>                            <div>                                 50% Spouse and Family Health Coverage As Well                            </div>                            <div>                                 Salary Reviews Every Year With Raises                            </div>                            <div>                                 Flexible Scheduling: Choose Your Own Hours (Within Reason)                            </div>                            <div>                                 Paid Travel: In-Person Meetings Held In a Different City Every Quarter                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "eLUIsMKASW-WDsswLxf6XA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157780/senior-software-engineer-cryptofinance-blockstream?a=QUHpmGLiwyA",
    "title": "Senior Software Engineer, Cryptofinance applications at Blockstream (Mountain View, CA)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Bitcoin, Financial Technology, Security Software</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Pioneering advancements in cryptography and blockchain technology, Blockstream is the first company extending the capabilities of Bitcoin at the protocol level to support a broad range of new privacy features, asset types, and financial markets. Blockstream is building an open platform for blockchain applications and a family of hardened cryptofinance appliances. Blockstream supports values of decentralization, end-to-end security, user control, and open, permissionless innovation.</p><p>We are looking for an experienced software engineer to help us build the premier platform for crypto-finance applications. Your initial responsibilities will include engineering a secure production service that must operate at low-latency and with high-availability.</p><p>You will enjoy a fast-paced creative atmosphere of a well-funded FinTech Series A startup, excellent benefits, and flexible working schedule as well as an option for partial telecommute.</p><p><strong>Qualifications:</strong></p><ul><li>5+ years of experience in software engineering on increasingly sophisticated systems</li><li><strong>Experience building robust production backend services with virtually no down time.</strong></li><li>Design of scalable, back-end architectures with high availability</li><li>Strong expertise in one or more of: C/C++, Rust, Go.</li><li>Linux \\ systems experience</li><li>Application-level caching (e.g. Memcached, Redis, ActiveRecord).</li><li>Design, implementation, and use of web API’s, including both REST and websocket APIs.</li><li>Emphasis on code quality; willingness to write full-coverage test suites and participate in regular code reviews.</li><li>Motivated, life-time learner.</li><li>Excellent communication skills and ability to collaborate with a geographically distributed team.</li></ul><p><strong>Pluses</strong>:</p><ul><li>Experience in FinTech is a big plus.</li><li>Prior Bitcoin, blockchain, or cryptography experience is a big plus.</li></ul><p><strong>To apply</strong>:</p><ul><li>Please send your resume and statement of interest to <a href='mailto:lilia@blockstream.io' rel='nofollow'>lilia@blockstream.io</a></li></ul>                    </div>                            <h2>                About Blockstream            </h2>            <div><p>Pioneering advancements in cryptocurrencies, open assets and smart contracts, Blockstream is the first company extending capabilities at the protocol level to support the application of Bitcoin and blockchain technology to a broad range of asset types. Sidechains, the extension mechanism of Bitcoin, allow expansion of Bitcoin’s feature set in an open and interoperable way. A champion of Bitcoin’s ethos, Blockstream supports decentralization, end-to-end security, user control and open, permissionless innovation.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive Salary, Stock Options, Bitcoin Grant, and 401(k)                            </div>                            <div>                                 Medical, Dental, and Vision Insurance                            </div>                            <div>                                 Daily Team Lunches                            </div>                            <div>                                 Flexible Hours                            </div>                            <div>                                 Equipment you need to be successful                            </div>                            <div>                                 Lyft / Uber Corporate Accounts                            </div>                            <div>                                 20 Days PTO                            </div>                            <div>                                 Monthly Wellness Stipend                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "ZLlYXE4wRqagT1zA5xtF-g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/143266/software-developer-c-c-plus-plus-zf-friedrichshafen-ag?a=M2UyZA578RO",
    "title": "Software developer C/C++ at ZF Friedrichshafen AG (Pilsen, Tschechien)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Automotive, Autonomous Driving, Safety Technology</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>10k+ people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>WHY JOIN ZF?</strong></p><p>ZF operates a global network of technical centers worldwide where we employ engineers, researchers, designers and technicians. Our global network allows us to develop active and passive automotive safety technologies, while continuously improving existing products and systems.</p><p>Employees use sophisticated testing and computer simulation equipment. We have advanced engineering and research and development programs for next-generation products in all of our segments.</p><p>ZF is disciplined and innovative in our approach to research and development, employing various tools to improve efficiency and reduce cost, such as Six Sigma, &quot;follow-the-sun&quot; (a 24-hour a day engineering program that utilizes our global network) and other e-Engineering programs.</p><p>The safety technologies market is hot, and ZF is at the forefront. Come join the global leader in automotive safety and apply today!</p><p>The Software Team is responsible for the development and release of software for a number of high profile and challenging global applications with European, North American and Chinese vehicle manufactures. A senior software engineer is required to support this development striving for customer delight with timely deliveries, novel system functions and high quality software.</p><p><strong>Your task:</strong></p><ul><li>SW requirements analysis</li><li>SW design in UML language</li><li>Programming of systems of automotive components in C and C++</li><li>Programming of SW for testing support for those systems</li><li>Integration to customer products and laboratory testing</li><li>Problems monitoring, analysis and solving</li></ul><p><strong>Skills &amp; Requirements</strong></p><p><strong>Your profile:</strong></p><ul><li>Degree in a field of electronic, electrotechnic, applied science filed etc.</li><li>Knowledge of programming a single chip uC (SoC), electric drives and performing electronics</li><li>Good knowledge of English or German language</li><li>Knowledge of real-time SW development for automotive components is an advantage</li><li>Knowledge of C and C++ is an advantage</li></ul><p><strong>Are you interested?</strong></p><p>Please apply online with full application documents (Resume, motivation for the position, references and certificates) indicating your salary expectations and your earlist staring date.&nbsp;Questions in advance will be answered by Mr. Ondrej Pohanka.</p>                    </div>                            <h2>                About ZF Friedrichshafen AG            </h2>            <div><p><strong>We offer:</strong></p><ul><li>Trainings and workshops</li><li>A very interesting job – working on automotive future</li><li>Language lessons (English, German)</li><li>Flexible working hours</li><li>25 days of holidays</li><li>Home office</li><li>Annual bonuses</li><li>Annual salary raise</li><li>Benefits: commuting allowances, pension/life insurance allowances</li><li>Lunches in our amazing canteen</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible working time models                            </div>                            <div>                                 Numerous opportunities for professional development, training, expert                            </div>                            <div>                                 30 vacational days                            </div>                            <div>                                 Employees profit from various discounts                            </div>                            <div>                                 Christmas and Holiday Pay                            </div>                            <div>                                 Catering facilities on-site                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c",
      "php"
    ]
  },
  {
    "id": "0MBrz4pdR-Oa9dCxNTDl5Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/166131/c-plus-plus-developer-ozoneai?a=TIlaAnZeWU8",
    "title": "C++ Developer at ozone.ai (New York, NY)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Desktop Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cybersecurity</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span>We are a leader in document security and we’re growing fast! We are looking to fill several C++ developer positions ranging in experience with competitive compensation and good benefits.</span></p><p><strong>About You:</strong></p><p>You are a self-driven developer that enjoys a challenge and can work independently without much oversight.</p><p><strong>Requirements:</strong></p><ul><li><span>5+ years experience with C++</span></li><li><span>5+ years experience with Windows Development</span></li><li><span>2+ years experience with C#</span></li><li><span>2+ years experience with MSSQL</span></li><li><span>Firm understanding of REST web services</span></li></ul><p><strong>Responsibilities:</strong></p><p><span>You’ll be responsible for maintaining and growing our windows driver work as well as developing cutting-edge cryptographic solutions in c++ for keeping some of the world’s largest companies safe from malicious actors.</span></p><p><span>You must be self-driven and be able to handle ambiguity. We are a fast growing company and the lines may be blurred on projects, so having a flexible mind will be essential to succeeding in our fast-paced environment.</span></p><p></p><p><span>Bonus points for any candidates that have a firm understanding of encryption and/or machine learning.</span></p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Remote Work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "6z_gX8YfRsq-CQsqsBNkww",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/164667/full-stack-web-mobile-software-developer-logapps-llc?a=TdTQg3W73Ne",
    "title": "Full-Stack Web/Mobile Software Developer at Logapps LLC (Falls Church, VA)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Mobile Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>IT Consulting, Machine Learning, Market Research</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Degree:</strong> Bachelors</p><p><strong>Location:</strong> Remote or Falls Church, Virginia</p><p><strong>Classification:</strong> Contract Position&nbsp;</p><p><strong>Background</strong>&nbsp;</p><p>Logapps LLC is a small consulting firm located in Falls Church, Virginia, that provides IT industry research, systems analysis and strategic advisory services to government and commercial customers. Since 2007, Logapps has brought passion and creativity to research and evidence-based analysis for a variety of customers: IRS, US Courts, NOAA, US Navy, DHS, Parliamentary Budget Office of Canada, STG, Inc., National Science Foundation (NSF), CACI Inc.&nbsp;</p><p>Logapps began developing a proof of concept for a function point automation tool in 2016 and deployed Version 0 in August 2017. The tool utilizes natural language processing (NLP) to inspect a set of requirements for weaknesses and to provide various analyses of the set, including:</p><ul><li>Requirements Analysis &amp; Verification</li><li>Software Sizing (automated function point count)</li><li>Cost Estimation</li><li>Schedule Estimation</li><li>Requirements “Budgeting”</li></ul><p>Logapps is looking to enhance the tool’s user satisfaction by improving the usability, accessibility and effectiveness of product.&nbsp;</p><p><strong>The Need</strong>&nbsp;</p><p>Logapps seeks software developers with expertise in full-stack development, scripting programming languages, relational database development, user experience, and human factor engineering to upgrade the entire application. We need your help to streamline the product, iterate on features, and improve the customer experience. It is a small team with a big goal. If you are passionate about software development – read on!&nbsp;</p><p><strong>Responsibilities</strong>&nbsp;</p><p>Under the general supervision of the Product Manager, Software Developer shall perform a variety of tasks such as:</p><ul><li>Full-stack web/mobile development with a variety of languages including but not limited to Ruby, Python, Javascript, HTML, etc.</li><li>Build on existing codebase to implement new features, fix bugs, and evolve the product</li><li>Implement web or mobile interfaces using XHTML, CSS, and JavaScript</li><li>Work closely with our PM and design teams to define feature specifications</li><li>Collaborate with other developers via code reviews and occasional pair programming</li></ul><p><strong>Qualifications Required:</strong></p><ul><li>Bachelors in Computer Science, Software Engineering or related quantitative field</li><li>5+ years’ experience working on production-quality software in a team environment</li><li>3+ years’ experience working on production-quality Python apps</li><li>Experience with scripting languages such as Perl, Python, PHP, Ruby and shell scripts</li><li>Experience with front-end web development technologies</li><li>Experience with relational databases and SQL</li><li>Experience developing and debugging in C/C++ and Java a plus</li><li>Great team player skills as well as a strong ability to work independently. Working closely with clients and end users is crucial.</li></ul><p><strong>Desired, But Not Required:</strong></p><ul><li>Masters in Computer Science or Software Engineering</li><li>Experience in one or more of the following areas a plus: machine learning, recommendation systems, pattern recognition, large-scale data mining, artificial intelligence, filesystems, server architectures and distributed systems</li><li>Fluent understanding of Agile/Scrum roles, artifacts and ceremonies</li><li>Stay current with latest development best practices -- able to share industry insights with the team and provide input on process and/or architectural decisions</li></ul><p><strong>Additional Assessment</strong>&nbsp;</p><p>Applicants who meet the specialized experience requirements will be assessed on each of the following competencies:</p><ul><li>Attention to Detail - Is thorough when performing work and conscientious about attending to detail.</li><li>Customer Service - Works with clients and customers to assess their needs, provide information or assistance, resolve their problems or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.</li><li>Oral Communication - Expresses information to individuals or groups effectively; makes clear and convincing oral presentations; listens to others, attends to nonverbal cues and responds appropriately.</li><li>Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendation.</li></ul>                    </div>                            <h2>                About Logapps LLC            </h2>            <div><p>Innovative</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Innovative                            </div>                            <div>                                 Remote                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "zZfU-knRRumERiZBUU_WUQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165003/c-plus-plus-experts-for-cryptocurrency-projects-all-core-data?a=TkT00oNGpAA",
    "title": "C++ experts for cryptocurrency projects -- all time zones at Core Data ()",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Desktop Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data, Developer APIs, Sports betting odds algorithms</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Core Data has an opening for four (4) experienced senior-level C++ programmers to add to our EU-based remote work team. Developers in this team will focus on writing logic for various backend components related to the cryptocurrency realm. Core Data uses a 24/7 development model where projects are actively worked on in shifts in a continuous cycle, and thus positions are available for qualified applicants in all time zones. Candidates selected for this position will work under a full-time independent contractor relationship with our EU-based division.&nbsp; While efforts are made to ensure the most comfortable work schedule for each candidate possible, many candidates will be asked to work&nbsp;a Tuesday through Saturday or a Wednesday through Sunday schedule (8 hours per day, 5 days per week).&nbsp;&nbsp;&nbsp;Examples of product lines which applicants may work on include: a from-scratch cryptocurrency exchange, a cryptocurrency mining pool, and creation of an entirely new cryptocurrency which provides new features not currently satisfied by existing tokens.</p><p>For this position, emphasis is placed on the applicant's ability to produce solutions with minimal outside help. As this is a senior-level position, all applicants are expected to be able to write the required applications from start to finish, including design of any database queries or tables. Design specifications will be provided for each project prior to commencement. While actual programming ability is one of the key requirements of this position, applicants for this senior-level posting are expected to show initiative and take a practical approach towards solving real-world problems.</p><p><strong>Examples of technologies we commonly use:</strong></p><ul><li>C++14</li><li>MongoDB</li><li>ZeroMQ and RabbitMQ</li><li>NodeJS</li><li>Boost</li><li>WebSockets</li></ul><p>Applicants with work experience in one or more of the following areas will be given priority:</p><ul><li>Any type of programming work on cryptocurrencies or blockchain</li><li>Network programming (TCP and/or UDP)</li><li>Low latency messaging systems</li><li>Messaging queues</li><li>Creation of an interpreted or scripting language</li><li>Experience with MongoDB (time-series data experience a plus)</li></ul><p><strong>As a pre-screening question, please explain in your cover letter / email</strong>&nbsp;what the 'virtual' keyword does in C++ and what the difference would be if a class function/method is declared with and without it. Messages that omit this may be removed from consideration.&nbsp; This is done so that we can focus on applicants who have taken the time to provide a well-thought response to our icebreaker question.</p>                    </div>                            <h2>                About Core Data            </h2>            <div><p>Core Data is a data and statistics provider with an emphasis on low-latency, real-time data products.&nbsp; Core Data's product lineup is the backbone of a variety of innovative solutions in a variety of business realms.&nbsp; The company is currently expanding into various cryptocurrency-related interests, such as mining, trading, and exchange.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Monthly paid time off                            </div>                            <div>                                 Competitive Compensation                            </div>                            <div>                                 Flexible hours / work schedules                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "c"
    ]
  },
  {
    "id": "L8jgrQtaSVSN7rccffcyBA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165550/go-c-software-engineer-at-intersection-of-chorus-one?a=Twgawtf6Mla",
    "title": "Go/C Software Engineer at intersection of information security & cryptocurrency at Chorus One (Rockville, MD)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Cryptocurrency, Digital Asset Management, Security Software</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>This role is a great match for applicants looking to work at the intersection of cryptography, systems programming, hardware security modules and cryptocurrencies.</p><p>Chorus builds validators and network nodes for modern Proof-of-Stake cryptocurrencies. Our infrastructure shall receive, check accounting in and process financial transactions for cryptocurrency users.</p><p>The successful candidate will build codebases powering digital signature and other network infrastructure. Hardware Security Modules will be used to harden security against key theft, physical attacks and network attacks.</p><p>Prior experience with blockchain technology or cryptocurrencies is not required for this role.</p><p><strong>Responsibilities</strong></p><p>1. Implement blockchain clients and hardware security module (HSM) code in order to enable automated secure signing of blockchain transactions.</p><p>2. Implement security policies to ensure that blockchain clients and key signing systems are hardened against internal and external attack.</p>                    </div>                            <h2>                About Chorus One            </h2>            <div><p>Chorus builds validators and network nodes for modern Proof-of-Stake cryptocurrencies. Our infrastructure shall receive, check accounting in and process financial transactions for cryptocurrency users. Our&nbsp;product(s) enable holders of cryptocurrencies to make passive returns on their coin holdings.</p><p>We are a young startup operating at the intersection of finance, cryptography, information security and systems programming. This rich intersection provides great opportunity for engineers looking to explore new vistas.&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Exciting work at intersection of finance, cryptography and security                            </div>                            <div>                                 Open to remote work and work from home                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "lTZH_XPDRQWJ4SPnSe5fAQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/163597/senior-software-engineer-bitfusion?a=SREruvYeqha",
    "title": "Senior Software Engineer at Bitfusion (Austin, TX)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>AI Research, Cloud Computing, Computer Software</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Bitfusion is an Austin, TX and a Bay Area company&nbsp;building the operating system for managing AI infrastructure across CPUs, GPUs and FPGAs in next generation&nbsp;datacenters and clouds.&nbsp;</p><p>We are looking for&nbsp;strong&nbsp;cloud infrastructure engineer (developer type) with self-directed work habits and strong willingness to learn. You will be part of a collaborative team with a culture of open communication, innovation and make-it-happen mindset. You will work on&nbsp;bleeding edge technologies and have the opportunity to lean new technologies. Expect&nbsp;excellent application development&nbsp;skills and kubernetes experience is a must.&nbsp;Experience with building highly available, scalable and generalized infrastructure and solid proficiency with atleast one modern general-purpose programming languages like C++, Go, Python, Scala, etc is essential.</p><p>You should have a BS, MS, or PhD in Computer Science, Computer Engineering or equivalent. Top-notch communication skills are essential. Strong problem solving skills and out of the box thinking are a must. Must work well in a fast paced team of talented, motivated, and coworkers.&nbsp;Physically located&nbsp;in Austin, TX is highly preferred, though remote work may be possible depending on qualifications.</p><p>Must Haves <br>*&nbsp;5+ years of relevant industry work experience&nbsp;<br>*&nbsp;BS, MS or PhD in Computer Science or equivalent program&nbsp;<br>*&nbsp;Hands-on development with highly distributed and micro-service environments in clouds like AWS&nbsp;<br>*&nbsp;Experience with Docker container related technologies like Kubernetes, Mesos, etc&nbsp;<br>*&nbsp;Experience with large-scale distributed systems and client-server architectures&nbsp;<br>* Demonstrated proficiency with at least two modern general-purpose programming languages like C++, Go, Python, Scala, etc.&nbsp;<br>- Demonstrated ability to adapt to new technologies and learn quickly<br>* Should be able to pick up any new programming language and demonstrated ability to adapt to new technologies quickly</p><p>Nice to Haves <br>*&nbsp;Experience building APIs and client libraries&nbsp;<br>* Experience with industry or open-source projects in large-data, parallel and distributed systems&nbsp;<br>*&nbsp;Experience building technologies with caching, RPC, queuing, parallelism, multi-threading, concurrency&nbsp;<br>*&nbsp;Experience with full stack web development</p><p>As part of your job application, send us some&nbsp;bullet points about the most recent projects you worked on&nbsp;with kubernetes, whats your favorite programming language, what kind of things have you hacked in the past, why would like to be part of this team, etc.&nbsp;</p><p>We are an equal opportunity employer.&nbsp;&nbsp;</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Full healthcare coverage                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "YylLzBtrROqn3eJ6JUnONg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/142508/technical-product-lead-clevertech?a=LN9nHM3PLa0",
    "title": "Technical Product Lead at Clevertech ()",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong><span>DESCRIPTION:</span></strong></p><p><span>Clevertech is looking for a Tech Lead to join our worldwide team.Clevertech looks for craftsmen developers who take ownership of their code. You can deliver quickly while being clever to avoid missteps. </span></p><p><span>You have an effective positive attitude that shines as you show your care about the client’s concerns as well as a colleague’s concerns. You are always learning and are a transparent communicator even when it is challenging.</span></p><p><span>Our technical product leaders spend much of their time in the code. Develop world class software products for the most exclusive companies in the world.</span></p><ul><li><span>75% of your time leading the technical strategy in the code;</span></li><li><span>25% of your time in meetings organizing and unlocking the other devs</span></li></ul><p><span><br></span><span>You set the mood on the team. Not only internally but also with our clients. You get excited about getting the best out of team member and have demonstrated successful product launches.</span></p><p><span>REQUIREMENTS:</span></p><ul><li><span>7+ years of experience in software development teams. New tools are great, but fundamentals of data structures, design patterns, and programming practices are what deliver projects.</span></li><li><span>Has led a product meeting that has technical implications with Fortune 500 executives sitting around a conference room table</span></li><li><span>Deep knowledge of Javascript and language agnostic as we utilize other technologies such as Python, Clojure, Go, C# and on occasion Java or C++ .</span></li><li><span>Well qualified applicants will have deep experiences in the latest libraries and programming techniques. You have accomplishments that showcase your capabilities.</span></li><li><span>Excellent self-starter who collaborates effectively with all stakeholders, and has the ability to work in a fast-paced team.</span></li></ul><p><br><br></p><p><strong><span>BENEFITS</span></strong></p><p><strong><span>Own Your Time</span></strong></p><p><span>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting. </span></p><p><strong><span>Recharge Time</span></strong></p><p><span>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</span></p><p><strong><span>Care For Yourself</span></strong></p><p><span>You’ll receive a health/wellness stipend that goes towards covering medical insurance, dental insurance, or joining a gym!</span></p><p><strong><span>Focused Work</span></strong></p><p><span>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams. </span></p><p><strong><span>Learn at your edges</span></strong></p><p><span>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</span></p><p><span>And of course, if you speak at a tech conference, we cover all expenses.</span></p><p><strong><span>Clevertech Swag</span></strong></p><p><span>And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</span></p><p><span>Want to learn more about Clevertech and the team? Check out </span><a href='http://why.clevertech.biz/' rel='nofollow'><span>why.clevertech.biz</span></a><span>.</span></p><p><br><br></p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Full-Time Telecommuting                            </div>                            <div>                                 Flexible Schedules                            </div>                            <div>                                 Paid Time Off                            </div>                            <div>                                 Ability to Work with Cutting-Edge Technology                            </div>                            <div>                                 Opportunity to Work with and Learn from Top Developers                            </div>                            <div>                                 Contribute to Open Source                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "APnLDGPHRyyRDFOD5pnouA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Senior+Technical+Architect&c=Veeva&l=Remote&jk=8299c999181a235b&rtk=1c5g89o025i96838&from=rss",
    "title": "Senior Technical Architect (Vault R&D and Vault Platform) - Veeva - Remote",
    "content": "<div><b>Senior Technical Architect (Vault R&amp;D and Vault Platform)</b><br><span>Veeva</span>     -<span>Remote</span>    </div><span>Our Company<br><br>At 1,800 employees and growing and consistently strong financials (NYSE: VEEV), Veeva was named among the top fastest growing public technology companies on Forbes’ annual Fast Tech 25 list. We build innovative cloud solutions for some of the world’s largest pharmas and biotechs, and we need great people like you to make it happen.<br><br>Our Culture &amp; People<br><br>Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It’s genuine, straight-forward, and no fuss.<br><br>Job Summary<br><br>As a Senior Technical Architect you will be a leading member of the Veeva Systems Professional Services group working on providing consulting and technical architecture design on project teams implementing Veeva Vault R&amp;D applications and Vault Platform solutions to companies in the life sciences industry.<br>As a key member of our Professional Services team, the Senior Technical Architect will lead customer implementations by providing expertise with solution architecture design, technical integration design, and Vault Platform best practices. The Senior Technical Architect is a customer advocate working closely with other Veeva teams (Product, Sales, Strategy) to ensure customer success today and in the future. Responsibilities<br><br>Provide subject matter expertise on the Veeva Systems implementation, Vault R&amp;D product suite, Vault Platform, technical design, and Software as a Service (SaaS) implementation best practices<br>Design and implement cloud-based integrations<br>Design and provide subject matter expertise for development of custom applications<br>Manage integration and development projects and resources<br>Contribute to our professional services knowledge base<br>Develop internal and external tools to help our customers and our consultants<br>Partner with other parts of the organization to deliver technical presentations to current and prospective customers to evangelize the value of Veeva’s solution Requirements<br><br>Minimum 7 years customer facing consulting experience<br>Minimum 5 years experience designing and developing integrations<br>Minimum 5 years development experience with one of the following languages – Java, .NET, Python, or C/C++<br>Experience building solutions and interfaces in cloud, SaaS applications<br>Proven track record meeting with senior management and executives as the subject matter expert<br>Experience leading and mentoring team members<br>Excellent presentation skills<br>Experience with SDLC process<br>Ability to articulate integration design patterns<br>Experience in pharma or life sciences industry<br>Travel approximately 50% - 75% Nice to Have<br><br>Experience with document management platforms<br>Experience with R&amp;D business processes and software<br>Experience with GxP regulations and software validation process<br>Managed a group of 10 or more people in the last 6 months<br>Project Management experience<br>Experience with source code control systems<br>Product Manager experience<br>Single Sign On experience<br><br>Veeva is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity or expression, religion, national origin or ancestry, age, disability, marital status, pregnancy, protected veteran status, protected genetic information, political affiliation, or any other characteristics protected by local laws, regulations, or ordinances.</span>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:01:04 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "wzVi3pCbQ1-jrHy-N6jQKg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Technical+Architect&c=Veeva&l=Remote&jk=e3923aa13b1e0fc7&rtk=1c5g89o025i96838&from=rss",
    "title": "Technical Architect (Vault R&D and Vault Platform) - Veeva - Remote",
    "content": "<div><b>Technical Architect (Vault R&amp;D and Vault Platform)</b><br><span>Veeva</span>     -<span>Remote</span>    </div><span>Our Company<br><br>At 1,800 employees and growing and consistently strong financials (NYSE: VEEV), Veeva was named among the top fastest growing public technology companies on Forbes’ annual Fast Tech 25 list. We build innovative cloud solutions for some of the world’s largest pharmas and biotechs, and we need great people like you to make it happen.<br><br>Our Culture &amp; People<br><br>Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It’s genuine, straight-forward, and no fuss.<br><br>Job Summary<br><br>Veeva Systems is seeking a Technical Architect to apply their business acumen or life sciences knowledge in revolutionary ways.<br>Do you thrive in a fast-paced, deadline-driven environment? Does the idea of tackling new challenges daily push you out of bed in the morning? A leading provider of business applications in the Cloud, Veeva Systems is looking for a strong analytical thinker and energetic “go-getter” to become part of a dynamic team of consulting services pros responsible for the successful implementation of our content management product – Veeva Vault. As part of this team, the Technical Architect will assist our life sciences customers by participating in business process due diligence, requirements definition, solution design and configuration, and system and training documentation. The Technical Architect will have the opportunity to collaborate with some of the best Senior Consultants and Solution Architects in the industry and learn best practices for business analysis, application/integration design and project management. Responsibilities<br><br>Participate in business process discovery and requirements workshops<br>Assist with solution design and configuration. Support mapping of legacy content and attributes to the Vault for migration.<br>Assist with development of Java-based solutions<br>Contribute to technical design decisions for integration or automation services<br>Provide subject matter expertise on the Veeva Vault product functionality and APIs<br>Travel is approximately 50% - 75% Requirements<br><br>2+ years relevant experience in technical development, integration, or consulting<br>Proven analytical and problem solving skills<br>Excellent verbal and written communication skills are essential as position is client facing<br>Solid Computer Science fundamentals (data structures, algorithms, object-oriented design, and software design)<br>Programming experience in one or more of the following languages: Java, C#, C++, or Objective-C<br>Demonstrated experience working with customer communities to solve business and technical issues<br>Ability to take business concepts and express them as potential solution designs<br>Ability to take technical concepts and express them as potential solution designs to non-technical audiences<br>Programming experience with REST-based APIs<br>Aptitude and interest in technology<br>0 cumulative GPA with stronger performance in your major<br>4 year degree required<br>Qualified candidates must be legally authorized to be employed in the United States. Veeva Systems does not anticipate providing sponsorship for employment visa status (e.g., H-1B or TN status) for this employment position. Nice to Have<br><br>Bachelor’s degree in Business/ Management Information Systems, Computer Science, Computer Engineering, Mechanical Engineering, Life Sciences field or other similar degree or commensurate work experience is preferred<br>An internship or experience with a pharma company is a plus<br>Community involvement or organizational leadership experience is a plus<br>Experience with document management systems<br><br>Veeva is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity or expression, religion, national origin or ancestry, age, disability, marital status, pregnancy, protected veteran status, protected genetic information, political affiliation, or any other characteristics protected by local laws, regulations, or ordinances.</span>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:00:58 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/nodejs",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "nodejs"
    ]
  },
  {
    "id": "OCBE85-CR2CXgnuUTPLORg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/clevertech-technical-product-lead",
    "title": "Clevertech: Technical Product Lead",
    "content": "<div>  <div>    <h2>Technical Product Lead</h2>      <h4>Posted Feb  2</h4>    <h3>      <span>Clevertech</span><br>      <span>Headquarters: New York</span><br>        <a href='https://clevertech.biz/careers' rel='nofollow'>https://clevertech.biz/careers</a>    </h3>  </div>    </div>  <div>    <div><span><h4><span>DESCRIPTION:</span></h4><h4><b></b></h4></span></div><div><span>Clevertech is looking for a Technical Product Lead to join our worldwide team.Clevertech looks for craftsmen developers who take ownership of their code. You can deliver quickly while being clever to avoid missteps. </span></div><div><br></div><div><span>You have an effective positive attitude that shines as you show your care about the client’s concerns as well as a colleague’s concerns. You are always learning and are a transparent communicator even when it is challenging.</span></div><div><br></div><div><span>Our technical product leaders spend much of their time in the code. Develop world class software products for the most exclusive companies in the world.</span></div><div><br></div><ul><li><span>75% of your time leading the technical strategy in the code;</span><br><br></li><li><span>25% of your time in meetings organizing and unlocking the other devs</span><br><br></li></ul><div><span><br></span></div><div><span>You set the mood on the team. Not only internally but also with our clients. You get excited about getting the best out of team member and have demonstrated successful product launches.</span></div><div><h4><span>REQUIREMENTS:</span></h4></div><ul><li><span>7+ years of experience in software development teams. New tools are great, but fundamentals of data structures, design patterns, and programming practices are what deliver projects.</span><br><br></li><li><span>Has led a product meeting that has technical implications with Fortune 500 executives sitting around a conference room table</span><br><br></li><li><span>Deep knowledge of Javascript and language agnostic as we utilize other technologies such as Python, Clojure, Go, C# and on occasion Java or C++ .</span><br><br></li><li><span>Well qualified applicants will have deep experiences in the latest libraries and programming techniques. You have accomplishments that showcase your capabilities.</span><br><br></li><li><span>Excellent self-starter who collaborates effectively with all stakeholders, and has the ability to work in a fast-paced team.</span><br></li></ul><div><br></div><div><h4><span>BENEFITS</span></h4><h5><span>Own Your Time</span></h5><h4><b></b></h4></div><div><span>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting. </span></div><div><br></div><div><h5><span>Recharge Time</span></h5><h4><b></b></h4></div><div><span>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</span></div><div><br></div><div><h5><span>Care For Yourself</span></h5><h4><b></b></h4></div><div><span>You’ll receive a health/wellness monthly stipend that goes towards covering medical insurance, dental insurance, or joining a gym!</span></div><div><br></div><div><h5><span>Focused Work</span></h5><h4><b></b></h4></div><div><span>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams. </span></div><div><br></div><div><h5><span>Learn at your edges</span></h5><h4><b></b></h4></div><div><span>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</span></div><div><br></div><div><span>And of course, if you speak at a tech conference, we cover all expenses.</span></div><div><br></div><div><h5><span>Clevertech Swag</span></h5><h4></h4></div><div><span>And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</span></div><div><br></div><div><span>Want to learn more about Clevertech and the team? Check out </span><a href='http://why.clevertech.biz/' rel='nofollow'><span>why.clevertech.biz</span></a><span>.</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://hire.clevertech.biz/job/587cf23957e2b97032a5528d' rel='nofollow'>https://hire.clevertech.biz/job/587cf23957e2b97032a5528d</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 8:25:27 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "wXWw4I2NQC-Lz0UtEodd5A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16292329",
    "title": "Auth0 (https://auth0.com/) | Seattle - Buenos Aires - Remote | Full-time | Engineering",
    "content": "<div>                  <span>Auth0 (<a href='https://auth0.com/' rel='nofollow'>https://auth0.com/</a>) | Seattle - Buenos Aires - Remote | Full-time | Engineering<p>Auth0 is a Series C/285 employee company with major growth plans for 2018.  Our vision is to provide the simplest and most secure identity platform for developers, to make the internet safer. Ultimately, we strive for an internet with fewer passwords. We're looking for people to join us on this journey.</p><p>Open jobs:</p><p>Engineer, Appliance Tooling and Infrastructure: <a href='https://jobs.lever.co/auth0/8758ef5f-9a65-469f-b927-21502b52f4e9?lever-origin=applied&amp;lever-source%5B%5D=Hacker%20News&amp;lever-source%5B%5D=HackerNews' rel='nofollow'>https://jobs.lever.co/auth0/8758ef5f-9a65-469f-b927-21502b52...</a></p><p>Engineer, Auth0 Extend: <a href='https://jobs.lever.co/auth0/275630d9-158f-427d-904e-d522e52ca6b2?lever-origin=applied&amp;lever-source%5B%5D=Hacker%20News&amp;lever-source%5B%5D=HackerNews' rel='nofollow'>https://jobs.lever.co/auth0/275630d9-158f-427d-904e-d522e52c...</a></p><p>Engineer, Core Runtime: <a href='https://jobs.lever.co/auth0/43085e35-7650-49a9-8ca4-755ae670a1fc?lever-origin=applied&amp;lever-source%5B%5D=HackerNews' rel='nofollow'>https://jobs.lever.co/auth0/43085e35-7650-49a9-8ca4-755ae670...</a></p><p>Engineer, Developer Experience (DX): <a href='https://jobs.lever.co/auth0/d82db161-b69b-4a59-bcb6-8aecf9bf6706?lever-origin=applied&amp;lever-source%5B%5D=HackerNews' rel='nofollow'>https://jobs.lever.co/auth0/d82db161-b69b-4a59-bcb6-8aecf9bf...</a></p><p>Engineer, Multifactor and Anomaly Detection: <a href='https://jobs.lever.co/auth0/5a2d98a7-9bf1-4797-ae9a-f21dae11fae7?lever-origin=applied&amp;lever-source%5B%5D=HackerNews' rel='nofollow'>https://jobs.lever.co/auth0/5a2d98a7-9bf1-4797-ae9a-f21dae11...</a></p><p>Lead Engineer, Multifactor and Anomaly Detection: <a href='https://jobs.lever.co/auth0/acfbd95d-c0de-4e61-b97a-faddd496adb7?lever-origin=applied&amp;lever-source%5B%5D=HackerNews' rel='nofollow'>https://jobs.lever.co/auth0/acfbd95d-c0de-4e61-b97a-faddd496...</a></p><p>Lead Engineer, Observability: <a href='https://jobs.lever.co/auth0/358c8176-c1bf-44fe-812e-d5b2dede5052?lever-origin=applied&amp;lever-source%5B%5D=HackerNews' rel='nofollow'>https://jobs.lever.co/auth0/358c8176-c1bf-44fe-812e-d5b2dede...</a></p><p>Our hiring process is documented here: <a href='https://auth0.com/blog/how-we-hire-engineers/' rel='nofollow'>https://auth0.com/blog/how-we-hire-engineers/</a></p><p>We are a remote-first company and every year we organize a company offsite. Below are some pictures from our 2017 offsite in Cancun. 2018 will be in Panama, we hope to see you there!:• <a href='https://twitter.com/woloski/status/892051882289528832' rel='nofollow'>https://twitter.com/woloski/status/892051882289528832</a>• <a href='https://twitter.com/woloski/status/891357637283131392' rel='nofollow'>https://twitter.com/woloski/status/891357637283131392</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 7:33:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "SUtXoPCMRQidvDKx4j21Zg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16292301",
    "title": "beam technologies |www.beam-mw.com| tel aviv, israel / REMOTE OK | Full-time | $100-150k + tokens | Team of 4 engineers in the tel aviv ...",
    "content": "<div>                  <span>beam technologies |www.beam-mw.com| tel aviv, israel / REMOTE OK | Full-time | $100-150k + tokens | Team of 4 engineers in the tel aviv rust or c++ developer Our mission is to create mimblewimble blockchain real by developing a wallet and other infrastructure improvements. What to expect:youll work to improve the grin code and develop new components to it <a href='https://github.com/mimblewimble' rel='nofollow'>https://github.com/mimblewimble</a> , the blockchain is written on rust , but a good c++ dev that can learn fast would be good enough .<p>- In your first 6 months: you’ll design, write and modify the mimblewimble protocol , developing a wallet and contributing to the infrastructure layer</p><p>- By the end of your first year: you’ll be part of the launch of a new cutting hedge , private and scalable blockchain</p><p>for more info please ping me at yoni9091@gmail.com or @yoni9091 at telegram<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 7:30:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "RpGZCg_rTQ-9A05WTC5Gnw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/572-technical-product-lead",
    "title": "Technical Product Lead",
    "content": "Technical Product Lead - Jobmote<div><div><h2>Technical Product Lead</h2><h5>Clevertech</h5></div></div><div><div><div><div><div><p><strong>DESCRIPTION:</strong></p><p>Clevertech is looking for a Tech Lead to join our worldwide team.Clevertech looks for craftsmen developers who take ownership of their code. You can deliver quickly while being clever to avoid missteps.</p><p>You have an effective positive attitude that shines as you show your care about the client’s concerns as well as a colleague’s concerns. You are always learning and are a transparent communicator even when it is challenging.</p><p>Our technical product leaders spend much of their time in the code. Develop world class software products for the most exclusive companies in the world.</p><ul><li>75% of your time leading the technical strategy in the code;</li><li>25% of your time in meetings organizing and unlocking the other devs</li></ul><p>You set the mood on the team. Not only internally but also with our clients. You get excited about getting the best out of team member and have demonstrated successful product launches.</p><p>REQUIREMENTS:</p><ul><li>7+ years of experience in software development teams. New tools are great, but fundamentals of data structures, design patterns, and programming practices are what deliver projects.</li><li>Has led a product meeting that has technical implications with Fortune 500 executives sitting around a conference room table</li><li>Deep knowledge of Javascript and language agnostic as we utilize other technologies such as Python, Clojure, Go, C# and on occasion Java or C++ .</li><li>Well qualified applicants will have deep experiences in the latest libraries and programming techniques. You have accomplishments that showcase your capabilities.</li><li>Excellent self-starter who collaborates effectively with all stakeholders, and has the ability to work in a fast-paced team.</li></ul><p><strong>BENEFITS</strong></p><p><strong>Own Your Time</strong></p><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting.</p><p><strong>Recharge Time</strong></p><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p><strong>Care For Yourself</strong></p><p>You’ll receive a health/wellness stipend that goes towards covering medical insurance, dental insurance, or joining a gym!</p><p><strong>Focused Work</strong></p><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams.</p><p><strong>Learn at your edges</strong></p><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</p><p>And of course, if you speak at a tech conference, we cover all expenses.</p><p><strong>Clevertech Swag</strong></p><p>And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p><p>Want to learn more about Clevertech and the team? Check out <a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 7:21:40 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "IGZNE8mkS6ur1ri8Vx6vaA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16289547",
    "title": "Airtame (https://airtame.com) | Copenhagen, Denmark | Full-time, Onsite/Remote",
    "content": "<div>                  <span>Airtame (<a href='https://airtame.com' rel='nofollow'>https://airtame.com</a>) | Copenhagen, Denmark | Full-time, Onsite/Remote<p>Airtame is a fast-growing startup. Our wireless streaming solution helps people work better. We are based in windy Copenhagen, but have an office in New York that takes care of our U.S. customers.</p><p>We're currently hiring:</p><p>* Senior C/C++ Software Engineer at Airtame - Copenhagen, Denmark (<a href='https://airtame.com/jobs/senior-cpp-software-engineer' rel='nofollow'>https://airtame.com/jobs/senior-cpp-software-engineer</a>)</p><p>* Senior Embedded Linux Engineer - Copenhagen, Denmark (<a href='https://airtame.com/jobs/senior-embedded-linux-engineer' rel='nofollow'>https://airtame.com/jobs/senior-embedded-linux-engineer</a>)</p><p>* Senior Digital Product Designer - Copenhagen, Denmark (<a href='https://airtame.com/jobs/senior-ux-ui-designer' rel='nofollow'>https://airtame.com/jobs/senior-ux-ui-designer</a>)</p><p>* Frontend Engineer - Copenhagen, Denmark (<a href='https://airtame.com/jobs/frontend-engineer' rel='nofollow'>https://airtame.com/jobs/frontend-engineer</a>)</p><p>* Senior Application Engineer - Copenhagen, Denmark (<a href='https://airtame.com/jobs/senior-application-engineer' rel='nofollow'>https://airtame.com/jobs/senior-application-engineer</a>)</p><p>* Technical Support Specialist - Brooklyn, New York (<a href='https://airtame.com/jobs/technical-support-specialist-ny' rel='nofollow'>https://airtame.com/jobs/technical-support-specialist-ny</a>)</p><p>Our talented engineers are given significant ownership and responsibility over projects. We value rapid iteration, continuous integration and testing, and we are serious about producing high-quality, maintainable software. Frequent code reviews, linting, and pairing are all integral components of our engineering culture. We encourage experimenting with new technologies and constantly challenge ourselves to improve our code, processes, and systems.</p><p>You can read a bit about our values on our Company Culture Trello Board: <a href='https://trello.com/b/ZXs2YYy6/culture-airtame' rel='nofollow'>https://trello.com/b/ZXs2YYy6/culture-airtame</a></p><p>We sponsor work visas for non-EU applicants.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 1:00:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/embedded",
      "TECH1/frontend",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "embedded",
      "frontend"
    ]
  },
  {
    "id": "QQ84oODoRde61gH3-6tSyg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16287505",
    "title": "Mesosphere, Inc. is hiring a variety of software engineers to help build the Datacenter Operating System, based upon Apache ...",
    "content": "<div>                  <span>Mesosphere, Inc. is hiring a variety of software engineers to help build the Datacenter Operating System, based upon Apache Mesos. If you're looking to work on distributed systems, large clusters at scale, containers &amp; microservices, and big data frameworks, we'd love to hear from you. Languages we use include Scala, Java, Erlang, Go, C++, Python, &amp; Javascript.We start the process with an intro call, then a coding challenge + review call, followed by a full day of onsite interviews.<p>We are hiring for full-time roles in our SF, CA and Hamburg, Germany offices, and will sponsor visas wherever possible. If it makes sense for you and works for our team, we are open to remote, home office working arrangements, in both the US and EMEA.</p><p>-Software Engineer - Package Distribution (SF) <a href='http://grnh.se/wyfgi01' rel='nofollow'>http://grnh.se/wyfgi01</a></p><p>-Software Engineer - Core Mesos (Hamburg) <a href='http://grnh.se/ce1ugo1' rel='nofollow'>http://grnh.se/ce1ugo1</a></p><p>-Software Engineer - Cluster Ops (Hamburg) <a href='http://grnh.se/wt84gr1' rel='nofollow'>http://grnh.se/wt84gr1</a></p><p>-Site Reliability Engineer (SF) <a href='http://grnh.se/te1aur1' rel='nofollow'>http://grnh.se/te1aur1</a></p><p>-Software Engineer - Data Infrastructure (SF &amp; Hamburg) <a href='http://grnh.se/rjxb2e' rel='nofollow'>http://grnh.se/rjxb2e</a></p><p>-Product Manager - Platform (SF) <a href='http://grnh.se/apxsoq1' rel='nofollow'>http://grnh.se/apxsoq1</a></p><p>-Product Manager - Security (SF) <a href='http://grnh.se/pn6b2l1' rel='nofollow'>http://grnh.se/pn6b2l1</a></p><p>-Solutions Architect - Cassandra SME (Remote/Travel) <a href='http://grnh.se/ycd1q31' rel='nofollow'>http://grnh.se/ycd1q31</a></p><p>-Sales Development Representative (San Francisco) <a href='http://grnh.se/nictvr1' rel='nofollow'>http://grnh.se/nictvr1</a></p><p>All openings: <a href='https://mesosphere.com/careers/' rel='nofollow'>https://mesosphere.com/careers/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 4:00:05 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "PI4gJ5fTSUacZVnbHJLKRA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283822",
    "title": "AdRoll | San Francisco | On-site/remote | Full-time If you like developing open-source code, languages such as Python, Go, JS, ...",
    "content": "<div>                  <span>AdRoll | San Francisco | On-site/remote | Full-time<p>If you like developing open-source code, languages such as Python, Go, JS, C, D, Lua, Erlang, AWS, petabytes of data, and distributed low-latency systems, this may be your dream job.</p><p>This time we are particularly interested in finding full stack web developers with good JavaScript experience and experienced developers, tech leads and data scientists with great math knowledge and coding skills. This is a really unique opportunity to get to work with a massive scale (thousands of instances on AWS), low latency (real-time bidding with 100ms max latency and 70B requests daily, real-time machine learning with 1ms max latency), mission-critical systems (this is how we make money) and enjoy working on a strong frontend development team (<a href='http://tech.adroll.com/blog/frontend/2017/08/29/how-to-run-a...' rel='nofollow'>http://tech.adroll.com/blog/frontend/2017/08/29/how-to-run-a...</a>).</p><p>Learn more about us here <a href='http://tech.adroll.com/blog/' rel='nofollow'>http://tech.adroll.com/blog/</a></p><p>I am happy to tell you more over coffee in SF or by email, dialtone@adroll.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:39:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/go",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "go",
      "other"
    ]
  },
  {
    "id": "GlTj7GusRlmCgE5ktuwiBQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283725",
    "title": "Qualys Inc. (qualys.com, NASDAQ: QLYS) | Foster City CA | Full-time, ONSITE/REMOTE | $110k-$125k, RSUs, 401(k) matching, bonuses, health ...",
    "content": "<div>                  <span>Qualys Inc. (qualys.com, NASDAQ: QLYS) | Foster City CA | Full-time, ONSITE/REMOTE | $110k-$125k, RSUs, 401(k) matching, bonuses, health benefits Qualys is a provider of cloud security, compliance and related services for small and medium-sized businesses and large corporations.<p>We are looking for a capable, motivated engineer to help us update and maintain our backend infrastructure. The ideal candidate has good knowledge of Ceph. A demonstrable ability to learn new and complex technologies is a substitute for this requirement. Must have a good knowledge of Linux, VM infrastructure, databases, and preferably some experience with an S3-compatible object storage system. Solid programming experience in a language such as Java, C, Go, or Python is required as is experience with networking, logging, and monitoring.</p><p>For consideration for a remote position, the applicant should provide references that will verify he/she is capable of working remotely efficiently and reliably. Remote applicants must be willing to meet off-hours occasionally, as we have offices in several countries that we sometimes need to sync with.</p><p>Please send a short cover letter and a resume to jdavis@(our domain). Interview process will include a short coding exercise. No recruiters.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:30:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "aEIiKYUXQ8uHXJAgE52JQA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Associate+Manager&c=Red+Hat&l=Remote&jk=af4edb472c414e96&rtk=1c5g89oku144k3lk&from=rss",
    "title": "Associate Manager, Software Engineering - Platform Tools - Red Hat, Inc. - Remote",
    "content": "<div><b>Associate Manager, Software Engineering - Platform Tools</b><br><span>Red Hat, Inc.</span>     -<span>Remote</span>    </div><span><p>At Red Hat, we connect an innovative community of customers, partners, and contributors to deliver an open source stack of trusted, high-performing solutions. We offer cloud, Linux, middleware, storage, and virtualization technologies, together with award-winning global customer support, consulting, and implementation services. Red Hat is a rapidly growing company supporting more than 90% of Fortune 500 companies.</p><b>Job summary</b><p>If you share our passion for guiding open source solutions into the mainstream by making high-quality, low-cost technology more accessible, this is a role for you. The Red Hat Platform Engineering team is looking for an Engineering Manager to join us in the UK. In this role, you will lead a team of highly skilled engineers working on GCC, G++, and binutils. With a technical background in software tools and operating systems, or a closely related area, you will work under guidance from senior management to and make a significant contribution to Red Hat Enterprise Linux (RHEL). This is your chance to play an active role in the Open Source Tools community. The work location for this position is flexible, but ideally based in Western Europe. Home-based, remote candidates will be considered alongside those who can work from one of our physical offices. Successful applicants must reside in a state or country where Red Hat is registered to do business.</p><b>Primary job responsibilities</b><ul><li>Daily interaction with your developers and all aspects of people management</li><li>Working with the individual technical leads to develop and track clear and concise roadmaps, as well as leading architectural decisions</li><li>Interact with peer engineering groups within Red Hat to deliver releases of Red Hat Enterprise Linux (RHEL), Red Hat Developer Toolset, and Fedora</li><li>Interact with the internal quality engineering, documentation, and release management teams</li><li>Represent the team at functional meetings, conferences, customer and partner discussions</li></ul><b>Required skills</b><ul><li>Prior experience of technical engineering management</li><li>Excellent technical understanding of compilers and related tools</li><li>Exposure to open source development and projects and distributed development teams</li><li>Motivated with excellent communication and organizational skills</li></ul><p><br>Red Hat is proud to be an equal opportunity workplace and an affirmative action employer. We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, uniformed services, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law.</p><p><br>Red Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee.</p></span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 3:07:16 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "XDhXHhepRb6p620-8s2VhA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Associate+Manager&c=Red+Hat&l=Remote&jk=af4edb472c414e96&rtk=1c5gchuka92paene&from=rss",
    "title": "Associate Manager, Software Engineering - Platform Tools - Red Hat, Inc. - Remote",
    "content": "<div><b>Associate Manager, Software Engineering - Platform Tools</b><br><span>Red Hat, Inc.</span>     -<span>Remote</span>    </div><span><p>At Red Hat, we connect an innovative community of customers, partners, and contributors to deliver an open source stack of trusted, high-performing solutions. We offer cloud, Linux, middleware, storage, and virtualization technologies, together with award-winning global customer support, consulting, and implementation services. Red Hat is a rapidly growing company supporting more than 90% of Fortune 500 companies.</p><b>Job summary</b><p>If you share our passion for guiding open source solutions into the mainstream by making high-quality, low-cost technology more accessible, this is a role for you. The Red Hat Platform Engineering team is looking for an Engineering Manager to join us in the UK. In this role, you will lead a team of highly skilled engineers working on GCC, G++, and binutils. With a technical background in software tools and operating systems, or a closely related area, you will work under guidance from senior management to and make a significant contribution to Red Hat Enterprise Linux (RHEL). This is your chance to play an active role in the Open Source Tools community. The work location for this position is flexible, but ideally based in Western Europe. Home-based, remote candidates will be considered alongside those who can work from one of our physical offices. Successful applicants must reside in a state or country where Red Hat is registered to do business.</p><b>Primary job responsibilities</b><ul><li>Daily interaction with your developers and all aspects of people management</li><li>Working with the individual technical leads to develop and track clear and concise roadmaps, as well as leading architectural decisions</li><li>Interact with peer engineering groups within Red Hat to deliver releases of Red Hat Enterprise Linux (RHEL), Red Hat Developer Toolset, and Fedora</li><li>Interact with the internal quality engineering, documentation, and release management teams</li><li>Represent the team at functional meetings, conferences, customer and partner discussions</li></ul><b>Required skills</b><ul><li>Prior experience of technical engineering management</li><li>Excellent technical understanding of compilers and related tools</li><li>Exposure to open source development and projects and distributed development teams</li><li>Motivated with excellent communication and organizational skills</li></ul><p><br>Red Hat is proud to be an equal opportunity workplace and an affirmative action employer. We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, uniformed services, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law.</p><p><br>Red Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee.</p></span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 3:07:16 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "cEeQRtBqQjyvU_QRzngk8g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Associate+Manager&c=Red+Hat&l=Remote&jk=af4edb472c414e96&rtk=1c5gm7ns49ma3ej6&from=rss",
    "title": "Associate Manager, Software Engineering - Platform Tools - Red Hat, Inc. - Remote",
    "content": "<div><b>Associate Manager, Software Engineering - Platform Tools</b><br><span>Red Hat, Inc.</span>     -<span>Remote</span>    </div><span><p>At Red Hat, we connect an innovative community of customers, partners, and contributors to deliver an open source stack of trusted, high-performing solutions. We offer cloud, Linux, middleware, storage, and virtualization technologies, together with award-winning global customer support, consulting, and implementation services. Red Hat is a rapidly growing company supporting more than 90% of Fortune 500 companies.</p><b>Job summary</b><p>If you share our passion for guiding open source solutions into the mainstream by making high-quality, low-cost technology more accessible, this is a role for you. The Red Hat Platform Engineering team is looking for an Engineering Manager to join us in the UK. In this role, you will lead a team of highly skilled engineers working on GCC, G++, and binutils. With a technical background in software tools and operating systems, or a closely related area, you will work under guidance from senior management to and make a significant contribution to Red Hat Enterprise Linux (RHEL). This is your chance to play an active role in the Open Source Tools community. The work location for this position is flexible, but ideally based in Western Europe. Home-based, remote candidates will be considered alongside those who can work from one of our physical offices. Successful applicants must reside in a state or country where Red Hat is registered to do business.</p><b>Primary job responsibilities</b><ul><li>Daily interaction with your developers and all aspects of people management</li><li>Working with the individual technical leads to develop and track clear and concise roadmaps, as well as leading architectural decisions</li><li>Interact with peer engineering groups within Red Hat to deliver releases of Red Hat Enterprise Linux (RHEL), Red Hat Developer Toolset, and Fedora</li><li>Interact with the internal quality engineering, documentation, and release management teams</li><li>Represent the team at functional meetings, conferences, customer and partner discussions</li></ul><b>Required skills</b><ul><li>Prior experience of technical engineering management</li><li>Excellent technical understanding of compilers and related tools</li><li>Exposure to open source development and projects and distributed development teams</li><li>Motivated with excellent communication and organizational skills</li></ul><p><br>Red Hat is proud to be an equal opportunity workplace and an affirmative action employer. We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, uniformed services, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law.</p><p><br>Red Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee.</p></span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 3:07:16 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "nGQrsrRLSk60ti89JXTKlA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Associate+Manager&c=Red+Hat&l=Remote&jk=af4edb472c414e96&rtk=1c5gsus169tlkba1&from=rss",
    "title": "Associate Manager, Software Engineering - Platform Tools - Red Hat, Inc. - Remote",
    "content": "<div><b>Associate Manager, Software Engineering - Platform Tools</b><br><span>Red Hat, Inc.</span>     -<span>Remote</span>    </div><span><p>At Red Hat, we connect an innovative community of customers, partners, and contributors to deliver an open source stack of trusted, high-performing solutions. We offer cloud, Linux, middleware, storage, and virtualization technologies, together with award-winning global customer support, consulting, and implementation services. Red Hat is a rapidly growing company supporting more than 90% of Fortune 500 companies.</p><b>Job summary</b><p>If you share our passion for guiding open source solutions into the mainstream by making high-quality, low-cost technology more accessible, this is a role for you. The Red Hat Platform Engineering team is looking for an Engineering Manager to join us in the UK. In this role, you will lead a team of highly skilled engineers working on GCC, G++, and binutils. With a technical background in software tools and operating systems, or a closely related area, you will work under guidance from senior management to and make a significant contribution to Red Hat Enterprise Linux (RHEL). This is your chance to play an active role in the Open Source Tools community. The work location for this position is flexible, but ideally based in Western Europe. Home-based, remote candidates will be considered alongside those who can work from one of our physical offices. Successful applicants must reside in a state or country where Red Hat is registered to do business.</p><b>Primary job responsibilities</b><ul><li>Daily interaction with your developers and all aspects of people management</li><li>Working with the individual technical leads to develop and track clear and concise roadmaps, as well as leading architectural decisions</li><li>Interact with peer engineering groups within Red Hat to deliver releases of Red Hat Enterprise Linux (RHEL), Red Hat Developer Toolset, and Fedora</li><li>Interact with the internal quality engineering, documentation, and release management teams</li><li>Represent the team at functional meetings, conferences, customer and partner discussions</li></ul><b>Required skills</b><ul><li>Prior experience of technical engineering management</li><li>Excellent technical understanding of compilers and related tools</li><li>Exposure to open source development and projects and distributed development teams</li><li>Motivated with excellent communication and organizational skills</li></ul><p><br>Red Hat is proud to be an equal opportunity workplace and an affirmative action employer. We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, uniformed services, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law.</p><p><br>Red Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee.</p></span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 3:07:16 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "m0FWXSPbQ1GCQmWk9JJ8fQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "craigslist-java-sfbay",
    "url": "https://sfbay.craigslist.org/sby/sof/d/rare-opportunity-w-dev/6477725956.html",
    "title": "RARE OPPORTUNITY: S/W DEV MANAGER IN MOBILE TECH START-UP (Sacramento CA)",
    "content": "RARE OPPORTUNITY: S/W DEV MANAGER IN MOBILE TECH START-UP \n(Sacramento CA) hide this posting  unhide \n\ncompensation: Varies depending on experience. Competitive salary, Health \nbenefits, Stock. \nemployment type: full-time \ntelecommuting okay \n\n\nQR Code Link to This Post\n Rare opportunity for a well-qualified individual to work for an upcoming, \nleading edge mobile technology company located in the Sacramento area. Where \nelse can you live where the median home is $270k and ranked by Infogroup as \namong the nations more &quot;hipster&quot; cities, enjoy a Northern California climate, \nand be a 2-hour drive to the SF Bay Area or Lake Tahoe? We already have our \nalpha customer and defined key features for the first release. This is an early \nopportunity before we start recruiting on Linked In next month. Since we're \nstaffing our original employees and technical leaders, stock will be offered \nalong with competitive salary and health benefits.\n\n Looking for a S/W Development Manager, preferably with web server and/or \nAndriod/IOS s/w development expertise. The following skills are a plus: \nJavaScript, experience with threaded, networking, and/or distributed apps, \nworking knowledge of HTML and XML as well as graphics systems, Java, C++, C, \nObj-C, Swift.\n\n Ideally has worked on a scrum team and has experience with source code \ncontrol and bug tracking systems. Needs passion to work in an exciting and fast \npaced startup environment. Experience with: Messaging, location services, \ngeo-fencing, beacons, user segmentation, conditional and dynamic application \nlayout, and content management is a plus.\n\n * Principals only. Recruiters, please don't contact this job poster. \n * do NOT contact us with unsolicited services or offers",
    "urlFetchPending": false,
    "published": "Jan 30, 2018 3:15:39 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c",
      "mobile"
    ]
  },
  {
    "id": "a4UpxxWOQHWQ24RoWwpi7A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "craigslist-java-newyork",
    "url": "https://newyork.craigslist.org/fct/sof/d/software-developer/6455796583.html",
    "title": "Software Developer (Manchester, CT)",
    "content": "Software Developer (Manchester, CT) hide this posting  \nunhide \n< image 1 of 1 > \ncompensation: Competitive \nemployment type: full-time \ntelecommuting okay \n\n\nQR Code Link to This Post\n WHY JOIN IMCORP\n IMCORP is an award-winning, multi-faceted company offering excellent career \nopportunities in a dynamic and fast-paced work environment. Our leading-edge \ncable diagnostic technology delivers precise and cost-effective solutions that \nmaximize our customers' success. We seek talented and dedicated people who want \nto join an exciting, high-growth company with a strong financial foundation. If \nyour ideal is to work at a place where people listen to your ideas, respond \nquickly and work together to achieve the highest standards, IMCORP is for you. \nJoin us, and be part of a creative team that is revolutionizing the energy \nindustry. Your work will build a robust future for our customers, environment \nand communities.\n\n Awards:\n Top 34 Fastest-Growing U.S. Engineering Firms 7 years in a row - Inc. Magazine\n Top UCONN Start-Up Company \n Best Places to Work in Connecticut - 2014, 2015, 2016 & 2017\n\n Benefits:\n Competitive pay\n Top-notch benefits, including medical/dental/vision/disability insurance, \npaid time off/holidays, retirement plan, Flex Place program, tuition \nreimbursement and more.\n\n POSITION OVERVIEW\n Are you looking for a great opportunity where your work will be both varied \nand challenging? Do you want to have significant organizational impact? We seek \na talented software developer to join our team. As a member of our R & D team, \nyou will design and build cutting-edge software solutions that are integral to \nour next-generation instrumentation. You will also have critical \nresponsibilities to creatively extend and interconnect existing internal \nbusiness systems.\n\n At IMCORP, you'll have the opportunity to expand and improve your skill sets \nin diverse areas. You'll be able to take training courses or otherwise improve \nyour skill set during normal business hours. Our development environment has a \nlaid-back feeling, with business casual dress throughout the week, active \nlunchtime billiards games and friendly colleagues. We're conveniently located \nnear major routes in a suburban setting with free parking. Our developers have \nmodern workstations and a modest budget to customize their workstations or \npurchase peripherals they require. IMCORP is committed to making our developers \nas successful as possible, which is why executive leadership ensures the \ntechnical viability and stable funding of every project.\n\n We'd prefer candidates who can work at our Manchester, CT, offices, but we're \nopen to exploring fit with you if you're a remotely-based candidate who has \nterrific communication, team, and organizational skills, with a disciplined \nspirit of accountability. Wherever you're based, we'll value your documentation \nskills, motivation and ability to deliver results on schedule.\n\n REQUIREMENTS \n - .dll development skills in C and C++ environment for deploying highly \noptimized and fast algorithms (64 bit target .dll).\n - Strong skills with data visualization in Python\n - Strong skills with Java and .NET development platforms for building \ndistributed applications (cloud computing)\n - Demonstrated ability to design network architectures, including local/wide \narea networks (LANs/WANs) and intranet\n - Demonstrated ability to maintain servers\n - Ability to select and integrate network and server security tools\n - Strong skills with deploying MATLAB code as .NET applications or .dll \ntargets\n - Employment authorization to work in the United States, with no current or \nfuture requirement of sponsorship\n\n TO APPLY\n Please send resume and work samples (coding, scripting, site design and \ndocumentation. Principals only please.\n\n ABOUT IMCORP\n IMCORP is the technology leader in underground power cable reliability. Our \ndiagnostic technology locates existing cable system defects and determines \nfuture cable reliability. This performance-driven solution provides the most \neffective and efficient means to determine the reliability of new or aged cable \nsystems. The IMCORP Factory Grade® test has enabled rapid growth across \nindustries around the world. From single phase 5kV to 500kV, IMCORP is setting \nthe standard in power cable reliability.\n IMCORP is an equal opportunity employer and considers qualified applicants \nfor employment without regard to race, color, creed, religion, national origin, \nsex, sexual orientation, gender identity and expression, age, disability, or \nVietnam era, or other eligible veteran status, or any other protected factor.\n Qualified military veterans welcome.\n Visit us at www.imcorp.com\n\n * Principals only. Recruiters, please don't contact this job poster. \n * do NOT contact us with unsolicited services or offers \n * OK to highlight this job opening for persons with disabilities",
    "urlFetchPending": false,
    "published": "Jan 11, 2018 6:02:32 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/dotnet",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c",
      "dotnet"
    ]
  },
  {
    "id": "HYeKoC2OROuFXMFYYjGUzQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "craigslist-java-boston",
    "url": "https://boston.craigslist.org/bmw/sof/d/software-developer/6455787510.html",
    "title": "Software Developer (Manchester, CT)",
    "content": "Software Developer (Manchester, CT) hide this posting  \nunhide \n< image 1 of 1 > \ncompensation: Competitive \nemployment type: full-time \ntelecommuting okay \n\n\nQR Code Link to This Post\n WHY JOIN IMCORP\n IMCORP is an award-winning, multi-faceted company offering excellent career \nopportunities in a dynamic and fast-paced work environment. Our leading-edge \ncable diagnostic technology delivers precise and cost-effective solutions that \nmaximize our customers' success. We seek talented and dedicated people who want \nto join an exciting, high-growth company with a strong financial foundation. If \nyour ideal is to work at a place where people listen to your ideas, respond \nquickly and work together to achieve the highest standards, IMCORP is for you. \nJoin us, and be part of a creative team that is revolutionizing the energy \nindustry. Your work will build a robust future for our customers, environment \nand communities.\n\n Awards:\n Top 34 Fastest-Growing U.S. Engineering Firms 7 years in a row - Inc. Magazine\n Top UCONN Start-Up Company \n Best Places to Work in Connecticut - 2014, 2015, 2016 & 2017\n\n Benefits:\n Competitive pay\n Top-notch benefits, including medical/dental/vision/disability insurance, \npaid time off/holidays, retirement plan, Flex Place program, tuition \nreimbursement and more.\n\n POSITION OVERVIEW\n Are you looking for a great opportunity where your work will be both varied \nand challenging? Do you want to have significant organizational impact? We seek \na talented software developer to join our team. As a member of our R & D team, \nyou will design and build cutting-edge software solutions that are integral to \nour next-generation instrumentation. You will also have critical \nresponsibilities to creatively extend and interconnect existing internal \nbusiness systems.\n\n At IMCORP, you'll have the opportunity to expand and improve your skill sets \nin diverse areas. You'll be able to take training courses or otherwise improve \nyour skill set during normal business hours. Our development environment has a \nlaid-back feeling, with business casual dress throughout the week, active \nlunchtime billiards games and friendly colleagues. We're conveniently located \nnear major routes in a suburban setting with free parking. Our developers have \nmodern workstations and a modest budget to customize their workstations or \npurchase peripherals they require. IMCORP is committed to making our developers \nas successful as possible, which is why executive leadership ensures the \ntechnical viability and stable funding of every project.\n\n We'd prefer candidates who can work at our Manchester, CT, offices, but we're \nopen to exploring fit with you if you're a remotely-based candidate who has \nterrific communication, team, and organizational skills, with a disciplined \nspirit of accountability. Wherever you're based, we'll value your documentation \nskills, motivation and ability to deliver results on schedule.\n\n REQUIREMENTS \n - .dll development skills in C and C++ environment for deploying highly \noptimized and fast algorithms (64 bit target .dll).\n - Strong skills with data visualization in Python\n - Strong skills with Java and .NET development platforms for building \ndistributed applications (cloud computing)\n - Demonstrated ability to design network architectures, including local/wide \narea networks (LANs/WANs) and intranet\n - Demonstrated ability to maintain servers\n - Ability to select and integrate network and server security tools\n - Strong skills with deploying MATLAB code as .NET applications or .dll \ntargets\n - Employment authorization to work in the United States, with no current or \nfuture requirement of sponsorship\n\n TO APPLY\n Please send resume and work samples (coding, scripting, site design and \ndocumentation. Principals only please.\n\n ABOUT IMCORP\n IMCORP is the technology leader in underground power cable reliability. Our \ndiagnostic technology locates existing cable system defects and determines \nfuture cable reliability. This performance-driven solution provides the most \neffective and efficient means to determine the reliability of new or aged cable \nsystems. The IMCORP Factory Grade® test has enabled rapid growth across \nindustries around the world. From single phase 5kV to 500kV, IMCORP is setting \nthe standard in power cable reliability.\n IMCORP is an equal opportunity employer and considers qualified applicants \nfor employment without regard to race, color, creed, religion, national origin, \nsex, sexual orientation, gender identity and expression, age, disability, or \nVietnam era, or other eligible veteran status, or any other protected factor.\n Qualified military veterans welcome.\n Visit us at www.imcorp.com\n\n * Principals only. Recruiters, please don't contact this job poster. \n * do NOT contact us with unsolicited services or offers \n * OK to highlight this job opening for persons with disabilities",
    "urlFetchPending": false,
    "published": "Jan 11, 2018 5:55:54 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/dotnet",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c",
      "dotnet"
    ]
  },
  {
    "id": "b7B40do9TPu1XZma0_A2Rg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4079-embedded-engineer-bread",
    "title": "Embedded Engineer @ Bread",
    "content": "<h2>              Embedded Engineer<small> @ Bread</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-01-08 03:45</p></dd>          <dt><span>Description</span></dt>          <dd><p>We are looking for an experienced C developer to join our mobile team to help us build the best crypto currency experience in the world. Our vision is to decentralize banking and bring the power of financial services to everyone in the world, including the nearly 2 billion adults that to this day remain unbanked.</p><p><strong>Embedded development at Bread</strong></p><p>Bread's origins trace back to the desire to build a beautiful product underpinned by beautiful software. Our mobile wallet connects directly to cryptocurrency peer to peer networks and as such has a unique set of requirements that differs from those that depend on a centralized server. To accomplish this task we've built a standalone C library which provides a full bitcoin SPV wallet. Aaron Voisine, the author of the library, has painstakingly crafted this library so it can be used in both our iOS and Android wallets.</p><p>This codebase is responsible for providing access to billions of dollars in assets on customers wallets. It's paramount that we continue to maintain and evolve the library to meet our business and our customer needs. This includes adding support for more cryptocurrencies, and building a testing infrastructure so we can automatically verify correctness.</p><p><strong>What we're doing at Bread</strong></p><p>Bread is at the heart of a financial revolution. We're building the missing piece of infrastructure that ties together the essential functionality of a bank, but where individuals retain complete control over their assets. As a a financial infrastructure company, our mission is unlikely to ever be complete. We need continually strive to bring the power of our apps to new regions of the world, some of which have never had wide access to banking functionality.</p><p>Our approach to this problem heavily focuses on several core tenants. For one, we will never have direct control or visibility over customer funds. It is not our job to interfere in the personal financial lives of our customers. This is accomplished by using digital assets like Bitcoin, and a mobile app like ours which manages its assets on-device.</p><p>The second tenant of our approach is to provide integration with the traditional financial system. Regardless of the currency, people still need to get paid, pay their bills, pay for goods at merchants, and send money to their family and friends. We are building infrastructure that integrates with local financial businesses that tie in with local currencies and adhere to local laws.</p><p>Finally, we need to fight for a quality consumer experience. This is why we try to retain control over every moment of our customer's interaction with our products. We relentlessly design, redesign, test, and experiment to ensure our customers have a positive, safe experience.</p><p><strong>What it's like to work here</strong></p><p>We've built a lively remote work culture that emphasizes regular personal interaction. At Bread, we started as a remote team and have built our workflows around it. This allows us to hire people who want to work with us, regardless of where they've decided to settle (or roam). </p><p>Work-life balance is important to everyone at Bread, and we strive to ensure everyone has enough time for family, exercise, and mental health. In our opinion, a happy and healthy team is an essential ingredient to finding creative solutions to the hard problems we're trying to solve.</p><p>We're more operationally transparent than you may be used to. The entire Bread team has access to a variety of dashboards that help our distributed team make better decisions. If you have a question that can't be answered by a dashboard or an easy query, let's see if we can fix that.</p><p>Bread is committed to building an actively inclusive work environment that makes our team an excellent home for everyone—regardless of gender, sexual orientation, ethnicity, race, education, age, or other personal characteristics.</p><p><strong>Requirements</strong></p><p>There are no hard requirements, so if you see something listed here that you're unsure about, please don't hesitate to ask!</p><ul><li>5+ years of software engineering experience</li><li>Confidence working with low-level C code</li><li>Ability to write unit tests, integration tests</li><li>Comfortable working with threading, sockets, and cryptography </li><li>A desire to learn and grow your skills</li><li>You value your attention to detail</li></ul><p>Nice to haves:</p><ul><li>Experience with the low level concepts in blockchains</li><li>Mobile development experience</li><li>Java and JNI</li><li>Swift and Swift-C bindings</li><li>Crypto currency experience will help you get up to speed quicker</li></ul><p>You should include these in your application:</p><ul><li>Resume and LinkedIn profile</li><li>Links to code samples on Github, Gitlab, etc</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>USA/Canada/Mexico</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Jan 8, 2018 5:45:28 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "c",
      "embedded"
    ]
  }
]
}
