{
 "items": [
  {
    "id": "Itw2rjjhTVS-6j1yQlW09g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/182766/salesforce-technical-architect-synaptic-advisory-partners?a=ZiejRCn5myA",
    "title": "Salesforce Technical Architect at Synaptic Advisory Partners (Annapolis, MD) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, SaaS</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>What we are about</strong></p><p>We &lt;3 our team and our customers. We have passion and innovation embedded in our DNA, and we go out of our way to encourage our employees to share new ideas and feedback on a regular basis.&nbsp; Our mission is to deliver solutions that help our clients better engage and interact with their customers, employees, patients, and constituents by providing solutions that make the right thing easy to do.</p><p>Synaptic AP is a leader in the development and deployment of cloud-based solutions.&nbsp; In addition to our world-class Salesforce.com consulting practice, we have two flagship products - Synapse<sup>TM</sup>, a population health management solution serving over one million lives around the United States, and Youreka<sup>TM</sup>, the leading tool for forms, field assessments, and guided sales and service on the Salesforce platform.</p><p><strong>We have</strong></p><ul><li>An amazing team focused on doing #Whateverittakes to help our clients and teammates be successful</li><li>A calling to innovate and improve every day</li><li>A competitive benefits and compensation package</li><li>Room for rapid growth and an emphasis on talent development</li><li>A fun, casual team environment with cool co-workers who will make you feel like you are an important part of our team, engage you in developing new solutions to challenging problems, and help you leverage your strengths to make all of us better!</li><li>A great benefits package including medical, dental, vision, 401k, AD&amp;D and Life Insurance coverage, STD coverage, PTO, sick leave, wellness initiatives, and more!</li></ul><p><strong>What you will do</strong></p><p>You will be involved in all phases of the product development life cycle, working closely with our internal product team to assist with the design, development and launch of new products, features, enhancements and improvements. The Technical Architect will lead technical requirements sessions, making technology easily understandable for end users, act as a liaison between clients and Synaptic’s internal development team, and showcase the potential power and value of our products in a very customer-centric, supportive and comprehensive fashion.</p><p><strong><u>Skills and experience you need to be successful</u></strong></p><ul><li>Bachelor’s degree or equivalent</li><li>3+ years working with Salesforce.com as a Technical Architect</li><li>3+ years working with VisualForce and Apex</li><li>Strong knowledge of software development lifecycles, systems engineering and business process re-engineering.</li><li>Experience with system integrations, preferably involving Salesforce.com</li><li>Experience with web services: JSON, XML</li><li>Experience with some or all of the following: a C-based language (preferably Java), SQL, HTML, CSS, Javascript (any popular framework)</li><li>Knowledge of data management, including data capture, warehousing, segmentation, mining, storing, cleaning and security</li><li>Certified Force.com Developer (DEV401) or Advanced Developer (DEV501)</li><li>Certified Sales Cloud or Service Cloud Consultant</li><li>Healthcare industry experience preferred</li><li>Project management experience preferred</li></ul><p><strong>Location</strong></p><p>The Technical Architect position can be located Remote, or in our Annapolis, MD or Stuart, FL offices.</p><p><em>Synaptic Advisory Partners is an equal opportunity and affirmative action employer, who participates in E-Verify. All qualified applicants will receive consideration for employment without regard to race, color, national origin, gender, religion, age, disability, veteran’s status, or any other classification as required by applicable law.</em></p>                    </div>                            <h2>                About Synaptic Advisory Partners            </h2>            <div><p>Synaptic AP specializes in the development and deployment of secure, cloud-based enterprise applications on the Salesforce.com platform for organizations worldwide. As a Salesforce implementation consulting partner, our custom solutions are built-to-scale to meet your unique business needs. Synaptic AP is looking for dynamic, independent, critical-thinkers who have a passion for making a difference, while building a career.&nbsp;</p><p>Our company offers an entrepreneurial, casual, team atmosphere. Employees at Synaptic work hard but have a lot of fun. We offer competitive salaries, aggressive incentive programs, and rapid growth potential. Our team is looking for self-starting individuals who take pride in their work, excel in working collaboratively as part of a team, have a strong desire to learn new technologies and business practices, and have a consultative, customer service mindset.</p><p>Check out our current job openings at <a href='http://www.synapticap.com/careers/' rel='nofollow'>http://www.synapticap.com/careers/</a></p>            </div>                                <h2>Benefits</h2>                            <div>                                 medical                            </div>                            <div>                                 dental                            </div>                            <div>                                 401k                            </div>                            <div>                                 vacation                            </div>                            <div>                                 gym expense                            </div>                            <div>                                 adventure fund                            </div>                            <div>                                 national park pass                            </div>                            <div>                                 casual dress                            </div>                    ",
    "urlFetchPending": false,
    "published": "May 7, 2018 6:13:51 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "rpNicfvkQ1uQLkidVGnZTA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/181579/senior-cloud-backend-architect-f-m-silexica-gmbh?a=YTy5xFqtKRq",
    "title": "Senior Cloud Backend Architect (f/m) at Silexica GmbH (San Jose, CA) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Silexica is a fast-growing software company that helps manufacturers of embedded systems, such as driverless cars, to increase their device performance by effective utilization of the underlying multicore architecture. Our multi-cultural team includes some of the best compiler experts and embedded engineers in the world, complemented by experienced industry veterans and hungry business professionals. We have offices in the US, Europe and Asia and work with market leading clients in the automotive, wireless and other rapidly transforming industries. We are incredibly passionate about revolutionizing embedded parallel programming and you can become an important part of our success story!</p><p>We are currently looking for a passionate and experienced <strong>Senior Cloud Backend Architect (f/m) </strong>to design our enterprise cloud platform from scratch. You will take full ownership of all technical aspects of our cloud infrastructure by using your excellent knowledge of containerization, microservice architecture and cloud platforms! In this position you can work remotely i.e. you can be located anywhere in the world or it can be located in one of our offices in Silicon Valley / US, Cologne  / Germany or Yokohama / Japan. </p><p><strong>You role:</strong></p><ul> <li>You develop, build and run our high-performance and robust enterprise cloud backend using modern technologies and frameworks</li> <li>You repackage our professional software development tool into a user friendly and highly scalable cloud platform based on microservices</li> <li>You drive architecture decisions with your expertise in containerization, microservice architecture and cloud platforms</li> <li>You break down complex tasks into small and independent components</li> <li>You will collaborate closely with our front-end development team and stakeholders like product management and executive team</li> <li>You'll collaborate, influence and drive for improvement across scrum teams</li> <li>As a senior member of the team, you'll use both technical and relational skills to lead large scale projects to completion</li> </ul><br><p><strong>Benefits</strong></p><br><p><strong>This is up for you</strong></p><ul> <li>Opportunity to build an enterprise cloud backend from scratch using modern technologies and frameworks</li> <li>Take on a key role within our international an entrepreneurial working environment</li> <li>Competitive salary and an awesome work environment with outstanding team events</li> </ul><p><strong>Are you ready for the next challenge? </strong>Grow with us and shape the future of Silexica! To apply please upload your CV, your motivation for this position and outline your availability via our recruiting system.</p><p>For more information about SILEXICA please visit <a href='https://workable.com/nr?l=https%3A%2F%2Fwww.silexica.com%2Fcareers%2F' rel='nofollow'>https://www.silexica.com/careers/</a></p>                    </div>                            <h2>                About Silexica GmbH            </h2>            <div><p>Silexica is afast-growing software company that helps manufacturers of embedded systems,such as smartphones, to increase their device performance by effectiveutilization of the underlying multicore architecture. We are incrediblypassionate about revolutionizing embedded parallel programming. We strive toconstantly improve our software development tools, bringing togetherinnovation, creativity and advanced software development principles.<br></p>            </div>        ",
    "urlFetchPending": false,
    "published": "May 7, 2018 6:13:51 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "FxcmhCMFRtS1hmafbPAhfA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/9635-senior-staff-software-engineer-remote-availability",
    "title": "Senior Staff Software Engineer (REMOTE AVAILABILITY)",
    "content": "Senior Staff Software Engineer (REMOTE AVAILABILITY) - Jobmote<div><div><h2>Senior Staff Software Engineer (REMOTE AVAILABILITY)</h2><h5>John Deere</h5></div></div><div><div><div><div></div></div><div><div><div><p>There are 7 billion people on this planet. And by 2050, there will be 2 billion more... many moving into urban centers at an unprecedented rate. Making sure there is enough food, fiber and infrastructure for our rapidly growing world is what we're all about at John Deere. And it's why we're investing in our people and our technology like never before in our 175-year history. Here the world's brightest minds are tackling the world's biggest challenges. If you believe one person can make the world a better place, we'll put you to work. RIGHT NOW. </p><p>Primary Location: United States (US) - Illinois (US-IL) - Moline<br>Function: 5867<br>Title: Senior Staff Software Engineer (REMOTE AVAILABILITY) - 39618 </p><p>*<em>_</em> * * This position is currently eligible for remote teleworking. The arrangement may be delayed for training or other job acclimation purposes, and remains subject to change._* * * ** </p><p><strong>Note: The physical location for this position can be at any of the following locations: Waterloo, IA; Des Moines, IA; Champaign, IL; Moline, IL; or Cary, NC</strong> </p><p><strong>Your Responsibilities</strong> </p><p>As a <strong><em>Senior Staff Software Engineer</em></strong> at John Deere, you will create software architectures, define algorithms, and work to develop software modules for our most sophisticated control and automation features. In addition, you will:</p><ul><li>Provide technical leadership and direction to the development team</li><li>Define subsystem interface requirements</li><li>Translate system requirements into logical design</li><li>Lead the creation of the next generation vehicle architecture<strong>US Visa sponsorship IS available for this position.</strong><br></li></ul><p><strong>What Skills You Need</strong>- 10 or more years of production embedded software/controls development including model based software development (ex. Matlab/Simulink/Stateflow/Embedded Coder)- 10 or more years of Embedded C/C++ software experience (hand-code)</p><ul><li>Ability and willingness to travel up to 25% (both domestic and internationally)<strong>What Makes You Stand Out</strong><br></li></ul><p>Other areas of experience or interest that will help us place you on the right team include:- Experience with AUTOSAR architecture, concepts, tools and production implementation- Experience with CAN and other vehicle buses- Experience working in an Agile environment as part of a Scrum team- Qt development experience- Experience working in global teams- Experience with requirements gathering tools (ex. PREEvision, PTC Integrity, SysML Tools, etc.)<strong>Education <em>(or equivalent work experience)</em></strong>- Bachelor's Degree in Engineering- Masters or PhD in Electrical or Computer Engineering<strong>What You'll Get</strong> </p><p>At John Deere, you are empowered to create a career that will take you to where you want to go. Here, you'll enjoy the freedom to explore new projects, the support to think outside the box and the advanced tools and technology that foster innovation and achievement. We offer comprehensive relocation and reward packages to help you get started on your new career path. Click here to find out more about our Total Rewards Package. </p><p>The information contained herein is not intended to be an exhaustive list of all responsibilities and qualifications required of individuals performing the job. The qualifications detailed in this job description are not considered the minimum requirements necessary to perform the job, but rather as guidelines. </p><p>John Deere is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, sex, age, sexual orientation, gender identity or expression, status as a protected veteran, or status as a qualified individual with disability. </p><p></p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "May 7, 2018 10:22:59 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "c",
      "embedded"
    ]
  },
  {
    "id": "dar9EEwRRjGVrjgRqrIxCg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16969624",
    "title": "Resin.io | Data / Software / Finance Engineer | REMOTE | FULL-TIME | https://resin.io",
    "content": "<div>                  <span>Resin.io | Data / Software / Finance Engineer | REMOTE | FULL-TIME | <a href='https://resin.io' rel='nofollow'>https://resin.io</a><p>Resin.io is solving the myriad problems that come up when developers trying to manage software on thousands of intelligent devices in edge computing/iot/embedded scenarios. Our customers are working on everything from self-driving trucks to drones to sea turtles with cameras on them to smart buildings and smart everything else. We've pioneered bringing linux containers to ARM devices, and have built a complete solution around that, including an OS, cloud services, a beautiful UX, and of course, etcher.io.</p><p>We are looking for a person with a solid combination of Data, Finance, and Software engineering skills to work directly with the founders on building an end-to-end data &amp; forecasting model for the whole company, tying together product metrics, financial data, revenues and expenditures, as well as team data &amp; metrics. The resulting model should give high-level visibility into any problem areas and allow highly accurate scenario forecasting into the future.</p><p>If that sounds like a project you'd love to dive into, you're detail-oriented and believe that everything is systems all the way down, drop us a line at join4data@resin.io with a CV and a story of how you used data and/or code to solve a problem people wouldn't expect can be solved that way.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "May 1, 2018 9:09:22 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "ZfW_OzP4RguKz3nmThCCxg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/8128-senior-software-engineer-open-to-remote",
    "title": "Senior Software Engineer (OPEN TO REMOTE)",
    "content": "Senior Software Engineer (OPEN TO REMOTE) - Jobmote<div><div><h2>Senior Software Engineer (OPEN TO REMOTE)</h2><h5>GoDaddy</h5></div></div><div><div><div><div></div></div><div><div><div><p><strong>About GoDaddy</strong> </p><p>GoDaddy powers the world's largest cloud platform dedicated to small, independent ventures. With nearly 17 million customers worldwide and over 73 million domain names under management, GoDaddy is the place people come to name their idea, build a professional website, attract customers and manage their work. Our mission is to give our customers the tools, insights and the people to transform their ideas and personal initiative into success. To learn more about the company visit . </p><p>Are you a passionate developer who lives on the command line, eats open source for breakfast, and wants to do work that impacts millions of customers? We want you! </p><p>We are a technology group, working to develop and advance the best technology solutions available today. While this is an individual contributor role, you'll be involved in many aspects- helping evolve our existing architecture, working with teams to improve operations, and implementing new features and functionality. </p><p><strong>What is the Job:</strong>- Design, implement, and deploy highly scalable and reliable systems and applications for the next generation of Media Temple products and services- Optimize existing systems for performance, scalability, reliability, and maintainability- Collaborate with architects, engineers, and business owners to provide best possible solutions<strong>Requirements:</strong>- BS or Master's degree in CS/CE or equivalent work experience- 3-7 years of recent hands-on coding and software design- The ability to solve complex software performance problems and architectural challenges, both independently and in team environments- Proven programming ability in Perl OR Python- Competency in Linux or Unix-like operating systems- Willingness to learn new technologies and programming languages for given task- A track record of execution and completing projects on time- Solid OOP and software design knowledge- Good communication skills- A sense of humor… seriously!<strong>Additional Desired Skills:</strong>- Relational &amp; NoSQL databases (MySQL, PostgreSQL, MongoDB, Cassandra, …)- Experience in Configuration Management (Puppet, Ansible, etc..)- Experience with software engineering best practices (e.g. unit testing, source control, code reviews, design documentation)- Designing, Implementing and consuming RESTful APIs.- Working in and optimizing large code bases- You find satisfaction in a job well done and want to solve head-scratching challenges<strong>What's in it for you:</strong>- Competitive salary- Full health, dental, vision, life, and disability insurance- 401(k) matching- Equity- &quot;Freeloader&quot; Lunch Fridays and a stacked kitchen to keep the engine fueled- VPN Days- Unlimited PTO- Flexible work schedules- Tuition Reimbursement- Ping-pong, pool table, monthly happy hours, and other fun events- Work with smart people in a great company cultureNo visa sponsorship available for this position. </p><p>GoDaddy is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law. GoDaddy will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements. </p><p>If you need assistance completing an application for a position with us, please reach out to our Recruiting Team at </p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "Apr 28, 2018 10:24:45 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "i76m5TWVSuWBf3pcU9na4Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/secured-universe/jobs/69253-virtualization-software-engineer",
    "title": "Virtualization Software Engineer",
    "content": "<div><h2>Virtualization Software Engineer at Secured Universe</h2><div>San Diego, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>C++, Java, C, Embedded System Design, ARM Assembly, X86 Assembly/machine Code, Embedded C/C++, Embedded Firmware Development</div><div>Compensation</div><div>$40K–$120K<br>0.0%–5.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Do you know KVM/XEN/QEMU inside and out?  Think you have what it takes to join a team creating a new light weight hypervisor?  </p><p>Deep level software engineering experience required for this one. </p><p>We are looking for candidates that know the Intel &amp; ARM instruction sets with embedded experience.  </p><p>If you dream in HEX and want to be challenged, please apply.</p></div>",
    "urlFetchPending": false,
    "published": "Apr 17, 2018 8:36:02 AM",
    "tags": [
      "ARM Assembly",
      "C",
      "C++",
      "Embedded C/C++",
      "Embedded Firmware Development",
      "Embedded System Design",
      "Full Time",
      "Java",
      "REMOTE1/100",
      "Remote OK",
      "San Diego",
      "Software Engineer",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/unknown",
      "X86 Assembly/machine Code"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "IY27NdzcRI6nW6BfitoYwQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16743193",
    "title": "Airtame (https://airtame.com) | Copenhagen, Denmark | Full-time, Onsite/Remote",
    "content": "<div>                  <span>Airtame (<a href='https://airtame.com' rel='nofollow'>https://airtame.com</a>) | Copenhagen, Denmark | Full-time, Onsite/Remote<p>Airtame is a fast-growing startup. Our wireless streaming solution helps people work better. We are based in windy Copenhagen, but have an office in New York that takes care of our U.S. customers. We're currently hiring:</p><p>* Senior Embedded Linux Engineer - Copenhagen, Denmark or Europe (<a href='https://airtame.com/jobs?gh_jid=4010452002' rel='nofollow'>https://airtame.com/jobs?gh_jid=4010452002</a>)</p><p>* Software Engineer in Test - Copenhagen, Denmark or Europe (<a href='https://airtame.com/jobs?gh_jid=4012067002' rel='nofollow'>https://airtame.com/jobs?gh_jid=4012067002</a>)</p><p>* Web Developer - Copenhagen, Denmark (<a href='https://airtame.com/jobs?gh_jid=4017568002' rel='nofollow'>https://airtame.com/jobs?gh_jid=4017568002</a>)</p><p>Our talented engineers are given significant ownership and responsibility over projects. We value rapid iteration, continuous integration and testing, and we are serious about producing high-quality, maintainable software. Frequent code reviews, linting, and pairing are all integral components of our engineering culture. We encourage experimenting with new technologies and constantly challenge ourselves to improve our code, processes, and systems.</p><p>You can read a bit about our values on our Company Culture Favro Board: <a href='https://favro.com/widget/2114a98cde73c1145a93bd8e/28429a244982e81373559868' rel='nofollow'>https://favro.com/widget/2114a98cde73c1145a93bd8e/28429a2449...</a></p><p>We sponsor work visas for non-EU applicants.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 1:00:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "wQoYu37ER3KQrgsv10P-bw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/136187/senior-full-stack-dev-with-ruby-python-react-analytics-fire?a=JFIBXryxPKo",
    "title": "SENIOR FULL-STACK DEV WITH RUBY/PYTHON/REACT -- 100% REMOTE, FLEXIBLE HOURS at Analytics Fire  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong><strong>Job Description</strong></strong></p><p><span>Analytics Fire builds custom software for the solar power industry. We’re looking for a senior full-stack developer with a willingness to acquire deep expertise around Ruby, Python, and React.js, in order to help us expand to support additional new high-tech sectors.</span></p><p><span>Analytics Fire is a small, distributed team working on a range of interesting projects. For example, last year we worked on a scalable IoT platform for utility grade solar power plants, a sales and design tool for residential solar, and a machine-learning powered autonomous cleaning robot. We’re looking for a fun, reliable, and highly collaborative, senior dev to join our team.</span></p><p><span>For reference, here is a list of technologies and tools we are currently actively using on a day-to-day basis:</span></p><ul><li><span>Front-end: JavaScript / React / Angular</span></li><li><span>Back-end: Ruby / Python / Node.js</span></li><li><span>Embedded (IoT): C, Embedded Linux, MQTT</span></li><li><span>Embedded (robotics): C/C++, ROS</span></li><li><span>Modern software techniques: RESTful APIs, SOA, PaaS, etc</span></li><li><span>Agile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc</span></li><li><span>Occasionally we need to do a small amount of work around: SFDC, iOS, Android, ARKit</span></li></ul><p><span>This is a remote position. We’re flexible about location and hours, so long as your working hours are in a very heavily US-overlapping time zone (eg: North America, Central America, South America, etc). We’re a really great match for a senior dev in a US-overlapping timezone who wants to work hard on interesting projects, while also having flexibility around time and geography.</span></p><p><strong><strong>Skills &amp; Requirements</strong></strong></p><p><span>Ideally, you should have 5+ years commercial full stack development, ideally within a startup environment. You should be comfortable autonomously driving your own high quality / high velocity contributions using a range of technologies.</span></p><p><span>We work with a variety of technologies, but are currently specifically looking for someone that has or can obtain expert level skills around Python, Ruby, and React.js.</span></p>                    </div>                            <h2>                About Analytics Fire            </h2>            <div><p><span>Analytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.</span></p><p><span>“Our goal founding, Analytics Fire, was to create the engineering department that we always dreamed of working for. Our dream is to be able to spend our time working on interesting problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”</span></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote                            </div>                            <div>                                 Flexible Schedule                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TECH1/frontend",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "embedded",
      "frontend"
    ]
  },
  {
    "id": "LU7FRaz6QF2XpMWO8M5gGQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/67140/senior-firmware-engineer-for-funded-startup-focused-on-eliminating-fuel-poverty-at-switchee-ltd/",
    "title": "Senior Firmware Engineer for funded startup focused on eliminating fuel poverty",
    "content": "Opportunity for a Senior Firmware Engineer to join a high-growth technology start-up focused on eliminating fuel poverty and improving living standards in social housing. <br /><br />Role: Senior Firmware Engineer, Switchee Ltd<br />Reporting to: Head of Product<br />Location: Camden, London<br /><br />*Our mission*<br /><br />At Switchee, we believe that everyone deserves to live in a decent home and that the environments we inhabit have a massive influence on our ability to enjoy life and prosper. <br />One in five households in the UK live in social housing, a sector with the right values at its core but that has historically struggled to deploy innovations in the home. Many residents still can’t afford to heat their homes and live in cold, mouldy properties they can’t be proud of.  <br />We believe that radical innovation in internet connected technology can ensure that every resident, every day, is living in a home that allows them to succeed. That’s why our products are built not just on great technology, but on an understanding of what people want from the space they live in.  <br />This approach led us to reimagine the most mundane household object, a thermostat, into a product that automagically reduces energy bills, looks great and offers control to those who want it. <br />We are also revolutionising the way social landlords manage their housing stock with an obsessively tailored SAAS property dashboard and handy alerts on things like when the boiler is going to break. <br />Our next project is to build the ultimate connected hub for the social home. It’s going to revolutionise the way residents interact with their properties and landlords manage their homes. <br /><br />*Our journey*<br /><br />We may be only three years old, but it’s already been quite a ride. Our first product, the internet connected Switchee thermostat is already in 35 of the biggest housing providers in the UK. <br />We’re growing 100% year on year and are backed by some of the best-known investors in technology and social impact. We are a small team of 15 passionate and ambitious people driven by a collective desire to make a positive impact in the housing sector, both for residents and landlords. <br /><br />We are looking for an outstanding individual to join our firmware department, which promises to grow considerably over the coming years. Your commitment to our values and mission are paramount. <br /><br />*Your responsibilities*<br /><br />As a junior firmware engineer it will be your responsibility to design and implement firmware solutions that run in an optimized manner on our hardware platform. The hardware platform comprises an ST ARM microcontroller, sensors, and advanced radio communications to deliver the best smart thermostat solution for social housing.   <br />We are looking for someone with drive and a creative mind capable of solving complex problems in a neat, simple and reliable fashion. You will be part of the engineering team and work closely with the current firmware team.<br /><br />*Your experience*<br /><br />As a senior firmware engineer, it will be your responsibility to architect, design and implement firmware solutions that run on our hardware platform. You will be working on a new hardware platform that comprises an ST ARM microcontroller, sensors, and advanced radio communications.  You will interface with multiple teams including but not limited to hardware design, cloud software, algorithm and software testing to develop the best firmware solution for an overall eco-system. <br /><br />You will also contribute to develop excellent software practices (lead code reviews, design reviews, release mechanism). You will analyse and enhance efficiency, stability and scalability of system resources as well to deliver the best software solution for our product. We are looking for someone with drive and a creative mind capable of solving complex problems in a neat, simple and reliable fashion.<br /><br />Your experience<br />We firmly believe extraordinary people can come from a wide range of places – but we wouldn’t be surprised if the person who gets this role has:<br /><br />•     8+ years of experience in embedded software engineering<br />•     Master/bachelor degree in Computer Science or Engineering from a leading university<br />•     Solid programming experience in C / C++ and preferably scripting languages like python<br />•     Experience in hands-on development and troubleshooting on embedded targets using oscilloscope, logic analyser and jtag.<br />•     Experience with common interfaces like SPI,I2C,UART,USB, DMA, Flash and GPIO’s.<br />•     Knowledgeable in use of tool chains and debug tools like GCC<br />•     Experience with ARM based processors (Specifically the Cortex M family).<br />•     Knowledge of reading schematics and data sheets for components.<br />•     Familiarity with software configuration management tools, defect tracking tools, and peer review like Jira/GIT and confluence.<br />•     Experience working with typical IoT communication protocol like BT, Zigbee, ZWave or Sub-GHz communication<br /><br />*You*<br /><br />We are a diverse bunch of people at Switchee. That said, there are some characteristics we always look for: <br /> <br />•     You deeply care about Switchee’s mission; you have a desire to build something revolutionary, that will disrupt an industry, and positively impact ordinary people’s lives.<br /><br />•     You care about the environment, are interested in energy efficiency and have thought about the challenges and opportunities posed by an evolving domestic energy market<br /><br />•     You like technology and neat solutions to complex problems<br /><br />•     You thrive on challenge and change; you naturally gravitate to the hardest questions first and love thinking differently to solve them. <br /><br />•     You are biased towards action and you’re happiest when you’re ‘getting stuff done’.<br /><br />•     You’re open, positive & straightforward. You’re not afraid to stand up for your convictions, even when it’s hard to do so.<br /><br />•     You delight in your colleagues’ successes and thrive on your failures; you grasp any opportunity for learning and constantly seek to improve.<br /> <br />*Life at Switchee*<br /> <br />We like to keep things simple and flexible at Switchee and consider you to be joining our family. We don’t currently track holidays so you’re free to take as much as you need. We often work remotely but are sensitive to the needs of our colleagues. <br /> <br />We socialise together with regular outings in London and an annual “working remotely” trip where you have the option (but not obligation) to join us in working from a fun location. <br /> <br />If we end up working together, we can offer a competitive salary and a generous stake in the company. <br /> <br />If you’d like to apply please submit a CV and cover letter to the CEO, Adam Fudakowski by emailing talent@switchee.co",
    "urlFetchPending": false,
    "published": "Mar 15, 2018 10:11:57 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "LgYfRuRTT9-ccoTcSvManA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/67139/senior-hardware-engineer-for-funded-start-up-focused-on-eliminating-fuel-poverty-at-switchee-ltd/",
    "title": "Senior Hardware Engineer for funded start-up focused on eliminating fuel poverty",
    "content": "Opportunity for a Senior Hardware Engineer to join a high-growth technology start-up focused on eliminating fuel poverty and improving living standards in social housing. <br /><br />Role: Senior Hardware Engineer, Switchee Ltd<br />Reporting to: Head of Product<br />Location: Camden, London<br /><br />*Our mission*<br /><br />At Switchee, we believe that everyone deserves to live in a decent home and that the environments we inhabit have a massive influence on our ability to enjoy life and prosper. <br />One in five households in the UK live in social housing, a sector with the right values at its core but that has historically struggled to deploy innovations in the home. Many residents still can’t afford to heat their homes and live in cold, mouldy properties they can’t be proud of.  <br />We believe that radical innovation in internet connected technology can ensure that every resident, every day, is living in a home that allows them to succeed. That’s why our products are built not just on great technology, but on an understanding of what people want from the space they live in.  <br />This approach led us to reimagine the most mundane household object, a thermostat, into a product that automagically reduces energy bills, looks great and offers control to those who want it. <br />We are also revolutionising the way social landlords manage their housing stock with an obsessively tailored SAAS property dashboard and handy alerts on things like when the boiler is going to break. <br />Our next project is to build the ultimate connected hub for the social home. It’s going to revolutionise the way residents interact with their properties and landlords manage their homes. <br /><br />*Our journey*<br /><br />We may be only three years old, but it’s already been quite a ride. Our first product, the internet connected Switchee thermostat is already in 35 of the biggest housing providers in the UK. <br />We’re growing 100% year on year and are backed by some of the best-known investors in technology and social impact. We are a small team of 15 passionate and ambitious people driven by a collective desire to make a positive impact in the housing sector, both for residents and landlords. <br />We are looking for an outstanding individual to lead our hardware department, which promises to grow considerably over the coming years. Your commitment to our values and mission are paramount. <br /><br />*Your responsibilities*<br /><br />As a senior hardware engineer, it will be your responsibility to design a new hardware platform. In your role, you will be involved in all aspects of EE hardware design including system definition, board circuit design and validation. <br />You will be working on a new hardware platform that comprises an ARM microcontroller, sensors, and advanced radio communications.  You will interface with multiple teams including but not limited to the embedded firmware team, the cloud software team and the algorithm team to design the most suitable solution for an overall eco-system. In addition, you will contribute to the development of production test equipment to enable testing of the hardware when product go to production.    <br />We are looking for someone with drive and a creative mind capable of solving complex problems in a neat, simple and reliable fashion. To be successful you need to be highly motivated and detailed oriented while showing highest standards of responsibilities.<br /><br />*Your experience*<br /><br />We firmly believe extraordinary people can come from a wide range of places – but we wouldn’t be surprised if the person who gets this role has:<br /><br />•    Master/bachelor degree in electrical engineering from a leading university    <br />•    5+ years of experience in consumer product design; <br />•    5+ years of experience with system level design including circuit design, system bring up, integration & debug <br />•    Knowledge of processor architecture, digital circuit design and comms protocols such as I2C, UART, SPI, <br />•    Knowledge of mixed-signal board level design;<br />•    Experience developing robust designs for ESD/EMI immunities and RF de-sensitization;<br />•    Experience integrating RF technologies such as radio/GSM; <br />•    Experience leading and driving design development from schematic capture, PCB layout through assembly;<br />•    Must enjoy being hands-on in the lab and want to be in the details (soldering, oscilloscopes, data acquisition)<br />•    Experience with Altium, Cadence, OrCAD, or Allegro<br />•    Experience working with typical IoT communication protocol like BT, Zigbee, ZWave or Sub-GHz comms<br /><br />*You*<br /><br />We are a diverse bunch of people at Switchee. That said, there are some characteristics we always look for: <br /><br />•    You deeply care about Switchee’s mission; you have a desire to build something revolutionary, that will disrupt an industry, and positively impact ordinary people’s lives.<br /><br />•    You care about the environment, are interested in energy efficiency and have thought about the challenges and opportunities posed by an evolving domestic energy market<br /><br />•    You like technology and neat solutions to complex problems<br /><br />•    You thrive on challenge and change; you naturally gravitate to the hardest questions first and love thinking differently to solve them. <br /><br />•    You are biased towards action and you’re happiest when you’re ‘getting stuff done’.<br /><br />•    You’re open, positive & straightforward. You’re not afraid to stand up for your convictions, even when it’s hard to do so.<br /><br />•    You delight in your colleagues’ successes and thrive on your failures; you grasp any opportunity for learning and constantly seek to improve.<br /><br />*Life at Switchee*<br /><br />We like to keep things simple and flexible at Switchee and consider you to be joining our family. We don’t currently track holidays so you’re free to take as much as you need. We often work remotely but are sensitive to the needs of our colleagues. <br /><br />We socialise together with regular outings in London and an annual “working remotely” trip where you have the option (but not obligation) to join us in working from a fun location. <br /><br />If we end up working together, we can offer a competitive salary and a generous stake in the company. <br /><br />If you’d like to apply please submit a CV and cover letter to Adam Fudakowski",
    "urlFetchPending": false,
    "published": "Mar 15, 2018 10:03:45 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "wy5G0c7cRnSQPJGMxzZDcg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/67007/junior-firmware-engineer-for-funded-start-up-focused-on-eliminating-fuel-poverty-at-switchee-ltd/",
    "title": "Junior Firmware Engineer for funded start-up focused on eliminating fuel poverty",
    "content": "Opportunity for a Junior Firmware Engineer to join a high-growth technology start-up focused on eliminating fuel poverty and improving living standards in social housing. <br /><br />Role: Junior Firmware Engineer, Switchee Ltd<br />Reporting to: Head of Product<br />Location: Camden, London<br /><br />*Our mission*<br /><br />At Switchee, we believe that everyone deserves to live in a decent home and that the environments we inhabit have a massive influence on our ability to enjoy life and prosper. <br />One in five households in the UK live in social housing, a sector with the right values at its core but that has historically struggled to deploy innovations in the home. Many residents still can’t afford to heat their homes and live in cold, mouldy properties they can’t be proud of.  <br />We believe that radical innovation in internet connected technology can ensure that every resident, every day, is living in a home that allows them to succeed. That’s why our products are built not just on great technology, but on an understanding of what people want from the space they live in.  <br />This approach led us to reimagine the most mundane household object, a thermostat, into a product that automagically reduces energy bills, looks great and offers control to those who want it. <br />We are also revolutionising the way social landlords manage their housing stock with an obsessively tailored SAAS property dashboard and handy alerts on things like when the boiler is going to break. <br />Our next project is to build the ultimate connected hub for the social home. It’s going to revolutionise the way residents interact with their properties and landlords manage their homes. <br /><br />*Our journey*<br /><br />We may be only three years old, but it’s already been quite a ride. Our first product, the internet connected Switchee thermostat is already in 35 of the biggest housing providers in the UK. <br />We’re growing 100% year on year and are backed by some of the best-known investors in technology and social impact. We are a small team of 15 passionate and ambitious people driven by a collective desire to make a positive impact in the housing sector, both for residents and landlords. <br />We are looking for an outstanding individual to join our firmware department, which promises to grow considerably over the coming years. Your commitment to our values and mission are paramount. <br /><br />*Your responsibilities*<br /><br />As a junior firmware engineer it will be your responsibility to design and implement firmware solutions that run in an optimized manner on our hardware platform. The hardware platform comprises an ST ARM microcontroller, sensors, and advanced radio communications to deliver the best smart thermostat solution for social housing.   <br />We are looking for someone with drive and a creative mind capable of solving complex problems in a neat, simple and reliable fashion. You will be part of the engineering team and work closely with the current firmware team.<br /><br />*Your experience*<br /><br />We firmly believe extraordinary people can come from a wide range of places – but we wouldn’t be surprised if the person who gets this role has:<br /> <br />•      Master/bachelor degree in Computer Science or Engineering from a leading university      <br />•      3+ years experience in developing for embedded systems at application level; <br />•      3+ years experience with driver and board-level software development<br />•      3+ years experience with board bring up and systems debugging<br />•      Proven ability to drive a subsystem or product to completion<br />•      Experience developing firmware in a bare-metal environment.<br />•      Familiarity with debugging tools such as bus analyzers and oscilloscopes<br />•      Solid programming experience in C / C++ and preferably scripting languages like python<br />•      Experience in hands-on development and troubleshooting on embedded targets using oscilloscope, logic analyser and jtag.<br />•      Experience with common interfaces like SPI,I2C,UART,USB, DMA, Flash and GPIO’s.<br />•      Knowledgeable in use of tool chains and debug tools like GCC<br />•      Experience with ARM based processors (Specifically the Cortex M family).<br />•      Knowledge of reading schematics and data sheets for components.<br />•      Familiarity with software configuration management tools, defect tracking tools, and peer review like Jira/GIT and confluence.<br />•      Experience working with typical IoT communication protocol like BT, Zigbee, ZWave or Sub-GHz communication<br /> <br />*You*<br /><br />We are a diverse bunch of people at Switchee. That said, there are some characteristics we always look for: <br /> <br />•     You deeply care about Switchee’s mission; you have a desire to build something revolutionary, that will disrupt an industry, and positively impact ordinary people’s lives.<br /><br />•     You care about the environment, are interested in energy efficiency and have thought about the challenges and opportunities posed by an evolving domestic energy market<br /><br />•     You like technology and neat solutions to complex problems<br /><br />•     You thrive on challenge and change; you naturally gravitate to the hardest questions first and love thinking differently to solve them. <br /><br />•     You are biased towards action and you’re happiest when you’re ‘getting stuff done’.<br /><br />•     You’re open, positive & straightforward. You’re not afraid to stand up for your convictions, even when it’s hard to do so.<br /><br />•     You delight in your colleagues’ successes and thrive on your failures; you grasp any opportunity for learning and constantly seek to improve.<br /> <br />*Life at Switchee*<br /> <br />We like to keep things simple and flexible at Switchee and consider you to be joining our family. We don’t currently track holidays so you’re free to take as much as you need. We often work remotely but are sensitive to the needs of our colleagues. <br /> <br />We socialise together with regular outings in London and an annual “working remotely” trip where you have the option (but not obligation) to join us in working from a fun location. <br /> <br />If we end up working together, we can offer a competitive salary and a generous stake in the company. <br /> <br />If you’d like to apply please submit a CV and cover letter to the CEO, Adam Fudakowski by emailing talent@switchee.co",
    "urlFetchPending": false,
    "published": "Mar 12, 2018 4:09:09 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "embedded"
    ]
  }
]
}
