{
 "items": [
  {
    "id": "Bo-Xb1b3S5OggO3geVO12w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/144382/firmware-developer-engineer-wearable-based-on-kenkou-gmbh?a=Mq7grgObDbO",
    "title": "Firmware Developer / Engineer - Wearable based on ARM Cortex M at Kenkou GmbH (Berlin, Germany) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Embedded Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Digital Health</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span>Kenkou GmbH is a Berlin based startup in the eHealth sector with the goal of creating consumer oriented products to help reduce heart related diseases worldwide.</span></p><p><span>We offer a rewarding work environment with global opportunities in a small company with an employee-focused atmosphere. We are currently searching for a dynamic freelance Firmware Engineer to join our Product Development team to work remotely or on location.</span></p><p><strong><span>Essential</span></strong></p><p><span>Embedded C</span></p><p><span>GCC Compiler toolchain and multi target makefiles.</span></p><p><span>Nordic nRF5 SDK and Soft Device or another ARM Cortex M microcontroller</span></p><p><span>Custom BLE Services.</span></p><p><span>Experience working remotely unless you can work on site in Berlin.</span></p><p><span>Must live in a time zone between UTC - 6 and UTC + 7. </span></p><p><strong><span>Desirable</span></strong></p><p><span>Testing and CI for embedded devices.</span></p><p><span>Real time embedded systems development.</span></p><p><span>Secure BLE communications</span></p><p><span>Sensor fusion.</span></p><p><span>Real time compression.</span></p><p><span>Bash and Python Scripting</span></p>                    </div>                            <h2>                About Kenkou GmbH            </h2>            <div><p>KENKOU is providing next generation soft- and hardware for the health sector. We are dedicated to change the rate of cardiovascular diseases for the better and&nbsp;to build wonderful products.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Free time for your own projects                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 10:59:50 PM",
    "tags": [
      "DBG_TECH1:k_t_w:arm_embedded_16",
      "DBG_TECH1:k_t_w:c_c_5",
      "DBG_TECH1:k_t_w:embedded_c_4",
      "DBG_TECH1:k_t_w:embedded_embedded_32",
      "DBG_TECH1:k_t_w:gcc_c_8",
      "DBG_TECH1:k_t_w:microcontroller_embedded_8",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=2, dotnet=0, c=17, mobile=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=56, frontend=0}",
      "REMOTE1_100",
      "TECH1_embedded",
      "TECH2_arm",
      "TECH2_c",
      "TECH2_embedded",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "arm",
      "c",
      "embedded"
    ]
  },
  {
    "id": "5GGHNvQxRy6dyJQu3dsyag",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/143072/field-application-engineer-consultant-for-iot-proemion?a=LYSsZLEC1OM",
    "title": "Field Application Engineer / Consultant for IoT Tech Company (m/f) at PROEMION (Fulda, Deutschland) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Embedded Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Services, Information Technology, Telematics</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Privat</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We give our customers the technology they need to globally transmit and analyze CAN-based telemetry data of mobile industrial machinery and therefore boost their efficiency.</p><p>We are at the forefront of the IoT/Telematics revolution and are looking for an enthusiastic <strong>Field Application Engineer / Consultant</strong> for our <strong>Embedded Systems</strong> <strong>and/or</strong> <strong>Cloud</strong> <strong>Web Services</strong>. We offer the position on-site in Fulda, Germany (relocation support offered) or as a full-time remote position at the earliest possible date.</p><p>You will be working closely with our sales and engineering teams to map customer business and to adapt our connectivity solution to fully integrate it into our customers’ value chain. Required is a combination of strong software (and hardware technical skills) plus excellent communication skills. Strong debug skills are essential as is the ability to time manage and service multiple large customers concurrently.</p><p><strong>Skills &amp; Requirements</strong></p><p><strong>Your Role</strong></p><ul><li>You act as a bridge between our internal engineering teams and our customers to develop technical solutions based on our products and services</li><li>You ensure the on-site technical integration of our telematics solutions at the customer to enable solution integration and issue resolution</li><li>You discuss new product definitions with the customer such as the implementation of custom protocols or the integration of web applications via our APIs</li><li>You are able to build and demonstrate proof-of-concepts that meets or exceeds customer business needs</li><li>You create the necessary technical documentation to support the customer</li><li>You consult our customers on best practices during the roll-out of our connectivity solution</li></ul><p><strong>Your Skills and Personality</strong></p><ul><li>Bachelors' or Masters' degree in engineering discipline; computer science, computer engineering or electrical engineering preferred</li><li>Minimum 2 years' related consultancy experience in a technical environment</li><li>Highly technical problem solver who understands system architecture, hardware and software interaction</li><li>Technical knowledge of Telematics/IoT/Global Connectivity applications and market, with a proven experience in such system development</li><li>Familiarity with CAN bus systems and microcontroller based devices and/or big data technologies and web Services</li><li>You are willing to travel and show a great business sense</li><li>Excellent team member with great communication and interpersonal skills and ability to progress in autonomy</li><li>You are able to work effectively in a high pressure environment</li></ul>                    </div>                            <h2>                About PROEMION            </h2>            <div><p><strong>About Proemion</strong></p><p>Since 1987 Proemion has delivered CAN devices and connectivity solutions for the most demanding industrial applications. The world’s most respected industrial equipment companies rely on Proemion, to design and build top-notch telematics solutions that enhance performance and safety. On the embedded side, we manufacture Telematics devices to collect and transmit CAN-based telemetry data. On the web services side, we use the latest Big Data technologies to process, analyze, and serve billions of data points through our APIs and web portal.</p><p><strong>We offer you</strong></p><ul><li>A dynamic environment, short communication ways and a flat hierarchy in an international Team</li><li>Room for innovative work in a highly attractive technology field</li><li>An attractive salary and development opportunities</li><li>Modern premises centered in the middle of Germany featuring lounge, kicker-table, pool table, Team events, additional allowance for a Fitness Club membership and child care, flextime, free soft drinks and fruit</li></ul><p>Are you curious?</p><p>We’re looking forward to your application via our career portal (<a href='https://career.proemion.com' rel='nofollow'>https://career.proemion.com</a>)&nbsp;or via mail (<a href='mailto:career@proemion.com' rel='nofollow'>career@proemion.com</a>)!</p><p><strong>Let’s build something great together!</strong></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive salary                            </div>                            <div>                                 Billiard table                            </div>                            <div>                                 Mentoring programm                            </div>                            <div>                                 Modern development environment                            </div>                            <div>                                 Team events                            </div>                            <div>                                 Sport sponsoring                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 10:59:50 PM",
    "tags": [
      "DBG_TECH1:k_t_w:boost_c_8",
      "DBG_TECH1:k_t_w:embedded_c_3",
      "DBG_TECH1:k_t_w:embedded_embedded_24",
      "DBG_TECH1:k_t_w:microcontroller_embedded_8",
      "DBG_TECH1:techWeightMap:{python=0, dotnet=0, c=11, mobile=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=32, frontend=0}",
      "REMOTE1_100",
      "TECH1_embedded",
      "TECH2_continuous-integration",
      "TECH2_embedded",
      "TECH2_iot",
      "TECH2_web-services",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "continuous-integration",
      "embedded",
      "iot",
      "web-services"
    ]
  },
  {
    "id": "BSFr34j6RjOgaVOb9KBF7g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/160852/senior-mechatronics-engineer-flo-cycling-llc?a=RWzHCUnmSGY",
    "title": "Senior Mechatronics Engineer at FLO Cycling LLC () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Embedded Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>B2C, Cycling, Sports</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Compensation</strong>: $100,000</p><p><strong>Openings</strong>: 1</p><p><strong>Location:</strong> Remote</p><p>Do you do your dishes? We've got a job for you (and it's not dishwashing ;-) ).</p><p>Do you put them in the sink and expect someone else to do them? Move on, please.</p><p>Do you get pissed (in a professional way) when someone else leaves their dishes in the sink? Please apply!</p><p>FLO Cycling is looking to expand our engineering group. We're looking for a smart&nbsp;mechatronics engineer who &quot;get things done.&quot; We’re interested in remote candidates in the USA.</p><p><strong>Who We're Looking For</strong></p><p>We want smart engineers! The ideal candidate is an “engineer's engineer&quot; and enjoys reading about engineering in their free time, tinkering on the weekends with side projects and staying abreast of the latest technologies in their area of expertise. We want someone with a passion for engineering.</p><p><strong>Responsibilities</strong></p><ul><li>Develop the embedded systems and firmware for hardware designs and bring them to market</li><li>Support product requirements, definition, design, optimization, validation and release processes</li><li>Work with a team to develop and release products in release cycles</li><li>Optimize power consumption</li><li>Self-manage and track development activities from a remote location</li><li>Draft diagnostic requirements for design verification and mass production testing</li><li>Structural Mechanical Design</li></ul><p><strong>Required Technology Experience</strong></p><ul><li>Embedded Systems - Experience Advanced</li><li>Firmware Design - Experience Advanced</li><li>Analog/Digital Circuit Design - Experience Advanced</li><li>Low Power Design - Experience Advanced</li><li>Bluetooth Wireless Communication - Experience Advanced</li><li>Composite and Metal Manufacturing</li></ul><p><strong>Optional Technology Experience</strong></p><ul><li>Object-Oriented Programming - Java, C#, Objective C, C++, Python, PHP</li><li>iOS and/or Android Development</li><li>GIT for Source Control</li></ul><p><strong>Work Remote</strong></p><p>We're looking for the best candidate we can find. Don't let a little thing like geography get in the way. All of our employees work remotely.</p><p><strong>Salary</strong></p><p>We're looking to hire engineers for 100k/year. If you ask for more, we'll reject your application.</p><p><strong>Perks</strong></p><p>•Unlimited Vacation</p><p>•401k Plan</p><p>•Health Plan</p><p>•Flexible Schedule</p><p><strong>Your Resume Should have:</strong></p><p>•Links to any projects you've contributed to</p><p>•Github/StackOverflow username if you'd like</p><p>•Examples of experience in the &quot;Optional Technology Experience&quot; area</p><p><strong>Let Us Know Why You Want to Work for FLO Cycling</strong></p><p>In your application let us know why you want to work with us and why you think you'd be a good fit for our company.</p><p><strong>FAQs</strong></p><p>Do I have to be a cyclist to apply?</p><p>Nope! Not everyone in the company is a cyclist. It helps if you're an active racer, but it's not required. If you are a racer or FLO Cycling user, let us know!</p><p><strong>What's unlimited vacation mean?</strong></p><p>We believe employees put out their best work when they are happy and not burnt out.</p><p>If your brain just isn't working at 3 pm, we encourage employees to go home and rest up. It does no one any good to sit and stare at the computer screen for another two hours. We don't track that time.</p><p>Employees shoot for around four weeks of REAL vacation time (no e-mail checking) but some take more, and some take less. The thing we care about is how productive you can be and how much value you can add to the company. Bottom line, we want people who are passionate and get things done. If you meet those requirements, everything else works itself out.</p><p>If however, you end up taking massive amounts of vacation, come in late, leave early and aren't producing outstanding work we're going to have a problem.</p><p><strong>Tools for the Job?</strong></p><p>Developers get the latest tricked-out MacBook Pro and a monitor.</p><p><strong>You didn't ask about education, what's required?</strong></p><p>Please put your education on your resume, but we're not going to reject someone because they don't have a degree in Computer Science. We understand that some of the best and most passionate engineers are self-taught.</p><p><strong>How long until I hear a response from you guys? What's the process?</strong></p><p>If you don't follow directions in this job posting, we will reject your application immediately. If you do follow the directions in this job posting, and we like your resume, we will schedule an introductory interview with you. Additional interviews could occur if we feel you fit our company culture.</p><p><strong>What's with the dishes analogy?</strong></p><p>Doing your dishes is a GREAT analogy for our culture. Don't leave shit around for someone else to clean up. Do your dishes.Do you see someone (including us, the Founders) making a mess? Let's discuss it (in a productive manner) so that we can nip that behavior in the bud.</p><p><strong>This is the longest job posting ever, when does it end?</strong></p><p>Right now! Congrats if you made it this far! We look forward to looking at your resume and code exercise.</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Flexible Vacation                            </div>                            <div>                                 Work Remote                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 10:59:50 PM",
    "tags": [
      "DBG_TECH1:k_t_w:android_java_1",
      "DBG_TECH1:k_t_w:android_mobile_2",
      "DBG_TECH1:k_t_w:c#_c_2",
      "DBG_TECH1:k_t_w:c#_dotnet_5",
      "DBG_TECH1:k_t_w:c++_c_8",
      "DBG_TECH1:k_t_w:c_c_5",
      "DBG_TECH1:k_t_w:embedded_c_3",
      "DBG_TECH1:k_t_w:embedded_embedded_24",
      "DBG_TECH1:k_t_w:ios_apple_1",
      "DBG_TECH1:k_t_w:ios_mobile_2",
      "DBG_TECH1:k_t_w:java_java_2",
      "DBG_TECH1:k_t_w:java_mobile_1",
      "DBG_TECH1:k_t_w:objective-c_apple_2",
      "DBG_TECH1:k_t_w:objective-c_c_2",
      "DBG_TECH1:k_t_w:objective-c_mobile_8",
      "DBG_TECH1:k_t_w:php_php_5",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=2, dotnet=5, c=20, mobile=13, nodejs=0, bigdata-ml=0, ruby=0, apple=3, java=3, gamedev=0, php=5, embedded=24, frontend=0}",
      "REMOTE1_100",
      "TECH1_c",
      "TECH1_embedded",
      "TECH2_bluetooth",
      "TECH2_embedded",
      "TECH2_firmware",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bluetooth",
      "c",
      "embedded",
      "firmware"
    ]
  },
  {
    "id": "gCc8tqD8Rauaqi7CPqOT0A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4038-software-backend-developer-cabana-blockchain",
    "title": "Software - Backend Developer @ Cabana Blockchain",
    "content": "<h2>              Software - Backend Developer<small> @ Cabana Blockchain</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-12-05 21:21</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>About Us</strong></p><p>Cabana Blockchain is a privately-owned stealth startup company that develops IoT devices which use a blockchain.</p><p>We started as an idea and a simple proof of concept. Then we were acquired and relocated to San Francisco, right in Silicon Valley. We employ creative problem solvers to work in our office and to work remotely from anywhere around the world.</p><p><strong>Our Mission</strong></p><p>There are many problems current IoT devices on the market face that we wish to solve. Using our own blockchain technology helps us achieve this.</p><p>Above all else, we value our customer’s privacy and security because a home is the most intimate place a person can be. We are a hardware company, looking to develop and sell hardware. This means that we don’t collect or store data about our customers. Our devices are designed to operate without storing customer data on our servers.</p><p>We believe that we can succeed without harvesting our customer’s data because our hardware will succeed. Each one of our devices is the result of clever engineering and fine craftsmanship. We never plan for obsolescence and the quality and testing of our products ensures that they will operate for a very long time.</p><p>The functionality of our devices is not dependent on the existence of Cabana Blockchain. Our devices will continue to operate even if we go out of business.</p><p>Cabana Blockchain uses software to run all of its devices. We are looking for Backend Developers to join our team and help us create devices that go into people’s homes.</p><p><strong>Responsibilities:</strong></p><ul><li>Work with our software team to write the code that makes our devices work</li><li>Work with our firmware engineers to help bridge the gap between software and hardware</li><li>Develop our blockchain technology</li></ul><p><strong>Requirements:</strong></p><ul><li>Bachelor’s degree (or equivalent) in software engineering or computer science</li><li>5+ years of work experience</li><li>Capable of designing APIs and software that runs on embedded devices</li><li>Experience with C++, Python, SQL, web application development</li><li>Experience with distributed computing / consensus algorithms</li><li>Knowledge of Test-driven Development and Linux servers</li><li>Able to learn blockchain technology</li></ul><p>To learn how to apply, please see our <a href='https://cabanablockchain.com/careers' rel='nofollow'>Careers</a> page.</p><p><em>Cabana Blockchain provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, gender, sexual orientation, national origin, age, disability or genetics.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 11:21:32 PM",
    "tags": [
      "DBG_TECH1:k_t_w:c++_c_8",
      "DBG_TECH1:k_t_w:embedded_c_1",
      "DBG_TECH1:k_t_w:embedded_embedded_8",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=2, dotnet=0, c=9, mobile=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=8, frontend=0}",
      "REMOTE1_100",
      "TECH1_c",
      "TECH1_embedded",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "c",
      "embedded"
    ]
  },
  {
    "id": "lCmPT2jVToiW2T5wGOaPJw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63475",
    "title": "Software Backend Developer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>About Us</strong><br><br>Cabana Blockchain is a privately-owned stealth startup company that develops IoT devices which use a blockchain.<br><br>We started as an idea and a simple proof of concept. Then we were acquired and relocated to San Francisco, right in Silicon Valley. We employ creative problem solvers to work in our office and to work remotely from anywhere around the world.<br><br><strong>Our Mission</strong><br><br>There are many problems current IoT devices on the market face that we wish to solve. Using our own blockchain technology helps us achieve this.<br><br>Above all else, we value our customer’s privacy and security because a home is the most intimate place a person can be. We are a hardware company, looking to develop and sell hardware. This means that we don’t collect or store data about our customers. Our devices are designed to operate without storing customer data on our servers.<br><br>We believe that we can succeed without harvesting our customer’s data because our hardware will succeed. Each one of our devices is the result of clever engineering and fine craftsmanship. We never plan for obsolescence and the quality and testing of our products ensures that they will operate for a very long time.<br><br>The functionality of our devices is not dependent on the existence of Cabana Blockchain. Our devices will continue to operate even if we go out of business.<br><br>----<br><br>Cabana Blockchain uses software to run all of its devices. We are looking for Backend Developers to join our team and help us create devices that go into people’s homes.<br><br><strong>Responsibilities:</strong><br><br></p><ul><li>Work with our software team to write the code that makes our devices work<br></li><li>Work with our firmware engineers to help bridge the gap between software and hardware<br></li><li>Develop our blockchain technology<br><br><strong>Requirements:</strong><br><br></li><li>Bachelor’s degree (or equivalent) in software engineering or computer science<br></li><li>5+ years of work experience<br></li><li>Capable of designing APIs and software that runs on embedded devices<br></li><li>Experience with C++, Python, SQL, web application development<br></li><li>Experience with distributed computing / consensus algorithms<br></li><li>Knowledge of Test-driven Development and Linux servers<br></li><li>Able to learn blockchain technology<br><br>To learn how to apply, please see our <a href='https://cabanablockchain.com/careers' rel='nofollow'>Careers</a> page.<br><em>Cabana Blockchain provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, gender, sexual orientation, national origin, age, disability or genetics.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 11:21:32 PM",
    "tags": [
      "DBG_TECH1:k_t_w:c++_c_8",
      "DBG_TECH1:k_t_w:embedded_c_1",
      "DBG_TECH1:k_t_w:embedded_embedded_8",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=2, dotnet=0, c=9, mobile=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=8, frontend=0}",
      "REMOTE1_100",
      "TECH1_c",
      "TECH1_embedded",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "c",
      "embedded"
    ]
  },
  {
    "id": "JZhJePxjR2y38nvKcZ0ayQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4037-hardware-firmware-engineer-cabana-blockchain",
    "title": "Hardware - Firmware Engineer @ Cabana Blockchain",
    "content": "<h2>              Hardware - Firmware Engineer<small> @ Cabana Blockchain</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-12-05 21:20</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>About Us</strong></p><p>Cabana Blockchain is a privately-owned stealth startup company that develops IoT devices which use a blockchain.</p><p>We started as an idea and a simple proof of concept. Then we were acquired and relocated to San Francisco, right in Silicon Valley. We employ creative problem solvers to work in our office and to work remotely from anywhere around the world.</p><p><strong>Our Mission</strong></p><p>There are many problems current IoT devices on the market face that we wish to solve. Using our own blockchain technology helps us achieve this.</p><p>Above all else, we value our customer’s privacy and security because a home is the most intimate place a person can be. We are a hardware company, looking to develop and sell hardware. This means that we don’t collect or store data about our customers. Our devices are designed to operate without storing customer data on our servers.</p><p>We believe that we can succeed without harvesting our customer’s data because our hardware will succeed. Each one of our devices is the result of clever engineering and fine craftsmanship. We never plan for obsolescence and the quality and testing of our products ensures that they will operate for a very long time.</p><p>The functionality of our devices is not dependent on the existence of Cabana Blockchain. Our devices will continue to operate even if we go out of business.</p><p>At Cabana Blockchain, firmware is what gives our devices intelligence. We are looking for Firmware Engineers to join our team and help us create devices that go into people’s homes.</p><p><strong>Responsibilities:</strong></p><ul><li>Work with our hardware team to design and program embedded systems</li><li>Work with our software team to bring our devices online</li></ul><p><strong>Requirements:</strong></p><ul><li>Bachelor’s degree (or equivalent) in electrical, computer, or firmware engineering</li><li>5+ years of work experience</li><li>Experience programming embedded systems in C/C++</li><li>Programming drivers for microcontroller peripherals</li><li>Using real-time operating systems</li><li>Consuming APIs on embedded systems</li></ul><p>To learn how to apply, please see our <a href='https://cabanablockchain.com/careers' rel='nofollow'>Careers</a> page.</p><p><em>Cabana Blockchain provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, gender, sexual orientation, national origin, age, disability or genetics.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 11:19:58 PM",
    "tags": [
      "DBG_TECH1:k_t_w:c++_c_8",
      "DBG_TECH1:k_t_w:c_c_5",
      "DBG_TECH1:k_t_w:embedded_c_3",
      "DBG_TECH1:k_t_w:embedded_embedded_24",
      "DBG_TECH1:k_t_w:microcontroller_embedded_8",
      "DBG_TECH1:techWeightMap:{python=0, dotnet=0, c=16, mobile=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=32, frontend=0}",
      "REMOTE1_100",
      "TECH1_embedded",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "MIQ0e74RR-GFwLnIaAhpAw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63476",
    "title": "Hardware Firmware Engineer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>About Us</strong><br><br>Cabana Blockchain is a privately-owned stealth startup company that develops IoT devices which use a blockchain.<br><br>We started as an idea and a simple proof of concept. Then we were acquired and relocated to San Francisco, right in Silicon Valley. We employ creative problem solvers to work in our office and to work remotely from anywhere around the world.<br><br><strong>Our Mission</strong><br><br>There are many problems current IoT devices on the market face that we wish to solve. Using our own blockchain technology helps us achieve this.<br><br>Above all else, we value our customer’s privacy and security because a home is the most intimate place a person can be. We are a hardware company, looking to develop and sell hardware. This means that we don’t collect or store data about our customers. Our devices are designed to operate without storing customer data on our servers.<br><br>We believe that we can succeed without harvesting our customer’s data because our hardware will succeed. Each one of our devices is the result of clever engineering and fine craftsmanship. We never plan for obsolescence and the quality and testing of our products ensures that they will operate for a very long time.<br><br>The functionality of our devices is not dependent on the existence of Cabana Blockchain. Our devices will continue to operate even if we go out of business.<br><br>----<br><br>At Cabana Blockchain, firmware is what gives our devices intelligence. We are looking for Firmware Engineers to join our team and help us create devices that go into people’s homes.<br><br><strong>Responsibilities:</strong><br><br></p><ul><li>Work with our hardware team to design and program embedded systems<br></li><li>Work with our software team to bring our devices online<br><br><strong>Requirements:</strong><br><br></li><li>Bachelor’s degree (or equivalent) in electrical, computer, or firmware engineering<br></li><li>5+ years of work experience<br></li><li>Experience programming embedded systems in C/C++<br></li><li>Programming drivers for microcontroller peripherals<br></li><li>Using real-time operating systems<br></li><li>Consuming APIs on embedded systems<br><br>To learn how to apply, please see our <a href='https://cabanablockchain.com/careers' rel='nofollow'>Careers</a> page.<br><em>Cabana Blockchain provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, gender, sexual orientation, national origin, age, disability or genetics.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 11:19:58 PM",
    "tags": [
      "DBG_TECH1:k_t_w:c++_c_8",
      "DBG_TECH1:k_t_w:c_c_5",
      "DBG_TECH1:k_t_w:embedded_c_3",
      "DBG_TECH1:k_t_w:embedded_embedded_24",
      "DBG_TECH1:k_t_w:microcontroller_embedded_8",
      "DBG_TECH1:techWeightMap:{python=0, dotnet=0, c=16, mobile=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=32, frontend=0}",
      "REMOTE1_100",
      "TECH1_embedded",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "kG-EK_IJTEGHzcPyv8SLMA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/64092/client-success-executive-sustainability-food-tech-startup-at-winnow-solutions/",
    "title": "Client Success Executive (sustainability food tech startup)",
    "content": "DESCRIPTION<br /><br />This is an exciting opportunity for a Client Success Executive to play an instrumental role in on-boarding and implementing our technology across one of our largest clients. The goal – successful deployments of new sites and ongoing success with existing sites to ensure they achieve their waste reduction targets.<br /><br />As a Client Success Executive, you will be helping our clients on-board, implement, drive food waste reductions and sustain change through our technology.<br /><br />Our mission is to reduce food waste globally; driving food waste reduction at site level is how this is achieved, and you will be responsible for helping our clients achieve this.<br /><br /><br /><br />KEY OBJECTIVES<br /><br />Build exceptionally strong relationships with clients ensuring they are bought in to making the Winnow system successful<br />Setup systems, menus and client profiles with our systems, enabling smooth onboarding<br />Train multi-disciplined teams to use Winnow both in person, in central training locations and remotely<br />Help chefs and managers embed Winnow into their daily operation<br />Work with clients to ensure their waste reduction targets are met through monitoring site performance<br />Analyse client reports and troubleshoot with the client where needed<br />Develop and manage KPIs jointly with the client and the implementation lead to ensure that the system is delivering a strong business case, implementing changes where necessary<br />Improve processes that lead to an even better customer experience<br />Gather client feedback and build it into our working processes or product backlog<br />An initial focus on implementing our technology across one of our largest clients<br /><br /><br /><br />REQUIREMENTS<br /><br />Education and experience<br /><br />You are degree educated and might have completed studies in a hospitality or environmental related subject<br />You may have experience within the hotel industry, ideally having worked within F&amp;B for a multi-national organisation<br />You will ideally have an intermediate to expert level of Excel and working knowledge of Word and Powerpoint<br />You will have had a minimum of two to three years working experience in Account Management, Consultancy, Client Success or a related field<br />Personal attributes<br /><br />You have proven experience of knowing what it takes to provide consistently first-class customer service to external customers, remaining calm and measured even when dealing with the most demanding individuals.<br />You are comfortable taking ownership and accountability for your work whilst working effectively as part of a larger team.<br />You are able to work independently with low supervision.<br />You have excellent attention to detail and a meticulous eye for identifying inconsistencies or inaccuracies in data. You take your time to get things right first time.<br />You have a solid grasp of financial analysis to build clear a business case for your customers.<br />You are organised and have effective scheduling, prioritisation and time management skills. You can manage multiple tasks in parallel and complete tasks to tight deadlines even when under pressure.<br />You are able to demonstrate excellent communication skills and have experience in dealing with individuals at all levels of seniority. You communicate clearly in both written and spoken language. You listen attentively; you process and comprehend what you hear and have the confidence to ask questions and to clarify ambiguous points.<br />You are a highly motivated, data driven person, who can use data to track the success of your clients and clearly communicate this back to them, as well as the business development team.<br />You understand how to manage change and are happy to ‘get your hands dirty’ in order to achieve the desired results.<br />You have a good understanding of continuous process improvement and good analytical acumen.<br />You are experienced in creating reports, analysing data and influencing client’s day to day decisions using findings.<br />You are both passionate and measured. You carefully balance the need for quick solutions and pragmatism with the ability to step back, take in the bigger picture and build for the long term. You listen to and act on what your customers need.<br />You are transparent in approach and enjoy healthy, respectful debate. You work hard to build open and honest collaborative relationships.<br />You get things done at pace and seek to continually improve. Your customers see you as someone who gets things done, and they want you on their team<br />You are passionate about the value of food and are committed to playing an active role in fight against food waste.<br />You are humble in approach and quick to pitch in if you see someone struggling, regardless of the task.<br /><br /><br /><br />BENEFITS<br /><br />Competitive base salary<br />Committed team members with broad experience who share a common passion to build a world class business<br />Shared office space in central London with free happy hours and a great working environment<br />Company part-funded health insurance<br />Matching pension scheme<br />25 days of paid vacation time in addition to national holidays<br />You will love what you do – waking up every day solving one of the biggest social problems of our generation",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 5:55:49 PM",
    "tags": [
      "DBG_TECH1:k_t_w:embed_embedded_2",
      "DBG_TECH1:techWeightMap:{python=0, dotnet=0, c=0, mobile=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=2, frontend=0}",
      "REMOTE1_100",
      "TECH1_embedded",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "t4_vt3UYS3ObJyZZqaO06g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-copywriting",
    "url": "https://weworkremotely.com/jobs/5790-editor-in-chief-at-high-growth-cannabis-tech",
    "title": "Nugg: Editor-in-Chief at High-Growth Cannabis Tech Startup",
    "content": "<div>  <div>    <h2>Editor-in-Chief at High-Growth Cannabis Tech Startup</h2>      <h4>Posted Nov 20</h4>    <h3>      <span>Nugg</span><br>      <span>Headquarters: Los Angeles</span><br>        <a href='http://www.getnugg.com' rel='nofollow'>www.getnugg.com</a>    </h3>  </div></div>  <div>    <div><span></span></div><div>Nugg is one of the hottest startups in the $30-50 billion cannabis space. If you are passionate about joining a dynamic company that is already a leader in it’s industry (and has massive growth potential), Nugg is the right place for you.</div><div><br></div><div>We are seeking a full-time Editor-in-Chief to 1) ensure all our content efforts are on-brand and resonate with our target audiences, and 2) obsess over improving KPI's and conversions for blog content.</div><div><br></div><div>WHAT YOU’LL BE CHARGED WITH:<br></div><div><span><br></span></div><div><span>We are looking for a rockstar writer, editor and curator who knows how to use technical platforms to find and deliver rich, brand building content. This includes a thorough understanding of SEO best practices, content curation &amp; management, conversion rate optimization, and an expert understanding of best copywriting principles, consumer psychology, storytelling, emotional value, and more to support and advance our editorial calendar and mission.</span></div><div><br></div><div>HOURS &amp; LOCATION:</div><div><br></div><div>This is a full-time (40 hours/week) position that can be completed 100% remotely, but if you’re in the Los Angeles area, you’ll be expected to work out of our Marina Del Rey office twice per week. This is an independent contractor position to start, with a 3-month evaluation period prior to transitioning into a salaried position.</div><div><br></div><div>COMPENSATION: $45,000 - $65,000 annual salary, depending on experience.</div><div><br></div><div>RESPONSIBILITIES:</div><div><br></div><div>--Manage our team of writers who contribute to the blog, including communicating, answering questions, ensuring deadlines are met, providing article feedback, ensuring style guidelines are adhered to, and more<br></div><div>--Work alongside our Content Marketing Director and CMO to refine blog content strategy, optimize content curation/creation systems for greater output and efficiency, as well as optimize our blog as a channel for lead-generation and conversion from reader to customer<br></div><div>--Create our editorial calendar, and manage production &amp; publishing of content to various platforms<br></div><div>---Conduct ongoing tests to pinpoint what storylines, tone, imagery, CTA’s etc. resonate best with our target audiences on various platforms where we publish content<br></div><div>--Collaborate with our designer(s) to craft compelling infographics, hero images, and more that’ll engage our readers</div><div><br></div><div>ESSENTIAL SKILLS</div><div><br></div><div>-- An arsenal of words and phrases written for successful blog posts, email campaigns, and social media posts, preferably for 3+ years in a professional setting.<br></div><div>-- 2-5 years of content creation experience, with ability to integrate SEO best practices<br></div><div>-- Proven experience creating online content with current portfolio (web content, blogs, campaigns, social media, video, etc.)<br></div><div>-- 3+ years managing a content team and editorial calendar, able to stay on schedule &amp; meet deadlines consistently<br></div><div>-- Experience working with a graphic designer to create rich, brand-building content<br></div><div>-- Self-starter, highly motivated to succeed under minimal supervision.<br></div><div>-- Very web-savvy and up-to-date with developing tools and methods.<br></div><div>-- Experience and/or passion for cannabis is preferred.</div><div><br></div><div>COMPANY OVERVIEW:<br></div><div><span><br></span></div><div><span>Based in Los Angeles, we’re the nation’s largest online cannabis marketplace. We provide quick, easy, and professional access to medical marijuana delivery for people in California, and have ambitious plans to offer our services throughout the entire United States.</span></div><div><br></div><div>The other arm of our business, NuggMD, is the nation’s leading telemedicine platform for cannabis, connecting potential cannabis users with licensed doctors via live video to make getting a doctor’s recommendation for medical cannabis quick and painless.</div><div><br></div><div>NuggMD is the leading telemedicine platform for cannabis evaluations, has served over 100,000 people in California and New York, and will be available in more states soon.</div><div><br></div><div>BENEFITS &amp; CULTURE:</div><div><br></div><div>We’re a half-remote, half Los Angeles local team, and that’s just the way we like it. At Nugg, you can work whenever, wherever, however, as long as you get your shit done. We’re a laid-back team that enjoys ping pong, Saturday brunch, the outdoors, house music, and the little things in life.</div><div><br></div><div>As our newest team member, you’ll be given full autonomy to execute on your ideas. You’ll get as many vacation days as you want, and we’ll even vacation together (Colombia next spring, yo!) At Nugg, you’ll have boatloads of fun, while testing the limits of your expertise and innovative capacities. At Nugg, life gets a little better each day.<br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Fill out the application here: <a href='https://docs.google.com/forms/d/1QIFU-1M8P5w1cmXoseYNymRnnqBPqAO13_o5pTSObMo' rel='nofollow'>https://docs.google.com/forms/d/1QIFU-1M8P5w1cmXoseYNymRnnqBPqAO13_o5pTSObMo</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 21, 2017 1:00:26 AM",
    "tags": [
      "DBG_TECH1:k_t_w:arm_embedded_8",
      "DBG_TECH1:k_t_w:spring_java_8",
      "DBG_TECH1:techWeightMap:{python=0, dotnet=0, c=0, mobile=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=8, frontend=0}",
      "REMOTE1_100",
      "TECH1_embedded",
      "TECH1_java",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "embedded",
      "java"
    ]
  },
  {
    "id": "raR-YhaSRI-jYF1cQeiLxw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63183",
    "title": "Editor-in-chief + social media strategist for cannabis tech startup",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div><span></span></div><div><span>Nugg is one of the hottest startups in the $30-50 billion cannabis space. If you are passionate about joining a dynamic company that is already a leader in it’s industry (and has massive growth potential), Nugg is the right place for you.</span></div><div><br></div><div><span>We are seeking a full-time Editor-in-Chief &amp; Social Media Manager </span><span>to 1) ensure all our content efforts are on-brand and resonate with our target audiences, and 2) spearhead our social media marketing efforts, including regular publishing to three platforms, constant listening and engagement with our current and potential customers, and identifying opportunities for customer acquisition. </span></div><div><br></div><div><span>WHAT YOU’LL BE CHARGED WITH:</span></div><div><br></div><div><span>We are looking for a rockstar writer, editor and curator who knows how to use technical platforms to find and deliver rich, brand building content. This includes a thorough understanding of SEO best practices, content curation &amp; management, conversion rate optimization, and an expert understanding of best copywriting principles, consumer psychology, storytelling, emotional value, and more to support and advance our editorial calendar and mission. </span></div><div><br></div><div><span>HOURS &amp; LOCATION:</span></div><div><br></div><div><span>This is a full-time (40 hours/week) position that can be completed 100% remotely, but if you’re in the Los Angeles area, you’ll be expected to work out of our Marina Del Rey office twice per week.</span><em> </em><span>This is an independent contractor position to start, with a 3-month evaluation period prior to transitioning into a salaried position. </span></div><div><br></div><div><span>COMPENSATION: &nbsp;$45,000 - $65,000 annual salary, depending on experience.</span></div><div><br></div><div><span>RESPONSIBILITIES:</span></div><div><br></div><div><span>--Manage our team of writers who contribute to the blog, including communicating, answering questions, ensuring deadlines are met, providing article feedback, ensuring style guidelines are adhered to, and more</span></div><div><br></div><div><span>--Work alongside our Content Marketing Director and CMO to refine blog content &amp; social media strategy, optimize content curation/creation systems for greater output and efficiency, as well as optimize our blog as a channel for lead-generation and conversion from reader to customer</span></div><div><br></div><div><span>--Create our editorial &amp; social media calendars, and manage production &amp; publishing of content to each platform</span></div><div><br></div><div><span>---Conduct ongoing tests to pinpoint what storylines, tone, imagery, CTA’s etc. resonate best with our target audiences on various platforms where we publish content</span></div><div><br></div><div><span>--Collaborate with our designer(s) to craft compelling infographics, hero images, and more that’ll engage our readers</span></div><div><br></div><div><span>ESSENTIAL SKILLS </span></div><div><br></div><div><span>-- An arsenal of words and phrases written for successful blog posts, email campaigns, and social media posts, preferably for 3+ years in a professional setting.</span></div><div><br></div><div><span>-- 2-5 years of content creation experience, with ability to integrate SEO best practices</span></div><div><br></div><div><span>-- Proven experience creating online content with current portfolio (web content, blogs, campaigns, social media, video, etc.) </span></div><div><br></div><div><span>-- 3+ years managing a content team and editorial calendar, able to stay on schedule &amp; meet deadlines consistently</span></div><div><br></div><div><span>-- Experience working with a graphic designer to create rich, brand-building content</span></div><div><br></div><div><span>-- Self-starter, highly motivated to succeed under minimal supervision.</span></div><div><br></div><div><span>-- Very web-savvy and up-to-date with developing tools and methods.</span></div><div><br></div><div><span>-- Experience and/or passion for cannabis is preferred.</span></div><div><br></div><div><span>COMPANY OVERVIEW:</span></div><div><br></div><div><span>Based in Los Angeles, we’re the nation’s largest online cannabis marketplace. We provide quick, easy, and professional access to medical marijuana delivery for people in California, and have ambitious plans to offer our services throughout the entire United States. </span></div><div><br></div><div><span>The other arm of our business, NuggMD, is the nation’s leading telemedicine platform for cannabis, connecting potential cannabis users with licensed doctors via live video to make getting a doctor’s recommendation for medical cannabis quick and painless. </span></div><div><br></div><div><span>NuggMD is the leading telemedicine platform for cannabis evaluations, has served over 100,000 people in California and New York, and will be available in more states soon.</span></div><div></div><div><br></div><div><span>BENEFITS &amp; CULTURE:</span></div><div><br></div><div><span>We’re a half-remote, half Los Angeles local team, and that’s just the way we like it. At Nugg, you can work whenever, wherever, however, as long as you get your shit done. We’re a laid-back team that enjoys ping pong, Saturday brunch, the outdoors, house music, and the little things in life.</span></div><div><br></div><div><span>As our newest team member, you’ll be given full autonomy to execute on your ideas. You’ll get as many vacation days as you want, and we’ll even vacation together (Colombia next spring, yo!) At Nugg, you’ll have boatloads of fun, while testing the limits of your expertise and innovative capacities. At Nugg, life gets a little better each day. </span><br></div><div><span><br></span></div><p><strong>To apply:</strong> Fill out the application here: <a href='https://docs.google.com/document/d/19r-fgSbiRIHThOL_4gmLCAdRWMW3Dgsw1HC7SUTh1E4/' rel='nofollow'>https://docs.google.com/document/d/19r-fgSbiRIHThOL_4gmLCAdRWMW3Dgsw1HC7SUTh1E4/</a></p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 21, 2017 1:00:26 AM",
    "tags": [
      "DBG_TECH1:k_t_w:arm_embedded_8",
      "DBG_TECH1:k_t_w:spring_java_8",
      "DBG_TECH1:techWeightMap:{python=0, dotnet=0, c=0, mobile=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=8, frontend=0}",
      "REMOTE1_100",
      "TECH1_embedded",
      "TECH1_java",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "embedded",
      "java"
    ]
  },
  {
    "id": "fu9N8xxpRxeRAXjC5JzxHQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/143072/field-application-engineer-consultant-for-iot-proemion-gmbh?a=LYSsZLEC1OM",
    "title": "Field Application Engineer / Consultant for IoT Tech Company (m/f) at PROEMION GmbH (Fulda, Germany) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Services, Information Technology, Telematics</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company type: </span>                                            <span>Privat</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We give our customers the technology they need to globally transmit and analyze CAN-based telemetry data of mobile industrial machinery and therefore boost their efficiency.</p><p>We are at the forefront of the IoT/Telematics revolution and are looking for an enthusiastic <strong>Field Application Engineer / Consultant</strong> for our <strong>Embedded Systems</strong> <strong>and/or</strong> <strong>Cloud</strong> <strong>Web Services</strong>. We offer the position on-site in Fulda, Germany (relocation support offered) or as a full-time remote position at the earliest possible date.</p><p>You will be working closely with our sales and engineering teams to map customer business and to adapt our connectivity solution to fully integrate it into our customers’ value chain. Required is a combination of strong software (and hardware technical skills) plus excellent communication skills. Strong debug skills are essential as is the ability to time manage and service multiple large customers concurrently.</p><p><strong>Skills &amp; Requirements</strong></p><p><strong>Your Role</strong></p><ul><li>You act as a bridge between our internal engineering teams and our customers to develop technical solutions based on our products and services</li><li>You ensure the on-site technical integration of our telematics solutions at the customer to enable solution integration and issue resolution</li><li>You discuss new product definitions with the customer such as the implementation of custom protocols or the integration of web applications via our APIs</li><li>You are able to build and demonstrate proof-of-concepts that meets or exceeds customer business needs</li><li>You create the necessary technical documentation to support the customer</li><li>You consult our customers on best practices during the roll-out of our connectivity solution</li></ul><p><strong>Your Skills and Personality</strong></p><ul><li>Bachelors' or Masters' degree in engineering discipline; computer science, computer engineering or electrical engineering preferred</li><li>Minimum 2 years' related consultancy experience in a technical environment</li><li>Highly technical problem solver who understands system architecture, hardware and software interaction</li><li>Technical knowledge of Telematics/IoT/Global Connectivity applications and market, with a proven experience in such system development</li><li>Familiarity with CAN bus systems and microcontroller based devices and/or big data technologies and web Services</li><li>You are willing to travel and show a great business sense</li><li>Excellent team member with great communication and interpersonal skills and ability to progress in autonomy</li><li>You are able to work effectively in a high pressure environment</li></ul>                    </div>                            <h2>                About PROEMION GmbH            </h2>            <div><p><strong>About Proemion</strong></p><p>Since 1987 Proemion has delivered CAN devices and connectivity solutions for the most demanding industrial applications. The world’s most respected industrial equipment companies rely on Proemion, to design and build top-notch telematics solutions that enhance performance and safety. On the embedded side, we manufacture Telematics devices to collect and transmit CAN-based telemetry data. On the web services side, we use the latest Big Data technologies to process, analyze, and serve billions of data points through our APIs and web portal.</p><p><strong>We offer you</strong></p><ul><li>A dynamic environment, short communication ways and a flat hierarchy in an international Team</li><li>Room for innovative work in a highly attractive technology field</li><li>An attractive salary and development opportunities</li><li>Modern premises centered in the middle of Germany featuring lounge, kicker-table, pool table, Team events, additional allowance for a Fitness Club membership and child care, flextime, free soft drinks and fruit</li></ul><p>Are you curious?</p><p>We’re looking forward to your application via our career portal (<a href='https://career.proemion.com' rel='nofollow'>https://career.proemion.com</a>)&nbsp;or via mail (<a href='mailto:career@proemion.com' rel='nofollow'>career@proemion.com</a>)!</p><p><strong>Let’s build something great together!</strong></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive salary                            </div>                            <div>                                 Billiard table                            </div>                            <div>                                 Mentoring programm                            </div>                            <div>                                 Modern development environment                            </div>                            <div>                                 Team events                            </div>                            <div>                                 Sport sponsoring                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k_t_w:boost_c_8",
      "DBG_TECH1:k_t_w:embedded_c_2",
      "DBG_TECH1:k_t_w:embedded_embedded_16",
      "DBG_TECH1:k_t_w:microcontroller_embedded_8",
      "DBG_TECH1:techWeightMap:{python=0, dotnet=0, c=10, mobile=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=24, frontend=0}",
      "REMOTE1_100",
      "TECH1_embedded",
      "TECH2_continuous-integration",
      "TECH2_web-services",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "continuous-integration",
      "embedded",
      "web-services"
    ]
  }
]
}
