{
 "items": [
  {
    "id": "2eRs3vAXRbmBBkDPEovojw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/162430/golang-developer-employer-represented-by?a=StnZJ3N6eeA",
    "title": "Golang Developer at employer represented by techfolk (Bristol, UK) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Fresh8 Gaming is hiring for a Golang Developer, offering three months', potentially remote, coding and API integration work - December to January start - possibly longer.</p><p>This is chance to work on high throughput systems, building experience around transforming dynamic third party APIs to static Golang data structures.</p><p>Fresh8 has created software that instantly connects sport fans with personalised bets. Our marketing automation technology delivers rich messaging, a simpler user experience and increasing profitability to the sports betting industry. We've been using Golang in production for years and our entire stack is built from open source technology. Check us out on <a title=&quot;Fresh8 on Github&quot; href='https://github.com/fresh8' rel='nofollow'>Github</a>.</p><p>We need you to augment our data feed integration processes as we on-board new clients, undertaking important API integration work, troubleshooting and testing. We may also invite you to write an automated testing suite to further improve our automation.</p><p>Once familiar, you may work remotely for the majority of the time, or from the London or Bristol office if you prefer.</p><p><strong>About you</strong></p><ul><li>Proven Golang skills and a good understanding of how API's work</li><li>Competent working with XML and JSON</li><li>Effective working across multiple projects of varying complexity</li><li>Pick things up quickly, excellent troubleshooting skills, require little supervision</li><li>Familiarity with PostgreSQL or MySQL</li><li>Strong attention to testing, and you document properly</li><li>Considering Golang contracts in London or Bristol such as: Go Developer | Golang Developer | Gopher | Back End Developer | Golang Software Engineer | Go Software Engineer | etc.</li></ul><p><strong>We'll help you get up to speed on our technology mix</strong></p><p>Golang | microservices | Prometheus | PostgreSQL | Redis | distributed systems | Kanban | TDD | and more...</p><p><strong>Pay and terms</strong></p><ul><li>c.£300 - £400 per day, negotiable</li><li>Three months anticipated duration (up to end of March)</li><li>Optionally; remote, after one to two weeks at the London or Bristol office</li></ul>                    </div>                            <h2>                About employer represented by techfolk            </h2>            <div><p>techfolk is working on behalf of Fresh8 Gaming.<br>Our success to date speaks for itself. Our Engineering team has grown to 15 strong across offices in Bristol and London. Since 2014, we have landed a series of awards including Services Rising Star at EGR B2B Awards last year and have recently landed a new injection of funding to continue our rapid growth.</p><p>Our platform generates dynamic and personalised adverts on behalf of gaming operators and publishers and our clients include BetStars, BetVictor, Coral, Ladbrokes, Sky Bet, The Telegraph and William Hill.</p><p><a href='http://fresh8gaming.com' rel='nofollow'>http://fresh8gaming.com</a></p><p><strong>Location:</strong> remote | or Farringdon | or central Bristol, by Temple Meads</p><p><strong>Even if your CV isn't ready, please talk with Vittoria at techfolk to find out more:</strong></p><p>0117 318 2447 | <a href='mailto:hello@techfolk.co.uk' rel='nofollow'>hello@techfolk.co.uk</a> | @we_are_techfolk</p><p>RECRUITERS: Fresh8 Gaming has selected techfolk as our recruitment partner and cold calling is not welcomed</p>            </div>        ",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 10:59:50 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/33",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=33, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH2/go",
      "TECH2/microservices",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go",
      "microservices"
    ]
  },
  {
    "id": "7q4lVrNQTG63jIvQipu2Tw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/154997/senior-fullstack-engineer-sticker-mule?a=PYPGf8IeuPu",
    "title": "Senior fullstack engineer at Sticker Mule () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>eCommerce, Manufacturing</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>What you'll do:</strong></p><p>1. Design, build, test, deploy and maintain web applications and services.</p><p>2. Write clean, performant code in accordance with our team's code style guidelines.</p><p>3. Work to improve and maintain the code health of all of our software.</p><p>4. Collaborate with team leads and stakeholders to ensure that we're always building the best possible solution in the optimal way.</p><p>5. Participate in peer code reviews.</p><p>6. Share expertise with other members of the team, mentor junior developers.</p><p><strong>About you:</strong></p><p>1. You have a minimum of 3 years professional software development experience.</p><p>2. High competency in at least one of the following languages: JavaScript, Ruby, or Go.</p><p>3. Strong analytical and critical thinking skills.</p><p>4. Strong written and verbal communication skills in English. 5. Experience with microservices/SOA or DevOps would be beneficial.</p><p><strong>Requirements:</strong></p><p>1. Applicants will be sent a Hackerrank test within 1-3 days of applying. 2. Test must be completed within 5 days.</p><p><strong>Apply here only:</strong></p><p><a href='https://www.stickermule.com/career/178e2cdf-2e15-47e8-9d32-b24ac89032bf' rel='nofollow'>https://www.stickermule.com/career/178e2cdf-2e15-47e8-9d32-b24ac89032bf</a></p>                    </div>                            <h2>                About Sticker Mule            </h2>            <div><p>Sticker Mule is the Internet's fastest growing printing company. We are privately-owned, profitable and powered by an outstanding remote team that supports the growth of our manufacturing operations. We aim to build one of the Internet’s best technical teams. Currently, our development team operates in 8 countries and we’re always looking for more exceptional developers to join us.</p><p><strong>Why we enjoy working here</strong></p><p>1. We work flexible hours with an asynchronous culture.</p><p>2. We work at a sustainable pace without unreasonable external deadlines.</p><p>3. Varied, interesting technical challenges to work on.</p><p>4. Opportunities to make a large impact as part of a small, highly motivated team.</p><p><strong>What we look for</strong> <a href='https://www.stickermule.com/blog/characteristics-we-look-for-in-team-members' rel='nofollow'>https://www.stickermule.com/blog/characteristics-we-look-for-in-team-members</a></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible hours with asynchronous culture.                            </div>                            <div>                                 Sustainable work pace without unreasonable expectations or deadlines.                            </div>                            <div>                                 Varied, interesting technical challenges.                            </div>                            <div>                                 Opportunities to make a large impact as a small team.                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/ruby",
      "TECH2/go",
      "TECH2/javascript",
      "TECH2/ruby",
      "TECH2/ruby-on-rails",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go",
      "javascript",
      "ruby",
      "ruby-on-rails"
    ]
  },
  {
    "id": "fqI4EyMnTRan9jYRjY-wOA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15865778",
    "title": "EY (Ernst&Young) GigNow | Front End Developer | Palo Alto, CA | Partial Remote/In office | 6 Month Contract",
    "content": "<div>                  <span>EY (Ernst&amp;Young) GigNow | Front End Developer | Palo Alto, CA | Partial Remote/In office | 6 Month Contract<p>GigNow is an online portal that matches contract talent with relevant opportunities at EY. Our platform allows you to directly access contract opportunities at EY and find an assignment that gives you the professional growth and flexibility you desire.</p><p>GigNow comes with a dedicated recruiting team. Applications get reviewed by our recruiting team and you can easily track your application status on the site.</p><p>There are four openings for Front End Developers to work on the GigNow Platform itself which acts as an Applicant Tracking System and Web Portal. The team is small and is looking for developers focusing in front end for at least 3 years and 1 year utilizing React.js</p><p>This would be a partial remote position and in office work located in Palo Alto, CA. Local candidates only at this time.</p><p>Initial duration is 6 months but could go longer as the team<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Dec 7, 2017 12:41:09 AM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "bI7NTt5DRb6lB2JowdRbGw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4042-server-operator-remote-in-europe-asia-region-dnsimple",
    "title": "Server Operator (Remote in Europe/Asia region) @ DNSimple",
    "content": "<h2>              Server Operator (Remote in Europe/Asia region)<small> @ DNSimple</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-12-06 03:52</p></dd>          <dt><span>Description</span></dt>          <dd><p>We are looking for a person to add to our talented server operations staff in the Europe or Asia Pacific regions. You will help us to keep our systems online to deliver the best DNS service to our customers around the world.</p><h5>Required skills and experience</h5><p><strong>Chef</strong></p><p>We automate everything we can with Chef and their products, having experience with this is the most important requirement.</p><p><strong>Open source contributions</strong></p><p>Our team contributes a lot to the open source community and we hope you do as well. We would love to see what you've done to help others.</p><h5>Other skills</h5><ul><li>Empathy and communication; Since we are distributed, we communicate mostly in written form, via pull requests, Slack and with our customers when doing support. Being able to understand and make yourself understood to customers and colleagues is essential.</li><li>Ability to learn; We manage many different technologies, sometimes in new, innovative ways. We are constantly touching and improving our platform. We celebrate curiosity and creativity.</li></ul><h5>Job requirements</h5><ul><li>Customer support; Everyone at the company does day to day support to our customers. The operations team is also required to provide support to our internal teams. We appreciate people sensitive to our customer's needs.</li><li>Remote work; We are remote first and we work asynchronously. We have a team focused environment which requires good collaboration skills, but sometimes you'll need to be able to self drive and work alone, then sync back up for reviews and reporting. Asking lots questions is part of everyone's day to day.</li><li>Writing documentation; Since we are all async, good caring on documentation is something we all do and value.</li><li>Travel; We meet up three times a year. We don't require you to go to a conference but we'll support you if you want to speak at one.</li><li>On-call rotation; Everyone technical (operators and developers) helps with the pager rotation to keep our systems working.</li></ul><h5>Our Stack</h5><p>This is the software and systems we deploy and run today. Knowledge and demonstrable skills with any of these are major bonus points.</p><ul><li>Ubuntu Linux (We're on 14.04 and migrating to 16.04)</li><li>DataDog (How we submit metrics data to monitor all the things. Metrics/Monitoring experience is a bonus)</li><li>PostgreSQL (Storing all the data to serve to our internal services)</li><li>Ruby (Our website and API is built on it along with a few of our operations utilities)</li><li>GoLang (Used to help ship zone updates to our name servers and perform redirects)</li><li>Erlang (The beast behind our DNS servers)</li><li>Nginx and HAProxy (Used heavily to secure and serve our various APIs)</li><li>Redis (All our stats and background queues to process everything)</li><li>Python (Used in our DataDog agent to help parse logs and teach it new monitoring tricks)</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Remote in Europe/Asia region</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 5:52:09 AM",
    "tags": [
      "DBG_TECH1:k/t/w:erlang/other/5",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=2, other=5, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "go",
      "other"
    ]
  },
  {
    "id": "oUzqrjkLRY2li133E-hfow",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4039-software-frontend-developer-cabana-blockchain",
    "title": "Software - Frontend Developer @ Cabana Blockchain",
    "content": "<h2>              Software - Frontend Developer<small> @ Cabana Blockchain</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-12-05 21:23</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>About Us</strong></p><p>Cabana Blockchain is a privately-owned stealth startup company that develops IoT devices which use a blockchain.</p><p>We started as an idea and a simple proof of concept. Then we were acquired and relocated to San Francisco, right in Silicon Valley. We employ creative problem solvers to work in our office and to work remotely from anywhere around the world.</p><p><strong>Our Mission</strong></p><p>There are many problems current IoT devices on the market face that we wish to solve. Using our own blockchain technology helps us achieve this.</p><p>Above all else, we value our customer’s privacy and security because a home is the most intimate place a person can be. We are a hardware company, looking to develop and sell hardware. This means that we don’t collect or store data about our customers. Our devices are designed to operate without storing customer data on our servers.</p><p>We believe that we can succeed without harvesting our customer’s data because our hardware will succeed. Each one of our devices is the result of clever engineering and fine craftsmanship. We never plan for obsolescence and the quality and testing of our products ensures that they will operate for a very long time.</p><p>The functionality of our devices is not dependent on the existence of Cabana Blockchain. Our devices will continue to operate even if we go out of business.</p><p>Cabana Blockchain uses software to run all of its devices. We are looking for Frontend Developers to join our team and help us create devices that go into people’s homes.</p><p><strong>Responsibilities:</strong></p><p>Work with our software team to write the code that makes our devices work and allows users to control themDevelop our blockchain technology</p><p><strong>Requirements:</strong></p><ul><li>Bachelor’s degree (or equivalent) in software engineering or computer science</li><li>5+ years of work experience</li><li>Capable of consuming APIs and designing web applications</li><li>Experience with Python, Javascript, React, Redux, and web sockets</li><li>Experience with distributed computing / consensus algorithms</li><li>Knowledge of Test-driven Development and Linux servers</li><li>Able to learn blockchain technology</li></ul><p>To learn how to apply, please see our <a href='https://cabanablockchain.com/careers' rel='nofollow'>Careers</a> page.</p><p><em>Cabana Blockchain provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, gender, sexual orientation, national origin, age, disability or genetics.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 11:23:17 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=9}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend",
      "go"
    ]
  },
  {
    "id": "S2Die7OdR-OPVWx7uVSXEg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63474",
    "title": "Software Frontend Developer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>About Us</strong><br><br>Cabana Blockchain is a privately-owned stealth startup company that develops IoT devices which use a blockchain.<br><br>We started as an idea and a simple proof of concept. Then we were acquired and relocated to San Francisco, right in Silicon Valley. We employ creative problem solvers to work in our office and to work remotely from anywhere around the world.<br><br><strong>Our Mission</strong><br><br>There are many problems current IoT devices on the market face that we wish to solve. Using our own blockchain technology helps us achieve this.<br><br>Above all else, we value our customer’s privacy and security because a home is the most intimate place a person can be. We are a hardware company, looking to develop and sell hardware. This means that we don’t collect or store data about our customers. Our devices are designed to operate without storing customer data on our servers.<br><br>We believe that we can succeed without harvesting our customer’s data because our hardware will succeed. Each one of our devices is the result of clever engineering and fine craftsmanship. We never plan for obsolescence and the quality and testing of our products ensures that they will operate for a very long time.<br><br>The functionality of our devices is not dependent on the existence of Cabana Blockchain. Our devices will continue to operate even if we go out of business.<br><br>----<br><br>Cabana Blockchain uses software to run all of its devices. We are looking for Frontend Developers to join our team and help us create devices that go into people’s homes.<br><br><strong>Responsibilities:</strong><br><br>Work with our software team to write the code that makes our devices work and allows users to control them<br>Develop our blockchain technology<br><br><strong>Requirements:</strong><br><br></p><ul><li>Bachelor’s degree (or equivalent) in software engineering or computer science<br></li><li>5+ years of work experience<br></li><li>Capable of consuming APIs and designing web applications<br></li><li>Experience with Python, Javascript, React, Redux, and web sockets<br></li><li>Experience with distributed computing / consensus algorithms<br></li><li>Knowledge of Test-driven Development and Linux servers<br></li><li>Able to learn blockchain technology<br><br>To learn how to apply, please see our <a href='https://cabanablockchain.com/careers' rel='nofollow'>Careers</a> page.<br><em>Cabana Blockchain provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, gender, sexual orientation, national origin, age, disability or genetics.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 11:23:17 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=9}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend",
      "go"
    ]
  },
  {
    "id": "gCc8tqD8Rauaqi7CPqOT0A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4038-software-backend-developer-cabana-blockchain",
    "title": "Software - Backend Developer @ Cabana Blockchain",
    "content": "<h2>              Software - Backend Developer<small> @ Cabana Blockchain</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-12-05 21:21</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>About Us</strong></p><p>Cabana Blockchain is a privately-owned stealth startup company that develops IoT devices which use a blockchain.</p><p>We started as an idea and a simple proof of concept. Then we were acquired and relocated to San Francisco, right in Silicon Valley. We employ creative problem solvers to work in our office and to work remotely from anywhere around the world.</p><p><strong>Our Mission</strong></p><p>There are many problems current IoT devices on the market face that we wish to solve. Using our own blockchain technology helps us achieve this.</p><p>Above all else, we value our customer’s privacy and security because a home is the most intimate place a person can be. We are a hardware company, looking to develop and sell hardware. This means that we don’t collect or store data about our customers. Our devices are designed to operate without storing customer data on our servers.</p><p>We believe that we can succeed without harvesting our customer’s data because our hardware will succeed. Each one of our devices is the result of clever engineering and fine craftsmanship. We never plan for obsolescence and the quality and testing of our products ensures that they will operate for a very long time.</p><p>The functionality of our devices is not dependent on the existence of Cabana Blockchain. Our devices will continue to operate even if we go out of business.</p><p>Cabana Blockchain uses software to run all of its devices. We are looking for Backend Developers to join our team and help us create devices that go into people’s homes.</p><p><strong>Responsibilities:</strong></p><ul><li>Work with our software team to write the code that makes our devices work</li><li>Work with our firmware engineers to help bridge the gap between software and hardware</li><li>Develop our blockchain technology</li></ul><p><strong>Requirements:</strong></p><ul><li>Bachelor’s degree (or equivalent) in software engineering or computer science</li><li>5+ years of work experience</li><li>Capable of designing APIs and software that runs on embedded devices</li><li>Experience with C++, Python, SQL, web application development</li><li>Experience with distributed computing / consensus algorithms</li><li>Knowledge of Test-driven Development and Linux servers</li><li>Able to learn blockchain technology</li></ul><p>To learn how to apply, please see our <a href='https://cabanablockchain.com/careers' rel='nofollow'>Careers</a> page.</p><p><em>Cabana Blockchain provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, gender, sexual orientation, national origin, age, disability or genetics.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 11:21:32 PM",
    "tags": [
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:embedded/c/1",
      "DBG_TECH1:k/t/w:embedded/embedded/8",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=9, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=8, frontend=0}",
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/embedded",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "c",
      "embedded",
      "go"
    ]
  },
  {
    "id": "lCmPT2jVToiW2T5wGOaPJw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63475",
    "title": "Software Backend Developer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>About Us</strong><br><br>Cabana Blockchain is a privately-owned stealth startup company that develops IoT devices which use a blockchain.<br><br>We started as an idea and a simple proof of concept. Then we were acquired and relocated to San Francisco, right in Silicon Valley. We employ creative problem solvers to work in our office and to work remotely from anywhere around the world.<br><br><strong>Our Mission</strong><br><br>There are many problems current IoT devices on the market face that we wish to solve. Using our own blockchain technology helps us achieve this.<br><br>Above all else, we value our customer’s privacy and security because a home is the most intimate place a person can be. We are a hardware company, looking to develop and sell hardware. This means that we don’t collect or store data about our customers. Our devices are designed to operate without storing customer data on our servers.<br><br>We believe that we can succeed without harvesting our customer’s data because our hardware will succeed. Each one of our devices is the result of clever engineering and fine craftsmanship. We never plan for obsolescence and the quality and testing of our products ensures that they will operate for a very long time.<br><br>The functionality of our devices is not dependent on the existence of Cabana Blockchain. Our devices will continue to operate even if we go out of business.<br><br>----<br><br>Cabana Blockchain uses software to run all of its devices. We are looking for Backend Developers to join our team and help us create devices that go into people’s homes.<br><br><strong>Responsibilities:</strong><br><br></p><ul><li>Work with our software team to write the code that makes our devices work<br></li><li>Work with our firmware engineers to help bridge the gap between software and hardware<br></li><li>Develop our blockchain technology<br><br><strong>Requirements:</strong><br><br></li><li>Bachelor’s degree (or equivalent) in software engineering or computer science<br></li><li>5+ years of work experience<br></li><li>Capable of designing APIs and software that runs on embedded devices<br></li><li>Experience with C++, Python, SQL, web application development<br></li><li>Experience with distributed computing / consensus algorithms<br></li><li>Knowledge of Test-driven Development and Linux servers<br></li><li>Able to learn blockchain technology<br><br>To learn how to apply, please see our <a href='https://cabanablockchain.com/careers' rel='nofollow'>Careers</a> page.<br><em>Cabana Blockchain provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, gender, sexual orientation, national origin, age, disability or genetics.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 11:21:32 PM",
    "tags": [
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:embedded/c/1",
      "DBG_TECH1:k/t/w:embedded/embedded/8",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=9, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=8, frontend=0}",
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/embedded",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "c",
      "embedded",
      "go"
    ]
  },
  {
    "id": "ExBUiZCWRZ6dgxsRMmSx5Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/jobs/5878-software-engineer-terraform",
    "title": "HashiCorp: Software Engineer - Terraform",
    "content": "<div>  <div>    <h2>Software Engineer - Terraform</h2>      <h4>Posted Dec  4</h4>    <h3>      <span>HashiCorp</span><br>      <span>Headquarters: San Francisco</span><br>        <a href='https://www.hashicorp.com/jobs/766376' rel='nofollow'>https://www.hashicorp.com/jobs/766376</a>    </h3>  </div>    </div>  <div>    <div></div><div><a href='https://www.hashicorp.com/' rel='nofollow'>HashiCorp</a><span>&nbsp;builds devops tools for modern applications. We build open source tools, and enterprise products on top of them. The HashiCorp suite empowers organizations to provision hybrid cloud infrastructure, secure secrets across distributed applications, and run dynamic resources.</span></div><div><span>At HashiCorp, we value top-notch collaboration and communication skills, both among internal teams and in how we interact with our users. We take care to balance and be responsive to the needs of our open source community as well as our enterprise level customers.</span></div><div><span>Engineering at HashiCorp is largely a remote team. While prior experience working remotely isn't required, we are looking for team members who perform well given a high level of independence and autonomy.</span></div><div><span>HashiCorp’s Terraform is an open source project that enables you to safely and predictably create, change, and improve production infrastructure via the CLI. It codifies APIs into declarative configuration files that can be shared amongst team members, treated as code, edited, reviewed, and versioned.</span></div><div><span>We want you to contribute to development and maintenance of&nbsp;</span><a href='https://github.com/terraform-providers' rel='nofollow'>Terraform Providers</a><span>&nbsp;in tight collaboration with the large and growing Terraform community, utilizing operations and engineering skills to work across a diverse set of infrastructure providers.</span></div><div><span>&nbsp;</span></div><div><strong>In this role, you can expect to:</strong></div><ul><li><span>Support integrations with new and existing infrastructure providers</span></li><li><span>Help support open source contributors, new and seasoned, with supportive and constructive code review, documentation improvements, and workflow changes</span></li><li><span>Advocate and support improvements to Terraform APIs and core to improve development and integration of providers</span></li><li><span>Work on issues and improvements in Terraform Providers critical to the success of HashiCorp customers and the broader community</span></li></ul><div><span>&nbsp;</span></div><div><strong>You may be a good fit for our team if:</strong></div><ul><li><span>You have experience in a lower-level language like Go</span></li><li><span>You have experience with customer support or OSS community support to help interface with the Terraform community</span></li><li><span>You have experience operating and maintaining production systems in a Linux and public cloud environment</span></li><li><span>You are familiar with infrastructure management concepts and ecosystem</span></li><li><span>You have experience using Terraform</span></li></ul><div><span>In your cover letter, please describe why you're passionate about working at HashiCorp, and on the Terraform team in particular.</span></div><div><span>At HashiCorp, we are committed to hiring and cultivating a diverse team. If you are on the fence about whether you would be successful working with us, please apply anyway!</span></div><div><span>#LI-WM1&nbsp;</span></div><div></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply via the website, to get into our tracking system.</p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 4, 2017 7:42:35 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "XYKskm6yTbCL8GLZZjDBmQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63418",
    "title": "Software Engineer - Terraform",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div></div><div><a href='https://www.hashicorp.com/' rel='nofollow'>HashiCorp</a><span>&nbsp;builds devops tools for modern applications. We build open source tools, and enterprise products on top of them. The HashiCorp suite empowers organizations to provision hybrid cloud infrastructure, secure secrets across distributed applications, and run dynamic resources.</span></div><div><span>At HashiCorp, we value top-notch collaboration and communication skills, both among internal teams and in how we interact with our users. We take care to balance and be responsive to the needs of our open source community as well as our enterprise level customers.</span></div><div><span>Engineering at HashiCorp is largely a remote team. While prior experience working remotely isn't required, we are looking for team members who perform well given a high level of independence and autonomy.</span></div><div><span>HashiCorp’s Terraform is an open source project that enables you to safely and predictably create, change, and improve production infrastructure via the CLI. It codifies APIs into declarative configuration files that can be shared amongst team members, treated as code, edited, reviewed, and versioned.</span></div><div><span>We want you to contribute to development and maintenance of&nbsp;</span><a href='https://github.com/terraform-providers' rel='nofollow'>Terraform Providers</a><span>&nbsp;in tight collaboration with the large and growing Terraform community, utilizing operations and engineering skills to work across a diverse set of infrastructure providers.</span></div><div><span>&nbsp;</span></div><div><strong>In this role, you can expect to:</strong></div><ul><li><span>Support integrations with new and existing infrastructure providers</span></li><li><span>Help support open source contributors, new and seasoned, with supportive and constructive code review, documentation improvements, and workflow changes</span></li><li><span>Advocate and support improvements to Terraform APIs and core to improve development and integration of providers</span></li><li><span>Work on issues and improvements in Terraform Providers critical to the success of HashiCorp customers and the broader community</span></li></ul><div><span>&nbsp;</span></div><div><strong>You may be a good fit for our team if:</strong></div><ul><li><span>You have experience in a lower-level language like Go</span></li><li><span>You have experience with customer support or OSS community support to help interface with the Terraform community</span></li><li><span>You have experience operating and maintaining production systems in a Linux and public cloud environment</span></li><li><span>You are familiar with infrastructure management concepts and ecosystem</span></li><li><span>You have experience using Terraform</span></li></ul><div><span>In your cover letter, please describe why you're passionate about working at HashiCorp, and on the Terraform team in particular.</span></div><div><span>At HashiCorp, we are committed to hiring and cultivating a diverse team. If you are on the fence about whether you would be successful working with us, please apply anyway!</span></div><div><span>#LI-WM1&nbsp;</span></div><div></div><p><strong>To apply:</strong> Apply via the website, to get into our tracking system.</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 4, 2017 7:42:35 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "hKc-q0MjQYOe9MURQ_ecNA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63366",
    "title": "Director of Growth Product Management",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong><em>Our positions are fully remote and to ensure compliance with all applicable labor laws, are open to U.S.-based applicants only. In general, we are not hiring in Washington state, Oregon state, San Francisco, or New York</em></strong><br></p><p>Simply put, we make websites easier to use. Through a scientific method of determining which site improvements result in actual performance improvements, we replace the old way of designing sites through gut feel and management opinions with designing sites through data. Tactically speaking, clients come to us for both strategic direction and to supplement their internal teams.<br></p><p>As a Director of Growth Product Management at CROmetrics, you will be a player/coach overseeing a team of people who are hybrid product manager, strategic thinker, account manager and data analyst. Your primary role is to enable our product managers to be successful. Since you have done this yourself for a while, you’ll be able to quickly gain the respect of your team in showing them how it’s done while also helping them to develop the skills they’ll need to grow in their own careers. Product Managers spend much of their time interfacing with clients, designers and engineers. On the client side, our Product Managers must be able to generate data-driven ideas that will improve revenue and other key metrics on client websites while being rooted in better understanding what the customer wants.<br>Our PMs lead all A/B testing and personalization experimentation for the client, which includes the following:<br></p><ul><li>Partnering with the client for the ideation, prioritization, road-mapping, design, and approval process for all hypotheses generation and experimentation<br></li><li>Diving deep into the results to deliver the data story, learnings and recommendations from the experiment<br></li><li>Collaborating with a remote team of engineers, designers and other PMs to support experiment ideation and execution<br></li><li>Managing all aspects of the client relationship from daily experiment monitoring to kicking off the renewal process to evangelizing the value of CROmetrics<br>The director must be able to do all of these things on their own, and be focused on enabling their team to level up their skills. Expect about 10% travel as you visit key accounts regularly.<br>In addition, as a CROmetrics team member, you will:<br></li><li>Support the professional growth of the team through leading and/or participating in ongoing training, e.g. book club<br></li><li>Engage in non-client related activities that help grow our business, e.g. writing the PM job description or delivering hypotheses and mock-ups for a sales deck<br></li><li>Actively participate in our remote culture<br>If you don’t have previous management experience, an individual contributor role at CROmetrics might be a possibility. The type of individual contributor who will succeed in this role is strongly correlated with prior management experience since the type of client problems you encounter require solutions that leverage both the client and internal teams typical of strong internal product managers who need to influence teams that don’t report to them.<br><p>Our most successful candidates have the following skills/experience/traits:<br></p></li><li>10+ years of professional experience working in digital product management, user experience design or similar roles on web products. You must have experience running successful, mature A/B testing or personalization programs. Familiarization with Optimizely is a bonus.<br></li><li>Experience managing other product managers or marketers running optimization programs.<br></li><li>5+ years experience managing others.<br></li><li>Demonstrated extremely strong presentation and communication skills<br></li><li>Built and delivered product roadmaps full of winning and losing ideas<br></li><li>Passion for using data to improve user experiences<br></li><li>Hands-on experience analyzing digital business data to inform decisions and plan strategically<br></li><li>Worked cross-functionally in a highly collaborative environment, preferably in a remote capacity<br></li><li>Genuinely like working with clients and their distributed stakeholder groups<br></li><li>Love product strategy, but obsessed with the details on execution<br></li><li>Lifelong learner<br>If you’re interested in checking out the swell people you’ll be working with, click here <a href='https://crometrics.com/meet-the-team/' rel='nofollow'>to learn more about the team.</a><em>If you have questions as you go through this, make notes and if we haven’t answered them by the end, feel free to email chris@crometrics.com or tom@crometrics.com.</em><br></li><li><strong>We’re a remote company.</strong> We are spread out all over the country and enjoy the flexibility remote working affords. Want to go on a mountain bike ride in the middle of the day? Cool, don’t forget your helmet! Need to pick the kids up from school? Nice, you’ve got parent of the year in the bag. We stay connected through Slack and workcations, including one annual trip that is funded by the company.<br></li><li><strong>Our engineers value elegant code, but move fast.</strong> We’re writing code that runs on top of existing websites. Some tests only run for a few days before disappearing (though some do so well they become a permanent part of the client’s site). If “minimum viable product” isn’t in your lexicon, you aren’t a good fit.<br></li><li><strong>Communication is critical.</strong> We’re a remote company. That makes communication — including writing and reading comprehension — extremely important. You’ll work closely with engineers, designers and writers. This is not a simple “write specs and close tickets” gig. Successful applicants enjoy the process of defining and clarifying specs, documenting processes, improving processes, seeing their ideas and work affect millions of users, and uploading custom emoji to Slack.<br></li><li><strong>We’re relentlessly focused on our client’s happiness.</strong> The PM is a client-facing role. Managing a client relationship virtually takes a different type of skill set – the PMs have to be both a strategic partner, the customer (represented by the data), teacher and project manager over the phone/email/Slack, all while delivering an exceptional level of service. This type of interaction is not for everyone, and we completely understand. It’s not easy!<br></li><li><strong>We are not perfect.</strong> A the core of experimentation is the lesson to be learned from the test, whether a win, loss or inconclusive. We extend this concept to everything we do by setting the bar high for our team and fostering an environment of radical candor and constant learning.<br></li><li>Read more about our culture and core values on our <a href='https://crometrics.com/culture/' rel='nofollow'>culture page</a>.This short essay sums up the philosophy we operate by: This is Professionalism: <a href='http://arches.io/2014/03/this-is-professionalism/' rel='nofollow'>http://arches.io/2014/03/this-is-professionalism/</a><em>Sound like something you are interested in? Read on.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 30, 2017 9:09:24 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/product",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "AOZC4Mk5TfOcfNIs2cxXHA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5854-director-of-growth-product-management",
    "title": "CROmetrics: Director of Growth Product Management",
    "content": "<div>  <div>    <h2>Director of Growth Product Management</h2>      <h4>Posted Nov 30</h4>    <h3>      <span>CROmetrics</span><br>      <span>Headquarters: San Francisco, CA</span><br>        <a href='https://crometrics.com' rel='nofollow'>https://crometrics.com</a>    </h3>  </div>    </div>  <div>    <div><h4>What We Do</h4></div><div>Simply put, we make websites easier to use. Through a scientific method of determining which site improvements result in actual performance improvements, we replace the old way of designing sites through gut feel and management opinions with designing sites through data. Tactically speaking, clients come to us for both strategic direction and to supplement their internal teams.</div><div><br></div><div><h4>The Director of Growth Product Management</h4></div><div>As a Director of Growth Product Management at CROmetrics, you will be a player/coach overseeing a team of people who are hybrid product manager, strategic thinker, account manager and data analyst. Your primary role is to enable our product managers to be successful.&nbsp; Since you have done this yourself for a while, you’ll be able to quickly gain the respect of your team in showing them how it’s done while also helping them to develop the skills they’ll need to grow in their own careers.&nbsp; Product Managers spend much of their time interfacing with clients, designers and engineers. On the client side, our Product Managers must be able to generate data-driven ideas that will improve revenue and other key metrics on client websites while being rooted in better understanding what the customer wants.</div><div><br></div><div>Our PMs lead all A/B testing and personalization experimentation for the client, which includes the following:</div><div><br></div><ul><li>Partnering with the client for the ideation, prioritization, road-mapping, design, and approval process for all hypotheses generation and experimentation</li><li>Diving deep into the results to deliver the data story, learnings and recommendations from the experiment</li><li>Collaborating with a remote team of engineers, designers and other PMs to support experiment ideation and execution</li><li>Managing all aspects of the client relationship from daily experiment monitoring to kicking off the renewal process to evangelizing the value of CROmetrics</li></ul><div><br></div><div>The director must be able to do all of these things on their own, and be focused on enabling their team to level up their skills. Expect about 10% travel as you visit key accounts regularly.</div><div><br></div><div>In addition, as a CROmetrics team member, you will:</div><div><br></div><ul><li>Support the professional growth of the team through leading and/or participating in ongoing training, e.g. book club</li><li>Engage in non-client related activities that help grow our business, e.g. writing the PM job description or delivering hypotheses and mock-ups for a sales deck</li><li>Actively participate in our remote culture</li></ul><div><br></div><div>If you don’t have previous management experience, an individual contributor role at CROmetrics might be a possibility. The type of individual contributor who will succeed in this role is strongly correlated with prior management experience since the type of client problems you encounter require solutions that leverage both the client and internal teams typical of strong internal product managers who need to influence teams that don’t report to them.</div><div><br></div><div><h4>Who we’re looking for</h4></div><div>Our most successful candidates have the following skills/experience/traits:</div><div><br></div><ul><li>10+ years of professional experience working in digital product management, user experience design or similar roles on web products.&nbsp; You must have experience running successful, mature A/B testing or personalization programs.&nbsp; Familiarization with Optimizely is a bonus.</li><li>Experience managing other product managers or marketers running optimization programs.</li><li>5+ years experience managing others.</li><li>Demonstrated extremely strong presentation and communication skills</li><li>Built and delivered product roadmaps full of winning and losing ideas</li><li>Passion for using data to&nbsp;improve user experiences</li><li>Hands-on experience analyzing digital business data to inform decisions and plan strategically</li><li>Worked cross-functionally in a highly collaborative environment, preferably in a remote capacity</li><li>Genuinely like working with clients and their distributed stakeholder groups</li><li>Love product strategy, but obsessed with the details on execution</li><li>Lifelong learner</li></ul><div><br></div><div>If you’re interested in checking out the swell people you’ll be working with, click here to&nbsp;<a href='https://crometrics.com/meet-the-team/' rel='nofollow'>learn more about the team.</a></div><div><br></div><div><em>If you have questions as you go through this, make notes and if we haven’t answered them by the end, feel free to email&nbsp;<a href='mailto:chris@crometrics.com' rel='nofollow'>chris@crometrics.com</a>&nbsp;or&nbsp;<a href='mailto:tom@crometrics.com' rel='nofollow'>tom@crometrics.com</a>.</em></div><div><br></div><div><h4>Our Culture</h4></div><ul><li><span>We’re a remote company.</span>&nbsp;We are spread out all over the country and enjoy the flexibility remote working affords. Want to go on a mountain bike ride in the middle of the day? Cool, don’t forget your helmet! Need to pick the kids up from school? Nice, you’ve got parent of the year in the bag. We stay connected through Slack and workcations, including one annual trip that is funded by the company.</li><li><span>Our engineers value elegant code, but move fast.</span>&nbsp;We’re writing code that runs&nbsp;<em>on top of</em>&nbsp;existing websites. Some tests only run for a few days before disappearing (though some do so well they become a permanent part of the client’s site). If “minimum viable product” isn’t in your lexicon, you aren’t a good fit.</li><li><span>Communication is critical.</span>&nbsp;We’re a remote company. That makes communication — including writing and reading comprehension —&nbsp;<em>extremely</em>&nbsp;important. You’ll work closely with engineers, designers and writers. This is not a simple “write specs and close tickets” gig. Successful applicants enjoy the process of defining and clarifying specs, documenting processes,&nbsp;<em>improving</em>&nbsp;processes, seeing their ideas and work affect millions of users, and uploading custom emoji to Slack.</li><li><span>We’re relentlessly focused on our client’s happiness.&nbsp;</span>The PM is a client-facing role. Managing a client relationship virtually takes a different type of skill set – the PMs have to be both a strategic partner, the customer (represented by the data), teacher and project manager over the phone/email/Slack, all while delivering an exceptional level of service. This type of interaction is not for everyone, and we completely understand. It’s not easy!</li><li><span>We are not perfect.&nbsp;</span>A the core of experimentation is the lesson to be learned from the test, whether a win, loss or inconclusive. We extend this concept to everything we do by setting the bar high for our team and fostering an environment of radical candor and constant learning.</li><li>Read more about our culture and core values on our&nbsp;<a href='https://crometrics.com/culture/' rel='nofollow'>culture page</a>.</li></ul><div><br></div><div>This short essay sums up the philosophy we operate by:&nbsp;<a href='http://arches.io/2014/03/this-is-professionalism/' rel='nofollow'>This is Professionalism</a>.</div><div><br></div><div><h4>A unique application and hiring process, just like us</h4></div><div>We’re glad you’re interested in working with us. We have a fairly unusual hiring process, but it has proven to work well both for us and for potential new hires. We have found that demonstrating basic competency is the best predictor of initial qualification for working with us, followed by actual work.</div><div><br></div><div>Our process reflects that. We’ve outlined our values and how we work above, and now we will ask you to complete a couple small tasks to show us you’re interested.</div><div><br></div><div><span>Create A Work Sample</span><br></div><div></div><div><em>The following is a typical task a product manager you’re working with will be doing on a daily basis.&nbsp; Since the position is for a player/coach, we’d like you to demonstrate basic competency as well.&nbsp; Please do not spend more than an hour on this task, as it is intended for you to be able to demonstrate basic competency in the core part of the job you will be doing.</em></div><div><br></div><div>We want to know how you think about designing elegant product solutions focused around increasing conversions.<br></div><div></div><div>Here is the website for a past client:&nbsp;<a href='http://www.hired.com/' rel='nofollow'>Hired.com</a>. Hired spends a lot of money (e.g. through paid ads) to drive applicants, primarily software engineers, to their site. Their goal is to increase the number of leads/applicants that complete the signup flow and are ready to be hired.</div><div><br></div><ol><li>Your first task is to come up with a hypothesis backlog of at least 6-8 ideas you have for improving conversions for&nbsp;<a href='http://hired.com/' rel='nofollow'>Hired.com</a>. An example of a hypothesis is:&nbsp;<em>“Adding a video to the Hired website will help job candidates understand how Hired works and therefore, increase conversions.”</em></li><li>Once you’ve developed your hypothesis backlog, choose one of the ideas that you believe is most likely to increase leads.</li><li>Write a spec for your chosen idea comprised of the user story, any supporting data, expected user or page interactions, engineering notes, etc. Optionally, you may also produce a wireframe and/or a visual to go along with your spec, using any number of UX tools such as Axure, Balsamiq, Invision or even simple pen/paper sketching. Just be sure to submit your spec as an image so anyone can view it without special software.</li></ol><div>In a real-life client situation, you will work with the client to create a testing roadmap supported by data that aligns with the client’s KPI’s. You’ll then write a spec for the experiments, and will work with engineering to implement and QA the experiment. Once the test is implemented, you’ll run an A/B test, share the results with the client, draw insights from the test, and develop new ideas for testing.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>When you’ve completed your hypothesis backlog and spec, please send an email to <a href='mailto:tom@crometrics.com' rel='nofollow'>tom@crometrics.com</a> and <a href='mailto:chris@crometrics.com' rel='nofollow'>chris@crometrics.com</a>. In the email, include the following: +A cover letter that includes a description of prior AB Testing, agency, and/or management experience. +A link to your LinkedIn profile and the name of the town/city you live in. Note the job is open to US-based applicants only. +Desired annual compensation range (to ensure we’re not wasting one another’s time – we’re not going to hold you to this number) and general availability. +The hypothesis/ideas backlog you created for Hired.com +The spec/wireframe for one of your top hypotheses. Assuming your submission exceeds expectations, we will reach out to schedule a few informal conversations with our team to learn more about you, and provide an opportunity for you to ask questions of us. If all goes well for both you and CROmetrics, we will hire you for a “paid interview” where you start working with us for approximately one week (12-15 hours max) as a 1099 contractor. This can be done on the side of your current full-time job so there is less risk to you. If both parties like working together, we expand the relationship into a full time W2 role. If not, we go our separate ways and both sides “won” in the deal. Thanks again for your interest in the Director of Growth Product Manager position with CROmetrics. We look forward to hearing from you!</p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 30, 2017 8:35:35 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/12",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=12, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/product",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "5YG6DL-_Sjav9lGT-2KlsA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63363",
    "title": "Director of Growth Product Management",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div><h3>What We Do</h3></div><div>Simply put, we make websites easier to use. Through a scientific method of determining which site improvements result in actual performance improvements, we replace the old way of designing sites through gut feel and management opinions with designing sites through data. Tactically speaking, clients come to us for both strategic direction and to supplement their internal teams.</div><div><br></div><div><h3>The Director of Growth Product Management</h3></div><div>As a Director of Growth Product Management at CROmetrics, you will be a player/coach overseeing a team of people who are hybrid product manager, strategic thinker, account manager and data analyst. Your primary role is to enable our product managers to be successful.&nbsp; Since you have done this yourself for a while, you’ll be able to quickly gain the respect of your team in showing them how it’s done while also helping them to develop the skills they’ll need to grow in their own careers.&nbsp; Product Managers spend much of their time interfacing with clients, designers and engineers. On the client side, our Product Managers must be able to generate data-driven ideas that will improve revenue and other key metrics on client websites while being rooted in better understanding what the customer wants.</div><div><br></div><div>Our PMs lead all A/B testing and personalization experimentation for the client, which includes the following:</div><div><br></div><ul><li>Partnering with the client for the ideation, prioritization, road-mapping, design, and approval process for all hypotheses generation and experimentation</li><li>Diving deep into the results to deliver the data story, learnings and recommendations from the experiment</li><li>Collaborating with a remote team of engineers, designers and other PMs to support experiment ideation and execution</li><li>Managing all aspects of the client relationship from daily experiment monitoring to kicking off the renewal process to evangelizing the value of CROmetrics</li></ul><div><br></div><div>The director must be able to do all of these things on their own, and be focused on enabling their team to level up their skills. Expect about 10% travel as you visit key accounts regularly.</div><div><br></div><div>In addition, as a CROmetrics team member, you will:</div><div><br></div><ul><li>Support the professional growth of the team through leading and/or participating in ongoing training, e.g. book club</li><li>Engage in non-client related activities that help grow our business, e.g. writing the PM job description or delivering hypotheses and mock-ups for a sales deck</li><li>Actively participate in our remote culture</li></ul><div><br></div><div>If you don’t have previous management experience, an individual contributor role at CROmetrics might be a possibility. The type of individual contributor who will succeed in this role is strongly correlated with prior management experience since the type of client problems you encounter require solutions that leverage both the client and internal teams typical of strong internal product managers who need to influence teams that don’t report to them.</div><div><br></div><div><h3>Who we’re looking for</h3></div><div>Our most successful candidates have the following skills/experience/traits:</div><div><br></div><ul><li>10+ years of professional experience working in digital product management, user experience design or similar roles on web products.&nbsp; You must have experience running successful, mature A/B testing or personalization programs.&nbsp; Familiarization with Optimizely is a bonus.</li><li>Experience managing other product managers or marketers running optimization programs.</li><li>5+ years experience managing others.</li><li>Demonstrated extremely strong presentation and communication skills</li><li>Built and delivered product roadmaps full of winning and losing ideas</li><li>Passion for using data to&nbsp;improve user experiences</li><li>Hands-on experience analyzing digital business data to inform decisions and plan strategically</li><li>Worked cross-functionally in a highly collaborative environment, preferably in a remote capacity</li><li>Genuinely like working with clients and their distributed stakeholder groups</li><li>Love product strategy, but obsessed with the details on execution</li><li>Lifelong learner</li></ul><div><br></div><div>If you’re interested in checking out the swell people you’ll be working with, click here to&nbsp;<a href='https://crometrics.com/meet-the-team/' rel='nofollow'>learn more about the team.</a></div><div><br></div><div><em>If you have questions as you go through this, make notes and if we haven’t answered them by the end, feel free to email&nbsp;<a href='mailto:chris@crometrics.com' rel='nofollow'>chris@crometrics.com</a>&nbsp;or&nbsp;<a href='mailto:tom@crometrics.com' rel='nofollow'>tom@crometrics.com</a>.</em></div><div><br></div><div><h3>Our Culture</h3></div><ul><li><span>We’re a remote company.</span>&nbsp;We are spread out all over the country and enjoy the flexibility remote working affords. Want to go on a mountain bike ride in the middle of the day? Cool, don’t forget your helmet! Need to pick the kids up from school? Nice, you’ve got parent of the year in the bag. We stay connected through Slack and workcations, including one annual trip that is funded by the company.</li><li><span>Our engineers value elegant code, but move fast.</span>&nbsp;We’re writing code that runs&nbsp;<em>on top of</em>&nbsp;existing websites. Some tests only run for a few days before disappearing (though some do so well they become a permanent part of the client’s site). If “minimum viable product” isn’t in your lexicon, you aren’t a good fit.</li><li><span>Communication is critical.</span>&nbsp;We’re a remote company. That makes communication — including writing and reading comprehension —&nbsp;<em>extremely</em>&nbsp;important. You’ll work closely with engineers, designers and writers. This is not a simple “write specs and close tickets” gig. Successful applicants enjoy the process of defining and clarifying specs, documenting processes,&nbsp;<em>improving</em>&nbsp;processes, seeing their ideas and work affect millions of users, and uploading custom emoji to Slack.</li><li><span>We’re relentlessly focused on our client’s happiness.&nbsp;</span>The PM is a client-facing role. Managing a client relationship virtually takes a different type of skill set – the PMs have to be both a strategic partner, the customer (represented by the data), teacher and project manager over the phone/email/Slack, all while delivering an exceptional level of service. This type of interaction is not for everyone, and we completely understand. It’s not easy!</li><li><span>We are not perfect.&nbsp;</span>A the core of experimentation is the lesson to be learned from the test, whether a win, loss or inconclusive. We extend this concept to everything we do by setting the bar high for our team and fostering an environment of radical candor and constant learning.</li><li>Read more about our culture and core values on our&nbsp;<a href='https://crometrics.com/culture/' rel='nofollow'>culture page</a>.</li></ul><div><br></div><div>This short essay sums up the philosophy we operate by:&nbsp;<a href='http://arches.io/2014/03/this-is-professionalism/' rel='nofollow'>This is Professionalism</a>.</div><div><br></div><div><h3>A unique application and hiring process, just like us</h3></div><div>We’re glad you’re interested in working with us. We have a fairly unusual hiring process, but it has proven to work well both for us and for potential new hires. We have found that demonstrating basic competency is the best predictor of initial qualification for working with us, followed by actual work.</div><div><br></div><div>Our process reflects that. We’ve outlined our values and how we work above, and now we will ask you to complete a couple small tasks to show us you’re interested.</div><div><br></div><div><span>Create A Work Sample</span><br></div><div></div><div><em>The following is a typical task a product manager you’re working with will be doing on a daily basis.&nbsp; Since the position is for a player/coach, we’d like you to demonstrate basic competency as well.&nbsp; Please do not spend more than an hour on this task, as it is intended for you to be able to demonstrate basic competency in the core part of the job you will be doing.</em></div><div><br></div><div>We want to know how you think about designing elegant product solutions focused around increasing conversions.<br></div><div></div><div>Here is the website for a past client:&nbsp;<a href='http://www.hired.com/' rel='nofollow'>Hired.com</a>. Hired spends a lot of money (e.g. through paid ads) to drive applicants, primarily software engineers, to their site. Their goal is to increase the number of leads/applicants that complete the signup flow and are ready to be hired.</div><div><br></div><ol><li>Your first task is to come up with a hypothesis backlog of at least 6-8 ideas you have for improving conversions for&nbsp;<a href='http://hired.com/' rel='nofollow'>Hired.com</a>. An example of a hypothesis is:&nbsp;<em>“Adding a video to the Hired website will help job candidates understand how Hired works and therefore, increase conversions.”</em></li><li>Once you’ve developed your hypothesis backlog, choose one of the ideas that you believe is most likely to increase leads.</li><li>Write a spec for your chosen idea comprised of the user story, any supporting data, expected user or page interactions, engineering notes, etc. Optionally, you may also produce a wireframe and/or a visual to go along with your spec, using any number of UX tools such as Axure, Balsamiq, Invision or even simple pen/paper sketching. Just be sure to submit your spec as an image so anyone can view it without special software.</li></ol><div>In a real-life client situation, you will work with the client to create a testing roadmap supported by data that aligns with the client’s KPI’s. You’ll then write a spec for the experiments, and will work with engineering to implement and QA the experiment. Once the test is implemented, you’ll run an A/B test, share the results with the client, draw insights from the test, and develop new ideas for testing.</div><p><strong>To apply:</strong> When you’ve completed your hypothesis backlog and spec, please send an email to <a href='mailto:tom@crometrics.com' rel='nofollow'>tom@crometrics.com</a> and <a href='mailto:chris@crometrics.com' rel='nofollow'>chris@crometrics.com</a>. In the email, include the following: +A cover letter that includes a description of prior AB Testing, agency, and/or management experience. +A link to your LinkedIn profile and the name of the town/city you live in. Note the job is open to US-based applicants only. +Desired annual compensation range (to ensure we’re not wasting one another’s time – we’re not going to hold you to this number) and general availability. +The hypothesis/ideas backlog you created for Hired.com +The spec/wireframe for one of your top hypotheses. Assuming your submission exceeds expectations, we will reach out to schedule a few informal conversations with our team to learn more about you, and provide an opportunity for you to ask questions of us. If all goes well for both you and CROmetrics, we will hire you for a “paid interview” where you start working with us for approximately one week (12-15 hours max) as a 1099 contractor. This can be done on the side of your current full-time job so there is less risk to you. If both parties like working together, we expand the relationship into a full time W2 role. If not, we go our separate ways and both sides “won” in the deal. Thanks again for your interest in the Director of Growth Product Manager position with CROmetrics. We look forward to hearing from you!</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 30, 2017 8:35:35 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/12",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=12, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/product",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "DAjltcChSDGPVJe0g9K49Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63312",
    "title": "Customer Success Specialist",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>QuickMail is a sales automation tool for sending B2B cold emails. Small and medium businesses use it to reach out to potential customers in their market and grow their business. Because we hit product market fit very fast and are growing rapidly, we’re on the search for enthusiastic people who want to be part of this journey.<br><br>As a 100% customer funded start-up, decisions are made fast between the team for the good of the customers. Working here means a lot of freedom and ability to build close bonds with each user. We strive to be anti-corporate, we remove all possible walls between the users and us to truly deliver an exceptional experience.<br><br>The Role<br>As part of our Customer Success team, you’ll be the first point of contact for users of Quickmail.io, and for potential users who have questions before signing up. You’ll strive to understand their goals or problem, and translate this information into actionable points for them to make the most of Quickmail. <br><br>Your responsibilities will include: <br></p><ul><li>Developing a thorough understanding of Quickmail.io’s capabilities and services. <br></li><li>Own the responsibility for any user issue or query, from origination to full completion. <br></li><li>Ensuring each user’s experience with us is outstanding, and ensuring you always go above and beyond what is required to add even more value. <br></li><li>Investigate the user’s key objectives, and driving their adoption of Quickmail.io’s functionality beyond the expected. <br></li><li>Become a user advocate within the wider Quickmail.io team by identifying common user requirements and challenges and relaying this information to constantly improve what we do. <br></li><li>Provide training and continued support through highly effective relationship management, centred on the customer experience. <br></li><li>Consistently record your interactions with users and further develop our documentation to become the Quickmail.io bible. <br><br>This is an incredibly varied role on a small, growing SaaS startup where no two days will be the same. As a permanent, full-time and remote role, you will have regular contact with the other Customer Success specialists and the Founder.<br><br>What you’ll need: <br><br>Proven experience in a comparable role, supporting users remotely (ideally for a high growth technology company). <br>A strong attention to detail with a customer centric approach. <br>Be an entrepreneurial, pro-active personality with a healthy sense of humour. <br>Outstanding problem solving skills, with a proven ability to simplify concepts, train others and develop relationships.<br>Excellent written and verbal communication skills. <br>Solid understanding of email, desktop and internet technologies. <br>Any experience working within the SaaS industry or within a start-up environment would be highly regarded.<br>Any experience working remotely would be highly beneficial. <br><br>Please note, this role will over US business hours (either PST or ET). You will need to be available Monday - Friday, full-time to be considered, and have a fast and reliable internet connection. <br><br>We value curiosity, self-motivation and outcomes very highly here, and believe these are essential traits you’ll need to be part of our team. To see our core values, check them out here: <a href='http://quickmail.io/values' rel='nofollow'>http://quickmail.io/values</a><br>If this sounds like somewhere you can do your best work, please apply now via the link (including a short note introducing yourself) to rebecca@quickmail.io and we’ll be in touch.</li></ul></span></td><td></td><td></td><td><a href='mailto:rebecca%40quickmail.com?subject=Application%20for%20Customer%20Success%20Specialist%20at%20Quickmail.io&amp;body=Hi%21%0A%0AI%27d%20like%20to%20apply%20for%20your%20position%20for%20a%20Customer%20Success%20Specialist%20at%20Quickmail.io' rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 28, 2017 2:06:38 AM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "hfD4r_bDRsmkz15QuegyVg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4023-kubernetes-solution-engineer-m-f-giant-swarm",
    "title": "Kubernetes Solution Engineer (m/f) @ Giant Swarm",
    "content": "<h2>              Kubernetes Solution Engineer (m/f)<small> @ Giant Swarm</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-11-24 21:28</p></dd>          <dt><span>Description</span></dt>          <dd><h2>We are looking for a Kubernetes Solutions Engineer (m/f)</h2><h3>Your Job:</h3><ul><li><p>You will dive deep into the customer's architecture and needs on their way to Kubernetes and advise them regarding our product, what tools to use, how to do monitoring, CI/CD.</p></li><li><p>First moments are important! So your main job is to create a great onboarding experience for our customers and handle all questions during preparation and installation.</p></li><li><p>You build and maintain recipes or helm charts for important tools that customers might need, fully packaged and documented to run easily on Kubernetes, contributing back to the respective Open Source repositories where possible.</p></li><li><p>You hold trainings and join our sales people for presentations at customers.</p></li><li><p>To sum it up: Customer Success is all that matters. You cover security and process questions and make sure that everything is ready for the customer to get their installation production ready. Furthermore you are happy to support the customer along their journey. Request can vary from general Kubernetes questions to real architecture problem, to modern applications deployments workflow.</p></li><li><p>Ultimately, you are also responsible for documentation and making sure you only need to answer once.</p></li><li><p>Requests can vary from general Kubernetes questions, to problems in using their new infrastructure to real problems in the infrastructure that need more machine room help. Ultimately, you are also responsible for documentation and making sure you only need to answer once.</p></li></ul><h3>Requirements:</h3><ul><li><p>You have experience with more than one programming language, including Go, and a strong architectural background.</p></li><li><p>You are feeling at home in the Kubernetes world, especially the multitude of Open Source tools around Kubernetes and the Container World.</p></li><li><p>You can explain complicated things, concisely and easily for a diverse audience.</p></li><li><p>You have a strong sense to provide an awesome customer service that makes life easier for Developers. Your communication skills (especially written form) are excellent. Very good English skills are a must.</p></li><li><p>Deutschkenntnisse wären ein dicker Pluspunkt.</p></li></ul><h2>Why us?</h2><p>We like to give you a glimpse on how working with Giant Swarm (we are a fully remote team) is like:</p><h3>Self-organization</h3><p>Creative work needs freedom and openness. We encourage you to do your work wherever and whenever you want. We expect passion and encourage sustainability. If you need rest, take it. If you take up a task, own it. If you see a problem, solve it.</p><h3>Teamwork</h3><p>Our ambitious goals are only achievable as a team. Everybody’s input is highly welcome and appreciated. Although sometimes rules and processes are necessary, we try to keep them as lean as possible. Always question the status quo and find new ways of collaboration and team work.</p><h3>Learning</h3><p>Learning is mandatory and fun at the same time. If you realize you want to expand your knowledge in a specific area, we support you with conferences, books etc.</p><h3>Basics</h3><p>We offer fair (transparent and open) salaries with benefits like choosing your own laptop, your choice to work at home or in a coworking space, flexible hours, minimal meetings, transparent communication, etc.. And you will participate in our stock options program. Currently our team members have more children than we are employees. So family friendliness is a must.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Germany</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Nov 24, 2017 11:23:42 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/product",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "pZsgJTO_Tfq7ZkonnnnVQg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5816-product-manager-with-project-management",
    "title": "Lean Startup Co: Product Manager with Project Management Experience (Lean Startup practitioner required)",
    "content": "<div>  <div>    <h2>Product Manager with Project Management Experience (Lean Startup practitioner required)</h2>      <h4>Posted Nov 24</h4>    <h3>      <span>Lean Startup Co</span><br>      <span>Headquarters: San Francisco, CA</span><br>        <a href='https://lean-startup-co.breezy.hr/p/a5458172dce001-product-manager-with-project-management-experience-lean-startup-practitioner-required?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/a5458172dce001-product-manager-with-project-management-experience-lean-startup-practitioner-required?source=weworkremotely</a>    </h3>  </div></div>  <div>    <div>Lean Startup Company offers the most exciting education solutions available today in modern management. We are a startup with&nbsp;<span>global brand recognition</span>&nbsp;headquartered in San Francisco, CA. We bring the entrepreneurial spirit to large organizations through cutting-edge education and modern management techniques. Lean Startup methodology provides a scientific approach and&nbsp;<span>framework for innovation,</span>&nbsp;so you can learn what your customers really want. It’s about testing your vision continuously, so you can effectively adapt and adjust before it’s too late.</div><div><br></div><div><span></span></div><div></div><div><br></div><div><span>ABOUT THE POSITION</span></div><div><br></div><div><span>We're seeking a part-time Product Manager with Project Management experience for</span>&nbsp;<a href='http://www.leanstartup.co/education' rel='nofollow'><span>The Lean Startup Co. Education Program</span></a>&nbsp;to lead the execution of an important initiative that will set the stage for an extraordinary transformation at a large, national organization.</div><div><br></div><div>In this role, your project management expertise and uncanny ability to obtain buy-in at all levels will serve you well. You’ll lead a group of subject matter experts, client stakeholders and creatives to help build and scale a program that will empower its participants to innovate and adapt to market changes using Lean Startup methodology.</div><div><br></div><div>You will make a massive impact in this initiative by leading the team towards the same objective, while managing and prioritizing resources to ensure client needs are met.</div><div></div><div></div><div><br></div><div><span>You’ll Work on Projects Like</span></div><div><br></div><ul><li>Scaling the adoption of Lean Startup methodology across a large organization</li><li>Working with subject matter experts and content creators to develop unique program training materials. Think playbooks and field guides, coach-the-coach curriculum and marketing collateral</li></ul><div></div><div><br></div><div><span>You’ll excel in (and enjoy!) this role if</span></div><div><br></div><ul><li>You have a track record of:</li><li><span>Working with Lean Startup methodology at an intermediate (required)&nbsp;</span>or higher level</li><li>Scaling a methodology (i.e. Lean Startup, Agile, Design Thinking) across a large organization</li><li>Creating a program that embeds a mindset and mechanics of a cultural shift across the organization</li><li>Coordinating, planning, executing, and tracking large scale implementation or organization change projects from beginning to end</li><li>Proactively working with stakeholders to drive initiatives forward, and ensure on time delivery of deliverables</li><li>Facilitating meetings and ensuring alignment across stakeholder groups</li><li>Demonstrating a proactive focus on meeting client and project requirements in a timely and cost effective manner</li><li>Operating under conditions of uncertainty and with minimal guidance</li><li>Maintaining accurate documentation, including timelines, budget updates, meeting notes, and timeframes</li><li>Managing competing priorities and ensuring stakeholders are clear on the path forward</li></ul><div><li>Overseeing stakeholder and team metrics dashboard data</li><li>You are an incredible communicator in virtual video meetings and in writing. People respond quickly to your email requests with the information you need.</li><li>You pride yourself on being proactive, responsive and exceptional at managing expectations.</li><li>You enjoy working collaboratively (yay, for google docs!) and thrive in a fast-paced environment where we love challenging ourselves (in Lean Startup fashion) to build, measure, and learn.</li><li>You are open to feedback, take ownership of your mistakes, and love applying your lessons learned to get 10x better.</li><li>You are familiar with remote working tools such as Slack, Zoom, Google apps</li><li>And finally, you get brownie points if you:</li></div><ul><li>Have remote work experience</li><li>Have experience working with a government client</li></ul><div></div><div><br></div><div><span>You’ll ensure the success of the initiative by</span></div><div><br></div><ul><li><em>Translating vision into execution.</em>&nbsp;You’ll ensure that the stakeholders and everyone involved is crystal clear on what the desired outcome is and you know how to get there with the resources you have available</li><li>Effectively utilizing subject matter experts and specialists to efficiently&nbsp;<em>move projects forward</em>.</li><li><em>Proactively managing people and expectations.</em>&nbsp;You’ll be awesome at ensuring that the right people are in the loop on the various stages of the project and there won’t be any surprises.</li><li><em>Being customer focused</em>. Learn the needs of the client and proactively test and advise the client on best path forward.</li><li><em>Being metrics oriented and business-driven.</em>&nbsp;Sharing your knowledge from past experience scaling programs across organizations to provide guidance on the best path forward.</li><li><em>Clearly communicating scope changes and impact</em>&nbsp;they have on budget and strategy.</li><li><em>Connecting and prioritizing</em>&nbsp;individual initiatives to the overall strategy.</li></ul><div></div><div><br></div><div><span>Why You’ll Love Working With Us</span></div><div><br></div><ul><li>We’re a 100% remote team using fun collaborative tools.</li><li>We encourage unplugging and prefer you don’t check email while you’re away.</li><li>Our clients are some of the largest companies in the world and you get a front row seat to the challenges they’re facing around innovation. Better yet, you get to help them solve their problems.</li><li>The work we do will go down in history as powerfully-transformative.</li><li>Experience the thrill and challenge of working in a fast-paced, growing startup.</li></ul><div></div><div><br></div><div>This is a contract-based, freelance role. The&nbsp;<span>position is remote</span>, but we ask that you’re 1) located in&nbsp;<span>the U.S</span><span>.</span>&nbsp;and 2) available to communicate during Pacific Time business hours.</div><div><br></div><div>*<span>Note</span>&nbsp;- We understand that you are eager to hear back from us. We receive a lot of applications and cannot respond to all of them. Please do not reach out to us regarding your application. If there is a mutual fit, we will contact you to move forward with the next steps in the process.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://lean-startup-co.breezy.hr/p/a5458172dce001-product-manager-with-project-management-experience-lean-startup-practitioner-required?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/a5458172dce001-product-manager-with-project-management-experience-lean-startup-practitioner-required?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 24, 2017 4:10:57 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/manager",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "100% remote",
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "I1qcoiEESaGDhu1IpN9YEw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3998-software-engineer-integrations-f-m-chartmogul",
    "title": "Software Engineer - Integrations (f/m) @ ChartMogul",
    "content": "<h2>              Software Engineer - Integrations (f/m)<small> @ ChartMogul</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-11-23 20:19</p></dd>          <dt><span>Description</span></dt>          <dd><p>One of ChartMogul's engineering challenges is building and maintaining a large number of third-party integrations which our customers rely on - from Stripe, Braintree and Recurly (and 9 others) who manage our customers' billing, to other services like Clearbit and Intercom which let our customers enrich their data further. And as we grow, we're going to build even more integrations.</p><p>The Software Engineer - Integrations will be responsible for building and maintaining integrations with ChartMogul. It's a position with end-to-end responsibility to design, build, launch and support integrations that you build in collaboration with Product Management. Some new integrations in the pipeline are with Salesforce, Slack, Segment, and Shopify. We also plan to upgrade some of our existing integrations like the one with PayPal.</p><p>This is a full-time remote position.</p><p><strong>Requirements</strong></p><ul><li>Several years experience building and maintaining high availability web software.</li><li>You're comfortable developing and deploying in a micro-services environment.</li><li>You have extensive experience working with different kinds of APIs.</li><li>Experience in Ruby or Python and at least one other language.</li><li>Experience working on multiple simultaneous projects.</li><li>Fluent, professional English.</li></ul><p><strong>Nice to have</strong></p><ul><li>Exposure to e-commerce, billing systems, or subscriptions.</li><li>Experience working as a remote software engineer.</li><li>Experience with the Go programming language.</li><li>Prior experience with the ChartMogul API.</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Nov 23, 2017 10:19:14 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/python",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go",
      "python",
      "ruby"
    ]
  },
  {
    "id": "oNHXXx3JRomzNmsnFrEQMA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63262",
    "title": "Software Engineer Integrations",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>One of ChartMogul's engineering challenges is building and maintaining a large number of third-party integrations which our customers rely on - from Stripe, Braintree and Recurly (and 9 others) who manage our customers' billing, to other services like Clearbit and Intercom which let our customers enrich their data further. And as we grow, we're going to build even more integrations.<br><br>The Software Engineer - Integrations will be responsible for building and maintaining integrations with ChartMogul. It's a position with end-to-end responsibility to design, build, launch and support integrations that you build in collaboration with Product Management. Some new integrations in the pipeline are with Salesforce, Slack, Segment, and Shopify. We also plan to upgrade some of our existing integrations like the one with PayPal.<br><br>This is a full-time remote position.<br><br><strong>Requirements</strong><br><br></p><ul><li>Several years experience building and maintaining high availability web software.<br></li><li>You're comfortable developing and deploying in a micro-services environment.<br></li><li>You have extensive experience working with different kinds of APIs.<br></li><li>Experience in Ruby or Python and at least one other language.<br></li><li>Experience working on multiple simultaneous projects.<br></li><li>Fluent, professional English.<br><br><strong>Nice to have</strong><br><br></li><li>Exposure to e-commerce, billing systems, or subscriptions.<br></li><li>Experience working as a remote software engineer.<br></li><li>Experience with the Go programming language.<br></li><li>Prior experience with the ChartMogul API.</li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 23, 2017 10:19:14 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/python",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go",
      "python",
      "ruby"
    ]
  },
  {
    "id": "c5cxugfGTDC6fq2OcSqBKw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/63578/graduate-or-student-recruiter-work-from-home-at-365-talent-portal/",
    "title": "Graduate or student recruiter - work from home",
    "content": "Are you a student or recent graduate?<br />Would you like to learn how to find, select, interview and place candidates?<br />Would you like to build strong customer service skills?<br />Would you like an interesting career start in a dynamic start-up environment?<br /><br />If you do, please read on!<br /><br />*The company*<br /><br />365 Talent Portal is an international career hub for Microsoft technology consultants and the companies that need to hire them. Our company is a fast growing start-up which has members in 115 countries across the globe. We work with small and medium businesses and enterprise multi-national organisations.<br /><br />We are looking to hire new talent to help our customers to find the perfect candidates. Most of our customers are currently in the UK and the US.<br /><br />*Our Culture*<br /><br />We’re a friendly group of people who have built a participative working environment where everyone can contribute and learn from each other. We value good communication, hard work, lots of fun, great ideas (but good ideas work for us as well!), and self-motivation. We also help our team members blossom through regular coaching, guidance, and advice.<br /><br />What we can offer you:<br />- A flexible work environment with the possibility to work from home at the hours you want.<br />- The opportunity to work and earn an income while studying or working on other part-time projects.<br />- The chance to learn or perfect sought-after skills such as candidate selection and customer service.<br />- Thorough, ongoing training and support to help you reach your goals.<br />- An energetic team of qualified professionals who are always happy to help.<br /><br />*Job Description*<br /><br />The main goal of the Recruiter will be to find the right candidate for each role, and the right role for each candidate. It’s a great opportunity for a student or graduate who is interested in learning about:<br />- How to look for candidates, screen CVs, conduct phone interviews.<br />- How to provide CV and interviewing advice to candidates.<br />- How to advise and provide feedback to employers.<br /><br />Responsibilities:<br />- Match the job descriptions from our clients to the consultants we have on our books or go externally to look for new candidates.<br />- Interview and shortlist candidates (training and mentoring will be provided).<br />- Keep track of the status of each candidate’s application.<br />- Update our customers on the progress of our work.<br />- Learn how to provide CV and career advice.<br />- Work closely with 365 Talent Portal marketing and sales towards achieving team targets.<br /><br />*Career Track*<br /><br />The benefit of working for a start-up is that you can develop in many different directions. Here are a couple of examples of possible career progression paths:<br />- Become a senior recruiter or recruitment team leader.<br />- Explore other company activities and learn new skills.<br /><br />*Working Environment*<br /><br />We are based in London. You will be given the option to either work from home or to work from our London offices.<br /><br />We meet on a regular basis, talk few times a day on the phone, exchange emails, IM and talk through social media. We also hold company meetings once a month in our London offices.<br /><br />*Hours*<br /><br />This role requires that you work at least 20 hours per week. However, we are not a 9-5 organisation. We would expect certain work to be done and you can do it anytime that suits you.<br /><br />*Profile and qualifications*<br /><br />We need team members who can take responsibility for their own workload and who are able to seek support when they need it. Some recruitment or account management experience would be an advantage, but we will consider anyone who has the right attitude and skills.<br /><br />Skills required:<br />- Excellent written and spoken communication skills<br />- Able to communicate professionally with customers<br />- Well organised with an eye for detail<br />- Good at tracking data<br />- Self-motivated and responsible<br />- ‘Start-up spirit’: wants to be a part of a new company’s growth<br />- Able to work as part of a team<br />- Keen to learn and curious<br /><br />• You must be based in the EU and eligible to work in the UK (UK-based candidates preferred)<br />• You must be able to speak and write English fluently<br /><br />*Compensation*<br /><br />Minimum guaranteed income of £500 per month for 20 hours of work per week. You will earn commission on each of your placements, and we will guide and help you to increase your earnings consistently.<br /><br />*How to apply*<br /><br />If you are interested, send us your CV and a cover letter explaining why you think you would be a good candidate. Please note that we will only consider applications which include a cover letter.",
    "urlFetchPending": false,
    "published": "Nov 20, 2017 1:17:21 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/unknown",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "qPvmIQ5PQn-cricHS-VzVA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3987-software-engineer-go-status-im",
    "title": "Software Engineer (Go) @ Status.im",
    "content": "<h2>              Software Engineer (Go)<small> @ Status.im</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-11-17 19:38</p></dd>          <dt><span>Description</span></dt>          <dd><p>Status</p><p>Status is a fast growing, completely decentralized startup developing powerful DApps (decentralized apps) for Ethereum that change the way we do things on the web. To do this we need passionate, talented &amp; self motivated candidates to join our global decentralized team.</p><p>As a product, Status is an open source discovery tool for Ethereum that makes it easy for anyone to access DApps and services built on the decentralized web. Status also allows users to chat, make payments and more, securely using Ethereum’s protocols.</p><p>Opportunity</p><p>It’s still just the beginning, but the promise of Web 3.0 and Ethereum is here to stay. Our secret weapon is having passionate people on a mission to develop the gateway into this new world. If you want to be part of this adventure, join our disruptive distributed global team.</p><p>Job role</p><p>You will be part of our development team and will be responsible for shaping, developing and implementing our product, while ensuring that we are at the leading edge of technology. Our Development team has a strong desire to learn new things and continually improve themselves, we are looking for someone with a “can do anything” mentality. </p><p>Responsibilities</p><p>Deliver high quality services from designing and iterating new features into production in short sprint cyclesSet up complex development, test and production environmentsCollaborate cross-functionally to inform about design and architectural decisionsMaintain and make use of a good overview of the overall technology stackWork closely together with other engineering disciplines to ensure seamless user experience and efficient overall architectureShape, facilitate and survey coding guidelines and quality standardsIndependently focus on continuous learning and improvement and drive the evolution of our engineering practice</p><p>Requirements</p><p>5+ years experience building complex applicationsHands-on experience with GoYou must be comfortable working with an existing codebaseYou are excited by P2P technologies and cryptocurrenciesStrong software engineering practicesAbility to pick up new technologies quicklyFluency in written and spoken English</p><p>Working at Status</p><p>Status is a decentralized organization. You will not have a boss or a work schedule. What you will have is responsibility to your collaborators to do your best, keep up with your responsibilities, and support your team's priorities. At Status we are all working toward the goal of expanding and supporting the Ethereum space.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 9:35:04 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "LRvVNCbgR6aBPV7YxYS5rQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/158014/go-agent-engineer-apm-elasticsearch-elastic?a=QZz4tuIKsUM",
    "title": "Go Agent Engineer - APM - Elasticsearch at Elastic () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Data &amp; Analytics, Search, Software Development / Engineering</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>501-1k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>At Elastic, we have a simple goal: to solve the world's data problems with products that delight and inspire. As the company behind the popular open source projects — Elasticsearch, Kibana, Logstash, and Beats — we help people around the world do great things with their data. From stock quotes to Twitter streams, Apache logs to WordPress blogs, our products are extending what's possible with data, delivering on the promise that good things come from connecting the dots. The Elastic family unites employees across 30+ countries into one coherent team, while the broader community spans across over 100 countries.</p><p>Innovation at Elastic never stops and we are excited to have recently been joined by the amazing team from Opbeat who are currently working hard to fully integrate their Application Performance Monitoring solution into the Elastic Stack.&nbsp;<strong>Welcome Elastic APM!</strong>&nbsp;We are currently making major changes to the product as we integrate it with the Elastic Stack, and we are now looking for a talented&nbsp;<strong>Go Engineer</strong>&nbsp;to join the team as soon as possible.</p><p>As our first Go agent engineer on the APM team, you will be owning the exciting efforts of adding Go support to APM. Your primary task will be to develop our open source Go agent, take ownership for the feature roadmap, ensuring that the resource footprint is minimal. You will also be engaging with the open source Go community.</p><p>You will also collaborate closely with the APM Server team when adding new features to the server API and with the UI team to ensure that we deliver the best possible experience for Go developers.</p><p>You will become part of a team developing a high quality APM product aimed to help fellow developers successfully and expertly instrument, debug, and monitor their applications.</p><p><strong>What</strong>&nbsp;<strong>you</strong>&nbsp;<strong>will</strong>&nbsp;<strong>be</strong>&nbsp;<strong>doing</strong></p><ul><li>Work on a completely new and exciting Elastic project</li><li>Develop and be responsible for the Go agent for Elastic APM</li><li>The agent is open-source, so the job includes handling community pull requests, issues, etc</li><li>Collaborate with your fellow Engineers on APM Server and UI teams</li></ul><p><strong>What</strong>&nbsp;<strong>you</strong>&nbsp;<strong>will</strong>&nbsp;<strong>bring</strong>&nbsp;<strong>along</strong></p><ul><li>3+ years of professional and in-depth experience with Go</li><li>Previous APM experience is considered a big asset</li><li>Ability to work independently in a globally distributed team</li></ul><p><strong>Additional</strong>&nbsp;<strong>Information</strong></p><ul><li>Competitive pay and benefits</li><li>Option to work 100% remote or from any office</li><li>Stock options</li><li>Catered lunches, snacks, and beverages in most offices</li><li>An environment in which you can balance great work with a great life</li><li>Passionate people building great products</li><li>Employees with a wide variety of interests</li><li>Your age is only a number. It doesn't matter if you're just out of college or your children are; we need you for what you can do.</li><li>Distributed-first company with employees in over 30 countries, spread across 18 time zones, and speaking over 30 languages! Some even fly south for the winter :)</li></ul><p>Elastic is an Equal Employment employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status or any other basis protected by federal, state or local law, ordinance or regulation. Elastic also makes reasonable accommodations for disabled employees consistent with applicable law.</p>                    </div>                            <h2>                About Elastic            </h2>            <div><p>Elastic is the world's leading software provider for making structured and unstructured data usable in real time for search, logging, security, and analytics use cases. Founded in 2012 by the people behind the Elasticsearch, Kibana, Beats, and Logstash open source projects, Elastic's global community has more than 80,000 members across 45 countries, and since its initial release. Elastic's products have achieved more than 100 million cumulative downloads. Today thousands of organizations, including Cisco, eBay, Dell, Goldman Sachs, Groupon, HP, Microsoft, Netflix, <em>The New York Times</em>, Uber, Verizon, Yelp, and Wikipedia, use the Elastic Stack, X-Pack, and Elastic Cloud to power mission-critical systems that drive new revenue opportunities and massive cost savings. Elastic is backed by more than $104 million in funding from Benchmark Capital, Index Ventures, and NEA; has headquarters in Amsterdam, the Netherlands, and Mountain View, California; and has over 400 employees in more than 30 countries around the world.</p><p><strong>Additional Information</strong></p><ul><li>Competitive pay and benefits</li><li>Stock options</li><li>Catered lunches, snacks, and beverages in most offices</li><li>An environment in which you can balance great work with a great life</li><li>Passionate people building great products</li><li>Employees with a wide variety of interests</li><li>Your age is only a number. It doesn't matter if you're just out of college or your children are; we need you for what you can do.</li></ul><p>Elastic is an Equal Employment employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status or any other basis protected by federal, state or local law, ordinance or regulation. Elastic also makes reasonable accommodations for disabled employees consistent with applicable law.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 401k Matching Up to 6 % in US and Pensions in some other countries                            </div>                            <div>                                 Health Care Insurance                            </div>                            <div>                                 Vacation Time Determined By Location                            </div>                            <div>                                 Lunch and Breakfast in Most Offices                            </div>                            <div>                                 100% Remote work possible                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, avail, allow, abl, possibl, permit)",
      "DBG:surround``2W(100, remot)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG_TECH1:k/t/w:go/go/27",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=27, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH2/apm",
      "TECH2/go",
      "TECH2/monitoring",
      "TECH2/performance",
      "TITLE1/data",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "apm",
      "go",
      "monitoring",
      "performance"
    ]
  },
  {
    "id": "S-eg-u_xSfG4XzW038wPUA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/154999/software-engineer-site-reliability-and-sticker-mule?a=PYSg6bMYPZK",
    "title": "Software engineer: site reliability and infrastructure at Sticker Mule () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>eCommerce, Manufacturing</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>What you'll do</strong></p><p>1. Design, build and maintain tools to develop, test and deploy services efficiently.</p><p>2. Work to continually improve the performance, reliability and security of the StickerMule cloud infrastructure.</p><p>3. Collaborate with team leads and stakeholders to ensure that we’re always building the best possible solution in the optimal way.</p><p>4. Participate in peer code reviews.</p><p>5. Share expertise with other members of the team, mentor junior developers.</p><p><strong>About you</strong></p><p>1. You have a minimum of 3 years professional software development experience.</p><p>2. You’re highly competent in multiple general purpose languages, like Go, Ruby, and JavaScript.</p><p>3. You have Linux roots, you contain with Docker, you schedule with Kubernetes.</p><p>4. You don’t run away if you see a Bash script.</p><p>5. You have multi-cloud practical experience, AWS and Google Cloud would be especially beneficial.</p><p>6. You implemented and used logging, monitoring and distributed tracing systems.</p><p>7. You possess strong analytical and critical thinking skills.</p><p>8. You have great written and verbal communication skills in English.</p><p><strong>Application requirements</strong></p><p>1. Applicants will be sent a Hackerrank test within 1-3 business days of applying.</p><p>2. Test must be completed within 5 business days.</p><p><strong>Apply here only</strong></p><p><a href='https://www.stickermule.com/jobs?job=5fa3b36b-7700-4bbf-8137-cacee65bc805&amp;title=sr-frontend-developer' rel='nofollow'>https://www.stickermule.com/jobs?job=5fa3b36b-7700-4bbf-8137-cacee65bc805&amp;title=sr-frontend-dev…</a></p>                    </div>                            <h2>                About Sticker Mule            </h2>            <div><p>Sticker Mule is the Internet's fastest growing printing company. We are privately-owned, profitable and powered by an outstanding remote team that supports the growth of our manufacturing operations. We aim to build one of the Internet’s best technical teams. Currently, our development team operates in 8 countries and we’re always looking for more exceptional developers to join us.</p><p><strong>Why we enjoy working here</strong></p><p>1. We work flexible hours with an asynchronous culture.</p><p>2. We work at a sustainable pace without unreasonable external deadlines.</p><p>3. Varied, interesting technical challenges to work on.</p><p>4. Opportunities to make a large impact as part of a small, highly motivated team.</p><p><strong>What we look for</strong> <a href='https://www.stickermule.com/blog/characteristics-we-look-for-in-team-members' rel='nofollow'>https://www.stickermule.com/blog/characteristics-we-look-for-in-team-members</a></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible hours with asynchronous culture.                            </div>                            <div>                                 Sustainable work pace without unreasonable expectations or deadlines.                            </div>                            <div>                                 Varied, interesting technical challenges.                            </div>                            <div>                                 Opportunities to make a large impact as a small team.                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:bash/other/2",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=2, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/other",
      "TECH1/ruby",
      "TECH2/amazon-web-services",
      "TECH2/go",
      "TECH2/google-cloud-platform",
      "TECH2/javascript",
      "TECH2/ruby",
      "TITLE1/admin",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "go",
      "google-cloud-platform",
      "javascript",
      "other",
      "ruby"
    ]
  },
  {
    "id": "oPsAu-nUSXiKNtBDep0Rmg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/121412/site-reliability-engineer-m-f-giant-swarm-gmbh?a=EIviqmnOTXW",
    "title": "Site Reliability Engineer (m/f) at Giant Swarm GmbH (Cologne, Germany) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Giant Swarm is a leader in cloud native infrastructures and provides managed Kubernetes clusters to run containerized applications both on-premises and in the cloud.</strong></p><p><br>We are looking for a new Team member (m/f)&nbsp;</p><p><strong>Your Job:</strong></p><p>You understand how systems work and tweak their behavior to your needs?</p><ul><li>You will design, build, and maintain our core infrastructure</li><li>You will be responsible for our monitoring, logging, alerting</li><li>You will automate all the things</li></ul><p><strong>Skills &amp; Requirements</strong></p><p><strong>Requirements</strong>:</p><ul><li>You have a wide experience in Networking, Security, Linux (Kernel, Namesspaces, cgroups)</li><li>You must have knowledge in docker, kubernetes and CoreOS</li><li>You know the good and bad parts of Chef, Puppet, Ansible or Saltstack</li><li>You like reverse and performance engineering</li><li>You automate all the things by writing code. Using bash scripts for it makes you sad :)</li><li>You have coding skills. Go is our current favorite</li></ul><p>Bonus point: You had a look into projects like Project Calico, Prometheus, Vault, Ceph<br>Bonus Point 2: You have practical experience with IPMI and Arista (or Cisco) switches</p>                    </div>                            <h2>                About Giant Swarm GmbH            </h2>            <div><p><strong>WHY US?</strong></p><p>We would like to give you a glimpse on how working with us will be like:</p><p><strong>Self-organization</strong></p><p>Creative work needs freedom and openness. We encourage you to do your work wherever and whenever you want. We expect passion and encourage sustainability. If you need rest, take it. We don't count holidays - we count outcome.</p><p><strong>Teamwork</strong>&nbsp;</p><p>Our ambitious goals are only achievable as a team. Everybody’s input is highly welcome and appreciated. Although sometimes rules and processes are necessary, we try to keep them as lean as possible. Always question the status quo and find new ways of collaboration and team work.</p><p><strong>Learning</strong></p><p>Learning is mandatory and fun at the same time. If you realize you want to expand your knowledge in a specific area, we support you with conferences, books etc.</p><p><strong>Basics&nbsp;</strong></p><p>We offer fair (transparent and open) salaries with benefits like choosing your own laptop, jobticket, coffee flat, mate etc.. And you will participate in our stock options program. Currently our team members have more children than we are employees. So family friendliness is a must. We base our teamwork on trust and appreciation. &nbsp;</p><p>Interested? Questions? Coffee? Just contact Oliver. If you want to apply directly, please use our&nbsp;tool.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 unlimited holidays                            </div>                            <div>                                 fair and transparent open salaries                            </div>                            <div>                                 familiy friendlyness is a must                            </div>                            <div>                                 jobticket                            </div>                            <div>                                 choose the time you want to work                            </div>                            <div>                                 choose the devices you want to work with                            </div>                            <div>                                 remote work possible                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, avail, allow, abl, possibl, permit)",
      "DBG_TECH1:k/t/w:bash/other/1",
      "DBG_TECH1:k/t/w:coffeescript/frontend/2",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/2",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=1, dotnet=0, c=0, mobile=0, go=3, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/go",
      "TECH1/nodejs",
      "TECH2/docker",
      "TECH2/go",
      "TECH2/kubernetes",
      "TECH2/linux",
      "TITLE1/admin",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "docker",
      "frontend",
      "go",
      "kubernetes",
      "linux",
      "nodejs"
    ]
  },
  {
    "id": "Bk3HtJprRiqFMVYOrPVZng",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159735/operations-engineer-daily-kos-kos-media-llc?a=RzlIfH6VdMQ",
    "title": "Operations Engineer at Daily Kos (Kos Media LLC) (Oakland, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Digital Media</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are seeking a self-sufficient, operations-at-scale experienced remote worker (U.S. residents only) who:</p><ul><li><ul><li>Proficient in Ruby, Python or Go</li><li>Veteran of Linux and Bash (Shell Scripting)</li><li>Deep knowledge of AWS or similar Cloud Services Provider</li><li>Skilled with docker, docker-compose, and other docker development tools</li><li>Production experience with AWS ECS, Kubernetes, Nomad or similar Task Scheduler</li><li>Knowledgeable about Hashicorp tools, specifically Packer, Consul and Vault</li><li>Informed on ETL processes and techniques</li><li>Comfortable working with very large data sets</li></ul></li></ul><p>At Daily Kos, we believe that the diversity of ideas, experiences and cultures that our employees contribute to our organization help us be more effective in our work, and we are proud to be an inclusive and equal-opportunity workplace. We're a company that loves learning and supports growth and training for all our employees.</p><p>To apply, please send an email to <a href='mailto:tech_jobs@dailykos.com' rel='nofollow'>tech_jobs@dailykos.com</a> with the name of the position in the subject line, a cover letter, code sample or github repo and your resume (include your LinkedIn profile link).</p>                    </div>                            <h2>                About Daily Kos (Kos Media LLC)            </h2>            <div><p>DailyKos, the leading online progressive blogging and activism platform, is looking for an Infrastructure &amp; Backend Developer. DailyKos is a great place to work-- your code will be used by hundreds of thousands of people a day who care deeply about progressive politics and are working to effect real political change. We provide an extensive feature set that extends from blogging to activism and beyond. If you want a job that provides more than just a technical challenge, we'd love to hear from you.</p><p>The job offers a flexible work environment, the ability to work remotely on a distributed team of self-sufficient collaborators, competitive salary and benefits, and we provide an Apple MacBook Pro or your comparable preferred hardware. Our organizations commitment to personal growth reduces churn and encourages a very rewarding long term position. We have an energized team filled with great people with different backgrounds.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 100% Medical Coverage                            </div>                            <div>                                 6 weeks paid vacation per year                            </div>                            <div>                                 401K Plan                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG_TECH1:k/t/w:bash/other/1",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:shell/other/2",
      "DBG_TECH1:techWeightMap:{python=2, other=3, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TECH1/other",
      "TECH1/python",
      "TECH2/amazon-web-services",
      "TECH2/go",
      "TECH2/linux",
      "TECH2/python",
      "TECH2/ruby",
      "TITLE1/admin",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "go",
      "linux",
      "other",
      "python",
      "ruby"
    ]
  },
  {
    "id": "jyEo3VXeT_GUYaT9eI_j8w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/160144/platform-engineer-for-containers-m-f-giant-swarm-gmbh?a=RHQYJlgM27C",
    "title": "Platform Engineer for Containers (m/f) at Giant Swarm GmbH () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Your Job:</strong></p><ul><li>You will be responsible for architecting and building distributed systems</li><li>You will use a wide variety of open source technologies and tools</li><li>You take part for testing, metrics, continuous integration</li></ul><p><strong>Requirements</strong>:</p><ul><li>You have experience with more than one language and a strong architectural background. One of these languages is Go.</li><li>You love to automate things and you are used to deploy in production multiple times a day</li><li>You are a profound Linux user</li><li>You have worked with docker, experiences with kubernetes, prometheus are a bonus point</li><li>You prefer to build your applicatinons as multiple services instead of a monolith</li><li>You know the concepts of CAP theorem, paxos/raft concensus, distributed databases and message passing</li></ul>                    </div>                            <h2>                About Giant Swarm GmbH            </h2>            <div><p><strong>WHY US?</strong></p><p>We would like to give you a glimpse on how working with us will be like:</p><p><strong>Self-organization</strong></p><p>Creative work needs freedom and openness. We encourage you to do your work wherever and whenever you want. We expect passion and encourage sustainability. If you need rest, take it. We don't count holidays - we count outcome.</p><p><strong>Teamwork</strong>&nbsp;</p><p>Our ambitious goals are only achievable as a team. Everybody’s input is highly welcome and appreciated. Although sometimes rules and processes are necessary, we try to keep them as lean as possible. Always question the status quo and find new ways of collaboration and team work.</p><p><strong>Learning</strong></p><p>Learning is mandatory and fun at the same time. If you realize you want to expand your knowledge in a specific area, we support you with conferences, books etc.</p><p><strong>Basics&nbsp;</strong></p><p>We offer fair (transparent and open) salaries with benefits like choosing your own laptop, jobticket, coffee flat, mate etc.. And you will participate in our stock options program. Currently our team members have more children than we are employees. So family friendliness is a must. We base our teamwork on trust and appreciation. &nbsp;</p><p>Interested? Questions? Coffee? Just contact Anna. If you want to apply directly, please use our&nbsp;tool.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 unlimited holidays                            </div>                            <div>                                 fair and transparent open salaries                            </div>                            <div>                                 familiy friendlyness is a must                            </div>                            <div>                                 jobticket                            </div>                            <div>                                 choose the time you want to work                            </div>                            <div>                                 choose the devices you want to work with                            </div>                            <div>                                 remote work possible                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, avail, allow, abl, possibl, permit)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/2",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/2",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/go",
      "TECH1/nodejs",
      "TECH2/go",
      "TECH2/kubernetes",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend",
      "go",
      "kubernetes",
      "nodejs"
    ]
  },
  {
    "id": "4MFKdH8UQqeCvwArYbBaQw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/jobs/5762-software-engineer-nomad",
    "title": "HashiCorp: Software Engineer - Nomad",
    "content": "<div>  <div>    <h2>Software Engineer - Nomad</h2>      <h4>Posted Nov 14</h4>    <h3>      <span>HashiCorp</span><br>      <span>Headquarters: San Francisco, CA</span><br>        <a href='http://www.hashicorp.com' rel='nofollow'>www.hashicorp.com</a>    </h3>  </div></div>  <div>    <div><span>On the Nomad team, we develop tools for service deployment and batch job scheduling. Our customers place a high level of trust in us, relying on our tools to operate their own infrastructure and software effectively, and so we care deeply about reliability and performance.</span></div><div><br></div><div><span>At HashiCorp, we value top-notch collaboration and communication skills, both among internal teams and in how we interact with our users. We take care to balance and be responsive to the needs of our open source community as well as our enterprise level customers.</span></div><div><br></div><div><span>Engineering at HashiCorp is largely a remote team. While prior experience working remotely isn't required, we are looking for team members who perform well given a high level of independence and autonomy.</span></div><div><br></div><div><span>In your cover letter, please describe why you're interested in working at HashiCorp, and what draws you to this role in particular! &nbsp;Specifics of your past experience that are relevant to this role are great to include, too.</span></div><div><br></div><div><h4><span>In this role, you can expect to:</span></h4></div><ul><li><span>Work on next-generation distributed systems for infrastructure management</span></li><li><span>Develop novel algorithms within the context of our open source tools</span></li><li><span>Build and architect systems for managing extremely large-scale global fleets of resources</span></li><li><span>Interface directly with internal teams, users and HashiCorp customers, and represent HashiCorp well to the large Nomad community</span></li><li><span>Own the full lifecycle of feature development from design through testing and release</span></li><li><span>Program mostly in Golang, learning from and contributing to a team committed to continually improving their skills</span></li></ul><div><h4><span>You may be a good fit for our team if:</span></h4></div><ul><li><span>You’re familiar with systems engineering, with networking and operating systems, and are comfortable with low-level programming</span></li><li><span>You have prior experience working in high performance or distributed systems; while we strive to hire at a variety of experience levels, this particular opening is not well-suited for recent graduates</span></li><li><span>You can knowledgeably discuss tradeoffs in distributed systems, such as those made for debugging and performance</span></li><li><span>You're familiar with the pieces of typical modern infrastructure: secret storage, service discovery, etc</span></li><li><span>You’re able to reason about performance, security, and user interactions in complex systems</span></li></ul><div><span>At HashiCorp, we are committed to hiring and cultivating a diverse team. If you are on the fence about whether you meet our requirements, please apply anyway!</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://www.hashicorp.com/jobs/825723' rel='nofollow'>https://www.hashicorp.com/jobs/825723</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 15, 2017 1:24:22 AM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "LDXz98htSSuSTOw17_1JmA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/jobs/5730-sr-fullstack-engineer",
    "title": "Sticker Mule: Sr. fullstack engineer",
    "content": "<div>  <div>    <h2>Sr. fullstack engineer</h2>      <h4>Posted Nov 10</h4>    <h3>      <span>Sticker Mule</span><br>      <span>Headquarters: New York, NY</span><br>        <a href='https://www.stickermule.com/blog' rel='nofollow'>https://www.stickermule.com/blog</a>    </h3>  </div>    </div>  <div>    <div>Sticker Mule is the Internet's fastest growing printing company. We are privately-owned, profitable and powered by an outstanding remote team that supports the growth of our manufacturing operations. We aim to build one of the Internet’s best technical teams. Currently, our development team operates in 8 countries and we’re always looking for more exceptional developers to join us.&nbsp;</div><div></div><div><br></div><div></div><div><b>Why we enjoy working here</b>&nbsp;<br></div><div></div><div>1. We work flexible hours with an asynchronous culture.&nbsp;<br></div><div></div><div>2. We work at a sustainable pace without unreasonable external deadlines.&nbsp;<br></div><div></div><div>3. Varied, interesting technical challenges to work on.&nbsp;<br></div><div></div><div>4. Opportunities to make a large impact as part of a small, highly motivated team.&nbsp;<br></div><div></div><div></div><div><br></div><div></div><div><b>What you will do</b>&nbsp;<br></div><div></div><div>1. Design, build, test, deploy and maintain web applications and services.&nbsp;<br></div><div></div><div>2. Write clean, performant code in accordance with our team's code style guidelines.&nbsp;<br></div><div></div><div>3. Work to improve and maintain the code health of all of our software.&nbsp;<br></div><div></div><div>4. Collaborate with team leads and stakeholders to ensure that we're always building the best possible solution in the optimal way.&nbsp;<br></div><div></div><div>5. Participate in peer code reviews.&nbsp;<br></div><div></div><div>6. Share expertise with other members of the team and mentor junior developers.&nbsp;<br></div><div></div><div></div><div><br></div><div></div><div><b>Requirements</b>&nbsp;<br></div><div></div><div>1. 3+ years of professional software development experience.&nbsp;<br></div><div></div><div>2. High competency in at least one of the following languages: JavaScript, Ruby, or Go.&nbsp;<br></div><div></div><div>3. Strong analytical and critical thinking skills.&nbsp;<br></div><div></div><div>4. Strong written and verbal communication skills in English.&nbsp;<br></div><div></div><div>5. Experience with microservices/SOA or DevOps would be beneficial.&nbsp;<br></div><div></div><div></div><div><br></div><div></div><div><b>Application requirements</b>&nbsp;<br></div><div></div><div>1. Applicants will be sent a Hackerrank test within 1-3 days of applying.&nbsp;<br></div><div></div><div>2. Test must be completed within 5 days.&nbsp;</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here only: <a href='https://www.stickermule.com/jobs?job=178e2cdf-2e15-47e8-9d32-b24ac89032bf&amp;title=sr-fullstack-engineer' rel='nofollow'>https://www.stickermule.com/jobs?job=178e2cdf-2e15-47e8-9d32-b24ac89032bf&amp;title=sr-fullstack-engineer</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 10, 2017 9:22:22 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go",
      "ruby"
    ]
  },
  {
    "id": "hfj8gJEBRKeKknOoezVi3A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-sysadmin",
    "url": "https://weworkremotely.com/jobs/5728-software-engineer-site-reliability-and",
    "title": "Sticker Mule: Software engineer: site reliability and infrastructure",
    "content": "<div>  <div>    <h2>Software engineer: site reliability and infrastructure</h2>      <h4>Posted Nov 10</h4>    <h3>      <span>Sticker Mule</span><br>      <span>Headquarters: New York, NY</span><br>        <a href='https://www.stickermule.com/blog' rel='nofollow'>https://www.stickermule.com/blog</a>    </h3>  </div>    </div>  <div>    <div>Sticker Mule is the Internet's fastest growing printing company. We are privately-owned, profitable and powered by an outstanding remote team that supports the growth of our manufacturing operations. We aim to build one of the Internet’s best technical teams. Currently, our development team operates in 8 countries and we’re always looking for more exceptional developers to join us.&nbsp;</div><div></div><div><br></div><div></div><div><b>Why we enjoy working here</b>&nbsp;<br></div><div></div><div>1. We work flexible hours with an asynchronous culture.&nbsp;<br></div><div></div><div>2. We work at a sustainable pace without unreasonable external deadlines.&nbsp;<br></div><div></div><div>3. Varied, interesting technical challenges to work on.&nbsp;<br></div><div></div><div>4. Opportunities to make a large impact as part of a small, highly motivated team.&nbsp;<br></div><div></div><div></div><div><br></div><div></div><div><b>What you’ll do</b>&nbsp;<br></div><div></div><div>1. Design, build and maintain tools to develop, test and deploy services efficiently.&nbsp;<br></div><div></div><div>2. Work to continually improve the performance, reliability and security of the StickerMule cloud infrastructure.&nbsp;<br></div><div></div><div>3. Collaborate with team leads and stakeholders to ensure that we’re always building the best possible solution in the optimal way.&nbsp;<br></div><div></div><div>4. Participate in peer code reviews.&nbsp;<br></div><div></div><div>5. Share expertise with other members of the team, mentor junior developers.&nbsp;<br></div><div></div><div></div><div><br></div><div></div><div><b>About you</b>&nbsp;<br></div><div></div><div>1. You have a minimum of 3 years professional software development experience.&nbsp;<br></div><div></div><div>2. You’re highly competent in multiple general purpose languages, like Go, Ruby, and JavaScript.&nbsp;<br></div><div></div><div>3. You have Linux roots, you contain with Docker, you schedule with Kubernetes.&nbsp;<br></div><div></div><div>4. You don’t run away if you see a Bash script.&nbsp;<br></div><div></div><div>5. You have multi-cloud practical experience, AWS and Google Cloud would be especially beneficial.&nbsp;<br></div><div></div><div>6. You implemented and used logging, monitoring and distributed tracing systems.&nbsp;<br></div><div></div><div>7. You possess strong analytical and critical thinking skills.&nbsp;<br></div><div></div><div>8. You have great written and verbal communication skills in English.&nbsp;<br></div><div></div><div></div><div><br></div><div></div><div><b>Application requirements</b>&nbsp;<br></div><div></div><div>1. Applicants will be sent a Hackerrank test within 1-3 days of applying.&nbsp;<br></div><div></div><div>2. Test must be completed within 5 days.</div><div><br></div><div></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here only: <a href='https://www.stickermule.com/jobs?job=fa137148-6549-46e9-8fd3-f4c3179501d3&amp;title=software-engineer-site-reliability-and-infrastructure' rel='nofollow'>https://www.stickermule.com/jobs?job=fa137148-6549-46e9-8fd3-f4c3179501d3&amp;title=software-engineer-site-reliability-and-infrastructure</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 10, 2017 9:09:02 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:bash/other/2",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=2, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/admin",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go",
      "other",
      "ruby"
    ]
  },
  {
    "id": "79iok_F2TlucQwpU6DoxXw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobs.github.com-remote",
    "url": "http://jobs.github.com/positions/ac896a08-c648-11e7-8b12-6504e462af39",
    "title": "Full Time: Sr. fullstack engineer at Sticker Mule in Remote",
    "content": "<p>Sticker Mule is the Internet's fastest growing printing company. We are privately-owned, profitable and powered by an outstanding remote team that supports the growth of our manufacturing operations. We aim to build one of the Internet’s best technical teams. Currently, our development team operates in 8 countries and we’re always looking for more exceptional developers to join us. <br></p><p><strong>Why we enjoy working here</strong> <br> 1. We work flexible hours with an asynchronous culture. <br> 2. We work at a sustainable pace without unreasonable external deadlines. <br> 3. Varied, interesting technical challenges to work on. <br> 4. Opportunities to make a large impact as part of a small, highly motivated team. <br></p><p><strong>What you will do</strong> <br> 1. Design, build, test, deploy and maintain web applications and services. <br> 2. Write clean, performant code in accordance with our team's code style guidelines. <br> 3. Work to improve and maintain the code health of all of our software. <br> 4. Collaborate with team leads and stakeholders to ensure that we're always building the best possible solution in the optimal way. <br> 5. Participate in peer code reviews. <br> 6. Share expertise with other members of the team and mentor junior developers. <br></p><p><strong>Requirements</strong> <br> 1. 3+ years of professional software development experience. <br> 2. High competency in at least one of the following languages: JavaScript, Ruby, or Go. <br> 3. Strong analytical and critical thinking skills. <br> 4. Strong written and verbal communication skills in English. <br> 5. Experience with microservices/SOA or DevOps would be beneficial. <br></p><p><strong>Application requirements</strong> <br> 1. Applicants will be sent a Hackerrank test within 1-3 days of applying. <br> 2. Test must be completed within 5 days. <br></p>",
    "urlFetchPending": false,
    "published": "Nov 10, 2017 8:55:59 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go",
      "ruby"
    ]
  },
  {
    "id": "BWZfIVZ1Ta66edKsMxwrJQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobs.github.com-remote",
    "url": "http://jobs.github.com/positions/ee749d96-c645-11e7-91c7-373ec81561f7",
    "title": "Full Time: Software engineer: site reliability and infrastructure at Sticker Mule in Remote",
    "content": "<p>Sticker Mule is the Internet's fastest growing printing company. We are privately-owned, profitable and powered by an outstanding remote team that supports the growth of our manufacturing operations. We aim to build one of the Internet’s best technical teams. Currently, our development team operates in 8 countries and we’re always looking for more exceptional developers to join us. <br></p><p><strong>Why we enjoy working here</strong> <br>1. We work flexible hours with an asynchronous culture. <br>2. We work at a sustainable pace without unreasonable external deadlines. <br>3. Varied, interesting technical challenges to work on. <br>4. Opportunities to make a large impact as part of a small, highly motivated team. <br></p><p><strong>What you’ll do</strong> <br>1. Design, build and maintain tools to develop, test and deploy services efficiently. <br>2. Work to continually improve the performance, reliability and security of the StickerMule cloud infrastructure. <br>3. Collaborate with team leads and stakeholders to ensure that we’re always building the best possible solution in the optimal way. <br>4. Participate in peer code reviews. <br>5. Share expertise with other members of the team, mentor junior developers. <br></p><p><strong>About you</strong> <br>1. You have a minimum of 3 years professional software development experience. <br>2. You’re highly competent in multiple general purpose languages, like Go, Ruby, and JavaScript. <br>3. You have Linux roots, you contain with Docker, you schedule with Kubernetes. <br>4. You don’t run away if you see a Bash script. <br>5. You have multi-cloud practical experience, AWS and Google Cloud would be especially beneficial. <br>6. You implemented and used logging, monitoring and distributed tracing systems. <br>7. You possess strong analytical and critical thinking skills. <br>8. You have great written and verbal communication skills in English. <br></p><p><strong>Application requirements</strong> <br>1. Applicants will be sent a Hackerrank test within 1-3 days of applying. <br>2. Test must be completed within 5 days. <br></p>",
    "urlFetchPending": false,
    "published": "Nov 10, 2017 8:37:44 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:bash/other/2",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=2, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/admin",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go",
      "other",
      "ruby"
    ]
  },
  {
    "id": "Pl77sBNTQKGs01XmJ1Ln1g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workingnomads.co",
    "url": "https://www.workingnomads.co/jobs/remote-full-time-full-stack-designer-for-saas-company-niteo",
    "title": "Remote full stack designer for SaaS company",
    "content": "<p>We are looking for a full-stack designer that will help us make sure that all our websites, documents, emails, slides, videos and everything else looks consistent and beautiful. You do NOT need to do everything on your own - we completely support out-tasking and outsourcing - but you need to own the final product.</p><p>Some examples of work in the first few months: redesign of our company website, UI design of a new SaaS project, writing a design guide, designing &amp; editing sales and tutorial videos, designing Facebook and AdWords banners, designing a company booklet and so much more.</p><p>Niteo is an international remote-only SaaS company with team members from United Kingdom, USA, Slovenia, Romania and Philippines. We have projects in the SEO space and are looking to expand to other markets. We believe in Open Source so you can read about how we work in detail in our&nbsp;<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Fworkable.com%2525252525252Fnr%2525252525253Fl%2525252525253Dhttp%252525252525253A%252525252525252F%252525252525252Fworkable.com%252525252525252Fnr%252525252525253Fl%252525252525253Dhttps%25252525252525253A%25252525252525252F%25252525252525252Fgithub.com%25252525252525252Fniteoweb%25252525252525252Fhandbook%25252525252525252Fblob%25252525252525252Fmaster%25252525252525252FREADME.md' rel='nofollow'>public Handbook</a>&nbsp;and on&nbsp;<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Fworkable.com%2525252525252Fnr%2525252525253Fl%2525252525253Dhttp%252525252525253A%252525252525252F%252525252525252Fworkable.com%252525252525252Fnr%252525252525253Fl%252525252525253Dhttps%25252525252525253A%25252525252525252F%25252525252525252Fblog.niteoweb.com' rel='nofollow'>our blog</a>.</p><p>It is our belief that the ratio of women and/or people of color in tech teams should be higher. We believe diversity has its challenges, but the benefits far outweigh them. We strongly encourage people from underrepresented groups to apply for this position.</p><p>&nbsp;</p><p><strong>Why work with us?</strong></p><p>You will be regarded as a responsible and reliable adult. We put a lot of trust in you and give you autonomy to do your job the best you can. You receive the training you need to do the job, then we set your goals and define your tasks together. After that you plan and organize yourself. You set your own work schedule. You work on days you want to and from where you want to. You tell us when you go on a vacation and for how long.</p><p>In the end you are judged on your results and how well you work with your peers. The same goes for your coworkers who are all A-players. If you need someone to always tell you what to do and how to do it, then it's best you find something else.</p>",
    "urlFetchPending": false,
    "published": "Nov 8, 2017 6:00:10 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "PimgQhSmQVadGDC_5-0GHw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5678-qa-analyst",
    "title": "CROmetrics: QA Analyst",
    "content": "<div>  <div>    <h2>QA Analyst</h2>      <h4>Posted Nov  6</h4>    <h3>      <span>CROmetrics</span><br>      <span>Headquarters: San Francisco, CA</span><br>        <a href='https://crometrics.com/qa-analyst-job/' rel='nofollow'>https://crometrics.com/qa-analyst-job/</a>    </h3>  </div>    </div>  <div>    <div><em><b>Our positions are fully remote and to ensure compliance with all applicable labor laws, are open to U.S.-based applicants only. Not hiring in Washington state, Oregon state, San Francisco, or New York.</b></em></div><div><em><b><br></b></em></div><div><em><h4><b>What We Do</b></h4></em></div><div>Simply put, we make websites easier to use. Through a scientific method of determining which site improvements result in actual performance improvements, we replace the old way of designing sites through gut feel and management opinions with designing sites through data.<br></div><div></div><div><br></div><div>If you’re interested in checking out the swell people you’ll be working with, click here to&nbsp;<a href='https://crometrics.com/meet-the-team/' rel='nofollow'>learn more about the team.</a></div><div><br></div><div><h4><b>Our Hiring Process</b></h4></div><div>We’re glad you’re interested in working with us. We have a fairly unusual hiring process, but it has proven to work well both for us and for potential new hires. We have found that demonstrating basic competency is the best predictor of initial qualification for working with us, followed by actual work.<br></div><div></div><div><br></div><div>Our process reflects that: below, we outline our values and how we work, and then ask you to complete a small task. Assuming we like your response, we will hire you for a “paid interview” where you start working with us for a small number of hours each week. If both parties like working together, we expand the relationship. If not, we go our separate ways and both sides “won” in the deal!<br></div><div></div><div><br></div><div>This short essay sums up the philosophy we operate by:&nbsp;<a href='http://arches.io/2014/03/this-is-professionalism/' rel='nofollow'>This is Professionalism</a>. Please read it and if you’re willing to work this way, read on!<br></div><div></div><div><br></div><div><em>If you have questions as you go through this, make notes and if we haven’t answered them by the end, feel free to email&nbsp;<a href='mailto:matthew.gossage@crometrics.com' rel='nofollow'>matthew.gossage@crometrics.com</a>,&nbsp;<a href='mailto:chris@crometrics.com' rel='nofollow'>chris@crometrics.com&nbsp;</a>or&nbsp;<a href='mailto:tom@crometrics.com' rel='nofollow'>tom@crometrics.com</a>.</em><br></div><div></div><div><em><br></em></div><div><h4><b>Our Culture</b></h4></div><ul><li><span><b>We’re a remote company.</b></span>&nbsp;We are spread out all over the country and enjoy the flexibility remote working affords. Want to go on a mountain bike ride in the middle of the day? Cool, don’t forget your helmet! Need to pick the kids up from school? Nice, you’ve got parent of the year in the bag. We stay connected through Slack and workcations, including one annual trip that is partially funded by the company.</li><li><b>We work hard and move fast.</b>&nbsp;We’re working on a lot of different websites with varying underlying technologies. You’ll see a lot of pages and forms and there’s not a lot of automation. Maintaining quality while working on so much requires more than just checking boxes, you’ll need to think critically.</li><li><b><strong>Again, we’re a remote company.</strong>&nbsp;</b>That makes communication — including writing and reading comprehension —&nbsp;<em>extremely</em>&nbsp;important. You’ll work closely with product managers, designers and writers. This is not a simple “pull tickets and check in code” gig. Successful applicants enjoy the process of defining and clarifying specs, documenting processes,&nbsp;<em>improving</em>&nbsp;processes, and uploading custom emoji to Slack.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Interested in working with us? You’re off to a good start. To apply, follow the instructions in this spreadsheet: <a href='https://docs.google.com/spreadsheets/d/1gf9mvHN64zX90PZsQ1R7pH9jqwx9642BN4ATYx57-_g/edit?usp=sharing' rel='nofollow'>https://docs.google.com/spreadsheets/d/1gf9mvHN64zX90PZsQ1R7pH9jqwx9642BN4ATYx57-_g/edit?usp=sharing</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 6, 2017 4:53:11 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/9",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=9, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "aS7tdijcRVS0uw6Br2xKSA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156878/backend-engineer-golang-elixir-heetch?a=QBWAtjecyWc",
    "title": "Backend Engineer (Golang / Elixir) at Heetch (Paris, France) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Carsharing, Marketplace, Transportation</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>***&nbsp;We offer flexible and full remote work over Europe.</strong></p><p><strong>We are not ready yet to work with people outside EU but will keep you posted on that ;) ***<br></strong></p><p>Hands in hands with the Product, Design, Infrastructure and Mobile team, the Backend team has its great deal of challenges to tackle: scaling our ever growing backend business, pushing data science logics in production, shipping game changer features for our passengers and drivers with the sole goal of creating the most respectful and playful experience for them, across many launched cities, and many to come.</p><p><br>We expect the marketplace we are building to scale so it can support our European expansion ambitions. Fortunately, we can rely on our solid micro-services architecture (Golang, Elixir, Docker…) and our talented team to make it better.</p><p>Welcome behind the scenes !</p><p></p><p><strong>OUR ENGINEERING VALUES</strong></p><ul><li><strong>Move smart</strong>: we are data driven, and employ tools and best practices to ship code quickly and safely (continuous integration, code review, automated testing, etc).</li><li><strong>Distribute knowledge</strong>: we want to scale our engineering team to a point where our contributions do not stop at the company code base. We believe in the Open Source culture and communication with the outside world.</li><li><strong>Leave code better than you found it</strong>: because we constantly raise the bar.</li><li><strong>Unity makes strength</strong>: moving people from A to B is not as easy as it sounds but, we always keep calm and support each other.</li><li><strong>Always improve</strong>: we value personal progress and want you to look back proudly on what you’ve done.</li></ul><p><strong>WHAT YOU’LL DO</strong></p><ul><li>Implement smart models to predict future supply and demand</li><li>Aggregate and play with data coming from various sources</li><li>Work on new features in microservices environment and contribute to the improvement and optimization of our architecture</li><li>Optimize our operational platform to make our support even more awesome.</li></ul><p>&nbsp;Things we’d like to experiment with:</p><ul><li>Event sourcing</li><li>Kafka…</li></ul><p>If your are more an infractructure person wanting to deliver happiness to our backend team by building tools and frameworks please check out our&nbsp;Infrastructure Engineer&nbsp;job offer.</p><p><strong>REQUIREMENTS</strong></p><ul><li>5+ years as a software engineer, mainly focused on backend.</li><li>You are a product oriented developer, you own, design and implement features from A to Z, you help monitor and maintain them after they are shipped with focus on the end.</li><li>You have analytical and diagnostic skills, a proactive problem solving mindset.</li><li>You’ve worked with Ruby-on-Rails or Go in production environments, experience in Elixir would be great…</li><li>… but more than mastering 1 single language, you’re curious and a fast learner, you showed your ability to switch to another technology just to get out of your comfort zone.</li><li>Experience working with high volumes, databases, relational (PostgreSQL) or NoSQL.</li><li>Exposure to architectural patterns of a large, high-scale web application and microservices.</li><li>Good testing skills.</li><li>Sharing is caring, you are generous in your communication and knowledge sharing with your team.</li></ul><p><strong>BONUS POINTS</strong></p><ul><li>Contributions to open source projects</li><li>Experience with message brokers (such as Kafka, RabbitMQ)</li><li>Exposure to real-time technology problems</li><li>Experience with ETL and Hadoop</li><li>Experience with Docker and/or Mesos Marathon (or similar)</li></ul><p><strong>PERKS</strong></p><ul><li>Permanent contract (CDI)&nbsp;</li><li>Stock</li><li>Paid conference attendance/travel and periodic team meetups</li><li>Heetch credits</li><li>A Spotify subscription</li><li>Work from anywhere you want</li></ul>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Full remote (in Europe only) and flexible ways of working                            </div>                            <div>                                 Paid conferences attendance/travel                            </div>                            <div>                                 Periodic team meetups                            </div>                            <div>                                 Stocks                            </div>                            <div>                                 Heetch credits                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(europ, european, europeanunion)",
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k/t/w:go/go/9",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:k/t/w:unity3d/gamedev/8",
      "DBG_TECH1:k/t/w:unity3d/mobile/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=5, go=9, nodejs=0, bigdata-ml=8, ruby=8, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/go",
      "TECH1/ruby",
      "TECH2/docker",
      "TECH2/elixir",
      "TECH2/go",
      "TECH2/postgresql",
      "TECH2/ruby-on-rails",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "docker",
      "elixir",
      "go",
      "postgresql",
      "ruby",
      "ruby-on-rails"
    ]
  },
  {
    "id": "FdwB3g-3Q7u-Tsq3_EnapA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/152168/go-developer-spideroak?a=P20ErrTYCis",
    "title": "Go developer at SpiderOak (Kansas City, MO) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Security Software, Secure Messaging, Secure Back Up</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>About the team</strong></p><p>We are working hard in our 2.0 version of the Semaphor messaging system and platform. The software stack for the backend is PostgreSQL and Go. We are looking to expand our team to help us develop the microservices behind Semaphor.</p><p>We are a small team comprised of talented polyglot developers that have chosen Go as their main tool for the past several years to bring Semaphor to life.</p><p><strong>Responsibilities</strong></p><ul><li>Implement already written specifications for distributed services in Go.</li><li>Design and specify new services. We have a lot of work already architected, but there's still a lot to go in the roadmap.</li><li>Iterate over our current codebase to improve it and fix bugs.</li><li>Take ownership of the tasks assigned, regardless of their scope. Working on bug fixes doesn't entail less ownership than writing a new service from scratch.</li></ul><p><strong>Requirements</strong></p><ul><li>2+ years experience in developing services in Go.</li><li>Familiarity with TDD.</li><li>Experience using Docker.</li></ul><p><strong>Nice to have</strong></p><ul><li>Familiarity with multiplatform development. Our client side Go codebase runs in Windows, macOS, Linux, Android and iOS.</li><li>Experience with Kubernetes.</li><li>Some Python skills, all our integration tests are written in Python.</li><li>Familiarity with development focused on security.</li></ul><p>Still interested? Email us your resume (plain text preferred) to <a href='mailto:jobs@spideroak-inc.com' rel='nofollow'>jobs@spideroak-inc.com</a></p>                    </div>                            <h2>                About SpiderOak            </h2>            <div><p>SpiderOak has been working for the past 10+ years bringing security and privacy to consumers and enterprises. First in the backup area with SpiderOak ONE, and now expanding to group messaging with Semaphor.</p><p>We are a remote friendly company, but if you are local to Kansas City you are always welcome to work from the office. Significant overlap with US Central time zone required. You will be expected to communicate regularly with the rest of your team, working out problems and collaborating in a daily basis to drag projects across the finish line. The ability to take lead on projects falling under your responsibility is paramount. While we do not use a strict Agile methodology, you must be comfortable working closely with the rest of the company to ensure an iterative process. We require a basic working proficiency in the written and spoken English language, and the ability to travel to the United States 1-4 times a year for team meet-ups.</p><p>Much as we believe in internet privacy for all, we do not discriminate in who we choose to be part of our team. We know no boundaries based on race, ethnic origin, religion, gender, sexuality, or other terms humans use to separate the 'us' from the 'them'. If you can do the job and communicate readily, we will be happy to work with you.</p><p>We offer a compensation package including paid vacation, holiday, and personal time for all, and US workers enjoy a full benefits package including medical, dental, vision, life, and short and long term disability insurance.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Paid time off and corporate holidays                            </div>                            <div>                                 Full medical, dental, vision                            </div>                            <div>                                 Company provided hardware                            </div>                            <div>                                 Work from anywhere in the world                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG:surround``usa 3W OR(time,timezon)",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:go/go/21",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:macos/apple/2",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:techWeightMap:{python=4, other=0, dotnet=0, c=0, mobile=4, go=21, nodejs=0, bigdata-ml=0, ruby=0, apple=4, java=1, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH2/docker",
      "TECH2/go",
      "TECH2/microservices",
      "TECH2/postgresql",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "docker",
      "go",
      "microservices",
      "postgresql"
    ]
  },
  {
    "id": "d7aDSHKkT9aUoxuejwy_oA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/137659/software-engineer-golang-for-elastic-beats-elastic?a=KakfHXUF5wk",
    "title": "Software Engineer- Golang- - For Elastic Beats Product- Top Open Source Company at Elastic () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Data &amp; Analytics, Search, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>501-1k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><em><strong>Please include a short note to be considered for this position.</strong></em></p><p>The Beats platform is the basis for building open source shippers that collect all kinds of operational data, store it in Elasticsearch, and visualize it with Kibana. They collect data from edge servers, and are used to power application monitoring, infrastructure monitoring, and network monitoring. We currently have five official Beats: Filebeat for gathering logs, Packetbeat for network traffic, Metricbeat for metrics, Winlogbeat for Windows event logs, Heartbeat for uptime monitoring, and Auditbeat for audit data. In addition, the open-source community has created over 40 Beats, collecting data from all sorts of sources.</p><p>All current Beats are written in Golang.</p><p>As part of the Beats team, you will be responsible for maintaining the official Beats, for creating new ones, as well as for supporting the community around Beats. The team is diverse and distributed across the world, and collaborates on daily basis over Github, Zoom, and Slack.</p><p><strong>Your contribution</strong></p><ul><li>Define and create Metricbeat modules to collect metrics and build Kibana dashboards for monitoring various services. This implies understanding the monitored service and finding the most relevant metrics.</li><li>Write open source Golang code for Metricbeat</li><li>Work with our support team to help customers</li><li>Answer community questions</li><li>Collaborate with other development teams, quality engineering team and documentation team to execute on product deliverables</li></ul><p><strong>What you will bring along</strong></p><ul><li>BS, MS or PhD in Computer Science or related engineering discipline and 3+ years of industry experience</li><li>Experience with operating various services and other monitoring systems</li><li>Experience in Golang programming is a big plus</li><li>Excellent verbal and written communication skills, a great teammate with strong analytical, problem solving, debugging, and troubleshooting skills</li><li>Ability to work in a distributed team throughout the world.</li><li>Knowledge and experience in Elasticsearch, Logstash, Distributed Systems is a plus.</li></ul>                    </div>                            <h2>                About Elastic            </h2>            <div><p>Elastic is the world's leading software provider for making structured and unstructured data usable in real time for search, logging, security, and analytics use cases. Founded in 2012 by the people behind the Elasticsearch, Kibana, Beats, and Logstash open source projects, Elastic's global community has more than 80,000 members across 45 countries, and since its initial release. Elastic's products have achieved more than 100 million cumulative downloads. Today thousands of organizations, including Cisco, eBay, Dell, Goldman Sachs, Groupon, HP, Microsoft, Netflix, <em>The New York Times</em>, Uber, Verizon, Yelp, and Wikipedia, use the Elastic Stack, X-Pack, and Elastic Cloud to power mission-critical systems that drive new revenue opportunities and massive cost savings. Elastic is backed by more than $104 million in funding from Benchmark Capital, Index Ventures, and NEA; has headquarters in Amsterdam, the Netherlands, and Mountain View, California; and has over 400 employees in more than 30 countries around the world.</p><p><strong>Additional Information</strong></p><ul><li>Competitive pay and benefits</li><li>Stock options</li><li>Catered lunches, snacks, and beverages in most offices</li><li>An environment in which you can balance great work with a great life</li><li>Passionate people building great products</li><li>Employees with a wide variety of interests</li><li>Your age is only a number. It doesn't matter if you're just out of college or your children are; we need you for what you can do.</li></ul><p>Elastic is an Equal Employment employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status or any other basis protected by federal, state or local law, ordinance or regulation. Elastic also makes reasonable accommodations for disabled employees consistent with applicable law.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 401k Matching Up to 6 % in US and Pensions in some other countries                            </div>                            <div>                                 Health Care Insurance                            </div>                            <div>                                 Vacation Time Determined By Location                            </div>                            <div>                                 Lunch and Breakfast in Most Offices                            </div>                            <div>                                 100% Remote work possible                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, avail, allow, abl, possibl, permit)",
      "DBG:surround``2W(100, remot)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG_TECH1:k/t/w:go/go/9",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=9, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH2/distributed-system",
      "TECH2/elasticsearch",
      "TECH2/go",
      "TECH2/monitoring",
      "TECH2/scala",
      "TITLE1/dev",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "distributed-system",
      "elasticsearch",
      "go",
      "monitoring",
      "scala"
    ]
  },
  {
    "id": "CtbF_McHQ8m7l5Jd8ikFPQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/154245/kubernetes-solutions-engineer-m-f-giant-swarm-gmbh?a=PJcewtVc8Cs",
    "title": "Kubernetes Solutions Engineer (m/f) at Giant Swarm GmbH (Cologne, Germany) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong><strong>You make stuff happen? We are looking for a Container Solutions Engineer (m/f)</strong></strong></p><p><strong>Your Job: </strong></p><ul><li>You will dive deep into the customer's architecture and needs on their way to Kubernetes and advise them regarding our product, what tools to use, how to do monitoring, CI/CD.</li><li>First moments are important! So your main job is to create a great onboarding experience for our customers and handle all questions during preparation and installation.</li><li>You build and maintain recipes or helm charts for important tools that customers might need, fully packaged and documented to run easily on Kubernetes, contributing back to the respective Open Source repositories where possible.</li><li>You hold trainings and join our sales people for presentations at customers.</li><li>To sum it up: Customer Success is all that matters. You cover security and process questions and make sure that everything is ready for the customer to get their installation production ready. Furthermore you are happy to support the customer along their journey. Request can vary from general Kubernetes questions to real architecture problem, to modern applications deployments workflow.</li><li>Ultimately, you are also responsible for documentation and making sure you only need to answer once.</li><li>Requests can vary from general Kubernetes questions, to problems in using their new infrastructure to real problems in the infrastructure that need more machine room help. Ultimately, you are also responsible for documentation and making sure you only need to answer once.</li></ul><p><br><br></p><p><strong>Requirements: </strong></p><ul><li>You have experience with more than one programming language, including Go, and a strong architectural background.</li></ul><ul><li>You are feeling at home in the Kubernetes world, especially the multitude of Open Source tools around Kubernetes and the Container World.</li><li>You can explain complicated things, concisely and easily for a diverse audience.</li><li>You have a strong sense to provide an awesome customer service that makes life easier for Developers. Your communication skills (especially written form) are excellent. Very good English skills are a must.</li><li>Deutschkenntnisse sind ein dicker Pluspunkt.&nbsp;</li></ul>                    </div>                            <h2>                About Giant Swarm GmbH            </h2>            <div><p><strong>WHY US?</strong></p><p>We would like to give you a glimpse on how working with us will be like:</p><p><strong>Self-organization</strong></p><p>Creative work needs freedom and openness. We encourage you to do your work wherever and whenever you want. We expect passion and encourage sustainability. If you need rest, take it. We don't count holidays - we count outcome.</p><p><strong>Teamwork</strong>&nbsp;</p><p>Our ambitious goals are only achievable as a team. Everybody’s input is highly welcome and appreciated. Although sometimes rules and processes are necessary, we try to keep them as lean as possible. Always question the status quo and find new ways of collaboration and team work.</p><p><strong>Learning</strong></p><p>Learning is mandatory and fun at the same time. If you realize you want to expand your knowledge in a specific area, we support you with conferences, books etc.</p><p><strong>Basics&nbsp;</strong></p><p>We offer fair (transparent and open) salaries with benefits like choosing your own laptop, jobticket, coffee flat, mate etc.. And you will participate in our stock options program. Currently our team members have more children than we are employees. So family friendliness is a must. We base our teamwork on trust and appreciation. &nbsp;</p><p>Interested? Questions? Coffee? Just contact Anna. If you want to apply directly, please use our&nbsp;tool.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 unlimited holidays                            </div>                            <div>                                 fair and transparent open salaries                            </div>                            <div>                                 familiy friendlyness is a must                            </div>                            <div>                                 jobticket                            </div>                            <div>                                 choose the time you want to work                            </div>                            <div>                                 choose the devices you want to work with                            </div>                            <div>                                 remote work possible                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, avail, allow, abl, possibl, permit)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/2",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/2",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/go",
      "TECH1/nodejs",
      "TECH2/containers",
      "TECH2/kubernetes",
      "TITLE1/product",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "containers",
      "frontend",
      "go",
      "kubernetes",
      "nodejs"
    ]
  },
  {
    "id": "tzMCrvaDRrWjnSXS50IvAg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/144595/lead-azure-developer-fugue-inc?a=MuxR43sMZji",
    "title": "Lead Azure Developer at Fugue Inc (Washington, DC) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Computing, DevOps, Security Software</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Job Overview</strong></p><p>The Lead Azure Software Engineer will be the go to SME for the Azure cloud within Fugue. You will be mixing reliable industry standards and techniques with a generous dose of your own creativity to pioneer the new solutions in the Azure space of Fugue. We are looking for highly motivated team members who face challenges head-on and are able to work in an innovative, complex, and dynamic environment.</p>                    </div>                            <h2>                About Fugue Inc            </h2>            <div><p>Fugue is a venture-backed software company developing an infrastructure-level operating system for cloud computing. Initially available on Amazon Web Services (AWS), Fugue builds, optimizes, and enforces cloud infrastructure—continuously and automatically. The company has raised a total of $34MM from investors including New Enterprise Associates, The Maryland Venture Fund, and Core Capital Partners. With offices in Frederick, MD, Washington, DC, New York, and Silicon Valley, Fugue is rapidly expanding its talented, high performing team. We are looking for an accomplished Customer Support Engineer to join us!&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Medical, Dental, and Vision plans - some plans fully company paid                            </div>                            <div>                                 401(k) savings plan                            </div>                            <div>                                 Company paid Life, Short and Long Term Disability                            </div>                            <div>                                 Open PTO - use what you need when you need it                            </div>                            <div>                                 Remote Friendly                            </div>                            <div>                                 Flexible Work Schedule                            </div>                            <div>                                 Free Lunch 3-days per week in offices                            </div>                            <div>                                 You're an adult, so we treat you like one!                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``12N(work, OR(home,remot), 5N(OR(offic,headquart,onsit), OR(dai,daili,week,weekli,month,monthli)) )",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TECH2/amazon-web-services",
      "TECH2/azure",
      "TECH2/azure-api-apps",
      "TECH2/go",
      "TECH2/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "azure",
      "azure-api-apps",
      "go",
      "python"
    ]
  },
  {
    "id": "AAIsHlZCTzaIB5aZEMGKhg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3960-senior-backend-chief-engineer-outcomes4me",
    "title": "Senior Backend / Chief Engineer @ Outcomes4Me",
    "content": "<h2>              Senior Backend / Chief Engineer <small> @ Outcomes4Me</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-11-03 02:25</p></dd>          <dt><span>Description</span></dt>          <dd><p>We’re looking for a senior backend /chief engineer to join our team full time, to help us create anew patient experience with the ambition to improve care. We are offering a unique opportunityto work with an experienced and passionate founding team.</p><p><strong>Challenges we're excited about tackling:</strong></p><ul><li>Mapping and optimizing the patient experience and treatment search journey</li><li>Personalizing contents that addresses known and specific patient needs</li><li>Automatic identification of queries in patients records/profile that represent a standinginterests</li><li>Analyzing and modeling our search to create engaging flow</li><li>Empowering our users with data-informed experiences throughout their journey</li></ul><p><strong>We are looking for engineers with:</strong></p><ul><li>Solid engineering and coding skills</li><li>Experience in any of the languages Java, Python, Go</li><li>Experience or knowledge of Neo4j and graph algorithms</li><li>Experience with relational (e.g. Postgres) and Nosql (e.g. MongoDB) databases</li><li>Experience with cloud services/platforms (e.g., Google, Amazon) , security and HIPAAprotocols</li><li>Practical knowledge with agile practices, continuous software delivery, and DevOps</li><li>Knowledge of data processing algorithms and/or NLP is a plus</li></ul><p>If you’re interested in applying technology to make healthcare better and have relevant skillsand experience, please send your resume to <a href='mailto:jobs@outcomes4me.com' rel='nofollow'>jobs@outcomes4me.com</a> . We offer competitivecompensation and benefit packages, and for the right skill sets are open to remote workingconfigurations.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Nov 3, 2017 4:25:33 AM",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=1, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/java",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go",
      "java",
      "python"
    ]
  },
  {
    "id": "KT5r5tlSS9GAxueROIk5zg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62439",
    "title": "Senior Backend Chief Engineer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>We’re looking for a senior backend /chief engineer to join our team full time, to help us create a<br>new patient experience with the ambition to improve care. We are offering a unique opportunity<br>to work with an experienced and passionate founding team.<br><br><strong>Challenges we're excited about tackling:</strong><br><br></p><ul><li>Mapping and optimizing the patient experience and treatment search journey<br></li><li>Personalizing contents that addresses known and specific patient needs<br></li><li>Automatic identification of queries in patients records/profile that represent a standing<br>interests<br></li><li>Analyzing and modeling our search to create engaging flow<br></li><li>Empowering our users with data-informed experiences throughout their journey<br><br><strong>We are looking for engineers with:</strong><br><br></li><li>Solid engineering and coding skills<br></li><li>Experience in any of the languages Java, Python, Go<br></li><li>Experience or knowledge of Neo4j and graph algorithms<br></li><li>Experience with relational (e.g. Postgres) and Nosql (e.g. MongoDB) databases<br></li><li>Experience with cloud services/platforms (e.g., Google, Amazon) , security and HIPAA<br>protocols<br></li><li>Practical knowledge with agile practices, continuous software delivery, and DevOps<br></li><li>Knowledge of data processing algorithms and/or NLP is a plus<br><br>If you’re interested in applying technology to make healthcare better and have relevant skills<br>and experience, please send your resume to jobs@outcomes4me.com . We offer competitive<br>compensation and benefit packages, and for the right skill sets are open to remote working<br>configurations.</li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 3, 2017 4:25:33 AM",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=1, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TECH1/java",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go",
      "java",
      "python"
    ]
  },
  {
    "id": "D4i67Lj1Q1SSjQveMpUdAg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62325",
    "title": "Sales Assistant",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong><em>US Based Applicants Only. Not hiring in Washington state, Oregon state, San Francisco, or New York.</em></strong><br><br><br></p><p>Simply put, we make websites easier to use. Through a scientific method of determining which site improvements result in actual performance improvements, we replace the old way of designing sites through gut feel and management opinions with designing sites through data. Tactically speaking, clients come to us for both strategic direction and to supplement their internal teams.<br><br><br></p><p>We struggled with what to call this job since while the core of the job is sales assistant, the job will also be what you make of it. We refer to our current sales assistant, Jill Mendoza, as our “Jill of all trades” and she has a small picture of Wonder Woman as the :jill: emoji in our slack instance. Unfortunately, we have grown too big for Jill to be able to do everything, so we need more help.<br><br><br>Here are a few of the many, diverse tasks that you'll be potentially doing:<br><br></p><ul><li>Working to make sure quarterly client reviews are on track, and scheduling them with the clients<br></li><li>Creating sales decks with our CEO and 2 VPs of business development<br></li><li>Creating proposals with our CEO and 2 VPs of business development<br></li><li>Ensuring contracts are signed by all parties and facilitating handoffs between business development and the product management team<br></li><li>Various marketing tasks such as updating the website, sending out newsletters, posting jobs for sales assistants, etc (how meta!)<br></li><li>Helping to arrange team travel and client dinners<br></li><li>Competitive research and general LinkedIn research<br><br><br><br><p>Our most successful candidates have the following skills/experience/traits:<br><br><br></p></li><li>Ability to get things done with little direction<br></li><li>Worked cross-functionally in a highly collaborative environment, preferably in a remote capacity<br></li><li>Genuinely like working with clients and their distributed stakeholder group<br></li><li>Lifelong learner<br><br>If you’re interested in checking out the swell people you’ll be working with, click here <a href='https://crometrics.com/meet-the-team/' rel='nofollow'>to learn more about the team.</a><br><br><em>If you have questions as you go through this, make notes and if we haven’t answered them by the end, feel free to email chris@crometrics.com or tom@crometrics.com.</em><br><br><br></li><li><strong>We’re a remote company.</strong> We are spread out all over the country and enjoy the flexibility remote working affords. Want to go on a mountain bike ride in the middle of the day? Cool, don’t forget your helmet! Need to pick the kids up from school? Nice, you’ve got parent of the year in the bag. We stay connected through Slack and workcations, including one annual trip that is funded by the company.<br></li><li><strong>Our engineers value elegant code, but move fast.</strong> We’re writing code that runs on top of existing websites. Some tests only run for a few days before disappearing (though some do so well they become a permanent part of the client’s site). If “minimum viable product” isn’t in your lexicon, you aren’t a good fit.<br></li><li><strong>Communication is critical.</strong> We’re a remote company. That makes communication — including writing and reading comprehension — extremely important. You’ll work closely with engineers, designers and writers. This is not a simple “write specs and close tickets” gig. Successful applicants enjoy the process of defining and clarifying specs, documenting processes, improving processes, seeing their ideas and work affect millions of users, and uploading custom emoji to Slack.<br></li><li><strong>We’re relentlessly focused on our client’s happiness.</strong> The PM is a client-facing role. Managing a client relationship virtually takes a different type of skill set – the PMs have to be both a strategic partner, the customer (represented by the data), teacher and project manager over the phone/email/Slack, all while delivering an exceptional level of service. This type of interaction is not for everyone, and we completely understand. It’s not easy!<br></li><li><strong>We are not perfect.</strong> At the core of experimentation is the lesson to be learned from the test, whether a win, loss or inconclusive. We extend this concept to everything we do by setting the bar high for our team and fostering an environment of radical candor and constant learning.<br><br>This short essay sums up the philosophy we operate by: This is Professionalism: <a href='http://arches.io/2014/03/this-is-professionalism/' rel='nofollow'>http://arches.io/2014/03/this-is-professionalism/</a> <em>Sound like something you are interested in? Read on.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 26, 2017 12:20:10 AM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "wajIQhLrSGCDvEJzKZCHDQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3941-sales-engineer-open-source-wallaroo-labs",
    "title": "Sales Engineer Open Source @ Wallaroo Labs",
    "content": "<h2>              Sales Engineer Open Source<small> @ Wallaroo Labs</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-23 03:07</p></dd>          <dt><span>Description</span></dt>          <dd><p>Wallaroo Labs is working on a huge idea, and this is a phenomenal opportunity for a person who enjoys challenges. We believe in open source and strive to build on these technologies. Our distributed team is ten people and growing. We had have generated a lot of interest through our product and vision and raised a large seed round with several well-known VCs.</p><p>Faster data, more data sources, and business requirements are driving increasingly sophisticated algorithms and putting more and more demands on data applications. Wallaroo Labs solves these problems with Wallaroo, a data engine for building highly elastic big data applications.</p><p>We are looking for a Sales Engineer to drive the adoption of Wallaroo open-source offering within the developer community. This position is essential to our success; you will be responsible for identifying friction points with Wallaroo and systematically eliminate to improve the developer experience.</p><p>Although Wallaroo's headquarters is in New York, this position can be remote.  Candidates located in a Tech Hub cities or that have deep connections within existing developer networks would prove invaluable in building our community.</p><p><strong>Responsibilities</strong></p><ul><li>Provide support to sales team by running demos via remote session</li><li>Monitor communication channels (HN, Reddit, StackOverflow, Mailing lists, IRC) and interact with the community, answer questions and assist developers.</li><li>Identify and build relationships with the developer community, meetups, and conferences and leverage relationships to evangelize Wallaroo.</li><li>Own problem resolution and participate with the development team to create solutions.</li><li>Publish content from blog posts to video demos.</li></ul><p><strong>Qualities we are looking for</strong></p><ul><li>Experience working on a commercialized open source project (Spark, Cassandra, MongoDB etc.)</li><li>Ability to learn new technologies quickly.</li><li>Comfortable with a variety of programming languages, experience with Python, Go, JavaScript are a plus.</li><li>Familiar with Big Data technologies.</li><li>Desire and ability to work with enterprise clients and our open source community.</li><li>Experience working with open source software, GitHub etc.</li><li>Familiar with software development process in a business setting.</li><li>Outstanding verbal and written communication skills.</li></ul><p><strong>Learn more about Wallaroo</strong></p><ul><li>Corporate site: <a href='http://www.wallaroolabs.com' rel='nofollow'>http://www.wallaroolabs.com</a></li><li>Wallaroo Community Site: <a href='http://www.wallaroolabs.com/community' rel='nofollow'>http://www.wallaroolabs.com/community</a></li><li>Wallaroo Blog: <a href='https://blog.wallaroolabs.com/' rel='nofollow'>https://blog.wallaroolabs.com/</a></li><li>GitHub: <a href='https://github.com/WallarooLabs/wallaroo' rel='nofollow'>https://github.com/WallarooLabs/wallaroo</a></li></ul><p><em>We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:07:17 AM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG:surround``can 2W remot",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/python",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go",
      "python"
    ]
  },
  {
    "id": "yzk14JeETEWgC64L8FL3Kw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62241",
    "title": "Sales Engineer Open Source",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Wallaroo Labs is working on a huge idea, and this is a phenomenal opportunity for a person who enjoys challenges. We believe in open source and strive to build on these technologies. Our distributed team is ten people and growing. We had have generated a lot of interest through our product and vision and raised a large seed round with several well-known VCs.<br><br>Faster data, more data sources, and business requirements are driving increasingly sophisticated algorithms and putting more and more demands on data applications. Wallaroo Labs solves these problems with Wallaroo, a data engine for building highly elastic big data applications.<br><br>We are looking for a Sales Engineer to drive the adoption of Wallaroo open-source offering within the developer community. This position is essential to our success; you will be responsible for identifying friction points with Wallaroo and systematically eliminate to improve the developer experience.<br><br>Although Wallaroo's headquarters is in New York, this position can be remote. Candidates located in a Tech Hub cities or that have deep connections within existing developer networks would prove invaluable in building our community.<br><br><strong>Responsibilities</strong><br><br></p><ul><li>Provide support to sales team by running demos via remote session<br></li><li>Monitor communication channels (HN, Reddit, StackOverflow, Mailing lists, IRC) and interact with the community, answer questions and assist developers.<br></li><li>Identify and build relationships with the developer community, meetups, and conferences and leverage relationships to evangelize Wallaroo.<br></li><li>Own problem resolution and participate with the development team to create solutions.<br></li><li>Publish content from blog posts to video demos.<br><br><strong>Qualities we are looking for</strong><br><br></li><li>Experience working on a commercialized open source project (Spark, Cassandra, MongoDB etc.)<br></li><li>Ability to learn new technologies quickly.<br></li><li>Comfortable with a variety of programming languages, experience with Python, Go, JavaScript are a plus.<br></li><li>Familiar with Big Data technologies.<br></li><li>Desire and ability to work with enterprise clients and our open source community.<br></li><li>Experience working with open source software, GitHub etc.<br></li><li>Familiar with software development process in a business setting.<br></li><li>Outstanding verbal and written communication skills.<br><br><strong>Learn more about Wallaroo</strong><br><br></li><li>Corporate site: <a href='http://www.wallaroolabs.com' rel='nofollow'>http://www.wallaroolabs.com</a></li><li>Wallaroo Community Site: <a href='http://www.wallaroolabs.com/community' rel='nofollow'>http://www.wallaroolabs.com/community</a></li><li>Wallaroo Blog: <a href='https://blog.wallaroolabs.com/' rel='nofollow'>https://blog.wallaroolabs.com/</a></li><li>GitHub: <a href='https://github.com/WallarooLabs/wallaroo' rel='nofollow'>https://github.com/WallarooLabs/wallaroo</a><br><em>We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:07:17 AM",
    "tags": [
      "DBG:surround``can 2W remot",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/50",
      "TECH1/go",
      "TECH1/python",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go",
      "python"
    ]
  },
  {
    "id": "vT_UWVgwQKGoxOnW7R2o4Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3940-developer-evangelist-wallaroo-labs",
    "title": "Developer Evangelist @ Wallaroo Labs",
    "content": "<h2>              Developer Evangelist<small> @ Wallaroo Labs</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-23 03:06</p></dd>          <dt><span>Description</span></dt>          <dd><p>Wallaroo Labs is working on a huge idea, and this is a phenomenal opportunity for a person who enjoys challenges. We believe in open source and strive to build on these technologies. Our distributed team is ten people and growing. We had have generated a lot of interest through our product and vision and raised a large seed round with several well-known VCs.</p><p>Faster data, more data sources, and business requirements are driving increasingly sophisticated algorithms and putting more and more demands on data applications. Wallaroo Labs solves these problems with Wallaroo, a data engine for building highly elastic big data applications.</p><p>We are looking for a Developer Evangelist to drive the adoption of Wallaroo open-source offering within the developer community. This position is essential to our success; you will be responsible for identifying friction points with Wallaroo and systematically eliminate to improve the developer experience.</p><p>Although Wallaroo's headquarters is in New York, this position can be remote.  Candidates located in a Tech Hub cities or that have deep connections within existing developer networks would prove invaluable in building our community.</p><p><strong>Responsibilities</strong></p><ul><li>Monitor communication channels (HN, Reddit, StackOverflow, Mailing lists, IRC) and interact with the community, answer questions and assist developers.</li><li>Identify and build relationships with the developer community, meetups, and conferences and leverage relationships to evangelize Wallaroo.</li><li>Own problem resolution and participate with the development team to create solutions.</li><li>Publish content from blog posts to video demos.</li></ul><p><strong>Qualities we are looking for</strong></p><ul><li>Ability to learn new technologies quickly.</li><li>Comfortable with a variety of programming languages, experience with Python, Go, JavaScript are a plus.</li><li>Familiar with Big Data technologies.</li><li>Desire and ability to work with enterprise clients and our open source community.</li><li>Experience working with open source software, GitHub etc.</li><li>Familiar with software development process in a business setting.</li><li>Outstanding verbal and written communication skills.</li></ul><p><strong>Learn more about Wallaroo</strong></p><ul><li>Corporate site: <a href='http://www.wallaroolabs.com' rel='nofollow'>http://www.wallaroolabs.com</a></li><li>Wallaroo Community Site: <a href='http://www.wallaroolabs.com/community' rel='nofollow'>http://www.wallaroolabs.com/community</a></li><li>Wallaroo Blog: <a href='https://blog.wallaroolabs.com/' rel='nofollow'>https://blog.wallaroolabs.com/</a></li><li>GitHub: <a href='https://github.com/WallarooLabs/wallaroo' rel='nofollow'>https://github.com/WallarooLabs/wallaroo</a></li></ul><p><em>We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:06:14 AM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG:surround``can 2W remot",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go",
      "python"
    ]
  },
  {
    "id": "Xno8wcicRX6weSlQQiaa8w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62242",
    "title": "Developer Evangelist",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Wallaroo Labs is working on a huge idea, and this is a phenomenal opportunity for a person who enjoys challenges. We believe in open source and strive to build on these technologies. Our distributed team is ten people and growing. We had have generated a lot of interest through our product and vision and raised a large seed round with several well-known VCs.<br><br>Faster data, more data sources, and business requirements are driving increasingly sophisticated algorithms and putting more and more demands on data applications. Wallaroo Labs solves these problems with Wallaroo, a data engine for building highly elastic big data applications.<br><br>We are looking for a Developer Evangelist to drive the adoption of Wallaroo open-source offering within the developer community. This position is essential to our success; you will be responsible for identifying friction points with Wallaroo and systematically eliminate to improve the developer experience.<br><br>Although Wallaroo's headquarters is in New York, this position can be remote. Candidates located in a Tech Hub cities or that have deep connections within existing developer networks would prove invaluable in building our community.<br><br><strong>Responsibilities</strong><br><br></p><ul><li>Monitor communication channels (HN, Reddit, StackOverflow, Mailing lists, IRC) and interact with the community, answer questions and assist developers.<br></li><li>Identify and build relationships with the developer community, meetups, and conferences and leverage relationships to evangelize Wallaroo.<br></li><li>Own problem resolution and participate with the development team to create solutions.<br></li><li>Publish content from blog posts to video demos.<br><br><strong>Qualities we are looking for</strong><br><br></li><li>Ability to learn new technologies quickly.<br></li><li>Comfortable with a variety of programming languages, experience with Python, Go, JavaScript are a plus.<br></li><li>Familiar with Big Data technologies.<br></li><li>Desire and ability to work with enterprise clients and our open source community.<br></li><li>Experience working with open source software, GitHub etc.<br></li><li>Familiar with software development process in a business setting.<br></li><li>Outstanding verbal and written communication skills.<br><br><strong>Learn more about Wallaroo</strong><br><br></li><li>Corporate site: <a href='http://www.wallaroolabs.com' rel='nofollow'>http://www.wallaroolabs.com</a></li><li>Wallaroo Community Site: <a href='http://www.wallaroolabs.com/community' rel='nofollow'>http://www.wallaroolabs.com/community</a></li><li>Wallaroo Blog: <a href='https://blog.wallaroolabs.com/' rel='nofollow'>https://blog.wallaroolabs.com/</a></li><li>GitHub: <a href='https://github.com/WallarooLabs/wallaroo' rel='nofollow'>https://github.com/WallarooLabs/wallaroo</a><br><em>We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:06:14 AM",
    "tags": [
      "DBG:surround``can 2W remot",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/50",
      "TECH1/go",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go",
      "python"
    ]
  }
]
}
