{
 "items": [
  {
    "id": "zKitavqQTCKvMOBjM1TIjA",
    "url": "https://jobmote.com/job/94999/cisco-uc-engineers-100-remote-90k-125k-no-c2c/",
    "title": "Cisco UC Engineers, 100% REMOTE (90k-125k) NO C2C",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 6W OR(dai,daili,week,weekli,month,monthli) 5W OR(offic,headquart,onsit)",
      "DBG_TECH1:k/t/w:express/nodejs/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:unity3d/gamedev/8",
      "DBG_TECH1:k/t/w:unity3d/mobile/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=5, go=3, nodejs=8, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TECH1/nodejs",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "Kelly Services",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 24, 2019 10:08:04 PM",
    "validThrough": "Oct 27, 2019 10:08:04 PM",
    "crawled": "Oct 25, 2019 3:06:31 AM",
    "content": "<div><p><strong>UC Engineers</strong></p> <p><strong>100% Remote </strong>(Does require 2-weeks onsite in Tampa for training) </p> <p><strong>Note: </strong>U.S. Citizens and those authorized to work in the U.S. without sponsorship are encouraged to apply. We are unable to sponsor at this time.</p> <p><strong>This is a direct-hire role with our client. </strong> Talented and competitive people are rewarded with outstanding career development, personal growth and leadership opportunities - the Sky is the Limit here! </p> <p><strong>Target Salaries: $90k - $125k base salary + annual bonus and exceptional full benefits package</strong></p> <p><strong>HIGHLIGHTS</strong>:</p> <p><br> • Work collaboratively with the highest caliber talent. Our client is committed to hiring and developing great people who have a passion for excellence and a commitment to continuous improvement.<br> • Utilize cutting-edge technology and processes - creating the next generation of products and services that will impact the world for generations to come.<br> • Foster growth and professional development capabilities - because they are a large, global organization with many disciplines and locations, you'll have the opportunity to explore different roles.<br> • Be recognized &amp; rewarded - our client values their employees, recognizes talent, encourages growth and rewards contributions</p> <p> </p> <p><strong>Overview:</strong> </p> <p>We have both Level 2 &amp; 3 opportunities open. You will work in a fast-paced virtual NOC with teammates across North America. You will provide support and troubleshooting UC related incidents for customers in the financial, healthcare, retail, and insurance industries (among others) across 70 countries. </p> <p> </p> <p><strong>Experience (minimum requirements):</strong> </p> <p>5+ years with UC/UCC Engineer or equivalent </p> <p><strong>Certifications:</strong> </p> <p><strong>CCIE </strong>Collaboration. Expert level experience may be substituted. </p> <p>· Troubleshoot incidents in the following technologies: </p> <p>o <strong>Cisco Unified Communications Manager</strong> 9.x and above. </p> <p>o <strong>Cisco </strong>Unity Connection <strong>Unified Communications Manager</strong></p> <p>o <strong>Cisco </strong>IM&amp;P and Jabber Clients </p> <p>o <strong>Cisco </strong>Voice Gateways / CUBEs </p> <p>o <strong>Cisco </strong>Telepresence (Servers and video end-points) </p> <p>o <strong>Cisco </strong>Unified Contact Center Enterprise 7.x and above. </p> <p>o <strong>Cisco </strong>Unified Contact Center Express </p> <p>o <strong>Cisco </strong>Finesse / CTIOS / Cisco Agent Desktop </p> <p>o <strong>Cisco </strong>Voice Portal (CVP) </p> <p>o <strong>Cisco </strong>Historical Data Server (HDS) </p> <p>o <strong>Cisco </strong>CCMP </p> <p>o <strong>Cisco </strong>UCS Platform </p> <p>o <strong>VMWare </strong>5.x and above </p> <p>o <strong>Cisco </strong>Unified SIP Proxy (CUSP) </p> <p>o Signaling protocols such as SIP, H323, SCCP, and MGCP </p> <p> </p> <p><strong>Feel free to send resumes directly to: </strong></p> <p> </p> <br><br>Why Kelly ® ?  <p>With Kelly, you'll have direct connections to leading IT organizations in the best companies around the globe-offering you the chance to work on some of today's most intriguing, innovative and high-visibility projects. In a field where change is the only constant, our connections and opportunities will help you take your career exactly where you want to go. We work with 90 of the Fortune 100™ companies companies and found opportunities for more than 8,600 IT professionals last year. Let us help advance your career today.</p> <p> </p>About Kelly ®   <p>At Kelly, we're always thinking about what's next and advising job seekers on new ways of working to reach their full potential. In fact, we're a leading advocate for temporary/nontraditional workstyles, because we believe they allow flexibility and tremendous growth opportunities that enable a better way to work and live. Connecting great people with great companies is what we do best, and our employment opportunities span a wide variety of workstyles, skill levels, and industries around the world.</p> <p>Kelly is an equal opportunity employer committed to employing a diverse workforce, including, but not limited to, minorities, females, individuals with disabilities, protected veterans, sexual orientation, gender identity. Equal Employment Opportunity is The Law. </p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "RD6VftHaTVagbAU1KRbgow",
    "url": "https://remoteok.io/jobs/75265",
    "title": "Full Stack Web Developer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=5, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "SOCi ",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 24, 2019 7:28:24 AM",
    "validThrough": "Oct 1, 2019 7:28:24 AM",
    "crawled": "Oct 21, 2019 10:30:37 PM",
    "content": "<span></span> <span><h4>SOCi</h4>&nbsp;</span> <br> <h3>Full Stack Web Developer</h3> <div>  <div>   \\nAbout SOCi\\nSOCi is the leading enterprise solution for social content discovery and social media marketing. Our next-generation, all-in-one social media SaaS platform utilizes a proprietary scoring algorithm to discover, evaluate, and rank social content, changing how enterprises, franchises, and affiliates market on social media to their target audiences. SOCi has a growing team of passionate, innovative, and fun people in both our San Diego, CA and Austin, TX offices.\\n*This position is open to fully remote candidates\\nThe job\\n* We work collaboratively in groups of 3-4 (mobs) where you group program with other great engineers and product people, each representing different viewpoints and bringing different skills to the table.\\n* Iterating and shipping daily in small increments, you're able to progress fast and have a sense of achievement every day going home.\\n* Sometimes you'll need to complete other tasks and duties as needed.\\n\\n\\nYou\\n* Love writing elegant code.\\n* Have a solid foundation of core programming skills in MySQL, PHP and JavaScript\\n* Have a strong sense of visual aesthetics on web and ability to make it reality with cutting-edge CSS.\\n* Shiver in horror at the thought of copy-pasting coding.\\n* Have&nbsp;experience working in social media space (a plus).\\n* Get nightmares from badly formatted code.\\n* Understand that usability and attention to visual details matters just as much as good performance and clean architecture.\\n* You are equally comfortable discussing database architecture as you are in debating animations and shadows in the UI all the while keeping the user story in mind to ensure you're solving the right problem.\\n* Have experience working with enterprise-grade SaaS products (a plus).\\n\\n\\nWhat's SOCi's culture like?\\nOur primary driver is professional growth and learning, coupled with a desire to help our customer succeed. We focus heavily on individual mentorship and guidance, peer feedback and are always pushing ourselves and each other to the next level. We're huge on collaboration - mobing/swarming to solve problems either as individual engineering teams, or even Product/Engineering/Design leaders mobing to work out the best new product approach. We focus on moving fast, learning fast, and not looking back.\\nSOCi is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Ds0-es7FQiOISUweu0LcnA",
    "url": "https://remoteok.io/jobs/75532",
    "title": "Senior Game Engineer",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:devise/ruby/8",
      "DBG_TECH1:k/t/w:game-developer/gamedev/91",
      "DBG_TECH1:k/t/w:html5/frontend/15",
      "DBG_TECH1:k/t/w:javascript/frontend/4",
      "DBG_TECH1:k/t/w:javascript/nodejs/4",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=18, bigdata-ml=0, ruby=8, apple=0, java=0, gamedev=99, php=0, embedded=0, frontend=28}",
      "REMOTE1/50",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "Game Closure",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 8, 2019 6:41:29 AM",
    "validThrough": "Oct 15, 2019 6:41:29 AM",
    "crawled": "Oct 21, 2019 10:30:37 PM",
    "content": "<span></span> <span><h4> Game Closure </h4></span> <br> <h3>Senior Game Engineer</h3> <div>  <div>   GAME CLOSURE\\n\\nSan Francisco, Mountain View, Tokyo, Remote &nbsp;-&nbsp; Full Time\\n\\nGame Closure is on the hunt for Senior Game Engineers to help us build the social games that will be tomorrow’s biggest hits on Facebook and other social media platforms. We are a growing team with offices in San Francisco and Mountain View, California, Tokyo, Japan and also some possibilities for remote work. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you! \\n\\nGame Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass instant games, you will play a pivotal role in creating a platform which will revolutionize the future of game development. \\n\\nIt's always a bonus if you know more than JavaScript! We write cross-compilers, GPU shaders, NodeJS back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.\\n\\n**The Role:**\\n\\n- Be responsible for designing, developing and deploying major game features\\n- Own game feature areas from end-­to­-end\\n- Be the champion for the user!\\n- Insist on the highest standards and create functional and engaging features that will delight our users\\n- Be part of a tight game development team looking to iterate fast on a fun concept and then building it out\\n- Have real input on end-user product\\n- Be a key member of a high performing software engineering team\\n- Collaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements\\n- Hands­ on architect and coder for sophisticated client/server systems for mobile gaming\\n- Innovate and iterate on process, systems and technology to deliver world­-class social games\\n- Be a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!\\n\\n**Desired Skills:**\\n\\n- Bachelor's degree in Computer Science or related field, or equivalent experience.\\n- 3+ years of professional software engineering experience, working on cross functional teams.\\n- Proven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).\\n- Capable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.\\n- Proficient at using script debuggers like Chrome Debugger.\\n- Strong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.\\n- Advanced software engineering skills, including the ability to write maintainable and robust code in a p popular object oriented language.\\n- Solid familiarity with analytics and A/B testing in mobile games\\n- Familiarity with git, svn or other VCS.\\n- Self starter, analytical and creative\\n- Strong team player with a positive attitude.\\n- Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.\\n- Check out Everwing on Facebook Instant Games in Messenger. Can you build this game? \\n- Understanding of the reactive UI paradigm and experience building UIs using reactive UI frameworks (such as React, and state management Utilities like Redux).\\n\\n**Bonus:**\\n\\n- Canvas animation work\\n- 2+ years of game development experience with multiple shipped titles\\n- Specialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)\\n- Expert knowledge of TypeScript\\n\\n**GC Perks:**\\n\\n- Medical, Dental, &amp; Vision: Top quality insurance options with 100% of premiums covered\\n- Social Events: Weekly team dinners, quarterly team excursions, game nights, karaoke, and more\\n- Commuter Pass + Free Parking: Your commute and parking to the office is on us! \\n- PTO: Unlimited vacation policy\\n- Meals: Free daily lunches, well stocked kitchen, healthy snacks and drinks\\n- Pet-Friendly Office: Bring your pets to work to foster a friendlier and happier workplace  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "dQJPrw1nSIiV4BNBsEGGRQ",
    "url": "https://jobs.github.com/positions/e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
    "title": "Senior Game Engineer (REMOTE)",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:devise/ruby/8",
      "DBG_TECH1:k/t/w:game-developer/gamedev/78",
      "DBG_TECH1:k/t/w:html5/frontend/15",
      "DBG_TECH1:k/t/w:javascript/frontend/4",
      "DBG_TECH1:k/t/w:javascript/nodejs/4",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=18, bigdata-ml=0, ruby=8, apple=0, java=0, gamedev=86, php=0, embedded=0, frontend=28}",
      "REMOTE1/50",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 3, 2019 2:50:23 AM",
    "validThrough": "Aug 10, 2019 2:50:23 AM",
    "crawled": "Oct 21, 2019 10:30:34 PM",
    "content": "GAME CLOSURESan Francisco, Mountain View, Tokyo, Remote  -  Full TimeGame Closure is on the hunt for  Senior Game Engineers to help us build the social games that will be tomorrow’s biggest hits on Facebook and other social media platforms. We are a growing team with offices in San Francisco and Mountain View, California, Tokyo, Japan and also some possibilities for remote work. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you! Game Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass instant games, you will play a pivotal role in creating a platform which will revolutionize the future of game development. It's always a bonus if you know more than JavaScript! We write cross-compilers, GPU shaders, NodeJS back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.**The Role:**- Be responsible for designing, developing and deploying major game features- Own game feature areas from end-­to­-end- Be the champion for the user!- Insist on the highest standards and create functional and engaging features that will delight our users- Be part of a tight game development team looking to iterate fast on a fun concept and then building it out- Have real input on end-user product- Be a key member of a high performing software engineering team- Collaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements- Hands­ on architect and coder for sophisticated client/server systems for mobile gaming- Innovate and iterate on process, systems and technology to deliver world­-class social games- Be a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!**Desired Skills:**- Bachelor's degree in Computer Science or related field, or equivalent experience.- 3+ years of professional software engineering experience, working on cross functional teams.- Proven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).- Capable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.- Proficient at using script debuggers like Chrome Debugger.- Strong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.- Advanced software engineering skills, including the ability to write maintainable and robust code in a p popular object oriented language.- Solid familiarity with analytics and A/B testing in mobile games- Familiarity with git, svn or other VCS.- Self starter, analytical and creative- Strong team player with a positive attitude.- Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.- Check out Everwing on Facebook Instant Games in Messenger. Can you build this game? - Understanding of the reactive UI paradigm and experience building UIs using reactive UI frameworks (such as React, and state management Utilities like Redux).**Bonus:**- Canvas animation work- 2+ years of game development experience with multiple shipped titles- Specialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)- Expert knowledge of TypeScript**GC Perks:**- Medical, Dental, &amp; Vision: Top quality insurance options with 100% of premiums covered- Social Events: Weekly team dinners, quarterly team excursions, game nights, karaoke, and more- Commuter Pass + Free Parking: Your commute and parking to the office is on us! - PTO: Unlimited vacation policy- Meals: Free daily lunches, well stocked kitchen, healthy snacks and drinks- Pet-Friendly Office: Bring your pets to work to foster a friendlier and happier workplace",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "GQmqkKnsRJyG9rbNlV2JFA",
    "url": "https://remote.co/job/full-stack-web-developer-14/",
    "title": "Full Stack Web Developer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=5, embedded=0, frontend=4}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "SOCi",
      "sameAs": "https://www.meetsoci.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 17, 2019 3:48:14 PM",
    "validThrough": "Sep 24, 2019 3:48:14 PM",
    "crawled": "Sep 17, 2019 4:07:48 PM",
    "content": "<h3>Full Stack Web Developer at <span>SOCi</span></h3><div><span><i></i> Remote</span>        </div><div>            <h5><strong>About SOCi</strong></h5><p>SOCi is the leading enterprise solution for social content discovery and social media marketing. Our next-generation, all-in-one social media SaaS platform utilizes a proprietary scoring algorithm to discover, evaluate, and rank social content, changing how enterprises, franchises, and affiliates market on social media to their target audiences. SOCi has a growing team of passionate, innovative, and fun people in both our San Diego, CA and Austin, TX offices.</p><p><strong>*This position is open to fully remote candidates</strong></p><h5><strong>The job</strong></h5><ul><li>We work collaboratively in groups of 3-4 (mobs) where you group program with other great engineers and product people, each representing different viewpoints and bringing different skills to the table.</li><li>Iterating and shipping daily in small increments, you’re able to progress fast and have a sense of achievement every day going home.</li><li>Sometimes you’ll need to complete other tasks and duties as needed.</li></ul><h5><strong>You</strong></h5><ul><li>Love writing elegant code.</li><li>Have a solid foundation of core programming skills in MySQL, PHP and JavaScript</li><li>Have a strong sense of visual aesthetics on web and ability to make it reality with cutting-edge CSS.</li><li>Shiver in horror at the thought of copy-pasting coding.</li><li>Have&nbsp;experience working in social media space (a plus).</li><li>Get nightmares from badly formatted code.</li><li>Understand that usability and attention to visual details matters just as much as good performance and clean architecture.</li><li>You are equally comfortable discussing database architecture as you are in debating animations and shadows in the UI all the while keeping the user story in mind to ensure you’re solving the right problem.</li><li>Have experience working with enterprise-grade SaaS products (a plus).</li></ul><h5><strong>What’s SOCi’s culture like?</strong></h5><p>Our primary driver is professional growth and learning, coupled with a desire to help our customer succeed. We focus heavily on individual mentorship and guidance, peer feedback and are always pushing ourselves and each other to the next level. We’re huge on collaboration – mobing/swarming to solve problems either as individual engineering teams, or even Product/Engineering/Design leaders mobing to work out the best new product approach. We focus on moving fast, learning fast, and not looking back.</p><p><em>SOCi is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.</em></p>        </div><div>        <a href='https://soci.applytojob.com/apply/Acdmv4rAVy/Full-Stack-Web-Developer?referrer=20190205013335NI1WZL0KLPWE4M5Y' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Vq3PVEI_Tg-bZHSbwHC3wQ",
    "url": "https://remote.co/job/staff-software-engineer-game-systems/",
    "title": "Staff Software Engineer, Game Systems",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:embedded/c/1",
      "DBG_TECH1:k/t/w:embedded/embedded/8",
      "DBG_TECH1:k/t/w:unity3d/gamedev/8",
      "DBG_TECH1:k/t/w:unity3d/mobile/5",
      "DBG_TECH1:k/t/w:unreal-engine/gamedev/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=14, mobile=5, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=16, php=0, embedded=8, frontend=0}",
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "Sony",
      "sameAs": "https://www.sie.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2019 3:41:37 PM",
    "validThrough": "Sep 18, 2019 3:41:37 PM",
    "crawled": "Sep 11, 2019 4:07:14 PM",
    "content": "<h3>Staff Software Engineer, Game Systems at <span>Sony</span></h3><div><span><i></i> Remote</span>        </div><div>            <p><strong>Location:</strong> <strong>Remote Employment Eligible</strong></p><p>PlayStation isn’t just the Best Place to Play it’s also the Best Place to Work. We’ve thrilled gamers since 1994, when we launched the original PlayStation. Today, we’re recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation.</p><p><strong>Staff Software Engineer, Game Systems </strong></p><p><strong>Remote </strong><strong>employment</strong><strong> eligible.</strong></p><p>We will consider staff to senior-staff level professional experience.</p><p>How would you like to influence the next generation of the most successful gaming platform of all time? Does it interest you to develop technology used by every single next generation PlayStation developer? We are offering a career opportunity combining both your passion and skills as a software engineer while also allowing you to work with state-of-the-art technology.</p><p>The Worldwide Studios Platform Architecture Group lives at the intersection of PlayStation’s game and platform development. We seek an engineer to develop CPU and IO-focused technologies for a wide range of games and internal systems. If this is you please apply!</p><p><strong>Responsibilities:</strong></p><ul><li>You will enhance our platform technologies and tools including but not limited to:<ul><li>Runtime I/O stack</li><li>Compression and decompression technologies</li><li>I/O and storage device simulation</li></ul></li><li>Liaise with highly motivated teams to effectively apply these innovative technologies</li><li>Provide performance analysis and optimization of game titles and system software</li></ul><p><strong>Qualifications</strong></p><ul><li>A min. of 5 years professional experience working with games, embedded systems or kernel development, including direct experience in one or more of:<ul><li>Game streaming systems</li><li>Memory management and memory mapping</li><li>Filesystem development</li></ul></li><li>Strength and a real passion for C and C++ programming</li><li>Prior exposure to CPU profiling and performance analysis tools</li><li>Excellent ability in testing and debugging complex systems</li><li>Great interpersonal skills (written and oral)</li><li>An interest in games and a dream to create something better</li></ul><p><strong>Nice-to-Have:</strong></p><ul><li>Development on the PlayStation platforms or equivalent experience</li><li>Experience of Unity or Unreal Engine or equivalent experience</li><li>Deep knowledge of FreeBSD or Linux kernel development</li><li>Familiarity with LLVM</li><li>Japanese language skills</li></ul><p>Sony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, gender identity, marital status, genetic information or membership in any other legally protected category.</p><p>We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.</p><p>We sincerely appreciate the time and effort you spent in contacting us and we thank you for your interest in PlayStation.</p>        </div><div>        <a href='https://boards.greenhouse.io/sonyinteractiveentertainmentplaystation/jobs/1788412' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "p4bxYPhzR3yHO9l2updUBQ",
    "url": "https://stackoverflow.com/jobs/290582/bored-of-working-on-crud-apps-get-paid-to-make-koji-web-app-development?a=1zs2dEEcanMk&so_medium=Talent&so_source=TalentApi",
    "title": "Bored of working on CRUD apps? Get paid to make hyper-casual web games! at Koji - Web App ...",
    "tags": [
      "DBG:surround``OR(no,no W central) W offic",
      "DBG_TECH1:k/t/w:embed/embedded/2",
      "DBG_TECH1:k/t/w:express/nodejs/16",
      "DBG_TECH1:k/t/w:flash/frontend/8",
      "DBG_TECH1:k/t/w:game-developer/gamedev/13",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:ios/apple/6",
      "DBG_TECH1:k/t/w:ios/mobile/6",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=6, go=0, nodejs=18, bigdata-ml=0, ruby=0, apple=6, java=0, gamedev=13, php=0, embedded=2, frontend=15}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/gamedev",
      "TECH1/nodejs",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "gamedev",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "Koji - Web App Development Platform",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 9, 2019 9:30:24 PM",
    "validThrough": "Sep 16, 2019 9:30:24 PM",
    "crawled": "Sep 9, 2019 9:30:24 PM",
    "content": "<h3><span>Bored of working on CRUD apps? Get paid to make hyper-casual web games!</span>                </h3>                    <h4>About this job</h4>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Contract</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Student, Junior, Mid-Level</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Graphics/Game Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Mobile Application, Product Development, Web Development</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>11–50 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>VC Funded</span>                                    </div>                            </div>                    </div>                <div>Company: Koji - Web App Development Platform | No office location<br></div><h4>Technologies</h4><div></div><div>javascript</div><div>html5</div><div>progressive-web-apps</div><div>html5-canvas</div><div>p5.js</div>                <h4>Job description</h4>                <div><p><strong><em>tl;dr: We want you to make fun web games that ordinary people can remix using our platform. We will pay you $500 per game.&nbsp;These are simple games, so they shouldn't take you too long to create. Interested? Read on!</em></strong></p><p><a href='https://withkoji.com' rel='nofollow'>Koji</a> is a platform that lets non-coders &quot;remix&quot; games and apps to customize game assets, styles, and basic mechanics. We are excited to work with developers to grow our catalogue of games and let ordinary people remix them into new games that are hilarious, shocking, silly, fun, or all of the above!</p><p><strong>If you have ever wanted to get paid to make fun games and reach potentially millions of people with your work, this is your opportunity.</strong> Koji games have been remixed and shared by all kinds of people, including celebrities, influencers, and athletes from around the world! Koji games embed natively in Reddit, Snapchat, and Instagram, and can be played from any device and on any browser.</p><p>We are looking for developers of all skill levels to create fun, engaging games that are easy to remix and customize. <strong>These games should NOT be complex.</strong> Game formats that work well on Koji include things like endless runners, puzzles like Candy Crush, new takes on classic arcade games, etc. Think of these things like the next evolution of Flash games, not the next Skyrim :)</p><p>There are already hundreds of game templates on Koji, some of our favorites include:</p><ul><li><a href='https://withkoji.com/~Svarog1389/element-match' rel='nofollow'>https://withkoji.com/~Svarog1389/element-match</a></li><li><a href='https://withkoji.com/~Svarog1389/space-blast' rel='nofollow'>https://withkoji.com/~Svarog1389/space-blast</a></li><li><a href='https://withkoji.com/~Svarog1389/burger-revenge' rel='nofollow'>https://withkoji.com/~Svarog1389/burger-revenge</a></li></ul><p>You can see more of our favorites at <a href='https://withkoji.com/create' rel='nofollow'>https://withkoji.com/create</a></p><p>These games are created using Javascript, and are adapted to Koji through the inclusion of a few extra JSON files. Please click &quot;Remix&quot; on any of the games above in order to see the file structure, and how the app uses JSON config files in order to render Koji VCCs (Visual Customization Controls). These VCCs let non-coders customize and modify the games (to do things like turn <a href='https://withkoji.com/~Svarog1389/7c7bd6a6-7947-42dd-843b-4dd933fdb5a3' rel='nofollow'>this game</a> into <a href='https://withkoji.com/~luis/deeterplays-spaceship-commando' rel='nofollow'>this game</a>).</p><p><strong>If you create a new game template that meets our specifications, we will pay you $500 USD per game.</strong> There is no limit on the number of games you can create for us, but additional games must be meaningfully distinct from each other in order to qualify for additional payment.</p><p>In order to be accepted, games must meet ALL of the following criteria:</p><ul><li>Game must load properly in the Koji editor and publish correctly from the editor. We recommend remixing a <a href='https://withkoji.com/tag/scaffolds-(for-developers)' rel='nofollow'>scaffold</a>, or remixing an existing game and simply deleting the game logic in the Koji editor and replacing it with your own game.<br><br></li><li>Game must include VCCs that allow people to remix and customize the game in meaningful ways (changing images, sounds, strings, and other game mechanics). Please remix some of the games on the &quot;<a href='https://withkoji.com/create' rel='nofollow'>/create</a>&quot; page tor examples of what kinds of things should be abstracted into VCCs. Changes to VCCs should be reflected immediately in the live preview of the Koji Editor via hot reloading.<br><br></li><li>If appropriate, game should include a backend with a leaderboard. Take a look at the code of some of the sample games for examples of how to do this using an Express server.<br><br></li><li>Game must be responsive and work well on both desktop and mobile devices. Please make sure to test across browsers and devices. Game must work in Mobile Safari on iOS. If you do not have access to an iOS device, please join our Discord -- others in the community can help you to test and debug on iOS devices.<br><br></li><li>If game uses arrow keys, it should terminate propagation of those keypresses. Koji games render in iFrames, so pressing the down/up arrow keys when playing the game should not scroll the parent screen.<br><br></li><li>If a game has background audio/music, the music should not start playing until the user starts playing the game. No autoplay music on splash screens.<br><br></li><li>Game should feel compelling and fun to play. Use high-quality assets and pay attention to visual design. Use sounds when appropriate.</li></ul><p>Join our <a href='https://discord.gg/eQuMJF6' rel='nofollow'>Discord server</a> to connect with other developers if you have questions about how to use the platform, or are looking for feedback/inspiration for your game.</p><p><strong>Before you start working on your game, please apply using the application link and tell us a little bit about yourself, as well as give us a general idea of what you want to create.</strong> Don't worry, there's no lengthy interview process -- we just want to get a sense of what you want to build so we can make sure it meets our criteria before you start spending time working on it.</p><p>Once you've been approved (we try to process approvals within 72 hours), you will be given a link to a form where you can submit your game once it's finished, as well as your payment information. Once you've submitted your game, it will either be approved and you will be paid, or will be rejected with a list of required changes. After you make those changes, you can resubmit. Please make sure you share your game in Discord to get feedback from the community before submitting it to us for review.</p><p><strong>Let this be a change of pace from boring CRUD apps -- be creative, have fun, and get paid to make games! :)</strong></p>                </div>            <div>        <a href='https://forms.gle/eNihPaasY8eb4EzB8' rel='nofollow'>                        Apply now        </a></div>            <h4>About Koji - Web App Development Platform</h4>            <div><p>Our small team is changing the way non-technical people think about creating software. In the same way that YouTube empowered everyone to become a video broadcaster, we are building a platform that empowers everyone to create apps.&nbsp;</p><p>There are millions of people in the world with ideas for apps and no means to bring those ideas to market. Some of those ideas might be viral hits or have utility to millions of users, but some of them might solve a problem that affects only a few thousand people, or a few hundred. Others might be silly games that make a handful of people giggle. They might be in languages we don’t understand; they might be made for cultures, or subcultures, of which we are not a part.</p><p>Unfortunately, it is so time-consuming, complex, and expensive to develop an app, that almost none of these ideas ever get a fair shake. Only an absurdly small percentage of ideas get built. Even those of us who are capable of full-stack development still limit our appetites because of the complexity of building, deploying, and maintaining an application.</p><p><strong>What is Koji?</strong></p><p><a href='https://venturebeat.com/2019/04/23/gometa-raises-6-million-and-launches-koji-web-app-development-platform/' rel='nofollow'>Koji, backed by over two dozen prominent investors</a>, is an app development platform that dramatically changes the dynamics of building and deploying web applications, empowering orders of magnitude more people to build apps.</p><p>Koji is a two sided marketplace where independent developers create app templates that can be purchased and cloned by “makers.” Koji is a development environment where makers can customize templates, expand their capabilities, and deploy them instantly. Because Koji is a collaborative platform, a supportive community of makers and developers is growing, discovering best practices, and forming lucrative relationships.</p><p>We are constantly getting feedback from users (from all walks of life and all around the world; sometimes tearful with joy and gratitude) who tell us how we have changed their lives. They have become entrepreneurs, found new ways to express their creativity, and get their product ideas to market.</p><p>While we’ve done much over the last 3 years, we are just getting started.</p><p><strong>If you are passionate about:</strong></p><ul><li>Playing a key role in architecting a broad platform and making an impact on the world stage,</li><li>Working on interesting technical problems that haven’t been solved before, utilizing cutting-edge technologies and methodologies,</li><li>Disrupting the status quo, and dramatically changing the dynamics of software development,</li><li>Empowering millions of people to create applications, launch new entrepreneurial ventures, and change their lives fundamentally,</li><li>Working with a close-knit team of technological dreamers who come from Google, MySpace, Buzzfeed, and have absurd, possibly attainable aspirations.</li></ul><p>…you should reach out.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Competitive Salary</span>                            </li>                            <li>                                <span></span>                                <span>Stock Options</span>                            </li>                            <li>                                <span></span>                                <span>Medical</span>                            </li>                            <li>                                <span></span>                                <span>Dental</span>                            </li>                            <li>                                <span></span>                                <span>Vision</span>                            </li>                            <li>                                <span></span>                                <span>401k</span>                            </li>                            <li>                                <span></span>                                <span>Any computer / tech you want</span>                            </li>                            <li>                                <span></span>                                <span>Unlimited Vacation / Sick Days</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Mv0Ybg8qSr-PzD1_fvOlTg",
    "url": "https://remote.co/job/android-developer-12/",
    "title": "Android Developer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(europ, european, europeanunion)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:android/java/6",
      "DBG_TECH1:k/t/w:android/mobile/12",
      "DBG_TECH1:k/t/w:c#/c/4",
      "DBG_TECH1:k/t/w:c#/dotnet/10",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:kotlin/mobile/5",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:unity3d/gamedev/24",
      "DBG_TECH1:k/t/w:unity3d/mobile/15",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=10, c=4, mobile=33, go=6, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=24, php=5, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "gamedev",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "SpringboardVR",
      "sameAs": "https://springboardvr.com/"
    },
    "salary": {
      "currency": "USD",
      "minValue": 40,
      "maxValue": 40,
      "info": "",
      "unit": "HOUR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 40 /Hour"
    },
    "employmentType": "UNSET",
    "published": "Sep 2, 2019 4:39:25 PM",
    "validThrough": "Sep 9, 2019 4:39:25 PM",
    "crawled": "Sep 2, 2019 5:07:17 PM",
    "content": "<h3>Android Developer at <span>SpringboardVR</span></h3><div><span><i></i> Remote</span>         | <span> Freelance </span> | <span> International </span></div><div>            <p><strong>REMOTE</strong> · Toronto, Ontario, Canada · Development</p><p>DESCRIPTION</p><p>SpringboardVR is the fastest growing Virtual Reality arcade management platform outside of China, and we are looking to expand our development team! Our development team is currently 9 people located across 5 countries working in PHP, Go, C#, and Javascript. Because we are a small team everyone has a chance to take ownership over different projects and products with control over all the technical decisions on how things get built. We love trying new things!</p><p>We are looking to bring on a developer to lead our Android and Unity projects at SpringboardVR. This position will be very self directed and we are definitely looking for someone who is a self starter and is able to take any task and own it from start to finish. You will be developing an Android based MDM software and will work closely with our backend API developers. You will also be working on VR based Unity projects for Android VR headsets.</p><p>This is a full time contract position for 40 hours a week. We are unable to provide any Visa sponsorship.</p><p>This is a fully remote position and we are a fully remote company! Our current development team is located across the Americas, Europe, and South Korea.</p><p><strong>We are open to someone in any timezone, with a preference to North America and Europe.</strong></p><p><strong>REQUIREMENTS:</strong></p><ul><li>Android Development Experience (Kotlin or Java)</li><li>Unity Development Experience</li><li>Can handle constructive criticism</li><li>Self directed</li></ul><p><strong>Nice to Haves:</strong></p><ul><li>Experience working with a fully remote team</li><li>MDM Development Experience</li><li>Experience with other languages – C#, Go</li></ul><p><strong>BENEFITS:</strong></p><p>This is a full time contractor position with the possibility of becoming a salaried employee in the future for U.S. citizens.</p><ul><li>Salary between $25 and $50 per hour</li><li>Working 40 hours a week with no overtime, we value work/life balance!</li><li>Paid every 2 weeks</li><li>Initially a 3 month trial period contract followed by a 1 year contract</li><li>Fully remote team</li></ul>        </div><div>        <a href='https://springboardvr.workable.com/jobs/1116507' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "dPXsYOUtRM-hC3zyWfePdQ",
    "url": "https://jobmote.com/job/67378/lead-software-engineer-telecommute/",
    "title": "Lead Software Engineer - Telecommute",
    "tags": [
      "DBG:surround``3N(telecommut, posit) NOT fulltim",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=4, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=2, java=1, gamedev=8, php=0, embedded=0, frontend=4}",
      "REMOTE1/50",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "UnitedHealth Group",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 31, 2019 10:07:59 PM",
    "validThrough": "Sep 3, 2019 10:07:59 PM",
    "crawled": "Sep 1, 2019 3:06:25 AM",
    "content": "<div><br>Optum is a company that's on the rise. We're expanding in<br>multiple directions, across borders and, most of all, in the way we think.<br>Here, innovation isn't about another gadget, it's about transforming the health<br>care industry. Ready to make a difference? Make yourself at home with us and<br>start doing your life's best work.(sm)<br><br>Software engineering is the application of engineering to the<br>design, development, implementation, testing and maintenance of software in a<br>systematic method. The roles in this function will cover all primary<br>development activity across all technology functions that ensure we deliver<br>code with high quality for our applications, products and services and to<br>understand customer needs and to develop product roadmaps.<br><br>These roles include, but are not limited to analysis, design,<br>coding, engineering, testing, debugging, standards, methods, tools analysis,<br>documentation, research and development, maintenance, new development,<br>operations and delivery. With every role in the company, each position has a<br>requirement for building quality into every output. This also includes<br>evaluating new tools, new techniques, strategies; Automation of common tasks;<br>build of common utilities to drive organizational efficiency with a passion<br>around technology and solutions and influence of thought and leadership on<br>future capabilities and opportunities to apply technology in new and innovative<br>ways.<br>You'll enjoy the<br>flexibility to telecommute* from anywhere within the U.S. as you take on some<br>tough challenges.<br><br><b><br><b>Primary Responsibilities:</b></b><br><br>Perform regular accessibility assessments of enterprise websites<br>and applications.Perform accessibility evaluations for products and services under<br>consideration for purchase and deployment.Research, analyze, and interpret a variety of inputs to conceive<br>and document accessibility requirements.To provide oversight, technical leadership guidance, coordination<br>and support the enterprises use of information technology with a focus on<br>promoting, accessing and maintaining accessibility of digital properties.Effectively represents the voice of user to influence and improve<br>consideration of accessibility concerns in design and development decisions. Collaborate with an interdisciplinary team that includes user<br>experience designers, visual designers, content specialists, and developers<br>during ideation, design, and development. Consult with product teams throughout development and rollout to<br>ensure accessibility concerns are understood, implemented and communicated<br>appropriately. Mentor team members on accessibility and related topics. Participate in scoping and planning of projects.Contribute to internal innovation projects.<br>Required<br><br><b><br><b>Qualifications:</b></b><br><br>Minimum 8 years' experience in a similar role.Advanced knowledge and application of accessibility factors, per<br>W3C WAI guidelines &amp; specifications (WCAG, WAI-ARIA, etc.), Section 508<br>requirements and other relevant standards.Experience of providing critical analysis to the work products of<br>designers and developers.Experience using both Automated and Manual Accessibility<br>inspection methods.Strong communication skills, both verbal and written. Ability to<br>sell ideas with strong negotiation skillsAbility to work collaboratively with team and internal clients. Ability to work autonomously and manage time effectively.<br><br>Preferred<br><br><b><br><b>Qualifications:</b></b><br><br>Experience working with Agile<br>methodology preferredWork with enterprise-level automated<br>testing tools, especially Compliance SheriffAutomating test scripts for<br>development or QADelivering summary reports to<br>executivesSpecialized skills within<br><br><b>accessibility:</b>Mobile (web, hybrid, native iOS and<br>Android)Multimedia (audio/video/animation)Online training (making it accessible)Delivering training in personData visualizationDocumenting best practicesEnterprise-level reporting, rollupsWriting code (HTML, CSS, JavaScript)Technology Careers with Optum. Information and technology have amazing power to transform the health care industry and improve people's lives. This is where it's happening. This is where you'll help solve the problems that have never been solved. We're freeing information so it can be used safely and securely wherever it's needed. We're creating the very best ideas that can most easily be put into action to help our clients improve the quality of care and lower costs for millions. This is where the best and the brightest work together to make positive change a reality. This is the place to do your life's best work.(sm) <br><br>*All Telecommuters<br>will be required to adhere to UnitedHealth Group's Telecommuter Policy.Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.Job Keywords: Lead Software Engineer, Telecommute,<br><br><b>Job Title: </b> Lead Software Engineer - Telecommute <br><b>Shift: </b> Day Job <br><b>Travel: </b> No <br><b>Business: </b> Optum Tech Prod Eng &amp; Data Sol <br><b>Family: </b> Technology <br><b>Telecommuter Position: </b> Yes <br><b>Job Level: </b> Director <br><b>Overtime Status: </b> Exempt <br><b>Posted Date: </b> 8/28/2019 <br><b>State: </b> MA <br><b>Country: </b> United States <br><b>Department: </b> PEDS - Transformation<br> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "6mZtuGCPTauds1fDwEXe5w",
    "url": "https://jobmote.com/job/66593/senior-unreal-programmer-remote-working/",
    "title": "Senior Unreal Programmer - Remote Working",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:game-developer/gamedev/13",
      "DBG_TECH1:k/t/w:unreal-engine/gamedev/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=8, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=21, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "Anonymous",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2019 10:07:34 PM",
    "validThrough": "Sep 1, 2019 10:07:34 PM",
    "crawled": "Aug 30, 2019 3:06:23 AM",
    "content": "<div>Senior Unreal Developer - Remote Working!<br><br>Senior Unreal Developer <br><br>£55,000 +<br><br>London <br><br>Permanent/ contract <br><br> Our client is one of the leading contributors to the games industry, partnering with the largest companies helping them create some of the most successful gaming experiences delivered to millions of users daily. Due to the recent success of the company they are seeking an Unreal Engine Developer to help them continue their ongoing growth.<br><br> The success and rapid growth that the company has seen will almost certainly mean there is potential for quick progression and the and the constant influx of AAA clients will ensure you are always up to date with the latest advancements in the industry.<br><br> This is a crucial and challenging role within a team of software specialists and industry experts developing advanced and highly complex solutions for electronic gaming experiences. Due to the importance of the projects this position will require a strong background in the game design/development sectors. <br><br> Your key skills should include the following:<br><br>Professional background in the gaming industry<br>C++ coding experience<br>Experience with current generation consoles such as PS4 and XBOX ONE<br>Experience in game development of one or more games<br>Robust Software Engineering and Software architecture principles and practice This Company is an expanding presence in the gaming sector with a passion for creating the best content for its clients. Their client portfolio includes the most dominant organisations in the industry, and with the list only increasing you can be sure that the projects you will be working on will require you to solve complex problems to ensure delivery.<br><br> If you're interested in finding out more about this opportunity and becoming a part of this business as it grows, please submit your latest CV using the link provided and we will contact you soon for a confidential discussion.<br><br> We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "QtMsUsQjR_CKUT60_ifG7Q",
    "url": "https://jobmote.com/job/66591/senior-game-developer-remote-working/",
    "title": "Senior Game Developer - Remote Working",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:game-developer/gamedev/65",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=8, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=65, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "Anonymous",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2019 10:07:34 PM",
    "validThrough": "Sep 1, 2019 10:07:34 PM",
    "crawled": "Aug 30, 2019 3:06:23 AM",
    "content": "<div>Senior Game Developer - Remote Working!<br><br>Senior Game Developer <br><br>£55,000 +<br><br>London <br><br>Permanent/ contract <br><br>Our client is one of the leading contributors to the games industry, partnering with the largest companies helping them create some of the most successful gaming experiences delivered to millions of users daily. Due to the recent success of the company they are seeking an experienced senior Game developer to help them continue their ongoing growth.<br><br>The success and rapid growth that the company has seen will almost certainly mean there is potential for quick progression and the and the constant influx of AAA clients will ensure you are always up to date with the latest advancements in the industry.<br><br>This is a crucial and challenging role within a team of software specialists and industry experts developing advanced and highly complex solutions for electronic gaming experiences. Due to the importance of the projects this position will require a strong background in the game design/development sectors. <br><br>Your key skills should include the following:<br><br>Strong C++ programming skills<br>Professional background in the gaming industry<br>Experience with current generation consoles such as PS4 and XBOX ONE<br>Experience in game development of one or more games<br>Robust Software Engineering and Software architecture principles and practice <br><br>This Company is an expanding presence in the gaming sector with a passion for creating the best content for its clients. Their client portfolio includes the most dominant organisations in the industry, and with the list only increasing you can be sure that the projects you will be working on will require you to solve complex problems to ensure delivery.<br><br>If you're interested in finding out more about this opportunity and becoming a part of this business as it grows, please submit your latest CV using the link provided and we will contact you soon for a confidential discussion.<br><br>We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "AxM3yC0dTU27zjlZO4hp8Q",
    "url": "https://remoteok.io/jobs/74799",
    "title": "Lead Remote Android / Unity Developer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(europ, european, europeanunion)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:android/java/6",
      "DBG_TECH1:k/t/w:android/mobile/12",
      "DBG_TECH1:k/t/w:c#/c/4",
      "DBG_TECH1:k/t/w:c#/dotnet/10",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:kotlin/mobile/5",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:unity3d/gamedev/40",
      "DBG_TECH1:k/t/w:unity3d/mobile/25",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=10, c=4, mobile=43, go=6, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=40, php=5, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "gamedev",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "SpringboardVR",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2019 9:17:37 PM",
    "validThrough": "Sep 5, 2019 9:17:37 PM",
    "crawled": "Aug 29, 2019 9:30:29 PM",
    "content": "<span></span> <span><h4>SpringboardVR</h4></span> <br> <h3>Lead Android / Unity Developer</h3> <span></span> <span>verified</span> <br> <span>Worldwide</span> <div>  <div>   SpringboardVR is the fastest growing Virtual Reality arcade management platform outside of China, and we are looking to expand our development team! Our development team is currently 9 people located across 5 countries working in PHP, Go, C#, and Javascript. Because we are a small team everyone has a chance to take ownership over different projects and products with control over all the technical decisions on how things get built. We love trying new things!\\n\\nThis is a full time contract position for 40 hours a week. We are unable to provide any Visa sponsorship.\\n\\nThis is a fully remote position and we are a fully remote company! Our current development team is located across the Americas, Europe, and South Korea.\\n\\nWe are open to someone in any timezone, with a preference to North America and Europe.\\n\\n# Responsibilities\\n We are looking to bring on a developer to lead our Android and Unity projects at SpringboardVR. This position will be very self directed and we are definitely looking for someone who is a self starter and is able to take any task and own it from start to finish. You will be developing an Android based MDM software and will work closely with our backend API developers. You will also be working on VR based Unity projects for Android VR headsets.\\n \\n\\n# Requirements\\n* Android Development Experience (Kotlin or Java)\\n* Unity Development Experience\\n* Can handle constructive criticism\\n* Self directed\\n\\n**Nice to Haves**\\n* Experience working with a fully remote team\\n* MDM Development Experience\\n* Experience with other languages - C#, Go \\n\\n#Salary\\n$104,000\\n \\n\\n#Location\\n- Worldwide   <br>  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "CAtw7g7ARrWB1o1z_wZZrA",
    "url": "https://remote.co/job/senior-android-developer-10/",
    "title": "Senior Android Developer",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:android/java/5",
      "DBG_TECH1:k/t/w:android/mobile/10",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=10, go=0, nodejs=0, bigdata-ml=6, ruby=0, apple=0, java=5, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Polarr",
      "sameAs": "http://www.polarr.co"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 28, 2019 6:43:50 PM",
    "validThrough": "Sep 4, 2019 6:43:50 PM",
    "crawled": "Aug 28, 2019 7:31:18 PM",
    "content": "<h3>Senior Android Developer at <span>Polarr</span></h3><div><span><i></i> Remote</span>         | <span> International </span></div><div>            <p>SAN JOSE, CA; SHENZHEN, CHINA; BEIJING, CHINA; BARCELONA, SPAIN&nbsp;<strong>OR REMOTE</strong></p><p><strong>ENGINEERING</strong></p><p><strong>FULL TIME</strong></p><p>Polarr is looking for a Senior Android developer who’re familiar with video processing as well as knowledge of Tensorflow to bring new interactive A.I. experiences to modern applications.</p><p><strong>You Have:</strong></p><ul><li>Architected and built standalone apps with custom UI elements from scratch</li><li>Worked with animation frameworks where you can smoothly animate elements and transform them following complex design requirements</li><li>Implemented test driven design and accomplished high test coverage for applications you’ve written</li><li>Dealt with low end device development where you optimized RAM performance and UI rendering frame rate</li></ul><p><strong>You Will:</strong></p><ul><li>Work on complex video and image processing apps with high memory footprint and CPU usage.</li><li>Exploring and implementing AI related user features using CoreML and other AI frameworks</li><li>Engineer video and image processing engines that help Polarr users make sophisticated visual effects</li><li>Implement UI/UX design elements</li><li>Experimenting with CoreML AI modules and integrating them with the application experience</li><li>Optimizing app launch speed and performance for lower RAM and CPU usage and reducing crashes</li></ul><p><strong>You Are:</strong></p><ul><li>Considerate of how your code will interface with future versions of Android (forward’s compatibility)</li><li>Architecture first rather than jumping into writing implementation code</li><li>Aware of the latest nuances of Android frameworks and understand how to make them backwards compatible with older devices</li><li>Obsessed with the details, imperfections, no matter how small, are cause for concern</li><li>User experience driven, the positive experience of the user plays a big part in what you do.</li><li>Learn more about our values, mission and team at our careers page!</li><li>Take a look at To Prospective Team Members of Polarr, a short blog written by our co-founders for even more info.</li><li>Benefits and perks: https://www.notion.so/polarr/Company-Perks-03664102040348dfa8da7c4c65deec6c</li></ul><p><strong>Our Mission:&nbsp;</strong>To enable and inspire everyone to make beautiful creations.</p><p><strong>What is Polarr?:</strong></p><p>Polarr is building the world’s largest knowledge base of visual effect, with a mission to enable and inspire everyone to make beautiful creations. Over the last 4 years, our company built a unique ecosystem of visual effects creators and developers such as Samsung, OPPO, Western Digital where millions of visual effects are shared and used every month.</p>        </div><div>        <a href='https://jobs.lever.co/polarr/fa9de9f2-e142-451d-b55f-1fd1e17dd1d1' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "PEQyVkZCS3GiaD50-p660A",
    "url": "https://www.42jobs.io/android/jobs/7943-lead-remote-android-unity-developer",
    "title": "Lead Remote Android / Unity Developer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(europ, european, europeanunion)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:android/java/6",
      "DBG_TECH1:k/t/w:android/mobile/12",
      "DBG_TECH1:k/t/w:c#/c/4",
      "DBG_TECH1:k/t/w:c#/dotnet/10",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:kotlin/mobile/5",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:unity3d/gamedev/40",
      "DBG_TECH1:k/t/w:unity3d/mobile/25",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=10, c=4, mobile=43, go=6, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=40, php=5, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "gamedev",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Matthew Hall",
      "sameAs": "https://springboardvr.com/"
    },
    "salary": {
      "currency": "USD",
      "minValue": 40,
      "maxValue": 40,
      "info": "",
      "unit": "HOUR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 40 /Hour"
    },
    "employmentType": "UNSET",
    "published": "Aug 28, 2019 10:13:51 AM",
    "validThrough": "Sep 4, 2019 10:13:51 AM",
    "crawled": "Aug 28, 2019 11:07:22 AM",
    "content": "<h3>Lead Remote Android / Unity Developer</h3><div><p></p><div><strong>DESCRIPTION<br></strong><br></div><div>SpringboardVR is the fastest growing Virtual Reality arcade management platform outside of China, and we are looking to expand our development team! Our development team is currently 9 people located across 5 countries working in PHP, Go, C#, and Javascript. Because we are a small team everyone has a chance to take ownership over different projects and products with control over all the technical decisions on how things get built. We love trying new things!<br><br></div><div><br></div><div>We are looking to bring on a developer to lead our Android and Unity projects at SpringboardVR. This position will be very self directed and we are definitely looking for someone who is a self starter and is able to take any task and own it from start to finish. You will be developing an Android based MDM software and will work closely with our backend API developers. You will also be working on VR based Unity projects for Android VR headsets.<br><br></div><div><br></div><div>This is a full time contract position for 40 hours a week. We are unable to provide any Visa sponsorship.<br><br></div><div><br></div><div>This is a fully remote position and we are a fully remote company! Our current development team is located across the Americas, Europe, and South Korea.<br><br></div><div><br></div><div>We are open to someone in any timezone, with a preference to North America and Europe.<br><br></div><div><strong>REQUIREMENTS</strong></div><ul><li>Android Development Experience (Kotlin or Java)</li><li>Unity Development Experience</li><li>Can handle constructive criticism</li><li>Self directed</li></ul><div><br></div><div><br></div><div><strong>Nice to Haves</strong></div><ul><li>Experience working with a fully remote team</li><li>MDM Development Experience</li><li>Experience with other languages - C#, Go</li></ul><div><br></div><div><strong>BENEFITS</strong></div><div>This is a full time contractor position with the possibility of becoming a salaried employee in the future for U.S. citizens.</div><ul><li>Salary between $25 and $50 per hour</li><li>Working 40 hours a week with no overtime, we value work/life balance!</li><li>Paid every 2 weeks</li><li>Initially a 3 month trial period contract followed by a 1 year contract</li><li>Fully remote team</li></ul><p></p><span>Apply now</span></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Y11V05wxS7Go86T7hqKu0w",
    "url": "https://weworkremotely.com/remote-jobs/matthew-hall-lead-remote-android-unity-developer",
    "title": "Matthew Hall: Lead Remote Android / Unity Developer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(europ, european, europeanunion)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:android/java/6",
      "DBG_TECH1:k/t/w:android/mobile/12",
      "DBG_TECH1:k/t/w:c#/c/4",
      "DBG_TECH1:k/t/w:c#/dotnet/10",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:kotlin/mobile/5",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:unity3d/gamedev/40",
      "DBG_TECH1:k/t/w:unity3d/mobile/25",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=10, c=4, mobile=43, go=6, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=40, php=5, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "gamedev",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Matthew Hall",
      "sameAs": "https://springboardvr.com/"
    },
    "salary": {
      "currency": "USD",
      "minValue": 40,
      "maxValue": 40,
      "info": "",
      "unit": "HOUR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 40 /Hour"
    },
    "employmentType": "UNSET",
    "published": "Aug 27, 2019 10:42:30 PM",
    "validThrough": "Sep 3, 2019 10:42:30 PM",
    "crawled": "Aug 27, 2019 11:30:22 PM",
    "content": "<h3> Lead Remote Android / Unity Developer </h3><div><div><strong>DESCRIPTION<br></strong><br></div><div>SpringboardVR is the fastest growing Virtual Reality arcade management platform outside of China, and we are looking to expand our development team! Our development team is currently 9 people located across 5 countries working in PHP, Go, C#, and Javascript. Because we are a small team everyone has a chance to take ownership over different projects and products with control over all the technical decisions on how things get built. We love trying new things!<br><br></div><div><br></div><div>We are looking to bring on a developer to lead our Android and Unity projects at SpringboardVR. This position will be very self directed and we are definitely looking for someone who is a self starter and is able to take any task and own it from start to finish. You will be developing an Android based MDM software and will work closely with our backend API developers. You will also be working on VR based Unity projects for Android VR headsets.<br><br></div><div><br></div><div>This is a full time contract position for 40 hours a week. We are unable to provide any Visa sponsorship.<br><br></div><div><br></div><div>This is a fully remote position and we are a fully remote company! Our current development team is located across the Americas, Europe, and South Korea.<br><br></div><div><br></div><div>We are open to someone in any timezone, with a preference to North America and Europe.<br><br></div><div><strong>REQUIREMENTS</strong></div><ul><li>Android Development Experience (Kotlin or Java)</li><li>Unity Development Experience</li><li>Can handle constructive criticism</li><li>Self directed</li></ul><div><br></div><div><br></div><div><strong>Nice to Haves</strong></div><ul><li>Experience working with a fully remote team</li><li>MDM Development Experience</li><li>Experience with other languages - C#, Go</li></ul><div><br></div><div><strong>BENEFITS</strong></div><div>This is a full time contractor position with the possibility of becoming a salaried employee in the future for U.S. citizens.</div><ul><li>Salary between $25 and $50 per hour</li><li>Working 40 hours a week with no overtime, we value work/life balance!</li><li>Paid every 2 weeks</li><li>Initially a 3 month trial period contract followed by a 1 year contract</li><li>Fully remote team</li></ul></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
