{
 "items": [
  {
    "id": "2OncWm8WSoiE_6L5gtccyg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/141116/freelance-expert-interviewer-karat?a=LkcSbeLCa0o",
    "title": "Freelance Expert Interviewer at Karat () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><strong>Interviewing is broken. &nbsp;Karat professionalizes interviewing.</strong><br><br><strong>About Karat</strong><br><br>Karat has reengineered technical hiring to ensure that great talent gets noticed by great companies. &nbsp;&nbsp;We augment engineering organizations by conducting the first-rounds of technical interviews on their behalf. Our service saves material engineering time and drives a highly responsive and consistent experience for candidates. &nbsp;Karat continuously invests in cutting edge interview methodologies with an aim of reducing bias and letting candidates demonstrate their true ability.<br><br>We operate as strategic partners for engineering leaders at the world's leading technology companies including Jet, MuleSoft, Roblox, Intuit, Ten-X, Minted and many more. &nbsp;&nbsp;As the gold standard of technical interviewing, our well-funded company is scaling quickly to meet our growing list of client's needs. &nbsp;Come join us!<br><br><strong>Join our elite community of Expert Interviewers.</strong><br><br>Karat’s Expert Interviewers are recognized and rewarded for doing a first-class job as top assessors of technical talent. &nbsp;Every interviewer in the network is an accomplished engineer. &nbsp;Our interviewers include development managers from big-tech companies, start-up engineers and freelancers covering the full technology stack.<br><br><strong>Flexible, high impact work that is compensated at highly competitive rates.</strong><br><br>As an Expert Interviewer, you will be compensated at highly competitive rates for your interviewing expertise. &nbsp;The time commitment is flexible---many of our interviews happen on nights and weekends. &nbsp;Some experts do 10 interviews/week while others do over 25 interviews/week. &nbsp;You can work from anywhere, anytime. &nbsp;You will sharpen your interviewing skills and transform the interviewing experience for every candidate and company.                    </div>                            <h2>                About Karat            </h2>            <div><p><strong>Interviewing is broken. &nbsp;Karat professionalizes interviewing.</strong></p><ul><li>Karat is on a mission to assess the world's talent. &nbsp;We are the first dedicated marketplace for technical interviewers. Karat's network of seasoned engineers conduct the first rounds of technical interviews for elite engineering companies. Our robust platform saves teams thousands of valuable hours while allowing them to focus on the top performing candidates. &nbsp;Karat's unique approach recognizes that people are central to the hiring process and that they can be supercharged by leveraging machine learning and our rich database of the world's interviews.</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Hours - You own your schedule                            </div>                            <div>                                 Work from anywhere                            </div>                            <div>                                 Transparent compensation                            </div>                            <div>                                 Bonus programs                            </div>                            <div>                                 Regular company outings                            </div>                            <div>                                 Access to a world-class community of expert interviewers                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=3, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH2/algorithm",
      "TECH2/data-structures",
      "TECH2/java",
      "TECH2/python",
      "TECH2/technical-interviewing",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "algorithm",
      "bigdata-ml",
      "data-structures",
      "java",
      "python",
      "technical-interviewing"
    ]
  },
  {
    "id": "JBGiBPWSQeSQ60tT_k7J_Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/161361/senior-site-reliability-engineer-bitnami?a=S79ST2mALiE",
    "title": "Senior Site Reliability Engineer at Bitnami () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Services, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span>Bitnami is at the forefront of innovation that scales up to the largest production clouds, as well as down-to-laptop development environments. Millions of applications are launched every month with Bitnami technologies.</span></p><p>Our Site Reliability Engineering (SRE) team deploys microservices to clouds leveraging modern practices such as containers, Kubernetes and immutable infrastructure. &nbsp;The SRE team is responsible for the availability and performance of the production infrastructure as well as partnering with the other engineering teams to successfully build, deploy and manage Bitnami’s services. We are all about tools and automation, not toil and firefighting. If you enjoy working with the cloud, containers, automation and instrumentation, you should join our mission to bring awesome software to everyone.</p><p>You must bring an understanding of the IT business (typically gained by having built or worked extensively with a private or public cloud); a broad perspective of the cloud industry and where it is headed; and experience in building solutions that scale. You will be collaborating with engineers around the world to bring cutting-edge solutions to market. Working with all of the significant cloud providers and container infrastructures will provide you with challenges and opportunities rarely found elsewhere.</p><p><strong><strong>Responsibilities</strong></strong></p><ul><ul><li><span>Design and execute our Kubernetes clusters strategy to help our development teams deliver faster and more reliably</span></li><li><span>Drive adoption of Kubernetes and Kubernetes best practices across the company and industry</span></li><li><span>Create and/or provision reliable tools and infrastructure that enable rapid iteration amongst the product, research and development teams</span></li><li><span>Automate our infrastructure following the pattern Infrastructure as Code </span></li><li><span>Monitor, measure and troubleshoot infrastructure and services</span></li><li><span>Optimize business continuity capabilities and drive down incident recovery times</span></li><li><span>Capacity planning and management</span></li><li><span>Provide support during office hours</span></li><li><span>Mentor other members of the team (both inside and outside the SRE team)</span></li></ul></ul><p><strong><strong>Requirements</strong></strong></p><ul><ul><li><span>At least 5 years of experience deploying, monitoring and troubleshooting multi-tier SOA applications and distributed systems at scale</span></li><li><span>Software development with any or all these programming languages: Ruby, Go, Java, Javascript, Python</span></li><li><span>Instrumentation for status and trend monitoring experience (CloudWatch, Prometheus, Graphite, etc.)</span></li><li><span>Experience with modern application system log management (Syslog, SumoLogic, Fluentd, Loggly, Splunk, etc.)</span></li><li><span>Container or cloud orchestration experience with at least one scheduler (Kubernetes, Docker Swarm, Mesos, etc.)</span></li><li><span>Highly developed cloud literacy with strong knowledge of AWS, GCE and Azure</span></li><li><span>Broad experience with Linux kernel and shell, TCP/IP and HTTP</span></li><li><span>Designing networks and systems for security, encryption, performance and agility</span></li><li><span>Backup and restoration automation, business continuity planning and testing</span></li></ul></ul><p><strong><strong>Nice to Haves</strong></strong></p><ul><ul><li><span>Database administration experience with MySQL replication and high availability</span></li><li><span>Knowledge of networking and security best practices with software defined networks</span></li><li><span>Experience with big data, streaming and search systems like Cassandra, Hadoop, Spark, Kafka and ElasticSearch</span></li></ul></ul><p><strong><strong>Benefits/Perks</strong></strong></p><ul><ul><li><span>Competitive salary and stock options</span></li><li><span>Flexible time off policy; we believe everyone needs to recharge</span></li><li><span>Your choice of operating system and hardware</span></li><li><span>Annual trips to Spain (if working remotely)</span></li><li><span>Benefits vary based on location</span></li></ul></ul>                    </div>                            <h2>                About Bitnami            </h2>            <div><p>Bitnami is a globally-distributed software company, headquartered in San Francisco with team members in over 10 countries. We are a bootstrapped, profitable, high-growth company with a high-energy and passionate team.&nbsp;</p><p>Learn more about us and what it's like to work at Bitnami by visiting the&nbsp;<a href='https://bitnami.com/about-us' rel='nofollow'>About Us</a>&nbsp;and&nbsp;<a href='https://bitnami.com/careers' rel='nofollow'>Careers</a>&nbsp;pages on our website.&nbsp;</p><p><em>Bitnami is an equal opportunity employer.</em></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Your choice of computer and OS                            </div>                            <div>                                 Mmmm food                            </div>                            <div>                                 Stock options                            </div>                            <div>                                 We have fun                            </div>                            <div>                                 Annual All-Hands and Offsite trip                            </div>                            <div>                                 Opportunities to work remotely                            </div>                            <div>                                 Exciting and innovative work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:shell/other/1",
      "DBG_TECH1:techWeightMap:{python=2, other=1, dotnet=0, c=0, mobile=1, go=3, nodejs=1, bigdata-ml=8, ruby=2, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH2/automation",
      "TECH2/cloud",
      "TECH2/containers",
      "TECH2/immutability",
      "TECH2/soa",
      "TITLE1/admin",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "automation",
      "bigdata-ml",
      "cloud",
      "containers",
      "immutability",
      "soa"
    ]
  },
  {
    "id": "JXHhRZ58QbaEf_rz2_FE3A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/64234/senior%e2%80%8b-%e2%80%8bpython%e2%80%8b-%e2%80%8bdeveloper%e2%80%8b-at-causalens/",
    "title": "Senior​ ​Python​ ​Developer​",
    "content": "Senior Python Developer - Full Time (Remote)<br /><br />Summary<br /><br />We are looking for a motivated and high-achieving Senior Python Developer based anywhere in<br />Europe to join the team working on an exciting new Big Data/Machine Learning platform. This is<br />a full time placement with significant opportunities for growth and advancement as one of the<br />first employees of the company.<br /><br />The Company<br /><br />causaLens is high-tech startup based in London. We are bringing machine learning and big data<br />technologies to the World’s leading asset managers. We are an extraordinary team and the<br />founders have worked for some of the most prominent global hedge funds and scientific<br />institutions.<br /><br />Core requirements<br /><br />* Smart, capable and can write clean code.<br />* Ability to design and architect high-performance distributed software.<br />* Development experience in at least one scripting language - preferably Python.<br />* Interest in machine learning/big data (prior experience plus).<br />* Knowledge of the Git version control system.<br />* Good organisational skills both in management of time and code.<br />* Ability to effectively work remotely (from home or a coworking space).<br /><br />Roles and Responsibilities<br /><br />Developing a big data platform for quantitative finance. The application stack is Python, Numpy,<br />Scipy, Sklearn, Keras, Django, Celery, Postgres, AWS, GCP.<br /><br />Benefits<br /><br />Successful candidate will have the opportunity to join a fast-growing, agile, and international<br />team passionate about innovation and making a difference. We will offer guidance, mentorship,<br />and opportunities for professional development.",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 5:43:30 PM",
    "tags": [
      "DBG_TECH1:k/t/w:django/python/8",
      "DBG_TECH1:k/t/w:keras/bigdata-ml/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/9",
      "DBG_TECH1:k/t/w:numpy/python/5",
      "DBG_TECH1:k/t/w:python/python/8",
      "DBG_TECH1:k/t/w:scikit-learn/bigdata-ml/8",
      "DBG_TECH1:k/t/w:scikit-learn/python/5",
      "DBG_TECH1:k/t/w:scipy/python/5",
      "DBG_TECH1:techWeightMap:{python=31, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=25, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "python"
    ]
  },
  {
    "id": "CjlIblzBRBOWxHEPI2qong",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/64233/business-development-full-time-remote-at-causalens/",
    "title": "Business Development (Full Time, Remote)",
    "content": "This is a remote position.<br /><br />Summary<br /><br />We are looking for a motivated and high-achieving individual based in Europe to join the team working on expansion of the company in global markets. This is a full time placement with significant opportunities for growth, travel and advancement as one of the first employees of the company.<br /><br />The Company<br /><br />causaLens is high-tech startup based in London. We are bringing machine learning and big data technologies to the World’s leading asset managers. We are an extraordinary team and the founders have worked for some of the most prominent global hedge funds and scientific institutions.<br /><br />Core requirements<br /><br />* Highly capable, self-motivated, collaborative and personable<br />* Strong academic record<br />* Strong commercial skills gained from a professional background<br />* Interest in advanced technologies such as machine learning<br />* Able to demonstrate integrity, drive and natural curiosity<br />* An excellent written and verbal communicator with a high level of business acumen<br />* Ability to effectively work remotely (from home or coworking space)<br /><br />Roles and Responsibilities<br /><br />The role is varied and involves a combination of strategic &amp;amp; critical thinking, analysis and engagement with internal and external stakeholders.<br />* You will identify new opportunities and manage the full sales cycle from finding new prospects through to closure.<br />* You will be developing and maintaining value-based relationships with our customers.<br />* You will work directly with the CEO on developing and evaluating new opportunities.<br /><br />Benefits<br /><br />Successful candidate will have the opportunity to join a fast-growing, agile, and international team passionate about innovation and making a difference. We will offer guidance, mentorship, and opportunities for professional development.",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 5:40:35 PM",
    "tags": [
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=6, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "FalzHnjdRXKQCyhF9BFh1Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/64232/quantitative-analyst-at-causalens/",
    "title": "Quantitative Analyst",
    "content": "Summary<br /><br />We are looking for a motivated and high-achieving individual based anywhere in Europe to join the team working on an exciting new Big Data/Machine Learning platform. This is a full time placement with significant opportunities for growth and advancement as one of the first employees of the company.<br /><br />The Company<br /><br />causaLens is high-tech startup based in London. We are bringing machine learning and big data technologies to the World’s leading asset managers. We are an extraordinary team and the founders have worked for some of the most prominent global hedge funds and scientific institutions. <br /><br />Core requirements<br /><br />* Experience building financial models<br />* In-depth understanding of the operation of financial markets <br />* Highly capable, self-motivated, collaborative and personable<br />* Strong academic record<br />* Interest in advanced technologies such as machine learning<br />* Ability to demonstrate integrity and drive <br />* Naturally curious and effective problem solver<br />* An excellent written and verbal communicator with a high level of business acumen<br />* Ability to effectively work independently and remotely (from home or coworking space)<br /><br />Roles and Responsibilities<br /><br />This is an exciting role for a smart, creative person to build sophisticated models using the causaLens platform. <br /><br />Benefits<br /><br />Successful candidate will have the opportunity to join a fast-growing, agile, and international team passionate about innovation and making a difference.  We will offer guidance, mentorship, and opportunities for professional development.",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 5:32:59 PM",
    "tags": [
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/9",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=9, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/product",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "f3_4wzs2TzCVdFe60wFyxQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/jobs/5902-full-stack-software-engineer",
    "title": "codelathe: Full Stack Software Engineer",
    "content": "<div>  <div>    <h2>Full Stack Software Engineer</h2>      <h4>Posted Dec  6</h4>    <h3>      <span>codelathe</span><br>      <span>Headquarters: Austin, TX</span><br>        <a href='https://www.getfilecloud.com/jobs/' rel='nofollow'>https://www.getfilecloud.com/jobs/</a>    </h3>  </div>    </div>  <div>    <div><b>About CodeLathe</b></div><div><b><br></b></div><div>At CodeLathe, we are building the world’s most powerful unified file services platform that organizes enterprise data, enhances collaboration and productivity while providing ironclad data protection. Our product FileCloud is quickly becoming the standard in Enterprise File Services space and it is widely used by Global 2000, Fortune 500 and world leading organizations in city, state and federal governments. We are based out of Austin, Texas, USA and looking for talented people anywhere in the globe.&nbsp;</div><div><br></div><div><b>Our Vision</b></div><div><b><br></b></div><div><i>Organize enterprise information and make it universally accessible!</i></div><div><i><br></i></div><div><b>Top Ten Reasons to Join Us</b></div><div><b><br></b></div><ol><li>Work with a world class engineering team that is out to change the world<br></li><li>Fast growing company with lots of growth opportunities<br></li><li>Strong engineering and product focused culture<br></li><li>100% Remote Job – Work comfortably from your home office and avoid the commute<br></li><li>Unique, customer driven software development process<br></li><li>Work on the most challenging technical problems – File Systems, Search, AI, Distributed Systems.<br></li><li>Work on widely used cutting edge tech stack<br></li><li>Gender diversity – Men (60%), Women (40%)<br></li><li>Part of a huge 10+ Billion $ and growing market space<br></li><li>Competitive compensation based on experience and location<br></li></ol><div><span><br></span></div><div><b>Responsibilities</b></div><div><b><br></b></div><ul><li>Create elegant, efficient and maintainable software to support and extend our current software products<br></li><li>Solve complex architectural challenges when implementing new features<br></li><li>Integrate with databases, file systems, cloud services when delivering solutions<br></li><li>Troubleshoot and fix reported customer issues, delivering software patches as needed</li></ul><div><span><br></span></div><div><b>Required Qualifications</b></div><div><b><br></b></div><ul><li>Bachelor’s degree in Computer Science, or in related discipline with 4 or more years of professional software engineering experience, at least 3 years experience in web app development<br></li><li>Strong knowledge of web technologies including HTTP protocol, XML, REST is required<br></li><li>Strong knowledge of Object Oriented programming, design patterns etc is required<br></li><li>Strong knowledge of client server architecture is required<br></li><li>4+ years in PHP development is required<br></li><li>Good understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 is required<br></li><li>Familiarity with SQL/NoSQL databases like MongoDB and their declarative query languages is a plus</li><li>Self starter, highly motivated and works with little or no supervision<br></li><li>Passionate in software development, takes ownership and pride in their job</li></ul><div><span><br></span></div><div><span><br></span></div><div>Location: Remote.&nbsp; Compensation is based on experience and location.&nbsp;</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send a resume to <a href='mailto:jobs@codelathe.com' rel='nofollow'>jobs@codelathe.com</a>. Please refer Job ID: FSE4 as a subject line.</p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 7, 2017 12:03:02 AM",
    "tags": [
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/5",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=5, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=6}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "frontend",
      "php"
    ]
  },
  {
    "id": "rXMYnH7kSCakVomtV20h9Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63503",
    "title": "Full Stack Software Engineer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div><b>About CodeLathe</b></div><div><b><br></b></div><div>At CodeLathe, we are building the world’s most powerful unified file services platform that organizes enterprise data, enhances collaboration and productivity while providing ironclad data protection. Our product FileCloud is quickly becoming the standard in Enterprise File Services space and it is widely used by Global 2000, Fortune 500 and world leading organizations in city, state and federal governments. We are based out of Austin, Texas, USA and looking for talented people anywhere in the globe.&nbsp;</div><div><br></div><div><b>Our Vision</b></div><div><b><br></b></div><div><i>Organize enterprise information and make it universally accessible!</i></div><div><i><br></i></div><div><b>Top Ten Reasons to Join Us</b></div><div><b><br></b></div><ol><li>Work with a world class engineering team that is out to change the world<br></li><li>Fast growing company with lots of growth opportunities<br></li><li>Strong engineering and product focused culture<br></li><li>100% Remote Job – Work comfortably from your home office and avoid the commute<br></li><li>Unique, customer driven software development process<br></li><li>Work on the most challenging technical problems – File Systems, Search, AI, Distributed Systems.<br></li><li>Work on widely used cutting edge tech stack<br></li><li>Gender diversity – Men (60%), Women (40%)<br></li><li>Part of a huge 10+ Billion $ and growing market space<br></li><li>Competitive compensation based on experience and location<br></li></ol><div><span><br></span></div><div><b>Responsibilities</b></div><div><b><br></b></div><ul><li>Create elegant, efficient and maintainable software to support and extend our current software products<br></li><li>Solve complex architectural challenges when implementing new features<br></li><li>Integrate with databases, file systems, cloud services when delivering solutions<br></li><li>Troubleshoot and fix reported customer issues, delivering software patches as needed</li></ul><div><span><br></span></div><div><b>Required Qualifications</b></div><div><b><br></b></div><ul><li>Bachelor’s degree in Computer Science, or in related discipline with 4 or more years of professional software engineering experience, at least 3 years experience in web app development<br></li><li>Strong knowledge of web technologies including HTTP protocol, XML, REST is required<br></li><li>Strong knowledge of Object Oriented programming, design patterns etc is required<br></li><li>Strong knowledge of client server architecture is required<br></li><li>4+ years in PHP development is required<br></li><li>Good understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 is required<br></li><li>Familiarity with SQL/NoSQL databases like MongoDB and their declarative query languages is a plus</li><li>Self starter, highly motivated and works with little or no supervision<br></li><li>Passionate in software development, takes ownership and pride in their job</li></ul><div><span><br></span></div><div><span><br></span></div><div>Location: Remote.&nbsp; Compensation is based on experience and location.&nbsp;</div><p><strong>To apply:</strong> Send a resume to <a href='mailto:jobs@codelathe.com' rel='nofollow'>jobs@codelathe.com</a>. Please refer Job ID: FSE4 as a subject line.</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 7, 2017 12:03:02 AM",
    "tags": [
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/5",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=5, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=6}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "frontend",
      "php"
    ]
  },
  {
    "id": "NQIUrCDUSNKQsxSlv0CvRQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-sysadmin",
    "url": "https://weworkremotely.com/jobs/5884-devops-infrastructure-engineer-de",
    "title": "Apptio: DevOps / Infrastructure Engineer (DE, DK, FR, IT, NL, SE or UK)",
    "content": "<div>  <div>    <h2>DevOps / Infrastructure Engineer (DE, DK, FR, IT, NL, SE or UK)</h2>      <h4>Posted Dec  5</h4>    <h3>      <span>Apptio</span><br>      <span>Headquarters: Bellevue, WA</span><br>        <a href='https://www.apptio.com/about/careers/job-openings?gh_jid=896867' rel='nofollow'>https://www.apptio.com/about/careers/job-openings?gh_jid=896867</a>    </h3>  </div>    </div>  <div>    <div><b>This is a remote position but you must be resident in Denmark, France, Germany, Italy, Netherlands, Sweden or UK.&nbsp;</b><b>We would also accept those willing to relocate but can not provide visa sponsorship for this role.&nbsp;</b><b>No agencies please.</b></div><div><b><br></b></div><div><b>You:</b></div><div><br></div><ul><li>Understand why we try to automate everything<br></li><li>Will help us create the vision of things we should do in the future and then do them<br></li><li>Are someone who wants to grow their skill set by using newer technologies and investigating what will take us to another level<br></li><li>Love to fix things when they are broken and do what you can so they don’t break again<br></li><li>Want to work across a lot of different infrastructure technologies (only limited by your skills or interest)<br></li><li>Have some datacenter experience such as racking servers, cabling, troubleshooting<br></li><li>Are a motivated self-starter who can work effectively as part of a remote team<br></li><li>Are resident in Denmark, France, Germany, Italy, Netherlands, Sweden or the UK. We would also accept those willing to relocate but can not provide visa sponsorship for this role.</li></ul><div><br></div><div><b>Us:</b></div><div><b><br></b></div><div>We are a globally distributed team of engineers whose job is to make sure that our infrastructure is fast, reliable, efficient, and secure so that Apptio’s SaaS offerings can be used to thrill our customers. Examples of recent team accomplishments include:<br></div><div></div><div></div><div></div><div></div><div></div><ul><li>Automate deployments of various customer facing software products across the organisation<br></li><li>Re-architecture of network topology as well as a rebuild / upgrade<br></li><li>Deployment of Kubernetes in Lab environment<br></li><li>Refactoring of MySQL backup strategy in order to better support hundreds of large database instance<br></li></ul><div><span><br></span></div><div><b>What we want you to do:</b></div><div><b><br></b></div><div>You will be a member of our globally distributed technical operations team and will contribute to EMEA business hours coverage as well as working on longer term projects. Our environment consists of both co-located hardware as well as cloud deployments. We work with everything from the hardware through to the application, taking care of operating systems, supporting software, monitoring, metrics and logging.</div><div><br></div><div><b>Basic Qualifications:</b></div><div><b><br></b></div><ul><li>Expertise in Linux/Unix (Red Hat/CentOS a plus) and bash scripting<br></li><li>Demonstrated experience with configuration management tools such as Puppet or Ansible<br></li><li>Experience with programming languages such as Python, Ruby, or Go<br></li><li>Experience with troubleshooting and resolving issues during outages</li></ul><div><br></div><div><b>Preferred Qualifications:</b></div><div><b><br></b></div><div>Experience with and/or serious interest to learn one or more of the following is very valuable:<br></div><div></div><div></div><div></div><div></div><div></div><ul><li>Coding against API’s for infrastructure automation<br></li><li>Containers (Docker, OpenVZ, Virtuozzo)<br></li><li>Continuous integration and automated deployment techniques<br></li><li>Cloud deployment technologies such as Terraform and Cloudformation<br></li><li>Distributed Systems<br></li><li>Distributed Storage Systems such as Parallels Cloud Storage, Hadoop, Ceph, or similar<br></li><li>Messaging Queues (RabbitMQ, ActiveMQ)<br></li><li>Monitoring tools such as Sensu, Nagios, Splunk or Grafana<br></li><li>Virtualization (KVM/QEMU)</li></ul><div><br></div><div><b>The Company</b></div><div><b><br></b></div><div>Apptio is the business management system of record for hybrid IT. We transform the way IT runs its business and makes decisions. With our cloud-based applications, IT leaders manage, plan and optimise their technology investments across on-premises and cloud. With Apptio, IT leaders become strategic partners to the business by demonstrating value of IT investments, accelerate innovation and shift their technology investments from running the business to digital innovation. Hundreds of customers, including more than 40 percent of the Fortune 100, choose Apptio as their business system of record for hybrid IT.</div><div><br></div><div>Apptio is not open to 3rd party solicitation or resumes for our posted FTE positions. Resumes received from 3rd party agencies that are unsolicited will be considered complimentary.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply online at <a href='http://grnh.se/ox4fn71' rel='nofollow'>http://grnh.se/ox4fn71</a>Any questions to <a href='mailto:mbarry@apptio.com' rel='nofollow'>mbarry@apptio.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 3:00:45 PM",
    "tags": [
      "DBG_TECH1:k/t/w:bash/other/1",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=2, other=1, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/admin",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "cQTwiNITSuGOSyv26FWf8Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15827130",
    "title": "SEEKING FREELANCER - Remote (US or Canada specifically)",
    "content": "<div>                  <span>SEEKING FREELANCER - Remote (US or Canada specifically)<p>Looking for deep learning tutorial writers/creators to make deep learning technology screencasts.</p><p>Specifically those who know or are starting out one or more of the following technologies: TensorFlow, PyTorch, CNTK, MXNet (python, jl, c++, etc), Keras, Gluon, DL4J, DeepLearn.js, Torch, Caffe2, Caffe, Paddle, TFLearn, dlib, Theano, chainer, DIGITS, dynet....</p><p>The topic area would be yours to choose.</p><p>I would help you come up with specific tutorials to start out with.</p><p>I pay $50 USD per video, pay for your equipment, and pay ongoing royalties on a monthly basis (with a minimum royalty payout of $600 for the first year)...</p><p>I also give you suggestions on video topics so that you don't have to come up with them at the start...</p><p>I also do the video editing and transcribing for you...</p><p>if interested:</p><p>website -&gt; <a href='https://www.aiworkbox.com' rel='nofollow'>https://www.aiworkbox.com</a>email -&gt; sebastian@aiworkbox.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Dec 1, 2017 10:34:08 PM",
    "tags": [
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:caffe/bigdata-ml/8",
      "DBG_TECH1:k/t/w:deep-learning/bigdata-ml/16",
      "DBG_TECH1:k/t/w:keras/bigdata-ml/8",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:theano/bigdata-ml/8",
      "DBG_TECH1:k/t/w:torch/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=8, mobile=0, go=0, nodejs=0, bigdata-ml=48, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "1zPTCL6RRMq3qXkRmhdcdQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-sysadmin",
    "url": "https://weworkremotely.com/jobs/5796-devops-engineer-europe",
    "title": "Hotjar: DevOps Engineer (Europe)",
    "content": "<div>  <div>    <h2>DevOps Engineer (Europe)</h2>      <h4>Posted Nov 21</h4>    <h3>      <span>Hotjar</span><br>      <span>Headquarters: Malta</span><br>        <a href='https://careers.hotjar.com/o/devops-engineer-europe/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/devops-engineer-europe/?source=WeWorkRemotely</a>    </h3>  </div>    </div>  <div>    <div><strong>Note:</strong>&nbsp;Although this is a remote position, we are currently&nbsp;only&nbsp;seeking candidates in&nbsp;timezones between UTC-2 and UTC+4.</div><div></div><div><br></div><div>Hotjar is looking for a driven and ambitious&nbsp;<strong>DevOps Engineer&nbsp;</strong>based in a European timezone&nbsp;to support and expand our cloud-based infrastructure used by thousands of sites around the world. The Hotjar infrastructure currently processes more than<strong>&nbsp;16,500</strong>&nbsp;API requests per second, delivers over&nbsp;<strong>a billion</strong>&nbsp;pieces of static content every week and hosts databases well into<strong>&nbsp;terabyte-size</strong>ranges, making this an interesting and challenging opportunity.</div><div><br></div><div>This is an excellent career opportunity to join a fast growing remote startup in a key position.&nbsp;</div><div><br></div><div><strong>In this position, you will:</strong><br></div><ul><li>Be part of the team setting up and maintaining the infrastructure that powers our sites and web applications.</li><li>Choose, deploy and manage tools and technologies to build and support a robust infrastructure.</li><li>Be responsible for identifying bottlenecks and improving performance of all our systems.</li><li>Ensure all necessary monitoring, alerting and backup solutions are in place.</li><li>Do research and keep up to date on trends in big data processing and large scale analytics.</li><li>Implement proof of concept solutions in the form of prototype applications.</li></ul><div>&nbsp;</div><div><br></div><div><strong>Compensation Range</strong><br></div><div>The budgeted compensation range for this role is €50,000 to €70,000 annually. Ranges are based on market research and are equitable to other roles within Hotjar. The actual compensation offered to a successful candidate will be based on relative experience and skills. At this time we are only able to provide official employment status to those located in Malta. All other candidates will join our team as full-time consultants and will be responsible for paying any taxes or applicable fees where they reside.&nbsp;</div><div><br></div><div><h4><b>Requirements</b></h4></div><ul><li>Strong working knowledge of Amazon AWS.</li><li>2 or more years of professional experience with systems administration or DevOps.</li><li>Experience with Python, Nginx and PostgreSQL.</li><li>Not required but experience in any of the following is considered to be an asset: Kubernetes, Kafka, Hadoop,&nbsp;Elasticsearch, Redis, Memcached, Jenkins, Mercurial, Vagrant, Docker.</li><li>Must submit to a background check confidentially processed by our third party.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply via <a href='https://careers.hotjar.com/o/devops-engineer-europe/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/devops-engineer-europe/?source=WeWorkRemotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 21, 2017 5:05:21 PM",
    "tags": [
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/admin",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "YRAUTjgtQc6R6gIb9z4OJA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159927/java-developer-apex-expert-solutions?a=RDleossFZFC",
    "title": "Java Developer at APEX Expert Solutions (Arlington, VA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data, Government, Military</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Duties and Responsibilities</strong></p><ul><li>Work in an fast-paced agile development environment architecting and developing Hadoop applications</li><li>Provide technology recommendations for potential product application development</li><li>Gather and analyze requirements from product owners ensuring products meet business requirements</li><li>Collaborate with other software engineers and team leads in designing and developing software solutions which meet high quality standards</li><li>Quickly prototype and develop Python/Java/Scala applications in diverse operating environments capable of interfacing with NoSQL datastores such as Accumulo and HBase</li><li>Write efficient code to extract, transform, load, and query very large datasets to include both structured and unstructured datasets</li><li>Develop standards and new design patterns for Big Data applications and master the tools and technology components within the Hadoop and Cloudera environments</li><li>Design and implement REST API applications provide web application connectivity to backend datastores</li></ul><p><strong>Skills &amp; Requirements</strong></p><ul><li>3 years of building Java applications including framework experience (J2EE, Spring, etc.)</li><li>Experience using traditional ETL tools &amp; RDBMS</li><li>Experience developing REST web services</li><li>Demonstrated ability to quickly learn and apply new technologies</li><li>Demonstrated effective and successful verbal and written communication skills</li><li>Bachelor degree in Computer Science or related technological degree</li><li>U.S. citizen</li></ul><p><strong>Desired Qualifications</strong></p><ul><li>Experience&nbsp;building and coding applications using Hadoop components – HDFS, HBase, Hive, Sqoop, Flume, Spark, etc</li><li>Experience building and maintaining Cloudera-based clusters</li><li>Full life cycle software application development experience</li><li>Experience with unstructured datasets, such as log files, email, text</li><li>Experience with geospatial datasets and datastores</li></ul>                    </div>                            <h2>                About APEX Expert Solutions            </h2>            <div><p>APEX Expert Solutions delivers analytic services, technologies, and training curriculum in support of Department of Defense customers. APEX tightly couples analysts, engineers, and trainers to bring mission success.</p><p>APEX Benefits include 401k with employer matching, 15-days Paid Time Off annually plus 10 Federal Holidays, Tuition Reimbursement, Healthcare, Dental, and Vision.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Vacations and holidays off                            </div>                            <div>                                 Cutting edge technology                            </div>                            <div>                                 Fantastic medical, dental and vision insurance                            </div>                            <div>                                 Work from home options                            </div>                            <div>                                 Social activities and events                            </div>                            <div>                                 Competitive salary and bonuses                            </div>                            <div>                                 Business casual attire                            </div>                            <div>                                 Collaborative environment                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/24",
      "DBG_TECH1:k/t/w:java-ee/java/13",
      "DBG_TECH1:k/t/w:java/java/6",
      "DBG_TECH1:k/t/w:java/mobile/3",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:scala/java/3",
      "DBG_TECH1:k/t/w:spring/java/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=3, go=0, nodejs=0, bigdata-ml=24, ruby=0, apple=0, java=30, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH1/java",
      "TECH2/bigdata",
      "TECH2/cloudera",
      "TECH2/geospatial",
      "TECH2/hadoop",
      "TECH2/java",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata",
      "bigdata-ml",
      "cloudera",
      "geospatial",
      "hadoop",
      "java"
    ]
  },
  {
    "id": "zwM4NKuDSAiuSj3pYb6bZw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8088-sales-engineer",
    "title": "Sales Engineer",
    "content": "Sales Engineer - Jobmote<div><div><h2>Sales Engineer</h2><h5>iMerit Technology Services</h5></div></div><div><div><div><div><div><p>About iMerit </p><p>iMerit is a unique for-profit company with a social impact mission. We specialize in providing data services to global clients. Founded by successful entrepreneurs in Silicon Valley, we employ marginalized youth and women who have been trained in digital skills. This workforce provides critical services such as data enrichment, sentiment analysis, and data classification.</p><p>Our customers range from large, enterprise organizations to high-impact tech and e-commerce companies. We work with their most innovative teams in Machine Learning, Computer Vision, Product Experience and Data Science. </p><p>Our funders include Omidyar Network and the Michael and Susan Dell Foundation. &nbsp;With 800+ employees, we are an agile and fast-paced global startup with growing revenues and hands-on leadership.</p><p>About the Role </p><p>As a Sales Engineer, you are working closely with the Sales team’s efforts to engage with prospective clients and translate their often custom requirements into a full-fledged end-to-end data processing solution.</p><p>In order to establish new processes, you will be working with the Sales team, prospective and current clients, and the India-based Project Delivery team. You will also have the opportunity to design, coordinate, and product manage in-house development of custom tools, platforms, and workflows.</p><p>This is a role for self-directed learners, creative thinkers, and workplace chameleons. You will need to be adaptive, curious and resourceful and enjoy working with a diverse young team.</p><p>Responsibilities: </p><ul><li>Work with customers and prospective customers to deeply understand their proposed use case(s) and propose solutions based on iMerit’s core offerings, technology, and workforce capability<br></li><li>Lead newly engaged customers through any technical sales consultation and project implementation phase, while building trust in the solutions offered by iMerit<br></li><li>Work as the bridge between Sales, guiding their understanding of project implementation, and Project Delivery (responsible for actually delivering quality work). This requires a strong ability to multi-task, and switch gears between teams with competing priorities.<br></li><li>Provide consultative proposals and findings to clients in an organized and accessible manner. This includes a combination of data analysis, development of workflow proposals, and the ability to clearly map out process and values provided by the iMerit team. While heavily consultative, the ability to win (and maintain) client trust is of great importance.<br></li><li>Manage multiple projects simultaneously, including the project design, development, implementation, and delivery</li></ul><p>Required Experience/Skills: </p><ul><li>Minimum 3 years experience and success working in a customer-facing role<br></li><li>Prior experience managing a variety of projects and accounts, at different stages of development<br></li><li>Ability to work interculturally and in a distributed team<br></li><li>Interest (and openness) to travel (India and California)<br></li><li>Self-directed learner and hands-on problem solver<br></li><li>Comfortable working with numbers and data<br></li><li>Prior experience in Account Management, Project Management, Customer Success or Pre-Sales Consultation<br></li><li>Desire to learn independently about market trends, technology, and concepts in Machine Learning/Data Science field<br></li></ul><p>Ideal Candidate Traits/Experience: </p><ul><li>Experience working for an international company<br></li><li>Experience working with remote teams<br></li><li>Experience working in/with India<br></li><li>Prior work history with crowd-sourcing/outsourcing<br></li><li>Moderate to advanced Excel knowledge<br></li><li>Basic knowledge of SQL and other databases<br></li><li>Interest in social impact<br></li><li>Basic familiarity with programming languages such as HTML, PHP, Python, R<br></li><li>Based in San Francisco Bay Area a plus (Remote OK)</li></ul><p>Location: United States </p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Nov 16, 2017 12:00:26 AM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:classification/bigdata-ml/1",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/6",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=7, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/php",
      "TITLE1/sales",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "php"
    ]
  },
  {
    "id": "hAtgyHGfRTiXR6VZbSakDQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3969-product-manager-hyp3r",
    "title": "Product Manager @ HYP3R",
    "content": "<h2>              Product Manager<small> @ HYP3R</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-11-08 23:24</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>ABOUT HYP3R</strong></p><p>HYP3R is a real-time, location-based engagement platform. Our platform makes it easy for businesses to engage influential customers at specific locations on a personal level, in real-time. What excites us most about HYP3R is building a new frontier for brand communication, powered by timely, authentic engagement in the context of location. We are on a mission to make marketing efficient for businesses and delightful for consumers. That yin-yang has been our guiding light.</p><p>We are looking for some of the most talented people in the world to join our winning team. After graduating from Disney Accelerator and Techstars last fall, we have gained the trust of amazing partners - including leading companies in travel, professional sports teams, and global brands. We recently won the NFL’s and TechCrunch’s 1st &amp; Future competition at Stanford as well as the Visa Everywhere Global Events Challenge. We are a well-funded, revenue-generating company headquartered in San Francisco.</p><p><strong>YOUR ROLE</strong></p><p>HYP3R is looking for a disciplined and impact-driven B2B Product Manager who wants to help us transform enterprise marketing software. Collaborating with the VP of Product, stakeholders, and cross-functional teams, you will coordinate and lead key product initiatives. You will be responsible for influencing, inspiring, and guiding effective and efficient product development.</p><p><strong>RESPONSIBILITIES</strong></p><ul><li>Help define the roadmap and product strategy</li><li>Communicate product direction, coordinate sprint cycles, ensure quality, and act as liaison with leads from engineering, design, QA, and client-facing teams to ensure we build the right things, at the right time</li><li>Identify underserved market needs, facilitate solutions design, and assess the technical, UX, and business impact of opportunities</li><li>Prioritize, define, and validate features, aligned to strategic initiatives and business drivers</li><li>Proactively enhance our product development processes and best practices</li><li>Write documentation including product scope, user stories, user flows, value propositions, go-to-market plans, test cases, and issues/tickets</li><li>Partner with customer success and sales to understand and prioritize user issues and requests</li><li>Accountable for release outcomes; supporting design, tech and QA teams with reviewing and ensuring UX and overall quality</li><li>Implement analytics to measure and validate success in terms of usage, engagement, task success, and satisfaction</li><li>Monitor partner updates, develop competitive intel and evaluate opportunities in the technology landscape</li><li>Champion innovation and continuous improvement</li><li>Represent the HYP3R team and embody our product principles: Think Big, Start Simple, Leap Forward, Stay Flexible, Win Together</li></ul><p><strong>ABOUT YOU</strong></p><ul><li>4+ years of overall industry experience with at least 2+ as a product manager</li><li>Passion about HYP3R, our vision, and the problem we are solving</li><li>Experience in enterprise SaaS, marketing cloud, and SMMS is a big plus</li><li>Strong track record working with front-end, back-end, data and AI engineers</li><li>Strong track record working with product and communications designers</li><li>Business and data analysis skills, including requirements gathering and user science - analytics and research</li><li>Clear and precise communication skills, and ability to work with remote and distributed teams in a rapidly growing, not-super-structured, startup environment</li><li>Amazing organizational and problem-solving skills, balancing many projects, rigid timelines, and client requests</li><li>Desire to contribute to a culture of craftsmanship, impact, speed, empathy, and shared success</li><li>Hands-on with software tools for project management, software development, and product road mapping</li><li>Ability to thrive and have fun in a fast-paced, ever-changing, high-growth company </li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Nov 9, 2017 1:24:15 AM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG:surround``OR(global, distributed) 2N team",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=5, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/product",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "1puI6tjhRNCZlGS9PoGZbA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62937",
    "title": "Product Manager",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>ABOUT HYP3R</strong><br><br>HYP3R is a real-time, location-based engagement platform. Our platform makes it easy for businesses to engage influential customers at specific locations on a personal level, in real-time. What excites us most about HYP3R is building a new frontier for brand communication, powered by timely, authentic engagement in the context of location. We are on a mission to make marketing efficient for businesses and delightful for consumers. That yin-yang has been our guiding light.<br><br>We are looking for some of the most talented people in the world to join our winning team. After graduating from Disney Accelerator and Techstars last fall, we have gained the trust of amazing partners - including leading companies in travel, professional sports teams, and global brands. We recently won the NFL’s and TechCrunch’s 1st &amp; Future competition at Stanford as well as the Visa Everywhere Global Events Challenge. We are a well-funded, revenue-generating company headquartered in San Francisco.<br><br><strong>YOUR ROLE</strong><br><br>HYP3R is looking for a disciplined and impact-driven B2B Product Manager who wants to help us transform enterprise marketing software. Collaborating with the VP of Product, stakeholders, and cross-functional teams, you will coordinate and lead key product initiatives. You will be responsible for influencing, inspiring, and guiding effective and efficient product development.<br><br><strong>RESPONSIBILITIES</strong><br><br></p><ul><li>Help define the roadmap and product strategy<br></li><li>Communicate product direction, coordinate sprint cycles, ensure quality, and act as liaison with leads from engineering, design, QA, and client-facing teams to ensure we build the right things, at the right time<br></li><li>Identify underserved market needs, facilitate solutions design, and assess the technical, UX, and business impact of opportunities<br></li><li>Prioritize, define, and validate features, aligned to strategic initiatives and business drivers<br></li><li>Proactively enhance our product development processes and best practices<br></li><li>Write documentation including product scope, user stories, user flows, value propositions, go-to-market plans, test cases, and issues/tickets<br></li><li>Partner with customer success and sales to understand and prioritize user issues and requests<br></li><li>Accountable for release outcomes; supporting design, tech and QA teams with reviewing and ensuring UX and overall quality<br></li><li>Implement analytics to measure and validate success in terms of usage, engagement, task success, and satisfaction<br></li><li>Monitor partner updates, develop competitive intel and evaluate opportunities in the technology landscape<br></li><li>Champion innovation and continuous improvement<br></li><li>Represent the HYP3R team and embody our product principles: Think Big, Start Simple, Leap Forward, Stay Flexible, Win Together<br><br><strong>ABOUT YOU</strong><br><br></li><li>4+ years of overall industry experience with at least 2+ as a product manager<br></li><li>Passion about HYP3R, our vision, and the problem we are solving<br></li><li>Experience in enterprise SaaS, marketing cloud, and SMMS is a big plus<br></li><li>Strong track record working with front-end, back-end, data and AI engineers<br></li><li>Strong track record working with product and communications designers<br></li><li>Business and data analysis skills, including requirements gathering and user science - analytics and research<br></li><li>Clear and precise communication skills, and ability to work with remote and distributed teams in a rapidly growing, not-super-structured, startup environment<br></li><li>Amazing organizational and problem-solving skills, balancing many projects, rigid timelines, and client requests<br></li><li>Desire to contribute to a culture of craftsmanship, impact, speed, empathy, and shared success<br></li><li>Hands-on with software tools for project management, software development, and product road mapping<br></li><li>Ability to thrive and have fun in a fast-paced, ever-changing, high-growth company </li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 9, 2017 1:24:15 AM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG:surround``OR(global, distributed) 2N team",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=5, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/product",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "V6hPD2wcQlyEi7fZv2f9Bw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62652",
    "title": "Backend Engineer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>***&nbsp;We offer flexible and full remote work over Europe.</strong></p><br><p><strong>We are not ready yet to work with people outside EU but will keep you posted on that ;) ***<br></strong></p><br><p>Hands in hands with the Product, Design, Infrastructure and Mobile team, the Backend team has its great deal of challenges to tackle: scaling our ever growing backend business, pushing data science logics in production, shipping game changer features for our passengers and drivers with the sole goal of creating the most respectful and playful experience for them, across many launched cities, and many to come.</p><br><p><br>We expect the marketplace we are building to scale so it can support our European expansion ambitions. Fortunately, we can rely on our solid micro-services architecture (Golang, Elixir, Docker…) and our talented team to make it better.</p><br><p>Welcome behind the scenes !</p><br><p><br></p><p><strong>OUR ENGINEERING VALUES</strong></p><br><ul><br><li><strong>Move smart</strong>: we are data driven, and employ tools and best practices to ship code quickly and safely (continuous integration, code review, automated testing, etc).</li><br><li><strong>Distribute knowledge</strong>: we want to scale our engineering team to a point where our contributions do not stop at the company code base. We believe in the Open Source culture and communication with the outside world.</li><br><li><strong>Leave code better than you found it</strong>: because we constantly raise the bar.</li><br><li><strong>Unity makes strength</strong>: moving people from A to B is not as easy as it sounds but, we always keep calm and support each other.</li><br><li><strong>Always improve</strong>: we value personal progress and want you to look back proudly on what you’ve done.</li><br></ul><br><br><p><strong>WHAT YOU’LL DO</strong></p><br><ul><br><li>Implement smart models to predict future supply and demand</li><br><li>Aggregate and play with data coming from various sources</li><br><li>Work on new features in microservices environment and contribute to the improvement and optimization of our architecture</li><br><li>Optimize our operational platform to make our support even more awesome.</li><br></ul><br><p>&nbsp;Things we’d like to experiment with:</p><br><ul><br><li>Event sourcing</li><br><li>Kafka…</li><br></ul><br><p>If your are more an infractructure person wanting to deliver happiness to our backend team by building tools and frameworks please check out our&nbsp;Infrastructure Engineer&nbsp;job offer.</p><br><br><br><br><p><strong>REQUIREMENTS</strong></p><br><ul><br><li>5+ years as a software engineer, mainly focused on backend.</li><br><li>You are a product oriented developer, you own, design and implement features from A to Z, you help monitor and maintain them after they are shipped with focus on the end.</li><br><li>You have analytical and diagnostic skills, a proactive problem solving mindset.</li><br><li>You’ve worked with Ruby-on-Rails or Go in production environments, experience in Elixir would be great…</li><br><li>… but more than mastering 1 single language, you’re curious and a fast learner, you showed your ability to switch to another technology just to get out of your comfort zone.</li><br><li>Experience working with high volumes, databases, relational (PostgreSQL) or NoSQL.</li><br><li>Exposure to architectural patterns of a large, high-scale web application and microservices.</li><br><li>Good testing skills.</li><br><li>Sharing is caring, you are generous in your communication and knowledge sharing with your team.</li><br></ul><br><p><strong>BONUS POINTS</strong></p><br><ul><br><li>Contributions to open source projects</li><br><li>Experience with message brokers (such as Kafka, RabbitMQ)</li><br><li>Exposure to real-time technology problems</li><br><li>Experience with ETL and Hadoop</li><br><li>Experience with Docker and/or Mesos Marathon (or similar)</li><br></ul><br><br><p><strong>PERKS</strong></p><br><ul><br><li>Permanent contract (CDI)&nbsp;</li><br><li>Stock</li><br><li>Paid conference attendance/travel and periodic team meetups</li><br><li>Heetch credits</li><br><li>A Spotify subscription</li><br><li>Work from anywhere you want</li><br></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 6, 2017 12:10:19 AM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:k/t/w:unity3d/gamedev/8",
      "DBG_TECH1:k/t/w:unity3d/mobile/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=5, go=6, nodejs=0, bigdata-ml=8, ruby=8, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/gamedev",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "gamedev",
      "ruby"
    ]
  },
  {
    "id": "VdpdVBuNQPCxtm2wYvAE8w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159230/data-application-engineer-strong-analytics?a=RoQGHFhc1vG",
    "title": "Data Application Engineer at Strong Analytics (Chicago, IL) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data, Data Science, Machine Learning</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Strong Analytics is seeking an application and data engineer to collaborate with our team on developing machine learning and&nbsp;Extract-Transform-Load (ETL) data pipelines, building RESTful APIs&nbsp;to trained statistical models, and&nbsp;deploying real-time streaming applications for continuous data processing.</p><p>This role&nbsp;is focused on applying and embedding machine learning solutions crafted by our team of PhD-trained data scientists. As such, it does not require deep expertise in machine learning or statistics, but rather&nbsp;a broad expertise in ingesting, storing, and analyzing data at scale.</p><p>To be eligible for this role, it is expected that you have experience:</p><ul><li>Building and deploying Python applications to cloud-based infrastructures (e.g., AWS).</li><li>Writing complex SQL queries for a variety of data stores (e.g., Postgres, MySQL, Redshift).</li><li>Deploying (not necessarily designing/testing) machine learning pipelines and statistical models using one or more libraries, such as Tensorflow, Keras, PyTorch, scikit-learn, or XGBoost.</li><li>Designing distributed applications that use workers and queues to manage asynchronous tasks.</li><li>Designing and building RESTful APIs.</li><li>Managing *nix servers via the terminal.</li><li>Managing and monitoring scheduled/batch jobs.</li><li>Writing unit tests.</li><li>Using&nbsp;continuous integration.</li><li>Collaborating via Git.</li></ul><p><em>Ideally</em>, you would also have experience (or an aptitude to learn about):</p><ul><li>Building&nbsp;Apache Spark applications to analyze and learn from data at scale.</li><li>Building and deploying streaming applications (e.g., Spark Streaming, Akka Streams).</li><li>Deploying applications powered by Hadoop and/or other services provided by AWS EMR.</li></ul><p>You do not need a PhD (or any formal education, for that matter) for this role. Applicants will be evaluated first-and-foremost on their experience and skill in the areas described above.</p><p>You should have the ability to travel infrequently (&lt;5% of your time) for team meetups and conferences.</p><p><strong>Remote or On-Site</strong></p><p>This position offers 100% remote work for candidates outside the Chicago area with exceptional communication and remote collaboration skills. Candidates in the Chicago area who can work in-person with our team are preferred.</p><p><strong>What We Offer</strong></p><ul><li>Competitive salary</li><li>Profit sharing or equity, based on experience</li><li>Health insurance</li><li>Generous vacation policy</li><li>Flexible work-from-home&nbsp;policy</li><li>Company-issued MacBook Pro's</li></ul>                    </div>                            <h2>                About Strong Analytics            </h2>            <div><p>We are a team of PhD-trained data scientists with expertise in machine learning, research and analytics, and deploying data-driven applications at scale.</p><p>We help organizations of all sizes — from new startups to Fortune 500 enterprise firms — tackle challenging analytics and machine learning projects. We help them frame their problems, design end-to-end solutions, and deploy/monitor analytics dashboards and machine learning pipelines that optimize their operations and help them build smarter products.</p><p>We are always working on new projects in a variety of industries, including the automotive, pharmaceutical, engineering, healthcare, SaaS, and consumer apps spaces. This leads to a fast-paced, learning-focused environment where we are always learning new things in collaboration with our team (and our clients' teams) in order to provide state-of-the-art solutions that work for our clients.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Small, fun team of experts                            </div>                            <div>                                 Focus on continued learning, development, and growth                            </div>                            <div>                                 Generous vacation policy                            </div>                            <div>                                 Flexible work-from-home policy                            </div>                            <div>                                 Competitive salaries and health insurance benefits                            </div>                            <div>                                 Path to partnership through profit sharing and equity                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``2W(100, remot)",
      "DBG_TECH1:k/t/w:akka/java/8",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:keras/bigdata-ml/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/24",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:scikit-learn/bigdata-ml/8",
      "DBG_TECH1:k/t/w:scikit-learn/python/5",
      "DBG_TECH1:techWeightMap:{python=7, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=48, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH2/amazon-web-services",
      "TECH2/apache-spark",
      "TECH2/machine-learning",
      "TECH2/python",
      "TECH2/sql",
      "TITLE1/data",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "apache-spark",
      "bigdata-ml",
      "machine-learning",
      "python",
      "sql"
    ]
  },
  {
    "id": "16V07UQISyexvLFpFlcHiA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157566/machine-learning-engineer-f-m-100-remote-jaumo-gmbh?a=QQfwOnzjZQY",
    "title": "Machine Learning Engineer f/m (100% Remote) at Jaumo GmbH (Göppingen, Germany) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Dating, Messaging, Social Networking</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We're looking for a new employee in our<strong>&nbsp;small five-person team</strong>&nbsp;and give you the opportunity to be part of a very exciting journey.</p><p>You are a&nbsp;<strong>Machine Learning&nbsp;Engineer</strong>&nbsp;(f/m) with&nbsp;<strong>strong experience</strong>, and you will be an essential part of our&nbsp;<strong>lean and focused</strong>&nbsp;company. The position is&nbsp;<strong>full-time</strong>. This is an excellent career opportunity to join a fast growing&nbsp;<strong>100% remote</strong>&nbsp;company in a key position.</p><p>You will:</p><ul><li>provide our fastgrowing dating app <strong>used by millions of users on a monthly&nbsp;basis</strong> with an intelligent and personalized experience for finding&nbsp;a partner</li><li><strong>solve challenging problems</strong> like online dating scam/fraud/fake prevention, automated moderation, optimizing matching algorithms and our recommendation system.&nbsp;</li><li><strong>introduce and scale</strong> a machine learning and data processing platform</li><li>take&nbsp;<strong>ownership</strong>&nbsp;of your codebase</li><li>be accountable for all aspects of your work, from research and analysis to testing and deployment</li><li>work agile with a motivated and innovative small team (us, the two founders)</li></ul><p><strong>Skills &amp; Requirements</strong></p><p>An ideal candidate is autonomous, proactive, and has a professional experience with machine learning technologies. We admire engineers who take the initiative, make their own decisions and implement them precisely.&nbsp;</p><p>Your qualifications:</p><ul><li>at least 3 years of experience in software development, ideally in a high-performance web or mobile environment</li><li>solid experience in&nbsp;at least one of the following areas: machine learning, recommendation systems, pattern recognition, data mining or artificial intelligence</li><li>experience with one or more general purpose programming languages like Python, PHP, Java</li><li>you love getting things done you never give up, when it’s getting difficult. It’s a challenge to master every situation.</li><li>you speak and write business-fluent English</li></ul><p>If this profile matches your expertise, experience, and aspirations, we’d be delighted to receive your full application,&nbsp;<strong>including salary requirements&nbsp;</strong>and<strong>&nbsp;possible starting date</strong>.</p>                    </div>                            <h2>                About Jaumo GmbH            </h2>            <div><p>Jaumo is one of the <strong>fastest growing dating apps</strong> worldwide with more than <strong>30&nbsp;million members</strong> in over 180 countries. The app for <strong>Android and iOS</strong> is available in 59 languages and among the Top #5 dating apps in many countries. We connect people.&nbsp;For fun. For love. For life.</p><p>Our company is bootstrapped and operated by <a href='https://www.jaumo.com/about/' rel='nofollow'>just the two founders</a>. We're not a start-up anymore, and we have proven that we built a sustainable business in a fast-growing, competitive and profitable sector.</p><p><strong>The perks:</strong></p><ul><li><strong>remote and flexible</strong> (work from anywhere within a timezone you choose)</li><li><strong>30 paid personal vacation days</strong> per year</li><li>only the best hardware and software (use what works best for you)</li><li>personal home office budget (2,000 € to buy what you need every 2 years)</li><li>make a difference (we're laser-focused and lean)</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Be our number 1 employee                            </div>                            <div>                                 Lean company - no bullshit                            </div>                            <div>                                 We work remote                            </div>                            <div>                                 Flexible schedules                            </div>                            <div>                                 Ability to work with cutting-edge technology                            </div>                            <div>                                 Competitive salary                            </div>                            <div>                                 You can make a difference                            </div>                            <div>                                 Paid time off                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``2W(100, remot)",
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/5",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/15",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=5, go=0, nodejs=0, bigdata-ml=20, ruby=0, apple=2, java=3, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH2/bigdata",
      "TECH2/deep-learning",
      "TECH2/machine-learning",
      "TECH2/python",
      "TECH2/tensorflow",
      "TITLE1/data",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata",
      "bigdata-ml",
      "deep-learning",
      "machine-learning",
      "python",
      "tensorflow"
    ]
  },
  {
    "id": "c2hmJ4AyQgKRmxzazs_rpw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157270/senior-software-engineer-selerity?a=QK5Wb2eHtmM",
    "title": "Senior Software Engineer at Selerity (New York, NY) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>DevOps</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data, Digital Media, Machine Learning</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span><strong>Title:</strong> Senior Software Engineer</span></p><p><strong>Summary:</strong></p><p><span>Senior Software Engineer to join team scaling up Selerity’s A.I.-driven analytics and recommendation platform and integrate it into enterprise workflows. &nbsp;Highly competitive compensation plus significant opportunities for professional growth and career advancement.</span></p><p><span><strong>Employment Type:</strong> Contract or Full-Time</span></p><p><span><strong>Location is Flexible:</strong> New York City (main office), Chicago, or Remote</span></p><p><strong>Job Description:</strong></p><p><span>Want to change how the world engages with news and data?</span></p><p><span>Selerity has dominated ultra-low-latency data science in finance for several years. &nbsp;Now our real-time content analytics and contextual recommendation platform is gaining broader traction in enterprise and media applications. &nbsp;We're tackling big challenges in predictive analytics, conversational interfaces, and workflow automation and need your help!</span></p><p><span>We’re looking for an experienced developer to join a major initiative at a critical point in our company’s growth. &nbsp;The majority of the development will be in Java on Linux but knowledge of other languages, platforms and levels of the stack is very helpful.</span></p><p><strong>Must-haves:</strong></p><p><span> &nbsp;* Possess a rock-solid background in Computer Science (minimum BS in Comp Sci or related field) + at least 5 years (ideally 10+) of challenging work experience.</span></p><p><span> &nbsp;* Demonstrated expert-level proficiency building systems in Java in Linux environments. &nbsp;</span></p><p><span> &nbsp;* Direct experience in the design, implementation and maintenance of SaaS API's that are minimal, efficient, scalable and supportable throughout their lifecycle.</span></p><p><span> &nbsp;* Solid track record of making effective design decisions balancing near-term and long-term objectives.</span></p><p><span> &nbsp;* Know when to use commercial or open-source solutions, when to delegate to a teammate, and when to roll up your sleeves and code it yourself.</span></p><p><span> &nbsp;* Work effectively in agile teams with remote members; get stuff done with minimal guidance and zero BS, help others, and know when to ask for help.</span></p><p><span> &nbsp;* Clearly communicate complex technical and product issues to non-technical team members, managers, clients, etc. &nbsp;</span></p><p><strong>Nice-to-haves:</strong></p><p><span> &nbsp;* Full-stack development and operations experience with web apps on Node.js.</span></p><p><span> &nbsp;* Implementation of DevOps / SRE processes at scale including continuous integration, automated testing, and platform monitoring.</span></p><p><span> &nbsp;* Experience with analytics visualization libraries.</span></p><p><span> &nbsp;* Experience with large-scale analytics and machine learning technologies including TensorFlow/Sonnet, Torch, Caffe, Spark, Hadoop, cuDNN, etc.</span></p><p><span> &nbsp;* Conversant with relational, column, object, and graph database fundamentals + strong practical experience in at least two of those paradigms.</span></p><p><span> &nbsp;* Implementation of software defined networking or other non-traditional networking paradigms.</span></p><p><span> &nbsp;* Deep understanding of how to build software agents and conversational workflows.</span></p><p><span> &nbsp;* Experience with additional modern programming languages (Scala, Python, …)</span></p><p><span>Our stack combines leading commercial and open source technologies with &nbsp;numerous home-grown innovations, including:</span></p><p><span> * Java, C++, JavaScript/ECMAscript + Node, Angular, RequireJS, Electron, Scala, Python, etc.</span></p><p><span> * A variety of open source and in-house frameworks for natural language processing and machine learning including artificial neural networks / deep learning.</span></p><p><span> * Hybrid of AWS (EC2, S3, RDS, R53) + dedicated datacenter network, server and GPU/coprocessor infrastructure.</span></p><p><span> * Cassandra, Aurora plus in-house streaming analytics pipeline (similar to Apache Flink) and indexing/query engine (similar to ElasticSearch).</span></p><p><span> * In-house messaging frameworks for low-latency (sub-microsecond sensitivity) multicast and global-scale TCP (similarities to protobufs/FixFast/zeromq/itch).</span></p><p><span> * Ansible, Git, Subversion, PagerDuty, Icinga, Grafana, Observium, LDAP, Jenkins, Maven, Purify, VisualVM, Wireshark, Eclipse, Intellij </span></p><p><span>This position offers a great opportunity to work with advanced technologies, collaborate with a top-notch, global team and disrupt a highly visible, multi-billion-dollar market. &nbsp;</span></p><p><strong>Compensation:</strong></p><p><span>We understand how to attract and retain the best talent and offer a competitive mix of salary, benefits and equity. &nbsp;We also understand how important it is for you to feel challenged, to have opportunities to learn new things, to have the flexibility to balance your work and personal life and to know that your work has impact in the real world. &nbsp;We have team members on four continents and we're adept at making remote workers feel like part of the team. &nbsp;If you join our NYC main office be sure to bring your Nerf toys, your drones and your maker gear - we’re into that stuff, too.</span></p><p><strong>Interview Process:</strong></p><p><span>If you can see yourself at Selerity, send your resume and/or online profile (e.g. LinkedIn) to <a href='mailto:careers@selerityinc.com' rel='nofollow'>careers@selerityinc.com</a>. &nbsp;We’ll arrange a short introductory phone call and if it sounds like there’s a match we'll arrange for you to meet the team for a full interview. &nbsp;</span></p><p><span>The interview process lasts several hours and is sometimes split across two days. &nbsp;It is intended to be challenging - but the developers you meet and the topics you’ll be asked to explain (and code!) should give you a very clear sense of what it would be like to work at Selerity. &nbsp;</span></p><p><span>We value different perspectives and have built a team that reflects that diversity while maintaining the highest standards of excellence. &nbsp;You can rest assured that we welcome talented engineers regardless of their age, gender, sexual orientation, religion, ethnicity or national origin.</span></p><p><span><strong>Recruiters:</strong> <strong>Please note that we are not currently accepting referrals from recruiters for this position.</strong></span></p>                    </div>                            <h2>                About Selerity            </h2>            <div><p>Our mission is to deliver critical information when our users need it most. &nbsp;We launched our first ultra-low-latency financial data product in 2009 and continue to lead the market for real-time natural language processing and event data extraction. &nbsp;In recent years we have applied our technology more broadly to a wide spectrum of news, research, social media, and chat. &nbsp;From driving the world's most sophisticated automated trading algorithms to powering the most widely read financial news site, we continue to expand into new problem domains and new ways to integrate the most relevant, engaging information into our users' workflows.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Paid Vacations                            </div>                            <div>                                 Health Insurance                            </div>                            <div>                                 Commuter Benefits                            </div>                            <div>                                 Choice of Equipment                            </div>                            <div>                                 Nerf + Drones                            </div>                            <div>                                 Team meals and outings                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``OR(global, distributed) 2N team",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:angular/frontend/8",
      "DBG_TECH1:k/t/w:apache-flink/java/8",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:caffe/bigdata-ml/8",
      "DBG_TECH1:k/t/w:deep-learning/bigdata-ml/8",
      "DBG_TECH1:k/t/w:eclipse/java/1",
      "DBG_TECH1:k/t/w:electron/nodejs/8",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:intellij-idea/java/8",
      "DBG_TECH1:k/t/w:java/java/6",
      "DBG_TECH1:k/t/w:java/mobile/3",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/9",
      "DBG_TECH1:k/t/w:maven/java/13",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:k/t/w:scala/java/6",
      "DBG_TECH1:k/t/w:torch/bigdata-ml/8",
      "DBG_TECH1:k/t/w:visualvm/java/8",
      "DBG_TECH1:techWeightMap:{python=4, other=0, dotnet=0, c=8, mobile=3, go=0, nodejs=23, bigdata-ml=41, ruby=0, apple=0, java=50, gamedev=0, php=0, embedded=0, frontend=10}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/java",
      "TECH2/c++",
      "TECH2/devops",
      "TECH2/java",
      "TECH2/linux",
      "TECH2/machine-learning",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "c++",
      "devops",
      "java",
      "linux",
      "machine-learning"
    ]
  },
  {
    "id": "aS7tdijcRVS0uw6Br2xKSA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156878/backend-engineer-golang-elixir-heetch?a=QBWAtjecyWc",
    "title": "Backend Engineer (Golang / Elixir) at Heetch (Paris, France) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Carsharing, Marketplace, Transportation</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>***&nbsp;We offer flexible and full remote work over Europe.</strong></p><p><strong>We are not ready yet to work with people outside EU but will keep you posted on that ;) ***<br></strong></p><p>Hands in hands with the Product, Design, Infrastructure and Mobile team, the Backend team has its great deal of challenges to tackle: scaling our ever growing backend business, pushing data science logics in production, shipping game changer features for our passengers and drivers with the sole goal of creating the most respectful and playful experience for them, across many launched cities, and many to come.</p><p><br>We expect the marketplace we are building to scale so it can support our European expansion ambitions. Fortunately, we can rely on our solid micro-services architecture (Golang, Elixir, Docker…) and our talented team to make it better.</p><p>Welcome behind the scenes !</p><p></p><p><strong>OUR ENGINEERING VALUES</strong></p><ul><li><strong>Move smart</strong>: we are data driven, and employ tools and best practices to ship code quickly and safely (continuous integration, code review, automated testing, etc).</li><li><strong>Distribute knowledge</strong>: we want to scale our engineering team to a point where our contributions do not stop at the company code base. We believe in the Open Source culture and communication with the outside world.</li><li><strong>Leave code better than you found it</strong>: because we constantly raise the bar.</li><li><strong>Unity makes strength</strong>: moving people from A to B is not as easy as it sounds but, we always keep calm and support each other.</li><li><strong>Always improve</strong>: we value personal progress and want you to look back proudly on what you’ve done.</li></ul><p><strong>WHAT YOU’LL DO</strong></p><ul><li>Implement smart models to predict future supply and demand</li><li>Aggregate and play with data coming from various sources</li><li>Work on new features in microservices environment and contribute to the improvement and optimization of our architecture</li><li>Optimize our operational platform to make our support even more awesome.</li></ul><p>&nbsp;Things we’d like to experiment with:</p><ul><li>Event sourcing</li><li>Kafka…</li></ul><p>If your are more an infractructure person wanting to deliver happiness to our backend team by building tools and frameworks please check out our&nbsp;Infrastructure Engineer&nbsp;job offer.</p><p><strong>REQUIREMENTS</strong></p><ul><li>5+ years as a software engineer, mainly focused on backend.</li><li>You are a product oriented developer, you own, design and implement features from A to Z, you help monitor and maintain them after they are shipped with focus on the end.</li><li>You have analytical and diagnostic skills, a proactive problem solving mindset.</li><li>You’ve worked with Ruby-on-Rails or Go in production environments, experience in Elixir would be great…</li><li>… but more than mastering 1 single language, you’re curious and a fast learner, you showed your ability to switch to another technology just to get out of your comfort zone.</li><li>Experience working with high volumes, databases, relational (PostgreSQL) or NoSQL.</li><li>Exposure to architectural patterns of a large, high-scale web application and microservices.</li><li>Good testing skills.</li><li>Sharing is caring, you are generous in your communication and knowledge sharing with your team.</li></ul><p><strong>BONUS POINTS</strong></p><ul><li>Contributions to open source projects</li><li>Experience with message brokers (such as Kafka, RabbitMQ)</li><li>Exposure to real-time technology problems</li><li>Experience with ETL and Hadoop</li><li>Experience with Docker and/or Mesos Marathon (or similar)</li></ul><p><strong>PERKS</strong></p><ul><li>Permanent contract (CDI)&nbsp;</li><li>Stock</li><li>Paid conference attendance/travel and periodic team meetups</li><li>Heetch credits</li><li>A Spotify subscription</li><li>Work from anywhere you want</li></ul>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Full remote (in Europe only) and flexible ways of working                            </div>                            <div>                                 Paid conferences attendance/travel                            </div>                            <div>                                 Periodic team meetups                            </div>                            <div>                                 Stocks                            </div>                            <div>                                 Heetch credits                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(europ, european, europeanunion)",
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k/t/w:go/go/9",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:k/t/w:unity3d/gamedev/8",
      "DBG_TECH1:k/t/w:unity3d/mobile/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=5, go=9, nodejs=0, bigdata-ml=8, ruby=8, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/go",
      "TECH1/ruby",
      "TECH2/docker",
      "TECH2/elixir",
      "TECH2/go",
      "TECH2/postgresql",
      "TECH2/ruby-on-rails",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "docker",
      "elixir",
      "go",
      "postgresql",
      "ruby",
      "ruby-on-rails"
    ]
  },
  {
    "id": "s4zFcBBJQY6qkk2ZSrosSg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/148870/senior-php-nodejs-c-plus-plus-developer-full-time-cvedia-limited?a=NVr0uCDrGsU",
    "title": "Senior PHP/Node.js/C++ developer - Full Time - 100% Remote EU Time Zone at Cvedia Limited (Madrid, Spain) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Desktop Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Services</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>About the job</strong></p><p>This is a remote, full time, long term position. As a developer in our team you will take full responsibility of your modules in a process intensive system. You will take charge of the development process from gathering requirements and system design through to the UI mockups and front end development. We require a high level of understanding the business logic involved and a critical mind to design and implement it effectively.</p><p><strong>Experience with the following is desired</strong></p><ul><li>Fluent in English with excellent written and verbal communication skills.</li><li>Working remotely with a team in multiple timezones.</li><li>Ability to work independently - accountable for your own actions and able to act with both urgency and integrity.</li><li>The ability to understand what the users and the business need.</li></ul><ul><li>Must Have: System analysis, data modelling, business process diagrams, data flow diagrams, UML.</li><li>Full stack development experience designing and building high volume, scalable, modular applications from top to bottom</li><li>Extensive proficiency with at least two RDBMSes</li><li>Solid professional experience in OOP using php and preferably python too.</li><li>Version Control</li><li>Linux server administration</li></ul><p><br><br></p><p><strong>How should you apply for this job?</strong></p><p>Please provide your github repository</p><p>Only applicants from European time zone will be processed.</p><p>We will not reply to 3rd party software/employees agencies</p><p>Please state on the mail subject the job position and the state you reside.</p><p>Please understand that this job capacity is for a full position.</p><p><br><br></p><p><strong>Application process:</strong></p><p>Application usually will be screened the same day we receive it.</p><p>We will reply to you no later than two business days to set-up a short interview.</p><p>1-3 weeks after the interview you could be hired!</p><p><br><br></p><p><strong>What we offer:</strong></p><p>Job location is in Cyberspace.</p><p>Communication with the all team members is done through Skype</p><p>Employee will be receiving all of his social rights as stated in the law of his country.</p><p>Salary will be paid once a month with a wire transfer</p><p>Job capacity: Monday - Friday (8 hours daily) &nbsp;</p><p><br><br></p>                    </div>                            <h2>                About Cvedia Limited            </h2>            <div><p><strong>Cvedia is a free, cloud-based service simplifying image dataset preparation and processing.</strong></p><p>We give you direct access to standardized versions of public and private image datasets such as Open Images, COCO, ImageNet, and YouTube-8M. Using our open-source CLI tool, we directly export your filters and augmentations to your local server in the format of your favorite machine learning framework, including Torch, Caffe, TensorFlow, Theano, and Deeplearning4J. We support batch downloads and resumable states so you can start training right away.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote work                            </div>                            <div>                                 Challenging environment                            </div>                            <div>                                 Young start-up with endless possibilities                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``2W(100, remot)",
      "DBG:surround``OR(europ, european, europeanunion) 3W OR(timezon,time)",
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:caffe/bigdata-ml/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/3",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:php/php/10",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:theano/bigdata-ml/8",
      "DBG_TECH1:k/t/w:torch/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=8, mobile=0, go=0, nodejs=13, bigdata-ml=27, ruby=0, apple=0, java=0, gamedev=0, php=10, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH2/cvs",
      "TECH2/linux",
      "TECH2/php",
      "TECH2/python",
      "TECH2/uml",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "cvs",
      "linux",
      "php",
      "python",
      "uml"
    ]
  },
  {
    "id": "xpbUSHXYRxWTn8Yc4dKXQQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/131186/c-c-plus-plus-robot-brain-engineer-aeolus-robotics-inc?a=HZJwVRAzdx6",
    "title": "C/C++ Robot Brain Engineer at Aeolus Robotics, Inc (South San Francisco, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Embedded Developer</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Job Responsibilities</strong></p><p><span>Work with experts developing, iterating and testing robot algorithms, in one or more of these areas:</span></p><p><strong>- </strong><span>Robot motion planning and control</span></p><p><span>- Visual modeling and perception</span></p><p><span>- Language understanding</span></p><p><span>- Grasp planning</span></p><p><span>- Firmware programming for HW/SW systems</span></p><p><span>- Other amazing robotics-based challenges!</span></p><p><strong>About you</strong></p><p><span>You are looking for the place to stretch yourself, able to work within a senior, highly performant product team, and aren’t afraid of a challenge. &nbsp;You are a self-starter with the motivation and skills needed to effectively operate on your own time in your own way while being responsive to the needs of your teammates and the team as a whole.</span></p><p><span>You love working on the metal and/or deep in low-level or scaled algorithmic code. &nbsp;You are effective at quickly understanding and operating on algorithms taken from research in AI, Robotics, and Vision, or you have have experience with sensors, motors, and other devices. &nbsp;You are comfortable working alongside experts in these areas, or are an expert yourself. You have a proven track record of delivering ideas into working prototypes at high velocity. &nbsp;You have commercial/agile development teaming experience. &nbsp;You've architected some serious systems and may have even been a team lead. </span></p><p><strong>Flexible Hours &amp; 100% Remote Work</strong></p><p><span>These roles permit flexible working hours and are 100% remote. &nbsp;You will work in a scrum-based agile development cycle. Whether you prefer contract work or a permanent position, we can accommodate you. You will be working alongside founders, researchers, and engineers to design and build first-generation robotic solutions for mass consumer adoption.</span></p>                    </div>                            <h2>                About Aeolus Robotics, Inc            </h2>            <div><p><span>Aeolus Robotics was founded to bring the first generation of household robot assistants to life, and to market. Integrating Taiwanese manufacturing prowess and Silicon Valley AI genius, we are breaking ground in general-purpose consumer robotics with capability in unstructured “human” spaces. &nbsp;Our CTO, an expert in AI and machine learning, was a member of the DARPA team that conceived and managed the Watson AI project. Still operating largely in stealth mode, we’ve got additional key members and breakthrough technological approaches to ensure success in this challenging field.</span></p>            </div>        ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``2W(100, remot)",
      "DBG:surround``remot 3N OR(role, employment)",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/20",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:embedded/c/1",
      "DBG_TECH1:k/t/w:embedded/embedded/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/3",
      "DBG_TECH1:k/t/w:velocity/java/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=14, mobile=0, go=0, nodejs=0, bigdata-ml=23, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=8, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH2/c",
      "TECH2/c++",
      "TECH2/computer-vision",
      "TECH2/machine-learning",
      "TECH2/robotics",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "c",
      "c++",
      "computer-vision",
      "machine-learning",
      "robotics"
    ]
  },
  {
    "id": "XGFQpqySSu2pUtmt_ob4Aw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/126469/devops-engineer-remote-within-europe-hotjar?a=GpEzpkuJ4Os",
    "title": "DevOps Engineer (Remote within Europe) at Hotjar () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>DevOps</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Data &amp; Analytics, SaaS, Web Technology</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Note:&nbsp;</strong>Although this is a remote position, we are currently&nbsp;only&nbsp;seeking candidates in&nbsp;timezones between UTC-2 and UTC+4.</p><p>Hotjar is looking for a driven and ambitious&nbsp;<strong>DevOps Engineer&nbsp;</strong>based in a European timezone&nbsp;to support and expand our cloud-based infrastructure used by thousands of sites around the world. The Hotjar infrastructure currently processes more than<strong>&nbsp;16,500</strong>&nbsp;API requests per second, delivers over&nbsp;<strong>a billion</strong>&nbsp;pieces of static content every week and hosts databases well into<strong>&nbsp;terabyte-size</strong>&nbsp;ranges, making this an interesting and challenging opportunity.<br><br>This is an excellent career opportunity to join a fast growing remote startup in a key position.&nbsp;<br><br><strong>In this position, you will:</strong></p><ul><li>Be part of the team setting up and maintaining the infrastructure that powers our sites and web applications.</li><li>Choose, deploy and manage tools and technologies to build and support a robust infrastructure.</li><li>Be responsible for identifying bottlenecks and improving performance of all our systems.</li><li>Ensure all necessary monitoring, alerting and backup solutions are in place.</li><li>Do research and keep up to date on trends in big data processing and large scale analytics.</li><li>Implement proof of concept solutions in the form of prototype applications.</li></ul><p><strong>Compensation Range</strong></p><p>The budgeted compensation range for this role is €50,000 to €70,000 annually. Ranges are based on market research and are equitable to other roles within Hotjar. The actual compensation offered to a successful candidate will be based on relative experience and skills. At this time we are only able to provide official employment status to those located in Malta. All other candidates will join our team as full-time consultants and will be responsible for paying any taxes or applicable fees where they reside.&nbsp;</p><p><strong>Requirements</strong></p><ul><li>Strong working knowledge of Amazon AWS.</li><li>2 or more years of professional experience with systems administration or DevOps.</li><li>Experience with Python, Nginx and PostgreSQL.</li><li>Not required but experience in any of the following is considered to be an asset: Kubernetes, Kafka, Hadoop,&nbsp;Elasticsearch, Redis, Memcached, Jenkins, Mercurial, Vagrant, Docker.</li><li>Must submit to a background check confidentially processed by our third party.</li></ul>                    </div>                            <h2>                About Hotjar            </h2>            <div><p>Hotjar is a rapidly growing startup that is giving thousands of website owners the tools needed to discover how their visitors are really using their website. We are looking for passionate and ambitious developers who can help us shape the product and company while growing with us.</p><p><strong>Culture at Hotjar:</strong></p><p>Headquartered on the beautiful island of Malta, in the “heart” of the Mediterranean, Hotjar is a young startup that embraces remote working and personal development.</p><p>Hotjar’s culture is driven by transparency, respect, open discussion, collaboration and blunt and direct feedback. In fact, we’re obsessed with communicating with our users as well as within the team. We hate bureaucracy and slow moving organizations –&nbsp;but we’re suckers for well-defined processes. We love lean, iterative improvements and success is measured by the value we create for our users.</p><p><strong>The Perks:</strong></p><ul><li><strong>Remote &amp; Flexible.</strong>&nbsp;Work from anywhere within a European timezone.&nbsp;</li><li><strong>Ample Time Off.&nbsp;</strong>All team members get 40 days of paid planned leave/year, plus 10 sick days/year and time off to attend conferences / events.</li><li><strong>Collaborate with prestigious organizations.</strong>&nbsp;Imagine what it will feels like to be part of a product that is used by companies like Time Inc., Nintendo, Lloyd's Bank, Pingdom, Booking.com, Intuit and the Red Cross.</li><li><strong>Only the best hardware and software</strong>. Mac, PC or Linux –&nbsp;we will get you equipped with the best hardware and software available, of your own choice.</li><li><strong>Home Office budget.</strong>&nbsp;Every Hotjar team member receives a €4000 home office setup budget, with a yearly €500 top-up thereafter. Upgrade your desk, chair, screens or buy any peripherals you might need.</li><li><strong>Kindle + Personal Development budget.</strong>&nbsp;Everyone receives a free Kindle as well as direct management of their own personal development yearly budget of €500. Buy books, short courses or magazine subscriptions.</li><li><strong>Holiday budget.</strong>&nbsp;A spend of €2,000/year for each team mate to spend relaxing and recharging on holiday.</li><li><strong>Working Space Allowance.</strong>&nbsp;Decide how you want to spend your monthly €200, whether it's on a co-working space, working from a coffee shop, getting your favourite coffee delivered to your home office, etc.</li><li><strong>Work with a very talented team.</strong>&nbsp;Our team has an impressive background building and optimizing products and businesses around the globe.</li><li><strong>Make a difference.</strong>&nbsp;Hotjar is ‘democratizing’ site analytics and feedback by making them affordable and easy to use for everyone around the world. We call it the ‘Hotjar revolution’.</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 €4,000 Home Office Budget                            </div>                            <div>                                 Free Fitbit                            </div>                            <div>                                 100% Remote                            </div>                            <div>                                 Free Kindle Paperwhite                            </div>                            <div>                                 €500 Annual Personal Dev Budget                            </div>                            <div>                                 Attend Conferences Around the Globe                            </div>                            <div>                                 40 days leave annually                            </div>                            <div>                                 Two company retreats each year                            </div>                            <div>                                 €2,000 Annual Holiday Budget                            </div>                            <div>                                 €200 Monthly Working Space Allowance                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG:surround``2W(100, remot)",
      "DBG:surround``OR(europ, european, europeanunion) 3W OR(timezon,time)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/2",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/2",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:macos/apple/2",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=2, bigdata-ml=8, ruby=0, apple=2, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH2/amazon-web-services",
      "TECH2/devops",
      "TECH2/nginx",
      "TECH2/postgresql",
      "TECH2/python",
      "TITLE1/admin",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "bigdata-ml",
      "devops",
      "nginx",
      "postgresql",
      "python"
    ]
  },
  {
    "id": "-qE6gWJwSWKuTY4Pu68nvQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/133487/salesforce-developer-remote-us-only-innovate?a=ILzSQsbuYo0",
    "title": "Salesforce Developer - Remote (US only) at Innovate! (Alexandria, VA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Services, Consulting, Geographic Information System</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>As a member of the Cloud Advisory Services team, the Salesforce Developer will be expected to create unique customer-based solutions.&nbsp;The developer will interact with clients, prospective clients, project managers and team members, architects and other developers to ensure customer success.&nbsp;<br><br>They will customize, develop and support solutions (including on the force.com platform) in a fast-paced and constantly evolving environment from start to finish of multiple projects across independent platforms concurrently. They will work in partnership with project managers to gather technical requirements, research and become the subject matter expert as needed, and estimate work effort; provide production support of applications by trouble shooting issues and proposing solutions; then develop, test fixes, and migrate solution; provide ongoing support; and accurately report issues and status to project and division management.&nbsp;</p>                    </div>                            <h2>                About Innovate!            </h2>            <div><p>Innovate!, Inc. (Innovate) is an 8(a) woman and minority-owned company passionate about the dynamic benefits of providing effective management consulting, IT support, and geospatial technology for the federal government. We believe that thinking innovatively can achieve positive results in organizations that lead to cultural and business change. This beliefs and our ability to deliver cutting edge solutions were recognized with Innovate being named 2012 Environmental Protection Agency (EPA) Outstanding 8(a) Small Business of the Year.<br>&nbsp;<br>Innovate!, Inc. also offers a comprehensive and affordable benefit program to all eligible employees.<br><br><em>Innovate!, Inc. is an equal opportunity employer and will not discriminate against any employee or applicant on the basis of age, color, disability, gender, national origin, race, religion, sexual orientation, veteran status, or any classification protected by federal, state, or local law.</em>&nbsp;<br>&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Opportunities to work remotely                            </div>                            <div>                                 401(k) / Roth –The 401(k) and Roth plans offer a variety of investment                            </div>                            <div>                                 Holidays – Innovate! observes ten (10) paid holidays per year                            </div>                            <div>                                 Employee Referral Bonus - because we know you know the best people                            </div>                            <div>                                 Comprehensive health care plan                            </div>                            <div>                                 Flexible work schedules                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k/t/w:classification/bigdata-ml/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=1, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH2/ajax",
      "TECH2/apex",
      "TECH2/java",
      "TECH2/javascript",
      "TECH2/salesforce",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "ajax",
      "apex",
      "bigdata-ml",
      "java",
      "javascript",
      "salesforce"
    ]
  },
  {
    "id": "6l8Y0Ci3TLSZQxn_NLf8Rg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/141116/interview-engineer-karat?a=LkcSbeLCa0o",
    "title": "Interview Engineer at Karat () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>About Karat</strong></p><p>Karat has reengineered technical hiring to ensure that great talent gets noticed by great companies. &nbsp;&nbsp;We augment engineering organizations by conducting the first-rounds of technical interviews on their behalf. Our service saves material engineering time and drives a highly responsive and consistent experience for candidates. &nbsp;Karat continuously invests in cutting edge interview methodologies with an aim of reducing bias and letting candidates demonstrate their true ability. We operate as strategic partners for engineering leaders at the world's leading technology companies including Jet, MuleSoft, Roblox, Intuit, Ten-X, Minted and many more. &nbsp;&nbsp;As the gold standard of technical interviewing, our well-funded company is scaling quickly to meet our growing list of client's needs. &nbsp;Come join us!</p><p><strong>About The Job</strong></p><p>Our dedicated Interview Engineers are deeply passionate about the art and science of interviewing. &nbsp;&nbsp;As an Interview Engineer, you will conduct the first-rounds of technical interviews on behalf of Karat's clients. Karat interviews take place live over video, allowing our Interview Engineers to interact with candidates from all over the world without leaving their home. &nbsp;You will play an important role in the hiring process and will uphold the highest standards of candidate experience, fairness and trust. &nbsp;We are very selective in hiring Interview Engineers onto the Karat platform. &nbsp;&nbsp;Once you join our community, we will be focused on your success as a highly-regarded technical interviewer.</p><p><strong>About You:</strong></p><ul><li>You're passionate about improving the technical interview process.</li><li>You care about helping others improve themselves through a great interview experience.</li><li>You lead with empathy and are driven to provide consistent and thoughtful feedback to candidates.</li><li>Your written and verbal communication skills are superb.</li><li>You've accumulated significant experience evaluating fundamental computer science skills (i.e. data structures, algorithms etc.), software craftsmanship (i.e. understanding of unit testing, source control, APIs etc.), and/or specific technologies (i.e. iOS, distributed systems etc.).</li><li>You are interested in working 40 hours per week or more.</li></ul>                    </div>                            <h2>                About Karat            </h2>            <div><p><strong>Interviewing is broken. &nbsp;Karat professionalizes interviewing.</strong></p><ul><li>Karat is on a mission to assess the world's talent. &nbsp;We are the first dedicated marketplace for technical interviewers. Karat's network of seasoned engineers conduct the first rounds of technical interviews for elite engineering companies. Our robust platform saves teams thousands of valuable hours while allowing them to focus on the top performing candidates. &nbsp;Karat's unique approach recognizes that people are central to the hiring process and that they can be supercharged by leveraging machine learning and our rich database of the world's interviews.</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Hours - You own your schedule                            </div>                            <div>                                 Work from anywhere                            </div>                            <div>                                 Transparent compensation                            </div>                            <div>                                 Bonus programs                            </div>                            <div>                                 Regular company outings                            </div>                            <div>                                 Access to a world-class community of expert interviewers                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=2, go=0, nodejs=0, bigdata-ml=3, ruby=0, apple=2, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/bigdata-ml",
      "TECH1/mobile",
      "TECH2/algorithm",
      "TECH2/data-structures",
      "TECH2/java",
      "TECH2/python",
      "TECH2/technical-interviewing",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "algorithm",
      "apple",
      "bigdata-ml",
      "data-structures",
      "java",
      "mobile",
      "python",
      "technical-interviewing"
    ]
  },
  {
    "id": "L7DgqM33S1qD5sxAdwm6Ng",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/154079/senior-machine-learning-software-engineer-stardog-union?a=PFKevmz9NT2",
    "title": "Senior Machine Learning Software Engineer at Stardog Union (Arlington, VA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Databases, Enterprise Software, Information Technology</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Stardog is the world's leading Knowledge Graph platform for the Enterprise. Turn data into knowledge faster and easier. Stardog lets you query, search, and analyze enterprise data, wherever it is, using scalable, cutting-edge Knowledge Graph technology.<br><br>We've been actively working on adding machine learning capabilities to Stardog, and are looking for someone to help us take it to the next level.</p><p><br>If you're interested in natural language processing, deep learning, probabilistic graphical models, and recommender systems, this might be the job you've been dreaming about!<br><br>Responsibilities</p><ul><li>Research and develop algorithms to analyze large scale (un)structured data</li><li>Design and develop high-performance, data-driven components for our distributed database</li><li>Implement complex data ingestion pipelines</li><li>Deploy and operationalize machine learning models</li></ul><p><br>Requirements:</p><ul><li>5+ years programming experience, ideally in Java</li><li>Strong computer science fundamentals, with advanced knowledge of data structures, algorithms, and software design</li><li>Experience on applying machine learning and natural language processing techniques to real world datasets</li><li>Interest in recent scientific developments, with an eye for practical applications</li><li>Knowledge of Vowpal Wabbit, Theano/Keras, GATE/UIMA, Lucene/ElasticSearch, and similar frameworks</li></ul>                    </div>                            <h2>                About Stardog Union            </h2>            <div><p>Our culture is based on engineering excellence, mutual respect, collegiality in all things, rigor in design, research, implementation, and testing. We care deeply about work-life balance and productivity in the short and long run. In sum, if you remove the unnecessary, the distracting, and the tedious, what you're left with is a healthy 40 hour week full of wins</p><p><em>We are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</em></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Health care including dental &amp; vision, some plans fully company paid                            </div>                            <div>                                 401k                            </div>                            <div>                                 3 weeks vacation                            </div>                            <div>                                 Remote work available for qualified candidates                            </div>                            <div>                                 Top of the line hardware                            </div>                            <div>                                 Flexible work schedule                            </div>                            <div>                                 Company paid life and disability benefits                            </div>                            <div>                                 Well stocked kitchen, snacks, lunch, and most importantly, coffee                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:k/t/w:deep-learning/bigdata-ml/8",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:keras/bigdata-ml/8",
      "DBG_TECH1:k/t/w:lucene/java/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/12",
      "DBG_TECH1:k/t/w:theano/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=1, bigdata-ml=36, ruby=0, apple=0, java=10, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH2/deep-learning",
      "TECH2/java",
      "TECH2/machine-learning",
      "TECH2/nlp",
      "TITLE1/data",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "deep-learning",
      "java",
      "machine-learning",
      "nlp"
    ]
  },
  {
    "id": "Z8PCZ_4QTwKWOhlxIN5pxA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/120767/senior-web-ux-ui-designer-and-developer-apex-expert-solutions?a=Ev5MYRbLO6I",
    "title": "Senior Web UX/UI Designer and Developer at APEX Expert Solutions (Arlington, VA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Designer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data, Government, Military</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Duties and Responsibilities</strong>:</p><ul><li>Work in an fast-paced agile development environment designing and developing responsive front end&nbsp;websites that are able to display and manage large disparate datasets</li><li>Full scope web application development ranging from user experience research and design to front-end&nbsp;design and development</li><li>Provide technology recommendations for potential product application development</li><li>Gather and analyze requirements from product owners ensuring products meet business requirements</li><li>Collaborate with other software engineers and team leads in designing and developing software solutions&nbsp;that meet high quality standards</li><li>Quickly prototype and develop webpages and components specializing in visualizing large geospatial&nbsp;datasets using Cesium, Leaflet, D3.js, and OpenLayers 3.</li><li>Using Adobe Photoshop or Illustrator, create website mockups portraying design concepts</li><li>Assist with the design and implementation of REST API applications that provide web application&nbsp;connectivity to backend NoSQL datastores</li></ul><p><strong>Skills &amp; Requirements</strong></p><ul><li>5 years of building front-end websites connected to REST API</li><li>3 years of building and utilizing geospatial UI libraries including Cesium, Leaflet, D3.js, and OpenLayers 3</li><li>3 years of user experience design and website implementation with portfolio of past work available for&nbsp;review</li><li>Demonstrated effective and successful verbal and written communication skills</li><li>U.S. citizen</li></ul><p><strong>Desired Qualifications</strong></p><ul><li>Full life cycle software application development experience</li><li>Experience with distributed computing platforms including Hadoop and Cloudera</li><li>Demonstrated ability to quickly learn and apply new technologies</li><li>Experience developing REST web services</li></ul>                    </div>                            <h2>                About APEX Expert Solutions            </h2>            <div><p>APEX Expert Solutions delivers analytic services, technologies, and training curriculum in support of Department of Defense customers. APEX tightly couples analysts, engineers, and trainers to bring mission success.</p><p>APEX Benefits include 401k with employer matching, 15-days Paid Time Off annually plus 10 Federal Holidays, Tuition Reimbursement, Healthcare, Dental, and Vision.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Vacations and holidays off                            </div>                            <div>                                 Cutting edge technology                            </div>                            <div>                                 Fantastic medical, dental and vision insurance                            </div>                            <div>                                 Work from home options                            </div>                            <div>                                 Social activities and events                            </div>                            <div>                                 Competitive salary and bonuses                            </div>                            <div>                                 Business casual attire                            </div>                            <div>                                 Collaborative environment                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH2/cesium",
      "TECH2/css",
      "TECH2/geospatial",
      "TECH2/javascript",
      "TECH2/rest",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "cesium",
      "css",
      "geospatial",
      "javascript",
      "rest"
    ]
  },
  {
    "id": "pXpMXyFSRai9WBAena7IBA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3958-machine-learning-software-engineer-stardog",
    "title": "Machine Learning Software Engineer @ Stardog",
    "content": "<h2>              Machine Learning Software Engineer<small> @ Stardog</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-11-03 02:13</p></dd>          <dt><span>Description</span></dt>          <dd><p>Stardog is the world's leading Knowledge Graph platform for the Enterprise. Turn data into knowledge faster and easier. Stardog lets you query, search, and analyze enterprise data, wherever it is, using scalable, cutting-edge Knowledge Graph technology.</p><p>We've been actively working on adding machine learning capabilities to Stardog, and are looking for someone to help us take it to the next level.If you're interested in natural language processing, deep learning, probabilistic graphical models, and recommender systems, this might be the job you've been dreaming about!</p><p><strong>Responsibilities</strong></p><ul><li>Research and develop algorithms to analyze large scale (un)structured data</li><li>Design and develop high-performance, data-driven components for our distributed database</li><li>Implement complex data ingestion pipelines</li><li>Deploy and operationalize machine learning models</li></ul><p><strong>Requirements:</strong></p><ul><li>5+ years programming experience, ideally in Java</li><li>Strong computer science fundamentals, with advanced knowledge of data structures, algorithms, and software design</li><li>Experience on applying machine learning and natural language processing techniques to real world datasets</li><li>Interest in recent scientific developments, with an eye for practical applications</li><li>Knowledge of Vowpal Wabbit, Theano/Keras, GATE/UIMA, Lucene/ElasticSearch, and similar frameworks</li><li>Ability to work in a distributed team mainly communicating over email, chat, and phone</li><li>Experience with graph technologies or databases is a plus</li></ul><p>We have offices in Arlington, VA and Boston, MA. Remote working is also possible for qualified candidates.</p><p>Our culture is based on engineering excellence, mutual respect, collegiality in all things, rigor in design, research, implementation, and testing. We care deeply about work-life balance and productivity in the short and long run. In sum, if you remove the unnecessary, the distracting, and the tedious, what you're left with is a healthy 40 hour week full of wins.</p><p><em>We are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Nov 3, 2017 4:13:35 AM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG_TECH1:k/t/w:deep-learning/bigdata-ml/8",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:keras/bigdata-ml/8",
      "DBG_TECH1:k/t/w:lucene/java/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/15",
      "DBG_TECH1:k/t/w:theano/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=39, ruby=0, apple=0, java=10, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/data",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "FwFREIIIQqO7ehJ2mI-g7Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62441",
    "title": "Machine Learning Software Engineer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Stardog is the world's leading Knowledge Graph platform for the Enterprise. Turn data into knowledge faster and easier. Stardog lets you query, search, and analyze enterprise data, wherever it is, using scalable, cutting-edge Knowledge Graph technology.<br><br>We've been actively working on adding machine learning capabilities to Stardog, and are looking for someone to help us take it to the next level.<br>If you're interested in natural language processing, deep learning, probabilistic graphical models, and recommender systems, this might be the job you've been dreaming about!<br><br><strong>Responsibilities</strong><br><br></p><ul><li>Research and develop algorithms to analyze large scale (un)structured data<br></li><li>Design and develop high-performance, data-driven components for our distributed database<br></li><li>Implement complex data ingestion pipelines<br></li><li>Deploy and operationalize machine learning models<br><br><strong>Requirements:</strong><br><br></li><li>5+ years programming experience, ideally in Java<br></li><li>Strong computer science fundamentals, with advanced knowledge of data structures, algorithms, and software design<br></li><li>Experience on applying machine learning and natural language processing techniques to real world datasets<br></li><li>Interest in recent scientific developments, with an eye for practical applications<br></li><li>Knowledge of Vowpal Wabbit, Theano/Keras, GATE/UIMA, Lucene/ElasticSearch, and similar frameworks<br></li><li>Ability to work in a distributed team mainly communicating over email, chat, and phone<br></li><li>Experience with graph technologies or databases is a plus<br><br>We have offices in Arlington, VA and Boston, MA. Remote working is also possible for qualified candidates.<br><br>Our culture is based on engineering excellence, mutual respect, collegiality in all things, rigor in design, research, implementation, and testing. We care deeply about work-life balance and productivity in the short and long run. In sum, if you remove the unnecessary, the distracting, and the tedious, what you're left with is a healthy 40 hour week full of wins.<br><br><em>We are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 3, 2017 4:13:35 AM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG_TECH1:k/t/w:deep-learning/bigdata-ml/8",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:keras/bigdata-ml/8",
      "DBG_TECH1:k/t/w:lucene/java/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/12",
      "DBG_TECH1:k/t/w:theano/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=36, ruby=0, apple=0, java=10, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/data",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "4UPf2HeTT0OiYYM7dre7fg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15607088",
    "title": "Caura & Co. | Seattle, WA | ONSITE/REMOTE | Full-time | AI Engineer | $180K-220K + substantial equity",
    "content": "<div>                  <span>Caura &amp; Co. | Seattle, WA | ONSITE/REMOTE | Full-time | AI Engineer | $180K-220K + substantial equity<p>Looking for an expert in natural language. We are re-inventing how technology companies contract with seasoned Data Professionals.</p><p>To apply, please contact me through my blog.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 4:00:05 AM",
    "tags": [
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/10",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=10, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "t6frIVGPRmGYsSP95rRw7A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Redshift+Database+Administrator&c=Bigdata+Dimension&l=Remote&jk=f012fa3573bd1ebb&rtk=1bu3ept3l0k3a50o&from=rss",
    "title": "Redshift DBA Remote - Bigdata Dimension Inc - Remote",
    "content": "<div><b>Redshift DBA Remote</b><br><span>Bigdata Dimension Inc</span> -<span>Remote</span></div><span><p><b>Role: </b> <b>AWS Redshift DBA/Architect</b></p><p><b>US Bachelors is must</b></p><p><b>Position Description ( 7-10 years of experience)</b> The AWS Redshift DBA/Architect will be responsible for analyzing requirements, prototyping data analysis solutions (primarily in Redshift) , collecting, preparing data for modeling on AWS, create new clusters, proficient in Redshift, specifically database &amp; platform tuning and optimization. Extensive knowledge in configuring Redshift Query Queue’s and ability to capture &amp; interpret database resource utilization both at the database and platform levels. Have expereince or exposure with administration of VM System for Marketing Analytics.</p><p>Candidates need to have strong capabilities in large data warehouses using relational and/or Hadoop based systems., UNIX scripting</p><p><b>Required Skills: </b></p><ul><li>Must have extensive experience with data implementations, data storage and distribution</li><li>Data modeling logical and physical</li><li>Proficient in Redshift, specifically database &amp; platform tuning and optimization. Extensive knowledge in configuring Redshift Query Queue’s and ability to capture &amp; interpret database resource utilization both at the database and platform levels.</li><li>Optimization and tuning of data structures and queries on Big Data platforms on AWS</li><li>Data Analysis and data profiling</li><li>Unix / Shell scripting</li><li>Oracle database SQL skills</li><li>Programming experience Java or Scala</li><li>Excellent Problem Solving and Debugging skills</li><li>Strong agile development experience</li><li>Test and maintain applications and test frameworks</li></ul><p><b>Preferred Skills: </b></p><ul><li>Understanding of statistics and machine learning</li><li>Understanding of predictive models</li><li>Experience interfacing with big data analytics applications like Tableau or analytic stacks like Shark/Spark, or Impala</li></ul><p><b>Education: </b> - Bachelor’s degree in computer science , statistics or related field- Good Communication Skills</p><p>Job Type: Full-time</p><p>Required education:</p><ul><li>Bachelor's</li></ul><p>Required experience:</p><ul><li>US Bachelors: 1 year</li><li>AWS Cluster Development: 1 year</li><li>Database Tuning: 1 year</li><li>Redshift DBA: 1 year</li></ul><p>Required language:</p><ul><li>English</li></ul></span>",
    "urlFetchPending": false,
    "published": "Nov 1, 2017 6:31:21 PM",
    "tags": [
      "DBG:surround``remot 3N OR(role, employment)",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/3",
      "DBG_TECH1:k/t/w:scala/java/3",
      "DBG_TECH1:k/t/w:shell/other/2",
      "DBG_TECH1:techWeightMap:{python=0, other=2, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=11, ruby=0, apple=0, java=5, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "YioloeB4RwGK967xfZ_9oQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-sysadmin",
    "url": "https://weworkremotely.com/jobs/5631-devops-engineer-europe",
    "title": "Hotjar: DevOps Engineer (Europe)",
    "content": "<div>  <div>    <h2>DevOps Engineer (Europe)</h2>      <h4>Posted Oct 30</h4>    <h3>      <span>Hotjar</span><br>      <span>Headquarters: Malta</span><br>        <a href='https://careers.hotjar.com/o/devops-engineer-europe/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/devops-engineer-europe/?source=WeWorkRemotely</a>    </h3>  </div>    </div>  <div>    <div><strong>Note:</strong>&nbsp;Although this is a remote position, we are currently&nbsp;only&nbsp;seeking candidates in&nbsp;timezones between UTC-2 and UTC+4.</div><div><br></div><div>Hotjar is looking for a driven and ambitious&nbsp;<strong>DevOps Engineer&nbsp;</strong>based in a European timezone&nbsp;to support and expand our cloud-based infrastructure used by thousands of sites around the world. The Hotjar infrastructure currently processes more than<strong>&nbsp;16,500</strong>&nbsp;API requests per second, delivers over&nbsp;<strong>a billion</strong>&nbsp;pieces of static content every week and hosts databases well into<strong>&nbsp;terabyte-size</strong>ranges, making this an interesting and challenging opportunity.</div><div><br></div><div>This is an excellent career opportunity to join a fast growing remote startup in a key position.&nbsp;</div><div></div><div></div><div><br></div><div><strong>In this position, you will:</strong></div><div><br></div><ul><li>Be part of the team setting up and maintaining the infrastructure that powers our sites and web applications.</li><li>Choose, deploy and manage tools and technologies to build and support a robust infrastructure.</li><li>Be responsible for identifying bottlenecks and improving performance of all our systems.</li><li>Ensure all necessary monitoring, alerting and backup solutions are in place.</li><li>Do research and keep up to date on trends in big data processing and large scale analytics.</li><li>Implement proof of concept solutions in the form of prototype applications.</li></ul><div>&nbsp;</div><div><br></div><div><strong>Compensation Range</strong></div><div><br></div><div>The budgeted compensation range for this role is €50,000 to €70,000 annually. Ranges are based on market research and are equitable to other roles within Hotjar. The actual compensation offered to a successful candidate will be based on relative experience and skills. At this time we are only able to provide official employment status to those located in Malta. All other candidates will join our team as full-time consultants and will be responsible for paying any taxes or applicable fees where they reside.&nbsp;</div><div><br></div><div><h4><b>Requirements</b></h4></div><ul><li>Strong working knowledge of Amazon AWS.</li><li>2 or more years of professional experience with systems administration or DevOps.</li><li>Experience with Python, Nginx and PostgreSQL.</li><li>Not required but experience in any of the following is considered to be an asset: Kubernetes, Kafka, Hadoop,&nbsp;Elasticsearch, Redis, Memcached, Jenkins, Mercurial, Vagrant, Docker.</li><li>Must submit to a background check confidentially processed by our third party.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply via <a href='https://careers.hotjar.com/o/devops-engineer-europe/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/devops-engineer-europe/?source=WeWorkRemotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 30, 2017 1:57:26 PM",
    "tags": [
      "DBG:surround``OR(europ, european, europeanunion) 3W OR(timezon,time)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/admin",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "IcCtuj5OQfiLaTdsE00GzA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/62896/data-scientist-machine-learning-architect-at-spotqa/",
    "title": "Data Scientist/ Machine Learning Architect",
    "content": "About you<br /><br />If you care about software quality but find testing and QA boring, as someone with machine learning expertise, you may have always thought &quot;there must be a better way&quot;!<br />Do you love building new stuff, learning and working with emerging technologies, alongside a team of skilled engineers with the same passion as yours? Driven to build a unique and groundbreaking product? Want to work on something that has not been done before?<br />If so, we would like to hear from you.<br /><br /><br />About us<br /><br />We are SpotQA's Product Team, building the next generation of testing automation software.<br />We are building the self-driving car technology for the testing world.<br />Our objective? To develop new technology using machine-learning and domain expertise with the aim of performing testing fully autonomously<br />To help with our mission, we are looking for a Senior Data Scientist with machine learning expertise to join our team<br /><br /><br />REQUIREMENTS<br /><br />Since we're building emerging technology, we're looking for solid engineering skills and experience, with solid knowledge of the theoretical fundamentals. Most importantly, we are looking for can-do attitudes, a passion to learn/grow independently and willingness to delve into problems.<br /><br />We have our eyes on a few skills, namely:<br /><br />Strong practical experience and theoretical background in machine learning.<br />Strong programming skills in at least one major programming language (e.g., Java, C++, Python)<br />A postgraduate degree (preferably PhD) in a relevant machine learning topic is desirable.<br />Ability to apply cross-domain knowledge to solve new machine-learning problems, and able to create/apply a multitude of ML solutions to solve a problem from different angles.<br />Can demonstrate expertise in neural networks/deep-learning techniques, RNNs, CNNs, LSTMs.<br />Polyglot: can program effectively in a wide range of programming languages and frameworks.<br /><br /><br />BENEFITS<br /><br />Competitive Salary.<br />Possibility of working remotely is available.<br />Personal development by working with a fast growing multinational startup aiming to shape the future of Digital QA.",
    "urlFetchPending": false,
    "published": "Oct 27, 2017 8:06:31 AM",
    "tags": [
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/5",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:deep-learning/bigdata-ml/8",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/21",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=8, mobile=1, go=0, nodejs=0, bigdata-ml=34, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/data",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "4NyXQ4SAQKSOki7VhM566g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/62825/business-development-associate-at-causalens/",
    "title": "Business Development Associate",
    "content": "Business Development Associate - Full Time (Remote)<br /><br />Summary<br /><br />We are looking for a motivated and high-achieving individual based in Europe to join the team working on expansion of the company in global markets. This is a full time placement with significant opportunities for growth, travel and advancement as one of the first employees of the company.<br /><br />The Company<br /><br />causaLens is high-tech startup based in London. We are bringing machine learning and big data technologies to the World’s leading asset managers. We are an extraordinary team and the founders have worked for some of the most prominent global hedge funds and scientific institutions. <br /><br />Core requirements<br /><br />* Highly capable, self-motivated, collaborative and personable <br />* Strong academic record <br />* Strong commercial skills gained from a professional background <br />* Interest in advanced technologies such as machine learning <br />* Able to demonstrate integrity, drive and natural curiosity<br />* An excellent written and verbal communicator with a high level of business acumen<br />* Ability to effectively work remotely (from home or coworking space) <br /><br />Roles and Responsibilities:<br /><br />* The role is varied and involves a combination of strategic & critical thinking, analysis and engagement with internal and external stakeholders. <br />* You will identify new opportunities and manage the full sales cycle from finding new prospects through to closure.<br />* You will be developing and maintaining value-based relationships with our customers.<br />* You will work directly with the CEO on developing and evaluating new opportunities. <br /><br />Benefits<br /><br />Successful candidate will have the opportunity to join a fast-growing, agile, and international team passionate about innovation and making a difference.  We will offer guidance, mentorship, and opportunities for professional development. <br />",
    "urlFetchPending": false,
    "published": "Oct 25, 2017 7:20:35 AM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=6, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "j_Ge4DTWRoqiV7jE9JCSQQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/62824/junior-python-developer-at-causalens/",
    "title": "Junior Python Developer",
    "content": "Junior Python Developer - Full Time (Remote)<br /><br />Summary<br /><br />We are looking for a motivated and high-achieving Junior Python Developer based anywhere in Europe to join the team working on an exciting new Big Data/Machine Learning platform. This is a full time placement with significant opportunities for growth and advancement as one of the first employees of the company.<br /><br />The Company<br /><br />causaLens is high-tech startup based in London. We are bringing machine learning and big data technologies to the World’s leading asset managers. We are an extraordinary team and the founders have worked for some of the most prominent global hedge funds and scientific institutions. <br /><br />Core requirements:<br /><br />* Smart, capable and can write clean code.<br />* Development experience in at least one scripting language - preferably Python.<br />* Interest in machine learning/big data.<br />* Knowledge of the Git version control system.<br />* Good organisational skills both in management of time and code.<br />* Ability to effectively work remotely (from home or coworking space).<br /><br />Roles and Responsibilities:<br /><br />Developing a big data platform for quantitative finance. The application stack is Python, Numpy, Scipy, Sklearn, Keras, Django, Celery, Postgres, AWS, GCP.<br /><br />Benefits:<br /><br />Successful candidate will have the opportunity to join a fast-growing, agile, and international team passionate about innovation and making a difference.  We will offer guidance, mentorship, and opportunities for professional development.",
    "urlFetchPending": false,
    "published": "Oct 25, 2017 7:16:19 AM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:django/python/8",
      "DBG_TECH1:k/t/w:keras/bigdata-ml/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/9",
      "DBG_TECH1:k/t/w:numpy/python/5",
      "DBG_TECH1:k/t/w:python/python/10",
      "DBG_TECH1:k/t/w:scikit-learn/bigdata-ml/8",
      "DBG_TECH1:k/t/w:scikit-learn/python/5",
      "DBG_TECH1:k/t/w:scipy/python/5",
      "DBG_TECH1:techWeightMap:{python=33, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=25, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "python"
    ]
  }
]
}
