{
 "items": [
  {
    "id": "_hGLZ2BgQS-UkNJENIesgw",
    "url": "https://landing.jobs/at/taxfix/elixir-software-engineer-in-berlin?utm_campaign=landing+rss&utm_content=Elixir+Software+Engineer&utm_medium=referral&utm_source=rss",
    "title": "Elixir Software Engineer",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:k/t/w:elixir/other/25",
      "DBG_TECH1:k/t/w:haskell/other/5",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:k/t/w:scala/java/3",
      "DBG_TECH1:techWeightMap:{python=0, other=30, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=3, gamedev=0, php=0, embedded=0, frontend=16}",
      "REMOTE1/50",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Taxfix",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "EUR",
      "minValue": 65000,
      "maxValue": 80000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "EUR 65k - 80k /Year"
    },
    "employmentType": "UNSET",
    "published": "Aug 9, 2019 12:51:42 PM",
    "validThrough": "Aug 16, 2019 12:51:42 PM",
    "crawled": "Aug 9, 2019 1:08:33 PM",
    "content": "<div><h3>Elixir Software Engineer</h3></div><div>Company: Taxfix</div><div>Location: Berlin, DE</div>Salary: 65.000 - 80.000 €<br>Level: Intermediate<br>Language: English <div>Back-end Developer<br>Skills:</div><li>Elixir </li><li>React </li><h3>Intro</h3><div>As one of the most successful FinTech companies in Europe, Taxfix is an exciting place to work. We’re revolutionizing filing taxes – and saving people money, time and stress by putting a personalized digital tax consultant in the palm of their hands.<br><br></div><div>In just 2 years, Taxfix has raised €42 million from some of the best investors in the world.&nbsp; We achieved this by putting our customers at the core of what we do and helping them save millions of euros every week.</div><div><br></div><div><strong>Our Mission<br></strong><br></div><div>Our mission is to help people get their maximum tax refunds in a convenient, transparent and timely manner, hassle-free. Our user-friendly Taxfix App enables people to file within 25 minutes, without any prior tax knowledge or complicated forms.<br><br></div><div>Our talented team creates products that help people improve and simplify their lives. Our diverse group of over 80 people come from over 20 nations, with a shared a passion for product development and creating an outstanding user experience. Join a team of smart, ambitious, driven people who value open communication and processes.</div><div><br></div><div><strong>You will</strong></div><ul><li>Apply innovative AI technologies to build a <strong>Tax Expert System</strong> that can model tax logic across multiple countries.</li><li>Develop out a Tax Engine with <strong>Elixir</strong> and <strong>ReactJS</strong>.</li><li>Be involved in important product decisions and work closely with the whole team to deliver top-notch Apps.</li></ul><div><br></div><div>Our team is looking for someone who is pragmatic, applies the best software engineering principles to build simple abstractions for complex problems, and who enjoys working in an agile environment.</div><h4>Main requirements</h4><p><strong>You have</strong></p><ul><li>Passion for crafting high quality and elegant code.</li><li>At least 3 years of work experience as software engineer</li><li>Strong functional programming skills and with at least +1 year of experience developing with <strong>Elixir, Haskell, Scala</strong> or other FP language.</li><li>Previous experience building maintainable and scalable systems based on reliable and fault-tolerant services.</li><li>Good understanding of distributed system and requirements for high availability.</li><li>Experience in taking ownership.</li></ul><h4>Perks</h4><div><strong>What You Gain:<br></strong><br></div><ul><li>Get to make an impact on thousands of people’s lives every day</li><li>Be paid a competitive salary with stock options</li><li>Benefit from remote work opportunities and flexible working hours</li><li>Have the option to take German language courses</li><li>Be supported to grow and take leadership from day one</li><li>Work with the best and learn from other competent and brilliant people</li><li>Work in a beautiful, inspiring office in Friedrichshain</li><li>Have the option to bring your best buddy to work. We love dogs!</li><li>Get relocation and visa support</li></ul><div>&nbsp;<br><br></div><div>At Taxfix, we don’t just&nbsp; accept diversity, we celebrate it! We’re proudly committed to equal employment opportunities no matter your gender, race, religion, age, sexual orientation, color, disability or place of origin. We care about one another at Taxfix and are grateful for each person’s individual contribution to our overall purpose and goals.</div><div><br></div><div>Join us to build a better future together!</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "cRastWiVR0ecsx73j6y4ig",
    "url": "https://stackoverflow.com/jobs/277924/senior-clojure-developer-knowledge-e?a=1vcQ3jAzBND2",
    "title": "Senior Clojure Developer at Knowledge E  ",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/4",
      "DBG_TECH1:k/t/w:clojure/other/20",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/4",
      "DBG_TECH1:techWeightMap:{python=0, other=20, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Knowledge E",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 6, 2019 10:06:24 AM",
    "validThrough": "Aug 13, 2019 10:06:24 AM",
    "crawled": "Aug 6, 2019 10:06:24 AM",
    "content": "<h3><span>Senior Clojure Developer</span>                </h3>                    <h4>About this job</h4>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Academia, Publishing, Research discovery</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>11–50 people</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Knowledge E | No office location<br></div>                    <h4>Remote details</h4>                    <div>                        <div>                                                            <div>                                    <span>Preferred Timezone:</span>                                    <span>(GMT+04:00) Moscow+01 - Samara </span>                                </div>                                                                                                            </div>                    </div>                <h4>Technologies</h4><div></div><div>clojure</div><div>dabs Full Stack Developer 21 2</div><div>Stephen Lavery 1</div><div>Mark Whyte 1</div><div>Henrik 307 1 10</div>                <h4>Job description</h4>                <div><p><strong>The Role</strong></p><p>You’ll be a key driver for the development of our discovery service and be&nbsp;working alongside a small multi-disciplinary team including service design, backend and frontend developers and our QA team. The&nbsp;discovery service&nbsp;will eventually include 100+ million full-text articles that need to be indexed automatically to enable the end users an outstanding user experience for accessing research literature, including intelligent searches, advanced browsing through subject categories and get highly relevant recommendations on what to read and whom to collaborate with, based on their search and navigation behaviour on the platform.</p><p>To deliver excellent solutions, you should be able to think out of the box and pro-actively elaborate new creative solutions to the challenges researchers and students are facing. It is also important that you stay up-to-date with latest trends and technologies in&nbsp;related areas, like NLP, AI, Machine Learning and Big Data as well as within the research and publishing domain.&nbsp;</p><p><strong>You Are</strong></p><p>Passionate about&nbsp;working with big data and making sense out of it for the end users by applying artificial intelligence and machine learning tools and techniques.&nbsp;</p><p><strong>Minimum Job Qualifications</strong></p><ul><li>Excellent&nbsp;programming skills to ensure elegant solutions with high performance, with proficiency in Clojure.</li><li>Ability to work with handling large volumes of data, including parsing, ingestion and indexing&nbsp;</li><li>Fluent in English</li></ul><p><strong>Desired Extras</strong></p><ul><li>University degree, for example in Computer Science</li><li>Experience with ElasticSearch, Apache&nbsp;Spark, and growing data-mining and search algorithms on large-scale datasets</li></ul>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/277924?reset=False&amp;ra=1vcQ3jAzBND2&amp;oqs=a%3D1vcQ3jAzBND2' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h4>About Knowledge E</h4>            <div><p>We are a passionate team of 30+ hands-on entrepreneurs, engineers and research domain experts that want to make the lives of researchers a great deal easier and a bit more fun and make as significant behind-the-scene-contributions as possible to help advance research and innovation. We are funded through our existing content subscription-based business and grow steadily through new research institutions turning to us for our more recent publishing, discovery and capacity-building training services.</p><p>In the development team, we are leveraging leading edge technology in an open collaboration with a range of other innovative partners in the publishing and research domain. The first version of the new platform was released in 2017 towards institutions and has successfully been rolled out across a set of initial client organisations. In October 2018, the platform was released as Zendy, directly targeted towards individuals. Zendy provides access to&nbsp;around 100 million publication records for free, and an important next milestone is to release Zendy Premium in a first country. Zendy Premium will offer individuals access to paid academic content for an affordable monthly or annual fee.</p><p>We believe in nurturing a creative and open workplace where people enjoy coming to work every day. We are therefore looking for team members who are truly passionate about what they do and that go the extra mile to provide an outstanding service and experiences to the research community that we are serving. We offer a competitive salary and great benefits like healthcare, a flexible vacation policy, and more. We are based in the easily accessible X2 Tower in Jumeirah Lakes Towers, 5 minutes by foot from the metro, with splendid views of Dubai.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>International, agile and fun team to work with!</span>                            </li>                            <li>                                <span></span>                                <span>Flexible vacation possibilities</span>                            </li>                            <li>                                <span></span>                                <span>1 week free for charity work sponsored by Knowledge E Foundation</span>                            </li>                            <li>                                <span></span>                                <span>Regular team events &amp; joint after-work activities</span>                            </li>                            <li>                                <span></span>                                <span>Select your own awesome hardware</span>                            </li>                            <li>                                <span></span>                                <span>Worrying free compensation package</span>                            </li>                            <li>                                <span></span>                                <span>Remote work possible</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "0kKdDWRHTxCJv3oGxG-nVA",
    "url": "https://jobmote.com/job/56442/servicenow-engineer-wellmed-san-antonio-tx-or-telecommute/",
    "title": "ServiceNow Engineer - WellMed - San Antonio, TX or Telecommute",
    "tags": [
      "DBG:surround``3N(telecommut, posit) NOT fulltim",
      "DBG_TECH1:k/t/w:ajax/frontend/3",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/3",
      "DBG_TECH1:k/t/w:javascript/nodejs/3",
      "DBG_TECH1:k/t/w:perl/other/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:shell/other/1",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=2, other=6, dotnet=8, c=0, mobile=0, go=0, nodejs=3, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=9}",
      "REMOTE1/50",
      "TECH1/dotnet",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "dotnet",
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "UnitedHealth Group",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 4, 2019 10:07:22 PM",
    "validThrough": "Aug 7, 2019 10:07:22 PM",
    "crawled": "Aug 5, 2019 3:06:25 AM",
    "content": "<div><br>No industry is moving faster than health care. And no organization is better positioned to lead health care forward. We need attention to every detail with an eye for the points no one has considered. The rewards for performance are significant. You'll help improve the health of millions. And you'll do your life's best work.(sm)You'll enjoy the flexibility to telecommute* from anywhere within the U.S. as you take on some tough challenges. Primary Responsibilities:Demonstrates and applies understandings of modern development methodologies and tools to develop and deploy and maintain solutionsWrite, debug and test code to create working solutions Understand and apply unique programming/scripting languages specific to software engineeringUnderstand and influence underlying architecture of solutions and how it meets business goalsApply modern practices, e.g., DevOps, Agile, Cloud, ATDD, Mobile First, etc.Build instrumentation and diagnostic to support integration of maintenance into developmentDevelop self-documenting functions, API and/or micro servicesLeverage modern components, tools and technologies to design decoupled, modular, flexible solutionsBuild and support ATDD/agile development and continuous integration; continuous delivery environment (CICD)Proactively manage and monitor the operational characteristics of software solutions Use and develop algorithmsUse and develop data structuresKnow serval languages and can apply right language to the right problemImplement solutions that exemplify modern practicesReuse and/or develops moderately advanced instrumentation and diagnosticsReuse and develops self-documenting functions, API's and micro-services to solve moderately advanced problemsImplement modern components, tools and technologiesImplement practices that support ATDD and CICDImplement solutions to address issues and ensure efficient and consistent solutions<br><br><b>Required Qualifications:</b>Bachelor's degree in computer science or equivalent education and experience 5+ years of ServiceNow experience5+ years of ITSM experiencePreferred Qualifications:Advanced experience with ServiceNow implementationsSystem integration experience using web services and other web based technologies such as XMLStrong communication, presentation, and writing skillsExcellent troubleshooting skills with the ability to demonstrate influence in a consultative fashion to stakeholders and other team membersExperience with development and implementation of ServiceNow ITSM modulesExperience with Incident Management, Problem Management, Configuration Management, Change Management, Knowledge Management or other ITSM applicationExperience with extending the ServiceNow schema to custom applicationsExposure to ServiceNow platform capabilities and tools like Discovery and Orchestration, and other applications like ServiceWatch, GRC, etc.Understands technical and functional design requirements related to ServiceNowAbility to create and manage scripts and workflowExperience in at least (1) scripting languages: JavaScript, Python, Perl, Unix Shell, Windows ShellExperience with relational databases (e.g., MySQL, Oracle)Fundamental understanding of ITSM, ITIL, or CMDBExperience with Business Rules, Script Includes, UI Actions, Scheduled Jobs - all scripted aspects of the ServiceNow systemExperience with ServiceNow client and server-side Javascript and the ServiceNow APIsScripted Web-Services, AJAX, Business Rules, JavaScript, SOAP, REST SSO-SAML Setup and Integration of ServiceNow to other applicationsExperience customizing ServiceNow using UI Pages, UI Macro and CMS using CSS, HTML, JellyExperience with custom UI changes with usage of Web Technologies such as DOM, HTML changesExperience with ServiceNow's ServiceWatch and/or Discovery toolsExperience presenting and conducting demo reviews with client stakeholdersPhysical &amp; Mental Requirements:Ability to lift up to 25 poundsAbility to sit for extended periods of timeAbility to use fine motor skills to operate office equipment and/or machineryAbility to receive and comprehend instructions verbally and/or in writingAbility to use logical reasoning for simple and complex problem solvingCareers with WellMed. Our focus is simple. We're innovators in preventative health care, striving to change the face of health care for seniors. We're impacting 240,000+ lives, primarily Medicare eligible seniors in Texas and Florida, through primary and multi-specialty clinics, and contracted medical management services. We've joined Optum, part of the UnitedHealth Group family of companies, and our mission is to help the sick become well and to help patients understand and control their health in a lifelong effort at wellness. Our providers and staff are selected for their dedication and focus on preventative, proactive care. For you, that means one incredible team and a singular opportunity to do your life's best work.(sm)*All Telecommuters will be required to adhere to UnitedHealth Group's Telecommuter Policy. Diversity creates a healthier atmosphere: OptumCare is an Equal Employment Opportunity/Affirmative Action employers and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law. OptumCare is a drug-free workplace. Candidates are required to pass a drug test before beginning employment. Job Keywords: ServiceNow Engineer, WellMed, San Antonio, TX, Texas, telecommute, telecommuter, remote, work from home<br><br><b>Job Title: </b> ServiceNow Engineer - WellMed - San Antonio, TX or Telecommute <br><b>Shift: </b> Day Job <br><b>Travel: </b> No <br><b>Business: </b> Optum Local Care Delivery <br><b>Family: </b> Technology <br><b>Telecommuter Position: </b> No <br><b>Job Level: </b> Individual Contributor <br><b>Overtime Status: </b> Exempt <br><b>Posted Date: </b> 6/24/2019 <br><b>City: </b> San Antonio <br><b>State: </b> TX <br><b>Country: </b> United States <br><b>Department: </b> WellMed Medical Mgmt, Inc<br> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "AMmo2yhUQkKfJx2L6zOwKA",
    "url": "https://remote.co/job/web-backend-developer/",
    "title": "Web Backend Developer",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:haskell/other/25",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=25, dotnet=0, c=0, mobile=0, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/50",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Input Output HK - IOHK",
      "sameAs": "https://iohk.io/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 4, 2019 6:50:50 PM",
    "validThrough": "Aug 11, 2019 6:50:50 PM",
    "crawled": "Aug 4, 2019 7:32:22 PM",
    "content": "<h3>Web Backend Developer at <span>Input Output HK - IOHK</span></h3><div><span><i></i> Remote</span>         | <span> International </span></div><div>            <p><strong>Location: Remote</strong></p><p><strong>FULL-TIME</strong></p><p><strong>ALLOWS REMOTE</strong></p><p>At IOHK we hire smart people from different backgrounds and disciplines, working closely together in an environment of respect and trust. Our goal is to create a culture of transparency, innovation and collaboration. Recruiting the right people, who not only have the smarts but also the behaviours to nurture our culture, is critical to our success and this is where you come in!</p><p>Wherever you decide to work, you will be supported by and be part of IOHK’s remote work culture that emphasizes online communication via Trello, Slack, GitHub, Hangouts.</p><p>We are looking for a talented Haskell compiler engineer to join our growing in-house team. In this full time, remote work opportunity the candidate will be responsible for designing, implementing, and maintaining existing and emerging backends for the Glasgow Haskell Compiler (GHC) targeting Web platforms, such as JavaScript and WebAssembly.</p><p>The individual will work as part of a newly formed Haskell Web compiler team and closely collaborate with our existing programming language and compiler teams across the full software life cycle of design, coding, testing and maintenance. The work will be in the context of existing open source projects and we expect that the individual maintains a close working relationship with other project contributors. The individual should have a strong understanding of functional programming, type systems, virtual machines, Web programming technology, and compiler implementation techniques. We strongly prefer candidates with an existing understanding of and experience with the internals of GHC.</p><p>Web execution platforms play a central role in the distribution and execution of distributed blockchain contract applications, and specifically, in IOHK’s Plutus Platform for the development of smart contracts for the Cardano blockchain. Our Haskell Web compiler team will consequently play a central role in the deployment of Plutus contracts and in unlocking the full potential of Cardano.</p><p><strong>Key Responsibilities:</strong></p><ul><li>Design, implement, test, and maintain key functionality in GHC Web backends, such as GHCJS and Asterius.</li><li>Implement build system support and other GHC toolchain functionality for GHC Web backends.</li><li>Improve the packaging, building, testing, and deployment infrastructure for GHC Web backends.</li><li>Work closely with other members of the relevant open source projects.</li><li>Work with members of IOHK teams that utilise GHC Web backends (such as the Plutus and Marlowe teams) to understand their requirements and to implement and improve functionality that they depend on.</li></ul><p><strong>Requirements:</strong></p><ul><li>At least two years experience of compiler design &amp; implementation</li><li>At least two years of Haskell experience</li><li>Documented contribution to open source projects</li></ul><p><strong>Desirable expertise:</strong></p><ul><li>Existing understanding of the architecture of GHC and especially its backend technology</li><li>Experience with generating JavaScript and/or WebAssembly</li><li>Existing contributions to GHC and/or GHCJS (or related technologies, such as the PureScript compiler)</li><li>Experience with the implementation of the GHC runtime system and base libraries</li><li>Experience with cross-compilation technology and build systems</li></ul><p><strong>What we value:</strong></p><ul><li>Passion for working alongside teams that want to explore new frameworks and systems that are more fair, open and transparent.</li><li>Collaboration and Inclusion: Innovation happens when people from different backgrounds and disciplines work closely together in an environment of respect and trust. You will help bring people into the conversation.</li><li>Transparency: Trust is built on openness and transparency. For example, all our code is open source and we share information openly with communities and colleagues.</li><li>Ability to work autonomously with minimal supervision. We offer a dynamic working environment that suits people who are self-motivated and can work autonomously. You will naturally have strong communication and organisational skills and can work on complex issues where analysis of situations or data requires an in-depth evaluation of variable factors.</li></ul><p><strong>In addition to working on ground breaking projects, you’ll also get in return:</strong></p><ul><li><strong>Opportunity to work remotely</strong></li><li><strong>Flexible hours</strong></li><li>20 days paid service interruption</li><li>Paid public holidays</li><li>5 days paid sick leave</li></ul>        </div><div>        <a href='https://iohk.io/careers/#op-302245-ghc-web-backend-developer' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "NAMF6sgcRoK_qOQfpO-XWw",
    "url": "http://www.indeed.co.uk/viewjob?t=Associate+Software+Engineer&jk=97b848daec0b293f&",
    "title": "Associate Software Engineer - starting Summer 2019 - Alert Logic - Cardiff",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:erlang/other/10",
      "DBG_TECH1:k/t/w:haskell/other/5",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:lisp/other/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=20, dotnet=0, c=13, mobile=1, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Nov 10, 2018 12:46:08 AM",
    "validThrough": "Nov 17, 2018 12:46:08 AM",
    "crawled": "Aug 4, 2019 2:06:27 PM",
    "content": "<div><p></p><div><div><div><div><div><p><b>About Alert Logic</b></p><p>Alert Logic® seamlessly connects an award-winning security platform, cutting-edge threat intelligence, and expert defenders – to provide the best security and peace of mind for your business 24/7 – at a lower total cost than point solutions, SIEM tools, or traditional security outsourcing vendors. We offer a new approach to evolving threats, expanding compliance risks, and resource constraints - helping you get the right level of security and compliance coverage across any environment. That’s SIEMless Threat Management. Only from Alert Logic.</p><br></div></div></div></div><p></p><p><b>Job Summary</b></p><p>Interested in making a difference? Looking for a company that’s customer obsessed, passionately pursues operational excellence, rewards design thinking and has a team first - individual ownership culture? Alert Logic employees design, implement, manage and support award winning cybersecurity products and solutions for over 4,000 customers. We are continuously seeking new team members who want to leverage their expertise to make a significant contribution to the company’s success and add value for our customers. If you’re ready to be a difference-maker, to bring new ideas and make things happen, consider the company that is leading and changing cybersecurity.</p><p>As an Associate Software Engineer, you’ll work as a member of a 5-10 person team of smart and creative developers responsible for designing, deploying, and managing a key subsystem within the Alert Logic security platform. You’ll get to leverage the latest AWS technologies, open source, and proprietary Alert Logic code to deliver customer value incrementally, every day! You’ll take on the computer science challenges posed by processing millions of events per second from over 4,000 customers. This is an opportunity for you to grow your software development skills by working with experienced colleagues to overcome the challenges of delivering next-generation security solutions at scale.</p><p><b>What you’ll do</b></p><ul><li>Implement new micro-services and features to solve customer needs while ensuring consistency in behavior and performance</li><li>Conduct continuous, incremental software releases</li><li>Ensure quality through appropriate unit and functional testing</li><li>Operationally support production software components, implementing thoughtful monitoring and alerting to detect error conditions before they impact customer</li></ul><p><b>What you’ve done and can do</b></p><ul><li>You’ve got a bachelor’s degree in Computer Science or Engineering, or you’ve gained equivalent knowledge through your work experience</li><li>You are familiar with one of these programming languages: C, C++, Java, Python , Erlang</li><li>You have developed for Linux Distributions (Debian or CentOS)</li><li>You know and like agile methodology</li><li>You’ve got experience developing and consuming RESTful APIs</li><li>You have an understanding of network protocols such as IP, TCP, UDP, with emphasis on HTTP</li></ul><p><b>You’re next-level with this knowledge and experience</b></p><ul><li>You’ve worked with AWS/Azure IaaS tools and services</li><li>You know serverless architecture: AWS Lambda or container technologies</li><li>You’ve done functional language programming in Erlang, LISP or Haskell</li><li>You’ve developed production applications using noSQL database technology such as DynamoDB, Riak, or Cassandra</li><li>Have used one or more map reduce frameworks</li><li>You’re familiar with SQL databases and experience with high volume transaction processing</li><li>You’re comfortable and experienced working with remote teams in different time zones</li><li>You’ve got some knowledge of network security</li><li>You’ve contributed to one or more open source projects</li><li>You’ve used Git source control system</li><br></ul><div><div><p></p><div><div><p>Alert Logic is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.</p><p><b>Notice to recruitment agencies</b>: Alert Logic does not accept unsolicited candidate resumes from recruiting agencies. We will not be liable for and will not pay placement fees for unsolicited resumes submitted to our jobs postings, employees or company locations.</p></div></div></div></div></div><p></p></div><div><div><div><span></span></div><span>Cardiff</span></div><div><div><span></span></div><span>Temporary</span></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "hQXEVdKJQKy5fwqEWAWmZw",
    "url": "https://jobmote.com/job/56375/remote-blockchain-rust-wasm-developer/",
    "title": "Remote Blockchain RUST/WASM Developer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG_TECH1:k/t/w:rust/other/10",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "CareerBuilder-US",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 3, 2019 10:07:23 PM",
    "validThrough": "Aug 6, 2019 10:07:23 PM",
    "crawled": "Aug 4, 2019 3:06:25 AM",
    "content": "<div>Company Introduction<br><br>OneinaMil is a talent matchmaking firm, we specialize in culture driven recruiting. Our mission is to change the way traditional recruiting is done by putting human connection and culture back into the talent acquisition puzzle. This position is with one of our many fantastic clients. We only work with the best companies out there, so if you are looking to join an amazing company, this could be the opportunity for you!<br><br>Who You Are:<br><br>Our client is a technology startup focused on building a next generation scalable proof of stake blockchain platform. They are looking for a talented Software Engineer to crush goals with their team. This Software Engineer is responsible for architecting and developing features in the blockchain platform in close collaboration with other team members of the development team. Are you looking to join a team of brilliance? Are you up for this challenge? This is a startup that is in stealth mode. If you are not looking for a life-changing career, stop reading.<br><br><b>***This is a 100% remote opportunity***</b><br><br>What You'll Do:<ul><li>You will review business requirements and develop an implementation plan for a feature, including design documentation and technical specifications.</li><li>You will participate in product requirements and development sessions and contributes to design decisions to ensure seamless integration of new features with current system functionality.</li><li>You will develop features iteratively with frequent pull requests, including unit tests and documentation.</li><li>You will recommend ways to improve product functionality, usability, reliability, performance and scalability.</li><li>You will work independently using engineering practices to evaluate, enhance and maintain existing quality methods &amp; processes.</li><li>You will make excellent technical decisions and complete tasks &amp; assignments under only general direction. So, no, we cannot hold you hand, nicely.</li><li>You demonstrates self-initiative and self-motivation and recognizes problems that need further investigation seeking assistance only when needed.</li><li>You can independently determine and develop approach to solutions for a wide range of technically difficult problems, under only very general direction.</li></ul>Who You Are:<ul><li>You have experience working in a Linux environment. This is a huge requirement!</li><li>You have a Bachelor?s degree in Computer Engineering, Computer Science, or equivalent experience is required.</li><li>You have a minimum of three (3) years experience as a Software Engineer on large scale systems and/or distributed systems is required.</li><li>Having experience working with Rust in a production environment is a requirement .</li><li>You have experience working with WASM.</li><li>You have experience with functional programming.</li><li>You have experience with formal methods, computational mathematics, or process calculi is a huge plus.</li><li>You have experience with blockchain technologies.</li></ul></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "4sMrOpJ0SGiRnrn3i0jCLw",
    "url": "https://news.ycombinator.com/item?id=20595812",
    "title": "Interfolio | Software Engineer (Elixir) | Wash, DC OR Fully Remote (US) | Full Time | www ...",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:elixir/other/15",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 2, 2019 9:23:46 PM",
    "validThrough": "Aug 9, 2019 9:23:46 PM",
    "crawled": "Aug 2, 2019 9:31:15 PM",
    "content": "Interfolio | Software Engineer (Elixir) | Wash, DC OR Fully Remote (US) | Full Time | www.interfolio.com<p>Interfolio is a fast growing, higher ed SaaS company based in Washington, DC with 100% fully remote engineering team, great benefits, flexible environment -- solving interesting and complex challenges for higher ed involving software.</p><p>We're seeking a talented and energetic software engineer with a deep understanding of Elixir to join our tight-knit team. You must be focused on producing high quality and maintainable code. This role offers a high level of creativity, and an opportunity to design the future with a company that is challenging the status quo.</p><p>Apply through our site: <a href='https://jobs.lever.co/interfolio/d2ae0440-4c34-40bb-bc88-b57e521f3d34?lever-origin=applied&amp;lever-source%5B%5D=Hacker%20News%20Monthly%20Posting' rel='nofollow'>https://jobs.lever.co/interfolio/d2ae0440-4c34-40bb-bc88-b57...</a></p><p>or email recruiting@interfolio.com</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Kd9pBkeXTa2v0YAgxqQVAg",
    "url": "https://news.ycombinator.com/item?id=20591136",
    "title": "Immux | https://www.immux.com | Systems Software Engineer | Remote | Full time We are building ...",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:rust/other/10",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 2, 2019 9:06:16 AM",
    "validThrough": "Aug 9, 2019 9:06:16 AM",
    "crawled": "Aug 2, 2019 11:07:06 AM",
    "content": "Immux | <a href='https://www.immux.com' rel='nofollow'>https://www.immux.com</a> | Systems Software Engineer | Remote | Full time<p>We are building a fast and easy-to-use immutable database engine and a computing service that provide first-class citizen support for functional programming, versioned and auditable data operations, and automatic maintenance and tuning.</p><p>We intend to make immutable storage systems the norm in a decade. Join us to design and implement computing infrastructure for the next generation.</p><p>Stack: Rust + TypeScript.</p><p>Seed round from a NASDAQ-listed finance company. Salary + options.</p><p>The whole team works remotely.</p><p>Contact: shu@immux.com (Andy Shu, Founder/CEO), preferably with resume and GitHub link.</p><p>(If you haven't written Rust but is interested and learns fast, feel free to get in touch!)</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "_fb2KnJaRI2uDdKIIoofYg",
    "url": "https://news.ycombinator.com/item?id=20589873",
    "title": "Aclaimant | Remote | Full Stack Developer | Full-time | https://aclaimant.com Aclaimant is ...",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:clojure/other/15",
      "DBG_TECH1:k/t/w:clojurescript/other/5",
      "DBG_TECH1:techWeightMap:{python=0, other=20, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 2, 2019 3:00:04 AM",
    "validThrough": "Aug 9, 2019 3:00:04 AM",
    "crawled": "Aug 2, 2019 5:08:12 AM",
    "content": "Aclaimant | Remote | Full Stack Developer | Full-time | <a href='https://aclaimant.com' rel='nofollow'>https://aclaimant.com</a>Aclaimant is looking for a senior or mid-level Clojure developer to join our team. At Aclaimant we are redefining the way companies and employees work together to manage risk. Our SaaS platform is built using Clojure and ClojureScript. We work remotely from the comfort of our own homes. Pair programming is important to us; it helps us build culture and share knowledge. We expect candidates to be located within North America. Email jobs@aclaimant.com for more information or visit <a href='https://aclaimant.com/careers-developer' rel='nofollow'>https://aclaimant.com/careers-developer</a>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Lbu0Wg0NQ0mL40AcmyUApA",
    "url": "https://jobs.github.com/positions/f0443e49-1f3b-461a-8f12-815862adb637",
    "title": "Software Engineer (Backend, IoT)",
    "tags": [
      "DBG:surround``12N(work, OR(home,remot), 5N(OR(offic,headquart,onsit), OR(dai,daili,week,weekli,month,monthli)) )",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:rust/other/5",
      "DBG_TECH1:techWeightMap:{python=2, other=10, dotnet=5, c=2, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2019 7:40:10 PM",
    "validThrough": "Aug 8, 2019 7:40:10 PM",
    "crawled": "Aug 1, 2019 8:30:28 PM",
    "content": "A company is only as good as its employees. We at grandcentrix absolutely know and appreciate this. Become part of the best team in the world and realize digital large-scale productions on the Internet of Things with the grandcentrix family of over 150 colleagues.Therefore we are looking for you as a motivated and passionate *backend software engineer* for our locations in Cologne and Dortmund, as well as remote from Germany.The vast majority of the grandcentrix staff are engineers, expecting to be challenged on a daily basis.  Our teams give a great insight into working at grandcentrix on our team website, [grandcentrix.team](https://grandcentrix.team). You should take a look!**Your role**- You design, develop and test smart IoT solutions as part of our Systems &amp; Infrastructure Competence Center.- You work in a cloud-based environment with PaaS and IaaS services and are able to integrate them sensibly into solutions.- As an experienced engineer for the planning and implementation of complex software architectures, you are the contact person for your project team.**Requirements**- You have experience as a software engineer in agile development models (Scrum, Kanban, XP, etc.).- You have good knowledge of at least one object-oriented or functional programming language (C#, Rust, Elixir, Ruby, Python, etc.).- You are familiar with modern software architectures and process models in the industry.- You have experience with PaaS and IaaS services such as Microsoft Azure, Amazon Web Services or Google Cloud Platform.- Previous knowledge of IoT-specific services such as Azure IoT Hub or AWS IoT Core is an advantage.- You have advanced knowledge of protocols such as HTTP and the design of REST APIs.- You have a strong interest in test-driven development as well as high-performance and maintainable code for software development.- You have an open communication style in German or English.**Our offer**- Working hours based on the honour system, as well as a flexible home office scheme -- no more vacation days wasted when you need something repaired at home.- Innovative projects, unbureaucratic structures and short paths to decision makers.- State of the art equipment and an inspiring, modern working environment with an attractive atmosphere.- Regular internal lightning talks, hackathons and public meet-ups hosted by us.- Personal development through training courses, congress visits and time for active knowledge sharing in internal communities.- Attractive, performance-based compensation instead of static pay tables or seniority.Company pension, Jobrad, VRS job ticket and relocation assistance are available if you would like.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "vQ4ocyd2QjyPlS1YOFzTSw",
    "url": "https://news.ycombinator.com/item?id=20585841",
    "title": "Digital Onboarding | Senior Full-stack Engineer | REMOTE (US based) | Full time Digital ...",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot W OR(career,first)",
      "DBG_TECH1:k/t/w:com/dotnet/8",
      "DBG_TECH1:k/t/w:elixir/other/10",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=8, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet",
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2019 7:00:44 PM",
    "validThrough": "Aug 8, 2019 7:00:44 PM",
    "crawled": "Aug 1, 2019 7:32:07 PM",
    "content": "Digital Onboarding | Senior Full-stack Engineer | REMOTE (US based) | Full time<p>Digital Onboarding is a marketing automation platform that helps banks and credit unions modernize their onboarding process and develop mutually beneficial, profitable relationships with their customers and members.</p><p>Current stack: Elixir + Phoenix, React + Redux, Lambda (Node), Postgres</p><p>Requirements:</p><p>- 5+ years in front end and back end web development</p><p>- Committed to building features you're proud of</p><p>- Strong understanding of SQL databases</p><p>- Strong understanding of functional programming</p><p>- Strong communication skills</p><p>- Previous Elixir experience</p><p>Nice-to-haves:</p><p>- Machine learning experience</p><p>- Experience working on a remote-first, distributed team</p><p>- Love of nachos</p><p>Send me an email me at jonathan at digitalonboarding dot com.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "2RFFP4C1QeObVhBD4O_ceA",
    "url": "https://news.ycombinator.com/item?id=20586174",
    "title": "Eleos Technologies | Remote (US only) | Full time | https://eleostech.com Eleos Technologies is ...",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k/t/w:clojure/other/5",
      "DBG_TECH1:k/t/w:erlang/other/5",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=10, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other",
      "ruby"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2019 7:29:16 PM",
    "validThrough": "Aug 8, 2019 7:29:16 PM",
    "crawled": "Aug 1, 2019 7:32:07 PM",
    "content": "Eleos Technologies | Remote (US only) | Full time | <a href='https://eleostech.com' rel='nofollow'>https://eleostech.com</a><p>Eleos Technologies is a growing 8-year-old company building communication software for truck drivers and field workers.</p><p>We’re helping a diverse mix of customers—from mom and pop operations to household names—improve how they communicate with their employees by tackling information overload, reducing phone calls, and eliminating obsolete technologies.</p><p>We're looking for someone to own and evolve our web backends. The primary backend is built on Erlang/OTP, plus supporting systems built in Clojure (image processing) and Ruby on Rails (dashboard, billing UI, those bits.) As a small team, we've all helped build and grow these systems, but we're ready for a specialist!</p><p>In addition to the above technologies, we're running on AWS, using PostgreSQL, although we're keen to remember that all these things are tools and not identities.</p><p>If that sounds fun and rewarding to you, the full description and info about applying are over here:</p><p><a href='https://jobs.lever.co/eleostech' rel='nofollow'>https://jobs.lever.co/eleostech</a></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "WD-UdEzqQ7WY9praxiQoFQ",
    "url": "https://remote.co/job/erlang-developer/",
    "title": "Erlang Developer",
    "tags": [
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:erlang/other/20",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=20, dotnet=0, c=0, mobile=0, go=8, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Scrapinghub",
      "sameAs": "https://scrapinghub.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2019 6:23:37 PM",
    "validThrough": "Aug 8, 2019 6:23:37 PM",
    "crawled": "Aug 1, 2019 6:24:53 PM",
    "content": "<h3>Erlang Developer at <span>Scrapinghub</span></h3><div><span><i></i> Remote</span>         | <span> International </span></div><div>            <p><strong>REMOTE</strong> ·<strong> Product</strong></p><p><strong>DESCRIPTION</strong></p><p>Crawlera is a smart downloader designed specifically for web crawling and scraping, removing the headaches of proxy management. It is part of the Scrapinghub platform, the world’s most comprehensive web crawling stack which powers crawls of over 8 billion pages per month.</p><p>As an Erlang developer you will help to ensure the robustness of our services. You will learn to investigate production issues on a server executing customer requests. You will be able to navigate a large code-base and find the least obstructive place for extensions. Beside the technicalities you will gain a holistic view of the product and ensure a greater usability of the system with every single task you complete. In this role, you will partake in brainstorming and delivering improvements to the core of Crawlera.</p><p><strong>Job Responsibilities:</strong></p><ul><li>Develop, maintain and support a high load distributed system.</li><li>Analyze our current and historical Crawlera usage to augment and enhance its routing and rotation logic.</li><li>Leverage the Scrapinghub platform to provide extended functionality, both to end users and for internal purposes.</li><li>Identify and resolve performance and scalability issues with distributed crawling at scale.</li><li>Liaison with other platform teams to provide Crawlera with the best possible integration to the growing Scrapinghub platform.</li></ul><p><strong>REQUIREMENTS</strong></p><p><strong>Required Skills:</strong></p><ul><li>2+ years of production experience with Erlang.</li><li>Strong communication in written and spoken English.</li><li>Strong knowledge of Linux/UNIX, HTTP and Networking.</li></ul><p><strong>Desired Skills:</strong></p><ul><li>Python or Golang experience.</li><li>Familiarity with techniques and tools for crawling, extracting, and processing data.</li><li>Knowledge of ELK, Graylog, Docker and Mesos.</li><li>Strong record of open source activity</li><li>Experience working with Lean principles and a Scrum SDLC</li></ul><p><strong>BENEFITS</strong></p><p><strong>As a new Shubber, you will:</strong></p><ul><li>Become part of a self-motivated, progressive, multi-cultural team.</li><li><strong>Have the freedom and flexibility to work from where you do your best work.</strong></li><li><strong>Attend conferences and meet with team members from across the globe.</strong></li><li>Work with cutting-edge open source technologies and tools.</li><li>Receive paid time off</li><li>Enrol in Scrapinghub’s Share Option Programme</li></ul>        </div><div>        <a href='https://scrapinghub.workable.com/j/F252F83582' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Ti-gzoRUTRGAXnVNuMTdAg",
    "url": "https://news.ycombinator.com/item?id=20584790",
    "title": "Kira Systems | Multiple Senior Software Developers | Toronto, Canada | Remote | Onsite | https: ...",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:clojure/other/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/6",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=6, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2019 5:39:28 PM",
    "validThrough": "Aug 8, 2019 5:39:28 PM",
    "crawled": "Aug 1, 2019 6:24:48 PM",
    "content": "Kira Systems | Multiple Senior Software Developers | Toronto, Canada | Remote | Onsite | <a href='https://www.kirasystems.com' rel='nofollow'>https://www.kirasystems.com</a><p>Kira Systems is a powerful machine learning software that identifies, extracts, and analyzes text in your contracts and other documents. Our software is intuitive and easy-to-use to uncover relevant information for some of the largest law firms, professional services and corporate companies in the world.</p><p>We are always looking for talented people to join our team locally, remotely, and offer support for those looking to relocate to our headquarters in Toronto.</p><p>We're hiring Machine Learning Devs, Security Engineering Lead and Developers to work in all areas of our stack. Possibilities include working on Clojure web server, backend data processing services, and both our platform API and SDK. We use PostgreSQL to store our data and don’t hide SQL behind big frameworks. We also use many other popular technologies such as Go, RabbitMQ, Zookeeper, ElasticSearch, and Docker.</p><p>For more information, visit our careers page <a href='https://www.kirasystems.com/careers' rel='nofollow'>https://www.kirasystems.com/careers</a> or email us at jobs@kirasystems.com.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "fbY2MmOiQ0a9jM0ch4aSaA",
    "url": "https://news.ycombinator.com/item?id=20584316",
    "title": "ConsenSys R&D | Senior Software Engineer (Rust) | Full-time | Remote ConsenSys R&D is focused ...",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:rust/other/15",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2019 5:00:44 PM",
    "validThrough": "Aug 8, 2019 5:00:44 PM",
    "crawled": "Aug 1, 2019 6:24:48 PM",
    "content": "ConsenSys R&amp;D | Senior Software Engineer (Rust) | Full-time | Remote<p>ConsenSys R&amp;D is focused on developing open source technology for the next generation of Ethereum.</p><p>We are looking for senior level engineers and researchers with backgrounds in systems engineering, distributed networks (p2p), parallel computing, WebAssembly, and cryptography. Our team is competitively compensated based on experience.</p><p>Some of the things we are working on:</p><p>* Building a proof-of-concept client in Rust for Ethereum 2.0 which supports WebAssembly execution for multiple shards.</p><p>* Benchmarking the performance of various aspects of WebAssembly runtimes, cryptographic functions, and p2p networking.</p><p>* Developing efficient proof tooling for authenticated data structures (merkle proofs).</p><p>* Exploring BFT consensus schemes for cross shard transactions.</p><p>* Researching and developing global transaction broadcasters.</p><p>Apply here: <a href='https://consensys.net/open-roles/?discipline=61666' rel='nofollow'>https://consensys.net/open-roles/?discipline=61666</a></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "MUhBbkOkQNaoFXAJ6no6uA",
    "url": "https://jobmote.com/job/51105/immediate-back-fill-remote-informatica-developer/",
    "title": "Immediate Back fill Remote Informatica Developer",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:shell/other/4",
      "DBG_TECH1:techWeightMap:{python=0, other=4, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Nuvento",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 18, 2019 10:07:26 PM",
    "validThrough": "Jul 21, 2019 10:07:26 PM",
    "crawled": "Jul 19, 2019 3:06:25 AM",
    "content": "<div>\n <p> </p>\n <p><strong>Job Title: Informatica Developer</strong></p>\n <p><strong>Duration: Long Term</strong></p>\n <p><strong> Remote</strong></p>\n <p> </p>\n <p><strong>Job Description:</strong></p>\n <ul>\n  <li>\n   <ul>\n    <li>Minimum 5 years of onsite experience in Informatica 10.x development </li>\n    <li>Ability to design, write, test and debug code (Informatica, shell script)</li>\n    <li>Ability to work effectively with business users and (or) Client to understand and resolve the issues.</li>\n    <li>Proficiency in coding moderate to complex SQL logic as part of data extraction processes.</li>\n    <li>Should have in-depth knowledge on Informatica architecture.</li>\n    <li>Ability to do performance tuning.</li>\n    <li>Troubleshoot applications problems independently.</li>\n    <li>Hands-on Technical experience in:\n     <ul>\n      <li>Informatica 10.x</li>\n      <li>Oracle 10g,11g</li>\n     </ul></li>\n    <li>Experience on debugging technical issues for Informatica code etc.</li>\n    <li>Experience with shell scripting.</li>\n    <li>Good to have Healthcare MMIS domain functional knowledge.</li>\n    <li>Good Communication skills</li>\n   </ul></li>\n </ul>\n <p> </p>\n <p><strong>Thanks,</strong></p>\n <p><strong>Balan</strong></p>\n <p><strong>Nuvento LLC</strong></p>\n <p><strong>7300 College Blvd, Suite 308,</strong></p>\n <p><strong>Overland Park, KS 66210</strong></p>\n <p><strong></strong></p>\n <p><strong>Cell: , </strong></p>\n <p> </p>\n <p> </p>\n <p> </p> - provided by Dice\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "tYh5dmWlSUCxG_JT_70QtQ",
    "url": "https://remote.co/job/backend-engineer-17/",
    "title": "Backend Engineer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:elixir/other/15",
      "DBG_TECH1:k/t/w:haskell/other/5",
      "DBG_TECH1:k/t/w:ocaml/other/5",
      "DBG_TECH1:techWeightMap:{python=0, other=25, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Nash.io",
      "sameAs": "https://nash.io/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 16, 2019 6:03:15 PM",
    "validThrough": "Jul 23, 2019 6:03:15 PM",
    "crawled": "Jul 16, 2019 6:23:53 PM",
    "content": "<h3>Backend Engineer at <span>Nash.io</span></h3>\n<div>\n <span><i></i> Remote</span> | \n <span> International </span>\n</div>\n<div> \n <p><strong>REMOTE</strong></p>\n <p><strong>ENGINEERING</strong></p>\n <p><strong>FULL-TIME</strong></p>\n <p>Our goal at NEX is to make trading, holding, and interacting with cryptocurrencies accessible to everyone. We are looking for backend engineers (remote) to help build our exchange matching engine, settlement layer, and APIs. You should be well versed in Elixir or a similar functional programming language and have a passion for test-driven development.</p>\n <p><strong>Requirements</strong></p>\n <ul>\n  <li>Develop modular code and reusable components for the NEX exchange matching engine, settlement layer, and APIs.</li>\n  <li>Document your work thoroughly so that others can work with and build upon it.</li>\n  <li>Engage in test-driven development practices.</li>\n  <li>Work asynchronously with a fully remote team</li>\n </ul>\n <p><strong>We are looking for</strong></p>\n <ul>\n  <li>1+ years experience working with Elixir.</li>\n  <li>Experience with Phoenix 1.3 and ExUnit testing.</li>\n  <li>Extensive knowledge of Git.</li>\n  <li>Experience with other functional programming languages such as OCaml or Haskell.</li>\n </ul>\n <p><strong>We prefer but don’t require</strong></p>\n <ul>\n  <li>Experience working in remote teams.</li>\n  <li>A history of contributing to open source software.</li>\n  <li>Experience working with OTP, Ecto, and Plug.</li>\n  <li>Familiarity with Elixir typespecs.</li>\n  <li>Experience managing cloud provider services (e.g., AWS GCP)</li>\n </ul> \n</div>\n<div> \n <a href='https://jobs.lever.co/nash.io/1928193c-a2d8-47a4-a392-a99987d597a8' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "y3Nd4lRERq2LE1fHvZ2qjw",
    "url": "https://functionaljobs.com/jobs/9173-ocaml-developer-at-ahrefs-pte-ltd",
    "title": "OCaml Developer at Ahrefs Pte Ltd (Full-time)",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:c++/c/16",
      "DBG_TECH1:k/t/w:com/dotnet/8",
      "DBG_TECH1:k/t/w:ocaml/other/30",
      "DBG_TECH1:k/t/w:rust/other/10",
      "DBG_TECH1:techWeightMap:{python=0, other=40, dotnet=8, c=16, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Ahrefs Pte Ltd",
      "sameAs": "http://www.ahrefs.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 13, 2019 7:02:01 AM",
    "validThrough": "Jul 20, 2019 7:02:01 AM",
    "crawled": "Jul 13, 2019 7:07:25 AM",
    "content": "<h3>OCaml Developer</h3>\n<div>\n Company: Ahrefs Pte Ltd\n</div>\n<div>\n Type: full-time\n</div>\n<div>\n Location: Singapore or Remote\n <br>\n <br>\n</div>\n<div> \n <div> \n  <p><strong><em>What We Need</em></strong></p>\n  <p>Ahrefs is looking for a backend developer with deep understanding of networks, distributed systems, OS fundamentals and taste for simple and efficient architectural designs. Our backend is mostly implemented in OCaml with some C++ and Rust.</p>\n  <p>In this role, be prepared to deal with 25 petabytes of live data, OCaml and Linux on a daily basis.</p>\n  <p><strong><em>Basic Requirements:</em></strong></p>\n  <ul>\n   <li>Proficiency in OCaml</li>\n   <li>Knowledge of C++ and/or Rust is a plus</li>\n  </ul>\n  <p><strong><em>The ideal candidate is expected to:</em></strong></p>\n  <ul>\n   <li>Independently deal with bugs, schedule tasks and investigate code</li>\n   <li>Make well-reasoned technical choices and take responsibility for them</li>\n   <li>Understand the whole technology stack at all levels: from network and user-space code to OS internals and hardware</li>\n   <li>Handle full development cycle of a single component i.e. formalize task, write code and tests, setup and support production, resolve user requests</li>\n   <li>Approach problems with a practical mindset and suppress perfectionism when time is a priority</li>\n   <li>Write flexible, maintainable code and adapt to post-launch requirements/tweaks</li>\n  </ul>\n  <p>These requirements stem naturally from our approach to development with fast feedback cycle, highly-focused personal areas of responsibility and strong tendency to vertical component splitting.</p>\n  <p>If your preference is leaning towards making the web functional and working on user-facing stuff, you may want to consider our&nbsp;<a href='https://ahrefs.com/jobs/reasonml-developer' rel='nofollow'>ReasonML</a> position instead.</p>\n  <p><strong><em>Who We Are</em></strong></p>\n  <p>Ahrefs runs an internet-scale bot that crawls the whole web 24/7, storing huge volumes of information to be indexed and structured in a timely fashion. Our backend system is powered by a custom petabyte-scale distributed key-value storage to accommodate all that data coming in at high speed. With this data, Ahrefs builds analytics services for end-users in the Search Engine Optimization (SEO) space and a web-scale search platform.</p>\n  <p>We are a lean and robust team who strongly believe that better technology leads to better solutions for real-world problems. We worship functional languages and static typing, extensively employ code generation and meta-programming, value code clarity and predictability, and are constantly seeking to automate repetitive tasks and eliminate boilerplate, guided by DRY and following KISS. If there is any new technology that will make our life easier - no doubt, we'll give it a try. We rely heavily on opensource code (as the only viable way to build maintainable system) and contribute back, see e.g.&nbsp;<a href='https://github.com/ahrefs' rel='nofollow'>https://github.com/ahrefs</a>&nbsp;. It goes without saying that our team is all passionate and experienced OCaml programmers, ready to lend a hand and explain that intricate ocamlbuild rule or track down a&nbsp;<a href='https://tech.ahrefs.com/skylake-bug-a-detective-story-ab1ad2beddcd' rel='nofollow'>CPU bug</a>.</p>\n  <p>Our motto is &quot;first do it, then do it right, then do it better&quot;.</p>\n  <p><strong><em>What You Get</em></strong></p>\n  <p>At Ahrefs, we value our people and working here has never been more rewarding. We offer: - Competitive compensation package - Informal and thriving work atmosphere - First-class workplace equipment (hardware &amp; tools) - Above-average perks and fringe benefits</p>\n  <p>Work location for this role could be:- Singapore (Singapore Citizens or Permanent Residents preferred)- Remote</p> \n </div> \n <h4>To Apply</h4> \n <p>Send your application including cover letter, availability to start and expected salary to <span><span>jobs</span> [at] <span>ahrefs [dot] com</span></span></p> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "zUisZTNJTk-KsoYeWWUrfA",
    "url": "https://remoteok.io/jobs/73790",
    "title": "Clojure / Backend Engineering Manager",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:clojure/other/15",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Clubhouse ",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 9, 2019 2:37:03 PM",
    "validThrough": "Jul 16, 2019 2:37:03 PM",
    "crawled": "Jul 10, 2019 11:01:08 PM",
    "content": "<span></span> \n<span><h4>Clubhouse</h4>&nbsp;</span> \n<br> \n<h3>Clojure / Backend Engineering Manager</h3> \n<span></span> \n<span>verified</span> \n<br> \n<span>Worldwide</span> \n<div> \n <div>\n   Clubhouse was built by software engineers with the goal of making project management software less painful, more collaborative, and help software development teams do their best work. The platform combines a simple, modern UI with enterprise-grade tools, allowing technology companies to plan and manage their projects effectively, visualize progress across the organization, and define deadlines and milestones based upon data and predictive modeling. \n  <br> \n  <br>What originally started as a Hack Day project has grown into a product that is used by more than 1,500 companies across the globe...and we have big plans to continue our growth. We currently have 35 employees worldwide, an HQ in New York City, and we’re backed by some of the best investors in tech. \n  <br> \n  <br>Clubhouse’s engineering team is a diverse mix of individuals with experience at large and small companies and with a range of technical skill. We’re looking for an Engineering Manager who will join up and lead a team of infrastructure engineers. This role will report to our VP of Engineering and will be responsible for team management, as well as technical work. (Read: you’ll write and commit code to our codebase.) As a Manager, you’ll also play a meaningful role in recruiting and growing the Clubhouse team. \n  <br> \n  <br> \n  <br> \n  <br> \n  <br># Responsibilities \n  <br> As an Engineering Manager you will: \n  <br> \n  <br>* Lead, mentor, coach, motivate, and manage a team of software engineers with varying levels of experience \n  <br>* Help build Clubhouse! As a senior member of the team, you’ll be expected to scope, lead and execute on impactful engineering projects \n  <br>* Lead system design for our infrastructure and establish teams or projects to implement and improve our systems \n  <br>* Work to make your team more effective by eliminating dependencies; ensuring projects are adequately staffed; aligning on expectations and deadlines with other teams; and advocating for team members, as appropriate \n  <br>* Collaborate with other teams across the business to plan and execute on strategic initiatives \n  <br> \n  <br># Requirements \n  <br>What you need: \n  <br> \n  <br>* Previous experience as a people manager. Ideally, this experience will include managing a distributed team and individuals with varying levels of experience \n  <br>* Significant experience as an engineer, preferably working across the technology stack and on projects related to scaling and improving back-end systems and architecture \n  <br>* Our infrastructure is written in Clojure; you’ll need to have worked in this or a similar language in at least one previous role \n  <br>* A “lead-by-example” management style. (We are severely allergic to micro-managers) \n  <br>* A commitment to growing and developing your team \n  <br>* Strong data-driven prioritization skills and the ability to plan for short and long term \n  <br> \n  <br> \n  <br>#Location \n  <br>- Worldwide \n  <br> \n </div> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "LzUnPsfQRdC7_V-g12ZoGw",
    "url": "https://jobmote.com/job/47424/active-directory-software-engineer-partial-remote-position/",
    "title": "Active Directory Software Engineer (Partial Remote Position)",
    "tags": [
      "DBG:surround``OR(partial,share,amen,semi) 3W remot",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:shell/other/1",
      "DBG_TECH1:techWeightMap:{python=0, other=1, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Activesoft, Inc.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 4, 2019 10:07:17 PM",
    "validThrough": "Jul 11, 2019 10:07:17 PM",
    "crawled": "Jul 5, 2019 3:06:26 AM",
    "content": "<div>\n <ul>\n  <li>Active Directory migration experience on multiple projects (2008 and higher)</li> \n  <li>Hands on scripting experience using Power Shell</li> \n  <li>Documentation skills</li> \n  <li>Excellent written/verbal skills</li> \n  <li>Troubleshooting skills</li> \n  <li>ADMT tool experience</li> \n  <li>Experience with more than one third-party tool (e.g. Quest, Binary Tree, etc.)</li>\n </ul> - provided by Dice\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Dji-W6n0QsO3J4cfGskExQ",
    "url": "https://news.ycombinator.com/item?id=20333579",
    "title": "Parity Technologies | Berlin, Germany | Remote / Onsite | Full-time Parity Technologies builds ...",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:rust/other/15",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 2, 2019 11:44:41 AM",
    "validThrough": "Jul 9, 2019 11:44:41 AM",
    "crawled": "Jul 2, 2019 11:45:44 PM",
    "content": "Parity Technologies | Berlin, Germany | Remote / Onsite | Full-time\n<p>Parity Technologies builds blockchain software in Rust. We're probably the only team in the world successfully reimplementing both Bitcoin, Ethereum and ZCash nodes from scratch. We only do opensource development, and are practicing Programmer Anarchy (<a href='https://www.parity.io/engineering-at-parity-what-its-like/' rel='nofollow'>https://www.parity.io/engineering-at-parity-what-its-like/</a>) as our main development methodology.We're currently focusing on Parity Substrate, our framework/toolkit for building blockchains in Rust, and are growing steadily.</p>\n<p>We have quite some positions open currently: <a href='https://www.parity.io/jobs/#jobs' rel='nofollow'>https://www.parity.io/jobs/#jobs</a></p>\n<p>Most interesting ones (from my subjective perspective) are: - Blockchain Runtime Engineer — build prototypes and PoCs to grow an ecosystem around Substrate; <a href='https://www.parity.io/jobs/#berlin-blockchain-runtime-engineer' rel='nofollow'>https://www.parity.io/jobs/#berlin-blockchain-runtime-engine...</a> - Internal Tools Developer — be a self-driven one-man product team to design, build and deploy our internal automation; <a href='https://www.parity.io/jobs/#berlin-internal-tools-developer' rel='nofollow'>https://www.parity.io/jobs/#berlin-internal-tools-developer</a> - Security Engineer — well, you'll be breaking software, protocols and networking full-time; <a href='https://www.parity.io/jobs/#berlin-security-engineer' rel='nofollow'>https://www.parity.io/jobs/#berlin-security-engineer</a></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "FUWI4V-WSyevz9ExCrfrhg",
    "url": "https://news.ycombinator.com/item?id=20332558",
    "title": "Fullstory | Framework engineer | Remote or onsite | Atlanta We're building the next gen of ...",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:rust/other/10",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 2, 2019 8:08:49 AM",
    "validThrough": "Jul 9, 2019 8:08:49 AM",
    "crawled": "Jul 2, 2019 11:45:44 PM",
    "content": "Fullstory | Framework engineer | Remote or onsite | Atlanta\n<p>We're building the next gen of privacy-respecting, high-performance mobile analytics. If things like Rust, app and framework disassembly, or reverse engineering sound like fun, you'll love working this team.</p>\n<p>Send me a note to my email here on HN or matt @ fullstory and I'd be more than happy to talk about what we're doing.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "jH-PLejcQLm4ba7nwLqWJg",
    "url": "https://news.ycombinator.com/item?id=20335668",
    "title": "Kira Systems |Machine Learning Developer, Software Developer(s). QE Specialists, Research ...",
    "tags": [
      "DBG:surround``4N( OR(look, search),     4N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:clojure/other/5",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/4",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=4, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 2, 2019 4:47:20 PM",
    "validThrough": "Jul 9, 2019 4:47:20 PM",
    "crawled": "Jul 2, 2019 11:45:44 PM",
    "content": "Kira Systems |Machine Learning Developer, Software Developer(s). QE Specialists, Research Scientist| Toronto, Canada | Remote | Onsite | \n<a href='https://www.kirasystems.com' rel='nofollow'>https://www.kirasystems.com</a>\n<p>Kira Systems makes contract analysis software. We are always looking for talented people to join our team locally, remotely, and for those looking for change to relocate to our headquarters in Toronto.</p>\n<p>We're hiring multiple technical roles to work in all areas of our stack. Possibilities include working on Clojure web server, backend data processing services, and both our platform API and SDK. We use PostgreSQL to store our data and don’t hide SQL behind big frameworks. We also use many other popular technologies such as RabbitMQ, Zookeeper, ElasticSearch, and Docker.</p>\n<p>For more information, visit our careers page <a href='https://www.kirasystems.com/careers' rel='nofollow'>https://www.kirasystems.com/careers</a> or email us at jobs@kirasystems.com.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "2undhwLcRAG0I5UhCTTi7w",
    "url": "https://news.ycombinator.com/item?id=20326952",
    "title": "Aclaimant | Remote | Full Stack Developer | Full-time | https://aclaimant.com Aclaimant is ...",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:clojure/other/15",
      "DBG_TECH1:k/t/w:clojurescript/other/5",
      "DBG_TECH1:techWeightMap:{python=0, other=20, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 1, 2019 6:26:40 PM",
    "validThrough": "Jul 8, 2019 6:26:40 PM",
    "crawled": "Jul 2, 2019 11:45:44 PM",
    "content": "Aclaimant | Remote | Full Stack Developer | Full-time | \n<a href='https://aclaimant.com' rel='nofollow'>https://aclaimant.com</a>\n<p>Aclaimant is looking for a senior or mid-level Clojure developer to join our team. At Aclaimant we are redefining the way companies and employees work together to manage risk. Our SaaS platform is built using Clojure and ClojureScript. We work remotely from the comfort of our own homes. Pair programming is important to us; it helps us build culture and share knowledge. We expect candidates to be located within North America. Email jobs@aclaimant.com for more information or visit <a href='https://aclaimant.com/careers-developer' rel='nofollow'>https://aclaimant.com/careers-developer</a></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "RF8GwXE9TMuPDclwelE65A",
    "url": "https://news.ycombinator.com/item?id=20329985",
    "title": "Interfolio | Software Engineer (Elixir) | Wash, DC OR Fully Remote (US) | Full Time | www ...",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:elixir/other/15",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 1, 2019 11:36:07 PM",
    "validThrough": "Jul 8, 2019 11:36:07 PM",
    "crawled": "Jul 2, 2019 11:45:44 PM",
    "content": "Interfolio | Software Engineer (Elixir) | Wash, DC OR Fully Remote (US) | Full Time | www.interfolio.com\n<p>Interfolio is a fast growing, higher ed SaaS company based in Washington, DC with 100% fully remote Engineering team, great benefits, flexible environment -- solving interesting challenges for higher ed involving software.</p>\n<p>We're seeking a talented and energetic Software Engineer with a deep understanding of Elixir to join our tight-knit team. You must be focused on producing high quality and maintainable code. This role offers a high level of creativity, and an opportunity to design the future with a company that is challenging the status quo.</p>\n<p>Apply through our site: <a href='https://jobs.lever.co/interfolio/d2ae0440-4c34-40bb-bc88-b57e521f3d34?lever-origin=applied&amp;lever-source%5B%5D=Hacker%20News%20Monthly%20Posting' rel='nofollow'>https://jobs.lever.co/interfolio/d2ae0440-4c34-40bb-bc88-b57...</a></p>\n<p>or email recruiting@interfolio.com</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "fH2Jvt69TE22Y3AwprDSUg",
    "url": "https://news.ycombinator.com/item?id=20332294",
    "title": "Immux | https://immux.com | Systems Software Engineer | Remote | Full time Immux is building an ...",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:rust/other/10",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 2, 2019 7:08:07 AM",
    "validThrough": "Jul 9, 2019 7:08:07 AM",
    "crawled": "Jul 2, 2019 11:45:44 PM",
    "content": "Immux | \n<a href='https://immux.com' rel='nofollow'>https://immux.com</a> | Systems Software Engineer | Remote | Full time\n<p>Immux is building an immutable database and a computing service that provide first-class citizen support for functional programming, versioned and auditable data operations, and automatic maintenance and tuning.</p>\n<p>We are looking for engineers to design and build the database and computing systems.</p>\n<p>Seed round from a NASDAQ-listed finance company. Salary + Equity. The whole team (uh, really the two of us) are remote.Stack: Rust and TypeScript.</p>\n<p>Get in touch: shu@immux.com</p>\n<p>(For anyone who's interested in the direction we are working towards. It's perfectly fine if you haven't written Rust or built databases before.)</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "5x-vaJ_RQDi_zFJBwfyv_g",
    "url": "https://stackoverflow.com/jobs/159703/remote-sr-elixir-engineer-surge?a=RyGsyTSXL8I",
    "title": "REMOTE Sr. Elixir Engineer at Surge  ",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:elixir/other/20",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=20, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Surge",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 30, 2019 3:06:25 AM",
    "validThrough": "Jul 7, 2019 3:06:25 AM",
    "crawled": "Jun 30, 2019 3:06:25 AM",
    "content": "<h3><span>REMOTE Sr. Elixir Engineer</span> </h3> \n<h4>About this job</h4> \n<div> \n <div> \n  <div> \n   <span>Job type: </span> \n   <span>Contract</span> \n  </div> \n  <div> \n   <span>Experience level: </span> \n   <span>Senior, Lead</span> \n  </div> \n  <div> \n   <span>Role: </span> \n   <span>Full Stack Developer</span> \n  </div> \n </div> \n <div> \n  <div> \n   <span>Industry: </span> \n   <span>Software Development</span> \n  </div> \n  <div> \n   <span>Company size: </span> \n   <span>201-500 people</span> \n  </div> \n  <div> \n   <span>Company type: </span> \n   <span>Private</span> \n  </div> \n </div> \n</div> \n<div> \n <h4>Reactions to this job</h4> \n <div> \n  <div> \n   <span>0</span> \n   <span>4</span> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n  </div> \n </div> \n <div> \n  <div> \n   <div> \n    <div></div> \n   </div> \n   <div> \n    <strong>New!</strong> How do you feel about this job listing? \n   </div> \n   <div> \n   </div> \n  </div> \n </div> \n <div></div>\n</div>\n<div>\n Company: Surge | No office location\n <br>\n</div>\n<h4>Technologies</h4>\n<div></div>\n<div>\n elixir\n</div> \n<h4>Job description</h4> \n<div>\n <p>Surge Forward is looking for a smart, self-motivated, experienced, senior-level developers to work as a long-term independent contractors.</p>\n <p>Experience Required:</p>\n <p>Senior Elixir Engineer</p>\n <p>For immediate consideration, email resume with tech stacks under jobs, and include your cell phone number and full name to: <a href='mailto:jobs@surgeforward.com' rel='nofollow'>jobs@surgeforward.com</a></p> \n</div> \n<div> \n <a href='https://stackoverflow.com/jobs/apply/159703?reset=False&amp;ra=RyGsyTSXL8I&amp;oqs=a%3DRyGsyTSXL8I' rel='nofollow'>Apply now</a>\n</div> \n<h4>About Surge</h4> \n<div>\n <p>Surge is an onshore provider of custom web, cloud, mobile, digital, and desktop software development and consulting services to clients in every industry, from hot startups to Fortune 500 companies.<br><br>Founded in 2007, and listed on the Inc. 5000 list of America’s fastest growing companies for five straight years, Surge has successfully delivered hundreds of software products, apps, and solutions to its clients using a proven agile/scrum development process combined with an elite group of North American software professionals.<br><br>Simply put, Surge offers America’s best software engineers, on demand, at rates 30-50% less than the competition.</p> \n</div> \n<h4>Benefits</h4> \n<ul> \n <li> <span></span> <span>Great Pay</span> </li> \n <li> <span></span> <span>Choose Your Hours</span> </li> \n <li> <span></span> <span>Work From Home</span> </li> \n <li> <span></span> <span>Work With Happy People</span> </li> \n <li> <span></span> <span>Zero Commute</span> </li> \n <li> <span></span> <span>See Your Family More</span> </li> \n <li> <span></span> <span>Travel While You Work</span> </li> \n <li> <span></span> <span>Software Provided</span> </li> \n</ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "XQIj09nHQ8SwvskQXURPgA",
    "url": "https://jobmote.com/job/45482/iam-engineer-identitynow-remote-usa/",
    "title": "IAM Engineer (IdentityNow) Remote, USA",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:bash/other/1",
      "DBG_TECH1:k/t/w:perl/other/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=2, other=6, dotnet=8, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet",
      "other"
    ],
    "hiringOrganization": {
      "name": "Optiv",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 29, 2019 10:07:13 PM",
    "validThrough": "Jul 6, 2019 10:07:13 PM",
    "crawled": "Jun 30, 2019 3:06:25 AM",
    "content": "<div>\n Company Description At Optiv, we re on a mission to help our clients make their businesses more secure. We re one of the fastest growing companies in a truly essential industry. In your role at Optiv, you ll be inspired by a team of the brightest business and technical minds in cyber security. We are passionate champions for our clients, and know from experience that the best solutions for our clients needs come from working hard together. As part of our team, your voice matters, and you will do important work that has impact, on people, businesses and nations. Our industry and our company move fast, and you can be sure that you will always have room to learn and grow. We re proud of our team and the important work we do to build confidence for a more connected world. Job Description IT Security is fast growing market rife with career opportunities and Optiv is positioned as the largest IT security services company in the country! All practices at Optiv have enjoyed tremendous growth with the IAM practice leading the expansion. Optiv is seeking a full-time Support Engineer in Overland Park, KS to work on our Managed Services team with a focus on Identity and Access Management (IAM) products. This individual will be responsible for Administration, management and support of the IAM products, such as CyberArk and SailPoint. This will include Identity Governance Access Management Privileged Access Management Password Management Collecting logs, analyzing failure conditions, troubleshooting issuesincidents Performing discovery audits and environment health checks, and presenting findings to client management Implementing known solutions as well as providing and creating new solutions Creation of customer deliverables Contributions to Knowledge Base Article Keeping clear communications open to all affected parties involved both internal to Optiv as well as affected customers. Qualifications The optimal candidate will have 3-5 years experience in the following Understanding the use, configuration and best practices of user access, authentication, and authorization Strong ADLDAP experience (understanding and configuration) Experience with Windows Server OS deployment and administration Proficiency with Rest API s Scripting skills (PowerShell, Python, Ruby, PERL, bash, etc) Understanding command line, and configuration of UnixLinux operating systems Familiarity with diagnostic tools and analyzing data, log interpretation, and packet analysis Familiarity with network devices and architecture Strong written and verbal communication skills Comfortable presenting to upper management and clients Strong situation and escalation management skills Strong time management skills Desire to learn the security methodology as it applies to Identity and Access Management (IAM) Pre-existing U.S. Government security clearance is a plus. Why you ll love it here If you are seeking a culture that supports growth, fosters success and moves the industry forward, find your place at Optiv! Optiv s mission is to deliver comprehensive, integrated cybersecurity programs to optimize customer security programs to be more effective, efficient, manageable and measurable. Our aim is to become the world s largest cybersecurity solutions integrator by leveraging our expertise in security technology, market-leading services, and innovative approaches. We have served more than 12,000 clients of various sizes across multiple industries, we offer an extensive geographic footprint, and have premium partnerships with more than 350 of the leading security product manufacturers. Optiv is a privately-held company backed by KKR, a leading global private equity firm. With Optiv you can expect An entrepreneurial and collaborative environment A competitive total rewards program Professional training opportunities Engaging and fun culture Opportunity to work with industry leading, talented peers\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "hn_lina6Q3CxmOIDfqOyyQ",
    "url": "https://jobmote.com/job/44539/sr-servicenow-developer-100-remote/",
    "title": "Sr. ServiceNow Developer - 100% Remote",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``choos 5W locat",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:perl/other/5",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=5, mobile=1, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=5, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/other",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "other",
      "php"
    ],
    "hiringOrganization": {
      "name": "Nelson Frank",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 27, 2019 10:07:22 PM",
    "validThrough": "Jul 4, 2019 10:07:22 PM",
    "crawled": "Jun 28, 2019 3:06:25 AM",
    "content": "<div>\n <b>ServiceNow Senior Developer - 100% Remote - ServiceNow Gold Partner</b>\n <br> Join a rapidly growing ServiceNow Gold partner with both federal and enterprise contracts. A 100% remote position that gives you the freedom to choose location, lifestyle, and workplace each day. With experience in ServiceNow partner companies previously, the management has stressed independence for each employee and is very flexible with many points of the position. A strong independent personality who is looking to push themselves professionally is going to do great with our client.\n <br>\n <b>Responsibilities</b>\n <ul>\n  <li>Resolve complex bugs/defects</li>\n  <li>Resolve any security issues within the ServiceNow platform</li>\n  <li>Resolve high-impact issues affecting ServiceNow performance</li>\n  <li>Create a release management process within ServiceNow and formalize necessary roles and processes to track development and testing of enhancements and defects</li>\n  <li>Document current incident management processes to compare with best practices and build incident management requirements</li>\n </ul>\n <b>Requirements</b>\n <ul>\n  <li>Extensive knowledge and experience supporting the implementation, administration, configuration, and/or development of an ITSM tool.</li>\n  <li>Multiple years in ServiceNow development - experience should include scripting, tool configuration, design work, technical configuration, and deployment; specifically, candidates shall possess the skill to develop on the ServiceNow platform including the creation and/or customization of the core applications</li>\n  <li>JavaScript, PHP, C, Java, Perl, HTML or HTML 5 coding experience</li>\n </ul>\n <b>Preferred Skills</b>\n <ul>\n  <li>ITIL Foundations Certification</li>\n  <li>ServiceNow system Admin Certification</li>\n  <li>ServiceNow Implementation Specialist Certification</li>\n  <li>ServiceNow Application Developer Certification</li>\n </ul> Are you interested in new development techniques that will challenge you on a daily basis? Do you enjoy remote work? This could be the perfect position for you. Nelson Frank has received a large amount of interest in this position and it will be competitive. If you see yourself in this position give yourself the opportunity to join this client.\n <br>\n <br>ServiceNow, Service Now, Service-Now, ITIL, ITSM\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Iq9o5ZB0Q9-qfkL4DcL1ZQ",
    "url": "https://stackoverflow.com/jobs/276879/senior-lead-application-engineer-kolanz-consulting?a=1uR6SKa44qGc",
    "title": "Senior Lead Application Engineer at Kolanz Consulting  ",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:elixir/other/10",
      "DBG_TECH1:k/t/w:macos/apple/2",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=4, apple=2, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Kolanz Consulting",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 90000,
      "maxValue": 150000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "USD 90k - 150k /Year"
    },
    "employmentType": "UNSET",
    "published": "Jun 26, 2019 2:06:23 AM",
    "validThrough": "Jul 3, 2019 2:06:23 AM",
    "crawled": "Jun 26, 2019 2:06:23 AM",
    "content": "<h3><span>Senior Lead Application Engineer</span> </h3> \n<h4>About this job</h4> \n<div> \n <div> \n  <div> \n   <span>Job type: </span> \n   <span>Full-time</span> \n  </div> \n  <div> \n   <span>Experience level: </span> \n   <span>Senior, Lead, Manager</span> \n  </div> \n  <div> \n   <span>Role: </span> \n   <span>Full Stack Developer</span> \n  </div> \n </div> \n <div> \n  <div> \n   <span>Industry: </span> \n   <span>Computer Software, Enterprise Web Solutions, Recruiting</span> \n  </div> \n  <div> \n   <span>Company size: </span> \n   <span>1-10 people</span> \n  </div> \n  <div> \n   <span>Company type: </span> \n   <span>Private</span> \n  </div> \n </div> \n</div> \n<div> \n <h4>Reactions to this job</h4> \n <div> \n  <div> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n  </div> \n </div> \n <div> \n  <div> \n   <div> \n    <div></div> \n   </div> \n   <div> \n    <strong>New!</strong> How do you feel about this job listing? \n   </div> \n   <div> \n   </div> \n  </div> \n </div> \n <div></div>\n</div>\n<div>\n Company: Kolanz Consulting | No office location\n <br>\n</div> \n<h4>Remote details</h4> \n<div> \n <div> \n  <div> \n   <span>Preferred Timezone:</span> \n   <span>(GMT-05:00) Eastern Time +/- 2 hours</span> \n  </div> \n </div> \n</div> \n<h4>Technologies</h4>\n<div></div>\n<div>\n amazon-web-services\n</div>\n<div>\n linux\n</div>\n<div>\n postgresql\n</div>\n<div>\n ruby\n</div>\n<div>\n elixir\n</div> \n<h4>Job description</h4> \n<div>\n <p>Kolanz Consulting has a limited number of <strong>full-time, direct-hire Software Architecture </strong>openings. You would be an Architect on our client’s <strong><em>Core Platform</em></strong> team, building innovative cloud-based solutions for the Incentive and Rewards industry.</p>\n <p>In the last year, this 100% privately owned non-VC company realized <em>tens of millions</em> in annual revenue and earned Inc. Magazine’s recognition as one of the fastest growing companies for the 11th year in a row.</p>\n <p><strong>Positions and Salary Range</strong></p>\n <ul>\n  <li>Sr. Software Developer ($95k - $105k)</li>\n  <li>Principal Software Architect ($115k - $145k)</li>\n </ul>\n <p><strong>What does this team care about? </strong></p>\n <ul>\n  <li>Software craftsmanship and code quality</li>\n  <li>Open, honest, and tactful communication</li>\n  <li>Personal and professional growth</li>\n </ul>\n <p><strong>Their all-new tech stack is based on:</strong></p>\n <ul>\n  <li>AWS</li>\n  <li>Linux</li>\n  <li>PostgreSQL</li>\n  <li>Ruby and Elixir</li>\n  <li>DevOps best practices including tools like CloudFormation, Terraform, and Ansible</li>\n </ul>\n <p><strong>Why work with them?</strong></p>\n <ul>\n  <li>Full health, life, vision, dental, and 401(k) benefits</li>\n  <li>Flexible hours and four weeks annually of combined PTO and personal time</li>\n  <li>Annual performance-based bonuses and raises</li>\n  <li>Modern multi-screen MacOS workstations</li>\n  <li>Opportunity to work directly with an engaged and supportive ownership</li>\n  <li>Solve interesting problems on large, distributed systems</li>\n  <li>Realistic project plans based on sustainable pace and true 40-hour work weeks</li>\n  <li>Coworkers who are passionate about modern, maintainable solutions</li>\n  <li>Flexible continuing education program including financial support for conferences, books, and classes</li>\n </ul> \n</div> \n<div> \n <a href='https://stackoverflow.com/jobs/apply/276879?reset=False&amp;ra=1uR6SKa44qGc&amp;oqs=a%3D1uR6SKa44qGc' rel='nofollow'>Apply now</a>\n</div>\n<div> \n</div> \n<h4>About Kolanz Consulting</h4> \n<div>\n <p>Kolanz Consulting is a boutique staffing agency that specializes&nbsp;in the technology + manufacturing (ISO/TS/DOD) space. We pride ourselves in selectively matching the right candidates with small-midsize technology companies throughout the country.&nbsp;</p> \n</div> \n<h4>Benefits</h4> \n<ul> \n <li> <span></span> <span>Competitive Base Salary</span> </li> \n <li> <span></span> <span>Comprehensive Benefits Package</span> </li> \n <li> <span></span> <span>401k with company match</span> </li> \n <li> <span></span> <span>Subsidized training &amp; education expenses</span> </li> \n</ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "mI2IDTmKT9myPGD4uuVWbA",
    "url": "https://remote.co/job/backend-engineer-16/",
    "title": "Backend Engineer",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:scala/java/3",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=2, other=5, dotnet=0, c=0, mobile=0, go=0, nodejs=2, bigdata-ml=2, ruby=0, apple=0, java=3, gamedev=0, php=5, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/other",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other",
      "php"
    ],
    "hiringOrganization": {
      "name": "Elevio",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 21, 2019 6:17:51 PM",
    "validThrough": "Jun 28, 2019 6:17:51 PM",
    "crawled": "Jun 21, 2019 6:24:53 PM",
    "content": "<h3>Backend Engineer at <span>Elevio</span></h3>\n<div>\n <span><i></i> Remote</span> | \n <span> International </span>\n</div>\n<div> \n <p><strong>Full Time</strong></p>\n <p><strong>Engineering</strong></p>\n <p><strong>Anywhere (Remote)</strong></p>\n <p><strong>About Elevio</strong><br>Elevio is a SaaS platform that makes it easy to create, deliver and improve help content to drive customer education. Our aim is to allow end users to help themselves so our customers can focus on what they do best.<br>We’re a well-funded and fast-growing startup with over 500 global customers including AccuWeather, TripAdvisor, Atlassian and eBay. We’re currently looking for someone to contribute to key parts of our platform and vision.<br>Working as a backend engineer here will mean your work will load close to a billion times every month, and growing!</p>\n <p><strong>As a backend engineer you’ll:</strong></p>\n <ul>\n  <li>Design and build REST, GraphQL and gRPC APIs that can handle 500 concurrent requests and beyond</li>\n  <li>Work on streaming data pipelines to handle real-time user interactions</li>\n  <li>Automate deployment pipelines and maintenance tasks to maintain and improve our 99.9% availability</li>\n  <li>Write and fine tune database queries to mine data from half a billion records</li>\n  <li>Use cutting-edge informative retrieval (IR) and natural language processing (NLP) concepts to recommend relevant content</li>\n  <li>Be a part of the team: do code reviews, mentor others, refactor code and share knowledge</li>\n  <li>Help and assist other team members to solve problems either internal or customer facing</li>\n </ul>\n <p><strong>What we’re looking for:</strong></p>\n <ul>\n  <li>Experience building and maintaining interactive and real-time web applications</li>\n  <li>Experience with, or an interest in, Scala, Elixir and Python</li>\n  <li>Experience with cloud technologies like AWS, GCP or Azure</li>\n  <li>Familiarity with container technologies such as Docker, ECS and Kubernetes</li>\n  <li>Fluency or understanding of database technologies like Postgres, ElasticSearch, DynamoDB, Redis and Redshift</li>\n  <li>Fluency in best-practice software development</li>\n  <li>Experience with automated testing and continuous integration</li>\n  <li>Dedication to not only maintaining but also improving system reliability and performance</li>\n  <li>Strong product sense to contribute back to product improvements</li>\n </ul>\n <p>We’re looking for someone who not only can get the job done but also challenge the status quo and constantly look for better ways to enhance customer success and also internally within our team.</p>\n <p><strong>Bonus points:</strong></p>\n <ul>\n  <li>Working knowledge of PHP</li>\n  <li>Experience with ETL and building data pipelines</li>\n  <li>Knowledge of various API standards such as REST, GraphQL, gRPC and Thrift</li>\n  <li>Experience or interest in natural language processing (NLP) and machine learning</li>\n  <li>Fluency or understanding of frontend TypeScript/JavaScript</li>\n </ul>\n <p><strong>What you get from us</strong></p>\n <ul>\n  <li>Competitive salary and equity</li>\n  <li><strong>Flexible work options that suit you</strong></li>\n  <li>Direct involvement in determining the direction of the product</li>\n  <li>Time and support for your own learning (e.g. conferences, code camps, workshops, books, etc)</li>\n  <li>Tools you need to get the job done</li>\n  <li>Monthly lunches, always-stocked drinks fridge and a few other nice perks (If you are in Melbourne)</li>\n </ul> \n</div>\n<div> \n <a href='https://elev.io/careers/backend-engineer' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "nwvy_jJuTaucQzKVgK_QRQ",
    "url": "https://weworkremotely.com/remote-jobs/elevio-backend-engineer-scala-elixir-python",
    "title": "Elevio: Backend Engineer (Scala, Elixir, Python)",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:elixir/other/15",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:python/python/6",
      "DBG_TECH1:k/t/w:scala/java/9",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=6, other=15, dotnet=0, c=0, mobile=0, go=0, nodejs=3, bigdata-ml=2, ruby=0, apple=0, java=9, gamedev=0, php=5, embedded=0, frontend=3}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "NashFull-TimeRemoteModulzFull-TimeAnywhereArticulateFull-TimeNorth America",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 20, 2019 10:00:35 AM",
    "validThrough": "Jun 27, 2019 10:00:35 AM",
    "crawled": "Jun 20, 2019 10:06:28 AM",
    "content": "<h3> Backend Engineer (Scala, Elixir, Python) </h3>\n<div>\n <div>\n  <strong>About Elevio</strong>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  Elevio is a SaaS platform that makes it easy to create, deliver and improve help content to drive customer education. Our aim is to allow end users to help themselves so our customers can focus on what they do best.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  We're a well-funded and fast-growing startup with over 500 global customers including AccuWeather, TripAdvisor, Atlassian and eBay. We're currently looking for someone to contribute to key parts of our platform and vision.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  Working as a backend engineer here will mean your work will load close to \n  <strong>a billion times every month</strong>, and growing!\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <strong>As a backend engineer you'll:</strong>\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li>Design and build REST, GraphQL and gRPC APIs that can handle 500 concurrent requests and beyond</li>\n  <li>Work on streaming data pipelines to handle real-time user interactions</li>\n  <li>Automate deployment pipelines and maintenance tasks to maintain and improve our 99.9% availability</li>\n  <li>Write and fine tune database queries to mine data from half a billion records</li>\n  <li>Use cutting-edge informative retrieval (IR) and natural language processing (NLP) concepts to recommend relevant content</li>\n  <li>Be a part of the team: do code reviews, mentor others, refactor code and share knowledge</li>\n  <li>Help and assist other team members to solve problems either internal or customer facing</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <strong>What we're looking for:</strong>\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li>Experience building and maintaining interactive and real-time web applications</li>\n  <li>Experience with, or an interest in, Scala, Elixir and Python</li>\n  <li>Experience with cloud technologies like AWS, GCP or Azure</li>\n  <li>Familiarity with container technologies such as Docker, ECS and Kubernetes</li>\n  <li>Fluency or understanding of database technologies like Postgres, ElasticSearch, DynamoDB, Redis and Redshift</li>\n  <li>Fluency in best-practice software development</li>\n  <li>Experience with automated testing and continuous integration</li>\n  <li>Dedication to not only maintaining but also improving system reliability and performance</li>\n  <li>Strong product sense to contribute back to product improvements</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  We're looking for someone who not only can get the job done but also challenge the status quo and constantly look for better ways to enhance customer success and also internally within our team.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <strong>Bonus points:</strong>\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li>Working knowledge of PHP</li>\n  <li>Experience with ETL and building data pipelines</li>\n  <li>Knowledge of various API standards such as REST, GraphQL, gRPC and Thrift</li>\n  <li>Experience or interest in natural language processing (NLP) and machine learning</li>\n  <li>Fluency or understanding of frontend TypeScript/JavaScript</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <strong>What you get from us</strong>\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li>Competitive salary and equity</li>\n  <li>Flexible work options that suit you</li>\n  <li>Direct involvement in determining the direction of the product</li>\n  <li>Time and support for your own learning (e.g. conferences, code camps, workshops, books, etc)</li>\n  <li>Tools you need to get the job done</li>\n  <li>Monthly lunches, always-stocked drinks fridge and a few other nice perks (If you are in Melbourne)</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  If you're interested, \n  <strong>even if you don't tick all the boxes</strong> we would love to talk to you!\n </div>\n <div>\n  <br>\n </div>\n <div>\n  Elevio is an equal opportunity company dedicated to welcoming applicants from any location, race, age, gender, sexual orientation and socio-economic background.\n </div>\n</div>\n<div>\n <h4> Related Jobs <span><a rel='nofollow'> See more Programming jobs<span>→</span></a></span></h4>\n <ul>\n  <li><span>New</span>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>Nash</span><br><span>Senior Frontend Engineer</span><span>featured</span><br><span>Full-Time</span><span>/</span><span>Remote</span></a></li>\n  <li><span>New</span>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>Modulz</span><br><span>Full-stack JavaScript Engineer</span><span>featured</span><br><span>Full-Time</span><span>/</span><span>Anywhere</span></a></li>\n  <li><span>New</span>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>Articulate</span><br><span>Full-Stack Software Engineer</span><span>featured</span><br><span>Full-Time</span><span>/</span><span>North America</span></a></li>\n </ul>\n <br>\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "KbaVkgOKQRSpc80dCWf6wg",
    "url": "https://remoteok.io/jobs/73459",
    "title": "Senior Elixir Developer",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:elixir/other/20",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=20, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/50",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Avocado Green Brands",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 18, 2019 10:15:13 PM",
    "validThrough": "Jun 25, 2019 10:15:13 PM",
    "crawled": "Jun 18, 2019 10:30:38 PM",
    "content": "<span><h3>Senior Elixir Developer</h3></span> \n<br> \n<span><h4>Avocado Green Brands</h4></span> \n<div> \n <div> \n  <br>Avocado is an innovative lifestyle and eco-luxury brand, fueled by green living, sustainability, authenticity, social responsibility and remarkable customer experiences. We make mattresses and bedding products by hand in California using the finest natural and organic materials. \n  <br> \n  <br>We're seeking a talented and energetic Senior Software Developer - proficient in Elixir or FP languages - to join our tight-knit team. You must be focused on producing high quality and maintainable code. This role offers a high level of creativity, and an opportunity to design the future with a company that is challenging the status quo. \n  <br> \n  <br>Requirements: \n  <br> \n  <br> \n  <br>* 7+ years developing large-scale web / e-commerce applications \n  <br> \n  <br>* Production experience with Elixir/Phoenix, or a similar FP language \n  <br> \n  <br>* Full stack capabilities with a focus on performance, security and maintainability \n  <br> \n  <br>* Ability to collaborate and work well on a small agile team \n  <br> \n  <br>* Passionate, self motivated, pragmatic, goal-oriented, sense of humor :P \n  <br> \n  <br>* Infrastructure/server management (AWS) a plus \n  <br> \n  <br>* Experience with React a plus \n  <br> \n  <br>* Experience with data warehousing a plus \n  <br> \n  <br>* Experience with big data a plus \n  <br> \n  <br> \n  <br> \n  <br> \n  <br>Perks: \n  <br> \n  <br> \n  <br>* Fun, innovative culture \n  <br> \n  <br>* Ability to work remotely or on location at our offices in Hoboken and DTLA \n  <br> \n  <br>* Health, dental, vision \n  <br> \n  <br>* Travel and accommodations for technology / team building events \n  <br> \n  <br>* Company laptop \n  <br> \n  <br> \n  <br> \n </div> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "DhmFbAX3TVOkGP1Q83TjRg",
    "url": "https://stackoverflow.com/jobs/274386/senior-elixir-developer-on-site-or-remote-avocado-green-brands?a=1u1h0GO7nTWw",
    "title": "Senior Elixir Developer (On-site or Remote) at Avocado Green Brands  ",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:elixir/other/25",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:techWeightMap:{python=0, other=25, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=17}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Avocado Green Brands",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 140000,
      "maxValue": 165000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "USD 140k - 165k /Year"
    },
    "employmentType": "UNSET",
    "published": "Jun 18, 2019 5:06:29 PM",
    "validThrough": "Jun 25, 2019 5:06:29 PM",
    "crawled": "Jun 18, 2019 5:06:29 PM",
    "content": "<h3><span>Senior Elixir Developer (On-site or Remote)</span> </h3> \n<h4>About this job</h4> \n<div> \n <div> \n  <div> \n   <span>Job type: </span> \n   <span>Full-time</span> \n  </div> \n  <div> \n   <span>Experience level: </span> \n   <span>Senior</span> \n  </div> \n  <div> \n   <span>Role: </span> \n   <span>Full Stack Developer</span> \n  </div> \n </div> \n <div> \n  <div> \n   <span>Industry: </span> \n   <span>Furniture, Manufacturing, wellness</span> \n  </div> \n  <div> \n   <span>Company size: </span> \n   <span>201-500 people</span> \n  </div> \n  <div> \n   <span>Company type: </span> \n   <span>Private</span> \n  </div> \n </div> \n</div> \n<div>\n Company: Avocado Green Brands | No office location\n <br>\n</div> \n<h4>Remote details</h4> \n<div> \n <div> \n  <div> \n   <span>Preferred Timezone:</span> \n   <span>(GMT-05:00) Eastern Time +/- 4 hours</span> \n  </div> \n </div> \n</div> \n<h4>Technologies</h4>\n<div></div>\n<div>\n elixir\n</div>\n<div>\n phoenix-framework\n</div>\n<div>\n reactjs\n</div>\n<div>\n javascript\n</div>\n<div>\n amazon-web-services\n</div> \n<h4>Job description</h4> \n<div>\n <p>Avocado is an innovative lifestyle and eco-luxury brand, fueled by green living, sustainability, authenticity, social responsibility and remarkable customer experiences. We make mattresses and bedding products by hand in California using the finest natural and organic materials.</p>\n <p>We're seeking a talented and energetic Senior Software Developer - proficient in Elixir or FP languages - to join our tight-knit team. You must be focused on producing high quality and maintainable code. This role offers a high level of creativity, and an opportunity to design the future with a company that is challenging the status quo.</p>\n <p><strong>Requirements</strong>:</p>\n <ul>\n  <li>7+ years developing large-scale web / e-commerce applications</li>\n  <li>Production experience with Elixir/Phoenix, or a similar FP language</li>\n  <li>Full stack capabilities with a focus on performance, security and maintainability</li>\n  <li>Ability to collaborate and work well on a small agile team</li>\n  <li>Passionate, self motivated, pragmatic, goal-oriented, sense of humor :P</li>\n  <li>Infrastructure/server management (AWS) a plus</li>\n  <li>Experience with React a plus</li>\n  <li>Experience with data warehousing a plus</li>\n  <li>Experience with big data a plus</li>\n </ul>\n <p><strong>Perks</strong>:</p>\n <ul>\n  <li>Fun, innovative culture</li>\n  <li>Ability to work remotely or on location at our offices in Hoboken and DTLA</li>\n  <li>Health, dental, vision</li>\n  <li>Travel and accommodations for technology / team building events</li>\n  <li>Company laptop</li>\n </ul> \n</div> \n<div> \n <a href='https://stackoverflow.com/jobs/apply/274386?reset=False&amp;ra=1u1h0GO7nTWw&amp;oqs=a%3D1u1h0GO7nTWw' rel='nofollow'>Apply now</a>\n</div>\n<div> \n</div> \n<h4>About Avocado Green Brands</h4> \n<div>\n <p>Avocado is home to a small, tight-knit software engineering team that is helping shape the future of our business with technology. Our responsibilities range from internal systems development to designing and maintaining our high-profile e-commerce website. We're always exploring new ways in which we can have solve problems, better serve our team and customers, and advance our mission.&nbsp; &nbsp;</p> \n</div> \n<h4>Benefits</h4> \n<ul> \n <li> <span></span> <span>Health</span> </li> \n <li> <span></span> <span>Dental</span> </li> \n <li> <span></span> <span>Vision</span> </li> \n <li> <span></span> <span>Flex hours</span> </li> \n <li> <span></span> <span>Macbook Pro</span> </li> \n <li> <span></span> <span>Mission-driven</span> </li> \n <li> <span></span> <span>Fun crew!</span> </li> \n</ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "lDiC8CEET7KXqutw5i_3Pg",
    "url": "https://stackoverflow.com/jobs/274309/software-engineer-elixir-client-services-team-bluelabs-software?a=1tZFKfoFBL4A",
    "title": "Software Engineer (Elixir) - Client Services Team at BlueLabs Software  ",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``OR(europ, european, europeanunion) 3W OR(timezon,time)",
      "DBG_TECH1:k/t/w:distributed-computing/bigdata-ml/8",
      "DBG_TECH1:k/t/w:elixir/other/25",
      "DBG_TECH1:k/t/w:frontend-developer/frontend/13",
      "DBG_TECH1:techWeightMap:{python=0, other=25, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=13}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "BlueLabs Software",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "EUR",
      "minValue": 55000,
      "maxValue": 75000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "EUR 55k - 75k /Year"
    },
    "employmentType": "UNSET",
    "published": "Jun 18, 2019 12:06:30 PM",
    "validThrough": "Jun 25, 2019 12:06:30 PM",
    "crawled": "Jun 18, 2019 12:06:30 PM",
    "content": "<h3><span>Software Engineer (Elixir) - Client Services Team</span> </h3> \n<h4>About this job</h4> \n<div> \n <div> \n  <div> \n   <span>Job type: </span> \n   <span>Full-time</span> \n  </div> \n  <div> \n   <span>Experience level: </span> \n   <span>Mid-Level</span> \n  </div> \n  <div> \n   <span>Role: </span> \n   <span>Backend Developer, Full Stack Developer</span> \n  </div> \n </div> \n <div> \n  <div> \n   <span>Industry: </span> \n   <span>Enterprise Web Solutions, Gaming, Software Development / Engineering</span> \n  </div> \n  <div> \n   <span>Company size: </span> \n   <span>1-10 people</span> \n  </div> \n  <div> \n   <span>Company type: </span> \n   <span>Private</span> \n  </div> \n </div> \n</div> \n<div> \n <h4>Reactions to this job</h4> \n <div> \n  <div> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n  </div> \n </div> \n <div> \n  <div> \n   <div> \n    <div></div> \n   </div> \n   <div> \n    <strong>New!</strong> How do you feel about this job listing? \n   </div> \n   <div> \n   </div> \n  </div> \n </div> \n <div></div>\n</div>\n<div>\n Company: BlueLabs Software | No office location\n <br>\n</div>\n<h4>Technologies</h4>\n<div></div>\n<div>\n elixir\n</div>\n<div>\n functional-programming\n</div>\n<div>\n concurrency\n</div>\n<div>\n distributed-computing\n</div>\n<div>\n is-serp 86 1 9\n</div>\n<div>\n pietro909 Frontend Developer 1.4k 14 24\n</div>\n<div>\n Laurynas Tretjakovas 571 2 11\n</div>\n<div>\n Enrique Fernández Casado 1 1\n</div> \n<h4>Job description</h4> \n<div>\n <p>A few months ago we started out with the vision of building a next generation sports betting platform focused on performance, reliability, modularity and automation. We believe that our experience paired with today’s technologies, great talent and the agility of a startup environment will enable us to deliver a best-in-class product that meets the demands of the market of tomorrow.</p>\n <p>Our Client Services Team is now on the lookout for an experienced Software Engineer who wants to join our distributed team and help us execute our vision.</p>\n <p><strong>The Team</strong></p>\n <p>The Client Domain is all about innovation. Here we shape our products to satisfy the needs of our heterogeneous customer base. To achieve this you will collaborate closely with the Frontend Engineers of the Client Team to design and implement bespoke APIs and services that will be used by our different products and brands.&nbsp;</p>\n <p>The Client Services Team is tasked with the development of all backend services &nbsp;client applications, i.e. primarily the &nbsp;API Gateway of our platform but also client-related services such as authentication, internationalisation or content management and other backend services that allow us to provide a unique experience to a specific segment of our users. Being our platform’s gateway to the outside world, scalability and responsiveness is of utmost importance in the Client Domain. It is worth noting that the traffic pattern of our platform will not only be dictated by the sporting calendar but also by the sometimes unpredictable behaviour of our users.&nbsp;</p>\n <p>By joining our team you will be working primarily in Elixir but you will also influence the full lifecycle of our software, starting with architectural and design decisions, all the way to the implementation, testing and monitoring of the resulting services.</p>\n <p><strong>Remote Work</strong></p>\n <p>We are hiring for talent, not for a specific location. You will find that members of our team are distributed all over Europe. Being a distributed team enables us to hire only the best, without being restricted to the talent pool available at a specific geographic location. However, to facilitate team communication and collaboration we currently require you to be located in a European time zone (between UTC-1 and UTC+3). You must also be able to travel to other European locations a few times a year for on-site meetings and workshops.</p>\n <p><strong>Compensation</strong></p>\n <p>The budgeted compensation range for this role is €55k-75k annually, depending on your background and experience. As an independent contractor you will be responsible for paying any taxes or applicable fees in your country of residence (unless you are based in Malta, in which case you will be employed).&nbsp;In addition to that, we offer a number of&nbsp;<a href='https://careers.bluelabs.eu/#section-127563' rel='nofollow'>perks</a>&nbsp;to each of our team members as we truly believe in a healthy work-life balance and continuous learning.</p>\n <p><strong>Requirements</strong></p>\n <ul>\n  <li><p>3+ years of professional software development experience, with at least 1 years of professional experience using Elixir</p></li>\n  <li><p>Good knowledge of functional and concurrent programming, as well as distributed systems</p></li>\n  <li><p>Good knowledge of microservice architecture, message-based communication and stream processing</p></li>\n  <li><p>Interest in test automation, cloud and containerization technologies, code instrumentation and CI/CD pipelines</p></li>\n  <li><p>Interest in taking full ownership of your services including managing them in a production environment</p></li>\n  <li><p>Interest in keeping yourself up to date and learning new languages, frameworks and technologies as required</p></li>\n  <li><p>Product-oriented mindset and eagerness to take part in shaping the products we build</p></li>\n  <li><p>Ability to work autonomously in a fully distributed team</p></li>\n  <li><p>Good communication skills in verbal and written English</p></li>\n </ul> \n</div> \n<div> \n <a href='https://careers.bluelabs.eu/o/software-engineer-elixir/c/new?source=Stack%20Overflow&amp;utm_source=stack_overflow&amp;utm_medium=job&amp;utm_campaign=client_elixir' rel='nofollow'> Apply now </a>\n</div> \n<h4>Benefits</h4> \n<ul> \n <li> <span></span> <span>Distributed Team, enabling us to hire Europe's best talents</span> </li> \n <li> <span></span> <span>Work only with the latest technologies</span> </li> \n <li> <span></span> <span>Use the best tools and resources money can buy</span> </li> \n <li> <span></span> <span>Regular onsite meetings across Europe</span> </li> \n <li> <span></span> <span>Competitive Compensation</span> </li> \n <li> <span></span> <span>Personal Development Allowance of €1,000 annually</span> </li> \n <li> <span></span> <span>Co-Working Space &amp; Home Office Allowances</span> </li> \n <li> <span></span> <span>Flexible working hours and time-off policy</span> </li> \n <li> <span></span> <span>Monthly wellbeing allowance for Gym Membership, Massages etc.</span> </li> \n</ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "YfH2k_vbTGmmZVhHg3ehoA",
    "url": "http://workinstartups.com/job-board/job/81470/midweightsenior-perl-developer-london-or-remote-europe-at-adzuna/",
    "title": "Midweight/Senior Perl Developer - London or Remote Europe",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:lucene/java/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/6",
      "DBG_TECH1:k/t/w:perl/other/20",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=20, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=14, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "other"
    ],
    "hiringOrganization": {
      "name": "Adzuna",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 14, 2019 4:53:19 PM",
    "validThrough": "Jun 21, 2019 4:53:19 PM",
    "crawled": "Jun 14, 2019 6:23:25 PM",
    "content": "*Midweight/Senior Perl Developer - London or Remote Europe*\n<br>\n<br>\n<br>Adzuna is a job search engine that lists every job, everywhere. From launch in the UK in 2011, we now have more than 11 million visitors a month and are busy conquering the world from our office in West London. Right now, we're seeking an experienced Perl Developer to join our world-class tech team in helping millions of people find better, more fulfilling jobs.\n<br>\n<br>Our engineering and product teams are pivotal to Adzuna's future. It's an exciting time as we scale our existing product offering and also innovate with new tools and user experiences that 'surprise and delight' our audience, like ValueMyCV, which we're really proud of. Our infrastructure is built around industry-standard open-source tools and runs on distributed clusters, supporting 16 internationalised Adzuna websites, as well as the 'Find a job' portal that we run on behalf of the UK Government.\n<br>\n<br>\n<br>Based in our great Fulham office, (or remotely) you will work with a smart team of back end, dev/ops, data science/machine learning and product specialists, overseeing all aspects of our operations, ranging from powering our international websites, aggregating classifieds from thousands of external sources, to crunching job market data to power our statistics and applying machine learning algorithms to enhance job seekers’ experience.\n<br>\n<br>\n<br>At Adzuna you will work independently in a fast-moving, low-structure environment where you will have the opportunity to help shape our technical direction and processes as we grow. An appreciation of the ‘DevOps’ movement is essential as we manage and monitor the systems ourselves. Vitally, you’ll value the importance of building structured code that is fast, scalable, reliable and robust.\n<br>\n<br>\n<br>The projects you will work on will include new search features, relevancy and matching algorithms, APIs and ‘big data’ analysis, reporting tools and features to enhance the job search experience on Adzuna. Our systems have been built to scale, and you will be able to demonstrate your experience in writing scalable code running in distributed environments.\n<br>\n<br>\n<br>Our opportunity offers the chance to build something to be proud of, whilst becoming a part of one of the fastest growing businesses in Europe. We offer a supportive working environment, with an emphasis on team-working, mentoring and training. It's fun and fast moving. Join us!\n<br>\n<br>\n<br>\n<br>*About you:*\n<br>\n<br>We don't like to put people in boxes, but you're likely to be able to demonstrate much of the below:\n<br>\n<br>Experience in partnering with other developers and data scientists to improve existing systems and develop new functionality and tools\n<br>Able to analyse business and technical requirements and develop solutions, taking into account variable aspects, such as performance, scalability, ease of maintenance and cost.\n<br>Proven ability to help refactor existing processes and workflows to improve efficiency\n<br>Experienced in interested in participating in R&amp;D of new technology trends and tools\n<br>Passion for, or ambition to, assist and mentor other members of our development team\n<br>\n<br>*Technical competency and tools*\n<br>\n<br>4+ years with high-volume/high-traffic applications/sites\n<br>Excellent Object-Oriented Perl, preferably including Moose\n<br>Strong SQL (ideally MySQL) and DBIx::Class\n<br>Experience with unit and functional testing (Test::More etc.)\n<br>Good experience with Unix/Linux\n<br>Version control systems, ideally Git\n<br>Solid understanding of application data flow and lifecycles\n<br>Strong attention to detail\n<br>\n<br>\n<br>*Useful extra skills / experience:*\n<br>\n<br>Solr, Lucene, ElasticSearch or other search engine\n<br>Templating frameworks (ideally Template Toolkit)\n<br>Classified ads / vertical search websites\n<br>Varnish, nginx, PSGI/Plack, Apache httpd, FastCGI\n<br>Spidering technology\n<br>Search technology and search engine optimisation\n<br>Cloud infrastructure and tools (AWS preferred)\n<br>Chef (pref), Puppet or an equivalent\n<br>Gearman or other distributed queueing/messaging frameworks\n<br>Unicode and internationalisation\n<br>Machine learning / neural nets\n<br>Python\n<br>\n<br>*What we offer:*\n<br>\n<br>Market competitive salary\n<br>Stock options\n<br>25 days holiday\n<br>Cycle to work scheme\n<br>Childcare vouchers\n<br>A positive attitude towards flexible working and parental leave\n<br>A values-based culture\n<br>Company contributory pension scheme\n<br>Huge learning opportunity from smart, experienced colleagues\n<br>Table tennis table and a program of team social events\n<br>Bright, airy office with roof terrace, in the heart of bustling Fulham Broadway\n<br>More about Adzuna: Adzuna is a search engine for job ads used by over 11 million visitors per month that aims to list every job, everywhere. We search thousands of websites so our users don't have to, bringing together millions of ads in one place. By providing smarter search options and powerful data about the job market, we give jobseekers the information they need to take control of their careers.\n<br>\n<br>\n<br>Adzuna.co.uk was founded in 2011 by Andrew Hunter and Doug Monro, formerly of eBay, Gumtree, Qype and Zoopla and is backed by leading Venture Capital firms Passion Capital, LocalGlobe, Index Ventures and Smedvig Capital. We also supply real-time data to the Number 10 Dashboard and Office for National Statistics labour market indices. In 2018, Adzuna won the contract to run ‘Find a job’, one of the British government’s most used online services. Adzuna’s mission is to be the best place to start looking for a job. We love using the awesome power of technology to help match people to better, more fulfilling jobs and keep Britain working.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "bDTNTYVRT5Gn28Z6kibnfA",
    "url": "https://stackoverflow.com/jobs/273905/full-stack-elixir-phoenix-developer-headway?a=1tRgVpncCNEs",
    "title": "Full-Stack (Elixir/Phoenix) Developer at Headway  ",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot W OR(career,first)",
      "DBG_TECH1:k/t/w:arm/embedded/8",
      "DBG_TECH1:k/t/w:elixir/other/15",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/16",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=18, apple=0, java=0, gamedev=0, php=0, embedded=8, frontend=16}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "other",
      "ruby"
    ],
    "hiringOrganization": {
      "name": "Headway",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 14, 2019 3:06:28 PM",
    "validThrough": "Jun 21, 2019 3:06:28 PM",
    "crawled": "Jun 14, 2019 3:06:28 PM",
    "content": "<h3><span>Full-Stack (Elixir/Phoenix) Developer</span> </h3> \n<h4>About this job</h4> \n<div> \n <div> \n  <div> \n   <span>Job type: </span> \n   <span>Full-time</span> \n  </div> \n  <div> \n   <span>Experience level: </span> \n   <span>Junior, Mid-Level</span> \n  </div> \n  <div> \n   <span>Role: </span> \n   <span>Full Stack Developer</span> \n  </div> \n </div> \n</div> \n<div> \n <h4>Reactions to this job</h4> \n <div> \n  <div> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n   <span>0</span> \n  </div> \n </div> \n <div> \n  <div> \n   <div> \n    <div></div> \n   </div> \n   <div> \n    <strong>New!</strong> How do you feel about this job listing? \n   </div> \n   <div> \n   </div> \n  </div> \n </div> \n <div></div>\n</div>\n<div>\n Company: Headway | No office location\n <br>\n</div>\n<h4>Technologies</h4>\n<div>\n reactjs\n</div>\n<div>\n user-interface\n</div>\n<div>\n phoenix-framework\n</div>\n<div>\n ruby-on-rails\n</div> \n<h4>Job description</h4> \n<div>\n <p><strong><strong>About Headway</strong></strong></p>\n <p>Founded in 2015, Headway was born out of a passion to bring entrepreneurial ideas to market and keep them there. We work holistically with our client partners as a true extension of their product team, not just as the technical execution arm of their business. If we see something broken, whether that's a workflow, a marketing or messaging strategy, or a needless feature, we speak up, and our clients trust us to help them fix it.</p>\n <p>Because we're more than just designers and developers, we achieve results that bring successful long-term partnerships and trusted referrals. We help entrepreneurs&nbsp;<em>build a business</em>&nbsp;―not just an app. This approach, coupled with realistic and incremental software releases results in a friendly, fun, and collaborative atmosphere where our colleagues and clients both have room to learn and grow.</p>\n <p>See how our clients&nbsp;<a href='http://headway.io/case-studies/rise/' rel='nofollow'>talk</a>&nbsp;about&nbsp;<a href='http://headway.io/compass/' rel='nofollow'>our approach</a>&nbsp;and check out some of the&nbsp;<a href='http://headway.io/blog/2018-addys/' rel='nofollow'>recognition we've received</a>&nbsp;so far. Discover how we show our clients appreciation with unique&nbsp;<a href='http://headway.io/blog/holiday-collaboration-with-velodrome-coffee/' rel='nofollow'>holiday gifts</a>&nbsp;each year. Or, if you're a podcast fan, check out&nbsp;<a href='http://headway.io/seaworthy/' rel='nofollow'>Seaworthy</a>, where we explore ways to help companies grow and scale their business and ideas. We're excited about what we've achieved in the last few years, but we're just getting started. We need your help to take us to the next level!</p>\n <p><strong><strong>A Day In The Life</strong></strong></p>\n <p>During a typical work week, our crew members enjoy a balanced assignment of 35 hours on client projects with the ability to invest the other 5 hours on a combination of individual goals and team meetings. Each quarter, we take a full week away from client work to focus on team goals and internal project initiatives. These weeks alternate between a retreat style destination that encourages team bonding and goal setting, and a more focused week-long design and development sprint at our primary office in Wisconsin. Check out some of our&nbsp;<a href='http://headway.io/blog/headway-winter-retreat-2018/' rel='nofollow'>team</a>&nbsp;week&nbsp;<a href='http://headway.io/blog/headway-team-week-july-2018/' rel='nofollow'>recaps</a>&nbsp;and&nbsp;<a href='http://headway.io/blog/a-look-back-at-2017/' rel='nofollow'>years in review</a>&nbsp;to get a feel for how much fun it is to work at Headway!</p>\n <p><strong><strong>What Does Success Look Like?</strong></strong></p>\n <p>During your first 2-4 weeks at Headway, you'll have an opportunity to meet with lots of crew members across the company and start to understand our unique approach to product development. This includes several &quot;Headway 101&quot; sessions that cover everything from our project management style, to our design aesthetic and business analysis approach, to development tools and techniques. If you're new to one of our tech stacks, we'll also create a customized trail of exercises to help get you up to speed. This training covers fundamentals of our core technologies, the way we delegate tasks within a development team, our git process and workflow, testing strategies, tips for successful client interactions, and much more.</p>\n <p>After this initial period, you'll be successfully contributing to new feature work on a client project in the context of a team. You'll also be participating in daily standups, sprint planning meetings, and retrospectives.&nbsp;<strong><em>Welcome aboard!</em></strong></p>\n <p><strong>Ongoing Support</strong></p>\n <p>Each week, you'll meet with your team lead to ensure that you have the time and attention you need to be successful. Your needs and questions will always come first in this meeting, but other topics discussed include:</p>\n <ul>\n  <li>Individual quarterly goal progress</li>\n  <li>Project status / team issues / weekly retro</li>\n  <li>Individual responses to our weekly team health questionnaire</li>\n </ul>\n <p><strong>Quarterly and Annual Reviews</strong></p>\n <p>In addition to weekly touch point meetings, more formal quarterly reviews are scheduled to discuss successes and areas for growth identified over the last 3 months. We have annual performance assessments and salary reviews, though we reserve the right to provide a merit based pay raise at any time. Most crew members achieve between a 2% and 5% raise each year within their same role, but bigger jumps are possible when roles or responsibilities increase. We're here to grow with you sustainably over the long term.</p>\n <p><strong><strong>Experience and Results At Every Level</strong></strong></p>\n <p>With an experienced leadership team encompassing design, development, sales, marketing, and operations, Headway is poised for an amazing 2019. Our business is guided by&nbsp;<a href='https://www.eosworldwide.com/eos-model' rel='nofollow'>EOS</a>&nbsp;and we have strong processes, documentation, and people to support your growth and development. As they say, “Train people well enough so they can leave, treat them well enough so they don't want to.” For more on that, check out our benefits!</p>\n <p><strong><strong>Why Should You Apply?</strong></strong></p>\n <ul>\n  <li>Work on exciting projects in the latest tech across a variety of industries including: Healthcare, FinTech, Education, Personal Growth &amp; Training, Lifestyle &amp; Social</li>\n  <li>Collaborate with colleagues and clients directly to ship features that users love</li>\n  <li>Work with appreciative clients who seek out and value your input and feedback</li>\n  <li>Strong leadership and top-notch colleagues to help you realize your full potential</li>\n  <li>Career growth and leadership opportunities</li>\n </ul>\n <p><strong><strong>Key Benefits</strong></strong></p>\n <ul>\n  <li>3 weeks of PTO &amp; Sick Time available immediately</li>\n  <li>1 week of additional time off during the winter holiday season</li>\n  <li>100% of health care and dental premiums paid for you and all your dependents</li>\n  <li>Up to a 4% matching 401k contribution based on your dollar contribution</li>\n  <li>$6,000 hardware on-boarding budget including $2,000 to spend however you like</li>\n  <li>$2,500 annual education and conference budget</li>\n </ul>\n <p><strong><strong>The Hiring Process</strong></strong></p>\n <p>If after we review your application and we choose to move forward, the following interviews will typically take place over the course of 1-3 weeks (depending on scheduling):</p>\n <ul>\n  <li>Work history and aspirations chat with our People and Team Strategist</li>\n  <li>Skills and performance discussion with a Development Lead or the Head of Development</li>\n  <li>Take-home skills assessment with the potential for follow up / discussion / remote pairing at this stage</li>\n  <li>Group interview with several members of the design team and/or development team</li>\n </ul>\n <p><strong><strong>Position Description</strong></strong></p>\n <p>As a Developer at Headway, you are client and user focused while executing on the details of each project. You diligently develop features and functionality, guided by Headway's process to ensure each release is successful. This role requires constant learning and a growth mindset.</p>\n <p>When communicating with clients during sprint planning, retros, and release demos, you help monitor features as project requirements change, and direct emergent requirement discussions back to the core focus of a minimum viable product (MVP). In doing so, you help manage client expectations and project scope, ensuring we build the most valuable features first.</p>\n <p><strong><strong>Responsibilities</strong></strong></p>\n <p>As a Developer at Headway, you are responsible for executing within the Headway development process with a focus on client and user needs including:</p>\n <ol>\n  <li>Practicing &quot;craft within context&quot; and working with crewmates to receive advice and guidance to grow your knowledge.</li>\n  <li>Driving all development from the outside-in with user story mapping and MoSCoW prioritization.</li>\n  <li>Assisting with development critiques and QA</li>\n  <li>Performing pull request (PR) reviews</li>\n  <li>Participating in pairing sessions to help crewmates learn and grow.</li>\n  <li>Performing QA of both internal code quality and external end-user UI/UX.</li>\n  <li>Contributing to release notes.</li>\n  <li>Participating in sprint planning sessions and retros while taking notes collaboratively alongside the rest of the team.</li>\n </ol>\n <p><strong><em>Help us make a difference, make waves, and make Headway!</em></strong></p>\n <p><strong><strong>Requirements</strong></strong></p>\n <ul>\n  <li>Some professional Elixir/Phoenix experience (required), with Ruby on Rails and React experience a plus.</li>\n  <li>Experience working with teams of both internal and external stakeholders.</li>\n  <li>Excellent communication skills (verbal and written).</li>\n  <li>The ability to present your work and stand firm for the right reasons.</li>\n  <li>Experience working with businesses at various phases of creation and growth a plus.</li>\n </ul>\n <p><strong><strong>Expectations</strong></strong></p>\n <ul>\n  <li>You live by our&nbsp;<a href='http://headway.io/about' rel='nofollow'>Guiding Manifesto</a>&nbsp;and embody the core values of Headway.</li>\n  <li>You are open to criticism from your team and are always eager to learn and to share knowledge.</li>\n  <li>You have the ability to think big while being detail oriented and delivery focused.</li>\n  <li>You are self-motivated and able to deal with pressure and work well in a fast paced environment.</li>\n  <li>You have an outgoing, personable, and sociable attitude.</li>\n  <li>You have initiative to solve challenges, meet goals, and set new directions based on data.</li>\n  <li>You are capable of inspiring colleagues and clients.</li>\n  <li>You have a passion to create useful and valuable solutions.</li>\n  <li>You prioritize and attend our quarterly team weeks on-site at our primary office in Wisconsin, or at an awesome TBD destination.</li>\n </ul>\n <p><strong><strong>Next Steps</strong></strong></p>\n <p>If this sounds like you, we’d love to have you apply! We're a remote-first company so this position is open to developers local to the Green Bay, WI area, and anyone living in and able to work in the US.</p> \n</div> \n<div> \n <a href='https://headway.breezy.hr/p/aadf68d1af55-full-stack-elixir-phoenix--developer?source=stackoverflow' rel='nofollow'> Apply now </a>\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "yXdfDNa2TPOlbnDyJdKROw",
    "url": "https://remoteok.io/jobs/73366",
    "title": "Senior Backend Engineer",
    "tags": [
      "DBG:surround``OR(work,remot) 3W 3W(OR(wherev,whenev,where), OR(want,comfort))",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:perl/other/5",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "DuckDuckGo",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 13, 2019 6:01:46 PM",
    "validThrough": "Jun 20, 2019 6:01:46 PM",
    "crawled": "Jun 13, 2019 6:23:23 PM",
    "content": "<span><h3>Senior Backend Engineer</h3></span> \n<br> \n<span><h4>DuckDuckGo</h4></span> \n<div> \n <div> \n  <br>We are a diverse team from around the world working together on a mission to make DuckDuckGo the world’s most trusted search engine, and we want your help!&nbsp; \n  <br> \n  <br>Join us as a Senior Backend Engineer&nbsp;and become part of the team creating the technology that powers the DuckDuckGo search experience. &nbsp; \n  <br> \n  <br>As part of our Backend Team&nbsp;you will be collaborating with team members at all levels to identify and close major gaps in the search engine. Examples of projects you might work on include: building out features like improved venue search, or running experiments to improve the usability of our search results. Over time you will be directly responsible for features on the search engine results page (SERP) and take ownership over product maintenance and improvement. \n  <br> \n  <br>We are a remote company, we empower our team to work wherever they want around the world. That means you have to be self-directed and self-motivated to succeed. If that seems awesome and you like the idea of our core values -- Build trust, Question assumptions, and Validate direction -- you'll fit right in. \n  <br> \n  <br>What you will do: \n  <br> \n  <br> \n  <br>* Lead development of search projects by taking vague problems, scoping them into high impact projects, and executing them against a set of success criteria. \n  <br> \n  <br>* Take responsibility for solving product issues – both big and small. \n  <br> \n  <br>* Implement and/or create algorithms to improve the content we present on the SERP. \n  <br> \n  <br>* Collaborate with peers on product brainstorms, technical design discussions, pair programming sessions and code reviews. \n  <br> \n  <br>* Write pragmatic, testable code that works consistently and is performant. \n  <br> \n  <br>* In time, take leadership responsibility for several senior engineers, mentoring them and helping them grow at DuckDuckGo. \n  <br> \n  <br> \n  <br> \n  <br> \n  <br>What we are looking for: \n  <br> \n  <br> \n  <br>* Significant backend engineering experience (around 6+ years). \n  <br> \n  <br>* Expertise working on the backend side of at least one large application. \n  <br> \n  <br>* Experience in leading engineering teams of 3+ people. \n  <br> \n  <br>* Effective project management skills. \n  <br> \n  <br>* Ability to develop and use complicated data structures and algorithms. This includes understanding the fundamentals, as well as navigating and improving existing code (ours is mostly written with Perl). \n  <br> \n  <br>* Creative problem solvers and risk takers. You like to take initiative in pushing a project forward but know when to get others involved. \n  <br> \n  <br>* Excellent communication skills. You can validate and communicate your decisions clearly. \n  <br> \n  <br> \n  <br> \n  <br> \n  <br>Other things to know: \n  <br> \n  <br> \n  <br>* We are a small, remote team in different time zones and communicate with a variety of tools throughout the day. You should feel comfortable with the intricacies of this type of work situation. \n  <br> \n  <br>* Sometimes we meet up! You can expect to travel at least 2x a year: once for our all-hands meetup and another for a team retreat (each ~4-5 days) \n  <br> \n  <br>* We want to have a major impact on raising the standard of trust online. To do this we believe in a focused approach, with company-wide objectives, and with each team member working on a single top priority at a time. \n  <br> \n  <br>* Our work philosophy is built upon empowered project management. All team members have opportunities to run projects. \n  <br> \n  <br>* All projects are run transparently, and we encourage everyone to participate in areas of interest throughout the company. Anyone and everyone can (and should) ask questions and offer feedback around the product and internal projects. \n  <br> \n  <br>* We try to exemplify our values (build trust, question assumptions, and validate direction) in everything we do. \n  <br> \n  <br>* While this is a full time job, we offer a flexible work arrangement with no core hours and expect an average commitment of 40 hours per week. \n  <br> \n  <br>* We support professional development of our team members through career advisory and a learning stipend, reinforcing our culture of growth and skill building. \n  <br> \n  <br> \n  <br> \n  <br> \n  <br>If you think you might thrive in this environment, we would love to hear from you using the application below. \n </div> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "YajLOhF9QqmALyCV6GFSLA",
    "url": "https://stackoverflow.com/jobs/273403/senior-backend-engineer-duckduckgo?a=1tGPLDUZ177G",
    "title": "Senior Backend Engineer at DuckDuckGo  ",
    "tags": [
      "DBG:surround``OR(work,remot) 3W 3W(OR(wherev,whenev,where), OR(want,comfort))",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:perl/other/10",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "DuckDuckGo",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 125000,
      "maxValue": 125000,
      "info": "Equity",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "USD 125k /Year | Equity"
    },
    "employmentType": "UNSET",
    "published": "Jun 13, 2019 12:06:29 PM",
    "validThrough": "Jun 20, 2019 12:06:29 PM",
    "crawled": "Jun 13, 2019 12:06:29 PM",
    "content": "<h3><span>Senior Backend Engineer</span> </h3> \n<h4>About this job</h4> \n<div> \n <div> \n  <div> \n   <span>Job type: </span> \n   <span>Full-time</span> \n  </div> \n  <div> \n   <span>Experience level: </span> \n   <span>Senior, Lead</span> \n  </div> \n  <div> \n   <span>Role: </span> \n   <span>Backend Developer</span> \n  </div> \n </div> \n <div> \n  <div> \n   <span>Industry: </span> \n   <span>Search Engine</span> \n  </div> \n  <div> \n   <span>Company size: </span> \n   <span>51-200 people</span> \n  </div> \n  <div> \n   <span>Company type: </span> \n   <span>Private</span> \n  </div> \n </div> \n</div> \n<div>\n Company: DuckDuckGo | No office location\n <br>\n</div>\n<h4>Technologies</h4>\n<div></div>\n<div>\n perl\n</div>\n<div>\n go\n</div> \n<h4>Job description</h4> \n<div>\n <p>We are a diverse team from around the world working together on a mission to make DuckDuckGo the world’s most trusted search engine, and we want your help!&nbsp;</p>\n <p>Join us as a <strong>Senior Backend Engineer&nbsp;</strong>and become part of the team creating the technology that powers the DuckDuckGo search experience. &nbsp;</p>\n <p>As part of our Backend Team&nbsp;you will be collaborating with team members at all levels to identify and close major gaps in the search engine. Examples of projects you might work on include: building out features like improved venue search, or running experiments to improve the usability of our search results. Over time you will be directly responsible for features on the search engine results page (SERP) and take ownership over product maintenance and improvement.</p>\n <p>We are a remote company, we empower our team to work wherever they want around the world. That means you have to be self-directed and self-motivated to succeed. If that seems awesome and you like the idea of our core values -- Build trust, Question assumptions, and Validate direction -- you'll fit right in.</p>\n <p><strong>What you will do:</strong></p>\n <ul>\n  <li>Lead development of search projects by taking vague problems, scoping them into high impact projects, and executing them against a set of success criteria.</li>\n  <li>Take responsibility for solving product issues – both big and small.</li>\n  <li>Implement and/or create algorithms to improve the content we present on the SERP.</li>\n  <li>Collaborate with peers on product brainstorms, technical design discussions, pair programming sessions and code reviews.</li>\n  <li>Write pragmatic, testable code that works consistently and is performant.</li>\n  <li>In time, take leadership responsibility for several senior engineers, mentoring them and helping them grow at DuckDuckGo.</li>\n </ul>\n <p><strong>What we are looking for:</strong></p>\n <ul>\n  <li>Significant backend engineering experience (around 6+ years).</li>\n  <li>Expertise working on the backend side of at least one large application.</li>\n  <li>Experience in leading engineering teams of 3+ people.</li>\n  <li>Effective project management skills.</li>\n  <li>Ability to develop and use complicated data structures and algorithms. This includes understanding the fundamentals, as well as navigating and improving existing code (ours is mostly written with Perl).</li>\n  <li>Creative problem solvers and risk takers. You like to take initiative in pushing a project forward but know when to get others involved.</li>\n  <li>Excellent communication skills. You can validate and communicate your decisions clearly.</li>\n </ul>\n <p><strong>Other things to know:</strong></p>\n <ul>\n  <li>We are a small, remote team in different time zones and communicate with a variety of tools throughout the day. You should feel comfortable with the intricacies of this type of work situation.</li>\n  <li>Sometimes we meet up! You can expect to travel at least 2x a year: once for our all-hands meetup and another for a team retreat (each ~4-5 days)</li>\n  <li>We want to have a major impact on raising the standard of trust online. To do this we believe in a focused approach, with company-wide objectives, and with each team member working on a single top priority at a time.</li>\n  <li>Our work philosophy is built upon empowered project management. All team members have opportunities to run projects.</li>\n  <li>All projects are run transparently, and we encourage everyone to participate in areas of interest throughout the company. Anyone and everyone can (and should) ask questions and offer feedback around the product and internal projects.</li>\n  <li>We try to exemplify our values (build trust, question assumptions, and validate direction) in everything we do.</li>\n  <li>While this is a full time job, we offer a flexible work arrangement with no core hours and expect an average commitment of 40 hours per week.</li>\n  <li>We support professional development of our team members through career advisory and a learning stipend, reinforcing our culture of growth and skill building.</li>\n </ul>\n <p>If you think you might thrive in this environment, we would love to hear from you using the application below.</p> \n</div> \n<div> \n <a href='https://duckduckgo.applytojob.com/apply/l2Qel8oK88/Senior-Backend-Engineer-Remote?source=DDGref' rel='nofollow'> Apply now </a>\n</div> \n<h4>About DuckDuckGo</h4> \n<div>\n <p>DuckDuckGo is an international community of extraordinary individuals, coming together on a mission to build the world's most trusted search engine. We strive to make a great product while at the same time truly respecting the people that use it.</p>\n <p>We embrace diverse perspectives, and seek out passionate, self-motivated people, who are committed to our shared vision of raising the standard of trust online.</p>\n <p><strong>Work Whenever, Wherever</strong></p>\n <p>Productivity is different for everyone and we therefore trust our remote team to work wherever, whenever. Our team is located around the world and we use a variety of tools to stay connected.</p>\n <p><strong>Make an Impact</strong></p>\n <p>We are a small, growing team, working on a search engine used by millions of people worldwide. Whatever you choose to work on at DuckDuckGo you will make a difference starting on day one!</p>\n <p><strong>Culture of Trust</strong></p>\n <p>Our work philosophy is based on a culture of building trust. This translates into empowered project management, transparency at all levels of the organization, and a ton of autonomy.</p> \n</div> \n<h4>Benefits</h4> \n<ul> \n <li> <span></span> <span>Unlimited vacation</span> </li> \n <li> <span></span> <span>Generous vacation guidelines</span> </li> \n <li> <span></span> <span>Family leave policy</span> </li> \n <li> <span></span> <span>Co-working reimbursement</span> </li> \n <li> <span></span> <span>Remote work</span> </li> \n <li> <span></span> <span>Company and team meetups</span> </li> \n <li> <span></span> <span>Wellness and learning benefits</span> </li> \n <li> <span></span> <span>Company wide hack days</span> </li> \n</ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "L749i5yUTQiVe24iLTuQEQ",
    "url": "https://weworkremotely.com/remote-jobs/timeline-full-stack-engineer",
    "title": "Timeline: Full Stack Engineer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:elixir/other/10",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=2, other=10, dotnet=0, c=0, mobile=1, go=3, nodejs=1, bigdata-ml=8, ruby=2, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=12}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "G2i Inc.ContractNorth and South AmericaSnapcartFull-TimeAsia & EuropeSnapcartFull-TimeAsia & Europe",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 12, 2019 9:32:54 PM",
    "validThrough": "Jun 19, 2019 9:32:54 PM",
    "crawled": "Jun 12, 2019 10:30:26 PM",
    "content": "<h3> Full Stack Engineer </h3>\n<div>\n <div>\n  <h3>About Timeline</h3>\n </div>\n <div>\n  Timeline is a B2B SaaS application that helps financial planners create and manage retirement plans in the US, UK, and many more countries.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  Timeline uses extensive empirical research, asset class returns, inflation and mortality data to assess how a retirement strategy might fare under various market conditions.&nbsp;\n </div>\n <div>\n  <br>\n </div>\n <div>\n  In simpler words, our mission is to make retirement portfolios last a lifetime.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <h3>How we work</h3>\n </div>\n <ul>\n  <li>We are a small and fast moving team. </li>\n  <li>Our technology team is 100% remote.</li>\n  <li>We work asynchronously and in 4-week cycles. </li>\n  <li>We value simplicity.</li>\n  <li>We value code quality.</li>\n  <li>We value experimenting with new features.</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  We have the following technology stack: \n </div>\n <div>\n  <br>\n </div>\n <div>\n  <strong>Backend: </strong>\n  <br>\n </div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div>\n  <i>Elixir / Phoenix</i>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <strong>Frontend:</strong>\n  <br>\n </div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div>\n  <i>Elm / JavaScript / HTML / CSS </i>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  We chose Elm for the front-end to have a reliable and maintainable code base with few bugs and no run-time errors. It has been a great experience so far :)\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <strong>Calculations Engine: </strong>\n  <br>\n </div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div>\n  <em>Julia</em>\n  <br>\n </div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div>\n  One of the reasons we chose Julia is because it is the perfect bridge between the Quantitative Analysis Team and the Software Developer Team due to its simple syntax, dynamic types and vast number of libraries for mathematical, statistical and financial calculations.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <h3>About the Job</h3>\n </div>\n <div>\n  We are looking for an experienced \n  <strong>Full Stack Software Engineer</strong> who:\n </div>\n <ul>\n  <li>has proficiency in one or more high-level languages such as Elixir, Ruby, Go or Python.</li>\n  <li>has a solid understanding of web technologies.</li>\n  <li>writes maintainable and robust code.</li>\n  <li>likes to write tests.</li>\n  <li>wants to help design, implement, and launch major user-facing features.</li>\n  <li>has a strong understanding of systems architecture and database design.</li>\n  <li>likes to provide feedback and code reviews to his peers.</li>\n  <li>is proactive with communication and has no problem managing time as a remote employee.</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <h3>About You</h3>\n </div>\n <div>\n  Bonus Points if you:\n </div>\n <ul>\n  <li>are always learning.</li>\n  <li>have strong communication skills. You speak and write well. We’re a distributed team so we’re extra mindful about communication.</li>\n  <li>like to build stuff.</li>\n  <li>have an eye for great products and can work effectively with engineers and designers to build them.</li>\n  <li>have empathy for the problems that financial planners face in their day-to-day operations, and a desire to solve those problems.</li>\n  <li>have built SaaS products.</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <h3>Perks &amp; Benefits</h3>\n </div>\n <ul>\n  <li>Work from anywhere.</li>\n  <li>A competitive salary.</li>\n  <li>25+ days holiday.</li>\n  <li>A healthy 40-hour work week, friendly and supportive work environment.</li>\n  <li>Courses and learning: We invest in your professional growth.</li>\n </ul>\n <div>\n  &nbsp;\n  <br>\n </div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div></div>\n <div>\n  Do you think you are the right person for the job? Send your CV and a cover letter to \n  <a href='mailto:tech@timelineapp.co' rel='nofollow'>tech@timelineapp.co</a> telling us why we should consider you!\n </div>\n</div>\n<div>\n <h4> Related Jobs <span><a rel='nofollow'> See more Programming jobs<span>→</span></a></span></h4>\n <ul>\n  <li><span>New</span>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>G2i Inc.</span><br><span>Remote Contract React Native Engineer</span><span>featured</span><br><span>Contract</span><span>/</span><span>North and South America</span></a></li>\n  <li><span>New</span>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>Snapcart</span><br><span>Sr. Software Engineer (Java)</span><span>featured</span><br><span>Full-Time</span><span>/</span><span>Asia &amp; Europe</span></a></li>\n  <li><span>New</span>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>Snapcart</span><br><span>Sr. Data Engineer</span><span>featured</span><br><span>Full-Time</span><span>/</span><span>Asia &amp; Europe</span></a></li>\n </ul>\n <br>\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "AhCHuNdAQH2VKQt54kTTAg",
    "url": "https://www.remoteage.com/remote-jobs/principal-cyber-software-engineer-2/",
    "title": "Principal Cyber Software Engineer",
    "tags": [
      "DBG:surround``2N(work,remot) 9W OR(travel,visit)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:air/frontend/8",
      "DBG_TECH1:k/t/w:air/mobile/8",
      "DBG_TECH1:k/t/w:bash/other/2",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:k/t/w:perl/other/5",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=7, dotnet=0, c=5, mobile=8, go=0, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=8}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/mobile",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend",
      "mobile",
      "other"
    ],
    "hiringOrganization": {
      "name": "Northrop Grumman",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 12, 2019 7:08:00 AM",
    "validThrough": "Jun 19, 2019 7:08:00 AM",
    "crawled": "Jun 12, 2019 7:08:24 AM",
    "content": "<h3> Principal Cyber Software Engineer </h3>\n<div>\n United States, California\n</div>\n<div>\n Company: Northrop Grumman\n <p></p>\n</div>\n<div> \n <h4>Overview</h4> \n <p>At Northrop Grumman, innovation isn’t just an idea—it’s a way of life. Our employees have incredible opportunities to work on revolutionary systems in air and space that impact lives around the world today, and for generations to come. Our work preserves freedom and democracy, and advances human discovery and our understanding of the universe. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future. We are currently seeking an experienced Cyber Software Engineer to support our Monterey, California location (remote work with some travel may be acceptable). Preference given to candidates who wish to work onsite in Monterey, CA. The successful candidate will excel in a rapid execution, cross disciplined and distributed environment with small teams. As such, a significant breadth of experience is needed to cover the entire system life cycle and a vast array of technologies. The position supports research teams doing largely exploratory data analysis with an emphasis on advanced Machine Learning in support of predictive analytics. In this position, you will Perform and execute full life cycle development Perform architecture trade analysis Assist in authoring software design, algorithm descriptions and requirements R eview applicable specifications, materials, tools, techniques, and methodologies Perform testing and validation Assist in data analysis Interact with senior government stakeholders Identify and mitigate complex security vulnerabilities Incorporate current security trends, advisories, CVEs and research into security posture Basic Qualifications Bachelors degree in a STEM related field plus 5 years experience or, a Masters degree plus 3 years, or a PhD with 0 years experience required. Experience programming with all of the following Python, C, Perl, bash, PHP. Advanced experience with Linux and bash A solid understanding of git Experience with security standards such as STIGs and CIS framework controls Linux+ and Security+ certifications US citizenship and ability to obtain a DoD Top Secret clearance Preferred Qualifications Experience with Linux system and network administration CCNA certification Experience using automation and orchestration tools, especially Ansible and Saltstack Experience managing a continuous deployment and integration server, such as GitLab, Jenkins Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal OpportunityAffirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEOAA and Pay Transparency statement, please visit http . U.S. Citizenship is required for most positions.</p> \n <div> \n  <a href='https://www.jobg8.com/Traffic.aspx?9gTRSBRwkCjtIwGdolH%2fmQo' rel='nofollow'>Apply for job</a> \n </div> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
