{
 "items": [
  {
    "id": "2OncWm8WSoiE_6L5gtccyg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/141116/freelance-expert-interviewer-karat?a=LkcSbeLCa0o",
    "title": "Freelance Expert Interviewer at Karat () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><strong>Interviewing is broken. &nbsp;Karat professionalizes interviewing.</strong><br><br><strong>About Karat</strong><br><br>Karat has reengineered technical hiring to ensure that great talent gets noticed by great companies. &nbsp;&nbsp;We augment engineering organizations by conducting the first-rounds of technical interviews on their behalf. Our service saves material engineering time and drives a highly responsive and consistent experience for candidates. &nbsp;Karat continuously invests in cutting edge interview methodologies with an aim of reducing bias and letting candidates demonstrate their true ability.<br><br>We operate as strategic partners for engineering leaders at the world's leading technology companies including Jet, MuleSoft, Roblox, Intuit, Ten-X, Minted and many more. &nbsp;&nbsp;As the gold standard of technical interviewing, our well-funded company is scaling quickly to meet our growing list of client's needs. &nbsp;Come join us!<br><br><strong>Join our elite community of Expert Interviewers.</strong><br><br>Karat’s Expert Interviewers are recognized and rewarded for doing a first-class job as top assessors of technical talent. &nbsp;Every interviewer in the network is an accomplished engineer. &nbsp;Our interviewers include development managers from big-tech companies, start-up engineers and freelancers covering the full technology stack.<br><br><strong>Flexible, high impact work that is compensated at highly competitive rates.</strong><br><br>As an Expert Interviewer, you will be compensated at highly competitive rates for your interviewing expertise. &nbsp;The time commitment is flexible---many of our interviews happen on nights and weekends. &nbsp;Some experts do 10 interviews/week while others do over 25 interviews/week. &nbsp;You can work from anywhere, anytime. &nbsp;You will sharpen your interviewing skills and transform the interviewing experience for every candidate and company.                    </div>                            <h2>                About Karat            </h2>            <div><p><strong>Interviewing is broken. &nbsp;Karat professionalizes interviewing.</strong></p><ul><li>Karat is on a mission to assess the world's talent. &nbsp;We are the first dedicated marketplace for technical interviewers. Karat's network of seasoned engineers conduct the first rounds of technical interviews for elite engineering companies. Our robust platform saves teams thousands of valuable hours while allowing them to focus on the top performing candidates. &nbsp;Karat's unique approach recognizes that people are central to the hiring process and that they can be supercharged by leveraging machine learning and our rich database of the world's interviews.</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Hours - You own your schedule                            </div>                            <div>                                 Work from anywhere                            </div>                            <div>                                 Transparent compensation                            </div>                            <div>                                 Bonus programs                            </div>                            <div>                                 Regular company outings                            </div>                            <div>                                 Access to a world-class community of expert interviewers                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "DBG_TECH1:k_t_w:machine-learning_bigdata-ml_8",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=8, ruby=0}",
      "REMOTE1_100",
      "TECH1_bigdata-ml",
      "TECH2_algorithm",
      "TECH2_data-structures",
      "TECH2_java",
      "TECH2_python",
      "TECH2_technical-interviewing",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "algorithm",
      "bigdata-ml",
      "data-structures",
      "java",
      "python",
      "technical-interviewing"
    ]
  },
  {
    "id": "cQTwiNITSuGOSyv26FWf8Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15827130",
    "title": "SEEKING FREELANCER - Remote (US or Canada specifically)",
    "content": "<div>                  <span>SEEKING FREELANCER - Remote (US or Canada specifically)<p>Looking for deep learning tutorial writers/creators to make deep learning technology screencasts.</p><p>Specifically those who know or are starting out one or more of the following technologies: TensorFlow, PyTorch, CNTK, MXNet (python, jl, c++, etc), Keras, Gluon, DL4J, DeepLearn.js, Torch, Caffe2, Caffe, Paddle, TFLearn, dlib, Theano, chainer, DIGITS, dynet....</p><p>The topic area would be yours to choose.</p><p>I would help you come up with specific tutorials to start out with.</p><p>I pay $50 USD per video, pay for your equipment, and pay ongoing royalties on a monthly basis (with a minimum royalty payout of $600 for the first year)...</p><p>I also give you suggestions on video topics so that you don't have to come up with them at the start...</p><p>I also do the video editing and transcribing for you...</p><p>if interested:</p><p>website -&gt; <a href='https://www.aiworkbox.com' rel='nofollow'>https://www.aiworkbox.com</a>email -&gt; sebastian@aiworkbox.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Dec 1, 2017 10:34:08 PM",
    "tags": [
      "DBG_TECH1:k_t_w:c++_c_8",
      "DBG_TECH1:k_t_w:caffe_bigdata-ml_8",
      "DBG_TECH1:k_t_w:deep-learning_bigdata-ml_16",
      "DBG_TECH1:k_t_w:keras_bigdata-ml_8",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:k_t_w:theano_bigdata-ml_8",
      "DBG_TECH1:k_t_w:torch_bigdata-ml_8",
      "DBG_TECH1:techWeightMap:{python=2, java=0, dotnet=0, c=8, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=48, ruby=0}",
      "REMOTE1_50",
      "TECH1_bigdata-ml",
      "TITLE1_unknown",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "Ove97EowRWOMKUvWUsICkA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15824879",
    "title": "Pex | Multiple Positions | Downtown, Los Angeles | ONSITE & REMOTE, FULL-TIME | Salary $100k+ & Equity |",
    "content": "<div>                  <span>Pex | Multiple Positions | Downtown, Los Angeles | ONSITE &amp; REMOTE, FULL-TIME  | Salary $100k+ &amp; Equity | <a href='https://pex.com' rel='nofollow'>https://pex.com</a><p>Pex is a search engine for music and video, that uses the content as a base for its search (think of Google Image Search just for video/music, with some more features built at top of the technology). To date we've indexed more than 7B videos with daily addition of ~60M.</p><p>We operate a massive stack (<a href='https://news.ycombinator.com/item?id=13726224' rel='nofollow'>https://news.ycombinator.com/item?id=13726224</a>), currently using mostly C/C++, Go and Java in most of our pipeline and Javascript and Python for frontend and data analysis.</p><p>We offer 30 days of paid vacation, fully covered health benefits (gold plan), commuter benefits, cover costs of visiting conferences and more.</p><p>We're looking for skilled senior developers (C/C++, Go, Java, Python/Ruby) that want to work on some very challenging technical problems, in a massive scale. Additionally we're looking for people interested in signal processing and machine learning to join our core search team.</p><p>Newly we're experimenting with some remote positions. Only senior developers, no interns at the moment.</p><p>If you want to learn more, reach out directly to me at r@pex.com</p><p>PS: we just recently closed a $7M Seed Round <a href='https://blog.pex.com/pex-secures-7m-in-series-seed-financing-22dff30f8392' rel='nofollow'>https://blog.pex.com/pex-secures-7m-in-series-seed-financing...</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Dec 1, 2017 6:30:15 PM",
    "tags": [
      "DBG_TECH1:k_t_w:java_java_4",
      "DBG_TECH1:k_t_w:java_mobile_2",
      "DBG_TECH1:k_t_w:javascript_frontend_1",
      "DBG_TECH1:k_t_w:javascript_mobile_1",
      "DBG_TECH1:k_t_w:javascript_nodejs_1",
      "DBG_TECH1:k_t_w:machine-learning_bigdata-ml_8",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=2, java=4, dotnet=0, c=0, gamedev=0, mobile=3, php=0, nodejs=1, embedded=0, frontend=1, bigdata-ml=8, ruby=0}",
      "REMOTE1_100",
      "TECH1_bigdata-ml",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "c2hmJ4AyQgKRmxzazs_rpw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157270/senior-software-engineer-selerity?a=QK5Wb2eHtmM",
    "title": "Senior Software Engineer at Selerity (New York, NY) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>DevOps</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data, Digital Media, Machine Learning</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span><strong>Title:</strong> Senior Software Engineer</span></p><p><strong>Summary:</strong></p><p><span>Senior Software Engineer to join team scaling up Selerity’s A.I.-driven analytics and recommendation platform and integrate it into enterprise workflows. &nbsp;Highly competitive compensation plus significant opportunities for professional growth and career advancement.</span></p><p><span><strong>Employment Type:</strong> Contract or Full-Time</span></p><p><span><strong>Location is Flexible:</strong> New York City (main office), Chicago, or Remote</span></p><p><strong>Job Description:</strong></p><p><span>Want to change how the world engages with news and data?</span></p><p><span>Selerity has dominated ultra-low-latency data science in finance for several years. &nbsp;Now our real-time content analytics and contextual recommendation platform is gaining broader traction in enterprise and media applications. &nbsp;We're tackling big challenges in predictive analytics, conversational interfaces, and workflow automation and need your help!</span></p><p><span>We’re looking for an experienced developer to join a major initiative at a critical point in our company’s growth. &nbsp;The majority of the development will be in Java on Linux but knowledge of other languages, platforms and levels of the stack is very helpful.</span></p><p><strong>Must-haves:</strong></p><p><span> &nbsp;* Possess a rock-solid background in Computer Science (minimum BS in Comp Sci or related field) + at least 5 years (ideally 10+) of challenging work experience.</span></p><p><span> &nbsp;* Demonstrated expert-level proficiency building systems in Java in Linux environments. &nbsp;</span></p><p><span> &nbsp;* Direct experience in the design, implementation and maintenance of SaaS API's that are minimal, efficient, scalable and supportable throughout their lifecycle.</span></p><p><span> &nbsp;* Solid track record of making effective design decisions balancing near-term and long-term objectives.</span></p><p><span> &nbsp;* Know when to use commercial or open-source solutions, when to delegate to a teammate, and when to roll up your sleeves and code it yourself.</span></p><p><span> &nbsp;* Work effectively in agile teams with remote members; get stuff done with minimal guidance and zero BS, help others, and know when to ask for help.</span></p><p><span> &nbsp;* Clearly communicate complex technical and product issues to non-technical team members, managers, clients, etc. &nbsp;</span></p><p><strong>Nice-to-haves:</strong></p><p><span> &nbsp;* Full-stack development and operations experience with web apps on Node.js.</span></p><p><span> &nbsp;* Implementation of DevOps / SRE processes at scale including continuous integration, automated testing, and platform monitoring.</span></p><p><span> &nbsp;* Experience with analytics visualization libraries.</span></p><p><span> &nbsp;* Experience with large-scale analytics and machine learning technologies including TensorFlow/Sonnet, Torch, Caffe, Spark, Hadoop, cuDNN, etc.</span></p><p><span> &nbsp;* Conversant with relational, column, object, and graph database fundamentals + strong practical experience in at least two of those paradigms.</span></p><p><span> &nbsp;* Implementation of software defined networking or other non-traditional networking paradigms.</span></p><p><span> &nbsp;* Deep understanding of how to build software agents and conversational workflows.</span></p><p><span> &nbsp;* Experience with additional modern programming languages (Scala, Python, …)</span></p><p><span>Our stack combines leading commercial and open source technologies with &nbsp;numerous home-grown innovations, including:</span></p><p><span> * Java, C++, JavaScript/ECMAscript + Node, Angular, RequireJS, Electron, Scala, Python, etc.</span></p><p><span> * A variety of open source and in-house frameworks for natural language processing and machine learning including artificial neural networks / deep learning.</span></p><p><span> * Hybrid of AWS (EC2, S3, RDS, R53) + dedicated datacenter network, server and GPU/coprocessor infrastructure.</span></p><p><span> * Cassandra, Aurora plus in-house streaming analytics pipeline (similar to Apache Flink) and indexing/query engine (similar to ElasticSearch).</span></p><p><span> * In-house messaging frameworks for low-latency (sub-microsecond sensitivity) multicast and global-scale TCP (similarities to protobufs/FixFast/zeromq/itch).</span></p><p><span> * Ansible, Git, Subversion, PagerDuty, Icinga, Grafana, Observium, LDAP, Jenkins, Maven, Purify, VisualVM, Wireshark, Eclipse, Intellij </span></p><p><span>This position offers a great opportunity to work with advanced technologies, collaborate with a top-notch, global team and disrupt a highly visible, multi-billion-dollar market. &nbsp;</span></p><p><strong>Compensation:</strong></p><p><span>We understand how to attract and retain the best talent and offer a competitive mix of salary, benefits and equity. &nbsp;We also understand how important it is for you to feel challenged, to have opportunities to learn new things, to have the flexibility to balance your work and personal life and to know that your work has impact in the real world. &nbsp;We have team members on four continents and we're adept at making remote workers feel like part of the team. &nbsp;If you join our NYC main office be sure to bring your Nerf toys, your drones and your maker gear - we’re into that stuff, too.</span></p><p><strong>Interview Process:</strong></p><p><span>If you can see yourself at Selerity, send your resume and/or online profile (e.g. LinkedIn) to <a href='mailto:careers@selerityinc.com' rel='nofollow'>careers@selerityinc.com</a>. &nbsp;We’ll arrange a short introductory phone call and if it sounds like there’s a match we'll arrange for you to meet the team for a full interview. &nbsp;</span></p><p><span>The interview process lasts several hours and is sometimes split across two days. &nbsp;It is intended to be challenging - but the developers you meet and the topics you’ll be asked to explain (and code!) should give you a very clear sense of what it would be like to work at Selerity. &nbsp;</span></p><p><span>We value different perspectives and have built a team that reflects that diversity while maintaining the highest standards of excellence. &nbsp;You can rest assured that we welcome talented engineers regardless of their age, gender, sexual orientation, religion, ethnicity or national origin.</span></p><p><span><strong>Recruiters:</strong> <strong>Please note that we are not currently accepting referrals from recruiters for this position.</strong></span></p>                    </div>                            <h2>                About Selerity            </h2>            <div><p>Our mission is to deliver critical information when our users need it most. &nbsp;We launched our first ultra-low-latency financial data product in 2009 and continue to lead the market for real-time natural language processing and event data extraction. &nbsp;In recent years we have applied our technology more broadly to a wide spectrum of news, research, social media, and chat. &nbsp;From driving the world's most sophisticated automated trading algorithms to powering the most widely read financial news site, we continue to expand into new problem domains and new ways to integrate the most relevant, engaging information into our users' workflows.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Paid Vacations                            </div>                            <div>                                 Health Insurance                            </div>                            <div>                                 Commuter Benefits                            </div>                            <div>                                 Choice of Equipment                            </div>                            <div>                                 Nerf + Drones                            </div>                            <div>                                 Team meals and outings                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``OR(global, distributed) 2N team",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k_t_w:angular_frontend_8",
      "DBG_TECH1:k_t_w:c++_c_8",
      "DBG_TECH1:k_t_w:caffe_bigdata-ml_8",
      "DBG_TECH1:k_t_w:eclipse_java_5",
      "DBG_TECH1:k_t_w:hadoop_bigdata-ml_8",
      "DBG_TECH1:k_t_w:intellij-idea_java_8",
      "DBG_TECH1:k_t_w:java_java_6",
      "DBG_TECH1:k_t_w:java_mobile_3",
      "DBG_TECH1:k_t_w:machine-learning_bigdata-ml_24",
      "DBG_TECH1:k_t_w:maven_java_8",
      "DBG_TECH1:k_t_w:python_python_4",
      "DBG_TECH1:k_t_w:scala_java_6",
      "DBG_TECH1:k_t_w:torch_bigdata-ml_8",
      "DBG_TECH1:techWeightMap:{python=4, java=33, dotnet=0, c=8, gamedev=0, mobile=3, php=0, nodejs=0, embedded=0, frontend=8, bigdata-ml=48, ruby=0}",
      "REMOTE1_100",
      "TECH1_bigdata-ml",
      "TECH2_c++",
      "TECH2_devops",
      "TECH2_java",
      "TECH2_linux",
      "TECH2_machine-learning",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "c++",
      "devops",
      "java",
      "linux",
      "machine-learning"
    ]
  },
  {
    "id": "s4zFcBBJQY6qkk2ZSrosSg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/148870/senior-php-nodejs-c-plus-plus-developer-full-time-cvedia-limited?a=NVr0uCDrGsU",
    "title": "Senior PHP/Node.js/C++ developer - Full Time - 100% Remote EU Time Zone at Cvedia Limited (Madrid, Spain) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Desktop Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Services</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>About the job</strong></p><p>This is a remote, full time, long term position. As a developer in our team you will take full responsibility of your modules in a process intensive system. You will take charge of the development process from gathering requirements and system design through to the UI mockups and front end development. We require a high level of understanding the business logic involved and a critical mind to design and implement it effectively.</p><p><strong>Experience with the following is desired</strong></p><ul><li>Fluent in English with excellent written and verbal communication skills.</li><li>Working remotely with a team in multiple timezones.</li><li>Ability to work independently - accountable for your own actions and able to act with both urgency and integrity.</li><li>The ability to understand what the users and the business need.</li></ul><ul><li>Must Have: System analysis, data modelling, business process diagrams, data flow diagrams, UML.</li><li>Full stack development experience designing and building high volume, scalable, modular applications from top to bottom</li><li>Extensive proficiency with at least two RDBMSes</li><li>Solid professional experience in OOP using php and preferably python too.</li><li>Version Control</li><li>Linux server administration</li></ul><p><br><br></p><p><strong>How should you apply for this job?</strong></p><p>Please provide your github repository</p><p>Only applicants from European time zone will be processed.</p><p>We will not reply to 3rd party software/employees agencies</p><p>Please state on the mail subject the job position and the state you reside.</p><p>Please understand that this job capacity is for a full position.</p><p><br><br></p><p><strong>Application process:</strong></p><p>Application usually will be screened the same day we receive it.</p><p>We will reply to you no later than two business days to set-up a short interview.</p><p>1-3 weeks after the interview you could be hired!</p><p><br><br></p><p><strong>What we offer:</strong></p><p>Job location is in Cyberspace.</p><p>Communication with the all team members is done through Skype</p><p>Employee will be receiving all of his social rights as stated in the law of his country.</p><p>Salary will be paid once a month with a wire transfer</p><p>Job capacity: Monday - Friday (8 hours daily) &nbsp;</p><p><br><br></p>                    </div>                            <h2>                About Cvedia Limited            </h2>            <div><p><strong>Cvedia is a free, cloud-based service simplifying image dataset preparation and processing.</strong></p><p>We give you direct access to standardized versions of public and private image datasets such as Open Images, COCO, ImageNet, and YouTube-8M. Using our open-source CLI tool, we directly export your filters and augmentations to your local server in the format of your favorite machine learning framework, including Torch, Caffe, TensorFlow, Theano, and Deeplearning4J. We support batch downloads and resumable states so you can start training right away.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote work                            </div>                            <div>                                 Challenging environment                            </div>                            <div>                                 Young start-up with endless possibilities                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``2W(100, remot)",
      "DBG:surround``OR(europ, european, europeanunion) 3W OR(timezon,time)",
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k_t_w:caffe_bigdata-ml_8",
      "DBG_TECH1:k_t_w:machine-learning_bigdata-ml_8",
      "DBG_TECH1:k_t_w:php_php_3",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:k_t_w:theano_bigdata-ml_8",
      "DBG_TECH1:k_t_w:torch_bigdata-ml_8",
      "DBG_TECH1:techWeightMap:{python=2, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=3, nodejs=0, embedded=0, frontend=0, bigdata-ml=32, ruby=0}",
      "REMOTE1_100",
      "TECH1_bigdata-ml",
      "TECH2_cvs",
      "TECH2_linux",
      "TECH2_php",
      "TECH2_python",
      "TECH2_uml",
      "TITLE1_dev",
      "TZ_Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "cvs",
      "linux",
      "php",
      "python",
      "uml"
    ]
  },
  {
    "id": "xpbUSHXYRxWTn8Yc4dKXQQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/131186/c-c-plus-plus-robot-brain-engineer-aeolus-robotics-inc?a=HZJwVRAzdx6",
    "title": "C/C++ Robot Brain Engineer at Aeolus Robotics, Inc (South San Francisco, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Embedded Developer</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Job Responsibilities</strong></p><p><span>Work with experts developing, iterating and testing robot algorithms, in one or more of these areas:</span></p><p><strong>- </strong><span>Robot motion planning and control</span></p><p><span>- Visual modeling and perception</span></p><p><span>- Language understanding</span></p><p><span>- Grasp planning</span></p><p><span>- Firmware programming for HW/SW systems</span></p><p><span>- Other amazing robotics-based challenges!</span></p><p><strong>About you</strong></p><p><span>You are looking for the place to stretch yourself, able to work within a senior, highly performant product team, and aren’t afraid of a challenge. &nbsp;You are a self-starter with the motivation and skills needed to effectively operate on your own time in your own way while being responsive to the needs of your teammates and the team as a whole.</span></p><p><span>You love working on the metal and/or deep in low-level or scaled algorithmic code. &nbsp;You are effective at quickly understanding and operating on algorithms taken from research in AI, Robotics, and Vision, or you have have experience with sensors, motors, and other devices. &nbsp;You are comfortable working alongside experts in these areas, or are an expert yourself. You have a proven track record of delivering ideas into working prototypes at high velocity. &nbsp;You have commercial/agile development teaming experience. &nbsp;You've architected some serious systems and may have even been a team lead. </span></p><p><strong>Flexible Hours &amp; 100% Remote Work</strong></p><p><span>These roles permit flexible working hours and are 100% remote. &nbsp;You will work in a scrum-based agile development cycle. Whether you prefer contract work or a permanent position, we can accommodate you. You will be working alongside founders, researchers, and engineers to design and build first-generation robotic solutions for mass consumer adoption.</span></p>                    </div>                            <h2>                About Aeolus Robotics, Inc            </h2>            <div><p><span>Aeolus Robotics was founded to bring the first generation of household robot assistants to life, and to market. Integrating Taiwanese manufacturing prowess and Silicon Valley AI genius, we are breaking ground in general-purpose consumer robotics with capability in unstructured “human” spaces. &nbsp;Our CTO, an expert in AI and machine learning, was a member of the DARPA team that conceived and managed the Watson AI project. Still operating largely in stealth mode, we’ve got additional key members and breakthrough technological approaches to ensure success in this challenging field.</span></p>            </div>        ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``2W(100, remot)",
      "DBG:surround``remot 3N OR(role, employment)",
      "DBG_TECH1:k_t_w:artificial-intelligence_bigdata-ml_20",
      "DBG_TECH1:k_t_w:machine-learning_bigdata-ml_8",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=28, ruby=0}",
      "REMOTE1_100",
      "TECH1_bigdata-ml",
      "TECH2_c",
      "TECH2_c++",
      "TECH2_computer-vision",
      "TECH2_machine-learning",
      "TECH2_robotics",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "c",
      "c++",
      "computer-vision",
      "machine-learning",
      "robotics"
    ]
  },
  {
    "id": "-qE6gWJwSWKuTY4Pu68nvQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/133487/salesforce-developer-remote-us-only-innovate?a=ILzSQsbuYo0",
    "title": "Salesforce Developer - Remote (US only) at Innovate! (Alexandria, VA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Services, Consulting, Geographic Information System</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>As a member of the Cloud Advisory Services team, the Salesforce Developer will be expected to create unique customer-based solutions.&nbsp;The developer will interact with clients, prospective clients, project managers and team members, architects and other developers to ensure customer success.&nbsp;<br><br>They will customize, develop and support solutions (including on the force.com platform) in a fast-paced and constantly evolving environment from start to finish of multiple projects across independent platforms concurrently. They will work in partnership with project managers to gather technical requirements, research and become the subject matter expert as needed, and estimate work effort; provide production support of applications by trouble shooting issues and proposing solutions; then develop, test fixes, and migrate solution; provide ongoing support; and accurately report issues and status to project and division management.&nbsp;</p>                    </div>                            <h2>                About Innovate!            </h2>            <div><p>Innovate!, Inc. (Innovate) is an 8(a) woman and minority-owned company passionate about the dynamic benefits of providing effective management consulting, IT support, and geospatial technology for the federal government. We believe that thinking innovatively can achieve positive results in organizations that lead to cultural and business change. This beliefs and our ability to deliver cutting edge solutions were recognized with Innovate being named 2012 Environmental Protection Agency (EPA) Outstanding 8(a) Small Business of the Year.<br>&nbsp;<br>Innovate!, Inc. also offers a comprehensive and affordable benefit program to all eligible employees.<br><br><em>Innovate!, Inc. is an equal opportunity employer and will not discriminate against any employee or applicant on the basis of age, color, disability, gender, national origin, race, religion, sexual orientation, veteran status, or any classification protected by federal, state, or local law.</em>&nbsp;<br>&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Opportunities to work remotely                            </div>                            <div>                                 401(k) / Roth –The 401(k) and Roth plans offer a variety of investment                            </div>                            <div>                                 Holidays – Innovate! observes ten (10) paid holidays per year                            </div>                            <div>                                 Employee Referral Bonus - because we know you know the best people                            </div>                            <div>                                 Comprehensive health care plan                            </div>                            <div>                                 Flexible work schedules                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k_t_w:classification_bigdata-ml_1",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=1, ruby=0}",
      "REMOTE1_100",
      "TECH1_bigdata-ml",
      "TECH2_ajax",
      "TECH2_apex",
      "TECH2_java",
      "TECH2_javascript",
      "TECH2_salesforce",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "ajax",
      "apex",
      "bigdata-ml",
      "java",
      "javascript",
      "salesforce"
    ]
  },
  {
    "id": "6l8Y0Ci3TLSZQxn_NLf8Rg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/141116/interview-engineer-karat?a=LkcSbeLCa0o",
    "title": "Interview Engineer at Karat () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>About Karat</strong></p><p>Karat has reengineered technical hiring to ensure that great talent gets noticed by great companies. &nbsp;&nbsp;We augment engineering organizations by conducting the first-rounds of technical interviews on their behalf. Our service saves material engineering time and drives a highly responsive and consistent experience for candidates. &nbsp;Karat continuously invests in cutting edge interview methodologies with an aim of reducing bias and letting candidates demonstrate their true ability. We operate as strategic partners for engineering leaders at the world's leading technology companies including Jet, MuleSoft, Roblox, Intuit, Ten-X, Minted and many more. &nbsp;&nbsp;As the gold standard of technical interviewing, our well-funded company is scaling quickly to meet our growing list of client's needs. &nbsp;Come join us!</p><p><strong>About The Job</strong></p><p>Our dedicated Interview Engineers are deeply passionate about the art and science of interviewing. &nbsp;&nbsp;As an Interview Engineer, you will conduct the first-rounds of technical interviews on behalf of Karat's clients. Karat interviews take place live over video, allowing our Interview Engineers to interact with candidates from all over the world without leaving their home. &nbsp;You will play an important role in the hiring process and will uphold the highest standards of candidate experience, fairness and trust. &nbsp;We are very selective in hiring Interview Engineers onto the Karat platform. &nbsp;&nbsp;Once you join our community, we will be focused on your success as a highly-regarded technical interviewer.</p><p><strong>About You:</strong></p><ul><li>You're passionate about improving the technical interview process.</li><li>You care about helping others improve themselves through a great interview experience.</li><li>You lead with empathy and are driven to provide consistent and thoughtful feedback to candidates.</li><li>Your written and verbal communication skills are superb.</li><li>You've accumulated significant experience evaluating fundamental computer science skills (i.e. data structures, algorithms etc.), software craftsmanship (i.e. understanding of unit testing, source control, APIs etc.), and/or specific technologies (i.e. iOS, distributed systems etc.).</li><li>You are interested in working 40 hours per week or more.</li></ul>                    </div>                            <h2>                About Karat            </h2>            <div><p><strong>Interviewing is broken. &nbsp;Karat professionalizes interviewing.</strong></p><ul><li>Karat is on a mission to assess the world's talent. &nbsp;We are the first dedicated marketplace for technical interviewers. Karat's network of seasoned engineers conduct the first rounds of technical interviews for elite engineering companies. Our robust platform saves teams thousands of valuable hours while allowing them to focus on the top performing candidates. &nbsp;Karat's unique approach recognizes that people are central to the hiring process and that they can be supercharged by leveraging machine learning and our rich database of the world's interviews.</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Hours - You own your schedule                            </div>                            <div>                                 Work from anywhere                            </div>                            <div>                                 Transparent compensation                            </div>                            <div>                                 Bonus programs                            </div>                            <div>                                 Regular company outings                            </div>                            <div>                                 Access to a world-class community of expert interviewers                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG_TECH1:k_t_w:ios_mobile_2",
      "DBG_TECH1:k_t_w:machine-learning_bigdata-ml_8",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=2, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=8, ruby=0}",
      "REMOTE1_100",
      "TECH1_bigdata-ml",
      "TECH2_algorithm",
      "TECH2_data-structures",
      "TECH2_java",
      "TECH2_python",
      "TECH2_technical-interviewing",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "algorithm",
      "bigdata-ml",
      "data-structures",
      "java",
      "python",
      "technical-interviewing"
    ]
  },
  {
    "id": "Z8PCZ_4QTwKWOhlxIN5pxA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/120767/senior-web-ux-ui-designer-and-developer-apex-expert-solutions?a=Ev5MYRbLO6I",
    "title": "Senior Web UX/UI Designer and Developer at APEX Expert Solutions (Arlington, VA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Designer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data, Government, Military</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Duties and Responsibilities</strong>:</p><ul><li>Work in an fast-paced agile development environment designing and developing responsive front end&nbsp;websites that are able to display and manage large disparate datasets</li><li>Full scope web application development ranging from user experience research and design to front-end&nbsp;design and development</li><li>Provide technology recommendations for potential product application development</li><li>Gather and analyze requirements from product owners ensuring products meet business requirements</li><li>Collaborate with other software engineers and team leads in designing and developing software solutions&nbsp;that meet high quality standards</li><li>Quickly prototype and develop webpages and components specializing in visualizing large geospatial&nbsp;datasets using Cesium, Leaflet, D3.js, and OpenLayers 3.</li><li>Using Adobe Photoshop or Illustrator, create website mockups portraying design concepts</li><li>Assist with the design and implementation of REST API applications that provide web application&nbsp;connectivity to backend NoSQL datastores</li></ul><p><strong>Skills &amp; Requirements</strong></p><ul><li>5 years of building front-end websites connected to REST API</li><li>3 years of building and utilizing geospatial UI libraries including Cesium, Leaflet, D3.js, and OpenLayers 3</li><li>3 years of user experience design and website implementation with portfolio of past work available for&nbsp;review</li><li>Demonstrated effective and successful verbal and written communication skills</li><li>U.S. citizen</li></ul><p><strong>Desired Qualifications</strong></p><ul><li>Full life cycle software application development experience</li><li>Experience with distributed computing platforms including Hadoop and Cloudera</li><li>Demonstrated ability to quickly learn and apply new technologies</li><li>Experience developing REST web services</li></ul>                    </div>                            <h2>                About APEX Expert Solutions            </h2>            <div><p>APEX Expert Solutions delivers analytic services, technologies, and training curriculum in support of Department of Defense customers. APEX tightly couples analysts, engineers, and trainers to bring mission success.</p><p>APEX Benefits include 401k with employer matching, 15-days Paid Time Off annually plus 10 Federal Holidays, Tuition Reimbursement, Healthcare, Dental, and Vision.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Vacations and holidays off                            </div>                            <div>                                 Cutting edge technology                            </div>                            <div>                                 Fantastic medical, dental and vision insurance                            </div>                            <div>                                 Work from home options                            </div>                            <div>                                 Social activities and events                            </div>                            <div>                                 Competitive salary and bonuses                            </div>                            <div>                                 Business casual attire                            </div>                            <div>                                 Collaborative environment                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG_TECH1:k_t_w:hadoop_bigdata-ml_8",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=8, ruby=0}",
      "REMOTE1_50",
      "TECH1_bigdata-ml",
      "TECH2_cesium",
      "TECH2_css",
      "TECH2_geospatial",
      "TECH2_javascript",
      "TECH2_rest",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "cesium",
      "css",
      "geospatial",
      "javascript",
      "rest"
    ]
  },
  {
    "id": "4UPf2HeTT0OiYYM7dre7fg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15607088",
    "title": "Caura & Co. | Seattle, WA | ONSITE/REMOTE | Full-time | AI Engineer | $180K-220K + substantial equity",
    "content": "<div>                  <span>Caura &amp; Co. | Seattle, WA | ONSITE/REMOTE | Full-time | AI Engineer | $180K-220K + substantial equity<p>Looking for an expert in natural language. We are re-inventing how technology companies contract with seasoned Data Professionals.</p><p>To apply, please contact me through my blog.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 4:00:05 AM",
    "tags": [
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k_t_w:artificial-intelligence_bigdata-ml_10",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=10, ruby=0}",
      "REMOTE1_100",
      "TECH1_bigdata-ml",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  }
]
}
