{
 "items": [
  {
    "id": "IY27NdzcRI6nW6BfitoYwQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16743193",
    "title": "Airtame (https://airtame.com) | Copenhagen, Denmark | Full-time, Onsite/Remote",
    "content": "<div>                  <span>Airtame (<a href='https://airtame.com' rel='nofollow'>https://airtame.com</a>) | Copenhagen, Denmark | Full-time, Onsite/Remote<p>Airtame is a fast-growing startup. Our wireless streaming solution helps people work better. We are based in windy Copenhagen, but have an office in New York that takes care of our U.S. customers. We're currently hiring:</p><p>* Senior Embedded Linux Engineer - Copenhagen, Denmark or Europe (<a href='https://airtame.com/jobs?gh_jid=4010452002' rel='nofollow'>https://airtame.com/jobs?gh_jid=4010452002</a>)</p><p>* Software Engineer in Test - Copenhagen, Denmark or Europe (<a href='https://airtame.com/jobs?gh_jid=4012067002' rel='nofollow'>https://airtame.com/jobs?gh_jid=4012067002</a>)</p><p>* Web Developer - Copenhagen, Denmark (<a href='https://airtame.com/jobs?gh_jid=4017568002' rel='nofollow'>https://airtame.com/jobs?gh_jid=4017568002</a>)</p><p>Our talented engineers are given significant ownership and responsibility over projects. We value rapid iteration, continuous integration and testing, and we are serious about producing high-quality, maintainable software. Frequent code reviews, linting, and pairing are all integral components of our engineering culture. We encourage experimenting with new technologies and constantly challenge ourselves to improve our code, processes, and systems.</p><p>You can read a bit about our values on our Company Culture Favro Board: <a href='https://favro.com/widget/2114a98cde73c1145a93bd8e/28429a244982e81373559868' rel='nofollow'>https://favro.com/widget/2114a98cde73c1145a93bd8e/28429a2449...</a></p><p>We sponsor work visas for non-EU applicants.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 1:00:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "wQoYu37ER3KQrgsv10P-bw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/136187/senior-full-stack-dev-with-ruby-python-react-analytics-fire?a=JFIBXryxPKo",
    "title": "SENIOR FULL-STACK DEV WITH RUBY/PYTHON/REACT -- 100% REMOTE, FLEXIBLE HOURS at Analytics Fire  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong><strong>Job Description</strong></strong></p><p><span>Analytics Fire builds custom software for the solar power industry. We’re looking for a senior full-stack developer with a willingness to acquire deep expertise around Ruby, Python, and React.js, in order to help us expand to support additional new high-tech sectors.</span></p><p><span>Analytics Fire is a small, distributed team working on a range of interesting projects. For example, last year we worked on a scalable IoT platform for utility grade solar power plants, a sales and design tool for residential solar, and a machine-learning powered autonomous cleaning robot. We’re looking for a fun, reliable, and highly collaborative, senior dev to join our team.</span></p><p><span>For reference, here is a list of technologies and tools we are currently actively using on a day-to-day basis:</span></p><ul><li><span>Front-end: JavaScript / React / Angular</span></li><li><span>Back-end: Ruby / Python / Node.js</span></li><li><span>Embedded (IoT): C, Embedded Linux, MQTT</span></li><li><span>Embedded (robotics): C/C++, ROS</span></li><li><span>Modern software techniques: RESTful APIs, SOA, PaaS, etc</span></li><li><span>Agile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc</span></li><li><span>Occasionally we need to do a small amount of work around: SFDC, iOS, Android, ARKit</span></li></ul><p><span>This is a remote position. We’re flexible about location and hours, so long as your working hours are in a very heavily US-overlapping time zone (eg: North America, Central America, South America, etc). We’re a really great match for a senior dev in a US-overlapping timezone who wants to work hard on interesting projects, while also having flexibility around time and geography.</span></p><p><strong><strong>Skills &amp; Requirements</strong></strong></p><p><span>Ideally, you should have 5+ years commercial full stack development, ideally within a startup environment. You should be comfortable autonomously driving your own high quality / high velocity contributions using a range of technologies.</span></p><p><span>We work with a variety of technologies, but are currently specifically looking for someone that has or can obtain expert level skills around Python, Ruby, and React.js.</span></p>                    </div>                            <h2>                About Analytics Fire            </h2>            <div><p><span>Analytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.</span></p><p><span>“Our goal founding, Analytics Fire, was to create the engineering department that we always dreamed of working for. Our dream is to be able to spend our time working on interesting problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”</span></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote                            </div>                            <div>                                 Flexible Schedule                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TECH1/frontend",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "embedded",
      "frontend"
    ]
  },
  {
    "id": "LU7FRaz6QF2XpMWO8M5gGQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/67140/senior-firmware-engineer-for-funded-startup-focused-on-eliminating-fuel-poverty-at-switchee-ltd/",
    "title": "Senior Firmware Engineer for funded startup focused on eliminating fuel poverty",
    "content": "Opportunity for a Senior Firmware Engineer to join a high-growth technology start-up focused on eliminating fuel poverty and improving living standards in social housing. <br /><br />Role: Senior Firmware Engineer, Switchee Ltd<br />Reporting to: Head of Product<br />Location: Camden, London<br /><br />*Our mission*<br /><br />At Switchee, we believe that everyone deserves to live in a decent home and that the environments we inhabit have a massive influence on our ability to enjoy life and prosper. <br />One in five households in the UK live in social housing, a sector with the right values at its core but that has historically struggled to deploy innovations in the home. Many residents still can’t afford to heat their homes and live in cold, mouldy properties they can’t be proud of.  <br />We believe that radical innovation in internet connected technology can ensure that every resident, every day, is living in a home that allows them to succeed. That’s why our products are built not just on great technology, but on an understanding of what people want from the space they live in.  <br />This approach led us to reimagine the most mundane household object, a thermostat, into a product that automagically reduces energy bills, looks great and offers control to those who want it. <br />We are also revolutionising the way social landlords manage their housing stock with an obsessively tailored SAAS property dashboard and handy alerts on things like when the boiler is going to break. <br />Our next project is to build the ultimate connected hub for the social home. It’s going to revolutionise the way residents interact with their properties and landlords manage their homes. <br /><br />*Our journey*<br /><br />We may be only three years old, but it’s already been quite a ride. Our first product, the internet connected Switchee thermostat is already in 35 of the biggest housing providers in the UK. <br />We’re growing 100% year on year and are backed by some of the best-known investors in technology and social impact. We are a small team of 15 passionate and ambitious people driven by a collective desire to make a positive impact in the housing sector, both for residents and landlords. <br /><br />We are looking for an outstanding individual to join our firmware department, which promises to grow considerably over the coming years. Your commitment to our values and mission are paramount. <br /><br />*Your responsibilities*<br /><br />As a junior firmware engineer it will be your responsibility to design and implement firmware solutions that run in an optimized manner on our hardware platform. The hardware platform comprises an ST ARM microcontroller, sensors, and advanced radio communications to deliver the best smart thermostat solution for social housing.   <br />We are looking for someone with drive and a creative mind capable of solving complex problems in a neat, simple and reliable fashion. You will be part of the engineering team and work closely with the current firmware team.<br /><br />*Your experience*<br /><br />As a senior firmware engineer, it will be your responsibility to architect, design and implement firmware solutions that run on our hardware platform. You will be working on a new hardware platform that comprises an ST ARM microcontroller, sensors, and advanced radio communications.  You will interface with multiple teams including but not limited to hardware design, cloud software, algorithm and software testing to develop the best firmware solution for an overall eco-system. <br /><br />You will also contribute to develop excellent software practices (lead code reviews, design reviews, release mechanism). You will analyse and enhance efficiency, stability and scalability of system resources as well to deliver the best software solution for our product. We are looking for someone with drive and a creative mind capable of solving complex problems in a neat, simple and reliable fashion.<br /><br />Your experience<br />We firmly believe extraordinary people can come from a wide range of places – but we wouldn’t be surprised if the person who gets this role has:<br /><br />•     8+ years of experience in embedded software engineering<br />•     Master/bachelor degree in Computer Science or Engineering from a leading university<br />•     Solid programming experience in C / C++ and preferably scripting languages like python<br />•     Experience in hands-on development and troubleshooting on embedded targets using oscilloscope, logic analyser and jtag.<br />•     Experience with common interfaces like SPI,I2C,UART,USB, DMA, Flash and GPIO’s.<br />•     Knowledgeable in use of tool chains and debug tools like GCC<br />•     Experience with ARM based processors (Specifically the Cortex M family).<br />•     Knowledge of reading schematics and data sheets for components.<br />•     Familiarity with software configuration management tools, defect tracking tools, and peer review like Jira/GIT and confluence.<br />•     Experience working with typical IoT communication protocol like BT, Zigbee, ZWave or Sub-GHz communication<br /><br />*You*<br /><br />We are a diverse bunch of people at Switchee. That said, there are some characteristics we always look for: <br /> <br />•     You deeply care about Switchee’s mission; you have a desire to build something revolutionary, that will disrupt an industry, and positively impact ordinary people’s lives.<br /><br />•     You care about the environment, are interested in energy efficiency and have thought about the challenges and opportunities posed by an evolving domestic energy market<br /><br />•     You like technology and neat solutions to complex problems<br /><br />•     You thrive on challenge and change; you naturally gravitate to the hardest questions first and love thinking differently to solve them. <br /><br />•     You are biased towards action and you’re happiest when you’re ‘getting stuff done’.<br /><br />•     You’re open, positive & straightforward. You’re not afraid to stand up for your convictions, even when it’s hard to do so.<br /><br />•     You delight in your colleagues’ successes and thrive on your failures; you grasp any opportunity for learning and constantly seek to improve.<br /> <br />*Life at Switchee*<br /> <br />We like to keep things simple and flexible at Switchee and consider you to be joining our family. We don’t currently track holidays so you’re free to take as much as you need. We often work remotely but are sensitive to the needs of our colleagues. <br /> <br />We socialise together with regular outings in London and an annual “working remotely” trip where you have the option (but not obligation) to join us in working from a fun location. <br /> <br />If we end up working together, we can offer a competitive salary and a generous stake in the company. <br /> <br />If you’d like to apply please submit a CV and cover letter to the CEO, Adam Fudakowski by emailing talent@switchee.co",
    "urlFetchPending": false,
    "published": "Mar 15, 2018 10:11:57 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "LgYfRuRTT9-ccoTcSvManA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/67139/senior-hardware-engineer-for-funded-start-up-focused-on-eliminating-fuel-poverty-at-switchee-ltd/",
    "title": "Senior Hardware Engineer for funded start-up focused on eliminating fuel poverty",
    "content": "Opportunity for a Senior Hardware Engineer to join a high-growth technology start-up focused on eliminating fuel poverty and improving living standards in social housing. <br /><br />Role: Senior Hardware Engineer, Switchee Ltd<br />Reporting to: Head of Product<br />Location: Camden, London<br /><br />*Our mission*<br /><br />At Switchee, we believe that everyone deserves to live in a decent home and that the environments we inhabit have a massive influence on our ability to enjoy life and prosper. <br />One in five households in the UK live in social housing, a sector with the right values at its core but that has historically struggled to deploy innovations in the home. Many residents still can’t afford to heat their homes and live in cold, mouldy properties they can’t be proud of.  <br />We believe that radical innovation in internet connected technology can ensure that every resident, every day, is living in a home that allows them to succeed. That’s why our products are built not just on great technology, but on an understanding of what people want from the space they live in.  <br />This approach led us to reimagine the most mundane household object, a thermostat, into a product that automagically reduces energy bills, looks great and offers control to those who want it. <br />We are also revolutionising the way social landlords manage their housing stock with an obsessively tailored SAAS property dashboard and handy alerts on things like when the boiler is going to break. <br />Our next project is to build the ultimate connected hub for the social home. It’s going to revolutionise the way residents interact with their properties and landlords manage their homes. <br /><br />*Our journey*<br /><br />We may be only three years old, but it’s already been quite a ride. Our first product, the internet connected Switchee thermostat is already in 35 of the biggest housing providers in the UK. <br />We’re growing 100% year on year and are backed by some of the best-known investors in technology and social impact. We are a small team of 15 passionate and ambitious people driven by a collective desire to make a positive impact in the housing sector, both for residents and landlords. <br />We are looking for an outstanding individual to lead our hardware department, which promises to grow considerably over the coming years. Your commitment to our values and mission are paramount. <br /><br />*Your responsibilities*<br /><br />As a senior hardware engineer, it will be your responsibility to design a new hardware platform. In your role, you will be involved in all aspects of EE hardware design including system definition, board circuit design and validation. <br />You will be working on a new hardware platform that comprises an ARM microcontroller, sensors, and advanced radio communications.  You will interface with multiple teams including but not limited to the embedded firmware team, the cloud software team and the algorithm team to design the most suitable solution for an overall eco-system. In addition, you will contribute to the development of production test equipment to enable testing of the hardware when product go to production.    <br />We are looking for someone with drive and a creative mind capable of solving complex problems in a neat, simple and reliable fashion. To be successful you need to be highly motivated and detailed oriented while showing highest standards of responsibilities.<br /><br />*Your experience*<br /><br />We firmly believe extraordinary people can come from a wide range of places – but we wouldn’t be surprised if the person who gets this role has:<br /><br />•    Master/bachelor degree in electrical engineering from a leading university    <br />•    5+ years of experience in consumer product design; <br />•    5+ years of experience with system level design including circuit design, system bring up, integration & debug <br />•    Knowledge of processor architecture, digital circuit design and comms protocols such as I2C, UART, SPI, <br />•    Knowledge of mixed-signal board level design;<br />•    Experience developing robust designs for ESD/EMI immunities and RF de-sensitization;<br />•    Experience integrating RF technologies such as radio/GSM; <br />•    Experience leading and driving design development from schematic capture, PCB layout through assembly;<br />•    Must enjoy being hands-on in the lab and want to be in the details (soldering, oscilloscopes, data acquisition)<br />•    Experience with Altium, Cadence, OrCAD, or Allegro<br />•    Experience working with typical IoT communication protocol like BT, Zigbee, ZWave or Sub-GHz comms<br /><br />*You*<br /><br />We are a diverse bunch of people at Switchee. That said, there are some characteristics we always look for: <br /><br />•    You deeply care about Switchee’s mission; you have a desire to build something revolutionary, that will disrupt an industry, and positively impact ordinary people’s lives.<br /><br />•    You care about the environment, are interested in energy efficiency and have thought about the challenges and opportunities posed by an evolving domestic energy market<br /><br />•    You like technology and neat solutions to complex problems<br /><br />•    You thrive on challenge and change; you naturally gravitate to the hardest questions first and love thinking differently to solve them. <br /><br />•    You are biased towards action and you’re happiest when you’re ‘getting stuff done’.<br /><br />•    You’re open, positive & straightforward. You’re not afraid to stand up for your convictions, even when it’s hard to do so.<br /><br />•    You delight in your colleagues’ successes and thrive on your failures; you grasp any opportunity for learning and constantly seek to improve.<br /><br />*Life at Switchee*<br /><br />We like to keep things simple and flexible at Switchee and consider you to be joining our family. We don’t currently track holidays so you’re free to take as much as you need. We often work remotely but are sensitive to the needs of our colleagues. <br /><br />We socialise together with regular outings in London and an annual “working remotely” trip where you have the option (but not obligation) to join us in working from a fun location. <br /><br />If we end up working together, we can offer a competitive salary and a generous stake in the company. <br /><br />If you’d like to apply please submit a CV and cover letter to Adam Fudakowski",
    "urlFetchPending": false,
    "published": "Mar 15, 2018 10:03:45 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "wy5G0c7cRnSQPJGMxzZDcg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/67007/junior-firmware-engineer-for-funded-start-up-focused-on-eliminating-fuel-poverty-at-switchee-ltd/",
    "title": "Junior Firmware Engineer for funded start-up focused on eliminating fuel poverty",
    "content": "Opportunity for a Junior Firmware Engineer to join a high-growth technology start-up focused on eliminating fuel poverty and improving living standards in social housing. <br /><br />Role: Junior Firmware Engineer, Switchee Ltd<br />Reporting to: Head of Product<br />Location: Camden, London<br /><br />*Our mission*<br /><br />At Switchee, we believe that everyone deserves to live in a decent home and that the environments we inhabit have a massive influence on our ability to enjoy life and prosper. <br />One in five households in the UK live in social housing, a sector with the right values at its core but that has historically struggled to deploy innovations in the home. Many residents still can’t afford to heat their homes and live in cold, mouldy properties they can’t be proud of.  <br />We believe that radical innovation in internet connected technology can ensure that every resident, every day, is living in a home that allows them to succeed. That’s why our products are built not just on great technology, but on an understanding of what people want from the space they live in.  <br />This approach led us to reimagine the most mundane household object, a thermostat, into a product that automagically reduces energy bills, looks great and offers control to those who want it. <br />We are also revolutionising the way social landlords manage their housing stock with an obsessively tailored SAAS property dashboard and handy alerts on things like when the boiler is going to break. <br />Our next project is to build the ultimate connected hub for the social home. It’s going to revolutionise the way residents interact with their properties and landlords manage their homes. <br /><br />*Our journey*<br /><br />We may be only three years old, but it’s already been quite a ride. Our first product, the internet connected Switchee thermostat is already in 35 of the biggest housing providers in the UK. <br />We’re growing 100% year on year and are backed by some of the best-known investors in technology and social impact. We are a small team of 15 passionate and ambitious people driven by a collective desire to make a positive impact in the housing sector, both for residents and landlords. <br />We are looking for an outstanding individual to join our firmware department, which promises to grow considerably over the coming years. Your commitment to our values and mission are paramount. <br /><br />*Your responsibilities*<br /><br />As a junior firmware engineer it will be your responsibility to design and implement firmware solutions that run in an optimized manner on our hardware platform. The hardware platform comprises an ST ARM microcontroller, sensors, and advanced radio communications to deliver the best smart thermostat solution for social housing.   <br />We are looking for someone with drive and a creative mind capable of solving complex problems in a neat, simple and reliable fashion. You will be part of the engineering team and work closely with the current firmware team.<br /><br />*Your experience*<br /><br />We firmly believe extraordinary people can come from a wide range of places – but we wouldn’t be surprised if the person who gets this role has:<br /> <br />•      Master/bachelor degree in Computer Science or Engineering from a leading university      <br />•      3+ years experience in developing for embedded systems at application level; <br />•      3+ years experience with driver and board-level software development<br />•      3+ years experience with board bring up and systems debugging<br />•      Proven ability to drive a subsystem or product to completion<br />•      Experience developing firmware in a bare-metal environment.<br />•      Familiarity with debugging tools such as bus analyzers and oscilloscopes<br />•      Solid programming experience in C / C++ and preferably scripting languages like python<br />•      Experience in hands-on development and troubleshooting on embedded targets using oscilloscope, logic analyser and jtag.<br />•      Experience with common interfaces like SPI,I2C,UART,USB, DMA, Flash and GPIO’s.<br />•      Knowledgeable in use of tool chains and debug tools like GCC<br />•      Experience with ARM based processors (Specifically the Cortex M family).<br />•      Knowledge of reading schematics and data sheets for components.<br />•      Familiarity with software configuration management tools, defect tracking tools, and peer review like Jira/GIT and confluence.<br />•      Experience working with typical IoT communication protocol like BT, Zigbee, ZWave or Sub-GHz communication<br /> <br />*You*<br /><br />We are a diverse bunch of people at Switchee. That said, there are some characteristics we always look for: <br /> <br />•     You deeply care about Switchee’s mission; you have a desire to build something revolutionary, that will disrupt an industry, and positively impact ordinary people’s lives.<br /><br />•     You care about the environment, are interested in energy efficiency and have thought about the challenges and opportunities posed by an evolving domestic energy market<br /><br />•     You like technology and neat solutions to complex problems<br /><br />•     You thrive on challenge and change; you naturally gravitate to the hardest questions first and love thinking differently to solve them. <br /><br />•     You are biased towards action and you’re happiest when you’re ‘getting stuff done’.<br /><br />•     You’re open, positive & straightforward. You’re not afraid to stand up for your convictions, even when it’s hard to do so.<br /><br />•     You delight in your colleagues’ successes and thrive on your failures; you grasp any opportunity for learning and constantly seek to improve.<br /> <br />*Life at Switchee*<br /> <br />We like to keep things simple and flexible at Switchee and consider you to be joining our family. We don’t currently track holidays so you’re free to take as much as you need. We often work remotely but are sensitive to the needs of our colleagues. <br /> <br />We socialise together with regular outings in London and an annual “working remotely” trip where you have the option (but not obligation) to join us in working from a fun location. <br /> <br />If we end up working together, we can offer a competitive salary and a generous stake in the company. <br /> <br />If you’d like to apply please submit a CV and cover letter to the CEO, Adam Fudakowski by emailing talent@switchee.co",
    "urlFetchPending": false,
    "published": "Mar 12, 2018 4:09:09 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "3hYKDVw0RtqApP0vuCRWoA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16493712",
    "title": "Spydermix | https://www.spydermix.org/ | Engineer | Full-Time | Remote",
    "content": "<div>                  <span>Spydermix | <a href='https://www.spydermix.org/' rel='nofollow'>https://www.spydermix.org/</a> | Engineer | Full-Time | Remote<p>Interested in giving a giant middle finger to repressive regimes? Do you eat DHTs, blockchains &amp; P2P routing algorithms for lunch? Are ridiculously hard problems your idea of fun? Are you the kind of person who could figure out how to create a uni-directional off-chain micro-payment channel with multi-sig support for a verifiable market with order matching and final settlement via smart contract, without trusted parties - taking into account the impossibility of fair exchange without a trusted third party, maybe based on probabilistic payments and/or zero knowledge contingent payments? Did you smile reading that last part? Good, it’s more fun when you have a sense of humor.</p><p>We’re working on changing the game with the backing of the world’s largest VPN service. An unstoppable multi-protocol decentralized onion routing system that is going to weave privacy into the very fabric of the Internet. Like TOR, if TOR was embedded into everything, had sensible economic incentive mechanisms, and was resistant to sybil attacks.</p><p># Scale of initial deployment</p><p>Servers : 100K+ Traffic : Exabytes Users : Millions</p><p># Things you probably already know in and out</p><p>IP networking, onion routing, VPNs, applied cryptography &amp; blockchains at the protocol level.</p><p># Things you’ll wonder when you read the prototype Apache module for fun</p><p>- Why don’t most HTTP proxies support keep-alives?</p><p>- Can you add a flag to the HTTP_PIPE contract to specify whether or not to use Global Session Support (GSS)?</p><p>- Is there a better way to track a single session across separate processes other than keeping track of session state in shared memory?</p><p>If you think you’re the type of person we’re looking for. Get in touch by sending a shout out to: contact [at] spydermix.org<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 7:00:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded",
      "python"
    ]
  },
  {
    "id": "IkVFCsvBQ9imI6eefZhPNA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/analytics-fire-senior-full-stack-dev-with-ruby-python-react-100-remote-flexible-hours",
    "title": "Analytics Fire: SENIOR FULL-STACK DEV WITH RUBY/PYTHON/REACT -- 100% REMOTE, FLEXIBLE HOURS",
    "content": "<div>  <div>    <h2>SENIOR FULL-STACK DEV WITH RUBY/PYTHON/REACT -- 100% REMOTE, FLEXIBLE HOURS</h2>      <h4>Posted Feb 24</h4>    <h3>      <span>Analytics Fire</span><br>      <span>Headquarters: Palo Alto, CA</span><br>        analyticsfire.com      <br>      <a rel='nofollow'>View all Analytics Fire jobs →</a>    </h3>  </div>    </div>  <div>    <div><span><h3><span>Job Description</span></h3></span></div><div><span><br></span></div><div><span>Analytics Fire builds custom software for the solar power industry. We’re looking for a senior full-stack developer with a willingness to acquire deep expertise around Ruby, Python, and React.js, in order to help us expand to support additional new high-tech sectors.</span></div><div><br></div><div><span>Analytics Fire is a small, distributed team working on a range of interesting projects. For example, last year we worked on a scalable IoT platform for utility grade solar power plants, a sales and design tool for residential solar, and a machine-learning powered autonomous cleaning robot. We’re looking for a fun, reliable, and highly collaborative, senior dev to join our team.</span></div><div><br></div><div><span>For reference, here is a list of technologies and tools we are currently actively using on a day-to-day basis:</span></div><div><br></div><ul><li><span>Front-end: JavaScript / React / Angular</span><br><br></li><li><span>Back-end: Ruby / Python / Node.js</span><br><br></li><li><span>Embedded (IoT): C, Embedded Linux, MQTT</span><br><br></li><li><span>Embedded (robotics): C/C++, ROS</span><br><br></li><li><span>Modern software techniques: RESTful APIs, SOA, PaaS, etc</span><br><br></li><li><span>Agile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc</span><br><br></li><li><span>Occasionally we need to do a small amount of work around: SFDC, iOS, Android, ARKit</span><br><br></li></ul><div><span>This is a remote position. We’re flexible about location and hours, so long as your working hours are in a very heavily US-overlapping time zone (eg: North America, Central America, South America, etc). We’re a really great match for a senior dev in a US-overlapping timezone who wants to work hard on interesting projects, while also having flexibility around time and geography.</span><br></div><div></div><div><span><br></span></div><div><h3><span>Skills &amp; Requirements</span></h3></div><div><span><br></span></div><div><span>Ideally, you should have 5+ years commercial full stack development, ideally within a startup environment. You should be comfortable autonomously driving your own high quality / high velocity contributions using a range of technologies.</span></div><div><br></div><div><span>We work with a variety of technologies, but are currently specifically looking for someone that has or can obtain expert level skills around Python, Ruby, and React.js.</span></div><div><br></div><div><h3><span>About Analytics Fire</span></h3></div><div><span><br></span></div><div><span>Analytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.</span></div><div><br></div><div><span>“Our goal founding, Analytics Fire, was to create the engineering department that we always dreamed of working for. Our dream is to be able to spend our time working on interesting problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='mailto:join-us@analyticsfire.com' rel='nofollow'>join-us@analyticsfire.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 24, 2018 1:31:49 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TECH1/frontend",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "embedded",
      "frontend"
    ]
  },
  {
    "id": "2sZicyVUR7eg2kg7a9Auyg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobs.github.com-remote",
    "url": "http://jobs.github.com/positions/95048694-1952-11e8-86d5-38e7f24d7ed9",
    "title": "Full Time: SENIOR FULL-STACK DEV WITH RUBY/PYTHON/REACT -- 100% REMOTE, FLEXIBLE HOURS at Analytics Fire in Remote",
    "content": "<p><strong>Job Description</strong></p><p>Analytics Fire builds custom software for the solar power industry. We’re looking for a senior full-stack developer with a willingness to acquire deep expertise around Ruby, Python, and React.js, in order to help us expand to support additional new high-tech sectors.</p><p>Analytics Fire is a small, distributed team working on a range of interesting projects. For example, last year we worked on a scalable IoT platform for utility grade solar power plants, a sales and design tool for residential solar, and a machine-learning powered autonomous cleaning robot. We’re looking for a fun, reliable, and highly collaborative, senior dev to join our team.For reference, here is a list of technologies and tools we are currently actively using on a day-to-day basis:</p><ul><li>Front-end: JavaScript / React / Angular</li><li>Back-end: Ruby / Python / Node.js</li><li>Embedded (IoT): C, Embedded Linux, MQTT</li><li>Embedded (robotics): C/C++, ROS</li><li>Modern software techniques: RESTful APIs, SOA, PaaS, etc</li><li>Agile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc</li><li>Occasionally we need to do a small amount of work around: SFDC, iOS, Android, ARKit</li></ul><p>This is a remote position. We’re flexible about location and hours, so long as your working hours are in a very heavily US-overlapping time zone (eg: North America, Central America, South America, etc). We’re a really great match for a senior dev in a US-overlapping timezone who wants to work hard on interesting projects, while also having flexibility around time and geography.</p><p><strong>Skills &amp; Requirements</strong></p><p>Ideally, you should have 5+ years commercial full stack development, ideally within a startup environment. You should be comfortable autonomously driving your own high quality / high velocity contributions using a range of technologies.</p><p>We work with a variety of technologies, but are currently specifically looking for someone that has or can obtain expert level skills around Python, Ruby, and React.js.</p><p><strong>About Analytics Fire</strong></p><p>Analytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.</p><p>“Our goal founding, Analytics Fire, was to create the engineering department that we always dreamed of working for. Our dream is to be able to spend our time working on interesting problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”</p>",
    "urlFetchPending": false,
    "published": "Feb 24, 2018 1:06:19 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TECH1/frontend",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "embedded",
      "frontend"
    ]
  },
  {
    "id": "dytbpbOEQqGhbrMasxXucA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/66497/robotics-control-engineer-at-zoa-robotics/",
    "title": "Robotics Control Engineer",
    "content": "*ZOA Robotics*<br /><br />ZOA is a startup based in London (UK) developing highly mobile legged robots. We are a small, ambitious, talented team focused on shipping a revolutionary product. We have built and proven prototypes and we are again growing our team.<br /><br />We engineer robots in a new way – dynamic by design, lightweight, safe. Elegantly simple hardware backed by cutting-edge software.<br /><br />Our goal is to build robots with the grace of animals working with people. Anywhere people can go, and some where people can't.<br /><br />*The Role*<br /><br />You will work alongside our AI lead to develop all aspects of robot software and systems: implementing low-level controllers, designing safe behaviours and advancing autonomy. This role reports directly to the CEO. Flexibility, ability to learn, innovate and solve problems are key for this position.<br /><br />Responsibilities include establishing onboard sensing and control on ARM microcontrollers (using C), implementing of machine-learned behaviours onto the robot’s linux system and developing vision, navigation and control software. The role also includes on-the-job training and responsibility for PCB design, eventually growing to responsibility for all electrical aspects of the robot and working alongside the hardware lead on hardware design.<br /><br />Salary: £38,000 to £40,000 + equity. The role is based in Hackney Wick, East London.<br /><br />*Requirements*<br /><br />* Experience as a software developer (≥1 yr) working on code as part of a team<br />* Experience developing for micro-controllers or similar low-level work (e.g. device driver coding)<br />* Graduate in CS/EE/Mechatronics or equivalent numerate field<br /><br />*Desirable*<br /><br />* Experience with electrical PCB design<br />* Experience with Python<br />* Experience with robot, joint or motor control<br />* Familiarity with linux environments and deployments<br />* Familiarity with machine learning techniques",
    "urlFetchPending": false,
    "published": "Feb 22, 2018 1:30:01 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "Mf-Kbr1UTyyjsJ8BjDQ2fA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16334619",
    "title": "Liferay Software Engineer | Saga Healthcare IT | Location - Remote",
    "content": "<div>                  <span>Liferay Software Engineer | Saga Healthcare IT | Location - Remote<p>Talented software engineer with strong Liferay Portal 7 CE experience.</p><p>Core competencies:</p><p><i>2+ years of experience in design and development of Liferay applications involving hooks, themes, layouts, portlets (JSR-168/JSR-286 Portlet development), and external Plug-ins.</i></p><p>Experience with securing Liferay servers (Enable audit logging, assign correct roles to users)</p><p><i>Strong knowledge on SOAP and Restful web services and Configuring WS-Security.</i></p><p>A strong understanding of Liferay best practices, portal standards and governance processes.</p><p><i>Working knowledge and experience with HTML5</i></p><p>Nice to have:</p><p>AWS familiarity</p><p>*Apache &amp; Nginx</p><p>Apply here: <a href='https://www.saga-it.com/careers' rel='nofollow'>https://www.saga-it.com/careers</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 8, 2018 9:06:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TECH1/frontend",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded",
      "frontend"
    ]
  },
  {
    "id": "VeH0oumOQbaL1TMKWkf1ew",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/140116/javascript-full-stack-developer-remote-or-on-ifit?a=KZpImqtTthm",
    "title": "Javascript Full Stack Developer (Remote or On-Site) at iFit (Logan, UT)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Health &amp; Fitness</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>About us</p><p>iFit's focus is to connect everybody to everything fitness. We love software that talks to real things. Our parent company is the world's largest fitness manufacturer (our brands include: NordicTrack, ProForm, Gold's Gym, Freemotion, Altra Shoes, and more), which provides us a LOT of devices, shoes, embedded tablets, and other exciting physical things to engage with. We believe a healthy lifestyle should be fun, so we constantly push the limits to bring our customers state-of-the-art products that will help them in every aspect of their lives.</p><p>About the work</p><p>We're looking for experienced JavaScript (Node) developers that can help us build an amazing fitness platform. Here's a taste of what you can expect:</p><ul><li>&nbsp;Develop ifit.com by working closely with our front-end devs creating React components.</li><li>&nbsp;Optimize our recommendation engines with aggregate MongoDB queries.</li><li>&nbsp;Design performance-driven endpoints for our public API.</li><li>&nbsp;Ensure all of our code works as designed by helping build out our expansive test suite.</li><li>&nbsp;Participate in peer code reviews. A great way to produce solid code and learn new things!</li><li>&nbsp;Engage in weekly tech talks. Got something interesting to teach us? Please share!</li></ul><p>About you</p><p>You are a driven, self-motivated software engineer that has strong experience with JavaScript (Node) and familiarity with NoSQL databases. We are constantly evaluating our process and toolset so that we can be assured we are always working at our best; that means you are eager to learn and contribute to our growing team. You are a great communicator and collaborator. You love problem solving, both at the micro (debugging code) and macro (architecting new features) levels. Most of all you want to be a part of a diverse team that knows how to have fun while creating software that changes people's lives!</p><p>A little bit more about us</p><p>iFit is comprised of both onsite and remote employees. We are headquartered in Logan, UT and you are welcome to work there from the office or mostly anywhere else in the US (there are a few exceptions). Currently the entire web team (that's us) works remotely, so we are very experienced and comfortable working in a remote-friendly environment. We currently use Slack, Zoom, and Google to keep our communication alive and engaged!</p><p><a href='https://www.ifit.com/aboutus' rel='nofollow'>https://www.ifit.com/aboutus</a></p><p>Your perks</p><ul><li>Health, Vision, Dental, and matching 401k benefits</li><li>MacBook Pro and external monitor</li><li>Free cell phone of your choice</li><li>Free piece of fitness equipment of your choice</li><li>Monthly education stipend</li><li>Regular team meet ups</li></ul><p>And more...</p><p>Just so you know</p><p>We cannot hire outside of the US or non US citizens</p><p>We cannot hire contractors</p><p>AAP/EOE</p><p>&quot;We do not discriminate in employment opportunities or practices on the basis of race, color, religion, sex, national origin, age, ancestry, mental or physical disability, sexual orientation, gender identity, medical condition, genetic information, marital status, Veteran status or any other characteristic protected by law.&quot;</p>                    </div>                            <h2>                About iFit            </h2>            <div><p>See <a href='https://www.ifit.com/aboutus' rel='nofollow'>https://www.ifit.com/aboutus</a></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Great health, dental, vision, and 401K                            </div>                            <div>                                 Strong &amp; Healthy Distributed Team Environment                            </div>                            <div>                                 Yearly Pay/Performance Evaluations                            </div>                            <div>                                 Regular On-site visits                            </div>                            <div>                                 All Equipment provided: iMac or MacBook, phone and phone plan, tablets                            </div>                            <div>                                 Signing bonus of fitness equipment (treadmill, mattress, etc)                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TECH1/frontend",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "embedded",
      "frontend"
    ]
  },
  {
    "id": "0ZdJ3N4GQA6LpuLc6X0vIw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/153118/remote-senior-python-developer-zigbee-iot-surge?a=PlLlS1h0LT2",
    "title": "Remote Senior Python Developer- ZigBee (IoT), Linux, Embedded is REQUIRED at Surge ()",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Embedded Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Surge Forward is looking for smart, self-motivated, experienced, senior-level consultants who enjoy the freedom of telecommuting and flexible schedules, to work as long-term, consistent (40 hrs/week) independent contractors on a variety of software development projects.</p><p>Sorry, No Visas. Must be located in the US and/ or Canada.&nbsp;</p><p>Our immediate need is for a Senior&nbsp;Python Developer- ZigBee (IoT), Linux, Embedded is REQUIRED</p><p>For immediate consideration, email resume and include your cell phone number and start date.</p>                    </div>                            <h2>                About Surge            </h2>            <div><p>Surge is an onshore provider of custom web, cloud, mobile, digital, and desktop software development and consulting services to clients in every industry, from hot startups to Fortune 500 companies.<br><br>Founded in 2007, and listed on the Inc. 5000 list of America’s fastest growing companies for five straight years, Surge has successfully delivered hundreds of software products, apps, and solutions to its clients using a proven agile/scrum development process combined with an elite group of North American software professionals.<br><br>Simply put, Surge offers America’s best software engineers, on demand, at rates 30-50% less than the competition.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Great Pay                            </div>                            <div>                                 Choose Your Hours                            </div>                            <div>                                 Work From Home                            </div>                            <div>                                 Work With Happy People                            </div>                            <div>                                 Zero Commute                            </div>                            <div>                                 See Your Family More                            </div>                            <div>                                 Travel While You Work                            </div>                            <div>                                 Software Provided                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "embedded",
      "python"
    ]
  },
  {
    "id": "P-_s6tyITxmjRkHXm5oAlQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165596/software-engineer-for-km-ds-clean-up-mymic-llc?a=TxdtcC0iD96",
    "title": "Software Engineer for KM/DS Clean-Up at MYMIC LLC ()",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Database Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, Requirements Analysis, Software Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Position:&nbsp;&nbsp;</strong>Senior Software Engineer (2 openings)</p><p><strong>Location:&nbsp;&nbsp;</strong>White Plains, MD or Remote within Nat'l Capital Region</p><p><strong>Clearance:&nbsp;&nbsp;</strong>Top Secret</p><p><strong>Key Requirements:&nbsp;&nbsp;</strong>Must have OR BE WILLING TO GET Security+ certification, PLUS an OS/CE certification, such as MCSE, CCNA or other related cert by end of POP.</p><p><strong>Period of Performance:&nbsp;&nbsp;</strong>From&nbsp;start date to June 16, 2018<strong>;&nbsp;</strong>then move over to longer-term IT Next Support Services contract (which may provide opportunity work remotely with only occasional travel to the Pentagon)</p><p><strong>&nbsp;Expectations Include:</strong></p><ul><li>Records Management</li><ul><li>Use existing policy and KMDS v2 business process maps to identify and refince standards and processes</li><li>Ensure users can distinguish between working and final copies of all documents</li><li>Identify documents which no longer need to be maintained</li></ul><li>Develop Data Schema for documents and document control numbers based on various capability requirements</li><ul><li>Document Associations support capability requirements documents</li><li>Capability Requirement Document Decomposition IAW the Capabiity Mission Lattice</li></ul><li>Data Quality Assurances - use existing systems to develop business rules; automated processes preferred over manual</li><li>Data Enhancement - develop and execute a strategy to transition current processes and data within BizFlow 12.4 and Alfresco Community to data schema&nbsp;</li><li>Analysis and Requirements Gathering</li><ul><li>Conduct requirements gathering sessions</li><li>Analyze system base code</li><li>Analyze migrated information to ensure BizFlow can access current and archived data</li><li>Bring data fields from BizFlow and Alfresco Community into developed data schema</li></ul><li>Achieve Milestones</li><ul><li>Records management, data schema, and data QA processes shall be developed no later than two (2) months of the start of work</li><li>Data enhancement shall be complete within six (6) months of the start of work</li></ul><li>Establish and report on task controls</li></ul><p><strong>Required Knowledge, Skills and Abilities:</strong></p><ul><li>Proficiency in programming and scripting methodologies</li><li><strong>Relational database</strong>&nbsp;background (eg&nbsp;<strong>MS</strong>&nbsp;<strong>SQL Server</strong>, MySQL or Oracle)</li><li>Working knowledge of scripting and functional programming languages</li><li>Experience with&nbsp;<strong>Java</strong></li><li>Experience with&nbsp;<strong>Alfresco&nbsp;</strong><em>desired</em></li><li>Experience with web and database server administration</li><li>DoD 8570.1 IAT II certified (additional details below!)</li><li>Excellent interpersonal and oral/written communication skills</li></ul><p><strong>Clearance:</strong></p><p>Candidate must have a current final Top Secret clearance, verifiable in JPAS.</p><p><strong>Certifications:</strong></p><p>Must be IAT Level II certified at time of hire, OR, willing to take and pass BOTH a Security+ CE certification (or equivalent), AND an OS/CE certification (<em>examples&nbsp;</em>include:&nbsp; MCSE, CCNA, RHCE, MTA, or Oracle 10g)&nbsp;by end of POP.</p><p><strong>Education and Experience:</strong></p><p>Bachelors’ degree from an accredited college or university within a relevant curriculum or major field of study, plus (6) years of task related experience, OR</p><p>An Associate’s degree from a college or university within a relevant curriculum or major field of study, plus eight (8) years of task related experience, OR</p><p>An applicable training certificate issues in accordance with guidelines provided by the software vendor (i.e. Oracle 9i) from an accredited training institution plus twelve (12) years of task related experience.</p><p>This contractor and subcontractor shall abide by the requirements of 41 CFR 60-1.4(a), 60-300.5(a) and 60-741.5(a). These regulations prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, religion, sex, or national origin. Moreover, these regulations require that covered prime contractors and subcontractors take affirmative action to employ and advance in employment individuals without regard to race, color, religion, sex, national origin, protected veteran status or disability.&nbsp;</p><p>Per EO 11246, this federal contractor and subcontractor will refrain from discharging, or otherwise discriminating against, employees or applicants who inquire about, discuss, or disclose their compensation or the compensation of other employees or applicants. An exception exists where the employee or applicant makes the disclosure based on information obtained in the course of performing his or her essential job functions.</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Start with 16 days of PTO (Paid Time Off)                            </div>                            <div>                                 Provide all 10 Federal Holidays (6 of these are floating holidays!)                            </div>                            <div>                                 Health, Vision and Dental Care Insurance                            </div>                            <div>                                 Company paid life Insurance/STD/LTD                            </div>                            <div>                                 4% dollar for dollar match on your 401(k)                            </div>                            <div>                                 Tuition assistance; training/conference/certification reimbursement                            </div>                            <div>                                 Transportation Savings Account to help with Metro, parking, etc.                            </div>                            <div>                                 AFLAC Supplemental Insurance                            </div>                            <div>                                 Legal Shield/Identity Theft protection offered                            </div>                            <div>                                 Monday - Friday, 1st shift, 40 hours a week - standard!                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "2nBraOexRO-3pt2XUAzrKg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165094/software-developer-solar-technology-inc?a=TmMjr9MGWCk",
    "title": "Software Developer at Solar Technology Inc. ()",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Embedded Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>GPS Tracking, Traffic Safety</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>You’ll be joining a small team which develops and maintains a collection of embedded products, server support software, and desktop control software. Though you will work closely with other team members, this position will grow to provide substantial independent responsibilities and a rewarding career.</p><p>Your development responsibilities will be varied, and include:</p><ul><li>Using Java and some C/C++ to develop the software that controls our Linux-based variable message signs.</li><li>Using Java to develop features in the server control software which oversees thousands of message boards, arrow boards, and other equipment.</li><li>Developing programs on embedded Linux systems to support remote sensors such as radar, queue detectors, etc.</li><li>Developing programs which run in our server cluster and remotely read data from sensors, cameras, and other data sources directly connected to the internet.</li><li>Occasionally developing microcontroller firmware for resource constrained 8-bit and 32-bit embedded devices (display modules, charge controller, etc.)<br><br></li></ul><p>The languages we use are Java, C, C++, Python, and Perl. The ideal candidate will have experience with Java or at least an object-oriented programming language with native types (e.g. C++), higher level languages (e.g. Perl, Python), and the ability to quickly learn new languages, libraries, and tools. The ability to communicate effectively with non-programmers is a requirement.</p><p>As many of our products run embedded linux and our development environment is Linux based, experience with Linux will be very helpful. We use git for version control and Jira for issue tracking, and HipChat for communication within the development team, including (typically brief) daily meetings.</p><p>All candidates must be eligible to reside and work in the US. We strongly prefer residence within 300 miles of the factory in Allentown, PA.</p>                    </div>                            <h2>                About Solar Technology Inc.            </h2>            <div><p>Solar Technology Inc. is a leading designer, developer and manufacturer of portable solar powered roadside LED flashing arrow panels, variable message signs, radar speed displays, ITS systems and remote asset tracking &amp; management solutions. SolarTech is a family owned and operated company with over 24 years of successful growth in the traffic management, traffic safety and construction equipment rental industries. &nbsp;This is an excellent opportunity not only to become an integral part of an exceptionally talented embedded/OEM product software design &amp; development team, but also to join a company that can provide an exceptionally rewarding long‐term stable career opportunity with very good pay and benefits.</p><p>As a small company, SolarTech’s predominant trait is flexibility. We adapt quickly to the market and customer needs, and we adapt to employees needs as well. On the programming side, we use tools and methodologies as they give us benefit, without being slavishly devoted to fads where they don’t make sense. On the personal side, we operate in an environment of trust, where we make sure to get our work done, but aren’t slavishly devoted to the clock. Especially with a remote position, while we need to be available to each other during the workday, when working on things that don’t need immediate coordination it’s fine to get the work done when it’s convenient. It’s also a good environment for people who want to make a creative difference, as we’re very willing to listen to good ideas and give credit to where they come from, and to give creative control to people who demonstrate that they can handle it and make good decisions.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Matching 401K                            </div>                            <div>                                 Health Insurance                            </div>                            <div>                                 Flexible work hours                            </div>                            <div>                                 Family comes first                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "pg60B8eSS3qjWHUJHtlfjw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16290683",
    "title": "SEEKING FREELANCER: Remote / St Louis, MO Know Android? Love new music tech / interactive work? I've got an iPad ...",
    "content": "<div>                  <span>SEEKING FREELANCER: Remote / St Louis, MO<p>Know Android? Love new music tech / interactive work?</p><p>I've got an iPad music education project (I built it) that we need to put on Android.</p><p>I'm a freelancer myself. I build interactive music things on the web, mobile, and a little bit of arduino and desktop from time to time.</p><p>Want to help? Reach out.</p><p>Website: <a href='https://www.artfulmedium.com' rel='nofollow'>https://www.artfulmedium.com</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 4:28:03 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded",
      "mobile"
    ]
  },
  {
    "id": "IGZNE8mkS6ur1ri8Vx6vaA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16289547",
    "title": "Airtame (https://airtame.com) | Copenhagen, Denmark | Full-time, Onsite/Remote",
    "content": "<div>                  <span>Airtame (<a href='https://airtame.com' rel='nofollow'>https://airtame.com</a>) | Copenhagen, Denmark | Full-time, Onsite/Remote<p>Airtame is a fast-growing startup. Our wireless streaming solution helps people work better. We are based in windy Copenhagen, but have an office in New York that takes care of our U.S. customers.</p><p>We're currently hiring:</p><p>* Senior C/C++ Software Engineer at Airtame - Copenhagen, Denmark (<a href='https://airtame.com/jobs/senior-cpp-software-engineer' rel='nofollow'>https://airtame.com/jobs/senior-cpp-software-engineer</a>)</p><p>* Senior Embedded Linux Engineer - Copenhagen, Denmark (<a href='https://airtame.com/jobs/senior-embedded-linux-engineer' rel='nofollow'>https://airtame.com/jobs/senior-embedded-linux-engineer</a>)</p><p>* Senior Digital Product Designer - Copenhagen, Denmark (<a href='https://airtame.com/jobs/senior-ux-ui-designer' rel='nofollow'>https://airtame.com/jobs/senior-ux-ui-designer</a>)</p><p>* Frontend Engineer - Copenhagen, Denmark (<a href='https://airtame.com/jobs/frontend-engineer' rel='nofollow'>https://airtame.com/jobs/frontend-engineer</a>)</p><p>* Senior Application Engineer - Copenhagen, Denmark (<a href='https://airtame.com/jobs/senior-application-engineer' rel='nofollow'>https://airtame.com/jobs/senior-application-engineer</a>)</p><p>* Technical Support Specialist - Brooklyn, New York (<a href='https://airtame.com/jobs/technical-support-specialist-ny' rel='nofollow'>https://airtame.com/jobs/technical-support-specialist-ny</a>)</p><p>Our talented engineers are given significant ownership and responsibility over projects. We value rapid iteration, continuous integration and testing, and we are serious about producing high-quality, maintainable software. Frequent code reviews, linting, and pairing are all integral components of our engineering culture. We encourage experimenting with new technologies and constantly challenge ourselves to improve our code, processes, and systems.</p><p>You can read a bit about our values on our Company Culture Trello Board: <a href='https://trello.com/b/ZXs2YYy6/culture-airtame' rel='nofollow'>https://trello.com/b/ZXs2YYy6/culture-airtame</a></p><p>We sponsor work visas for non-EU applicants.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 1:00:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/embedded",
      "TECH1/frontend",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "embedded",
      "frontend"
    ]
  },
  {
    "id": "A3UpVc7gSRKQsWtvZ0ppWQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283581",
    "title": "Spydermix | https://www.spydermix.org/ | Engineer | Full-Time | Remote",
    "content": "<div>                  <span>Spydermix | <a href='https://www.spydermix.org/' rel='nofollow'>https://www.spydermix.org/</a> | Engineer | Full-Time | Remote<p>Interested in giving a giant middle finger to repressive regimes? Do you eat DHTs, blockchains &amp; P2P routing algorithms for lunch? Are ridiculously hard problems your idea of fun? Are you the kind of person who could figure out how to create a uni-directional off-chain micro-payment channel with multi-sig support for a verifiable market with order matching and final settlement via smart contract, without trusted parties - taking into account the impossibility of fair exchange without a trusted third party, maybe based on probabilistic payments and/or zero knowledge contingent payments? Did you smile reading that last part? Good, it’s more fun when you have a sense of humor.</p><p>We’re working on changing the game with the backing of the world’s largest VPN service. An unstoppable multi-protocol decentralized onion routing system that is going to weave privacy into the very fabric of the Internet. Like TOR, if TOR was embedded into everything, had sensible economic incentive mechanisms, and was resistant to sybil attacks.</p><p># Scale of initial deployment</p><p>Servers : 100K+ Traffic : Exabytes Users : Millions</p><p># Things you probably already know in and out</p><p>IP networking, onion routing, VPNs, applied cryptography &amp; blockchains at the protocol level.</p><p># Things you’ll wonder when you read the prototype Apache module for fun</p><p>- Why don’t most HTTP proxies support keep-alives?</p><p>- Can you add a flag to the HTTP_PIPE contract to specify whether or not to use Global Session Support (GSS)?</p><p>- Is there a better way to track a single session across separate processes other than keeping track of session state in shared memory?</p><p>If you think you’re the type of person we’re looking for. Get in touch by sending a shout out to: contact [at] spydermix.org<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:14:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded",
      "python"
    ]
  }
]
}
