{
 "items": [
  {
    "id": "8GdtqtMBTMyQ3TAnqslxzQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/162014/full-stack-web-developers-working-from-home-art-logic-inc?a=SkJHKJRDdOU",
    "title": "Full Stack Web Developers Working from Home at Art & Logic, Inc.  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Mobile Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Work with Art+Logic, Inc. to complete challenging custom software projects, for our interesting clients!</p><p>We’re remote first, which means that we’re not only excited to work from home, but our culture and projects are built from the ground up to support distributed teams. We work all across the United States and Canada, just the way we have done since we started in 1991. Why would we work in an office when there are so many ways to collaborate and work together remotely?</p><p>Art+Logic is always seeking creative, bright, passionate programmers who are excited to take on new challenges. Currently, we’re looking for developers with&nbsp;mobile development&nbsp;experience, for possible, upcoming projects.</p><p>Our project teams usually consist of 1-5 developers plus UX/UI design and dedicated QA. Since we create custom software, our projects often involve different technologies and industries, so there is always something to new to learn. We like to keep things interesting!</p><p>This is a contracting position (1099), though we are looking for long term working relationships. Our rates range between $35-$50/hour, and we are <strong>only</strong> interested in working with developers located in the United States or Canada.</p><p><strong>Skills and Requirements</strong></p><p><strong>Key Skills for this position:</strong></p><p><strong>(some combination of)</strong></p><ul><li>Python (especially Django)</li><li>JavaScript</li><li>PHP</li></ul><p><strong>Additional Skills and experience:</strong></p><ul><li>mobile development (Swift, Android, etc.)</li><li>Leading Teams</li></ul><p>We're especially interested in developers ready for a senior engineer/tech lead role who can work with clients to document project requirements and plan architecture and design.</p>                    </div>                            <h2>                About Art &amp; Logic, Inc.            </h2>            <div><p><a href='http://www.artandlogic.com/' rel='nofollow'>Art+Logic</a> works on a broad range of projects including&nbsp;mobile, web, audio, imaging, desktop applications and plugins for Win, Mac, and ‘Nix. <strong>This is a 100% remote position that can be done from anywhere in the USA or Canada.</strong> Our entire development staff works from their homes, interconnected via our workgroup collaboration system. Emphasis on the connected.&nbsp;We live all over North America, but we really work in teams.</p><p>At this time, we are only looking for independent contractors. Qualifying for work at Art+Logic requires the full completion of our recruiting process, but we think the reward of being part of an elite team doing cutting-edge projects for big name clients is worth it.&nbsp;</p><p>A current Art+Logic developer:&nbsp;“<em>Sometimes I forget what I like best about Art+Logic: thinking about the top-notch geek camaraderie, the personalized work environment and so forth. And then I remember: it’s the projects I work on. Nowhere else have I found such a variety of interesting and challenging assignments, and opportunities to grow as a developer. And it’s for a reason. People don’t approach Art+Logic to churn out routine apps; they come because they have something hard, often requiring research and skilled implementation.&nbsp;There is no better place than Art+Logic for software developers to do what they love — and also better hone their craft.</em>”</p><p><br>Job Type: 1099, rates ranging $35-$50/hour<br>Travel: None Required - Work from Home<br>Location: United States and Canada only</p><p><strong>Find out more at:</strong></p><ul><ul><li><a href='http://artandlogic.com/blog' rel='nofollow'>http://artandlogic.com/blog</a> (it's a<strong>&nbsp;tech blog</strong>, not a &quot;company&quot; blog)</li><li><a href='http://www.facebook.com/artandlogi' rel='nofollow'>www.facebook.com/artandlogic</a></li><li><a href='https://plus.google.coj/+ArtAndLogic' rel='nofollow'>https://plus.google.com/+ArtAndLogic</a></li><li><a href='http://www.artandlogic.com/careers' rel='nofollow'>http://www.artandlogic.com/careers/</a></li></ul></ul><p><strong>Have more questions?</strong>&nbsp;Email us at <a href='mailto:Recruiting@artandlogic.com' rel='nofollow'>Recruiting@artandlogic.com</a></p><p>Some things are best said multiple times. <strong>Please note&nbsp;your interest in this specific position, when applying.&nbsp;</strong>(You can do so&nbsp;in the &quot;Brag&quot; section.)</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Annual Conference                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 18, 2018 11:18:35 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "apple",
      "mobile",
      "python"
    ]
  },
  {
    "id": "gWeiP4LFTVax8uzMu4hYbg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/dataquest-backend-developer",
    "title": "DataQuest: Backend Developer",
    "content": "<div>  <div>    <h2>Backend Developer</h2>      <h4>Posted Feb 15</h4>    <h3>      <span>DataQuest</span><br>      <span>Headquarters: San Francisco, CA</span><br>        <a href='https://dataquest.breezy.hr/p/dc6122afc15d-backend-developer?source=weworkremotely' rel='nofollow'>https://dataquest.breezy.hr/p/dc6122afc15d-backend-developer?source=weworkremotely</a>    </h3>  </div>    </div>  <div>    <div>At&nbsp;<a href='https://dataquest.io/' rel='nofollow'></a><a href='https://dataquest.io/' rel='nofollow'>Dataquest</a>, we teach data science to a community of hundreds of thousands of students worldwide. We help students deeply learn concepts, build projects, work together, and gain the confidence they need to start new careers. Read more about our philosophy&nbsp;<a href='https://www.dataquest.io/blog/the-perfect-data-science-learning-tool/' rel='nofollow'>here</a>, and read what students think&nbsp;<a href='https://www.switchup.org/bootcamps/dataquest' rel='nofollow'>here</a>.</div><div><br></div><div>We're a bootstrapped mission-driven team of 11 people, and we've been growing quickly since we launched 3 years ago. We're a close-knit team, and we make a point to help each other out, and talk about things beyond work.</div><div><br></div><div>We're looking for an intermediate backend-oriented engineer with full-stack experience to help support and evolve our learning platform. We currently need the most help in upgrading our existing Django codebase, but you will also likely be jumping in on frontend interfaces, developing new microservices, and offering opinions on devops. You'll have a lot of autonomy in how you work and what you work on, as long as it's having an impact on our students.</div><div><br></div><div>This is a fully remote role and we are open to applications worldwide. You don't have to match all of the listed requirements to apply -- we're looking for people who can grow along with our team, so please reach out if this job is interesting to you.</div><div><br></div><div><span>Requirements</span></div><div><br></div><div>We don't have a concrete set of requirements on skills. We know that any problem you are working on requires research; otherwise it wouldn't be a problem. Rather, we'd like to describe some traits that a successful developer in this role might have:</div><div><br></div><ul><li>You are able to dive into a complicated Python codebase and confidently make changes.</li><li>You think about how to measure the effectiveness of the features you work on.</li><li>If you're blocked on something, you instinctively find other things to contribute while you wait.</li><li>You contribute to architectural discussions.</li><li>When you need help, you provide the necessary context for someone to address your concerns without follow-up questions.</li><li>Sometimes you stare into space thinking about how you would explain a topic to someone less familiar with it.</li><li>You are eager to ask questions if you don't understand something and initial research isn't helping.</li><li>If a merge request deletes more code than it creates, you think it's a good day.</li><li>When you hear about a new technology, you wonder how it can improve your work rather than worrying about having to learn it.</li><li>You are often happiest in backend coding, but occasionally dabble in frontend and devops work.</li></ul><div></div><div><br></div><div><span>Our Stack</span></div><div><br></div><div>These are some of the technologies you'll be working with at Dataquest, though you may end up introducing new ones:</div><div><br></div><ul><li>Our frontend is a modern react/redux stack utilizing cutting edge javascript/ecmascript features.</li><li>Communication with the backend happens over a combination of websockets, GraphQL, and REST APIs.</li><li>The main backend is Django on Python 3 utilizing Celery, Django-channels, and graphene.</li><li>We have a few microservices in Asyncio and Node, and plan to build more.</li><li>We use Docker extensively, both for student code execution, and for deployment of our services.</li><li>Our data is largely stored in Postgres, with some caching in Redis.</li><li>We use git for source control and gitlab for pipelines.</li></ul><div>Why you should work at Dataquest</div><div><br></div><div>At Dataquest, you'll get:</div><div><br></div><ul><li>The opportunity to see your impact on the lives of our students every day.</li><li>The chance to work with an engaged and mission-driven team.</li><li>The chance to contribute to product direction and decisions.</li><li>Autonomy and control over how you work.</li><li>The ability to work remotely.</li><li>A supportive environment where you can get help when you run into blockers.</li></ul><div><br></div><div>The salary range for this role is $70k USD - $90k USD per year, and it's a full-time remote role.</div><div><br></div><ul></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://dataquest.breezy.hr/p/dc6122afc15d-backend-developer?source=weworkremotely' rel='nofollow'>https://dataquest.breezy.hr/p/dc6122afc15d-backend-developer?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 15, 2018 4:52:36 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend",
      "python"
    ]
  },
  {
    "id": "e8eg7hA0TZ62V_-ea2rfEQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4139-django-react-developer-silverlogic",
    "title": "Django / React Developer @ SilverLogic",
    "content": "<h2>              Django / React Developer<small> @ SilverLogic</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-12 14:54</p></dd>          <dt><span>Description</span></dt>          <dd><p>We're a software development agency, and we're interested in you :D</p><p>We're looking for developers with experience (on the job or on the side) in </p><ul><li><p>Django REST framework</p></li><li><p>JavaScript (React in particular)</p></li></ul><p>Interest in design or DevOps is a plus</p><p><em>Our Interview Process</em></p><ul><li><p>An informational call for you to get to know us (and vice versa)</p></li><li><p>An &quot;whiteboard&quot; interview in Google Docs for you to demonstrate you can use git and know what a for loop is</p></li><li><p>A short take-home assignment to demonstrate your ability in Django and React. It's small and there's no time limit, as we realize you have a life. </p></li></ul><p>If you would like to apply, please send an updated resume with links to sample code to the contact e-mail on this site.</p><p><em>About Us</em></p><p>We are an equal opportunity employer headquartered in in Boca Raton, Florida, and we develop software for small businesses and existing enterprises using the Agile/Scrum philosophy. </p><p>If you love variety, teamwork, and continuous improvement, we'd love to have you apply to join our team. </p><p>Thank you, The SilverLogic (TSL) Team</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>UTC-5 </p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 12, 2018 4:53:45 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "python"
    ]
  },
  {
    "id": "tpHwrUiWT7mbf2O6Vd0FXA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/167615/senior-backend-django-engineer-cdx-limited?a=UdchtcNQfFC",
    "title": "Senior Backend Django Engineer at CDX Limited",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise Web Solutions, Financial Services, Social Commerce</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are a fully-funded stealth-startup with a functional alpha Python/Django application; we are tuning and building our production version as a robust, scalable, highly-available platform.</p><p>We are hiring hands-on Senior Backend Developer experts in the following categories:</p><ul><li>DevOps-centric: AWS + Docker</li><li>Performance: Database&nbsp;query tuning experts and application profiling</li><li>QA: Testing engineers, load testing bots, integration tests and/or &quot;fuzzing&quot;</li><li>Security: Hardening, in-house pen testing, establishing and enforcing protocols</li></ul><p>You’ll be taking initiative on optimizing our platform, building&nbsp;new features for our users, support tools for our staff, and management tools for our sysadmins, as we move from our functional alpha product to a scalable, performant production platform.<br><br><strong>INTERESTED?</strong><br>To save time and streamline the process, we have created a &quot;Round 0&quot; pre-screen interview -- Please complete the following form, and include a link to your StackOverflow Talent Profile in Section 3:<br><br><a href='https://goo.gl/forms/bvfnLuELpJxa9d8j1' rel='nofollow'>https://goo.gl/forms/bvfnLuELpJxa9d8j1</a><br><br></p><p><strong>To be successful in this role, you'll:</strong></p><ul><li>Be an expert in Python and&nbsp;Django, as well as most of the following supporting languages, technologies and frameworks: Django-Rest-Framework, Celery, Docker, PostgreSQL, Amazon EC2 + ECS.</li><li>Be&nbsp;highly skilled&nbsp;in SQL, Linux&nbsp;command line and git.</li><li>Be familiar with modern frontend development practices including React, Redux and Sagas (our frontend engineers build all customer-facing pages, but you&nbsp;may need to implement some admin tools)</li><li>Be confident communicating with&nbsp;technical peers to&nbsp;build clearly defined requirements and convert these into robust technical architecture.</li><li>Be experienced in producing high-quality technical specifications, documentation and accurately estimating the time required for the build.</li><li>Be confident in providing tests to support code, contributing to testing strategies and providing high-quality user training documentation.</li><li>Have experience producing high-quality code to budget, demonstrating commercial awareness. &nbsp;</li><li>Have the ability to operate independently as technical lead on small projects.</li><li>Be confident contributing to proposals and pitching successfully.</li></ul><p>We'd love you to have a current technical blog, web presence, or an active Github profile. Maybe you're interested in Rust / Go / something we haven't heard of - tell us about it!</p><p><strong>As well as the technical knowledge, you'll also:</strong></p><ul><li>Remain up to date with state-of-the-art developments in your software field and share your knowledge with the wider team.</li><li>Be confident keeping projects on track through strong personal project management skills, collaboration and supporting other team members.</li><li>Support colleagues (teaching, coaching, line managing, mentoring, reviewing and improving code).</li></ul><p><strong>In return we'll offer:</strong></p><ul><li>An opportunity to work on&nbsp;a highly-visible, technically advanced project with a world-class team of industry leaders.</li><li>Performance-related bonuses.</li><li>Travel to occasional technical conferences (optional).</li><li>Competitive salary, depending on experience.</li><li>15 days annual leave.</li></ul><p>CDX Limited&nbsp;is an Equal Opportunities employer.</p><p>No agencies, please.</p>                    </div>                            <h2>                About CDX Limited            </h2>            <div><p>CDX Limited is a financial services&nbsp;project from the team behind GlobeNove Digital LTD. Founded in 2017, the exact nature of the project is&nbsp;undisclosed for legal and security reasons until we enter a closed Beta period in&nbsp;early 2018.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work Remote                            </div>                            <div>                                 Flexible Scheduling                            </div>                            <div>                                 Emerging Technologies                            </div>                            <div>                                 Competitive Salaries                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 8, 2018 9:27:22 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "cyxkPnY4S1-_gtWTze9ewA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/153412/senior-python-engineer-sqlalchemy-graphql-plus-shiphero?a=PrSmEjwSXcY",
    "title": "Senior Python Engineer - SQLAlchemy, GraphQL + Business Logic. Talented Team at ShipHero",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>eCommerce, Logistics &amp; Distribution, SaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Hello. We are ShipHero (<a href='https://shiphero.com' rel='nofollow'>https://shiphero.com</a>). We have built a software platform entrusted by hundreds of ecommerce companies, large and small to run their operations. Many of our customers sell on Shopify and/or Amazon. We’re driven to help our customers grow their businesses, by providing a platform that solves complex problems, and is engineered to be reliable and fast. We are obsessed with building great technology, that is beautiful and easy to use. Our culture also reflects our ethos and belief that by bringing passionate, talented and great people together - you can do great things.</p><p>Our team is remote, with all our engineers either in New York or Argentina (BS AS and Mar del Plata). We do daily stand-ups via Google Hangouts and communicate regularly using video chat and Slack.</p><p>We are seeking a senior software engineer with extraordinary programming and analytic abilities. You would be a fundamental member of the team focusing on building a solid foundation for the platform. We seek people who are excited and driven to grow with the experience of working with talented engineers. We are obsessed with disrupting an industry that desperately needs it, by continuing to build tools that help make our customers do great things.</p><p>We are hiring engineers in American timezones only for right now.</p><p><strong>About You</strong></p><ul><li>You understand that great things are accomplished when teams work together.</li><li>You’ve got lots of experience with Python, SQLAlchemy, FLASK and ideally GraphQL.</li><li>You have lots of AWS experience.</li><li>You can code review other team members work and provide assistance and appreciate feedback.</li><li>You take pride in your craft.</li><li>You’ve learned from building systems and solutions the reasons to avoid technical debt, and how to approach and implement TDD and CI practices.</li><li>You can craft elegant solutions when solving complex features and solutions.</li><li>You’ve worked on eCommerce solutions.</li><li>You want to build something that is disrupting an entire industry.</li><li>While hands on experience is not a requirement, you’re interested in learning how to apply machine learning and AI technologies and tools.</li><li>You can handle a fast paced environment.</li><li>You’ve made a lot of mistakes, and most importantly, have learned from them.</li></ul><p><strong>The Role</strong></p><ul><li>Work on a cross-functional team including front end and UX to build solutions that are easy for customers to understand, work consistently and scale well.</li><li>Review features and requirements and guide, design and implement solutions.</li><li>Understand business requirements and think through solutions in terms of not just the coding implementation but also how the solution fits into the solution and how it solves a customer need.</li><li>Ability to estimate effort and ship on agreed schedule. Comfortable pushing yourself and your team members when challenges pop up.</li><li>Lead regular code reviews, with the goal of code quality, good design and approach along with pushing engineers to improve and evolve.</li><li>Optimize existing tech stack and solutions, determine path to next step in the evolution.</li><li>Learn, and push those around you to do the same - this is a craft that you’re constantly improving upon.</li><li>Implement solutions that are pragmatic to get the platform built.</li><li>Have the confidence to work with experienced and talented people to just build great things, you’re not a “rockstar”.</li><li>Work with ShipHero leadership to implement practices and principles for the team.</li></ul><p><br><br><br></p>                    </div>                            <h2>                About ShipHero            </h2>            <div><p>Hello. We are ShipHero (<a href='https://shiphero.com' rel='nofollow'>https://shiphero.com</a>). We have built a software platform entrusted by hundreds of ecommerce companies, large and small to run their operations and we continue to grow. Many of our customers sell on Shopify and/or Amazon. We’re driven to help our customers grow their businesses, by providing a platform that solves complex problems, and is engineered to be reliable and fast. We are obsessed with building great technology, that is beautiful, easy to use and is loved by our customers. Our culture also reflects our ethos and belief that by bringing passionate, talented and great people together - you can do great things.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Team Members distributed in the US and Argentina.                            </div>                            <div>                                 Talented and experienced engineering team.                            </div>                            <div>                                 Work with ShipHero leadership to implement practices and principles                            </div>                            <div>                                 Interesting business problems to solve, that require in-depth thinking                            </div>                            <div>                                 Disrupting an industry that needs it by building great software.                            </div>                            <div>                                 Think through and build completely new product lines for the business                            </div>                            <div>                                 Work with other talented team mates in Argentina                            </div>                            <div>                                 Help shape the future of ecom and fulfillment                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "FsLD5ObeTy2Q38chh7aipg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/150944/full-stack-developer-remote-position-xapo?a=OCyIN52xH2w",
    "title": "Full Stack Developer - REMOTE POSITION at Xapo",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Banking, Bitcoin, Cryptocurrency</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>This is a remote position, meaning you can work from wherever you are!</p><p>Overview:</p><p>Xapo is seeking a senior Full Stack Developer to join our team. We need someone passionate willing to work with first class engineers around the world. The ideal candidate will be a seasoned developer with proven experience in backend development using python, with strong knowledge of MySQL programming and Redis. The candidate must also be able to master front end development technologies using javascript, jquery and html. Developer profile mixture is 90% backend and 10% frontend. Experience with fin-tech and trading platforms development is required.</p><p><strong>RESPONSIBILITIES</strong></p><p>As a senior developer, you will work with a highly specialized multidisciplinary team that handles the complete development lifecycle of a product, from the envisioning phase to the production deployment. You will be mainly responsible within this team for building high quality software components that fulfill defined functional specifications and fit in the architectural designs for it. You will be responsible to work in an autonomous way following a defined plan and achieving schedule goals in time. You will also be required to participate in the design, test and deploy of your code. Excellent teamwork and good planning and communication skills are a must.</p><p>We are looking for experienced, passionate, enthusiastic and top quality engineers; if you think you have what it takes to help revolutionize the fin-tech future then come join us!</p><p><strong>JOB REQUIREMENTS</strong></p><p><strong>Education and/or Experience:</strong></p><p>Outstanding engineering talent proved by great work results and experience.</p><p>Experience developing forex trading platforms and real time quotation systems.</p><p>5+ years’ experience in software development for commercial projects.</p><p>Backend development. (90% of work)</p><p>Excellent proven Python development skills.</p><p>Good development and tuning skills for MySql and Redis</p><p>Flask, uwsgi and NGINX, experience.</p><p>API building and consuming experience is desirable</p><p>Frontend development (10% of work)</p><p>Good Javascript and jquery skills</p><p>Knowledge of HTML development</p><p>CSS developing experience is desirable but not required</p><p>Platform and libraries</p><p>Feel comfortable using Linux, Docker, Flask, uWSGI and NGINX</p><p>Experience using Git, Stash, Jira, Trello</p><p>Capable of documenting and diagramming functional flows and architectures</p><p>Experience with other major development language and frameworks like, C, C++, Java or .NET, Node.js is desirable</p><p>Experience with other front end frameworks like Prototype, Undersore.js, etc is valuable but not required.</p><p>Mobile development knowledge, add points by not required</p><p>Self-motivated, with initiative and enthusiasm, willing to work hard with a remote team</p><p>Experience working by plan and objectives in autonomous mode.</p><p>Good communication skills and remote teamwork experience.</p><p>Native/Bilingual English speaker is a must. Spanish is a nice to have.</p><p>Experience within fintech and knowledge about Bitcoins would be ideal.</p><p>Some perks of working with Xapo:</p><ul><li>Attractive compensation – highly competitive!</li><li>Stock Options Grant</li><li>Flexible working hours</li><li>Remote job/working from wherever you want!</li><li>To join a successful startup Company growing passably</li></ul>                    </div>                            <h2>                About Xapo            </h2>            <div><p>Xapo is a leading bitcoin wallet, and we have a mission to bring bitcoin to the everyday lives of people across the world. Our business is growing fast, and we want to make sure we can keep providing the best quality support to our customers. We’re known for our fast responses to users, positive attitude, and a real desire to find the best working solutions to the people who chose to use Xapo’s products and services.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive Compensation                            </div>                            <div>                                 Remote opportunities                            </div>                            <div>                                 Flexible hours                            </div>                            <div>                                 Equity opportunities                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "hmKkShDqQZ6m_kCAJfs4Kw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/143954/full-stack-web-developer-python-react-sql-level-12?a=MhdvkEqezMA",
    "title": "Full Stack Web Developer - Python, React, SQL (Mid-Level & Senior/Lead) at Level 12 (Louisville, KY)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Agile Software Development, Software Consulting, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are looking for full stack (Python) web application developers to join the team at Level 12.&nbsp; We have openings for Senior/Lead as well as mid-level devs.</p><p><strong>TL;DR: Why Consider This Position?</strong></p><ul><li>We give you <strong>a lot of information</strong> in the job description so that you can figure out if you'd really like to work here.</li><li>We have a commitment to transparency and offer a “no surprises experience” throughout the interview and hiring process.</li><li>We practice and preach sound development practices. You are likely to <strong>learn and grow as a developer</strong> while working here.</li><li>Our pay and benefits will be somewhere between good and great, depending on what you are used to and where you live (see below for specifics).</li><li>You will have the option of <strong>working from home or our office</strong>, whatever suits you best. Let’s make the most of our time and minimize commuting when not necessary.</li><li>We have a no-drama office policy. We value and cultivate enjoyable working relationships among team members.</li><li>We emphasize work/life balance and adopt policies that make sure our people don’t get burnt out. For instance, our PTO/Vacation policies are <strong>designed so that you actually use them.</strong></li><li>A commitment to Agile Principles while not being enslaved to any particular methodology.</li><li>You have the skills and experience to be a mid-level or senior level full-stack web application developer. That is, you need to be able to architect &amp; run with a medium sized project mostly on your own.</li><li>You like building full stack web applications with technologies like Python, React, SQL, etc.</li><li>You are <strong>committed to automated testing</strong> of all the software you write (our apps typically have 92%+ test coverage).</li><li>You recognized that there is a lot of idealism in the software development community and are not disenchanted with the the <a href='https://ukiahsmith.com/blog/programming-is-terrible-so-learn-to-enjoy-it/' rel='nofollow'>day-to-day realities of programming</a>.</li><li>You like working independently but can contribute to a team as needed</li><li>If you apply, we will give you a yay or nay response. No black holes here!</li></ul><p><strong>Daily Responsibilities</strong></p><p>Daily responsibilities primarily consist of coding database-driven web applications and other web-related development work. In a typical day, you will likely work mostly with Python based web applications using frameworks like Django or Flask that interact heavily with a database (PostgreSQL or MSSQL).&nbsp; In the course of that work, you will have to interact with related technologies like JavaScript, React, HTML, and CSS/SASS.</p><p>This is not a design job. It will require a lot of in-depth programming and database work including the ability to architect maintainable code that gets the job done.</p><p>While we do prefer to do most of our back-end work in Python, we will occasionally take projects in other languages if they seem to be a good fit for us and the customer.</p><p>Some days you will jump from project to project as issues come up. At other times you may work primarily on one project for weeks or months.</p><p>The ability to take ownership for a project, engineer a sound technical solution, and “drive” a project to completion is <strong>essential</strong>.</p><p>Our customers have varied needs and so we tend to have varied responsibilities and projects. We have a focus on serving the customer and making software conform to their company rather than making the company conform to software.</p><p><strong>What We Offer</strong></p><ul><li>Pay: $75K-100K (Mid-Level) and $100-125K (Senior/Lead).<br><ul><li>We are happy to talk about money as one of the first parts of our conversation so we don’t waste each others time if we aren’t in the ballpark.</li><li>Everyone wants to be paid as much as possible, but the economics of business usually require that we meet in the middle.</li><li>Our offer will take into consideration your salary history, experience, references, and a skills assessment.</li></ul></li><li>Profit Sharing: In addition to a salary, our employees will earn a bonus based on how profitable our company is each year (roughly $1-2K annually).</li><li>One of the best things about working for us is that we really value work/family balance.<ul><li>We rarely work more than 40 hours a week.</li><li>We recently gave everyone an extra day off for Valentine’s Day just for extra quality time with their family.</li><li>We know there are devs out there putting in 50-60 hours a week. We can give them 10-20 hours a week of their life back.</li></ul></li><li>PTO/Vacation:<ul><li>Everyone receives 3 weeks of PTO/Vacation per year.</li><li>Up to 12 sick days per year.</li><li>9 Holidays</li></ul></li><li>Healthcare: We provide a stipend to offset the cost of health insurance</li><li>Flexibility: While we expect a regular schedule during normal business hours, we are pretty flexible when schedule changes are needed for legitimate reasons.</li><li>Telecommuting:<ul><li>Remote candidates within a 3 hour drive of Louisville, KY are welcome to apply.</li><li>Many of us work from home frequently, even those of us who are local.</li><li>We do have an office if you prefer to get away from home to focus on work.</li></ul></li><li>We Care: It’s easy to say, harder to do. We all need to make a living, our company needs to be successful in the marketplace, and hard decisions sometimes need to be made. But, at the end of the day, we really care about our employees, their families, their needs, and their desires.</li></ul><p><strong>Full Job Description &amp; Application Instructions<br></strong></p><p>Above are just highlights. The full job description for both positions are on our website and includes salary information, videos, and instructions on applying: <a href='https://level12.io/careers/' rel='nofollow'>https://level12.io/careers/</a></p><p><strong>Skills &amp; Requirements</strong></p><p><strong>Character First</strong></p><p>Level 12 is <a href='https://www.level12.io/about/' rel='nofollow'>founded on biblical principles</a> and has biblically informed goals. Accordingly, the reputation of Level 12 and the character of our employees is of utmost importance. You <strong>do not</strong> need to share our leadership's religious convictions, but you will need to share our commitment to the following principles:</p><ul><li><strong>Integrity</strong>: honest, trustworthy, reliable, ethical. We have high moral standards and we expect our employees to share those standards. If you use pirated software or media, don’t mind “tweaking” the truth, or think `porn == entertainment`, this is not the job for you!</li><li><strong>Good work ethic</strong>: you work hard and like to work hard. You also work efficiently, seeking to make the best use of your time.</li><li><strong>Dedicated</strong>: you really desire to contribute to and improve our company; you are not just earning a paycheck. You demonstrate a high level of “ownership” for and initiative with projects that are assigned to you.</li><li><strong>Teachable</strong>: you have a willingness and desire for feedback/correction. You are always looking to improve. You are willing to ask for help even if it makes you “look bad.”</li><li><strong>Resourceful</strong>: you know how to solve problems or are at least able to explain that the problem is not solvable with the requirements given. You use all resources at your disposal in an efficient manner to troubleshoot. You know when to ask someone for help and when more effort is needed on your part.</li><li><strong>Technical Prowess</strong>: you just “get” programming, computers, technology. The thought of solving a problem in an entirely new programming language, one you have never even heard of before, excites you.</li><li><strong>Technical Diversity</strong>: while we all have our preferences when it comes to programming languages or operating systems, you should be willing to work with anything, in any language, if that’s what it takes to get the job done. If you are easily lead into a “______ rocks, everything else sucks” mentality, this isn’t the job for you.</li><li><strong>Flexible</strong>: we are small, things change. You should be able to “roll with the punches.”</li><li><strong>Professional</strong>: at the end of the day, you like what you do, you take your job seriously, you do it extremely well, and you <strong>pay attention to the details</strong>!</li></ul><p><strong>Senior Developer<br></strong></p><p>The candidate for the Senior Developer position will usually have 6-10 years relevant experience and meet the following requirements:</p><ol><li>Technical Skills<ul><li>Are able to write modular, well-tested, and maintainable code</li><li>Know a software development domain really well and radiate that knowledge to our team and beyond</li><li>Are able to work on multiple projects as needed</li></ul></li><li>Leadership<ul><li>Leads the design for customer projects with feedback from other engineers</li><li>Proposes new ideas for improving the development team, customer projects, and/or our tech stack</li><li>Adheres to and promotes our <a href='https://level12.io/blog/development-mission-statement/' rel='nofollow'>development culture and mission</a></li><li>For Team Leads (see below): invests in other team members to see that they are growing as individuals and to facilitate productivity within our team.</li></ul></li><li>Code quality<ul><li>Leaves code in substantially better shape than before</li><li>Fixes bugs/regressions quickly</li><li>Monitors overall code quality/build failures</li><li>Creates tests religiously and makes sure the rest of the team is doing the same</li><li>Proactively identifies and reduces technical debt</li><li>Proactively defines and solves important architectural issues</li></ul></li><li>Communication<ul><li>Provides thorough and timely code feedback for peers</li><li>Able to communicate clearly on technical topics</li><li>Keeps issues up-to-date with progress</li><li>Helps guide other merge requests to completion</li><li>Helps with recruiting</li><li>Is able to manage conversations directly with customer contacts when needed.</li></ul></li><li>Performance &amp; Scalability<ul><li>Excellent at writing production-ready code with little assistance</li><li>Able to write complex code that can scale with a significant number of users</li><li>Avoids premature optimization</li></ul></li></ol><p><strong>Mid-Level Developer<br></strong></p><p>Mid-Level Developers usually have 3-6 years relevant experience and meet many but not all of the requirements listed above for the Senior position.</p><p><strong>Team Lead</strong></p><p>In addition to the leadership expectations noted above, some of our senior developers will also be involved in leading other developers and interacting with customers. We realize not every senior developer is as good with people as they are with code and that’s ok. We need and value individual contributors. But if you like and are good at interacting with people, we will have opportunities for you to lead teams and/or projects.</p><p><strong>Everything Else</strong></p><ul><li>General Requirements<ul><li>Experience developing database-driven web applications, preferably with Python backends.</li><li>If you don’t have Python experience, we would prefer to see experience with dynamic languages (Ruby, PHP, JavaScript (Node)), MVC (ish) web architecture, and experience in two of the following: SQL, modern front-end JavaScript (React preferred), or automated testing (TDD a plus).</li><li>You must live within a <strong>3 hour drive of Louisville, KY</strong> (or be willing to relocate) and be willing to drive to Louisville 1-3 times a month.</li><li>You agree with and would be pleased to work under our <a href='https://level12.io/blog/development-mission-statement/' rel='nofollow'>development mission statement and guiding principles</a>.</li><li>You can reason about software, algorithms, and performance from a high level.</li><li>You have worked on a production-level web and database applications using Python.</li><li>You are committed to automated testing in your software development process.</li><li>Strong oral and written communication skills</li><li>Self-motivated and have strong organizational skills</li><li>US citizen or ability to work in the United States without sponsorship</li><li>Bachelor’s Degree in computer science (or similar degree) or ability to demonstrate comparable education &amp; experience</li><li>4+ years developing database-driven web applications in a dynamic programming language</li><li>Would prefer local or within a 1-2 hours drive of Louisville. Will consider long-distance remote for the right candidate and/or if we can’t find local first.</li></ul></li><li>Languages &amp; Tools on a scale of 1 (novice) to 5 (expert)<ul><li>Proficient (4):&nbsp;Have significant experience working with Python in a web context.</li><li>Proficient (4): Database Development (SQL, multiple-joins, views, triggers, stored procedures)</li><li>Competent (3): Common Python libraries: Django, Flask, SQLAlchemy, Celery, Requests, pytest, etc.</li><li>Competent (3): HTML(5), CSS/SASS, web standards</li><li>Competent (3): JavaScript, Ajax, JSON, React, etc.</li><li>Competent (3): Writing unit and functional tests. Believing in a TDD approach is a big plus.</li><li>Competent (3): Version Control (Git, Mercurial)</li><li>Competent (3): Networking fundamentals (HTTP, DNS, TCP/IP, etc.)</li><li>Competent (3): Linux and related tools</li></ul></li></ul><p><strong>Full Job Description &amp; Application Instructions<br></strong></p><p>Above are just highlights. The full job description for both positions are on our website and includes salary information, videos, and instructions on applying: <a href='https://level12.io/careers/' rel='nofollow'>https://level12.io/careers/</a></p>                    </div>                            <h2>                About Level 12            </h2>            <div><p><strong>Who Are We?</strong></p><p>Level 12 is development firm that specializes in building custom software for our customers.&nbsp; We manage the entire process including planning, managing, and building software exactly as the customer needs it.</p><p>We serve customers in diverse industries including: railroad, automotive, manufacturing, and retail payments.</p><p>We set ourselves apart by digging into the customer’s problem until we can own it and then delivering highly functional software that brings significant value to the customer’s organization.&nbsp; That may not sound unique, but the longer we do this, the more we encounter people who have been burned by bad development experiences with other firms.&nbsp; We look for long-term relationships with our customers and have some that go back over 12 years.</p><p>We may not be changing the world, but we are impacting the lives of our customers and their employees.&nbsp; You don’t have to take our word for it, <a href='https://www.google.com/search?q=Level+12&amp;ludocid=3455085814419693503&amp;#lrd=0x0:0x2ff2ee3e0cfa1fbf,1' rel='nofollow'>checkout some of our reviews by our customers</a>.</p><p>Please <a href='https://level12.io/careers/full-stack-python-web-developer-engineering-lead/' rel='nofollow'>watch the video on our website</a> to learn why milk trucks are better than tanks (and learn more about our development process at the same time) (&lt; 2 mins).</p><p><strong>Emphasis on Development Best Practices</strong></p><p>Behind the scenes, we are using software development best practices to ensure that the code we deliver is flexible, maintainable, and works well for the user for years to come.</p><p>We know what it’s like to work in a substandard development environment or culture that accepts or maybe even promotes practices that kill developer productivity and enjoyment. We work hard at promoting development best practices and ingraining them into our culture. If you come work for us, you can look forward to:</p><ul><li>All projects managed in a DVCS (mostly Git, there might be a few obscure mercurial repos laying around that will eventually get converted)</li><li>Project management mostly on GitHub for pull requests, issue management, code coverage, CI integration, etc.</li><li>Developer friendly project setup: all our projects can be run locally on a developer’s machine.</li><li>Test-centric development methodology:<ul><li>Asking “how can we test this” is ingrained into our engineering and development workflow.</li><li>We have Continuous Integration (CI) running for almost all of our projects for at least the backend code (Python mostly) and some of the projects also run the JavaScript tests in CI.</li></ul></li><li>A focus on <a href='https://level12.io/agile-manifesto-software-development/' rel='nofollow'>Agile Principles</a> while not being enslaved to them.</li><li>A openness to changing our processes and using new technologies when those changes add value to Level 12 and/or our customers.</li></ul><p>If you’d like to learn more about what makes us tick, our Chief Executive Developer (CED) gave a talk on the importance of CI and automation in an agile software development process (<a href='https://level12.io/careers/full-stack-python-web-developer-engineering-lead/' rel='nofollow'>video on our website</a>) and has given <a href='https://github.com/rsyring/presentation-toc' rel='nofollow'>other talks and presentations</a> on various topics.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Commitment to transparency                            </div>                            <div>                                 Work from home option                            </div>                            <div>                                 No drama office policy                            </div>                            <div>                                 Emphasize work-life balance                            </div>                            <div>                                 PTO/Vacation policies are designed so that you use them                            </div>                            <div>                                 Commitment to Agile Principles                            </div>                            <div>                                 Commitment to Automated Testing                            </div>                            <div>                                 Profit sharing                            </div>                            <div>                                 Healthcare stipend                            </div>                            <div>                                 Schedule flexibility                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend",
      "python"
    ]
  },
  {
    "id": "1aIGB5ktRwC_0x97mpiQ-A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/166527/python-developer-for-swedens-best-ai-team-tenfifty-ab?a=TQzG0d9exFe",
    "title": "Python Developer For Sweden's Best AI Team at Tenfifty AB (Göteborg, Sweden)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Data Science, Machine Learning, Web Crawling</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>For our development team, we are looking for a Python developer with at least a few years experience. You will help develop pilots, projects and services for our customers, hosted on Linux using&nbsp;<em>Kubernetes</em>&nbsp;and&nbsp;<em>Google Cloud Platform</em>. The majority of these projects are related to&nbsp;<em>artificial intelligence</em>,&nbsp;<em>machine learning</em>&nbsp;and/or&nbsp;<em>data science</em>, while some are related to&nbsp;<em>web crawling</em>.</p><p>You can take on and finish tasks with a large degree of independence. As we are still a small and growing company (eight developers per January 2018), you need to have a broad technical competence and be flexible about your projects.</p><p>Each project usually have two developers working as a mini-team, but we communicate about challenges with everyone. We need both people skilled in putting code into production and those who specialize in ML, but for us it is important that everyone can code. For this position the actual Python programming is the important part.&nbsp;You make us extra happy if you have data science experience, a strong AI/ML background and/or statistical knowledge, but this is not required.</p><p>Recently we have worked on projects including speech to text, video OCR, text based recommendation systems, price prediction, a customer support mail-bot and generally a lot of fun and open ended challenges with a high success rate.</p><p>We offer a large degree of freedom. Pick your own equipment, OS, IDE, etc. You can choose to work from home. We offer a bonus and pension program. You will be working in a pleasant environment with other highly skilled Python programmers and machine learning experts.</p><p>Our developers can currently choose to work from home up to three days a week. So far we have preferred to meet in person to discuss projects now and then, but we are interested in working with full time remote developers as well.</p>                    </div>                            <h2>                About Tenfifty AB            </h2>            <div><p>We are all about putting cutting edge machine learning into production and real use for our clients.</p><p>As of January 2018 we are a growing team of eight developers who work on (mostly) machine learning projects. We specialize in doing customized AI and ML solutions, often based on our existing code platform, that go beyond the &quot;fun pilot&quot;-stage and deliver real value. Usually we do a pilot to determine quality and feasibility, followed by a main project where we put models, etc into production, offered as a subscription service.</p><p>Many&nbsp;of us have well over a decade of experience doing Python and machine learning in practice, with solid mathematical and programming background. We always try to stay on the cutting edge, hosting and attending ML-meetups and seminars, reading papers, etc. In our projects we balance new&nbsp;methods that are fun/important to learn with more mature methods that we know will work in practice.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible hours                            </div>                            <div>                                 Flexible location                            </div>                            <div>                                 Stock options                            </div>                            <div>                                 Fitness and health program                            </div>                            <div>                                 Pension program                            </div>                            <div>                                 Expert colleagues                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "python"
    ]
  },
  {
    "id": "cyq3Njh4T8Sw0YumVR94EA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165080/senior-python-node-developer-jbs-custom-software-solutions?a=TmugrOfsysw",
    "title": "senior python node developer at JBS Custom Software Solutions",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>JBS has a US-based 9 month contract opportunity for a senior python/node developer with the following skill set:</p><p><strong>Required</strong></p><ul><li>3+ years working with Python</li><li>Strong knowledge of javascript</li><li>Experience with node</li><li>Strong computer science background</li><li>3+ years experience with Python web frameworks (Django/flask/turbo gears/web2py)</li><li>3+ years working with open-source relational database systems (MySQL, PostgreSQL)</li><li>Experience with search tools such as Solr and Elasticsearch</li><li>Feels comfortable and has experience working in a Linux environment (ubuntu preferred)</li><li>Strong communication skills, both written and verbal</li><li>Ability to accurately estimate work</li><li>Commitment to provide quality completed deliverables with well-factored, maintainable code</li><li>Experience with VCS (git, hg or svn)</li></ul><p><strong>Nice To Have</strong></p><ul><li>Experience with microservices architectures</li><li>Experience with event based architectures</li><li>Experience in e-commerce development</li><li>Experience with Python Zappa</li><li>Experience building and designing REST-based web services using JSON</li><li>Experience with development operations (configuration and installation of apache/nginx/memcached/varnish, etc)</li><li>Experience with AWS (EC2, RDS)</li><li>Experience with bootstrap and/or foundation</li><li>Experience with containerization</li><li>Experience with react, react native</li><li>Experience with serverless framework</li></ul>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Full Time Remote Work                            </div>                            <div>                                 Paid Overtime                            </div>                            <div>                                 Group Medical, Dental, Life                            </div>                            <div>                                 401k with Company Match                            </div>                            <div>                                 PTO and Company Holidays                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "python"
    ]
  },
  {
    "id": "bnoTZ7VcSDOqF7_I9aILQw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165321/mid-level-django-web-developer-pivotal-energy-solutions?a=TruX3hYwGTC",
    "title": "Mid-Level Django Web Developer at Pivotal Energy Solutions",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Energy &amp; Utilities, Enterprise Software, Software Development / Engineering</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Web / Django Developer</strong></p><p>&nbsp;&nbsp; &nbsp; Pivotal Energy Solutions is looking for an experienced Django/Python developer to add to our growing team. We are an Software Company focused on providing high quality software to the Energy Sector.&nbsp; We develop all of our code using the Django / AWS Webstack and are looking to add a solid developer to meet our growing demand.&nbsp; We have several long term contracts, we are growing and now we need your help!&nbsp;</p><p><em>Tip: Absolutely no recruiters, we will work with local US candidates only.</em></p><p><strong>Minimum Requirements:</strong></p><ul><li>Minimum 3 years of direct experience with Python.</li><li>Minimum 1 years of direct experience with Django.</li><li>Solid understanding of version control (gitHub)</li><li>Solid understanding the Linux OS (CentOS) or AWS</li><li>Candidate should possess solid debugging/troubleshooting skills.</li><li>Good communication skills</li></ul><p><strong>Desired:</strong></p><ul><li>Direct experience with deploying Cloud amazon solutions.</li><li>Direct experience with DRF, Angular, and Javascript</li><li>Both Front-End and Back-End Developer desired</li></ul><p>We are based out of Phoenix AZ. &nbsp; Remote work is acceptable, but you must be a US Citizen.</p><p>If you meet this criteria please send an email with your phone number and a copy of your resume / qualifications to.</p><p>&nbsp;&nbsp; &nbsp; w o r k @ p i v o t a l e n e r g y s o l u t i o n s . c o m</p>                    </div>                            <h2>                About Pivotal Energy Solutions            </h2>            <div><p>Pivotal Energy Solutions is committed to helping stakeholders in the energy industry enable efficiencies within their organizations through efficient data collection, storage, sharing, and analytics.&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Competitive Salary                            </div>                            <div>                                 Remote work environment                            </div>                            <div>                                 A great team environment                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "nKMKj_LXSjqbHb0EMCVvqQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Developer+Advocate&c=Veeva&l=Remote&jk=cda366cf9b31a1e1&rtk=1c5g89o025i96838&from=rss",
    "title": "Developer Advocate, Vault Platform - Veeva - Remote",
    "content": "<div><b>Developer Advocate, Vault Platform</b><br><span>Veeva</span>     -<span>Remote</span>    </div><span>Our Company<br><br>At 1,900 employees and growing, and consistently strong financials (NYSE: VEEV), Veeva was named among the top fastest growing public technology companies on Forbes’ annual Fast Tech 25 list. We build innovative cloud solutions for some of the world’s largest pharmas and biotechs, and we need great people like you to make it happen.<br><br>Our Culture &amp; People<br><br>Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It’s genuine, straight-forward, and no fuss.<br><br>Job Summary<br><br>Veeva is looking for a Developer Advocate to represent the voice of the developer for the Veeva Vault Platform. The Veeva Vault Platform is a powerful enterprise cloud platform that lets developer build powerful and easy to use applications that uniquely combine document and data management. Internal and external application developers use the Vault API and SDK to develop innovative applications and integrations for the leading companies in the Life Sciences industry. If you have a passion for programming, APIs, beautiful code and telling the world about it you may be a good fit for this position.<br><br>Responsibilities<br><br>Develop deep, hands-on expertise of Vault applications, APIs, and SDKs<br>Develop, package, and document sample applications on the Vault Platform<br>Provide support to customer developers<br>Hold product team accountable for good design and quality product<br>Grow Vault’s Developer Program by creating and delivering content, and facilitating collaboration within the community<br>Working closely with new and existing partners, consultants, and customers on the best ways to leverage the Vault API/SDK<br><b>Serve as API/SDK product expert for the company:</b> Sales, Marketing, Engineering, and Services Requirements<br><br>Insatiable curiosity with a need to get her hands dirty<br>Java and Python programming languages<br>Strong written and verbal communication skills<br>Ability to work independently in a fast paced environment, with little direct supervision<br>Strong written and verbal communication skills Nice to Have<br><br>Hands-on experience Work experience in an Enterprise Application software company<br>Experience in a customer support role<br>BS in computer science or engineering<br>Up to date knowledge of cloud technologies and development platforms<br><br>Veeva is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity or expression, religion, national origin or ancestry, age, disability, marital status, pregnancy, protected veteran status, protected genetic information, political affiliation, or any other characteristics protected by local laws, regulations, or ordinances.</span>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:01:04 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java",
      "python"
    ]
  },
  {
    "id": "g_nsa_m_SEuHFMGbZZNr4g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4121-web-application-developer-open-data-services",
    "title": "Web Application Developer @ Open Data Services",
    "content": "<h2>              Web Application Developer<small> @ Open Data Services</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-03 02:03</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>Open Data Services is a growing workers co-operative</strong>. We deliver sustainable support for world-changing open data projects, including the Open Contracting Data Standard, the 360Giving open philanthropy initiative and the International Aid Transparency Initiative (IATI).</p><p>We’re an interdisciplinary team, with developers, analysts and researchers working together to create sustainable tools and services that help organisations publish and use open data for social change.</p><p>Since we started in 2015 we’ve grown from 4 to 15 members of staff based across the UK, providing family-friendly and flexible working. We’re creating a great place to work, whilst contributing to open data impacts across the world.</p><p><strong>We’re now seeking a new person to help develop software as part of projects that use open data for social change.</strong></p><p>We welcome applications from underrepresented minorities, and we value diversity within our workforce. If we can do anything to facilitate your application, please get in touch.</p><p>All employees are eligible to become co-operative members, taking an equal stake in the future development of our work.</p><p>New to co-ops? <a href='https://www.uk.coop/developing-co-ops/grow-your-co-op/codes-governance/worker-co-operative-code' rel='nofollow'>The Workers Co-operative Code</a> provides more information about what makes a worker co-op different. We started with a collective structure, and this year have been exploring aspects of a self-managing team model.</p><h5>Is this you?</h5><p>We’re looking for a web application developer to join our small co-operative team.  </p><p>You will:</p><ul><li><strong>Build and maintain open source applications</strong> that unlock the social and political impacts of open data;</li><li><strong>Be a part of the development team to deliver both stable products and rapid prototypes</strong> for our partners, and to support key open data standards;</li><li><strong>Be involved in planning, deploying and testing code and user experience</strong>;</li><li><strong>Get involved in ongoing development of data standards</strong>, and data standard extensions, for Open Contracting (JSON Schema) and IATI (XML Schema), including through regular engagement with growing user communities;</li><li><strong>Get involved in the wider work of the co-operative</strong>, supporting communities and organisations across the world to understand open data, to publish data using open standards, and to reuse data in accessible, user-centred tools and services</li></ul><p>We have a strong commitment to free and open source software, rooted in our co-operative ethics.</p><p>A great candidate will be:</p><ul><li><strong>Proactive, motivated and engaged</strong> — ready to work independently and as part of a team, prioritising and managing a varied workload, and committed to working on short and long-term projects with a social impact.</li></ul><p>We’re a distributed team, so you will mostly be remote/home working, with opportunities to travel locally and internationally to work with partners, and for regular team meetings and co-working.</p><ul><li><strong>A team player</strong> — excited about the opportunity to be part of building an emerging co-operative, working in a rapidly developing field, and building on and contributing to emerging open technologies.</li><li><strong>A lifelong learner</strong> — familiar with many of the technologies we already use, and ready to learn the others. An understanding of the open data landscape and data standards will be helpful, as would experience working on small-to-medium sized collaborative software projects. </li></ul><h5>Responsibilities:</h5><p>The core of this role will involve planning, developing and maintaining web applications that work with open datasets in a range of formats and standards, and working on the ongoing technical development of those standards. </p><p>There are opportunities within this role to get involved in a number of short-term research and development projects: where we help partners to understand the potential of open data through workshops, collaborative work and code.</p><p>On a day-to-day basis you will be:</p><ul><li>Writing code;</li><li>Reporting and responding to issues and fixing bugs;</li><li>Deploying software to live, staging and development environments;</li><li>Attending daily stand up meetings to check in with the whole team;</li><li>Contributing to software development roadmaps;</li><li>Prioritising feature development;</li><li>Clarifying tasks within the team and with clients;</li><li>Working on updates to data standards and schema;</li><li>Monitoring the use of software, using a variety of tools;</li><li>Contributing to team meetings and the growth of the co-operative;</li></ul><p>Some of the main technologies we currently work with include:</p><ul><li>Programming language &amp; frameworks: Python; Django; Javascript; Bash scripts.</li><li>Version control: Git</li><li>Hosting: Linux; SaltStack; Apache; uwsgi; Server monitoring with Icinga (nagios fork)</li><li>Testing and Continuous Integration: py.test, selenium and Travis CI</li><li>Data formats: JSON, Spreadsheets (including CSV), XML.</li><li>Database technologies: Elasticsearch, Relational databases behind Django’s ORM</li><li>Documentation formats: Markdown; ReStructuredText</li></ul><p>We practice agile software development, and work in the open through public issue trackers for many of our projects. </p><h5>Values</h5><p>We believe in transparency, openness, kindness and co-operation. We recognise that these values can look very different in different people, and we’re working to avoid creating a monoculture. As a small organisation, each new person shapes the culture. If you share our values, we’ll make sure you fit in. </p><p>You will be joining a team whose backgrounds include software development, physics, philosophy, youth work and business analysis. We recognise the value that diverse backgrounds and experience bring to the co-operative.</p><h5>Skills and experience</h5><p>We're passionate about how people develop new skills. We welcome people from a diversity of experiences and working history.</p><p>We recognise that there are many paths to becoming a competent software developer. We are more interested in demonstrable skills and experience than in qualifications, but if you have them we'd like to hear about them.</p><p>With that in mind, we’re looking for the following essential skills, knowledge, and experience:</p><ul><li>Front-end and back-end web development, including MVC, with the ability to rapidly learn new tools and technology;</li><li>Experience of developing in Python or a similar language;</li><li>Use of version control tools to manage collaborative development;</li><li>Understanding of open source;</li><li>Ability to work as part of a diverse team: including interacting with clients;</li><li>Strong communication skills: ability to communicate via email, video calls, ticketing systems, and collaborative documents.</li><li>Ability to communicate one-to-one, in small groups, and meetings, and via presentations.</li></ul><p>The following skills and experience are desirable. Tell us about any you can bring to the team in your application:</p><ul><li>Experience with UI design</li><li>Experience working with a large number of the current technologies we work with;</li><li>Experience of working with or providing APIs and/or working with a data standard;</li><li>Experience of software testing and deployment and systems administration;</li><li>Experience of communicating with software users about bugs, upgrades, changes to code;</li><li>Experience with multiple programming languages;</li><li>Prior knowledge of the open data movement and community and/or understanding of open source software and content licensing;</li><li>A demonstrated commitment to co-operative values;</li></ul><p>We’re also interested in any other skills or experience that you think would contribute to the life and development of the co-operative. </p><h5>Contractual details</h5><p><strong>Location:</strong> We’re a UK-based distributed team and all work remotely, either from home or co-working spaces around the country. We have regular team meetings and co-working, often in Birmingham, Manchester and London. Current team members are located in or near Manchester, Bristol, Leeds, London, Stroud, Nottingham, Cambridge, Newcastle, Edinburgh and Belfast.</p><p>You must have the right to live and work in the UK.</p><p><strong>Remuneration &amp; benefits:</strong> As a collectively run and owned co-operative, we operate a flat rate of pay for all staff. This is currently set at £37,008p.a.</p><p>Open Data Services operates an auto enrollment pension scheme with 3% employer contributions. If you have an existing pension scheme, we may be able to make contributions to that. Our policy is to progressively improve employee benefits as the co-operative develops, with all co-operative members having an equal right to vote on benefits, dividends, and bonuses.</p><p>All employees, that have passed a successful probationary period, are entitled to become members. Each member is an equal owner of the business, and all members have an equal vote in decision-making.</p><p>Members are able to vote on profit distributions at the end of each year, part of which can be as a bonus to members. In the last year, we also voted on making contributions to a number of charities, open source projects, and to the Open Rights Group.</p><p>Training and development is encouraged with all employees allocated an equal individual training budget, set by the members. </p><p>We operate a Bring Your Own Device (BYOD) policy and provide the online tools and software you need for your job. If you don’t already have a home working set-up, or need to find local co-working space, we’ll help to get that all set-up, and cover the initial and ongoing costs. </p><p>We offer salary sacrifice Childcare scheme vouchers that allow employees to reduce their childcare costs.</p><p><strong>Hours and holiday:</strong> We welcome opportunities to work out a flexible and family friendly schedule with you. Full time hours are set at 37.5 hours a week with 33 days holiday a year (including bank holidays).</p><p>See link in <code>Application Info</code> for full details.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>United Kingdom</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 4:01:40 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "5hS5wINsR42qcAiGpZKJWg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16292016",
    "title": "Density | http://density.io | Syracuse, NY + San Francisco, CA | On-site or Remote | Full-time | $100k-$150k + equity == What we build Density combines a powerful people counter, a modern API, a dedication to privacy, and a Sensor-as-a-Service business model. The system’s self-installable sensors can be added above any relevant door or entryway. Users then access always-on people count through our real-time API, allowing them to measure and understand their physical space. == Sr. Backend / API Engineer === - 5+ years industry experience building and scaling APIs and web backends - Deep experience with Python, Django, and Django Rest Framework - Experience with relational & non-relational databases - Experience scaling high-availability backend systems and databases - Experience with containerized infrastructure and deployment pipelines - An understanding and appreciation for application performance monitoring and profiling tools - A desire to define, document, and teach backend engineering standards - Strong writing skills, with experience crafting clear and concise documentation - A motivation for constant learning == Icing on the Cake - Experience interacting with and designing systems surrounding embedded devices - Experience working with time series databases - Experience building near real-time systems - Experience with statistical analysis and trend data modeling == Apply https://jobs.lever.co/density/c2de8fcc-279a-4cac-9006-c0cb35... reply ...",
    "content": "<div>                  <span>Density | <a href='http://density.io' rel='nofollow'>http://density.io</a> | Syracuse, NY + San Francisco, CA | On-site or Remote | Full-time | $100k-$150k + equity<p>== What we build</p><p>Density combines a powerful people counter, a modern API, a dedication to privacy, and a Sensor-as-a-Service business model. The system’s self-installable sensors can be added above any relevant door or entryway. Users then access always-on people count through our real-time API, allowing them to measure and understand their physical space.</p><p>== Sr. Backend / API Engineer ===</p><p>- 5+ years industry experience building and scaling APIs and web backends</p><p>- Deep experience with Python, Django, and Django Rest Framework</p><p>- Experience with relational &amp; non-relational databases</p><p>- Experience scaling high-availability backend systems and databases</p><p>- Experience with containerized infrastructure and deployment pipelines</p><p>- An understanding and appreciation for application performance monitoring and profiling tools</p><p>- A desire to define, document, and teach backend engineering standards</p><p>- Strong writing skills, with experience crafting clear and concise documentation</p><p>- A motivation for constant learning</p><p>== Icing on the Cake</p><p>- Experience interacting with and designing systems surrounding embedded devices</p><p>- Experience working with time series databases</p><p>- Experience building near real-time systems</p><p>- Experience with statistical analysis and trend data modeling</p><p>== Apply</p><p><a href='https://jobs.lever.co/density/c2de8fcc-279a-4cac-9006-c0cb3561e06b/apply?lever-source=hn' rel='nofollow'>https://jobs.lever.co/density/c2de8fcc-279a-4cac-9006-c0cb35...</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 6:55:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "HC48R-c0ScijlXkTWl19bA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16291942",
    "title": "Social Live Music Startup (pre-launch) | Austin, Texas | Back-End Engineer (Python/Django) | Full-Time | ONSITE strongly preferred, will ...",
    "content": "<div>                  <span>Social Live Music Startup (pre-launch) | Austin, Texas | Back-End Engineer (Python/Django) | Full-Time | ONSITE strongly preferred, will consider REMOTE for an ideal candidate | Salary + Equity<p>We are building a social platform that revolves around live music events. We are a team of 6 looking for an additional back end developer to join our team. Our web app is launching in the coming weeks and our mobile app in the next few months. We are seed-funded and will be raising another round of capital this year.</p><p>At least 1-2 years of experience with Python is required (preferably experience with Django). Our ideal candidate would also have front-end experience with React and/or React Native. Having experience working in early-stage startups is a plus; having an interest in live music is a huge plus.We have a strong preference for a local candidate or someone who would be willing to relocate in the near future, but we will consider highly qualified remote applicants who live in North America. We are offering both salary and equity for a full-time hire. We will consider part-time arrangements if you are a student based in Austin.</p><p>Please email legette26@gmail.com to apply, and include any relevant links (resume/LinkedIn, Github/Gitlab, etc.). We are hiring for this position ASAP – the earlier you get your application in, the better.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 6:47:05 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "9hGvjX2iRyufgPrkzU753A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16291086",
    "title": "MarketAccessTransformation | http://www.marketaccesstransformation.com | Cambridge, UK | REMOTE (Europe) | Full-time | AngularJS/Javascript/AWS/Python/Django/PostgreSQL | Full Stack Developers | £35-£50k Market Access Transformation revolutionizes ...",
    "content": "<div>                  <span>MarketAccessTransformation | <a href='http://www.marketaccesstransformation.com' rel='nofollow'>http://www.marketaccesstransformation.com</a> | Cambridge, UK | REMOTE (Europe) | Full-time | AngularJS/Javascript/AWS/Python/Django/PostgreSQL | Full Stack Developers | £35-£50k<p>Market Access Transformation revolutionizes the way advice is exchanged between healthcare stakeholders including payers, manufacturers, and the investment community.</p><p>I am looking to strengthen the technical team which develops the RPR platform in-house. We are using Javascript and AngularJS on the front-end (80%), Python, Django and PostgreSQL on the back-end (20%), all deployed on AWS. Any knowledge of research, data analytics and survey programming would be beneficial.</p><p>Interview process consists of: short coding test (should take no more than 1 hour); 30-minute remote interview; 60-minute remote or face-to-face interview, depending on location. I have hired successfully from Hacker News before.</p><p>We are growing quickly in an environment where data is sensitive, so any experience of scaling, security and robustness would be helpful. Experience of start-ups would also be useful. For more information, please visit <a href='https://marketaccesstransformation.com/careers/' rel='nofollow'>https://marketaccesstransformation.com/careers/</a></p><p>Feel free to contact me with any questions. predman at marketaccesstransformation... etc.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 5:13:05 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend",
      "python"
    ]
  },
  {
    "id": "9LNaGhBaShy9ROuJmjuSHw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16289222",
    "title": "Learning Equality | Python & Full-Stack | San Diego | ONSITE (preferred) or REMOTE | Full-time",
    "content": "<div>                  <span>Learning Equality | Python &amp; Full-Stack | San Diego | ONSITE (preferred) or REMOTE | Full-time<p>We're a non-profit based out of UCSD working on open source educational software that runs on desktops, tablets, and mobile phones. We have a proved track record of shipping: our first project, an offline web application for viewing Khan Academy videos and exercises called KA-Lite is used all over the world: <a href='https://learningequality.org/ka-lite/map/' rel='nofollow'>https://learningequality.org/ka-lite/map/</a>  We've taken all the lessons from user feedback to build Kolibri <a href='http://learningequality.org/kolibri/' rel='nofollow'>http://learningequality.org/kolibri/</a> that is a universal player for educational content from any source. We're also building a full pipeline of tools to support the creation, remixing, and distribution of open educational resources (OER), and creating supportive tools for innovative pedagogy. See <a href='https://github.com/learningequality/' rel='nofollow'>https://github.com/learningequality/</a></p><p>We use Django + Vue.js as our web stack and do a lot of Python scripting for content ETL, devops, and process automation.</p><p>If you've got expert-level Python and js skills, we want to talk to you. Come join our team of educators, designers, developers, and implementation specialists, and help us improve the learning experience for millions of kids around the world: <a href='https://learningequality.org/about/jobs/' rel='nofollow'>https://learningequality.org/about/jobs/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 11:00:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "FQBJ6pwCTXSf95IWstH14A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16286883",
    "title": "Dotdash | New York, NY | Senior/Lead Software Engineer, Growth | Full Time Onsite",
    "content": "<div>                  <span>Dotdash | New York, NY | Senior/Lead Software Engineer, Growth | Full Time Onsite<p>As a Senior Software Engineer, Growth you will build the tools that power our content strategy. You will work closely with Agile teams in New York and Eastern Europe to build databases and applications that empower our writers, editors, and growth team. You will have significant autonomy over your code and contributions.</p><p>About Your Contributions:</p><p>- Take over as tech lead on existing analytics application (Django/React)</p><p>- Architect and build new web applications and internal tools</p><p>- Work with and help lead a team of remote developers</p><p>- Manage and maintain the ETL pipelines that power our insights</p><p>About You:</p><p>- 5+ years experience building web apps and APIs</p><p>- 2+ years experience data engineering in Python</p><p>- Excellent with: Python, PostgreSQL, AWS</p><p>- Tech lead/application owner on multiple projects</p><p>- Experience with distributed team</p><p>- Bonus: Modern Javascript (we use React)</p><p>About Us:</p><p>Dotdash's vibrant brands help over 100 million users each month find answers, solve problems, and get inspired. Dotdash is among the fastest-growing publishers online, and its brands are the fastest-growing in their respective categories. Dotdash brands include Verywell, The Spruce, The Balance, Lifewire, ThoughtCo, and TripSavvy.</p><p><a href='http://jobs.jobvite.com/dotdash/job/oh5L6fwX' rel='nofollow'>http://jobs.jobvite.com/dotdash/job/oh5L6fwX</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 1:19:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "python"
    ]
  },
  {
    "id": "e70Cr0StTcOeb77OYUP-Kw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16285101",
    "title": "Math and Pencil | Software Engineer | Anywhere/NYC | Full-time | https://www.mathandpencil.com",
    "content": "<div>                  <span>Math and Pencil | Software Engineer | Anywhere/NYC | Full-time | <a href='https://www.mathandpencil.com' rel='nofollow'>https://www.mathandpencil.com</a><p>We are a small full-stack consulting agency with locations on the US East and West coast (Seattle, DC, Philly, NYC, Maryland, and Buffalo). I'm looking for a talented python developer looking to work remotely full-time building applications using:</p><p>React/Redux/Jest/Websockets, Python(Django), Postgres/Redis, AWS/S3/Ubuntu, CircleCI/Jenkins</p><p>My client is a well-funded start-up changing the ways in which hurricane insurance is bought/sold/and priced. We are building extremely exciting real-time technologies and you will have a lot of leverage/ownership of the product/features you are building. The team comes from a wide variety of schools and submission (UVA, Stanford UMD, UMICH, etc), and you will have a ton of flexibility with work hours and work-life balance (the team is 3 years old has has an attrition rate of 0%).</p><p>If you are located in or near NYC a plus, but it shouldn't matter for the right candidate. You will need to have a 4 year degree in a technical subject for this specific contract.</p><p>For more info: joseph dot misiti @ mathandpencil.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 9:39:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "_mqMlS6DS22auJIr7s25Lg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283913",
    "title": "Jellyfish | Software Engineers (ML experience a plus) | Boston, MA | Full-Time | ONSITE",
    "content": "<div>                  <span>Jellyfish | Software Engineers (ML experience a plus) | Boston, MA | Full-Time | ONSITE<p>ABOUT JELLYFISH</p><p>Jellyfish is an small, early-stage venture-funded startup creating a platform that will change the way software development happens. We're looking for a full-stack engineer and a backend architect to join our 5-person founding team here in Boston, MA. At this time we aren't prepared to offer H1B/Visa sponsorship or remote work.</p><p>JOB DESCRIPTIONCurrently, we are working closely with our customers to rapidly prototype, build, and refine the Jellyfish platform. We are using a Django stack (Python 3, Django, Postgres) hosted on AWS, so experience with these technologies is a plus. We are also seeking to augment the team with someone with substantial experience with toolkits like scikit-learn.</p><p>ABOUT YOUIdeal candidates will have two or more years experience building software and a bachelor's degree in a computer-science-adjacent field. We will also consider equivalent experience in lieu of a degree. Familiarity with building and bringing software to market is a huge plus. As we are an early-stage startup there is the standard caveat: we're working quite hard to quickly bring this to market, so there will be a non-zero amount of unpredictability. The flip side of that is, of course, the opportunity to join an early-stage startup working on an interesting idea.</p><p>TECH STACK</p><p>Python (Django, NumPy), PostgreSQL, AWS, Nginx</p><p>COMPENSATION Competitive salary plus equity grant</p><p>Email resumes to jobs [at] jelly.ai or you can contact me directly asm [at] jelly.ai with questions.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:50:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "A3UpVc7gSRKQsWtvZ0ppWQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283581",
    "title": "Spydermix | https://www.spydermix.org/ | Engineer | Full-Time | Remote",
    "content": "<div>                  <span>Spydermix | <a href='https://www.spydermix.org/' rel='nofollow'>https://www.spydermix.org/</a> | Engineer | Full-Time | Remote<p>Interested in giving a giant middle finger to repressive regimes? Do you eat DHTs, blockchains &amp; P2P routing algorithms for lunch? Are ridiculously hard problems your idea of fun? Are you the kind of person who could figure out how to create a uni-directional off-chain micro-payment channel with multi-sig support for a verifiable market with order matching and final settlement via smart contract, without trusted parties - taking into account the impossibility of fair exchange without a trusted third party, maybe based on probabilistic payments and/or zero knowledge contingent payments? Did you smile reading that last part? Good, it’s more fun when you have a sense of humor.</p><p>We’re working on changing the game with the backing of the world’s largest VPN service. An unstoppable multi-protocol decentralized onion routing system that is going to weave privacy into the very fabric of the Internet. Like TOR, if TOR was embedded into everything, had sensible economic incentive mechanisms, and was resistant to sybil attacks.</p><p># Scale of initial deployment</p><p>Servers : 100K+ Traffic : Exabytes Users : Millions</p><p># Things you probably already know in and out</p><p>IP networking, onion routing, VPNs, applied cryptography &amp; blockchains at the protocol level.</p><p># Things you’ll wonder when you read the prototype Apache module for fun</p><p>- Why don’t most HTTP proxies support keep-alives?</p><p>- Can you add a flag to the HTTP_PIPE contract to specify whether or not to use Global Session Support (GSS)?</p><p>- Is there a better way to track a single session across separate processes other than keeping track of session state in shared memory?</p><p>If you think you’re the type of person we’re looking for. Get in touch by sending a shout out to: contact [at] spydermix.org<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:14:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded",
      "python"
    ]
  },
  {
    "id": "165ysEyASJSusE7i4f-xtQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/64624",
    "title": "Senior Python Node Developer",
    "content": "Remote Senior Python Node Developer at JBS Custom Software Solutions     <div><a rel='nofollow'><i></i></a></div><div><a rel='nofollow'>JSON</a></div><div>SourceStack Overflow✖ remove✚ add filter</div><i></i><div><div></div><div><h2><a rel='nofollow'><span>Remote</span></a><a rel='nofollow'><span>OK</span></a></h2></div><div></div><div></div><div><h2>let's find you <em>a job</em><br>you can do <em>anywhere</em></h2></div><div></div></div><div><div><h2><a rel='nofollow'><span>Remote</span></a><a rel='nofollow'><span>OK</span></a></h2></div><div></div></div><div><div><div><a rel='nofollow'><p><i></i><span>Remote </span> Jobs</p></a><a rel='nofollow'><p><i></i>Software Development</p></a><a rel='nofollow'><p><i></i>Customer Support</p></a><a rel='nofollow'><p><i></i>Marketing</p></a><a rel='nofollow'><p><i></i>Design &amp; UX</p></a><a rel='nofollow'><p><i></i>Non-tech</p></a><a rel='nofollow'><p><i></i>Highest Paid Remote Jobs</p></a><a rel='nofollow'><p><i></i>Remote Companies</p></a><a rel='nofollow'><p><i></i>Remote Work Statistics</p></a></div></div><div></div><div><div><div><p><i></i>&nbsp;    Jobs</p></div><div><p><i></i>&nbsp;    People</p></div></div></div><div><div><p>Are you hiring for a remote Python position?</p><a rel='nofollow'>Post a Job</a>&nbsp;in this section</div><table></table></div></div><a href='https://nomadlist.com' rel='nofollow'><div></div></a><div><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i></div><div></div><div><div><a href='http://dribbble.com' rel='nofollow'><div><i></i></div></a><a href='http://behance.com' rel='nofollow'><div><i></i></div></a><a href='http://github.com' rel='nofollow'><div><i></i></div></a><a href='http://stackoverflow.com' rel='nofollow'><div><i></i></div></a><a href='http://weworkmeteor.com' rel='nofollow'><div><i></i></div></a><a href='http://weworkremotely.com' rel='nofollow'><div><i></i></div></a><a href='http://wfh.io' rel='nofollow'><div><i></i></div></a><a href='http://authenticjobs.com' rel='nofollow'><div><i></i></div></a></div></div><div><a href='https://twitter.com/remote_ok' rel='nofollow'>Follow @remote_ok</a></div><div><div><a title=&quot;Product Hunt&quot; href='http://www.producthunt.com/posts/remote-ok' rel='nofollow'></a><a title=&quot;Hacker News&quot; href='https://news.ycombinator.com/item?id=9089778' rel='nofollow'></a><a title=&quot;Reddit&quot; href='http://www.reddit.com/r/digitalnomad/comments/2wral0/remote_ok_a_daily_aggregator_of_all_remote_jobs/' rel='nofollow'></a><a title=&quot;The Next Web&quot; href='https://www.facebook.com/thenextweb/posts/10153107210758523' rel='nofollow'></a><a title=&quot;Pinboard&quot; href='https://twitter.com/PinPopular/status/570004194632929281' rel='nofollow'></a><a title=&quot;Forbes&quot; href='http://www.forbes.com/sites/kaviguppta/2015/02/25/digital-nomads-are-redefining-what-it-means-to-be-productive/' rel='nofollow'></a><a title=&quot;Fast Company&quot; href='http://fastcompany.com/3043519/work-from-anywhere-startups-for-global-digital-nomads' rel='nofollow'></a><a title=&quot;Lifehacker&quot; href='http://lifehacker.ru/2015/02/26/traveling-freelancer/' rel='nofollow'></a><a title=&quot;Pinterest&quot; href='https://www.pinterest.com/pin/165999936241585050/' rel='nofollow'></a><a title=&quot;CareerDean&quot; href='https://www.careerdean.com/q/field-cross-paths-traveling' rel='nofollow'></a></div></div><div></div><a rel='nofollow'><i></i></a><div></div><div></div><div><span>Need help?</span><i></i><span>Need help? Have feedback?</span><span>Thanks for the message! We will get back to you soon.</span><div>Send</div></div><div></div>",
    "urlFetchPending": false,
    "published": "Jan 29, 2018 9:46:47 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "5IbCvBnKSBaTdgElIXpcew",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/64922/data-and-risk-engineer-at-iwoca-ltd/",
    "title": "Data and Risk Engineer",
    "content": "WHO ARE WE?<br />At iwoca, we are reinventing business finance: our mission is to help small businesses grow by offering them fast, flexible access to finance. Traditionally, banks have neglected Europe’s 20M+ SMEs because their processes were too slow, rigid and costly to serve them effectively. By using cutting-edge technology and harnessing more data, iwoca is developing new ways to provide fast and flexible access to credit and enabling our customers to flourish.<br /><br />Since our launch in 2012 we've lent over £250m to 12,000 SMEs across Europe, from “one man bands” to multi-million pound businesses. Along the way we have built a leading technology platform, won numerous awards and grown a fun and vibrant team. Over the next decade we aim to provide financing to 1 million small businesses.As a Data &amp; Risk Engineer at iwoca you will be a crucial member of a team responsible for developing a bespoke lending platform that has recently been accredited as being far more advanced than any other product on the market. We have ambitious plans to transform the face of SME lending and we have already made waves in the industry.<br /><br />Our Data &amp; Risk Engineer develop cutting edge algorithms using statistical modelling and machine learning techniques. Using Python (Pandas, NumPy and SciPy) they work in a fast paced and dynamic environment to produce data driven solutions. Our Tech &amp; Analytics team works in a relaxed, collaborative and flexible environment, where everyone has the opportunity to make a significant contribution to the business. As an iwocan, you will be expected to derive meaningful and actionable insights from our data as well as develop the innovative technologies behind our platform.<br /><br />We are looking for Engineer who loves to code and get their hands dirty with raw data. It doesn't really matter whether people call you an Engineer, Physicist or Mathematician, what matters to us is that you are a curious and continuous learner with a hunger to achieve the very best in what you do.<br /><br />ABOUT US<br />We are a team of with a real love for mathematical and statistical modelling<br />We all play a significant role in specifying the problem and thinking through all possible solutions<br />Our development cycle is tight with Agile-ish processes that means features or projects go live in days or weeks rather than months or years<br />We are an eclectic bunch of Musicians, Rowers, Climbers, Skiers, Farmers and Cyclists<br /><br />REQUIREMENTS<br />Strong numerate background, e.g Degree in Engineering, Mathematics, Physics or equivalent<br />Must have a background in Probability &amp; Statistics<br />Programming experience: Python, Java, C/C++ or similar<br />Self-starter with ability to work autonomously in an unstructured environment<br />Demonstrable experience using machine learning techniques<br />Strong basis in computer-science fundamentals<br />Experience with Pandas, NumPy, SciPy, R, Matlab, and/or SQL.<br />Understanding of web technologies<br />Experience in scorecard building and credit / fraud models<br /><br />BENEFITS<br />You will always have a say in the business and have the opportunity to really make a difference. We help all our employees become top performers and reward everyone in numerous different ways. Everyone at iwoca is smart, humble and motivated to do a good job so you are bound to love working here. We also offer the following:<br /><br />25 days of paid holiday, plus UK public holidays, and an extra day +1 for your birthday<br />Pool and Ping Pong tables<br />Great development programmes (paid conferences around Europe)<br />Plenty of space to chill out<br />Plenty of drinks and snack (healthy and unhealthy)<br />Subsidised gym membership and restaurant discounts in Soho<br />Cycle2Work scheme for great value bikes<br />Various sports teams including football and climbing<br />A super smart team of really nice people<br />Company retreats to great destinations<br />Ability to work from home occasionally",
    "urlFetchPending": false,
    "published": "Jan 9, 2018 3:36:02 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "jn4Th_61TzW0CXjgXBiH0w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16057823",
    "title": "Innolitics | Python and Web Developer | Austin, NYC, Houston | REMOTE | Full-time | http://innolitics.com",
    "content": "<div>                  <span>Innolitics | Python and Web Developer | Austin, NYC, Houston | REMOTE | Full-time | <a href='http://innolitics.com' rel='nofollow'>http://innolitics.com</a><p>We are a growing, all-remote firm focusing on medical imaging software. Our tight-knit team includes developers and engineers who are passionate about solving interesting and challenging problems in the space.</p><p>We are currently seeking a creative software developer to work on medical imaging projects for our clients using Python, C++, and web technologies.</p><p>Please refer to our job posting for more information and application instructions: <a href='http://innolitics.com/join/developer-december-2017/' rel='nofollow'>http://innolitics.com/join/developer-december-2017/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 5:00:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "python"
    ]
  },
  {
    "id": "2J5AC4gtTA-wpl3RekHJaQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16057422",
    "title": "Spydermix | https://www.spydermix.org/ | Engineer | Full-Time | Remote",
    "content": "<div>                  <span>Spydermix | <a href='https://www.spydermix.org/' rel='nofollow'>https://www.spydermix.org/</a> | Engineer | Full-Time | Remote<p>Interested in giving a giant middle finger to repressive regimes? Do you eat DHTs, blockchains &amp; P2P routing algorithms for lunch? Are ridiculously hard problems your idea of fun? Are you the kind of person who could figure out how to create a uni-directional off-chain micro-payment channel with multi-sig support for a verifiable market with order matching and final settlement via smart contract, without trusted parties - taking into account the impossibility of fair exchange without a trusted third party, maybe based on probabilistic payments and/or zero knowledge contingent payments? Did you smile reading that last part? Good, it’s more fun when you have a sense of humor.</p><p>We’re working on changing the game with the backing of the world’s largest VPN service. An unstoppable multi-protocol decentralized onion routing system that is going to weave privacy into the very fabric of the Internet. Like TOR, if TOR was embedded into everything, had sensible economic incentive mechanisms, and was resistant to sybil attacks.</p><p># Scale of initial deployment</p><p>Servers : 100K+ Traffic : Exabytes Users : Millions</p><p># Things you probably already know in and out</p><p>IP networking, onion routing, VPNs, applied cryptography &amp; blockchains at the protocol level.</p><p># Things you’ll wonder when you read the prototype Apache module for fun</p><p>- Why don’t most HTTP proxies support keep-alives?</p><p>- Can you add a flag to the HTTP_PIPE contract to specify whether or not to use Global Session Support (GSS)?</p><p>- Is there a better way to track a single session across separate processes other than keeping track of session state in shared memory?</p><p>If you think you’re the type of person we’re looking for. Get in touch by sending a shout out to: contact [at] spydermix.org<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 3:00:06 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded",
      "python"
    ]
  },
  {
    "id": "pWDCmuf2TXC1CStwnAxQTA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8707-python-developer",
    "title": "Python Developer",
    "content": "Python Developer - Jobmote<div><div><h2>Python Developer</h2><h5>X-Team</h5></div></div><div><div><div><div><div><p><strong>About X-Team</strong></p><p>“Motivated developers, ready to join your team.”</p><p>X-Team is an international company founded in Melbourne, Australia that helps companies scale their development teams by providing them with extraordinary developers from around the world.</p><p>We are 100% remote and believe in building a world where developers can have access to an environment of growth and incredible opportunities regardless of where they live. Our culture is based around the proactive, selfless values that make up every X-Teamer.</p><p>We are a community of people dedicated to unleashing our potential every day. Learn more about how we can help you learn and grow at https://x-team.com/unleash/</p><p><strong>About You:</strong></p><p>The right individual will be self-driven. Someone who cares about maintainability of the code, automation, deployment processes and how to enable innovation through fostering a growing culture of Open Source. You will go beyond just coding and help to shape the engineering culture and best practices.</p><p><strong>Most important:</strong></p><p>Experience working with Python, Django, and Javascript</p><p>Experience designing and deploying services on Amazon AWS</p><p>Experience with API based architectures (SOA, micro-services)</p><p>Experience writing high-quality unit tests</p><p>Experience with data visualisation and interpretation</p><p><strong>Nice to have:</strong></p><ul><li><p>Experience with working remotely</p></li><li><p>Familiar/involved with open­ source projects</p></li></ul><p><strong>Personal:</strong></p><ul><li><p>Independent, self-motivated</p></li><li><p>Fluent in English, written and spoken</p></li><li><p>Proven track record of always learning and growing.</p></li><li><p>Proactive attitude</p></li><li><p>Possess a spirit of generosity</p></li></ul><p><strong>Perks:</strong></p><ul><li><p>Get the chance to work with big brands like Riot Games, Fox Broadcasting, Kaplan Inc., etc.</p></li><li><p>Live and work in one of our roaming hacker houses (X-Outposts) around the world. http://x-outpost.com</p></li><li><p>Work from anywhere as part of a community of digital nomads.</p></li><li><p>Join our vibrant community, filled with opportunities to join engaging engineering roundtable discussions, AMAs, gaming clubs, LAN parties, charitable fundraisers, fitness programs (+gym membership), etc. This is the community to be in if you're a remote developer.</p></li><li><p>We’ll provide up to $2,500 in funding for your learning and growth through our Unleash program, which provides opportunities to unleash your potential through initiatives that help you grow as a developer and explore your passions more each day. (http://x-team.com/unleash)</p></li></ul><p><strong>FAQ:</strong></p><p>Who is X-Team meant for?</p><ul><li>Any freelance developers with experience working on high-scale, remote teams and projects with a motivated, proactive attitude and compassionate, team-player heart. If you've worked with freelancing platforms before, that's not what we are. X-Team is a community of all likeminded people, carefully chosen to ensure we are able to create an environment of the most motivated people in the world who come together to unleash their potential. What we've created is truly special and not a faceless platform. X-Team is where developers go to feel truly at home together, while becoming more motivated than they've ever been.</li></ul><p>What are you hiring for right now?</p><ul><li>We are hiring for PHP developers to fill some exciting new opportunities we have. We're also hiring for a variety of other skills, such as React, React Native, Cryptocurrency/blockchain, Node.js, Salesforce, DevOps, and Golang.</li></ul><p>Will I get a job immediately after applying?</p><ul><li>If your skills, experience and values align with a current opening we have, your chances of getting hired immediately are high. If we discover you're qualified but all opportunities have been taken, we'll continue to work with you to help you get a role in X-Team. The key is having the most relevant, in-demand skills when you apply.</li></ul><p>What kind of opportunities do you provide?</p><ul><li>We provide full-time opportunities that last, on average, for 10 months. After your role ends (and so long as you've performed well), we continue to give you work internally with us until we find you a new opportunity. This ensures that X-Team can be a stable work option for you as a freelancer.</li></ul></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 10:00:30 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "0AjOgKFRSgWvkP_zTWbNLQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/jobs/6024-python-developer",
    "title": "X-Team: Python Developer",
    "content": "<div>  <div>    <h2>Python Developer</h2>      <h4>Posted Jan  2</h4>    <h3>      <span>X-Team</span><br>      <span>Headquarters: Remote</span><br>        <a href='https://x-team.com/remote-python-developer-jobs/?utm_source=weworkremotely&amp;utm_medium=board&amp;utm_campaign=wwr-q3-18' rel='nofollow'>https://x-team.com/remote-python-developer-jobs/?utm_source=weworkremotely&amp;utm_medium=board&amp;utm_campaign=wwr-q3-18</a>    </h3>  </div>    </div>  <div>    <div><b>About X-Team</b></div><div><br></div><div>“Motivated developers, ready to join your team.”</div><div><br></div><div>X-Team is an international company founded in Melbourne, Australia that helps companies scale their development teams by providing them with extraordinary developers from around the world.</div><div><br></div><div>We are 100% remote and believe in building a world where developers can have access to an environment of growth and incredible opportunities regardless of where they live. Our culture is based around the proactive, selfless values that make up every X-Teamer.</div><div><br></div><div>We are a community of people dedicated to unleashing our potential every day. Learn more about how we can help you learn and grow at https://x-team.com/unleash/</div><div><br></div><div><b>About You:</b></div><div>The right individual will be self-driven. Someone who cares about maintainability of the code, automation, deployment processes and how to enable innovation through fostering a growing culture of Open Source. You will go beyond just coding and help to shape the engineering culture and best practices.</div><div><br></div><div><b>Most important:</b></div><div>Experience working with Python, Django, and Javascript</div><div>Experience designing and deploying services on Amazon AWS</div><div>Experience with API based architectures (SOA, micro-services)</div><div>Experience writing high-quality unit tests</div><div>Experience with data visualisation and interpretation</div><div><br></div><div><b>Nice to have:</b></div><div>- Experience with working remotely</div><div>- Familiar/involved with open­ source projects</div><div><br></div><div><b>Personal:</b></div><div>- Independent, self-motivated</div><div>- Fluent in English, written and spoken</div><div>- Proven track record of always learning and growing.</div><div>- Proactive attitude</div><div>- Possess a spirit of generosity</div><div><br></div><div><b>Perks:</b></div><div>- Get the chance to work with big brands like Riot Games, Fox Broadcasting, Kaplan Inc., etc.</div><div>- Live and work in one of our roaming hacker houses (X-Outposts) around the world. http://x-outpost.com</div><div>- Work from anywhere as part of a community of digital nomads.</div><div>- Join our vibrant community, filled with opportunities to join engaging engineering roundtable discussions, AMAs, gaming clubs, LAN parties, charitable fundraisers, fitness programs (+gym membership), etc. This is the community to be in if you're a remote developer.</div><div>- We’ll provide up to $2,500 in funding for your learning and growth through our Unleash program, which provides opportunities to unleash your potential through initiatives that help you grow as a developer and explore your passions more each day. (http://x-team.com/unleash)</div><div><br></div><div><b>FAQ:</b></div><div>Who is X-Team meant for?</div><div>- Any freelance developers with experience working on high-scale, remote teams and projects with a motivated, proactive attitude and compassionate, team-player heart. If you've worked with freelancing platforms before, that's not what we are. X-Team is a community of all likeminded people, carefully chosen to ensure we are able to create an environment of the most motivated people in the world who come together to unleash their potential. What we've created is truly special and not a faceless platform. X-Team is where developers go to feel truly at home together, while becoming more motivated than they've ever been.</div><div><br></div><div>What are you hiring for right now?</div><div>- We are hiring for PHP developers to fill some exciting new opportunities we have. We're also hiring for a variety of other skills, such as React, React Native, Cryptocurrency/blockchain, Node.js, Salesforce, DevOps, and Golang.</div><div><br></div><div>Will I get a job immediately after applying?</div><div>- If your skills, experience and values align with a current opening we have, your chances of getting hired immediately are high. If we discover you're qualified but all opportunities have been taken, we'll continue to work with you to help you get a role in X-Team. The key is having the most relevant, in-demand skills when you apply.</div><div><br></div><div>What kind of opportunities do you provide?</div><div>- We provide full-time opportunities that last, on average, for 10 months. After your role ends (and so long as you've performed well), we continue to give you work internally with us until we find you a new opportunity. This ensures that X-Team can be a stable work option for you as a freelancer.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply today: <a href='https://x-team.com/remote-python-developer-jobs/?utm_source=weworkremotely&amp;utm_medium=board&amp;utm_campaign=wwr-q3-18' rel='nofollow'>https://x-team.com/remote-python-developer-jobs/?utm_source=weworkremotely&amp;utm_medium=board&amp;utm_campaign=wwr-q3-18</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 9:56:13 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "p-GlGwdLTPSsvtdkn7YmnA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16053856",
    "title": "Elation Health | Lead Software Engineer & Designer | REMOTE & San Francisco, CA | Full Time",
    "content": "<div>                  <span>Elation Health | Lead Software Engineer &amp; Designer | REMOTE  &amp; San Francisco, CA | Full Time<p>At Elation we make tools for physicians and their patients that improve the efficiency and fidelity of their relationship, and help to make the delivery of excellent, proactive healthcare possible. We've got a number of roles available in engineering, design, and sales. See them all here: <a href='https://www.elationhealth.com/careers/' rel='nofollow'>https://www.elationhealth.com/careers/</a></p><p>Specifically I'm closely involved with trying to fill our engineering lead positions. Our engineering team is about half based in our San Francisco office and half remote (remote for us is PST +/- 3 hours). Tech stack is AWS/Python/Django/MySQL/ReactJS. We have a great team full of folks that really value working closely with product, customer-experience, and users. Lots of interesting problems to solve!</p><p>Apply online or reach out to me directly if you have any questions or are curious! I'm always happy to chat with folks about healthcare, startups, whatever. Contact info's in profile.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 8:15:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "frontend",
      "python"
    ]
  },
  {
    "id": "b_m7kkLAQ5OurHVMFqprPg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16053264",
    "title": "Conductor Technologies | Oakland, CA / San Francisco Bay Area / REMOTE OK (US/Canada only) | Full-time | $100k-$130k + equity | Team of 7 engineers ...",
    "content": "<div>                  <span>Conductor Technologies | Oakland, CA / San Francisco Bay Area / REMOTE OK (US/Canada only) | Full-time | $100k-$130k + equity | Team of 7 engineers in the SF bay area and on the East coast<p>Back-end software engineer (proficiency in Python required)</p><p><a href='https://www.conductortech.com' rel='nofollow'>https://www.conductortech.com</a></p><p><a href='https://goo.gl/rgjRfW' rel='nofollow'>https://goo.gl/rgjRfW</a> (full job description)</p><p>Our mission is to lead the transition from on-premises infrastructure to cloud-based, infinitely scalable and on-demand resources for VFX and Animation rendering, simulation and beyond.</p><p>What to expect:</p><p>- In your first 90 days: you’ll contribute to existing microservices in Python and help maintain our legacy Python AppEngine codebase. You’ll contribute to architectural discussions, participate in code reviews, and you’ll deploy your services automatically through our CI/CD pipeline.</p><p>- In your first 6 months: you’ll design, write and own microservices written in Python and/or Go, and help migrate our existing services to AWS.</p><p>- By the end of your first year: you’ll write lambda functions on AWS, and own several services written in Python and/or Go.</p><p>If any of this sounds interesting, we'd love to hear from you! Feel free to reach out to me directly, using the subject “Back-end SWE: HN 1/18”: francois {at} conductortech.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 7:13:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/gamedev",
      "TECH1/java",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev",
      "java",
      "python"
    ]
  },
  {
    "id": "_q5jW966S_qXG7BNoI6g1g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16052967",
    "title": "Tackle | Full Stack Developer | Boise, ID | REMOTE | https://tackle.io",
    "content": "<div>                  <span>Tackle | Full Stack Developer | Boise, ID | REMOTE | <a href='https://tackle.io' rel='nofollow'>https://tackle.io</a><p>Tackle helps software vendors sell their products in cloud marketplaces.  We are looking for an experienced Full Stack Developer to help us expand our existing platform so we can better serve our customers.</p><p>Stack Overview:-  Infrastructure: AWS-  Front-end: JavaScript / React / MobX-  Back-end: Python / Flask / Zappa</p><p>The ideal candidate will be a self-starter who enjoys working independently and has previous experience working on a remote/distributed team.</p><p>Email jobs@tackle.io<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 6:38:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "python"
    ]
  },
  {
    "id": "EL3soVWlTIq61zoNRlSKXg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16052924",
    "title": "SEEKING FREELANCER -- REMOTE OK. Open Source developer on Open edX (OpenCraft - Remote/worldwide company based in Berlin)",
    "content": "<div>                  <span>SEEKING FREELANCER -- REMOTE OK. Open Source developer on Open edX (OpenCraft - Remote/worldwide company based in Berlin)<p>Development specialized on the free software project Open edX, used by many universities and companies to run online courses. See edx.org, stanford.edu or fun-mooc.fr for examples of Open edX instances. We are a team of sixteen developers, working remotely from Europe, North America, Asia &amp; Australia. The company is not affiliated with edX, but contributing and working with them on various projects. This is a full time position, were you would be able to work remotely from where you want, as long as you have a good internet connection. : )</p><p>It's a large Python/Django codebase, with good code standards and architecture (a lot of the edX engineers come from MIT). You would work on different clients contracts using the platform. The clients list/references include Harvard, MIT, edX themselves, the French government, and various startups &amp; universities currently running their own instances, or looking to create one. Tasks are varied, from developing developing core platform features, custom exercises and tools for specific courses (XBlocks), customizing and deploying instances, working on both client/server sides, etc.</p><p>Most of your work is published as free software (Open edX is released under the AGPL license, which requires clients to release modifications under the same license), and you would also contribute to the free software project, pushing some of your developments upstream through pull requests, contributing features, documentation or help on mailing-lists.</p><p>Stack: Python/Django, Ansible, AWS/OpenStack, Debian/Ubuntu, JS, HTML/CSS, MySQL, MongoDB, Android/iOS</p><p>Interview process: a 30 minutes Hangout with a (simple) coding exercise.</p><p>To apply, fill this form: <a href='http://opencraft.com/jobs/open-source-developer/' rel='nofollow'>http://opencraft.com/jobs/open-source-developer/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 6:35:03 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/Any"
    ],
    "tagsNames1": [
      "Any time zone"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "m4n1GhIBStui_My3Q6UEXw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16052898",
    "title": "REMOTE (Worldwide) - Open Source Developer on Open edX - Python/Django, Javascript (OpenCraft - Remote/worldwide company incorporated in Berlin)",
    "content": "<div>                  <span>REMOTE (Worldwide) - Open Source Developer on Open edX - Python/Django, Javascript (OpenCraft - Remote/worldwide company incorporated in Berlin)<p>Development specialized on the free software project Open edX, used by many universities and companies to run online courses. See edx.org, stanford.edu or fun-mooc.fr for examples of Open edX instances. We are a team of sixteen senior developers, working remotely from Europe, North America, Asia &amp; Australia. The company is not affiliated with edX, but contributing and working with them on various projects. This is a full time position, were you would be able to work remotely from where you want, as long as you have a good internet connection. : )</p><p>It's a large Python/Django codebase, with good code standards and architecture (a lot of the edX engineers come from MIT). You would work on different clients contracts using the platform. The clients list/references include Harvard, MIT, edX themselves, the French government, and various startups &amp; universities currently running their own instances, or looking to create one. Tasks are varied, from developing developing core platform features, custom exercises and tools for specific courses (XBlocks), customizing and deploying instances, working on both client/server sides, etc.</p><p>Most of your work is published as free software (Open edX is released under the AGPL license, which requires clients to release modifications under the same license), and you would also contribute to the free software project, pushing some of your developments upstream through pull requests, contributing features, documentation or help on mailing-lists.</p><p>Stack: Python/Django, Ansible, AWS/OpenStack, Debian/Ubuntu, JS, HTML/CSS, MySQL, MongoDB, Android/iOS</p><p>Interview process: a 30 minutes Hangout with a (simple) coding exercise.</p><p>To apply, fill this form: <a href='http://opencraft.com/jobs/open-source-developer/' rel='nofollow'>http://opencraft.com/jobs/open-source-developer/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 6:31:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/Any"
    ],
    "tagsNames1": [
      "Any time zone"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "lnSefRMsSsu2Asc9n0MxMQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8697-open-source-developer-python-django-javascript",
    "title": "Open Source Developer - Python/Django, Javascript",
    "content": "Open Source Developer - Python/Django, Javascript - Jobmote<div><div><h2>Open Source Developer - Python/Django, Javascript</h2><h5>OpenCraft</h5></div></div><div><div><div><div><div><p>Development specialized on the free software project Open edX, usedby many universities and companies to run online courses. See <a href='http://edx.org' rel='nofollow'>edx.org</a>, <a href='https://lagunita.stanford.edu/' rel='nofollow'>stanford.edu</a> or&nbsp;<a href='https://www.fun-mooc.fr/' rel='nofollow'>fun-mooc.fr</a> for examples of Open edX instances.</p><p>It'sa large Python/Django codebase, with good code standards andarchitecture (a lot of the edX engineers come from MIT). You would workon different clients contracts using the platform. The clientslist/references include Harvard, edX themselves, the French government,and various universities &amp; companies currently running their owninstances, or looking to create one. Tasks are varied, from developingdeveloping core platform features, custom exercises and tools forspecific courses (XBlocks), customizing and deploying instances, workingon both client/server sides, etc.</p><p>Most of your work is publishedas free software (Open edX is released under the AGPL license, whichrequires clients to release modifications under the same license), andyou would also contribute to the free software project, pushing some ofyour developments upstream through pull requests, contributing features,documentation or help on mailing-lists.</p><p><strong>Skills &amp; requirements</strong></p><p><strong>Basic requirements:</strong> </p><ul><li>3+ years working with Python</li><li>Experience with Python web frameworks, specifically Django</li><li>3+ years of HTML, Javascript, and CSS (jQuery or other)</li><li>You feel comfortable working in a Linux environment, specifically Debian or Ubuntu</li><li>Experience with relational databases (MySQL)</li><li>Experience with contributing to free software projects, and communicating within a free software community</li></ul><p><strong>Optional requirements (you would be able to pick it up on the job if you don't master this yet):</strong> </p><ul><li>Mobile development (iOS and/or Android)</li><li>Experience with unit testing</li><li>Comfortable using git source control</li><li>System &amp; network administration experience, especially Debian or Ubuntu servers</li><li>Experience with cloud computing, like AWS or OpenStack</li><li>Experience with configuration management tools such as Ansible</li></ul><p><strong>About OpenCraft</strong></p><p>We are a team of sixteen developers, working remotely from Europe,North America, Asia, Russia &amp; Australia. You would arrive at acritical moment, as we scale up to handle increasing demand from clientson the edX platform. The company is not affiliated with edX, butcontributing and working with them on various projects.</p><p>This is afull time position, were you would be able to work remotely from whereyou want, as long as you have a good internet connection. : )</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 4:00:26 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "myPduGjyRLyhSe3dQR1E9A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/jobs/6022-open-source-developer-python-django",
    "title": "OpenCraft: Open Source Developer - Python/Django, Javascript",
    "content": "<div>  <div>    <h2>Open Source Developer - Python/Django, Javascript</h2>      <h4>Posted Jan  2</h4>    <h3>      <span>OpenCraft</span><br>      <span>Headquarters: Worldwide team (incorporation in Berlin)</span><br>        <a href='http://opencraft.com/' rel='nofollow'>http://opencraft.com/</a>    </h3>  </div>    </div>  <div>    <div>Development specialized on the free software project Open edX, used by many universities and companies to run online courses. See <a href='http://edx.org' rel='nofollow'>edx.org</a>, <a href='https://lagunita.stanford.edu/' rel='nofollow'>stanford.edu</a> or&nbsp;<a href='https://www.fun-mooc.fr/' rel='nofollow'>fun-mooc.fr</a> for examples of Open edX instances.</div><div><br></div><div>It's a large Python/Django codebase, with good code standards and architecture (a lot of the edX engineers come from MIT). You would work on different clients contracts using the platform. The clients list/references include Harvard, edX themselves, the French government, and various universities &amp; companies currently running their own instances, or looking to create one. Tasks are varied, from developing developing core platform features, custom exercises and tools for specific courses (XBlocks), customizing and deploying instances, working on both client/server sides, etc.</div><div><br></div><div>Most of your work is published as free software (Open edX is released under the AGPL license, which requires clients to release modifications under the same license), and you would also contribute to the free software project, pushing some of your developments upstream through pull requests, contributing features, documentation or help on mailing-lists.</div><div><br></div><div><strong>Skills &amp; requirements</strong></div><div><br></div><div><strong>Basic requirements:</strong><br></div><ul><li>3+ years working with Python</li><li>Experience with Python web frameworks, specifically Django</li><li>3+ years of HTML, Javascript, and CSS (jQuery or other)</li><li>You feel comfortable working in a Linux environment, specifically Debian or Ubuntu</li><li>Experience with relational databases (MySQL)</li><li>Experience with contributing to free software projects, and communicating within a free software community</li></ul><div><strong>Optional requirements (you would be able to pick it up on the job if you don't master this yet):</strong><br></div><ul><li>Mobile development (iOS and/or Android)</li><li>Experience with unit testing</li><li>Comfortable using git source control</li><li>System &amp; network administration experience, especially Debian or Ubuntu servers</li><li>Experience with cloud computing, like AWS or OpenStack</li><li>Experience with configuration management tools such as Ansible</li></ul><div><b><br></b></div><div><b>About OpenCraft</b></div><div><br></div><div>We are a team of sixteen developers, working remotely from Europe, North America, Asia, Russia &amp; Australia. You would arrive at a critical moment, as we scale up to handle increasing demand from clients on the edX platform. The company is not affiliated with edX, but contributing and working with them on various projects.</div><div><br></div><div>This is a full time position, were you would be able to work remotely from where you want, as long as you have a good internet connection. : )</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>To apply, fill this form: <a href='http://opencraft.com/jobs/open-source-developer/' rel='nofollow'>http://opencraft.com/jobs/open-source-developer/</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 2, 2018 3:14:15 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/Any"
    ],
    "tagsNames1": [
      "Any time zone"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "xR9rnQIqTEaeWDQlUQouHg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/163821/backend-django-engineer-cdx-limited?a=SWjdk4xWEO4",
    "title": "Backend Django Engineer at CDX Limited",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise Web Solutions, Financial Services, Social Commerce</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are looking for a Mid-level or Senior Python Developer to join the team at CDX Limited. You’ll be taking the lead on building&nbsp;new features for our users, support tools for our staff, and management tools for our sysadmins, as we move from our functional alpha product to a closed private beta.</p><p><strong>To be successful in this role, you'll:</strong></p><ul><li>Be an expert in Python and&nbsp;Django, as well as most of the following supporting languages, technologies and frameworks: DRF, Celery, Docker, PostgreSQL, Amazon EC2 + ECS.</li><li>Be&nbsp;highly skilled&nbsp;in SQL, Linux&nbsp;command line and git.</li><li>Be familiar with modern frontend development practices including React, Redux and Sagas (our frontend engineers build all customer-facing pages, but you will need to implement some admin tools)</li><li>Be confident communicating with&nbsp;technical peers to&nbsp;build clearly defined requirements and convert these into robust technical architecture.</li><li>Be experienced in producing high-quality technical specifications, documentation and accurately estimating the time required for the build.</li><li>Be confident in providing tests to support code, contributing to testing strategies and providing high-quality user training documentation.</li><li>Have experience producing high-quality code to budget, demonstrating commercial awareness. &nbsp;</li><li>Have the ability to operate independently as technical lead on small projects.</li><li>Be confident contributing to proposals and pitching successfully.</li></ul><p>We'd love you to have a current technical blog, web presence, or an active Github profile. Maybe you're interested in Rust / Go / something we haven't heard of - tell us about it!</p><p><strong>As well as the technical knowledge, you'll also:</strong></p><ul><li>Remain up to date with state-of-the-art developments in your software field and share your knowledge with the wider team.</li><li>Be confident keeping projects on track through strong personal project management skills, collaboration and supporting other team members.</li><li>Support colleagues (teaching, coaching, line managing, mentoring, reviewing and improving code).</li></ul><p><strong>In return we'll offer:</strong></p><ul><li>An opportunity to work on&nbsp;a highly-visible, technically advanced project with a world-class team of industry leaders.</li><li>Performance-related bonuses.</li><li>Travel to occasional technical conferences (optional).</li><li>Competitive salary, depending on experience.</li><li>15 days annual leave.</li></ul><p>CDX Limited&nbsp;is an Equal Opportunities employer.</p><p>No agencies, please.</p>                    </div>                            <h2>                About CDX Limited            </h2>            <div><p>CDX Limited is a financial services&nbsp;project from the team behind GlobeNove Digital LTD. Founded in 2017, the exact nature of the project is&nbsp;undisclosed for legal and security reasons until we enter a closed Beta period in&nbsp;early 2018.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work Remote                            </div>                            <div>                                 Flexible Scheduling                            </div>                            <div>                                 Emerging Technologies                            </div>                            <div>                                 Competitive Salaries                            </div>                    ",
    "urlFetchPending": false,
    "published": "Jan 1, 2018 5:18:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "TWjpR00ZQFuBoFlWLNx-fA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4064-python-engineer-telnyx",
    "title": "Python Engineer @ Telnyx",
    "content": "<h2>              Python Engineer<small> @ Telnyx</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-12-30 02:44</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>About Telnyx</strong></p><p>Telnyx is building the global telco of the future. We have deployed an international private software-defined network, with multiple tier-1 interconnects, leveraging all major cloud service providers to deliver a voice and messaging solution with carrier-grade reliability. We sell our services in a totally automated fashion, allowing our users to programmatically scale their voice and messaging on-demand.In addition to providing service and software in major North American and European markets, we are expanding to Asia and are developing a wireless product that will provide licensed spectrum access to our infrastructure.Telnyx has seventy employees (75% engineers) between our Chicago, IL office, Dublin, Ireland office and remote team. We have actual revenue traction, meaningful sequential monthly growth, and a massive addressable market.</p><p><strong>Joining Our Team</strong></p><p>At Telnyx, we’re working to globally democratize access to real-time communications over the internet. We’re building a future where voice, messaging, and wireless services can act as building blocks to facilitate high-fidelity, secure, and modern modes of communication.No matter where you're based, or which team you work on, you’ll be part of a group of people working together to build solutions to mission-critical problems and a company that values the very best ideas. People rely on our products to communicate daily, which means they rely on us to build things with a high degree of resiliency and reliability.</p><p><strong>The Role</strong></p><p>As a Python Engineer at Telnyx, you will deploy groundbreaking applications to solve our customers’ hardest problems. Projects often start with a nebulous question and our Engineers lead the way in developing a solution, from high-level system design and prototyping to application development and data integration. As a Telnyx software engineer, you leverage everything around you: Telnyx products, open source technologies, and anything you and your team can build to drive real impact.</p><p>You work with users around the globe, where you help our customers by solving their communications challenges. Each mission presents different challenges, from the regulatory environment to the nature of the data to the user population. You will work to accommodate all aspects of an environment to drive real technical outcomes.</p><p><strong>In this role, you will:</strong></p><ul><li>Build Python products for the delivery of mission-critical global communications. These products are latency sensitive and must handle data at scale, all while maintaining an intuitive user experience.</li><li>Create tools to automate critical aspects of production systems.</li></ul><p><strong>Technologies we use</strong></p><ul><li>A variety of languages including Python, Java, Elixir, Scala, Go, Angular, and React.</li><li>Open-source technologies like Cassandra, Spark, and ElasticSearch.</li><li>Industry-standard build tooling, including Docker, Consul, Jenkins, Ansible, and Github.</li></ul><p><strong>What we value:</strong></p><ul><li>Demonstrated ability to continuously learn, work independently, and make decisions with minimal supervision. You understand that making mistakes means you’re learning, and you actively seek opportunities to grow and develop.</li><li>You want to work on software that is changing the world and you're passionate about creating intuitive, scalable products that magnify the analytical capabilities of our users. </li><li>Familiarity with Twisted and Go is a plus.</li><li>Experience building and operating scalable infrastructure software or distributed systems.</li><li>Experience with large-scale production databases and major cloud services.</li><li>Familiarity with micro-service architectures.</li><li>Highly proficient in a Linux environment. </li><li>Experience working with message queues (RabbitMQ).</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Dec 30, 2017 4:44:27 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "fshmCO5gReWJj3GgH5Dwhg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/64001",
    "title": "Python Engineer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>About Telnyx</strong><br><br>Telnyx is building the global telco of the future. We have deployed an international private software-defined network, with multiple tier-1 interconnects, leveraging all major cloud service providers to deliver a voice and messaging solution with carrier-grade reliability. We sell our services in a totally automated fashion, allowing our users to programmatically scale their voice and messaging on-demand.<br>In addition to providing service and software in major North American and European markets, we are expanding to Asia and are developing a wireless product that will provide licensed spectrum access to our infrastructure.<br>Telnyx has seventy employees (75% engineers) between our Chicago, IL office, Dublin, Ireland office and remote team. We have actual revenue traction, meaningful sequential monthly growth, and a massive addressable market.<br><br><strong>Joining Our Team</strong><br><br>At Telnyx, we’re working to globally democratize access to real-time communications over the internet. We’re building a future where voice, messaging, and wireless services can act as building blocks to facilitate high-fidelity, secure, and modern modes of communication.<br>No matter where you're based, or which team you work on, you’ll be part of a group of people working together to build solutions to mission-critical problems and a company that values the very best ideas. People rely on our products to communicate daily, which means they rely on us to build things with a high degree of resiliency and reliability.<br><br><strong>The Role</strong><br><br>As a Python Engineer at Telnyx, you will deploy groundbreaking applications to solve our customers’ hardest problems. Projects often start with a nebulous question and our Engineers lead the way in developing a solution, from high-level system design and prototyping to application development and data integration. As a Telnyx software engineer, you leverage everything around you: Telnyx products, open source technologies, and anything you and your team can build to drive real impact.<br><br>You work with users around the globe, where you help our customers by solving their communications challenges. Each mission presents different challenges, from the regulatory environment to the nature of the data to the user population. You will work to accommodate all aspects of an environment to drive real technical outcomes.<br><br><strong>In this role, you will:</strong><br><br></p><ul><li>Build Python products for the delivery of mission-critical global communications. These products are latency sensitive and must handle data at scale, all while maintaining an intuitive user experience.<br></li><li>Create tools to automate critical aspects of production systems.<br><br><strong>Technologies we use</strong><br><br></li><li>A variety of languages including Python, Java, Elixir, Scala, Go, Angular, and React.<br></li><li>Open-source technologies like Cassandra, Spark, and ElasticSearch.<br></li><li>Industry-standard build tooling, including Docker, Consul, Jenkins, Ansible, and Github.<br><br><strong>What we value:</strong><br><br></li><li>Demonstrated ability to continuously learn, work independently, and make decisions with minimal supervision. You understand that making mistakes means you’re learning, and you actively seek opportunities to grow and develop.<br></li><li>You want to work on software that is changing the world and you're passionate about creating intuitive, scalable products that magnify the analytical capabilities of our users. <br></li><li>Familiarity with Twisted and Go is a plus.<br></li><li>Experience building and operating scalable infrastructure software or distributed systems.<br></li><li>Experience with large-scale production databases and major cloud services.<br></li><li>Familiarity with micro-service architectures.<br></li><li>Highly proficient in a Linux environment. <br></li><li>Experience working with message queues (RabbitMQ).</li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 30, 2017 4:44:27 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "GtX4kz-aRZ2I3-oz89gSBg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/163687/software-developer-in-test-python-scrapinghub?a=STwsZKpRMIM",
    "title": "Software Developer in Test - Python at Scrapinghub",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>About the Job:</strong></p><p>QA is an important function within Scrapinghub. The QA team works to ensure that the quality and usability of the data scraped by our web scrapers meets and exceeds the expectations of our enterprise clients.</p><p><em>Are you passionate about data and data quality and integrity?</em></p><p><em>Do you enjoy using Python to automate testing, analyze data, and speed up manual processes?</em></p><p><em>Are you highly customer-focused with excellent attention to detail?</em></p><p>Due to growing business and the need for ever more sophisticated QA, we are looking for talented Software Test Engineers with experience in Python and automation to join our team. &nbsp;As a Scrapinghub Engineer, you will build automated test frameworks and ad hoc test scripts to assist verification and validation of data quality.</p><p><strong>Due to business requirements, candidates must be based in a European or U.S. timezone.</strong></p><p><strong>Role Responsibilities:</strong></p><ul><ul><li>Understand customer web scraping and data requirements and map these to automated tests.</li><li>Analyze gaps in test coverage and bridge gaps with appropriate automated solutions in Python.</li><li>Take responsibility for data quality in multiple parallel projects, often working under minimal supervision.</li><li>Collaborate with developers, Head of QA, and Project Managers to efficiently move new scraping projects from the client requirements-specification stage, through development, QA, and ultimately on to the client with a high degree of quality.</li><li>Proactively suggest and take ownership of improvements to QA processes and methodologies.</li></ul></ul><p><strong>Required Skills:</strong></p><ul><ul><li>BS degree in Computer Science, Engineering or equivalent experience.</li><li>Demonstrable Python programming knowledge and experience, minimum of 3 years (please provide code samples in your application, via a link to GitHub or other publicly-accessible service).</li><li>Minimum 3 years in a Software Test, Software QA, or Software Development role, in Agile, fast-paced environment and projects.</li><li>Solid grasp of web technologies and protocols (HTML, XPath, JSON, HTTP, CSS etc.)Strong knowledge of software QA methodologies, tools, and processes.</li><li>Experience in writing clear, concise and comprehensive test plans, test cases, and bug reports in JIRA, Redmine, or similar.</li><li>Able to formulate moderate to reasonably complex SQL queries.</li><li>Good level of written and spoken English; confident communicator; able to communicate on both technical and non-technical levels with various stakeholders on all matters of QA.</li><li>Demonstrable experience in taking responsibility for assignments and seeing them to completion with minimal supervision.</li><li>Experience in implementing automated tests and building automated test frameworks.</li></ul></ul><p><strong>Desired Skills:</strong></p><ul><ul><li>Knowledge and experience of Scrapy and other Python-based scraping frameworks a distinct advantage.</li><li>Prior experience in a Data QA role (where the focus was on verifying data quality, rather than testing application functionality).</li><li>Knowledge of JavaScript.</li><li>Linux command knowledge.</li><li>A demonstrable interest in web scraping, data extraction, and data analysis.</li><li>Previous remote working experience.</li></ul></ul>                    </div>                            <h2>                About Scrapinghub            </h2>            <div><p>Founded in 2010, Scrapinghub is a fast growing and diverse technology business turning web content into useful data with a cloud-based web crawling platform, off-the-shelf datasets, and turn-key web scraping services.</p><p>We’re a globally distributed team of over 100 Scrapinghubbers working from over 30 countries who are passionate about scraping, web crawling, and data science.</p><p>As a new Scrapinghubber, you will:</p><p>Become part of a self-motivated, progressive, multi-cultural team.</p><p>Join a team with huge opportunity to make a difference</p><p>Have the opportunity to work remotely.</p><p>Have the opportunity to go to conferences and meet with the team from across the globe.</p><p>Get the chance to work with cutting-edge open source technologies and tools.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible working hours                            </div>                            <div>                                 Remote working                            </div>                            <div>                                 Paid time off                            </div>                            <div>                                 Paid open source work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 19, 2017 7:47:05 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "IC_yWRfNTSK8lD8vqiMzvQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/163403/full-stack-engineer-build-the-smartest-way-to-unhaggle-inc?a=SNCluHxJje8",
    "title": "Full Stack Engineer - Build the smartest way to buy a car (Remote) at Unhaggle Inc.",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, DevOps</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Automotive</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Unhaggle is currently the #1 web portal in Canada for new car buying. The data we provide powers our own tools and products, including our flagship consumer car buying service at Unhaggle.com and leading automotive portals including Yahoo Autos, MSN Autos, Autofocus, AutoGuide, Globe Drive, and others. We have also recently partnered with auto makers to launch a large eCommerce platform allowing the complete purchase of new cars online.</p><p>We are looking for full stack&nbsp;developers with <strong>Strong Python skills</strong> and experience with web application development. This is a full-time remote position, we accept applications from anywhere in the world.&nbsp;</p><p>We use GitHub to manage tasks and code reviews as well as tools/services like Travis-CI, Docker, New Relic, Sentry, Browserstack, Stripe, Twilio&nbsp; and Redis. Our dev team is regularly connected in Slack for communication. We are constantly seeking the best tools available for our development team.</p><p>You will be primarily involved in the following projects/areas:</p><p>* Our new eCommerce platform for new car buying, serving major car brands<br>* Our web portal unhaggle.com<br>* Several enterprise SaaS products</p><p>* REST APIs, for integration with different partners<br>* An internal and innovative SaaS web application we built for industry clients<br>* Widgets we built for third-party integration, they run in some of the most popular auto websites in Canada.<br>* Maintenance of our test suite and code base<br>* Implementation of new features<br>* We take quality seriously and you should expect to be involved in well written code bases following standards such as PEP-8 and good software engineering practices.</p><p><strong>Skills &amp; Requirements</strong></p><p>* Strong hands on experience with Python, experience with Django is important, but we might still be willing to consider candidates with strong Python skills and none or little knowledge with Django.<br>* Strong web development experience: we expect that you know XHTML, CSS and Javascript well. Hands on experience with Javascript frameworks&nbsp; is a big plus<br>* Track record of delivering completed projects, preferably web-based<br>* Good SQL knowledge and databases, PostgreSQL is a plus<br>* You should be very familiar with Linux<br>* Experience using version control software, Git is a plus<br>* Understanding of code best practices and standards. We also expect that you follow PEP-8 style guide and&nbsp;are familiar with tools like Pyflakes and Pylint.<br>* Experience writing Python test cases is a plus. Prior experience with TDD and/or Selenium is a plus.<br>* Easy-going personality. You will actively participate in design discussions and code review</p><p>This position might grow into a technical lead position. Experience leading development teams is a plus.</p><p><strong>No relocation, we are a distributed team.</strong></p>                    </div>                            <h2>                About Unhaggle Inc.            </h2>            <div><p>We are helping consumers to get the best price on new cars in Canada and changing the industry along the way. &nbsp;Working at Unhaggle brings unique challenges, you will have the opportunity to leave a large footprint and have real impact in the product we ship every day to our customers.</p>            </div>        ",
    "urlFetchPending": false,
    "published": "Dec 19, 2017 12:17:17 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "aogho4NfQ06GD9WvCdi2cA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/awaaz-de/jobs/49219-backend-developer-ahmedabad-mumbai-or-pune",
    "title": "Backend Developer (Ahmedabad, Mumbai, or Pune)",
    "content": "<div><h2>Backend Developer (Ahmedabad, Mumbai, or Pune) at Awaaz.De</h2><div>Ahmedabad, Pune, Mumbai, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Python, Django, MySQL, Software Architecture, Redis, PostgreSQL, Software Testing, Celery, ElasticSearch </div><div>Compensation</div><div>$10K–$25K<br>No Equity</div></div><h3>Job Description</h3><div><p>Work in a sprint-based agile development team, participate in the full cycle including release/sprint planning, feature design, story definition, daily standups, development, testing, code review, and release packaging. You will also work on the automated build, test and package environment.</p><p>Responsibilities:</p><p>* Work collaboratively in a fast-growing startup building products and services for positive social impact<br>* From the ground-up, architect available, secure, reliable back-end systems for the web, mobile, and IVR<br>* Write, test, and release world-class, production-ready code</p><p>Qualifications:</p><p>* 2-10 years experience building web-scale, highly available backends for web and/or mobile. Degree in Computer Science or related field a plus<br>* 3+ years experience with Django, Celery, and Django REST Framework<br>* Expertise writing with and using Django extensions<br>* Experience in data model design and data manipulation in MySQL and Postgres<br>* Strong problem solving skills; attention to detail<br>* Skill in deploying and maintaining services in the Debian + Ubuntu environments<br>* Knowledge of document, key/value or other non-relational database system such as Elastic Search, Redis, HBase, BigTable, Dynamo a plus.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 18, 2017 9:40:41 PM",
    "tags": [
      "Ahmedabad",
      "Backend Developer",
      "Celery",
      "Django",
      "ElasticSearch",
      "Full Time",
      "Mumbai",
      "MySQL",
      "PostgreSQL",
      "Pune",
      "Python",
      "REMOTE1/100",
      "Redis",
      "Remote OK",
      "Software Architecture",
      "Software Testing",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "9z_N5Gk-TUu1KWNr7AoUHA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/awaaz-de/jobs/49220-full-stack-developer-ahmedabad-mumbai-or-pune",
    "title": "Full Stack Developer (Ahmedabad, Mumbai, or Pune)",
    "content": "<div><h2>Full Stack Developer (Ahmedabad, Mumbai, or Pune) at Awaaz.De</h2><div>Pune, Mumbai, Ahmedabad, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Python, Javascript, Django, MySQL, Software Architecture, Front-End Development, PostgreSQL, Celery, HTML5 &amp; CSS3, Angular.JS, Unit Testing</div><div>Compensation</div><div>$10K–$25K<br>0.0%–10.0%</div></div><h3>Job Description</h3><div><p>As a full-stack developer, you'll work with everything from front-end HTML, CSS and JS to server-side Python/Django and several different data stores including PostgreSQL, MySQL, Redis, and Elasticsearch.</p><p>Responsibilities:</p><p>* Work collaboratively in a fast-growing startup building products and services for positive social impact<br>* Implementing an elegant, intuitive user experience using latest front-end technologies<br>* Implementing server-side code and designing the data architecture using modern web frameworks<br>* Write, test, and release world-class, production-ready code</p><p>Qualifications:</p><p>* 3-10 years experience building web-scale, highly available backends for web and/or mobile. Degree in Computer Science or related field a plus<br>* 3+ years experience with Django, Celery, and Django REST Framework<br>* Expertise writing with and using Django extensions<br>* 3+ years experience developing apps in AngularJS<br>* Strong problem solving skills; attention to detail<br>* Comfort with Debian + Ubuntu environments<br>* Knowledge of document, key/value or other non-relational database system such as Elastic Search, Redis, HBase, BigTable, Dynamo a plus.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 15, 2017 12:54:37 AM",
    "tags": [
      "Ahmedabad",
      "Angular.JS",
      "Celery",
      "Django",
      "Front-End Development",
      "Full Time",
      "Full-Stack Developer",
      "HTML5 & CSS3",
      "Javascript",
      "Mumbai",
      "MySQL",
      "PostgreSQL",
      "Pune",
      "Python",
      "REMOTE1/100",
      "Remote OK",
      "Software Architecture",
      "TECH1/frontend",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "python"
    ]
  },
  {
    "id": "7Nhs0N7-S26_1E75XTcMnw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/162978/software-engineer-data-team-britecore?a=SEMsaELTLzi",
    "title": "Software Engineer (Data Team) at BriteCore (Springfield, MO)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Insurance, Web Development</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>BriteCore is looking for creative Software Engineers for our Data team. Product Development is the branch of the company responsible for building new replacement modules for BriteCore, our flagship cloud-based insurance software.</p><p><strong>Your job will involve...</strong></p><p>● Maintaining our current ETL, DWH and reports using Python, SQL and Pandas</p><p>● Developing new vendor integrations using external APIs</p><p>● Developing new reports using Python, Pandas and SQL</p><p>● Designing and developing new products including DWH, Dashboards and Reports using different AWS solutions</p><p>● Solving support tickets and new funded requests coming from our current clients</p><p>● Collaborating with other Product Development engineers Benefits and Compensation</p><p>● $50k-$70k based on experience and proven performance</p><p>● Benefit from working alongside and observing world-class developers first hand</p><p>● Comprehensive health insurance coverage including medical, dental, and vision</p><p>● Flexible schedule</p><p>● Relaxed work environment</p><p>● Remote work</p><p>● Flexible learning time - explore your ideas and new technologies on the clock</p><p><strong>Technologies You Will Utilize </strong></p><p>● Python ● Django ● Pandas ● SQLAlchemy and SQL ● MySQL ● GitHub ● Linux (Command line knowledge such as BASH, ZSH, or FISH) ● Amazon Web Services ● Docker</p><p><strong>We Will Expect You To</strong></p><p>● Communicate clearly and fluently in English both verbally and written (native or advanced level required since you will interact with clients frequently)</p><p>● Stay familiar with the latest web development trends</p><p>● Follow industry best practices</p><p>● Be friendly, confident, and patient with others</p><p>● Communicate clearly and effectively over chat and video conference</p><p>● Ship code on time</p><p>● Self-direct</p><p>● Welcome feedback and collaboration</p>                    </div>                            <h2>                About BriteCore            </h2>            <div><p>At BriteCore, we build gorgeous, scalable, and usable cloud-based insurance software. This is a company founded by, and run by software engineers. We have created a team of top performers developing modern systems for the insurance industry. Our team enjoys working together, and takes tremendous pride and ownership in our platform. <br><br>We promote a high quality of life for our employees by allowing them to choose their own schedule and location. Bring creativity, focus, and productivity to your job, and enjoy 40 hour work weeks, flexible paid time off, and remote work.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Hours                            </div>                            <div>                                 3+ weeks Paid Time Off                            </div>                            <div>                                 Competitive Compensation                            </div>                            <div>                                 Comprehensive Health Insurance                            </div>                            <div>                                 Most employees work remotely                            </div>                            <div>                                 Relaxed Work Environment                            </div>                            <div>                                 Explore ideas, new technologies on the clock                            </div>                            <div>                                 Annually attend a conference of your choice                            </div>                            <div>                                 Work alongside talented developers                            </div>                            <div>                                 Can buy shares of company stock                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 10:59:50 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "lBbZAqxuS1-sxaud9V5DlA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63667",
    "title": "Python Web Developer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><h3>Work Description<br></h3><p>Due to increasing demand, we’re looking for the right developer to join our company and help us grow.<br><br>You will be working primarily with Python/Django and Javascript (React) web development. You’ll be developing new features as well as fixing bugs. You will be working together with our lead-developer and designer to improve our customer experience and move our product forward with robust and well-tested code.<br><br>Your work will impact our customers from day one. This is not some trivial code-monkey job. You will do important work and help the company grow from day one and delight our users with your code every day. We ship early and often.<br><br>You will be working on a product. We have no client-deadlines and no client meetings. We have an ongoing feedback loop from our customers, and you and the team decide what on the roadmap we will be working on.<br><br></p><h3>Skills and requirements<br></h3><p>You are first and foremost an experienced Python/Django developer.<br><br>It’s a plus if you’re also knowledgeable in some of the tech we use in the rest of our stack; AWS, MySQL &amp; JavaScript(React).<br><br>You write simple, beautiful and robust code. You always leave the code base better than before, and you write unit-tests. You don’t like quick and dirty. You value to build stuff that lasts.<br><br>You are conversational in English, both in writing and speaking. As we work asynchronously and remotely, we need you to be a great writer and communicator.<br><br>You are independent, honest and not afraid to ask questions.<br><br>You have attention to detail and always have the users in mind when developing. You are open-minded and not afraid to discuss different solutions.<br><br>You’re proud of what you do and want to learn and become better every day.<br><br></p><h3>About our Product and our Company<br></h3><p>We’re a small remote team of 5 looking for a full-time developer. Our headquarter is in Aarhus, Denmark. But you can work from anywhere.<br><br>We created <a href='https://trysmartplan.com' rel='nofollow'>Smartplan</a> almost four years ago. The company is growing, and our product is ever evolving, with several thousand of users every day.<br>We use basecamp.com and Slack to run our business.<br><br>Our product is an easy to use online employee scheduling tool. The majority of our customer base is in Denmark. We have started to expand to Sweden and Norway. We also have customers in Germany, UK, and Switzerland.<br><br>Our goal is to delight our customers every day and help them run a more frustration free business through a better employee schedule. We help them bring an important part of their business online instead of hacking around in an Excel spreadsheet.<br><br>Check out our product website at <a href='https://trysmartplan.com' rel='nofollow'>https://trysmartplan.com</a></p></span></td><td></td><td></td><td><a href='mailto:mathias%40trysmartplan.com?subject=Application%20for%20Python%20Web%20Developer%20at%20Smartplan&amp;body=Hi%21%0A%0AI%27d%20like%20to%20apply%20for%20your%20position%20for%20a%20Python%20Web%20Developer%20at%20Smartplan' rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 10:39:53 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "8n2YWXlwRbqknPtYs-Gk_g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/coinsph/jobs/31951-senior-software-engineer-thailand-bangkok",
    "title": "Senior Software Engineer - Thailand (Bangkok)",
    "content": "<div><h2>Senior Software Engineer - Thailand (Bangkok) at Coins.ph</h2><div>Thailand, Bangkok, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Python, Javascript, Mobile, Django, Web Development, Financial Services, Flask, Bitcoin, AWS/EC2/ELB/S3/DynamoDB, Blockchain</div><div>Compensation</div><div>$40K–$100K<br>0.0%–0.5%</div></div><h3>Job Description</h3><div><p>Senior Software Engineer</p><p>Why This is Exciting</p><p>-Advanced Technology - We're building our financial services platform on the back of the Bitcoin Blockchain and are one of the largest deployments in the Blockchain industry globally<br>-Opportunity to Scale a Rapidly Growing Deployment - We're currently in a period of rapid user growth and are solving challenging scaling problems every day; your work will affect millions of users<br>-Flexible Working Arrangement - More than half our development team successfully works remotely, we can assist with relocation to the Philippines, Thailand, or Singapore, and we have onsite teams in Manila and Bangkok<br>-Mission - If we succeed in our mission, our company will provide financial services for the first time to hundreds of millions of people and will economically empower individuals and communities throughout Southeast Asia</p><p>What We’re Looking For</p><p>Coins is looking for experienced software engineers across the stack to join our rapidly scaling FinTech company.  We are looking for engineers that can help us develop new products, scale our existing systems, and create meaningful user experiences.  Coins is a company founded by software engineers and accordingly we have strong engineering principles in the very DNA of our company.  We are actively seeking the best talent in the world and offer a variety of working arrangements.</p><p> </p><p>Technologies &amp; Tools We Use</p><p>We are actively seeking the best engineering talent regardless of programming language, so background in these technologies is not necessarily required, but some of the technologies our team currently uses include:<br>-Python<br>-Django<br>-Flask<br>-Ember.js<br>-AWS<br>-Redis<br>-Postgres<br>-Docker<br>-Kubernetes<br>-Android<br>-iOS<br>-Golang<br> <br> </p><p>Minimum Background</p><p>-4+ years relevant experience as a Software Engineer with a strong team<br>-Relevant Bachelor’s or Master’s degree in Computer Science or related technical discipline<br>-Proficient written and verbal communication skills in English<br> </p><p>How To Stand Out</p><p>-A well-maintained Github profile with samples of your prior work.  Relevant open-source commits or other public work vetted by developers online is a big plus<br>-Experience in building easy-to-use consumer products<br>-Experience building FinTech products or other financial systems<br>-Passion for Bitcoin and Blockchain technologies and a detailed understanding of how they work<br>-Experience with Agile Product Development processes<br>-Experience working with a remote team</p></div>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 11:33:09 AM",
    "tags": [
      "AWS/EC2/ELB/S3/DynamoDB",
      "Backend Developer",
      "Bangkok",
      "Bitcoin",
      "Blockchain",
      "Django",
      "Financial Services",
      "Flask",
      "Full Time",
      "Javascript",
      "Mobile",
      "Mobile Developer",
      "Python",
      "REMOTE1/100",
      "Remote OK",
      "Software Engineer",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown",
      "Thailand",
      "Web Development"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "YVYxs_fIQvO3yHzjtw6xvA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/coinsph/jobs/26969-senior-software-engineer-philippines-manila",
    "title": "Senior Software Engineer - Philippines (Manila)",
    "content": "<div><h2>Senior Software Engineer - Philippines (Manila) at Coins.ph</h2><div>Philippines, Manila, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Python, Javascript, Mobile, Django, Web Development, Financial Services, Flask, Bitcoin, AWS/EC2/ELB/S3/DynamoDB, Blockchain</div><div>Compensation</div><div>$40K–$100K<br>0.0%–0.5%</div></div><h3>Job Description</h3><div><p>Senior Software Engineer</p><p>Why This is Exciting</p><p>-Advanced Technology - We're building our financial services platform on the back of the Bitcoin Blockchain and are one of the largest deployments in the Blockchain industry globally<br>-Opportunity to Scale a Rapidly Growing Deployment - We're currently in a period of rapid user growth and are solving challenging scaling problems every day; your work will affect millions of users<br>-Flexible Working Arrangement - More than half our development team successfully works remotely, we can assist with relocation to the Philippines, Thailand, or Singapore, and we have onsite teams in Manila and Bangkok<br>-Mission - If we succeed in our mission, our company will provide financial services for the first time to hundreds of millions of people and will economically empower individuals and communities throughout Southeast Asia</p><p>What We’re Looking For</p><p>Coins is looking for experienced software engineers across the stack to join our rapidly scaling FinTech company.  We are looking for engineers that can help us develop new products, scale our existing systems, and create meaningful user experiences.  Coins is a company founded by software engineers and accordingly we have strong engineering principles in the very DNA of our company.  We are actively seeking the best talent in the world and offer a variety of working arrangements.</p><p> </p><p>Technologies &amp; Tools We Use</p><p>We are actively seeking the best engineering talent regardless of programming language, so background in these technologies is not necessarily required, but some of the technologies our team currently uses include:<br>-Python<br>-Django<br>-Flask<br>-Ember.js<br>-AWS<br>-Redis<br>-Postgres<br>-Docker<br>-Kubernetes<br>-Android<br>-iOS<br>-Golang<br> </p><p> </p><p>Minimum Background</p><p>-4+ years relevant experience as a Software Engineer with a strong team<br>-Relevant Bachelor’s or Master’s degree in Computer Science or related technical discipline from a top global University<br>-Proficient written and verbal communication skills in English<br> </p><p>How To Stand Out</p><p>-A well-maintained Github profile with samples of your prior work.  Relevant open-source commits or other public work vetted by developers online is a big plus<br>-Experience in building easy-to-use consumer products<br>-Experience building FinTech products or other financial systems<br>-Passion for Bitcoin and Blockchain technologies and a detailed understanding of how they work<br>-Experience with Agile Product Development processes<br>-Experience working with a remote team</p></div>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 11:33:09 AM",
    "tags": [
      "AWS/EC2/ELB/S3/DynamoDB",
      "Backend Developer",
      "Bitcoin",
      "Blockchain",
      "Django",
      "Financial Services",
      "Flask",
      "Frontend Developer",
      "Full Time",
      "Javascript",
      "Manila",
      "Mobile",
      "Philippines",
      "Python",
      "REMOTE1/100",
      "Remote OK",
      "Software Engineer",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown",
      "Web Development"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "b6v3SMioRSCQRlzZlu_xPg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156093/senior-full-stack-developer-django-python-advanced-threat-analytics?a=QlCB8kFPzuU",
    "title": "Senior Full Stack Developer (Django/Python) at Advanced Threat Analytics, Inc. (Plano, TX)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Cybersecurity</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>The Job and the Ideal Candidate </strong></p><p>You'll be working with us as a full stack developer to build/improve the platform. The platform is currently in use by over 130 customers, and security operations centers that are 24x7.</p><p><strong>Location</strong></p><p>We prefer candidates local to the Plano, TX area. We are open to the right candidate even if you are remote. If you are remote and believe you are the right person for the job - send us some code, change our mind!</p><p><strong>The Traits Our Backend Developers Have</strong></p><ol><li>Fluent in Django/Python.</li><li>Passion for front end development. In some cases this is mobile app development, in other cases, it's integration with other products that need to consume our APIs, or web development with AngularJS. This helps build better backends when you are the consumer.</li><li>Possess strongly held beliefs and aren't afraid to voice them. Opinions are usually based on something very specific related either to past experiences or to the platform, and very rarely theoretical.</li><li>At least one specific area of excellence in the skills mentioned below - you know this cold!</li><li>Reasonable work/life balance barring bursts which are exceptions. Exceptions aren't the norm.</li></ol><p><strong>Skills You'll Need </strong></p><ol><li>Python/Django - We use lots of it.&nbsp;</li><li>Docker, AWS - specifically the following services - ECS, S3, SQS.</li><li>PostgreSQL, ElasticSearch, Logstash, and Kibana - Core of the platform.</li><li>RabbitMQ, Terraform and other ancillary services that we offer.</li><li>Front End - Pick one: React Native, Angular, Swift, Android.</li></ol><p><strong>The Interview Process </strong></p><ol><li>If you like what you've heard so far and want to come work for us, please send us your resume along with some code samples!</li><li>Give us three (3) days to review and respond. We'll try to respond to everyone who appears to be a good fit.</li><li>A hands-on coding challenge.</li><li>A 60-minute technical conversation about the coding challenge and your resume.</li><li>An in-person interview at our offices.</li><li>A finalized job offer.</li></ol>                    </div>                            <h2>                About Advanced Threat Analytics, Inc.            </h2>            <div><p>Advanced Threat Analytics (ATA) is helping MSSPs (Managed Security Service Providers) and enterprises finally break free of “alert tyranny” – a state when the volume of security alerts grows so out of control – it dictates staffing levels and operational business models. Traditional SIEM (Security Information and Event Management) and incident orchestration solutions try to address the issue by reducing the time it takes to investigate each incident. They do not address the volume issue. ATA takes a different approach – we attack the problem by dramatically slashing the total number of incidents you need to investigate – freeing you from alert overload. This enables you to take a more efficient, effective, and strategic approach to security operations.</p><p><strong>Why Us?</strong></p><ol><li>We are incredibly fast-paced. You must be able to get on board with our pace.</li><li>We turn on a dime - something that sounds like a good idea today, doesn't mean it is - we are fine with that. We like to experiment.</li><li>We are growing at 150% YOY, which means a lot more demands from customers - we like to delight them all!</li><li>Equity and work culture is fantastic! We love what we do and it shows in our work.</li><li>Reasonable work/life balance barring bursts which are exceptions. Exceptions aren't the norm.</li></ol>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Hours, Work from anywhere                            </div>                            <div>                                 401k                            </div>                            <div>                                 Paid Holidays, Vacation, and Sick Time                            </div>                            <div>                                 Competitive Salary                            </div>                            <div>                                 Strong Partnerships                            </div>                            <div>                                 Talented coworkers                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "python"
    ]
  },
  {
    "id": "XSOb_y4ETASPuyB3ZHaIQQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/148395/software-data-engineer-python-flask-hatch-it?a=NLyEMkWVBFC",
    "title": "Software Data Engineer (Python/Flask) at hatch IT (Bethesda, MD)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>IT Recruitment</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Overview:</strong><br>If you are a data minded software engineer and are looking to make an impact in the Healthcare Industry, we have the job for you! Hatch is currently working with Aledade, a Healthcare IT startup based in Bethesda, MD that provides everything a doctor needs to create and run an accountable care organization (ACO) - from business practice transformation services to upfront capital and cutting-edge technology platform. They are currently looking to add multiple Software Engineers to the team, with the opportunity to work remotely, to help enhance their data driven application. You would be working on their core architecture team, working extensively with Python &amp; SQL, to help bring innovation to the healthcare arena. This team is currently compromised of 6 experienced Python engineers&nbsp;<br><br><strong>Company Tech Stack:</strong> Angular/Python/Flask/Postgres/AWS<br>&nbsp;<br><strong>Does this describe you?</strong></p><ul><li>Thrive in the fast-moving, hard-charging environment of an early-stage startup.</li><li>Have&nbsp;2+ years experience with Python &amp; SQL&nbsp;</li><li>Passion and proven track record for creating robust, scalable web applications</li><li>Desire to develop products that positively impact peoples healthcare</li></ul><p><strong>If you are interested in learning more about this company or any Startups/Small Businesses in the area, please contact us!!</strong><br>&nbsp;<br><em>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></p>                    </div>                            <h2>                About hatch IT            </h2>            <div><p>hatch IT is a boutique software development recruiting firm headquartered in the Washington, DC metro area. We’re a company on a mission to help bridge the gap between DC based technology startups, small-businesses and the local software engineering community.&nbsp;</p><p>hatch is a candidate-centric recruiting partner who places an emphasis on ensuring the introduction between every candidate and company is harmonious. We take into account the scope of work, technology stack, culture &amp; career path with every engagement. Long term talent retention is a top priority with startups &amp; small businesses, and our team is proud to have a successful track-record in helping developers find their dream job and small companies identify the talent they need to thrive.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Medical Insurance                            </div>                            <div>                                 Unlimited PTO                            </div>                            <div>                                 Telecommute flexibility                            </div>                            <div>                                 Monthly Happy Hours                            </div>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Annual Company Vacations                            </div>                            <div>                                 Competitive Compensation                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "JXHhRZ58QbaEf_rz2_FE3A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/64234/senior%e2%80%8b-%e2%80%8bpython%e2%80%8b-%e2%80%8bdeveloper%e2%80%8b-at-causalens/",
    "title": "Senior​ ​Python​ ​Developer​",
    "content": "Senior Python Developer - Full Time (Remote)<br /><br />Summary<br /><br />We are looking for a motivated and high-achieving Senior Python Developer based anywhere in<br />Europe to join the team working on an exciting new Big Data/Machine Learning platform. This is<br />a full time placement with significant opportunities for growth and advancement as one of the<br />first employees of the company.<br /><br />The Company<br /><br />causaLens is high-tech startup based in London. We are bringing machine learning and big data<br />technologies to the World’s leading asset managers. We are an extraordinary team and the<br />founders have worked for some of the most prominent global hedge funds and scientific<br />institutions.<br /><br />Core requirements<br /><br />* Smart, capable and can write clean code.<br />* Ability to design and architect high-performance distributed software.<br />* Development experience in at least one scripting language - preferably Python.<br />* Interest in machine learning/big data (prior experience plus).<br />* Knowledge of the Git version control system.<br />* Good organisational skills both in management of time and code.<br />* Ability to effectively work remotely (from home or a coworking space).<br /><br />Roles and Responsibilities<br /><br />Developing a big data platform for quantitative finance. The application stack is Python, Numpy,<br />Scipy, Sklearn, Keras, Django, Celery, Postgres, AWS, GCP.<br /><br />Benefits<br /><br />Successful candidate will have the opportunity to join a fast-growing, agile, and international<br />team passionate about innovation and making a difference. We will offer guidance, mentorship,<br />and opportunities for professional development.",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 5:43:30 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "JeFrKGxHRBaIsJmGWWFe3Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Backend+Engineer&c=Waldo+Photos&l=Remote&jk=19de6b63716b0fd3&rtk=1c168dmmc0m614mo&from=rss",
    "title": "Backend Engineer - Waldo Photos - Remote",
    "content": "<div><b>Backend Engineer</b><br><span>Waldo Photos</span>     -<span>Remote</span>    <div>        <span>                $80,000 - $100,000 a year</span>        </div></div><span>Waldo Photos is a photo-finding platform empowering people to toss their selfie sticks, put their phones back in their pockets, and live in the moment. Waldo is the only platform that removes all of the friction in getting photos of you taken by others and creates new opportunities for photographers to market and sell their photos. Our users can enjoy life’s most precious events and automatically receive images taken of them right on their phones, or share images of others they’ve taken without having to lift a finger – whether between friends and family or a professional photographer.<br>We're looking for an independent problem-solver who values learning, keeps current on technology trends, and enjoys the ownership and accountability that is expected from early-stage team members. The ideal candidate will:<br><ul><li>enjoy coding at all layers, focusing mainly in the backend;</li><li>learn whatever is necessary to get the job done;</li><li>write clean, elegant, simple, testable code;</li><li>be comfortable with git, pull requests, and code reviews;</li><li>take pride in their work; and</li><li>want to work with others who do the same.</li></ul>While we're based in Austin, Texas, we have team members all across the globe. We are open to remote, international, contract employees – but we do need full-time commitment.<br><br><b>Requirements:</b><br>BASE QUALIFICATIONS<br><br><ul><li>You've been actively coding in Python or Java for at least 5 years.</li><li>You have excellent algorithmic and coding skills.</li><li>You feel comfortable in learning and eventually using each of these, as we're developing our services in them: Python, Java, Javascript, Clojure, and Go.</li><li>You know how to efficiently and properly design relational databases with a deep understanding of what affects query performance.</li><li>You know what the conceptual difference is between PostgreSQL, Cassandra or Kafka, and RabbitMQ – which by the way, we use all of these and more!</li><li>&quot;I always write tests for my code&quot; is your middle name.</li><li>You thrive in a small team, high autonomy environment.</li></ul>DESIRED QUALIFICATIONS<br><ul><li>You have a proven track record of building and shipping complex, high-performance, highly-available distributed systems.</li><li>You have an experience with GraphQL and related libraries (i.e. Apollo, Relay).</li><li>You love leading and mentoring a team.</li></ul><b>Benefits:</b><br><ul><li>Ability to work remote from anywhere in the world</li><li>East Austin office that is dog-friendly</li><li>Flexible vacation</li><li>Unlimited high fives (both virtual and in-person)</li></ul>DETAILS<br><ul><li>Type: Full-time</li><li>Location: Austin or remote</li><li>Annual salary: $80,000 - $100,000</li><li>Equity: 0.0% - 0.20%</li></ul></span>",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:17:56 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/other",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java",
      "other",
      "python"
    ]
  },
  {
    "id": "yC08fOFkTEKMFgFz1bpn9A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Backend+Engineer&c=Waldo+Photos&l=Remote&jk=19de6b63716b0fd3&rtk=1c168qlbf0kh20f7&from=rss",
    "title": "Backend Engineer - Waldo Photos - Remote",
    "content": "<div><b>Backend Engineer</b><br><span>Waldo Photos</span>     -<span>Remote</span>    <div>        <span>                $80,000 - $100,000 a year</span>        </div></div><span>Waldo Photos is a photo-finding platform empowering people to toss their selfie sticks, put their phones back in their pockets, and live in the moment. Waldo is the only platform that removes all of the friction in getting photos of you taken by others and creates new opportunities for photographers to market and sell their photos. Our users can enjoy life’s most precious events and automatically receive images taken of them right on their phones, or share images of others they’ve taken without having to lift a finger – whether between friends and family or a professional photographer.<br>We're looking for an independent problem-solver who values learning, keeps current on technology trends, and enjoys the ownership and accountability that is expected from early-stage team members. The ideal candidate will:<br><ul><li>enjoy coding at all layers, focusing mainly in the backend;</li><li>learn whatever is necessary to get the job done;</li><li>write clean, elegant, simple, testable code;</li><li>be comfortable with git, pull requests, and code reviews;</li><li>take pride in their work; and</li><li>want to work with others who do the same.</li></ul>While we're based in Austin, Texas, we have team members all across the globe. We are open to remote, international, contract employees – but we do need full-time commitment.<br><br><b>Requirements:</b><br>BASE QUALIFICATIONS<br><br><ul><li>You've been actively coding in Python or Java for at least 5 years.</li><li>You have excellent algorithmic and coding skills.</li><li>You feel comfortable in learning and eventually using each of these, as we're developing our services in them: Python, Java, Javascript, Clojure, and Go.</li><li>You know how to efficiently and properly design relational databases with a deep understanding of what affects query performance.</li><li>You know what the conceptual difference is between PostgreSQL, Cassandra or Kafka, and RabbitMQ – which by the way, we use all of these and more!</li><li>&quot;I always write tests for my code&quot; is your middle name.</li><li>You thrive in a small team, high autonomy environment.</li></ul>DESIRED QUALIFICATIONS<br><ul><li>You have a proven track record of building and shipping complex, high-performance, highly-available distributed systems.</li><li>You have an experience with GraphQL and related libraries (i.e. Apollo, Relay).</li><li>You love leading and mentoring a team.</li></ul><b>Benefits:</b><br><ul><li>Ability to work remote from anywhere in the world</li><li>East Austin office that is dog-friendly</li><li>Flexible vacation</li><li>Unlimited high fives (both virtual and in-person)</li></ul>DETAILS<br><ul><li>Type: Full-time</li><li>Location: Austin or remote</li><li>Annual salary: $80,000 - $100,000</li><li>Equity: 0.0% - 0.20%</li></ul></span>",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:17:56 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/other",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java",
      "other",
      "python"
    ]
  },
  {
    "id": "O8hhOKuGROWvPN3r4pFejQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/fulfil-io/jobs/81197-full-stack-developer",
    "title": "Full Stack developer",
    "content": "<div><h2>Full Stack developer at Fulfil.IO</h2><div>Bengaluru, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Python, Android, iOS Development, Ecommerce, Front-End Development, Git, PostgreSQL, Full Stack Development, Angular.JS, Remote Team Management</div><div>Compensation</div><div>₹400K–₹600K<br>0.1%–1.0%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>We're an early stage product startup  –  and looking for passionate full stack developers. The job is a full-time position based out of Bangalore, but remote work is an option.</p><p>Our Tech Stack :</p><p>* Servers &amp; Microservices: Python, Javascript<br>* Infrastructure: Amazon AWS, Docker<br>* Database: Amazon RDS, DynamoDB, Redshift<br>* Frontend: Angular JS, Angular Material<br>* Mobile: Ionic</p><p>What we expect in you:</p><p>* Familiarity with Python and ORMs (SQLAchemy, Django and cousins)<br>* Understanding of Relational Databases (We love postgres)<br>* Experience with at least one Python web framework (Flask is cool).<br>* Ability to visualize a request-response cycle whether it happens from a desktop app, browser, mobile app or over a web socket.<br>* 0 – 2 years of software development experience (professional, freelance or hobbyist). Github profiles matter.<br>* Self motivated. Sorry no managers here.<br>* Excellent communication skills. We slack a lot!<br>* Understanding of tests and appreciates Test Driven Development (TDD).</p><p>What you will do:</p><p>* Develop across the stack.<br>* Integration of user-facing elements developed by front-end developers with server side logic.<br>* Integration with other systems (shipping, warehouses) over API.</p><p>Rarely required:</p><p>* Ability to work flexible hours when necessary for deadlines and off-hours installations<br>* Occasional availability for on-call/emergency support.</p><p>Some of the benefits:</p><p>* Solve a real world problem - inventory management and shipping products on time is hard. (No offense to our friends making yet another way to post a picture online).<br>* Work with an international team<br>* Remote work<br>* Small team with opportunity to have great impact<br>* Equity as an option</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 2:19:39 AM",
    "tags": [
      "Android",
      "Angular.JS",
      "Bengaluru",
      "Ecommerce",
      "Front-End Development",
      "Full Stack Development",
      "Full Time",
      "Full-Stack Developer",
      "Git",
      "PostgreSQL",
      "Python",
      "REMOTE1/100",
      "Remote OK",
      "Remote Team Management",
      "TECH1/frontend",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown",
      "iOS Development"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "python"
    ]
  },
  {
    "id": "EILM53WxQxafly_GAe4QSQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/close-io/jobs/79548-senior-software-engineer-backend",
    "title": "Senior Software Engineer - Backend",
    "content": "<div><h2>Senior Software Engineer - Backend at Close.io</h2><div>San Francisco, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Python, MySQL, MongoDB, Redis, PostgreSQL, Gunicorn, Flask, Docker, ElasticSearch, Kubernetes</div><div>Compensation</div><div>$80K–$160K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ABOUT US<br>At Close.io we’re building the sales communication platform of the future. We’ve built a next-generation CRM that eliminates manual data entry and helps sales teams close more deals. We are hiring engineers to help us unify the world's sales calls and emails into one beautiful workflow. We are a ~25 person remote team that is profitable and building a product our customers love.</p><p>Our backend tech stack currently includes Python (Flask, Gunicorn, TaskTiger), Elasticsearch, MongoDB, Postgres, and Redis running in Docker/Kubernetes on AWS. Our backend primarily serves a well-documented public API that our front-end JavaScript app consumes.</p><p>We ❤ open source – using dozens of open source projects with contributions to many of them, and released some of our own: <a href='https://github.com/closeio' rel='nofollow'>https://github.com/closeio</a></p><p>ABOUT YOU<br>We're looking for an experienced full-time developer to join our core team who has a strong understanding of web technologies and want to help design, implement, launch, and scale major systems and user-facing features.</p><p>Come help us with projects like...</p><p>- Helping conceive, design, spec, build, and launch new user-facing features<br>- Improving the performance and scalability our API<br>- Improving how we sync millions of sales emails each month via IMAP<br>- Working with Twilio's API, Websockets, and WebRTC to improve our calling features.<br>- Creating actionable insights for salespeople based on their sales activity data<br>- Building a scalable webhooks system to deliver real-time events to Zapier and other API integrations<br>- Improving our Elasticsearch-backed powerful search features</p><p>You should...</p><p>- Have 5+ years experience building modern back-end systems using Python, Redis, Elasticsearch, Postgres, and MongoDB or similar databases<br>- Have significant experience designing, scaling, debugging, and optimizing systems to make them fast and reliable.<br>- Care a lot about code quality and maintainability.<br>- Be comfortable in a fast-paced environment with a small and talented team; able to take larger projects and run with them mostly on your own<br>- Be able to work well in a remote / distributed team environment, manage your time well, and have strong verbal and written English communication skills</p><p>Bonus points if you...</p><p>- Have contributed open source code related to our tech stack<br>- Have production experience using Docker or Kubernetes<br>- Have experience with sales or sales tools<br>- Have experience building B2B SaaS products</p><p>Why work with us?</p><p>- Work remotely from anywhere in the world! Just be willing to do a bit of traveling twice a year for some face-to-face time with the whole team.<br>- For personal growth: help build a truly successful SaaS company with a stellar team where you can have a huge impact.<br>- Above market salary, healthcare, dental, and retirement benefits package.<br>- Fun company culture that embraces a healthy work/life balance.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 10:22:57 PM",
    "tags": [
      "Backend Developer",
      "Docker",
      "ElasticSearch",
      "Flask",
      "Full Time",
      "Gunicorn",
      "Kubernetes",
      "MongoDB",
      "MySQL",
      "PostgreSQL",
      "Python",
      "REMOTE1/100",
      "Redis",
      "Remote OK",
      "San Francisco",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  }
]
}
