{
 "items": [
  {
    "id": "FwwBjyGzSiWhXHi_cAgycQ",
    "url": "https://landing.jobs/at/adevinta/senior-ios-engineer-productivity-team?utm_campaign=landing+rss&utm_content=Senior+iOS+Engineer+%28Productivity+Team%29&utm_medium=referral&utm_source=rss",
    "title": "Senior iOS Engineer (Productivity Team)",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:bash/other/2",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:ios/apple/14",
      "DBG_TECH1:k/t/w:ios/mobile/14",
      "DBG_TECH1:k/t/w:mapreduce/bigdata-ml/5",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=4, other=2, dotnet=0, c=0, mobile=14, go=3, nodejs=1, bigdata-ml=5, ruby=4, apple=14, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Adevinta",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 8, 2019 10:45:13 AM",
    "validThrough": "Oct 15, 2019 10:45:13 AM",
    "crawled": "Oct 21, 2019 10:34:06 PM",
    "content": "<div><h3>Senior iOS Engineer (Productivity Team)</h3></div><div>Company: Adevinta</div><div>Location: </div><div>Requires Work Permit</div>Level: Senior<br>Language: English <div>Mobile Apps Developer<br>Skills:</div><li>Bash </li><li>Git </li><li>iOS </li><li>Python </li><li>Ruby </li><h3>Intro</h3><p></p><p>We are a global digital player, the biggest marketplace specialist in Europe. But we are still a family of local brands – because we believe all great marketplaces are local. Our marketplaces serve people where they live, acknowledging what’s special about every culture and every place, helping local economies to grow sustainably.</p><p><span><span></span></span></p><p></p><p>Our systems are global-scale deployments of different services such as developer productivity tools, image and message processing systems, active and passive security scanning, big data and mapreduce clusters, messaging brokers, database and NoSQL Back-ends and many more. We specifically have to support hundreds of services and hundreds of instances for our millions of consumers, using service discovery systems, auto-scaling, dynamic load balancing and routing.<br><br>Scientists and engineers in our teams work to make hundreds of millions of user behaviour events from all around the world understandable for analysts and business users in the company, daily. This large data set is also one of the most diverse data sets in the world and we work with the latest data technologies (Spark, AWS services, Kafka). Tens of thousands of tasks are run every day to handle data processing jobs at this scale.</p><p>As a&nbsp;<strong>Senior iOS Engineer</strong>&nbsp; you will:&nbsp;</p><ul><ul><li>Be responsible for Adevinta’s global iOS CI/CD tooling and services, identifying gaps and developing improvements to its components as necessary</li><li>Represent the interests of the mobile community in front of Platform Services owners and teams. Acting as a stakeholder for mobile inside Platform Services and making sure its portfolio aligns to the interests of the mobile community across Adevinta</li><li>Promote Platform Services tools within Adevinta marketplaces helping them understand and leverage our global tool offering</li><li>Have a strong awareness and involvement in the mobile development community in Adevinta. Expected to reach out to mobile teams and engineers to understand their point of view, environment and needs and seeking opportunities for promotion of local tools into the Platform Services offering</li><li>Seek opportunities to temporarily join any marketplace team when this would help to directly address mobile development needs/issues</li><li>Be responsible for the long term development of technologies within the mobile domain</li></ul></ul><p></p><h4>Main requirements</h4><ul><li>Experience in iOS development and build pipeline</li><li>Good knowledge of Python, Ruby or bash scripting</li><li>Strong troubleshooting and problem-solving skills</li><li>Proactive attitude to help and support developers across the company</li><li>Strong understanding of iOS development workflows, CI, CD and modern development tools like Git, Travis, Fastlane</li><li>Good level of English (working language)</li><li>Comfortable working with multiple stakeholders and distributed teams</li></ul><p></p><h4>Perks</h4><p></p><ul><li>Choose your Kit (Computer &amp; Phone) ,,</li><li>Flexible work schedule &amp; ability to WFH a couple of days a week&nbsp;</li><li>Private Medical Insurance (including in-office Doctor)</li><li>Gym Membership (70% discount) &amp; Physiotherapist in-office (50% discount)</li><li>Travel Insurance</li><li>Flex Benefits (Ticket Restaurant, Transport Ticket etc.)</li><li>Company &amp; Personal Performance Bonus</li><li>Social activities (meetups, talks hosted in the office &amp; parties)&nbsp;</li><li>Free breakfast, fresh fruit &amp; coffee &amp; canteen in the office</li><li>Able to go to conferences &amp; courses&nbsp;</li><li>Free Language Lessons</li><li>Adjustable desks, chairs &amp; various work spaces</li></ul><p></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "fAjMq1RyRfiC2sPJALiEWw",
    "url": "https://remoteok.io/jobs/75696",
    "title": "Senior Backend Engineer",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:macos/apple/2",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/go",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "apple",
      "go",
      "python"
    ],
    "hiringOrganization": {
      "name": "CB Insights",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 135000,
      "maxValue": 165000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 135k - 165k /Year"
    },
    "employmentType": "UNSET",
    "published": "Oct 17, 2019 1:55:29 AM",
    "validThrough": "Oct 24, 2019 1:55:29 AM",
    "crawled": "Oct 21, 2019 10:30:37 PM",
    "content": "<span></span> <span><h4>CB Insights</h4></span> <br> <h3>Senior Backend Engineer</h3> <span></span> <span>verified</span> <br> <span>United Sates</span> <div>  <div>   Want to build a product that uses data to see and make sense of the future?\\n\\nIf you are a coding fanatic and passionate about building awesome products, we want you to help us make a huge impact. Our clients love our products and are thirsty for more!\\n\\nAt CB Insights we build products that help clients make sense of the future and drive their businesses forward using data. Our system retrieves large amounts of structured and unstructured data sets and uses scientific methods to extract knowledge and insights. We present those analytics through a sophisticated, dynamic user interface which enables our clients to find answers to their most important questions.\\n\\nAs a Senior Backend Engineer at CB Insights you will be part of a cross-disciplinary, self-motivated team with clear ownership and passion to form the future. Our team uses state-of-the-art technologies and writes quality code that ships often.\\n\\nOur backend software engineers work across the stack, building beautiful user interfaces, robust services and scalable data processing jobs.\\n\\nWe focus on modularity and reuse where it makes sense, while ensuring that there are no constraints to delivering world-class software continuously.\\n\\nYou will be part of a remote-first team where every team member works remotely from anywhere in the USA. Strong communication skills, adaptability and a collaborative mindset are key attributes we are looking for in all candidates.\\n\\nMuch of our software team has been with us for several years, despite a white-hot tech market with options galore. We attribute this to our collaborative, “teach and learn” culture where the role evolves with your interests.\\n\\nIf this sounds interesting to you, reach out and join CB Insights now!\\n\\n\\n\\n\\n\\n# Responsibilities\\n Key Responsibilities:\\n* Develop features for our next generation market intelligence platform on a small Agile team.\\n* Consistently and frequently deliver solutions that are well-engineered, maintainable and tested within the agreed upon timeframe.\\n* Participate in code reviews and sprint planning, help identify opportunities, work through challenges and share knowledge with colleagues.\\n* Collaborate with the product team to understand business requirements. \\n\\n# Requirements\\nRequirements and Qualifications:\\n* BS in Computer Science or similar; advanced degrees also acceptable\\n* 5+ years professional experience in Go or Python\\n* Relational database proficiency (e.g. MySQL, Aurora, PostgreSQL)\\n* Professional experience building API’s and Microservices \\n* Professional experience working remote or telecommuting \\n* Proficiency developing in a Mac/Linux environment\\n* Believer in Lean and Agile values and principles for building software\\n* Excellent written and verbal communication skills\\n* Excellent problem solving and analytical skills\\n* Helpful, Humble Human\\n* Love for experimentation\\n\\nPerks and Benefits:\\n* Subsidized health, dental and vision insurance\\n* 401K with up to 4% match\\n* $1,000 yearly continuing education stipend\\n \\n\\n#Salary\\n$135,000-$165,000\\n \\n\\n#Location\\n- United Sates   <br>  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "7g8wy0yMRZeJNAdXb0pgPQ",
    "url": "https://remoteok.io/jobs/75499",
    "title": "iOS Developer",
    "tags": [
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:ios/apple/20",
      "DBG_TECH1:k/t/w:ios/mobile/20",
      "DBG_TECH1:k/t/w:objective-c/apple/3",
      "DBG_TECH1:k/t/w:objective-c/c/2",
      "DBG_TECH1:k/t/w:objective-c/mobile/8",
      "DBG_TECH1:k/t/w:swift/apple/5",
      "DBG_TECH1:k/t/w:swift/mobile/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=2, mobile=38, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=28, java=1, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "komoot ",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 7, 2019 7:02:55 PM",
    "validThrough": "Oct 14, 2019 7:02:55 PM",
    "crawled": "Oct 21, 2019 10:30:37 PM",
    "content": "<span></span> <span><h4>komoot</h4>&nbsp;</span> <br> <h3>iOS Developer</h3> <span></span> <span>verified</span> <br> <span>UTC-1 to UTC+3</span> <div>  <div>   **Millions of people experience real-life adventures with our apps. We help users all over the world discover the best hiking and biking routes, and we empower everybody to explore more of the great outdoors. And we’re good at it: Apple even included our iOS app in its Editors’ Choice collection and named us as one of their Apps of the Year.&nbsp;**\\n\\nIf you’d like to help to build the future of outdoor exploration, we’re looking for a passionate iOS Developer to join our team. This is a remote role and can be done from any location between UTC-1 and UTC+3.\\n\\n**Why you will love it**\\n* You’ll tangibly enable millions of people to have awesome outdoor experiences with your app\\n* At komoot, you’ll use everything the iOS platform offers, from the latest APIs to the newest features and devices\\n* We let you work from wherever you want, be it a beach, the mountains, our headquarters in Potsdam or anywhere else that lies in any time zone between UTC-1 and UTC+3.\\n* You’ll work on challenging tasks, such as turn-by-turn navigation, maps, on-/offline hybrids, custom views and data synchronization\\n* You’ll be developing in fast cycles with continuous build, testing and direct team feedback\\n* Your expert knowledge will make you a key player amongst a team of highly motivated, talented people\\n* You’ll travel together with our team to amazing outdoor places several times a year to exchange ideas, learnings and go for hikes and rides\\n* You’ll build and improve an app that we’re pretty sure you’ll end up using for your personal outdoor trips \\n\\n\\n\\n# Responsibilities\\n **What you will do**\\n* Take over responsibility of all parts of the iOS app\\n* Develop innovative new features in collaboration with our team of designers, copywriters, and Android/iOS product experts\\n* Optimize the core functionality of the app\\n* Incorporate the latest advances in iOS technology\\n \\n\\n# Requirements\\n**You will be successful in this position if you**\\n* Are highly self-driven, responsible and keen to improve\\n* Have proven experience in developing high quality iOS apps (3+ years)\\n* Write the latest Swift code and you know how to mix it with existing Objective-C code\\n* Have a deep understanding about iOS, its frameworks and APIs\\n* Have a passion for building software, demonstrated through interesting side projects, open source contributions or other involvement in the tech community\\n* Love to develop awesome products for a great user experience\\n* Have experience in working in a distributed team, have good communication skills and love to work together with others in fast development cycles\\n \\n\\n#Location\\n- UTC-1 to UTC+3   <br>  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "EltJ4m8GTfSi9Dahiq8cWQ",
    "url": "https://remoteok.io/jobs/75367",
    "title": "Senior Software Engineer",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:ios/apple/8",
      "DBG_TECH1:k/t/w:ios/mobile/8",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:macos/apple/2",
      "DBG_TECH1:k/t/w:objective-c/apple/3",
      "DBG_TECH1:k/t/w:objective-c/c/2",
      "DBG_TECH1:k/t/w:objective-c/mobile/8",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:swift/apple/5",
      "DBG_TECH1:k/t/w:swift/mobile/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=2, mobile=24, go=0, nodejs=0, bigdata-ml=0, ruby=10, apple=18, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Impero Software",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 27, 2019 8:13:09 PM",
    "validThrough": "Oct 4, 2019 8:13:09 PM",
    "crawled": "Oct 21, 2019 10:30:37 PM",
    "content": "<span></span> <span><h4> Impero Software </h4></span> <br> <h3>Senior Software Engineer</h3> <div>  <div>   At Impero, we've been in Education Technology since 2002, building systems to keep children and young people safe and make them successful. We are passionate about protecting every learner, their wellbeing and their future through managing, supporting and monitoring. We do this by working closely with educators around the world. With recent new leadership, we're building a distributed UK-based engineering team to reimagine our technology platform. \\n\\nWe are first and foremost looking for best of breed developers who are positive and ambitious and who can demonstrate strong engineering principles. Whether you’ve been developing for two years or ten we may have a role for you. Our product vision is exciting and the roadmap ahead is challenging. Our team is growing in a way that will allow you to play to your strengths: whether enjoying data modelling and analysis, or building huge new feature sets. \\n\\nWe believe in creating careers, not jobs. During your time with us you’ll receive regular, honest, helpful feedback, with a clear progression path. We’ll be looking for ways to grow your expertise, and we will provide opportunities for your professional development. We’re a distributed team, who put energy into speaking every day, and we arrange regular meetings both by department and as a company. In the first few months as you get to know the team and products, we'll bring you into our Nottingham office as needed, but our team is distributed-first: doing your best work isn't dependent on you being in a certain place. Our web platform - less than two years old - is built exclusively in Ruby on Rails with interlinking native device clients, communicating through standard web protocols. At Impero, we believe we're creating something special, and we'd love for you to join us.\\n\\n\\nSenior Software Engineer (iOS)\\n\\nRole\\n\\nThe successful candidate will take responsibility for working as a software engineer within an agile team to develop the company’s iOS device client applications.\\n\\nResponsibilities \\nOperational\\n* Work within a cross-functional software team (consisting of Software Engineers, Cloud Infrastructure Engineers and testers) to develop device clients for iOS devices.\\n* Take responsibility for the quality and speed of your own deliverables.\\n* Perform automated and manual testing on your own work.\\n* Assist other members of the engineering team where required.\\n\\nCharacteristics\\nEssential\\n* Experience of working in a distributed workforce in an agile development team.\\n* At least 3 years of commercial experience (or equivalent) in Objective-C and/or Swift development.\\n* Experience in developing for macOS or iOS, with knowledge of platform APIs.\\n* At least 3 years of experience in writing automated tests.\\n* Experience of integrating device applications with web applications.\\n* Understanding of programming, networking and information security principles.\\n* Enthusiasm for understanding technical ideas and explaining them clearly to other members of the team.\\n* A strong standard of spoken and written English.\\n\\nDesirable\\n* Experience of working with provisioning profiles and MDM services.  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ME1otB13T1GiIzXYccwZJw",
    "url": "https://jobs.github.com/positions/f9205737-2ce2-4acf-a469-87640d5941da",
    "title": "Senior Software Engineer (iOS)",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:ios/apple/10",
      "DBG_TECH1:k/t/w:ios/mobile/10",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:macos/apple/2",
      "DBG_TECH1:k/t/w:objective-c/apple/3",
      "DBG_TECH1:k/t/w:objective-c/c/2",
      "DBG_TECH1:k/t/w:objective-c/mobile/8",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:swift/apple/5",
      "DBG_TECH1:k/t/w:swift/mobile/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=2, mobile=26, go=0, nodejs=0, bigdata-ml=0, ruby=10, apple=20, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 27, 2019 2:12:25 PM",
    "validThrough": "Oct 4, 2019 2:12:25 PM",
    "crawled": "Oct 21, 2019 10:30:34 PM",
    "content": "At Impero, we've been in Education Technology since 2002, building systems to keep children and young people safe and make them successful. We are passionate about protecting every learner, their wellbeing and their future through managing, supporting and monitoring. We do this by working closely with educators around the world. With recent new leadership, we're building a distributed UK-based engineering team to reimagine our technology platform. We are first and foremost looking for best of breed developers who are positive and ambitious and who can demonstrate strong engineering principles. Whether you’ve been developing for two years or ten we may have a role for you. Our product vision is exciting and the roadmap ahead is challenging. Our team is growing in a way that will allow you to play to your strengths: whether enjoying data modelling and analysis, or building huge new feature sets. We believe in creating careers, not jobs. During your time with us you’ll receive regular, honest, helpful feedback, with a clear progression path. We’ll be looking for ways to grow your expertise, and we will provide opportunities for your professional development. We’re a distributed team, who put energy into speaking every day, and we arrange regular meetings both by department and as a company. In the first few months as you get to know the team and products, we'll bring you into our Nottingham office as needed, but our team is distributed-first: doing your best work isn't dependent on you being in a certain place. Our web platform - less than two years old - is built exclusively in Ruby on Rails with interlinking native device clients, communicating through standard web protocols. At Impero, we believe we're creating something special, and we'd love for you to join us.Senior Software Engineer (iOS)RoleThe successful candidate will take responsibility for working as a software engineer within an agile team to develop the company’s iOS device client applications.Responsibilities Operational* Work within a cross-functional software team (consisting of Software Engineers, Cloud Infrastructure Engineers and testers) to develop device clients for iOS devices.* Take responsibility for the quality and speed of your own deliverables.* Perform automated and manual testing on your own work.* Assist other members of the engineering team where required.CharacteristicsEssential* Experience of working in a distributed workforce in an agile development team.* At least 3 years of commercial experience (or equivalent) in Objective-C and/or Swift development.* Experience in developing for macOS or iOS, with knowledge of platform APIs.* At least 3 years of experience in writing automated tests.* Experience of integrating device applications with web applications.* Understanding of programming, networking and information security principles.* Enthusiasm for understanding technical ideas and explaining them clearly to other members of the team.* A strong standard of spoken and written English.Desirable* Experience of working with provisioning profiles and MDM services.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "NAtP3rU7RMK5dnPnTUavMw",
    "url": "https://berlinstartupjobs.com/engineering/senior-ios-engineer-idagio/",
    "title": "Senior iOS Engineer // Idagio",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:ios/apple/12",
      "DBG_TECH1:k/t/w:ios/mobile/12",
      "DBG_TECH1:k/t/w:swift/apple/15",
      "DBG_TECH1:k/t/w:swift/mobile/24",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=36, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=27, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Idagio",
      "sameAs": "http://www.idagio.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2019 10:57:05 AM",
    "validThrough": "Sep 18, 2019 10:57:05 AM",
    "crawled": "Sep 11, 2019 11:07:30 AM",
    "content": "<h3>Senior iOS Engineer // Idagio</h3><div> Company:  Idagio <br> <br></div><div> Tags:</div><li>streaming</li><li>Development</li><li>Engineering</li><li>music streaming</li><li>iOS development</li><li>Swift</li><li>subscription-based</li><div>  <p>We are looking for an experienced iOS developer to join our marvelous Mobile team: a group of people with a shared interest in great user experience, robust software, fast delivery, and clear communication.</p>  <p>Help us build our native iOS app, giving our listeners easy access to the most comprehensive catalogue of classical music in streaming. As part of a cross-functional team, you will be actively involved in all stages of the development process, collaborating closely with designers, product managers, and other teams.</p>  <p>Come build the best classical music streaming service with us!</p>  <p><strong>Your Role &amp; Responsibilities</strong></p>  <ul>   <li>Develop new features</li>   <li>Enhance and maintain our existing Swift codebase</li>   <li>Ensure great quality and user experience</li>   <li>Be part of a cross-functional team consisting of product managers, designers, and engineers</li>   <li>Take part in all stages of the development process</li>   <li>Mentor other developers</li>  </ul>  <p><strong>Relevant experience and personality traits</strong></p>  <ul>   <li>Pragmatism and a solution-oriented attitude</li>   <li>Clarity, openness, and enthusiasm in communication with colleagues across domains</li>   <li>Familiarity with Swift and the iOS ecosystem</li>   <li>Solid knowledge of software architecture and object-oriented design</li>   <li>Ability to handle large projects end-to-end</li>   <li>Experience with Automated Testing and Continuous Integration</li>   <li>Passion for clean code and maintainability</li>   <li>Experience using Interface Builder and Autolayout</li>   <li>Fluency in English</li>  </ul>  <p><strong>Nice to have</strong></p>  <ul>   <li>Multiple apps available in the AppStore</li>   <li>Leadership experience</li>   <li>Open Source Software contributions</li>   <li>A background in classical music</li>  </ul>  <p><strong>What we have to offer</strong></p>  <ul>   <li>International team with diverse backgrounds and extensive experience in both classical music and digital products.</li>   <li>A friendly and purpose-driven working atmosphere in our office in Berlin Kreuzberg.</li>   <li>Directly contribute to the success of our evolving product.</li>   <li>Flexible working hours, occasional remote work and your choice of hardware and tools.</li>   <li>Competitive salary and collaborative environment.</li>   <li>We value long-lasting relationships – we provide a yearly education budget to make sure you develop and grow within your role.</li>  </ul> </div><span>Apply for this position</span>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "7QVeSoneRr6UaHLbludbBw",
    "url": "https://stackoverflow.com/jobs/284500/ios-developer-experience-engineer-sdks-auth0?a=1xpzyEKlcfDy&so_medium=Talent&so_source=TalentApi",
    "title": "iOS Developer Experience Engineer, SDKs at Auth0  ",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:android-studio/mobile/5",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:ios/apple/22",
      "DBG_TECH1:k/t/w:ios/mobile/22",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:objective-c/apple/3",
      "DBG_TECH1:k/t/w:objective-c/c/2",
      "DBG_TECH1:k/t/w:objective-c/mobile/8",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:swift/apple/10",
      "DBG_TECH1:k/t/w:swift/mobile/16",
      "DBG_TECH1:k/t/w:xcode/apple/8",
      "DBG_TECH1:k/t/w:xcode/mobile/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=2, mobile=61, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=43, java=1, gamedev=0, php=0, embedded=0, frontend=10}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Auth0",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 9, 2019 9:30:24 PM",
    "validThrough": "Sep 16, 2019 9:30:24 PM",
    "crawled": "Sep 9, 2019 9:30:24 PM",
    "content": "<h3><span>iOS Developer Experience Engineer, SDKs</span>                </h3>                    <h4>About this job</h4>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Mobile Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Information Technology, IT Security, Software Development / Engineering</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>201–500 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>VC Funded</span>                                    </div>                            </div>                    </div>                <div>Company: Auth0 | No office location<br></div>                    <h4>Remote details</h4>                    <div>                        <div>                                                            <div>                                    <span>Preferred Timezone:</span>                                    <span>(GMT-02:00) Sao Paulo +/- 2 hours</span>                                </div>                                                                                                            </div>                    </div>                <h4>Technologies</h4><div></div><div>ios</div><div>objective-c</div><div>swift</div><div>react-native</div><div>javascript</div>                <h4>Job description</h4>                <div><p>Auth0’s mission is to help developers innovate faster. Every company is becoming a software company and developers are at the center of this shift. They need better tools and building blocks so they can stay focused on innovating. One of these building blocks is identity: authentication and authorization. That’s what we do. Our platform handles 2.5B logins per month for thousands of customers around the world. From indie makers to Fortune 500 companies, we can handle any use case. We like to think that we are helping make the internet safer. We have raised $210M to date and are growing quickly. Our team is spread across more than 35 countries and we are proud to continually be recognized as a great place to work.&nbsp;<a href='https://auth0.com/blog/our-culture-and-values-at-auth0/' rel='nofollow'>Culture</a>&nbsp;is critical to us, and we are transparent about our&nbsp;<a href='https://auth0.com/blog/the-developer-first-identity-platform-auth0-story-and-future' rel='nofollow'>vision and principles</a>. Join us on this journey to make developers more productive while making the internet safer! Auth0 is looking for an experienced iOS engineer across the following technologies: - iOS (Swift) - React Native (Familiarity with native build tools, Xcode &amp; Android Studio) - Javascript You GET developers! You know what they need, how to talk to them, how to make their lives easier, what makes them click, their dissatisfiers and their delighters. You recognize when a framework, library or product provides a great experience. As an iOS Engineer, you will use those superpowers to improve our entire onboarding process, SDKs, Quickstarts, Docs, and provide direct assistance to developers in our support channels. You will be the internal and external steward of the experience for the technologies that you love working with every day. Each Engineer shepherds one or multiple platforms forward, both internally within Auth0, and externally in the community. You will be working in a cross-functional team alongside the developer evangelist, onboarding, growth, dashboard, community, and SDK teams to provide the best developer experience for the technologies you own. The most important qualifications for this position are software engineering expertise, empathy, and self-direction.</p><p><strong>You will be </strong></p><ul><ul><li>Writing, curating, editing developer resources: tutorials, examples, guides, and documentation.</li><li>Directly shaping and developing our open source SDKs.</li><li>Owning the code samples and implementation guidance for Auth0.</li><li>Championing Auth0 by engaging directly with the community.</li><li>Gathering and channel user feedback within the company to improve the experience for developers on Auth0.</li><li>The go-to-expert in the company, internally and externally, providing domain knowledge and reviews for Auth0 in these technologies.</li><li>Sharing your technical expertise at conferences and other tech events.</li><li>Developing our&nbsp;<a href='https://github.com/auth0?utf8=%E2%9C%93&amp;q=&amp;type=&amp;language=swift' rel='nofollow'>iOS Libraries</a>&nbsp;that allow users to integrate seamlessly with Auth0.</li><li>Working on our&nbsp;<a href='https://auth0.com/docs/quickstarts' rel='nofollow'>Quickstarts</a>&nbsp;guides to delight our developers.</li><li>Troubleshooting and fixing issues with our libraries.</li></ul></ul><p><strong>You'd be a great fit if you ❤️</strong></p><ul><ul><li>Have developed iOS Libraries or SDKs to be consumed by other developers.</li><li>Have a good understanding of the iOS Frameworks.</li><li>Have created iOS applications that have seen the light of day.</li><li>Have Hybrid library development experience.</li><li>You are able to work in a team environment, have good communication skills and understand the value of collaboration.</li><li>A deep understanding of writing, running, maintaining and debugging applications.</li><li>The ability to communicate effectively in person and in writing as a presenter, documenter.</li><li>Excellent written and verbal communication skills: presenting, documenting, troubleshooting.</li><li>Demonstrable experience authoring developer documentation (tutorials, blog posts, docs).</li><li>The ability to be self-directed and be effective working independently, yet feel equally comfortable contributing in a global team environment.</li></ul></ul><p><strong>Bonus points if you have </strong></p><ul><ul><li>Experience working in distributed teams and work environments.</li><li>Created open-source material or have contributed to open-source projects.</li><li>Your own technical blog or published articles on popular iOS sites.</li><li>Knowledge in the identity and access management space.</li></ul></ul><p><strong>Preferred Locations:</strong></p><ul><ul><li>(GMT-4); (GMT-3); (GMT-2); (GMT-1); (GMT); (GMT+1)</li></ul></ul><p>Auth0 is an Equal Employment Opportunity employer. Auth0 conducts all employment-related activities without regard to race, religion, color, national origin, age, sex, marital status, sexual orientation, disability, citizenship status, genetics, or status as a Vietnam-era special disabled and other covered veteran status, or any other characteristic protected by law.</p>                </div>            <div>        <a href='https://jobs.lever.co/auth0/8878c2f6-0928-4cad-8032-718caef43c10?lever-origin=applied&amp;lever-source%5B%5D=StackOverflow' rel='nofollow'>                        Apply now        </a></div>            <h4>About Auth0</h4>            <div><p>Auth0, a global leader in Identity-as-a-Service (IDaaS), provides thousands of enterprise customers with a Universal Identity Platform for their web, mobile, IoT, and internal applications. Its extensible platform seamlessly authenticates and secures more than 1.5B logins per month, making it loved by developers and trusted by global enterprises. Auth0 has raised more than $110 million to date and continues its global growth at a rapid pace. We are consistently recognized as a great place to work based our outstanding leadership and dedication to company culture, and are looking for the best people to join our incredible team spread across more than 35 countries!</p><p>We are an equal opportunity employer and value diversity at our company. We are transparent about how we run our recruiting process - you can read all about it <a href='https://auth0.com/blog/how-we-hire-engineers/' rel='nofollow'>here</a>. You can also read about our company culture <a href='https://auth0.com/blog/our-culture-and-values-at-auth0/' rel='nofollow'>here</a>.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Flexible Work Arrangements</span>                            </li>                            <li>                                <span></span>                                <span>Competitive Equity</span>                            </li>                            <li>                                <span></span>                                <span>Top-of-the-Line Macbooks and other great tools</span>                            </li>                            <li>                                <span></span>                                <span>Embrace Distributed Work</span>                            </li>                            <li>                                <span></span>                                <span>Inclusive Work Environment</span>                            </li>                            <li>                                <span></span>                                <span>Annual all-expenses paid international company offsite</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "S_ln0N-YTP6r6N635_Y_WQ",
    "url": "https://stackoverflow.com/jobs/289796/lead-application-engineer-swiftui-combine-livesurface?a=1zbGWo96qdKU&so_medium=Talent&so_source=TalentApi",
    "title": "Lead Application Engineer - SwiftUI, Combine, Architecture, Data Model at LiveSurface  ",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:ios/apple/4",
      "DBG_TECH1:k/t/w:ios/mobile/4",
      "DBG_TECH1:k/t/w:macos/apple/4",
      "DBG_TECH1:k/t/w:objective-c/apple/6",
      "DBG_TECH1:k/t/w:objective-c/c/4",
      "DBG_TECH1:k/t/w:objective-c/mobile/16",
      "DBG_TECH1:k/t/w:swift/apple/15",
      "DBG_TECH1:k/t/w:swift/mobile/24",
      "DBG_TECH1:k/t/w:xcode/apple/8",
      "DBG_TECH1:k/t/w:xcode/mobile/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=17, mobile=52, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=37, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "LiveSurface",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 9, 2019 9:30:24 PM",
    "validThrough": "Sep 16, 2019 9:30:24 PM",
    "crawled": "Sep 9, 2019 9:30:24 PM",
    "content": "<h3><span>Lead Application Engineer - SwiftUI, Combine, Architecture, Data Model</span>                </h3>                    <h4>About this job</h4>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Lead, Manager</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Mobile Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Advertising, Graphic Design, Visual Effects</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>1–10 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: LiveSurface | No office location<br></div><h4>Technologies</h4><div></div><div>swift</div><div>uikit</div><div>swiftui</div><div>objective-c</div><div>combine</div>                <h4>Job description</h4>                <div><p>LiveSurface is an industry leader in visualization and image creation tools for creatives. We blend leading technology with hand-curated content to provide realtime photorealistic visualization to our users. At our heart, we are a team of creatives that thrive on transforming challenging problems into beautifully implemented solutions.<br><br>We are seeking a talented lead application engineer to join our team and help us to build the next generation of LiveSurface products. Interested in joining us? We’d love to hear from you.<br><br>Lead Application Engineer<br><br>What you’ll do:<br>_ Build the next generation of LiveSurface visualization products.<br>_ Leverage the latest frameworks (SwiftUI, Combine, Swift 5.x) to build new products.<br>_ Work with the team to build a product roadmap and define milestones.<br>_ Plan and research best technologies, pulling primarily from Apple Frameworks.<br>_ Contribute to the overall product vision.<br>_ Architect clean, reusable and maintainable modules.<br>_ Work tightly with render engine lead to integrate and influence the render engine design.<br>_ Refactor, optimize and pull from existing code from LiveSurface frameworks.<br>_ Deliver beautiful, well implemented code that is performant and easy to understand.<br><br>Who you are:<br>_ A university graduate with an undergraduate degree or better.<br>_ An experienced engineer with a minimum of 5 years working on UI code.<br>_ A fast learner, able to adapt to new frameworks quickly.<br>_ Experienced in creating iOS/macOS applications using Xcode.<br>_ Up-to-date with the latest frameworks.<br>_ Fluent in Swift, Objective-C and Apple Frameworks.<br>_ Experienced in using Apple Frameworks to create custom experiences.<br>_ An English speaker with strong communication skills.<br>_ Equally good at architecting as you are with refactoring.<br>_ Obsessed with clean, reusable modular architecture.<br>_ Focused on workflow and user experience.<br><br>We offer:<br>_ Remote work and a flexible schedule.<br>_ A wide range of challenging problems to solve.<br>_ A stable, revenue-based structure with an existing product (on the market for 5+ years).<br>_ Broad exposure: Your work will be seen and loved by thousands of users.<br>_ A highly acclaimed platform with a loyal user base.<br>_ A small, friendly, engineering team.<br>_ Product-focused, non-corporate management.<br><br>Extras that will make you stand out:<br>_ A background in graphics and gaming.<br>_ Knowledge of C, C++.<br>_ Experience with using Adobe and other industry standard graphics tools.<br><br>More about Context:<br><a href='http://www.livesurface.com/context.php' rel='nofollow'>http://www.livesurface.com/context.php</a><br><br><br></p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/289796?reset=False&amp;ra=1zbGWo96qdKU&amp;oqs=a%3D1zbGWo96qdKU%26so_medium%3DTalent%26so_source%3DTalentApi' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h4>About LiveSurface</h4>            <div><p>LiveSurface was founded by an Apple alum designer/entrepreneur with&nbsp;25+ years in the branding and design fields and&nbsp;10+ years software engineering on macOS/iOS platforms.</p><p>Our small, talented team is distributed and lives in&nbsp;California, New York, Spain, Israel, Portugal, Germany.&nbsp;We love&nbsp;challenging problems and creating&nbsp;beautifully implemented solutions.&nbsp;We are split about evenly between engineering and content/marketing.</p><p>Our current customers include boutique design studios, well-know advertising/design agencies and some of the biggest names in Silicon Valley.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Remote work</span>                            </li>                            <li>                                <span></span>                                <span>Flexible schedule</span>                            </li>                            <li>                                <span></span>                                <span>Nice people</span>                            </li>                            <li>                                <span></span>                                <span>Collaborative workflow</span>                            </li>                            <li>                                <span></span>                                <span>Product-focused approach</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "1vcAm2KARqe0BMqm-0qkkQ",
    "url": "https://stackoverflow.com/jobs/288997/senior-macos-engineer-duckduckgo?a=1yV4U3P0OQ9O&so_medium=Talent&so_source=TalentApi",
    "title": "Senior macOS Engineer at DuckDuckGo  ",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:ios/apple/4",
      "DBG_TECH1:k/t/w:ios/mobile/4",
      "DBG_TECH1:k/t/w:macos/apple/14",
      "DBG_TECH1:k/t/w:swift/apple/10",
      "DBG_TECH1:k/t/w:swift/mobile/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=20, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=28, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "DuckDuckGo",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 125000,
      "maxValue": 125000,
      "info": "Equity",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "USD 125k /Year | Equity"
    },
    "employmentType": "UNSET",
    "published": "Sep 9, 2019 9:30:24 PM",
    "validThrough": "Sep 16, 2019 9:30:24 PM",
    "crawled": "Sep 9, 2019 9:30:24 PM",
    "content": "<h3><span>Senior macOS Engineer</span>                </h3>                    <h4>About this job</h4>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior, Lead, Manager</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Mobile Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Search Engine</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>51–200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: DuckDuckGo | No office location<br></div><h4>Technologies</h4><div></div><div>macos</div><div>swift</div>                <h4>Job description</h4>                <div><p>We are a diverse team from around the world, on&nbsp;a mission to make DuckDuckGo the company people trust most with their online privacy, and we want your help!</p><p>Join us as a&nbsp;<strong>Senior macOS Engineer&nbsp;and</strong>help shape the DuckDuckGo experiences across desktop and mobile platforms.</p><p>As part of our growing team, you will collaborate with team members at all levels to identify and close major gaps in our products. Examples of projects you might work on include expanding and improving mobile content blocking, in addition to running experiments to measure and improve user conversion and usability within our applications. You will take direct responsibility of macOS application features, drive improvements, and own product maintenance.</p><p>We are fully-remote and empower our team to be self-directed and self-motivated in their projects. If you'd thrive in that environment, and our core values resonate with you -- build trust, question assumptions, and validate direction -- you'll fit right in!</p><p><strong>What you will do:</strong></p><ul><li>Lead projects from proposal through postmortem, assessing vague problems, proposing high impact solutions, and executing them against a set of success criteria.</li><li>Step up to resolve product issues – large and small.</li><li>Identify opportunities to increase searches and enhance the standard of trust online.</li><li>Own major application features and take responsibility for their maintenance and improvement over time.</li><li>Collaborate with peers remotely during product brainstorms, technical design discussions, pair programming sessions and code reviews.</li><li>Write pragmatic, performant, and testable code that works consistently across devices.</li><li>Always work to improve the quality of the codebase.</li></ul><p><strong>What we are looking for:</strong></p><ul><li>Significant macOS experience (+5 years), including prior work on at least two large native applications.</li><li>Experience programming in Swift.</li><li>Experience in iOS development.</li><li>Willingness to learn new programming languages and ideas.</li><li>Application architecture experience, including familiarity with MVC/MVVM concepts and how they apply to applications.</li><li>Familiarity with threading and memory management.</li><li>Practiced understanding of how to work with the different libraries and components on macOS and iOS.</li><li>Experience collaborating with a cross-functional team.</li><li>Experience or interest in project advisory, strategic leadership, and/or mentoring.</li><li>Effective project management skills, paired with excellent communication skills.</li></ul><p><strong>Other things to know:</strong></p><ul><li>While we leverage specific job titles for hiring purposes, we do not use them internally. Instead, we follow our own professional levels, with expectations for each level clearly defined across several dimensions.</li><li>We are a small, remote team distributed across time zones, and we rely on a variety of communication tools throughout the day</li><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each ~4-5 days).</li><li>We believe in a focused approach to collaboration, where individual team members work on a single top priority at a time, each supporting larger, company-wide objectives. This philosophy serves to impact our vision to raise the standard of trust online.</li><li>Our work philosophy centers on empowered project management. All team members have opportunities to run projects.</li><li>Transparency supports individual and team success at DuckDuckGo. We encourage everyone to participate in areas of interest throughout the company. Anyone and everyone can (and should) ask questions and offer feedback about our products and internal projects.</li><li>We aim to exemplify our values (build trust, question assumptions, and validate direction) in everything we do.</li><li>While this is a full-time job, we offer a flexible work arrangement with no core hours, expecting an average commitment of 40 hours per week.</li><li>We support professional development of our team members through career advisory and a learning stipend, reinforcing our culture of growth and skill-building.</li></ul><p>DuckDuckGo does not work with any recruiting agencies or services. Instead, we work with each candidate one-on-one throughout a unique hiring process that we've built to reflect our company culture.</p><p>DuckDuckGo provides equal employment opportunities to all employees and applicants for employment, and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.</p><p>If you think you might thrive in this environment, we would love to hear from you. Use the application to apply!</p>                </div>            <div>        <a href='https://duckduckgo.applytojob.com/apply/wCizWMj2uI/Senior-MacOS-Engineer-Remote?source=stackoverflow' rel='nofollow'>                        Apply now        </a></div>            <h4>About DuckDuckGo</h4>            <div><p>DuckDuckGo is an international community of extraordinary individuals, coming together on a mission to build the world's most trusted search engine. We strive to make a great product while at the same time truly respecting the people that use it.</p><p>We embrace diverse perspectives, and seek out passionate, self-motivated people, who are committed to our shared vision of raising the standard of trust online.</p><p><strong>Work Whenever, Wherever</strong></p><p>Productivity is different for everyone and we therefore trust our remote team to work wherever, whenever. Our team is located around the world and we use a variety of tools to stay connected.</p><p><strong>Make an Impact</strong></p><p>We are a small, growing team, working on a search engine used by millions of people worldwide. Whatever you choose to work on at DuckDuckGo you will make a difference starting on day one!</p><p><strong>Culture of Trust</strong></p><p>Our work philosophy is based on a culture of building trust. This translates into empowered project management, transparency at all levels of the organization, and a ton of autonomy.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Unlimited vacation</span>                            </li>                            <li>                                <span></span>                                <span>Generous vacation guidelines</span>                            </li>                            <li>                                <span></span>                                <span>Family leave policy</span>                            </li>                            <li>                                <span></span>                                <span>Co-working reimbursement</span>                            </li>                            <li>                                <span></span>                                <span>Remote work</span>                            </li>                            <li>                                <span></span>                                <span>Company and team meetups</span>                            </li>                            <li>                                <span></span>                                <span>Wellness and learning benefits</span>                            </li>                            <li>                                <span></span>                                <span>Company wide hack days</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "AYGuHd06Q5-xwiUGclFSmA",
    "url": "https://stackoverflow.com/jobs/293011/senior-software-developer-for-macos-chengbao?a=1AgxAkpGVZdK&so_medium=Talent&so_source=TalentApi",
    "title": "Senior Software Developer for macOS at Chengbao (Hong Kong) ",
    "tags": [
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:c/c/10",
      "DBG_TECH1:k/t/w:go/go/9",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:macos/apple/16",
      "DBG_TECH1:k/t/w:objective-c/apple/9",
      "DBG_TECH1:k/t/w:objective-c/c/6",
      "DBG_TECH1:k/t/w:objective-c/mobile/24",
      "DBG_TECH1:k/t/w:swift/apple/5",
      "DBG_TECH1:k/t/w:swift/mobile/8",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=16, mobile=36, go=9, nodejs=0, bigdata-ml=0, ruby=0, apple=32, java=1, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Chengbao",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 9, 2019 9:30:24 PM",
    "validThrough": "Sep 16, 2019 9:30:24 PM",
    "crawled": "Sep 9, 2019 9:30:24 PM",
    "content": "<h3><span>Senior Software Developer for macOS</span>                </h3>                    <h4>About this job</h4>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior, Lead</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Mobile Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>B2C, Cybersecurity</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>201–500 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Chengbao | Hong Kong<br></div>                    <h4>Remote details</h4>                    <div>                        <div>                                                            <div>                                    <span>Preferred Timezone:</span>                                    <span>(GMT+08:00) Hong Kong +/- 6 hours</span>                                </div>                                                            <div>                                    <span>Office Location:</span>                                    <span>Hong Kong.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                            <div>                                    <span>Visa Sponsorship:</span>                                    <span>Yes</span>                                </div>                                                    </div>                    </div>                <h4>Technologies</h4><div></div><div>swift</div><div>objective-c</div><div>macos</div><div>tdd</div>                <h4>Job description</h4>                <div><p><strong>We’re looking for an experienced MacOS Developer</strong></p><p>Chengbao is looking for a MacOS Developer. Join our team to build user-friendly apps and services used by hundreds of thousands of consumers world-wide.</p><p><strong>Responsibilities</strong></p><p>Your exact responsibilities will depend on your skills and interests, but here are some examples:</p><ul><li>Implement new features with superb code quality and high levels of automated test coverage. You’ll focus on macOS with Objective C, but ideally will be involved in other languages and platforms as well. We use Go for code that’s shared across platforms. You’ll need to become an expert in Go as well. Your colleagues will coach you.</li><li>Work closely with the rest of the team to define the product vision, review specs, and make architecture decisions.</li><li>Collaborate with colleagues building similar applications for iOS, Android, Windows, and Linux.</li><li>Write specs for highly technical features.</li><li>Do code-reviews with other developers on the team.</li></ul><p><strong>Requirements</strong></p><ul><li>Expert Mac OS X Objective C developer creating beautiful client-side applications</li><li>Expert in writing automated tests</li><li>Deep understanding of Mac user interface design guidelines</li><li>Deep understanding of object-oriented design principles and patterns</li><li>Ideally: You already have a good understanding of IP networking, or will be eager to learn this here.</li><li>Keen interest to learn Go</li><li>Passion for writing well-architected readable code that’s easy to maintain by a team of several developers</li></ul><p><strong>What we offer</strong></p><ul><li>Attractive compensation and benefits</li><li>Flexible working hours and a healthy work-life balance</li><li>Work in a challenging, collaborative, and fun environment</li></ul><p><strong>About us</strong></p><p>At Chengbao, we’re leading the way to a more private and secure digital world. Consumers in over 180 countries around the globe rely on our industry-leading cybersecurity software and services.</p><p>We are an international tech company with hundreds of people worldwide and a core team in Hong Kong. We’re profitable, growing, and just getting started.</p><p>We hire world-class developers, product managers, and marketers in the industry, and give them the tools to succeed. Together, we ship beautiful, usable software for desktop and mobile that our customers use and love every day.</p><p>Ready to do the best work of your life? We’ve built just the place.</p>                </div>            <div>        <a href='https://grnh.se/da4c1d9c2' rel='nofollow'>                        Apply now        </a></div>            <h4>About Chengbao</h4>            <div><p><strong>About us</strong></p><p>At Chengbao, we’re leading the way to a more private and secure digital world. Consumers in over 180 countries around the globe rely on our industry-leading cybersecurity software and services.</p><p>We are an international tech company with hundreds of people worldwide and a core team in Hong Kong. We’re profitable, growing, and just getting started.</p><p>We hire world-class developers, product managers, and marketers in the industry, and give them the tools to succeed. Together, we ship beautiful, usable software for desktop and mobile that our customers use and love every day.</p><p>Ready to do the best work of your life? We’ve built just the place.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Top Medical and Dental Insurance</span>                            </li>                            <li>                                <span></span>                                <span>Flexible working hours, great work life balance</span>                            </li>                            <li>                                <span></span>                                <span>Free breakfast</span>                            </li>                            <li>                                <span></span>                                <span>Fitness equipment</span>                            </li>                            <li>                                <span></span>                                <span>Ping-pong table and boardgames</span>                            </li>                            <li>                                <span></span>                                <span>High performance based bonus</span>                            </li>                            <li>                                <span></span>                                <span>Powerful hardware</span>                            </li>                            <li>                                <span></span>                                <span>No dress code</span>                            </li>                            <li>                                <span></span>                                <span>Frequent tech talks and sponsored learning</span>                            </li>                            <li>                                <span></span>                                <span>Learn from the best</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "dD9SinH_QCKnGOZLmu2jFQ",
    "url": "https://stackoverflow.com/jobs/276716/senior-ios-developer-neybox-digital?a=1uNIKvCk9BHa&so_medium=Talent&so_source=TalentApi",
    "title": "Senior iOS Developer at Neybox Digital  ",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:animation/gamedev/16",
      "DBG_TECH1:k/t/w:core-data/apple/8",
      "DBG_TECH1:k/t/w:ios/apple/12",
      "DBG_TECH1:k/t/w:ios/mobile/12",
      "DBG_TECH1:k/t/w:objective-c/apple/6",
      "DBG_TECH1:k/t/w:objective-c/c/4",
      "DBG_TECH1:k/t/w:objective-c/mobile/16",
      "DBG_TECH1:k/t/w:swift/apple/10",
      "DBG_TECH1:k/t/w:swift/mobile/16",
      "DBG_TECH1:k/t/w:watchkit/apple/2",
      "DBG_TECH1:k/t/w:xcode/apple/8",
      "DBG_TECH1:k/t/w:xcode/mobile/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=4, mobile=52, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=46, java=0, gamedev=16, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Neybox Digital",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "EUR",
      "minValue": 30000,
      "maxValue": 50000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "EUR 30k - 50k /Year"
    },
    "employmentType": "UNSET",
    "published": "Sep 9, 2019 9:30:24 PM",
    "validThrough": "Sep 16, 2019 9:30:24 PM",
    "crawled": "Sep 9, 2019 9:30:24 PM",
    "content": "<h3><span>Senior iOS Developer</span>                </h3>                    <h4>About this job</h4>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Mobile Developer</span>                                    </div>                            </div>                    </div>                <div>Company: Neybox Digital | No office location<br></div>                    <h4>Remote details</h4>                    <div>                        <div>                                                            <div>                                    <span>Preferred Timezone:</span>                                    <span>(GMT+02:00) Athens +/- 4 hours</span>                                </div>                                                                                                            </div>                    </div>                <h4>Technologies</h4><div>ios</div><div>objective-c</div><div>swift</div>                <h4>Job description</h4>                <div><p><strong>Who we are</strong></p><p>At <a href='https://neybox.com' rel='nofollow'>Neybox Digital </a>we&nbsp;build mobile applications that have a positive impact on the health and well-being of millions of individuals worldwide. We are best known for &quot;<a title=&quot;Pillow Automatic Sleep Tracker&quot; href='https://neybox.com/pillow-sleep-tracker-en' rel='nofollow'>Pillow</a>&quot;, our sleep tracking app and &quot;<a href='https://neybox.com/today-habit-tracker' rel='nofollow'>Today</a>&quot; a habit tracking app with a quantified-self approach.&nbsp;</p><p>All team members are either&nbsp;talented engineers or&nbsp;technically-skilled designers to ensure our collaboration is fast and&nbsp;straightforward. Everyone's voice is heard, and we strongly believe that&nbsp;being part of an&nbsp;inclusive and&nbsp;diverse team that works closely together can produce amazing results.</p><p>The&nbsp;size of our team is small enough to allow everyone to be equally involved and have a clear view of the big picture. We won’t bore you with a single never-ending subtask of a subtask. Meetings and interruptions are always kept to a minimum. We want to you to do work that matters and work that you are proud of.&nbsp;</p><p><strong>Who we're looking for</strong></p><p>We're looking&nbsp;for team members that are enjoy&nbsp;working on all the aspects of developing&nbsp;and evolving an iOS app.&nbsp;From the deep inner workings of the application’s backend architecture and scaling to polishing the animations of the UI and working with our support team to diagnose an issue that a user is having. We require at least 3 years of iOS development experience&nbsp;and you must be able to show at least one real-world project where you have made a significant contribution.</p><p>It's important to know that we're&nbsp;looking for a full-time exclusive collaboration that will last for years and evolve over time. Don't apply for this position if you are a freelance developer searching&nbsp;for a side&nbsp;project to work on for the next few months and move on to the next one.&nbsp;</p><p>Skills and expertise that we require:</p><ul><li>At least 3 years of iOS development experience using&nbsp;Swift and Objective-C&nbsp;</li><li>Experience working with UIKit, Core Animation, GCD, Core Data and WatchKit.</li><li>Experience working with Git version control and Unit testing.</li><li>Experience in performance profiling with Instruments on Xcode.</li><li>Comfortable working and communicating in English, both in writing and speaking.</li><li>Willingness to learn and experiment with new technologies.</li></ul><p><strong>A day at Neybox</strong></p><p>All team members start their day with a quick five-minute report of what they intend to do&nbsp;work on and what has been their progress so far to help us coordinate and prioritise. After that each member of the team will be working on their assigned tasks alone or in coordination with other members of the team developing new features, squashing bugs, prototyping, updating the UI or experimenting with new technologies or the next crazy idea that might change the world.</p><p>We practice Agile development and plan our work on a&nbsp;fifteen-day sprints so there will be regular meetings every second Monday, Thursday and Friday to start a new sprint, plan ahead and show the rest of the team what has be done. There are very few other meetings during the sprint because we have actual work to do ;) That's it!</p><p><strong>What we offer</strong></p><p>We offer a great salary, paid vacation time, financial support for opportunities that will help you grow as professional&nbsp;and&nbsp;we reward every team member with additional bonuses and benefits for outstanding work and personal or team goals achieved.</p><p>If that sounds like what you're looking for, just apply for the position and we'll reach to set up a meeting to get to know you better.</p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/276716?reset=False&amp;ra=1uNIKvCk9BHa&amp;oqs=a%3D1uNIKvCk9BHa%26so_medium%3DTalent%26so_source%3DTalentApi' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "lxiiIERqQZaE9p5kWY2ikQ",
    "url": "https://stackoverflow.com/jobs/293011/senior-software-developer-for-macos-chengbao?a=1AgxAkpGVZdK",
    "title": "Senior Software Developer for macOS at Chengbao (Hong Kong) ",
    "tags": [
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:c/c/10",
      "DBG_TECH1:k/t/w:go/go/9",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:macos/apple/16",
      "DBG_TECH1:k/t/w:objective-c/apple/9",
      "DBG_TECH1:k/t/w:objective-c/c/6",
      "DBG_TECH1:k/t/w:objective-c/mobile/24",
      "DBG_TECH1:k/t/w:swift/apple/5",
      "DBG_TECH1:k/t/w:swift/mobile/8",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=16, mobile=36, go=9, nodejs=0, bigdata-ml=0, ruby=0, apple=32, java=1, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Chengbao",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 3, 2019 11:06:25 AM",
    "validThrough": "Sep 10, 2019 11:06:25 AM",
    "crawled": "Sep 3, 2019 11:06:25 AM",
    "content": "<h3><span>Senior Software Developer for macOS</span>                </h3>                    <h4>About this job</h4>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior, Lead</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Mobile Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>B2C, Cybersecurity</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>201–500 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Chengbao | Hong Kong<br></div>                    <h4>Remote details</h4>                    <div>                        <div>                                                            <div>                                    <span>Preferred Timezone:</span>                                    <span>(GMT+08:00) Hong Kong +/- 6 hours</span>                                </div>                                                            <div>                                    <span>Office Location:</span>                                    <span>Hong Kong.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                            <div>                                    <span>Visa Sponsorship:</span>                                    <span>Yes</span>                                </div>                                                    </div>                    </div>                <h4>Technologies</h4><div></div><div>swift</div><div>objective-c</div><div>macos</div><div>tdd</div>                <h4>Job description</h4>                <div><p><strong>We’re looking for an experienced MacOS Developer</strong></p><p>Chengbao is looking for a MacOS Developer. Join our team to build user-friendly apps and services used by hundreds of thousands of consumers world-wide.</p><p><strong>Responsibilities</strong></p><p>Your exact responsibilities will depend on your skills and interests, but here are some examples:</p><ul><li>Implement new features with superb code quality and high levels of automated test coverage. You’ll focus on macOS with Objective C, but ideally will be involved in other languages and platforms as well. We use Go for code that’s shared across platforms. You’ll need to become an expert in Go as well. Your colleagues will coach you.</li><li>Work closely with the rest of the team to define the product vision, review specs, and make architecture decisions.</li><li>Collaborate with colleagues building similar applications for iOS, Android, Windows, and Linux.</li><li>Write specs for highly technical features.</li><li>Do code-reviews with other developers on the team.</li></ul><p><strong>Requirements</strong></p><ul><li>Expert Mac OS X Objective C developer creating beautiful client-side applications</li><li>Expert in writing automated tests</li><li>Deep understanding of Mac user interface design guidelines</li><li>Deep understanding of object-oriented design principles and patterns</li><li>Ideally: You already have a good understanding of IP networking, or will be eager to learn this here.</li><li>Keen interest to learn Go</li><li>Passion for writing well-architected readable code that’s easy to maintain by a team of several developers</li></ul><p><strong>What we offer</strong></p><ul><li>Attractive compensation and benefits</li><li>Flexible working hours and a healthy work-life balance</li><li>Work in a challenging, collaborative, and fun environment</li></ul><p><strong>About us</strong></p><p>At Chengbao, we’re leading the way to a more private and secure digital world. Consumers in over 180 countries around the globe rely on our industry-leading cybersecurity software and services.</p><p>We are an international tech company with hundreds of people worldwide and a core team in Hong Kong. We’re profitable, growing, and just getting started.</p><p>We hire world-class developers, product managers, and marketers in the industry, and give them the tools to succeed. Together, we ship beautiful, usable software for desktop and mobile that our customers use and love every day.</p><p>Ready to do the best work of your life? We’ve built just the place.</p>                </div>            <div>        <a href='https://grnh.se/da4c1d9c2' rel='nofollow'>                        Apply now        </a></div>            <h4>About Chengbao</h4>            <div><p><strong>About us</strong></p><p>At Chengbao, we’re leading the way to a more private and secure digital world. Consumers in over 180 countries around the globe rely on our industry-leading cybersecurity software and services.</p><p>We are an international tech company with hundreds of people worldwide and a core team in Hong Kong. We’re profitable, growing, and just getting started.</p><p>We hire world-class developers, product managers, and marketers in the industry, and give them the tools to succeed. Together, we ship beautiful, usable software for desktop and mobile that our customers use and love every day.</p><p>Ready to do the best work of your life? We’ve built just the place.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Top Medical and Dental Insurance</span>                            </li>                            <li>                                <span></span>                                <span>Flexible working hours, great work life balance</span>                            </li>                            <li>                                <span></span>                                <span>Free breakfast</span>                            </li>                            <li>                                <span></span>                                <span>Fitness equipment</span>                            </li>                            <li>                                <span></span>                                <span>Ping-pong table and boardgames</span>                            </li>                            <li>                                <span></span>                                <span>High performance based bonus</span>                            </li>                            <li>                                <span></span>                                <span>Powerful hardware</span>                            </li>                            <li>                                <span></span>                                <span>No dress code</span>                            </li>                            <li>                                <span></span>                                <span>Frequent tech talks and sponsored learning</span>                            </li>                            <li>                                <span></span>                                <span>Learn from the best</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Cdx17sjfS12-B7IV9TfFzw",
    "url": "https://stackoverflow.com/jobs/289796/lead-application-engineer-swiftui-combine-livesurface?a=1zbGWo96qdKU",
    "title": "Lead Application Engineer - SwiftUI, Combine, Architecture, Data Model at LiveSurface  ",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:ios/apple/4",
      "DBG_TECH1:k/t/w:ios/mobile/4",
      "DBG_TECH1:k/t/w:macos/apple/4",
      "DBG_TECH1:k/t/w:objective-c/apple/6",
      "DBG_TECH1:k/t/w:objective-c/c/4",
      "DBG_TECH1:k/t/w:objective-c/mobile/16",
      "DBG_TECH1:k/t/w:swift/apple/15",
      "DBG_TECH1:k/t/w:swift/mobile/24",
      "DBG_TECH1:k/t/w:xcode/apple/8",
      "DBG_TECH1:k/t/w:xcode/mobile/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=17, mobile=52, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=37, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "LiveSurface",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 28, 2019 9:06:23 AM",
    "validThrough": "Sep 4, 2019 9:06:23 AM",
    "crawled": "Aug 28, 2019 9:06:23 AM",
    "content": "<h3><span>Lead Application Engineer - SwiftUI, Combine, Architecture, Data Model</span>                </h3>                    <h4>About this job</h4>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Lead, Manager</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Mobile Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Advertising, Graphic Design, Visual Effects</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>1–10 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: LiveSurface | No office location<br></div><h4>Technologies</h4><div></div><div>swift</div><div>uikit</div><div>swiftui</div><div>objective-c</div><div>combine</div>                <h4>Job description</h4>                <div><p>LiveSurface is an industry leader in visualization and image creation tools for creatives. We blend leading technology with hand-curated content to provide realtime photorealistic visualization to our users. At our heart, we are a team of creatives that thrive on transforming challenging problems into beautifully implemented solutions.<br><br>We are seeking a talented lead application engineer to join our team and help us to build the next generation of LiveSurface products. Interested in joining us? We’d love to hear from you.<br><br>Lead Application Engineer<br><br>What you’ll do:<br>_ Build the next generation of LiveSurface visualization products.<br>_ Leverage the latest frameworks (SwiftUI, Combine, Swift 5.x) to build new products.<br>_ Work with the team to build a product roadmap and define milestones.<br>_ Plan and research best technologies, pulling primarily from Apple Frameworks.<br>_ Contribute to the overall product vision.<br>_ Architect clean, reusable and maintainable modules.<br>_ Work tightly with render engine lead to integrate and influence the render engine design.<br>_ Refactor, optimize and pull from existing code from LiveSurface frameworks.<br>_ Deliver beautiful, well implemented code that is performant and easy to understand.<br><br>Who you are:<br>_ A university graduate with an undergraduate degree or better.<br>_ An experienced engineer with a minimum of 5 years working on UI code.<br>_ A fast learner, able to adapt to new frameworks quickly.<br>_ Experienced in creating iOS/macOS applications using Xcode.<br>_ Up-to-date with the latest frameworks.<br>_ Fluent in Swift, Objective-C and Apple Frameworks.<br>_ Experienced in using Apple Frameworks to create custom experiences.<br>_ An English speaker with strong communication skills.<br>_ Equally good at architecting as you are with refactoring.<br>_ Obsessed with clean, reusable modular architecture.<br>_ Focused on workflow and user experience.<br><br>We offer:<br>_ Remote work and a flexible schedule.<br>_ A wide range of challenging problems to solve.<br>_ A stable, revenue-based structure with an existing product (on the market for 5+ years).<br>_ Broad exposure: Your work will be seen and loved by thousands of users.<br>_ A highly acclaimed platform with a loyal user base.<br>_ A small, friendly, engineering team.<br>_ Product-focused, non-corporate management.<br><br>Extras that will make you stand out:<br>_ A background in graphics and gaming.<br>_ Knowledge of C, C++.<br>_ Experience with using Adobe and other industry standard graphics tools.<br><br>More about Context:<br><a href='http://www.livesurface.com/context.php' rel='nofollow'>http://www.livesurface.com/context.php</a><br><br><br></p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/289796?reset=False&amp;ra=1zbGWo96qdKU&amp;oqs=a%3D1zbGWo96qdKU' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h4>About LiveSurface</h4>            <div><p>LiveSurface was founded by an Apple alum designer/entrepreneur with&nbsp;25+ years in the branding and design fields and&nbsp;10+ years software engineering on macOS/iOS platforms.</p><p>Our small, talented team is distributed and lives in&nbsp;California, New York, Spain, Israel, Portugal, Germany.&nbsp;We love&nbsp;challenging problems and creating&nbsp;beautifully implemented solutions.&nbsp;We are split about evenly between engineering and content/marketing.</p><p>Our current customers include boutique design studios, well-know advertising/design agencies and some of the biggest names in Silicon Valley.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Remote work</span>                            </li>                            <li>                                <span></span>                                <span>Flexible schedule</span>                            </li>                            <li>                                <span></span>                                <span>Nice people</span>                            </li>                            <li>                                <span></span>                                <span>Collaborative workflow</span>                            </li>                            <li>                                <span></span>                                <span>Product-focused approach</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "nk2Gst35QoS0vOz-E20GuQ",
    "url": "https://jobmote.com/job/64816/ios-developer-remote/",
    "title": "iOS Developer - REMOTE",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:ios/apple/14",
      "DBG_TECH1:k/t/w:ios/mobile/14",
      "DBG_TECH1:k/t/w:swift/apple/10",
      "DBG_TECH1:k/t/w:swift/mobile/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=30, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=24, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "NextGen Global Resources LLC",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 23, 2019 10:07:37 PM",
    "validThrough": "Aug 26, 2019 10:07:37 PM",
    "crawled": "Aug 24, 2019 3:06:24 AM",
    "content": "<div><p> </p><p><strong>iOS Developer </strong></p><p><strong>REMOTE</strong></p><p>3 openings</p><p> </p><p> </p><p>The ideal candidate will have experience building iOS applications (Swift) that rely on multiple web services and that operate at scale (millions of users), as well as home automation devices and wireless mesh networks (e.g. ZigBee and Z-Wave), and have a strong bias for clean, reusable code, testability and automation.</p><p> </p><p><strong> <em>What you will do as an iOS Developer:</em></strong></p><ul><li>3+ years of experience creating native iOS applications.</li><li>Familiarity with common iOS languages and libraries like Swift, RxSwift.</li><li>Extensive hands-on experience creating custom UI controls, designing protocols, implementing interfaces, and performance optimization.</li><li>Working knowledge of web services &amp; REST APIs.</li><li>Ability to think critically and independently.</li><li>A strong passion for learning and adapting to new technologies.</li><li>Excellent verbal and written communication skills.</li></ul><p> </p><p><strong> <em>What you will bring to the table as an iOS Developer:</em></strong></p><p>- Experience working with IoT frameworks or platforms.</p><p>- Knowledge of source control and code review systems (Github, Gerrit)</p><p>- Ability to effectively communicate technical challenges and solutions</p><p>- Experience with automating workflows for software development builds and deployments</p><p> </p> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "JIMVKlpUThOMxsx-ZZYTfw",
    "url": "https://jobmote.com/job/64489/ios-developer-remote/",
    "title": "iOS Developer - Remote",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:ios/apple/12",
      "DBG_TECH1:k/t/w:ios/mobile/12",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=12, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=12, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Kelly IT Resources",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2019 10:07:31 PM",
    "validThrough": "Aug 25, 2019 10:07:31 PM",
    "crawled": "Aug 23, 2019 3:06:27 AM",
    "content": "<div><b>Position: iOS Developer -Remote</b><br><b>Position Type: Direct Hire/Full Time (US Citizen or Green Card Holder)</b><br><b>Position Location: Dallas, TX</b><br><b>Position Details:</b>?We are looking for an iOS developer responsible for the development and maintenance of applications aimed at a range of iOS devices including mobile phones and tablet computers. Your primary focus will be development of iOS applications and their integration with back-end services. You will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential.<br><b>Responsibilities:</b><ul><li>Design and build applications for the iOS platform</li><li>Ensure the performance, quality, and responsiveness of applications</li><li>Collaborate with a team to define, design, and ship new features</li><li>Identify and correct bottlenecks and fix bugs</li><li>Help maintain code quality, organization, and automatization</li></ul><b> Why Kelly ? ?<br></b><br><br>With Kelly, you?ll have direct connections to leading IT organizations in the best companies around<br><br>the globe?offering you the chance to work on some of today?s most intriguing, innovative and high-<br><br>visibility projects. In a field where change is the only constant, our connections and opportunities<br><br>will help you take your career exactly where you want to go. We work with 95 of the Fortune 100?<br><br>companies, and more than 3,000 IT hiring managers turn to us each year to access the best talent:<br><br>people like you.<br><br>Last year we found 8,000 opportunities for IT professionals. Let us help advance your career<br><br>today.<br><br><b> About<br><br>Kelly Services ? <br></b><br><br>As a workforce advocate for over 70 years, we are proud to directly employ nearly 500,000 people around the world and have a role in connecting thousands more with work through our global network of talent suppliers and partners. Revenue in 2017 was $5.4 billion. Visit kellyservices.com and connect with us on Facebook , LinkedIn and Twitter .<br><br>Kelly Services is an equal opportunity employer including, but not limited to, Minorities, Females,<br><br>Individuals with Disabilities, Protected Veterans, Sexual Orientation, Gender Identity and is<br><br>committed to employing a diverse workforce. Equal Employment Opportunity<br><br>is The Law.<br></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
