{
 "items": [
  {
    "id": "tiDG3yz0S3yb5rWHN51tEw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16303447",
    "title": "SEEKING FREELANCER | Minneapolis, MN USA | Remote | iOS",
    "content": "<div>                  <span>SEEKING FREELANCER | Minneapolis, MN USA | Remote | iOS<p>$4K monthly</p><p>Contact: dave@mystride.co<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 6:45:02 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  },
  {
    "id": "zZfU-knRRumERiZBUU_WUQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165003/c-plus-plus-experts-for-cryptocurrency-projects-all-core-data?a=TkT00oNGpAA",
    "title": "C++ experts for cryptocurrency projects -- all time zones at Core Data () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Desktop Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data, Developer APIs, Sports betting odds algorithms</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Core Data has an opening for four (4) experienced senior-level C++ programmers to add to our EU-based remote work team. Developers in this team will focus on writing logic for various backend components related to the cryptocurrency realm. Core Data uses a 24/7 development model where projects are actively worked on in shifts in a continuous cycle, and thus positions are available for qualified applicants in all time zones. Candidates selected for this position will work under a full-time independent contractor relationship with our EU-based division.&nbsp; While efforts are made to ensure the most comfortable work schedule for each candidate possible, many candidates will be asked to work&nbsp;a Tuesday through Saturday or a Wednesday through Sunday schedule (8 hours per day, 5 days per week).&nbsp;&nbsp;&nbsp;Examples of product lines which applicants may work on include: a from-scratch cryptocurrency exchange, a cryptocurrency mining pool, and creation of an entirely new cryptocurrency which provides new features not currently satisfied by existing tokens.</p><p>For this position, emphasis is placed on the applicant's ability to produce solutions with minimal outside help. As this is a senior-level position, all applicants are expected to be able to write the required applications from start to finish, including design of any database queries or tables. Design specifications will be provided for each project prior to commencement. While actual programming ability is one of the key requirements of this position, applicants for this senior-level posting are expected to show initiative and take a practical approach towards solving real-world problems.</p><p><strong>Examples of technologies we commonly use:</strong></p><ul><li>C++14</li><li>MongoDB</li><li>ZeroMQ and RabbitMQ</li><li>NodeJS</li><li>Boost</li><li>WebSockets</li></ul><p>Applicants with work experience in one or more of the following areas will be given priority:</p><ul><li>Any type of programming work on cryptocurrencies or blockchain</li><li>Network programming (TCP and/or UDP)</li><li>Low latency messaging systems</li><li>Messaging queues</li><li>Creation of an interpreted or scripting language</li><li>Experience with MongoDB (time-series data experience a plus)</li></ul><p><strong>As a pre-screening question, please explain in your cover letter / email</strong>&nbsp;what the 'virtual' keyword does in C++ and what the difference would be if a class function/method is declared with and without it. Messages that omit this may be removed from consideration.&nbsp; This is done so that we can focus on applicants who have taken the time to provide a well-thought response to our icebreaker question.</p>                    </div>                            <h2>                About Core Data            </h2>            <div><p>Core Data is a data and statistics provider with an emphasis on low-latency, real-time data products.&nbsp; Core Data's product lineup is the backbone of a variety of innovative solutions in a variety of business realms.&nbsp; The company is currently expanding into various cryptocurrency-related interests, such as mining, trading, and exchange.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Monthly paid time off                            </div>                            <div>                                 Competitive Compensation                            </div>                            <div>                                 Flexible hours / work schedules                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/c",
      "TECH2/blockchain",
      "TECH2/c++",
      "TECH2/message-queue",
      "TECH2/mongodb",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "blockchain",
      "c",
      "c++",
      "message-queue",
      "mongodb"
    ]
  },
  {
    "id": "oMu6g2sCQMqbrLw3SfJh_g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16300028",
    "title": "let location = &quot;remote&quot; let position = &quot;ios developer&quot; let company = &quot;mystride.co&quot; let compensation = &quot;$50K + 10% equity&quot;",
    "content": "<div>                  <span>let location = &quot;remote&quot;let position = &quot;ios developer&quot;let company = &quot;mystride.co&quot;let compensation = &quot;$50K + 10% equity&quot;<span>              </span><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 12:24:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  },
  {
    "id": "5ghCHj_JQuCZTeZ_69rTTQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16285244",
    "title": "Bill Karma | iOS Software Engineer | Full-time + On-site in NYC | https://www.getbillkarma.com",
    "content": "<div>                  <span>Bill Karma | iOS Software Engineer | Full-time + On-site in NYC | <a href='https://www.getbillkarma.com' rel='nofollow'>https://www.getbillkarma.com</a><p>This is a full-time position and not a contract engagement. The ability to work remotely is a possibility for an exceptional engineer.</p><p>We are looking for a dedicated and an experienced IOS developer to join a specialized, and small mobile team.</p><p>This is a key position in engineering team and you will have a unique opportunity to shape upcoming product features. You will drive implementation from ideation, scoping, development and ultimately to production.</p><p>About You:</p><p>You are passionate about slick UX design and pixel perfect UI.</p><p>You have deep understanding of UIView classes.</p><p>You can design and develop without using storyboards.</p><p>You are not afraid of going deep in client, server and network code to troubleshoot any issue.</p><p>Desired Experience:</p><p>BS/MS in Computer Science, Engineering or a related subject.</p><p>3+ years in iOS development experience (Objective-C, Cocoa, UIKit, Swift and Xcode).</p><p>Extensive experience keeping up with regular iOS SDK and tool chain updates.</p><p>Previous experience working in a start-up environment is a big plus.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 9:55:05 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  },
  {
    "id": "wM8UADmKSUe1CGsEIcLpkQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283329",
    "title": "Drivy | Multiple jobs (Backend, Full-Stack, iOS) | Paris, France | ONSITE, REMOTE, Full-time | https://en.drivy.com/jobs, https://drivy.engineering We ...",
    "content": "<div>                  <span>Drivy | Multiple jobs (Backend, Full-Stack, iOS) | Paris, France | ONSITE, REMOTE, Full-time | <a href='https://en.drivy.com/jobs' rel='nofollow'>https://en.drivy.com/jobs</a>, <a href='https://drivy.engineering' rel='nofollow'>https://drivy.engineering</a><p>We believe shared cars are a better way to move around, offering more flexibility and more convenience.</p><p>We are already the #1 car rental marketplace in Europe, and we believe the adoption will be 100 times larger in just a few years.</p><p>We are present in several countries, have great mobile apps, and kickass hardware. And we're just getting started.</p><p>We're looking for Backend, Full-Stack and iOS engineers.</p><p>Take a look at our engineering blog - <a href='https://drivy.engineering' rel='nofollow'>https://drivy.engineering</a> <a href='https://en.drivy.com/jobs' rel='nofollow'>https://en.drivy.com/jobs</a></p><p>Please apply via the above link and mention Hacker News!<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 6:51:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  },
  {
    "id": "f-dFjgDCRDCzu8TDy5F_tg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/478-senior-ios-engineer-f-m-100-remote",
    "title": "Senior iOS Engineer f/m (100% Remote)",
    "content": "Senior iOS Engineer f/m (100% Remote) - Jobmote<div><div><h2>Senior iOS Engineer f/m (100% Remote)</h2><h5>Jaumo GmbH</h5></div></div><div><div><div><div><div><p>We're looking for a new employee in our <strong>&nbsp;small team</strong> (only engineers, eight people) and give you the opportunity to be part of our very exciting journey.</p><p>You are a&nbsp; <strong>Senior iOS Engineer</strong> &nbsp;with strong experience, and you will be an essential part of our&nbsp; <strong>lean and focused</strong> &nbsp;company. The position is&nbsp; <strong>full-time</strong>. This is an excellent career opportunity to join a fast growing&nbsp; <strong>100% remote</strong> &nbsp;company in a key position.</p><p><strong>You will:</strong></p><ul><li>be responsible for our <a href='https://itunes.apple.com/us/app/jaumo-flirt-chat/id522681493?mt=8' rel='nofollow'>existing award-winning apps</a></li><li>create and implement new features for our app - from UI to APIs</li><li>maintain and optimize the app environment</li><li>work agile with a motivated and innovative small team (us, the two founders)</li></ul><p><strong>Skills &amp; Requirements</strong></p><p>An ideal candidate is <strong>autonomous</strong> , proactive, and has experience working in a variety of different languages. We admire developers who take the initiative, make their own decisions and implement them precisely.&nbsp;</p><p><strong>Your qualifications:</strong></p><ul><li><strong>strong</strong> knowledge of iOS development</li><li>real-world experience building and maintaining mobile apps is a must (have references, please)</li><li>strong practical knowledge including APIs and Git</li><li>you love getting things done</li><li>you are not stuck with a certain language or framework</li><li>you never give up, when it&nbsp;becomes difficult. It’s a challenge to master every situation.</li><li>you&nbsp;have a passion for good software</li><li>you speak and write business-fluent English</li><li>you have worked remotely before</li></ul><p>If this profile matches your expertise, experience, and aspirations, we’d be delighted to receive your full application, <strong>including references, salary requirements,</strong> and <strong>possible starting date</strong>.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Jan 26, 2018 11:21:58 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  },
  {
    "id": "JfvAwRDnR8iLZmelSEVX4A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4077-senior-ios-engineer-bread",
    "title": "Senior iOS Engineer @ Bread",
    "content": "<h2>              Senior iOS Engineer<small> @ Bread</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-01-08 03:42</p></dd>          <dt><span>Description</span></dt>          <dd><p>We are looking for an experienced iOS engineer to join our mobile team to help us build the best crypto currency experience in the world. Our vision is to decentralize banking and bring the power of financial services to everyone in the world, including the nearly 2 billion adults that to this day remain unbanked.</p><p><strong>iOS at Bread</strong></p><p>Bread started out on iOS so the Apple ecosystem is in our blood. Originally, our entire Bitcoin stack was written from scratch in Objective-C. We've since evolved our business and product significantly, however iOS remains core to our ability to execute on our vision. We're not a mobile-first company, we're mobile-only. Our mobile apps are the only way our customers interact with Bread, so we take great pride in our apps.</p><p>The Bread app on iOS is responsible for securing billions of USD worth of digital assets, and that number continues to grow every day. We're growing our iOS team so we can expand our product portfolio and support our rapidly growing iOS customer base.</p><p><strong>What we're doing at Bread</strong></p><p>Bread is at the heart of a financial revolution. We're building the missing piece of infrastructure that ties together the essential functionality of a bank, but where individuals retain complete control over their assets. As a a financial infrastructure company, our mission is unlikely to ever be complete. We need continually strive to bring the power of our apps to new regions of the world, some of which have never had wide access to banking functionality.</p><p>Our approach to this problem heavily focuses on several core tenants. For one, we will never have direct control or visibility over customer funds. It is not our job to interfere in the personal financial lives of our customers. This is accomplished by using digital assets like Bitcoin, and a mobile app like ours which manages its assets on-device.</p><p>The second tenant of our approach is to provide integration with the traditional financial system. Regardless of the currency, people still need to get paid, pay their bills, pay for goods at merchants, and send money to their family and friends. We are building infrastructure that integrates with local financial businesses that tie in with local currencies and adhere to local laws.</p><p>Finally, we need to fight for a quality consumer experience. This is why we try to retain control over every moment of our customer's interaction with our products. We relentlessly design, redesign, test, and experiment to ensure our customers have a positive, safe experience.</p><p><strong>What it's like to work here</strong></p><p>We've built a lively remote work culture that emphasizes regular personal interaction. At Bread, we started as a remote team and have built our workflows around it. This allows us to hire people who want to work with us, regardless of where they've decided to settle (or roam). </p><p>Work-life balance is important to everyone at Bread, and we strive to ensure everyone has enough time for family, exercise, and mental health. In our opinion, a happy and healthy team is an essential ingredient to finding creative solutions to the hard problems we're trying to solve.</p><p>We're more operationally transparent than you may be used to. The entire Bread team has access to a variety of dashboards that help our distributed team make better decisions. If you have a question that can't be answered by a dashboard or an easy query, let's see if we can fix that.</p><p>Bread is committed to building an actively inclusive work environment that makes our team an excellent home for everyone—regardless of gender, sexual orientation, ethnicity, race, education, age, or other personal characteristics.</p><p><strong>Requirements</strong></p><p>There are no hard requirements, so if you see something listed here that you're unsure about, please don't hesitate to ask!</p><ul><li>5+ years of software engineering experience</li><li>Confidence working in the iOS ecosystem: Xcode, debugging</li><li>Some experience with Swift</li><li>Ability to write unit tests, integration tests</li><li>Knowledge of web technologies: APIs, HTTP, JSON, etc</li><li>A desire to learn and grow your skills</li><li>You value your attention to detail</li></ul><p>Nice to haves:</p><ul><li>Experience with C and embedded development is a big plus</li><li>Crypto currency experience will help you get up to speed quicker</li><li>Graphics programming and animations</li></ul><p>You should include these in your application:</p><ul><li>Resume and LinkedIn profile</li><li>Links to code samples on Github, Gitlab, etc</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>USA/Canada/Mexico</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Jan 8, 2018 5:42:15 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  },
  {
    "id": "tzTj-wxIRpyRKDdu0CaHfA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/147670/senior-ios-developer-grassroots-technologies-inc?a=Nwu16QGYRc4",
    "title": "Senior iOS Developer at Grassroots Technologies, Inc (San Bruno, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Mobile Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Digital Media, eCommerce, Publishing</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>(fyi for this role we favor an initial contractor status with conversion potential but will consider full time candidates at the start as well.&nbsp; client is based in Sunnyvale, GRT is in New York City and role could be onsite with either or remote only)</p><p>GRT is carefully searching for a new Senior&nbsp;Level iOS&nbsp;Developer/Architect to join a highly experienced and established team. &nbsp;GRT’s search for this new person is focused with all of our past success factors in mind. We are looking for a solid foundation of technology understanding/potential and work experience; we are also equally interested in well rounded&nbsp;communication skills and confidence within client environments.</p><p><strong>Skills &amp; Requirements</strong></p><ul><li>4+ years experience in iOS&nbsp;Engineer role</li><li>Strong grasp of UI design including layouts, animations and transitions</li><li>Experience in dealing with iOS frameworks, design patterns and software architecture.</li><li>Natural interest in&nbsp;agile development processes and&nbsp;exposure to full development project lifecycle.</li><li>Academic and proven implementation knowledge of Swift (and Objective -C).</li><li>Some&nbsp;experience integrating with remote services (REST, JSON, HTTP)</li><li>Some confidence with automated testing (unit tests/integration tests/etc)</li><li>Github, Stack Overflow and other activity a plus.</li></ul>                    </div>                            <h2>                About Grassroots Technologies, Inc            </h2>            <div><p>Grassroots Technologies, Inc.</p><p>Grassroots Technologies, Inc. (‘GRT’) is a privately owned, technical specialist group incorporated as an independent entity in spring, 2000. The company is a low overhead, lean, and nimble organization, consisting of highly skilled individuals who value Open Source and Best-of-Breed technologies when bringing our clients the best possible solutions. Our clients and associated development work are Mobile, Internet/Intranet Internet, Enterprise and Desktop focused, based primarily in the Metro New York Area.</p><p>The goal of Grassroots is to be the company of choice when our clients and technology partners are asked for referrals. We aim for the New York Internet Community to be of the mindset that “Grassroots Technologies, Inc. is a company which has proven it can get the job done and are a pleasure to work with”. All feedback to date, from the very influential clients we have retained, clearly indicates we are heading towards our goal.&nbsp;</p><p>GRT is a very close-knit group that has seen sustained success to over time. We take our work focus and interpersonal relationships very seriously; the result is a consistent level of quality service to our clients. It is this dedication to our work and our people that results in the high level of performance and expertise that is our competitive advantage. As a result, our recruiting activity is controlled, focusing on only the most promising of candidates.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Extensive Experience                            </div>                            <div>                                 Interpersonal Loyalty                            </div>                            <div>                                 Respect for Individual                            </div>                            <div>                                 Deep Technology Exposure                            </div>                            <div>                                 Flexible Work Conditions                            </div>                    ",
    "urlFetchPending": false,
    "published": "Jan 1, 2018 5:18:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  },
  {
    "id": "l49KNyLFTtKW5biL9tzSnw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63975",
    "title": "Senior IOS Developer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>(fyi for this role we favor an initial contractor status with conversion potential but will consider full time candidates at the start as well.&nbsp; client is based in Sunnyvale, GRT is in New York City and role could be onsite with either or remote only)</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 28, 2017 8:44:58 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  },
  {
    "id": "wvBhp_aKTmO3en2umKYCJw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30150?r=rss2",
    "title": "Analytics Data App - Funded by Tier 1 VCs: iOS Engineer (Remote)",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><p><span>iOS Engineer (REMOTE)</span></p><p><span>At Analytics Data App - Funded by Tier 1 VCs</span><strong><br></strong></p><p><span><br>About us:</span><strong></strong></p><p><span>We are working on something extremely cool that solves some extremely big problems. Pretty vague, we admit: that’s because it’s a secret, for now. Let’s talk in person, we can tell you more. </span></p><p>&nbsp;</p><p><span>The Role:</span><strong></strong></p><p><span>We are looking for an iOS Engineer to join our team to create never-been-done-before technological solutions to complex, global challenges that impact millions of people and businesses. This person is a deep expert in iOS. </span><span>We're not looking for &quot;app developers&quot; but someone who knows the guts of the mobile operating system.</span></p><p><span><br></span><span>Our Ideal Candidate:</span><strong></strong></p><p><span>You have the right combination of software engineering theory and the practical experience needed to build reliable, scalable, high-performance products that our clients love to use. We are looking for someone with a real passion for mobile, teamwork, hustle, good communication, creative problem solving, learning, and having fun. This job might be for you, if you: </span><strong></strong></p><ul><li><p><span>Are an expert in mobile and full-stack performance, scalability and system architecture</span></p></li><li><p><span>Have the ability to reverse engineer systems and deconstruct complex problems into simple, straight-forward solutions </span></p></li><li><p><span>Can serve as a technical lead on our most demanding, cross-functional projects, while being self-directed and collaborative</span></p></li><li><p><span>Are dedicated providing the best customer experience Have a burning desire to improve the world of software through software</span></p></li></ul><p><strong>&nbsp;</strong></p><p><span>You Have:</span><strong></strong></p><ul><li><p><span>5+ years of overall software product development experience</span></p></li><li><p><span>BS in Computer Science or related field</span></p></li><li><p><span>Extensive experience with compilers, debuggers, UI Frameworks, and code generators,</span></p></li><li><p><span>Extensive knowledge of iOS, Swift and Objective C</span></p></li><li><p><span>Knowledge of the iOS SDK and writing multi-threaded apps.</span></p></li><li><p><span>Experience with Swift and/or hybrid code, bridging headers, etc.</span></p></li><li><p><span>Experience with version control – Git preferred</span></p></li><li><p><span>Proficiency in object-oriented development and ability to apply OO concepts</span></p></li><li><p><span>Demonstrated experience and passion for delivering exceptional UX</span></p></li><li><p><span>Experience with the tools of the trade, including a variety of modern programming languages ( C/C++, Python, JavaScript) and open-source technologies.</span></p></li></ul><p><span><br></span><span>What We Can Offer:</span><span><br><br></span></p><ul><li><p><span>Excellent Medical, Dental, Vision options. We pay 99% for employees and 75% for dependents. </span></p></li><li><p><span>401K through Vanguard</span></p></li></ul><p>&nbsp;</p><p><span>The company is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status.</span></p><p><span>&nbsp;</span></p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Dec 26, 2017 8:41:10 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  },
  {
    "id": "q_QpykL0Q0aLf51yqITnYw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/158402/software-engineer-ios-remote-numbrs?a=R7Dgt7zKH0Q",
    "title": "Software Engineer, iOS - Remote at Numbrs () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Mobile Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Finance</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Responsibilities include but are not limited to developing, releasing, monitoring and troubleshooting native iOS and Watch applications. Applicants are also expected to participate in after-hours work.</p><p><strong>All candidates will have</strong></p><ul><li>a Bachelor's or higher degree in technical field of study</li><li>a minimum of five years' experience developing, monitoring and troubleshooting native iOS applications with significant interaction with backend systems</li><li>excellent knowledge and hands-on experience with Swift and Objective-C programming languages</li><li>expert level knowledge of Core Data</li><li>experience collaborating with UI/UX designers</li><li>excellent troubleshooting and creative problem-solving abilities</li><li>excellent written and oral communication and interpersonal skills</li></ul><p><strong>Ideally, candidates will also have</strong></p><ul><li>experience with encryption and cryptography standards</li><li>experience with large-scale iOS applications</li><li>experience with at least one backend language such as Go, C/C++, Java and Scala</li></ul><p><strong>Location:&nbsp;Remote</strong></p>                    </div>                            <h2>                About Numbrs            </h2>            <div><p>Numbrs'&nbsp;focus is on developing products to manage banking transactions and assets. The platform provides banking services for the consumer, as well as the development and implementation of banking software towards financial institutions. We are currently looking for a Software Engineer, iOS - Remote, at the earliest possible start date, to strengthen our position in the industry.</p><p><strong>What we offer</strong></p><ul><li>Technology - Only the most cutting-edge technologies are used and we are constantly innovating. Our technical architecture is based on the use of Microservices, a block chain technology, and a proprietary machine learning technology.</li><li>Self-development - We offer to our employees a clear career chances by offering an experts and manager career path that ensures equal development opportunities.</li><li>Work / life balance - Work/life balance is important to us, which is why we offer flexible work schedules.</li><li>Salary - We offer highly competitive salaries. Our salary formula adjusts to your experience and cost of living.</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 free breakfast, lunch and snacks                            </div>                            <div>                                 coffee and drinks                            </div>                            <div>                                 pool and kicker                            </div>                            <div>                                 modern workplace                            </div>                            <div>                                 paid vacation                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 10:59:50 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  },
  {
    "id": "sR1TygKsRJuArZAjV7FlsA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/getondemand/jobs/67180-software-engineer-ios",
    "title": "Software Engineer- iOS",
    "content": "<div><h2>Software Engineer- iOS at GetOnDemand</h2><div>Mountain View, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$10K–$20K<br>0.1%–0.2%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Can work with extensive chatting infrastructure</p></div>",
    "urlFetchPending": false,
    "published": "Dec 7, 2017 10:05:39 PM",
    "tags": [
      "Full Time",
      "Mountain View",
      "REMOTE1/100",
      "Remote OK",
      "Software Engineer",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  },
  {
    "id": "5SWcKgp7T52Hyu7x3F-vVw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/simon-data/jobs/113300-senior-software-engineer-core-data",
    "title": "Senior Software Engineer, Core & Data",
    "content": "<div><h2>Senior Software Engineer, Core &amp; Data at Simon Data</h2><div>New York City, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Python, Data Visualization, Hadoop, Machine Learning, SQL, Amazon Web Services, Amazon S3, Amazon Redshift, Data Engineering</div><div>Compensation</div><div>$95K–$175K<br>0.1%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Successful engineering teams are built on trust and purpose. At Simon Data we take that literally. We take pride in what we do every day and how we do it. Providing great software to our customers is rewarding and energizing. We've found a rapidly expanding sweet spot in marketing software and are diversifying our engineering team to keep up with the demand. </p><p>New engineers are welcomed into a team of smart and passionate engineers who love data and writing pragmatic code. We believe that you code better when you know how your work connects to the product and our clients. We also believe that you code better when you're surrounded by other engineers who want you to succeed. This attitude is core to our values.</p><p>As a Core &amp; Data Software Engineer, you'll be exposed to the core of our software and the data it keeps. From your first day on the job, you'll have the opportunity to:</p><p>- Interface with data from dozens of clients, each of which have upwards of a terabyte of data (SQL technologies). <br>- Own the build out our data pipe, aggregating data from both structured and unstructured sources (Hadoop, Spark, HDFS, EMR, Redshift). <br>- Scale and optimize our client facing data warehouse that provides real-time interactivity across millions of rows of data (Redshift, Elasticsearch).<br>- Lead development of statistical models and predictive technology to improve our experimentation and segmentation tooling (Machine learning, D3). <br>- Develop critical features to in our python software stack. <br>- Collaborate with an engineering team who is passionate about quality, staying ahead of the curve, and teamwork.</p><p>Our clients rely on us for accurate data and availability. Making mistakes in our business has direct effects on our clients' customers. We take both of these facts very seriously. At odds with this, Simon embraces the startup ethos of keeping lean and focused. We move quickly (continuous deployment) and emphasize experimentation to test hypotheses. To help us keep a high bar of quality, you'll bring a mindset for creativity and fault tolerance to your work every day.</p><p>Simon's engineering team is distributed across four states; we welcome engineers working at our New York City offices as well as remote employees.</p><p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability.</p><p>We'd love to meet you and learn more about your career goals.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 5:19:10 PM",
    "tags": [
      "Amazon Redshift",
      "Amazon S3",
      "Amazon Web Services",
      "Data Engineering",
      "Data Visualization",
      "Full Time",
      "Hadoop",
      "Machine Learning",
      "New York City",
      "Python",
      "REMOTE1/100",
      "Remote OK",
      "SQL",
      "Software Engineer",
      "TECH1/apple",
      "TECH1/bigdata-ml",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "bigdata-ml"
    ]
  },
  {
    "id": "d4YMqEIMRZm7MnpXf3DgcQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/open-health-network/jobs/120532-mobile-application-developers",
    "title": "Mobile application developers",
    "content": "<div><h2>Mobile application developers at Open Health Network</h2><div>San Francisco Bay Area, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Java, HTML5 &amp; CSS3, Objective-C, iOS Development / Objective-C (Cocoa Touch)</div><div>Compensation</div><div>$100K–$150K<br>0.1%–0.5%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Mobile application developers with one or more of following:<br>iOS -- Objective C or Swift<br>Android -- Java<br>HTML5 -- Cordova / PhoneGap / Ionic</p><p>Positions are to be located in Washington, DC or San Francisco Bay Area. U.S. Citizens only, able to pass background check / Public Trust.</p></div>",
    "urlFetchPending": false,
    "published": "Nov 29, 2017 10:22:20 PM",
    "tags": [
      "Full Time",
      "HTML5 & CSS3",
      "Java",
      "Objective-C",
      "REMOTE1/100",
      "Remote OK",
      "San Francisco Bay Area",
      "Software Engineer",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown",
      "iOS Development / Objective-C (Cocoa Touch)"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  }
]
}
