{
 "items": [
  {
    "id": "_3_22mANSLy8bxvydXTa1A",
    "url": "https://remoteok.io/jobs/85292",
    "title": "Senior Software Engineer",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Vistas recruitment",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "EUR",
      "minValue": 70000,
      "maxValue": 80000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "EUR 70k - 80k /Year"
    },
    "employmentType": "UNSET",
    "published": "May 21, 2020 2:15:10 AM",
    "validThrough": "May 28, 2020 2:15:10 AM",
    "crawled": "May 21, 2020 3:05:21 AM",
    "content": "<span></span> <span><h4>Vistas recruitment</h4></span> <br> <h3>Senior Software Engineer</h3> <div>  <div>   Berlin, Germany - Location: Berlin or Remote (within Germany)Type: PermanentSalary: €70,000 - €80,000 Per AnnumDo you&nbsp;have at least 2 years production Go experience?Fancy&nbsp;building modern, highly scalable cloud platforms using Go?...for a product innovation company helping businesses gr...   <span>yagJzhkdapAsCMnUw7CpJAMi</span>  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "8HYGRtbqQhSD2HDx5Q2J1Q",
    "url": "http://workinstartups.com/job-board/job/92172/cto-or-lead-developer-at-construction-supermarket/",
    "title": "CTO or Lead Developer",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Construction Supermarket",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 20, 2020 10:41:01 AM",
    "validThrough": "May 27, 2020 10:41:01 AM",
    "crawled": "May 20, 2020 12:05:27 PM",
    "content": "<p>Want to work at a fast-growing UK startup?&nbsp;</p><br /><p>Construction Supermarket is seeking a highly qualified CTO!</p><br /><p>The CTO will be a senior member of the founding team and lead all engineering efforts.</p><br /><p>This is an equity-based role, offering the chance to join a fast-growing UK startup with a proven business model that works. A timeframe for a salary package + bonuses will be discussed to coincide with our growth efforts.&nbsp;</p><br /><p>About Construction Supermarket</p><br /><p>Construction Supermarket, our mission to eradicate cowboys from the Construction market and be the &quot;go to&quot; people for residential projects. We introduced verified and vetted contractors to verified and vetted clients to ensure what's agreed in the contract is delivered in real life without a hitch!</p><br /><p>Our bespoke package is tailor-made for both client and contractor alike which makes it a no brainer when selecting a contractor for the project.&nbsp;</p><br /><p><br />Since our founding in 2018, we&rsquo;ve grown to become fully profitable. We have gone through the tough times and changed the business model to suit clients requirements. We are at a point to embark on the 24-month journey to be UK national but require the Technology expertise to help bring the vision into reality.&nbsp;</p><br /><p>Who are we looking for?</p><br /><p>We are looking for someone to own the engineering side of Construction Supermarket and work in unison with the company product strategy.</p><br /><p>Experience working within a startup would be advantageous.</p><br /><p>You&rsquo;re a talented back-end software engineer with extensive experience in designing and building ideas from scratch..</p><br /><p>The CTO will manage all aspects of technical architecture.</p><br /><p>Experience building resilient API&rsquo;s.</p><br /><p>Sound like you? We want to know what you can bring to the table. We are in no rush to hire so will be looking for the right candidate that shares our vision and our energy.&nbsp;</p><br /><p>We have a fully serviced office based in DA1 5GA but you have the ability to work from home - No pressure.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "a8QnzZJBSlWMGIE0cWVVpg",
    "url": "https://remote.co/job/senior-software-engineer-122/",
    "title": "Senior Software Engineer",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Red Hat",
      "sameAs": "https://www.redhat.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 18, 2020 3:41:04 PM",
    "validThrough": "May 25, 2020 3:41:04 PM",
    "crawled": "May 18, 2020 4:06:20 PM",
    "content": "<div><span><i></i> Remote</span>        </div><div>            <ul><li>Location: US-Remote</li><li>Job ID: 76893</li><li>Category: Software Engineering</li></ul><p><strong>Company description</strong></p><p>At Red Hat, we connect an innovative community of customers, partners, and contributors to deliver an open source stack of trusted, high-performing solutions. We offer cloud, Linux, middleware, storage, and virtualization technologies, together with award-winning global customer support, consulting, and implementation services. Red Hat is a rapidly growing company supporting more than 90% of Fortune 500 companies.</p><p><strong>Job summary</strong></p><p>The Red Hat OpenShift team is looking for a Senior Software Engineer to join us in Boston, MA. In this role, you will help guide the continued progress of the Red Hat OpenShift offering. As part of the OpenShift team, you’ll need to have passion for technology and development, balanced with the responsibility of running a hosted service. You’ll offer a service that will change how development is done, using the benefits of Red Hat’s technologies and services hosted in the cloud. As a Senior Software Engineer, you’ll need to be inquisitive and motivated, but also able to collaborate with others and more than willing to help make them successful. You’ll also need to be well spoken and have excellent written language skills in English, which you will use to communicate with other Red Hat OpenShift engineers located across the globe.</p><p><strong>Primary job responsibilities</strong></p><ul><li>Serve as a senior-level engineering contributor to the Red Hat OpenShift Routing and DNS subsystems</li><li>Make updates to key components within the Red Hat OpenShift networking infrastructure</li><li>Contribute design, changes, revisions, updates, and maintenance to this infrastructure, as well as other core parts of the Red Hat OpenShift infrastructure which manage the routing and DNS characteristics of the offering</li></ul><p><strong>Required skills</strong></p><ul><li>Solid Linux experience, including administration of a single machine and creation and use of containers</li><li>Experience with networking and internet technologies, including TCP/IP, DNS, HTTP and associated protocols, L4 and L7 load balancing solutions, or HAProxy; familiarity with other high-level protocols is a plus</li><li>Experience with Go</li><li>Solid experience with programming in a Unix environment</li><li>5+ years of programming experience</li><li>Experience working on a large, complex, deployed software offering</li><li>Software design and architectural experience</li><li>Ability to write specifications</li><li>Ability to divide specifications into subtasks</li><li>Ability to lead others with technical implementation</li><li>Solid written and verbal communication skills</li><li>Experience working with agile methodologies</li><li>Experience working with source control and bug tracking; Git, Jira, or Bugzilla are a plus</li></ul><p><strong>The following are considered a plus:</strong></p><ul><li>Experience with at least one major cloud provider, ideally Amazon Web Services (AWS)</li><li>Experience with a container orchestration technology, ideally Kubernetes</li><li>Experience working with Kubernetes upstream</li><li>Contributions to open source projects in HTTP (server, proxy, or client), ipfailover, container, or DNS (server or client) space</li><li>General open source contribution history</li><li>Master’s degree in computer science</li></ul><p>Red Hat is proud to be an equal opportunity workplace and an affirmative action employer. We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, uniformed services, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law.</p><p>Red Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee.</p>        </div><div>        <a href='https://us-redhat.icims.com/jobs/76893/senior-software-engineer/job?hub=7' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "5XJYqEQ5Q_KYrwRogP6KxQ",
    "url": "https://remote.co/job/senior-software-engineer-ipfs/",
    "title": "Senior Software Engineer, IPFS",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Protocol Labs",
      "sameAs": "https://protocol.ai/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 18, 2020 1:45:51 PM",
    "validThrough": "May 25, 2020 1:45:51 PM",
    "crawled": "May 18, 2020 2:06:08 PM",
    "content": "<div><span><i></i> Remote</span>        </div><div>            <ul><li>REMOTE – IPFS</li><li>PROJECTS – ENGINEERING</li><li>FULL-TIME</li></ul><p><strong>About:</strong></p><ul><li>Build the reference implementation of a resilient, open, and upgradeable network for humanity’s information.</li><li>We are hiring senior software engineers/leaders to work on the reference implementation of the InterPlanetary File System (IPFS).</li><li>IPFS is one of the most promising projects of Web 3.0. Combining distributed systems research with large-scale real-world applications, IPFS has brought content-addressed, peer-to-peer applications to millions of monthly active users. If successful, IPFS will form a new foundation for a distributed web of knowledge and computation for humans everywhere.</li><li>Many significant technical challenges remain as we expand the IPFS network and functionality to support new scaling demands.</li><li>We’re seeking senior engineers experienced in distributed systems design and implementation to join our full-time open-source team.</li><li>We particularly value experience independently designing and implementing significant components of complex systems, leading strong open source communities, contributing to projects involving protocol design or globally distributed systems, and demonstrating execution focus and discipline to carry such projects to completion.</li><li>Distributed Systems Engineering at Protocol Labs</li><li>Distributed systems engineering lies at the center of many projects at Protocol Labs. With IPFS, libp2p, Filecoin, and other related projects we are laying the foundation for a more resilient, secure, distributed version of the web.</li><li>This requires rigorous engineering from protocol design through all the phases of implementation.</li><li>We strike a balance between pragmatism (put it on a ship ), deeply informed protocol design, and strict application of strong engineering principles.</li><li>All of this happens in an environment defined by curiosity, passion, and a love for open source.</li></ul><p>A<strong>s a Senior Software Engineer with IPFS you might…</strong></p><ul><li>Design and implement significant components of the Go-IPFS open-source reference implementation</li><li>Develop solutions to hard problems in low-trust distributed systems</li><li>Integrate research results and demonstrations into working, scalable programs and systems</li><li>Contribute to protocol design and specification efforts</li><li>Lead and develop more junior engineers, and provide guidance and review for open source contributors around the world</li></ul><p><strong>You may be a fit for this role if you have…</strong></p><ul><li>Significant experience designing and building distributed infrastructure or systems</li><li>A strong technical design ability informed by broad experience across multiple domains/specialties</li><li>A solid understanding of distributed systems principles and applications</li><li>A keen awareness of teamwork, process, and patterns of successful collaboration</li></ul><p><strong>Highly valued bonus experience includes:</strong></p><ul><li>Open-source community curation and leadership</li><li>Decentralized building blocks such as DHTs, p2p networking, UNIX file systems, etc.</li><li>Large-scale systems (especially networking, performance, storage, or reliability engineering)</li><li>Extensive Go programming</li><li>Security engineering and/or cryptography principles and practices</li></ul><p><strong>What’s it like to work at Protocol Labs?</strong></p><ul><li>Protocol Lab’s mission is to improve humanity’s most important technology, the Internet. We build protocols, systems, and tools to improve how it works.</li><li>Today, we are focused on how we store, locate, and move information. Our projects include IPFS, Filecoin, libp2p, and more.</li><li>As a distributed team, we hire anywhere in the world, and at various levels of experience (entry, senior, staff). We look for people with unique perspectives and diverse backgrounds.</li></ul><p>We have a great benefits package, including parental leave, contributions to your retirement, competitive pay, and unlimited time off. For U.S.-based employees, we also provide platinum-level health, dental, and vision coverage for you and your family.</p>        </div><div>        <a href='https://jobs.lever.co/protocol/82793e56-124f-484c-bf13-357ef0b45bc6' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "t_Sdhd1BRX6kA8l3CKI89A",
    "url": "https://remoteok.io/jobs/85190",
    "title": "Senior Software Engineer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go-developer/go/13",
      "DBG_TECH1:k/t/w:golang/go/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=29, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Avy Finans",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 15, 2020 7:48:07 PM",
    "validThrough": "May 22, 2020 7:48:07 PM",
    "crawled": "May 15, 2020 8:05:22 PM",
    "content": "<span></span> <span><h4>Avy Finans</h4></span> <br> <h3>Senior Software Engineer</h3> <div>  <div>   \\nSENIOR SOFTARE ENGINEER (GOLANG, PLATFORM)\\n\\nABOUT THE COMPANY\\n\\nTL;DR We are a prop-tech scale-up with fin-tech engine at our core\\nEnabling property owners to get closer to their tenants from both communication and services (commercial) standpoints.\\n\\n\\nTHE ROLE\\n\\nAs one of our first platform (back-end) engineers, you will have the opportunity to establish a foundation for the future of software engineering in AVY.\\n\\nCentral part of our platform will be payment processing engine utilizing PSD2.0 Open Banking APIs and at the same time interfacing various 3rd party payment processors.\\n\\nWe are looking for experienced open-minded&nbsp;Golang&nbsp;engineer who is passionate about clean and tested code being deployed through&nbsp;Continuous Delivery&nbsp;process.\\n\\nRest of the platform is based on&nbsp;microservice event-driven architecture. Front-end clients are based on React.\\n\\nInfrastructure is being built on&nbsp;Kubernetes&nbsp;running on&nbsp;GCP.\\n\\nEXPECTATIONS\\n\\n\\n* Design and implement payment processing APIs working towards Open Banking (PSD2.0)\\n\\n* Engineer and implement highly scalable microservice architecture\\n\\n* Lead the team by example in the development of backend-services for AVY platform\\n\\n* Develop secure, robust and scalable APIs which would be consumed by various clients (front-end, mobile, partner integrations)\\n\\n* Make sure that written code is covered by tests with defined acceptance levels\\n\\n* Work closely with Product Owner in roadmap creation process\\n\\n* Open to work in high paced, stable and agile start-up environment\\n\\n\\n\\n\\nREQUIRED EXPERIENCE\\n\\n\\n* 3+ years working with Golang\\n\\n* experienced in several programming and scripting languages\\n\\n* Experience with unit and integration testing paradigms\\n\\n* Experience writing code for transactional high-intensity, real-time applications\\n\\n* Deep understanding of system architecture design, algorithms and data structures\\n\\n* Event-driven architecture\\n\\n* Relational databases\\n\\n* Experience with containerization technologies\\n\\n* Experience with Messaging queues\\n\\n* Experience in working with cloud services (AWS or Google Cloud Platform)\\n\\n* Structured analytical mindset with strong communication skills\\n\\n\\n\\n\\nTHE TEAM\\n\\nWhile we do have office in central Stockholm, we are distributed team from our start working in a +-4 hours timezones since 2018.\\n\\nToday, we have a mix of on-site/remote engineers, however, recently, we have transformed ourselves to a&nbsp;100% remote company.\\n\\nWe are very much interested in each of our team members as individuals and professionals and are trying to do fun stuff which are useful for our business but at the same time, we all want to learn new things and share knowledge - that is at the heart of our engineering team at Avy.   <span>yagJzhkdapAsCMnUw7CpJAMi</span>  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "PWAoBAQGTbixyO4zT5Js3g",
    "url": "https://stackoverflow.com/jobs/392921/senior-software-engineer-golang-platform-avy-finans-ab?a=27LXoMhPnxpm&so_medium=Talent&so_source=TalentApi",
    "title": "Senior Software Engineer (Golang, Platform) - 100% remote (UK/EU only) at Avy Finans AB  ...",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go-developer/go/13",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:golang/go/32",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=48, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Avy Finans AB – Stockholm, Sweden",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 15, 2020 2:05:16 PM",
    "validThrough": "May 22, 2020 2:05:16 PM",
    "crawled": "May 15, 2020 2:05:16 PM",
    "content": "<h3><span>Senior Software Engineer (Golang, Platform) - 100% remote (UK/EU only)</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Mid-Level, Senior</span>                                </div>                        </div>                </div>            <div>Company: Avy Finans AB – Stockholm, Sweden<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT+01:00) Stockholm </span>                            </div>                                                    <div>                                <span>Office Location:</span>                                <span>Stockholm, Sweden.</span>                                    <span>Employees can also work full time from this office.</span>                            </div>                                                                    </div>                </div>            <h4>Technologies</h4><div>go</div><div>postgresql</div><div>microservices</div><div>google-cloud-platform</div>            <h4>Job description</h4>            <div><p><strong>SENIOR SOFTARE ENGINEER (GOLANG, PLATFORM)</strong></p><p><strong>ABOUT THE COMPANY</strong></p><p>TL;DR We are a prop-tech scale-up with fin-tech engine at our core<br>Enabling property owners to get closer to their tenants from both communication and services (commercial) standpoints.</p><p><strong>THE ROLE</strong></p><p>As one of our first platform (back-end) engineers, you will have the opportunity to establish a foundation for the future of software engineering in AVY.</p><p>Central part of our platform will be payment processing engine utilizing PSD2.0 Open Banking APIs and at the same time interfacing various 3rd party payment processors.</p><p>We are looking for experienced open-minded&nbsp;<strong>Golang</strong>&nbsp;engineer who is passionate about clean and tested code being deployed through&nbsp;<strong>Continuous Delivery</strong>&nbsp;process.</p><p>Rest of the platform is based on&nbsp;<strong>microservice event-driven architecture</strong>. Front-end clients are based on React.</p><p>Infrastructure is being built on&nbsp;<strong>Kubernetes</strong>&nbsp;running on&nbsp;<strong>GCP</strong>.</p><p><strong>EXPECTATIONS</strong></p><ul><li>Design and implement payment processing APIs working towards Open Banking (PSD2.0)</li><li>Engineer and implement highly scalable microservice architecture</li><li>Lead the team by example in the development of backend-services for AVY platform</li><li>Develop secure, robust and scalable APIs which would be consumed by various clients (front-end, mobile, partner integrations)</li><li>Make sure that written code is covered by tests with defined acceptance levels</li><li>Work closely with Product Owner in roadmap creation process</li><li>Open to work in high paced, stable and agile start-up environment</li></ul><p><strong>REQUIRED EXPERIENCE</strong></p><ul><li>3+ years working with Golang</li><li>experienced in several programming and scripting languages</li><li>Experience with unit and integration testing paradigms</li><li>Experience writing code for transactional high-intensity, real-time applications</li><li>Deep understanding of system architecture design, algorithms and data structures</li><li>Event-driven architecture</li><li>Relational databases</li><li>Experience with containerization technologies</li><li>Experience with Messaging queues</li><li>Experience in working with cloud services (AWS or Google Cloud Platform)</li><li>Structured analytical mindset with strong communication skills</li></ul><p><strong>THE TEAM</strong></p><p>While we do have office in central Stockholm, we are distributed team from our start working in a +-4 hours timezones since 2018.</p><p>Today, we have a mix of on-site/remote engineers, however, recently, we have transformed ourselves to a&nbsp;100% remote company.</p><p>We are very much interested in each of our team members as individuals and professionals and are trying to do fun stuff which are useful for our business but at the same time, we all want to learn new things and share knowledge - that is at the heart of our engineering team at Avy.</p>            </div>        <div>            <a href='https://stackoverflow.com/jobs/apply/392921?reset=False&amp;ra=27LXoMhPnxpm&amp;oqs=a%3D27LXoMhPnxpm%26so_medium%3DTalent%26so_source%3DTalentApi' rel='nofollow'>                                <span>Easy apply</span>            </a>                            </div>            <h4>About Avy Finans AB</h4>            <div><p>Through data and digitalization, AVY wants to make it easier for people to live in rental housing. This is achieved by strengthening the relationship between the tenant and the landlord throughout the entire housing journey. Through an increased customer focus and a digital interface in AVY's mobile app, we are increasing the digitization rate, lowering administrative costs and creating new revenue streams for property owners.</p>            </div>        ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "lp_zcdmxSzSnIorzkxvK1Q",
    "url": "https://stackoverflow.com/jobs/287208/senior-go-backend-developer-m-f-x-refurbed?a=1yjSBbW1etEY&so_medium=Talent&so_source=TalentApi",
    "title": "Senior Go Backend Developer (m/f/x) at refurbed (Wien, Österreich) ",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:embedded/c/1",
      "DBG_TECH1:k/t/w:embedded/embedded/8",
      "DBG_TECH1:k/t/w:go/go/21",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:vue.js/frontend/24",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=1, mobile=0, go=21, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=8, frontend=29}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go"
    ],
    "hiringOrganization": {
      "name": "refurbed – Wien, Österreich",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "EUR",
      "minValue": 42000,
      "maxValue": 70000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "EUR 42k - 70k /Year"
    },
    "employmentType": "UNSET",
    "published": "May 12, 2020 3:05:16 PM",
    "validThrough": "May 19, 2020 3:05:16 PM",
    "crawled": "May 12, 2020 3:05:16 PM",
    "content": "<h3><span>Senior Go Backend Developer (m/f/x)</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Senior, Lead</span>                                </div>                                <div>                                    <span>Role: </span>                                    <span>Backend Developer</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Industry: </span>                                    <span>Consumer Electronics, eCommerce, Marketplace</span>                                </div>                                <div>                                    <span>Company size: </span>                                    <span>51–200 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>VC Funded</span>                                </div>                        </div>                </div>            <div>Company: refurbed – Wien, Österreich<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT+01:00) Vienna </span>                            </div>                                                    <div>                                <span>Office Location:</span>                                <span>Wien, Österreich.</span>                                    <span>Employees can also work full time from this office.</span>                            </div>                                                    <div>                                <span>Visa Sponsorship:</span>                                <span>Yes</span>                            </div>                                                    <div>                                <span>Relocation Assistance:</span>                                <span>Yes</span>                            </div>                    </div>                </div>            <h4>Technologies</h4><div>go</div><div>postgresql</div><div>rabbitmq</div><div>gin-gonic</div><div>google-cloud-platform</div>            <h4>Job description</h4>            <div><p><strong>Your Role:</strong></p><ul><li>Development of our main API</li><li>Development of our smaller backend services</li><li>Integration of&nbsp;external systems into our platform<br><br></li></ul><p><strong>Your Profile:&nbsp;</strong></p><ul><li>Formal education in computer science</li><li>Significant experience designing and implementing backend&nbsp;services</li><li>Significant experience with software development in Go</li><li>Good knowledge of SQL and relational database design</li><li>You work independently and goal-oriented</li><li>You have excellent English skills<br><br></li></ul><p><strong>Additional factors we appreciate:</strong></p><ul><li>You have experience with PostgreSQL</li><li>You are comfortable working with Linux/*BSD</li><li>You have experience working with backend services like Nginx or RabbitMQ</li><li>You have experience with Kubernetes/GCP</li><li>You are active in the open-source community</li><li>You can speak German</li></ul>            </div>        <div>        <a href='https://www.refurbed.at/jobs/?jh=qj8ml80ktnyiibe6jmzis67y1qcqzx4&amp;_lufsdcevgps=,MIdmItuDZLql4S1wiLdUWcIPbwUqAMmCGei3yigwHqOAkvV4M2iHvEtAdfQSe0,rvZymx719P5O7mtoEHs5,6qCe-lVZZ7jDndTHaGhiSYdrC8iF8RcUK6aw7oT,kytEKKN0p0IUrG-XmMqskNlYOejntTRb0SR-7l6Mf3GYFeclh4F-7iKzOc7Ti9AHlnVQDeXXcPZofudg73pSO7hOXTF6htncOOU' rel='nofollow'>            Apply        </a>                            </div>            <h4>About refurbed</h4>            <div><p>We are the&nbsp;<strong>fastest-growing marketplace for refurbished electronics</strong>&nbsp;in the German-speaking region. Our products save up to&nbsp;<strong>70% of CO<sub>2</sub>&nbsp;emissions</strong>&nbsp;in comparison to a new device and are also up to&nbsp;<strong>40% cheaper</strong>. Additionally, for every sold device we plant a tree and we were already able to plant&nbsp;<strong>more than 200,000 trees</strong>&nbsp;to fight global warming.</p><p>We were founded in February 2017 and grew to&nbsp;<strong>more than 80 employees in less than three years</strong>&nbsp;and expanded to Italy and Poland already. Along the way we won several awards and have already sold tens of thousands of products, making us one of the<strong>&nbsp;fastest-growing startups in Europe in 2020.</strong>&nbsp;Additionally, we recently announced&nbsp;one of&nbsp;<strong>Austria's biggest Series A funding rounds of € 15.6 mn.&nbsp;</strong></p><p>Our main system consists of an&nbsp;HTTP API and backend workers written in Go, a&nbsp;public interface serving HTML pages to our customers written in Go and connecting to our API, Vue.js interfaces embedded into our public interface, and a standalone Vue.js management interface.</p><p>Key technologies are: Go, Vue.js, PostgreSQL, RabbitMQ and AMQP.</p><p>Together with you we want to&nbsp;<strong>build the leading marketplace for refurbished electronics in Europe.</strong></p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Remote work</span>                            </li>                            <li>                                <span></span>                                <span>Highly skilled team</span>                            </li>                            <li>                                <span></span>                                <span>Flexible working hours</span>                            </li>                            <li>                                <span></span>                                <span>Sustainability driven business</span>                            </li>                            <li>                                <span></span>                                <span>Startup atmosphere</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "4laulYabQK-jH-HXkHhRfA",
    "url": "http://workinstartups.com/job-board/job/91726/remote-software-developer-using-go-no-go-experience-required-at-barbal/",
    "title": "Remote Software Developer using Go (no Go experience required)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:go/go/15",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:jquery/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=15, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=12}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go"
    ],
    "hiringOrganization": {
      "name": "Barbal",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 5, 2020 7:19:27 AM",
    "validThrough": "May 12, 2020 7:19:27 AM",
    "crawled": "May 11, 2020 10:05:21 AM",
    "content": "<p><strong>Opportunity to learn Go! (Or continue learning it...!)</strong></p><br /><p>We are looking for help with building out our SaaS platform. Key technologies are <strong>Go</strong> (HTML templates, web services, ORM) <strong>CSS, Javascript / jQuery, Postgres, Docker, Kubernetes, GCP</strong>.&nbsp;</p><br /><p><strong>No Go experience necessary</strong>, we know that good developers do pick it up quickly.</p><br /><p>The software industry has become adept at large scale, global collaboration, bringing thousands of developers together to efficiently collaborate. This has been enabled by hosted collaboration solutions like github and bitbucket. The business world is lagging far behind, still wasting huge amounts of time and cost on inefficient content management. Barbal is bridging the gap, providing a platform that leverages software industry tools and techniques for the non-technical user.&nbsp;</p><br /><p>We are 18 months into our journey, part of the Setsquared accelerator, and we are a very friendly team of five! The product is live and we are running trials with early adopters. There is lots more functionality to build and some to refine. We are Bristol-based, but lockdown has really made us think about continuing as a distributed company. So who knows - if we get along well, future working relationships could emerge from this opportunity!&nbsp;</p><br /><p>Note this is a voluntary project and not a paid role, likely suiting someone on furlough looking to learn / apply a new skill.</p><br /><p>Thank you for reading, we look forward to hearing from you!</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "H84-kvFLTEieG3IrVA-Kng",
    "url": "http://workinstartups.com/job-board/job/91857/cto-and-co-founder-fully-remote-at-grexie/",
    "title": "CTO and Co-founder (Fully Remote)",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(you,we,employe,develop,engin,abl,workmat) 2W work 2W from 2W home",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:k/t/w:golang/go/16",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=13, c=2, mobile=1, go=16, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet",
      "go"
    ],
    "hiringOrganization": {
      "name": "Grexie",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 10, 2020 2:10:44 PM",
    "validThrough": "May 17, 2020 2:10:44 PM",
    "crawled": "May 10, 2020 4:05:21 PM",
    "content": "<p><strong>About the company</strong></p><br /><p>Grexie is establishing a new platform for PubSub, low-latency messaging between peers on a network. In-browser and server-side deployments in a plethora of languages provides clients the ability to pick and choose their environment to best meet their application.</p><br /><p>Customers can create real time apps using Grexie, including but not limited to Uber-style applications, digital charting dashboards, real time multiplayer games, secure chat clients, and anything that requires real time messaging using a cutting edge PubSub broker.</p><br /><p><strong>About the role</strong></p><br /><p>Joining as a co-founder you will be given a substantial equity stake in the new business.</p><br /><p>You will be partnering with the other co-founders in the business to build the MVP client-side libraries and server-side backend code. This is a work-from-home business, you will work from home indefinately and join the team on Skype conference calls on a daily basis at a to-be-agreed time. The CEO is technical with a wide skillset and startup experience, and so you will be working with them on these new projects.</p><br /><p>On growth, you will establish a team of world-class engineers, taking responsibility for the entire tech domain. On investment, you will be given a substantial budget to grow the business' tech stack and establish Grexie as the leader in PubSub communications.</p><br /><p>The role is unpaid and equity based for now but you can expect the co-founders to push for &pound;100k salaries from the investors once the MVP is complete and customers start onboarding onto the platform.</p><br /><p>The business is presently pre-seed, pre-revenue, pre-MVP.</p><br /><p><strong>Skills required</strong></p><br /><p>Polyglot hands-on co-founder needed.</p><br /><p>Key skills include:</p><br /><p>- Willingness to learn new languages and provide client-side interop with a variety of languages<br />- Any of Ruby, Python, JavaScript, Java, .NET / C#, Dart, Golang</p><br /><p>Key backend skills are:</p><br /><p>- Golang<br />- JSON Web Token<br />- Redis<br />- MongoDB<br />- Cloud automation on GCP or AWS working to cost-efficiency</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "WxTyoFs6QpuKLvvi_XKxRQ",
    "url": "http://workinstartups.com/job-board/job/91852/cto-and-co-founder-fully-remote-at-grexie/",
    "title": "CTO and Co-founder (Fully Remote)",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(you,we,employe,develop,engin,abl,workmat) 2W work 2W from 2W home",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:k/t/w:golang/go/16",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=13, c=2, mobile=1, go=16, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet",
      "go"
    ],
    "hiringOrganization": {
      "name": "Grexie",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 10, 2020 8:27:42 AM",
    "validThrough": "May 17, 2020 8:27:42 AM",
    "crawled": "May 10, 2020 3:05:22 PM",
    "content": "<p><strong>About the company</strong></p><br /><p>Grexie is establishing a new platform for PubSub, low-latency messaging between peers on a network. In-browser and server-side deployments in a plethora of languages provides clients the ability to pick and choose their environment to best meet their application.</p><br /><p>Customers can create real time apps using Grexie, including but not limited to Uber-style applications, digital charting dashboards, real time multiplayer games, secure chat clients, and anything that requires real time messaging using a cutting edge PubSub broker.</p><br /><p><strong>About the role</strong></p><br /><p>Joining as a co-founder you will be given a substantial equity stake in the new business.</p><br /><p>You will be partnering with the other co-founders in the business to build the MVP client-side libraries and server-side backend code. This is a work-from-home business, you will work from home indefinately and join the team on Skype conference calls on a daily basis at a to-be-agreed time. The CEO is technical with a wide skillset and startup experience, and so you will be working with them on these new projects.</p><br /><p>On growth, you will establish a team of world-class engineers, taking responsibility for the entire tech domain. On investment, you will be given a substantial budget to grow the business' tech stack and establish Grexie as the leader in PubSub communications.</p><br /><p>The role is unpaid and equity based for now but you can expect the co-founders to push for &pound;100k salaries from the investors once the MVP is complete and customers start onboarding onto the platform.</p><br /><p>The business is presently pre-seed, pre-revenue, pre-MVP.</p><br /><p><strong>Skills required</strong></p><br /><p>Polyglot hands-on co-founder needed.</p><br /><p>Key skills include:</p><br /><p>- Willingness to learn new languages and provide client-side interop with a variety of languages<br />- Any of Ruby, Python, JavaScript, Java, .NET / C#, Dart, Golang</p><br /><p>Key backend skills are:</p><br /><p>- Golang<br />- JSON Web Token<br />- Redis<br />- MongoDB<br />- Cloud automation on GCP or AWS working to cost-efficiency</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "JaJkZ08JR-ywirVxxOIVOA",
    "url": "http://workinstartups.com/job-board/job/91824/business-financial-co-founder-at-trika/",
    "title": "Business / Financial Co-Founder",
    "tags": [
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Trika",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 8, 2020 12:54:01 PM",
    "validThrough": "May 15, 2020 12:54:01 PM",
    "crawled": "May 8, 2020 2:05:21 PM",
    "content": "<p class=&quot;p1&quot;><span class=&quot;s1&quot;>Trika is an online community and marketplace for health and wellness, a 'complete ecosystem for well-being'.&nbsp;</span></p><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;>The vision has been crafted, the MVP has been designed, the team are rearing to go and the first golden drops of investment are about to hit the Trika Ltd. bank account. It is certainly an exciting time to be getting involved in this wonderful project.&nbsp;</span></p><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;>More information about Trika can be found here (the deck we have used for our seed investment round):</span></p><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;><a href='https://www.beautiful.ai/player/-M65baOb0YpoRxH8RmAB'>https://www.beautiful.ai/player/-M65baOb0YpoRxH8RmAB</a></span></p><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;><strong>The Role</strong></span></p><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;>As a business co-founder of Trika, you will have the opportunity to make a huge difference to the project and its success. You will therefore be justly rewarded. </span></p><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;>This is a part-time role, and compatible with remote working. You will be free to work from wherever you like, within a reasonable time difference of the UK.</span></p><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;>You will work closely with the CEO to perform a range key business and financial functions which include (but are not limited to): </span></p><br /><ul><br /><li class=&quot;p1&quot;><span class=&quot;s1&quot;>Financial business modelling</span></li><br /><li class=&quot;p1&quot;><span class=&quot;s1&quot;>Grant and impact investment proposals</span></li><br /><li class=&quot;p1&quot;><span class=&quot;s1&quot;>Contract management and negotiation (alongside CEO)</span></li><br /><li class=&quot;p1&quot;><span class=&quot;s1&quot;>Board member (after initial trial period proves successful)</span></li><br /><li class=&quot;p1&quot;><span class=&quot;s1&quot;>Business strategy</span></li><br /><li class=&quot;p1&quot;><span class=&quot;s1&quot;>Some fundraising</span></li><br /><li class=&quot;p1&quot;><span class=&quot;s1&quot;>Managing the cap-table</span></li><br /><li class=&quot;p1&quot;><span class=&quot;s1&quot;>Some company secretarial</span></li><br /><li class=&quot;p1&quot;><span class=&quot;s1&quot;>Investor reporting</span></li><br /><li class=&quot;p1&quot;><span class=&quot;s1&quot;>Financial management </span></li><br /><li class=&quot;p1&quot;><span class=&quot;s1&quot;>Corporate governance</span></li><br /></ul><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;><strong>Your qualities</strong></span></p><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;>You probably graduated from a leading university. Chances are you&rsquo;ve worked for a top consulting firm, IB, VC, PE or in the startup ecosystem in a senior role. You will have bags of experience, and a track record of success. </span></p><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;>It would be great if, despite all these great achievements, you also had a modicum of humility, and even better if you are actually a nice person. You enjoy what you do and you do it with joy and enthusiasm. You don't need to be supervised like an overgrown teenager.&nbsp;</span></p><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;>If you&rsquo;re the girl (or guy) that wants to nail down the package before even demonstrating value, this isn&rsquo;t going to be the fit for you. The CEO has never met anyone who didn&rsquo;t under-deliver from this starting point. Your negotiation with Trika must not be your finest hour!&nbsp;</span></p><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;>Investor contacts are a bonus, but not essential. Being open-minded and open-hearted is essential. Life is too short!&nbsp;</span><span class=&quot;s1&quot;>You will more likely have a yoga habit than a pub habit. </span></p><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;>If you think the vision and culture of Trika would be a great fit for you, we&rsquo;d love to hear from you. </span></p><br /><p class=&quot;p1&quot;><span class=&quot;s1&quot;>Trika - Live Your Best Life</span></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "K_1wMvtaSUeuzggCzp9SUA",
    "url": "https://stackoverflow.com/jobs/390880/backend-developer-dolfin?a=275we69bCa40&so_medium=Talent&so_source=TalentApi",
    "title": "Backend Developer at Dolfin (Amsterdam, Netherlands) ",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:golang/go/16",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:python/python/6",
      "DBG_TECH1:k/t/w:reactjs/frontend/24",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=6, other=0, dotnet=0, c=8, mobile=1, go=19, nodejs=14, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=25}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "frontend",
      "go"
    ],
    "hiringOrganization": {
      "name": "Dolfin – Amsterdam, Netherlands",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 7, 2020 12:05:12 PM",
    "validThrough": "May 14, 2020 12:05:12 PM",
    "crawled": "May 7, 2020 12:05:12 PM",
    "content": "<h3><span>Backend Developer</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Junior, Mid-Level, Senior</span>                                </div>                                <div>                                    <span>Role: </span>                                    <span>Backend Developer</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Industry: </span>                                    <span>Financial Technology</span>                                </div>                                <div>                                    <span>Company size: </span>                                    <span>11–50 people</span>                                </div>                        </div>                </div>            <div>Company: Dolfin – Amsterdam, Netherlands<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT+01:00) Amsterdam +/- 8 hours</span>                            </div>                                                    <div>                                <span>Office Location:</span>                                <span>Amsterdam, Netherlands.</span>                                    <span>Employees can also work full time from this office.</span>                            </div>                                                    <div>                                <span>Visa Sponsorship:</span>                                <span>Yes</span>                            </div>                                                    <div>                                <span>Relocation Assistance:</span>                                <span>Yes</span>                            </div>                    </div>                </div>            <h4>Technologies</h4><div>python</div><div>reactjs</div><div>amazon-web-services</div>            <h4>Job description</h4>            <div><p><strong>Backend Developer</strong></p><p><em>at Dolfin, Amsterdam</em></p><p><br>We’re looking for a passionate backend developer with 2+ years of experience to join our development team in Amsterdam.</p><p>Dolfin is a UK financial group that provides world-class custody, brokerage and asset management to private clients, their financial advisers and institutional investors. Our Amsterdam team works on different projects: customer relationship management system, investments platform, and various investment tools and client applications. We use mature and diverse IT-infrastructure and work with modern technological stack including React, Redux, Typescript, NodeJS on the frontend side and Golang/Python with PostgreSQL under Kubernetes management with a bunch of AWS services on the backend side. We strive to make our development process predictable, change proof and well-organized to achieve the fastest possible product delivery pace. That's why we invest a lot in the development of a diverse set of internal tools such as code generators, CLI tools, build process automation tools, and homegrown Domain Specific Languages</p><p>If you are passionate about your work, experimental, love to challenge yourself and learn something new, then you might be a good fit for our team of open-minded, innovative developers!</p><p><strong>You should apply if you:</strong><br>Have 2+ years of experience as a back-end engineer;<br>Able to effectively work with Golang or Python or C++ or Java and infrastructure around any of them;<br>Care about writing simple, efficient and quality code;<br>Not afraid of taking full ownership of your projects and lead them till completion;<br>A huge plus is your interest in DevOps: we use bazel, helm, AWS CDK to build and deploy our projects and infrastructure. Everything is up and running under K8s on AWS.</p><p><strong>What we offer:</strong><br>Modern technological stack, without legacy codebase or outdated libraries/frameworks;<br>Challenging projects with enough possibilities for personal development;<br> Freedom to do what you do best;<br>Flexible work schedule;<br>Top-notch work equipment;<br>Relocation to Amsterdam (if needed); <br>Above market rate salary.</p><p><strong>Interested?</strong><br>Please apply below! If you like the sound of this role, but are not totally sure whether you’re the right person, do apply anyway :)</p>            </div>        <div>            <a href='https://stackoverflow.com/jobs/apply/390880?reset=False&amp;ra=275we69bCa40&amp;oqs=a%3D275we69bCa40%26so_medium%3DTalent%26so_source%3DTalentApi' rel='nofollow'>                                <span>Easy apply</span>            </a>                            </div>            <h4>About Dolfin</h4>            <div><ul><li>Great environment to grow your hard skills</li><li>Team has very good qualifications</li><li>Many team members have 10+ years of professional experience</li><li>Minimal meetings, extensive communication via Slack, remote ready</li><li>Ready to help each other with any problem</li></ul>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Modern tech stack (Go, AWS, Kubernetes, React)</span>                            </li>                            <li>                                <span></span>                                <span>Highly automated solutions (Bazel builds system, code generation)</span>                            </li>                            <li>                                <span></span>                                <span>Experienced and highly skilled team</span>                            </li>                            <li>                                <span></span>                                <span>Established business</span>                            </li>                            <li>                                <span></span>                                <span>Well-formulated tasks</span>                            </li>                            <li>                                <span></span>                                <span>Great work environment</span>                            </li>                            <li>                                <span></span>                                <span>Opportunity to live and work in cozy Amsterdam.</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "jLrwV_whT4OoOSU_bMAGKA",
    "url": "https://remote.co/job/backend-python-engineer/",
    "title": "Backend Python Engineer",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:python-developer/python/13",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=15, other=0, dotnet=0, c=0, mobile=0, go=11, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "go",
      "python"
    ],
    "hiringOrganization": {
      "name": "Moat - Oracle",
      "sameAs": "https://moat.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 5, 2020 4:03:43 PM",
    "validThrough": "May 12, 2020 4:03:43 PM",
    "crawled": "May 5, 2020 4:06:13 PM",
    "content": "<div><span><i></i> Remote</span>        </div><div>            <p><strong>About Moat</strong></p><p>We are a New York City-based division of Oracle with a mission to help the world’s top publishers and marketers make smarter advertising decisions through measurement. We help clients measure consumer attention, fight fraudulent internet traffic, and improve their websites, all while promoting privacy-friendly models of advertising. Our analytics software is used by</p><p>CNN, Condé Nast, Kellogg’s, Spotify, and hundreds of other major platforms and advertisers, and we have unique measurement integrations with Facebook, Instagram, Twitter, Snapchat, and YouTube.</p><p><strong>About the Opportunity</strong></p><p>As a backend engineer at Moat, you would be responsible for developing and maintaining the backend systems that power all of the various methods of data delivery and management that are supplied to both internal and external clients.</p><p>You would be an integral part of the team that owns the backend systems as well as the monitoring and alerting tools that keep them running smoothly. These systems manage huge datasets that grow daily as they aggregate billions of events delivered by the Data Pipeline team.</p><p>You will strike a balance between writing code, deploying and maintaining services, making architecture decisions, mentoring and supporting other team members and reviewing their work.</p><p>You will be responsible for delivering on engineering goals, ensuring reliability and quality in the products you release, and working cross-functionally with other engineering and product teams.</p><p><strong>About You</strong></p><ul><li>6+ years software development experience</li><li>Python or Golang (aka Go) experience</li><li>AWS, Google Cloud Platform (GCP), Azure, or similar cloud experience</li><li>Linux or Unix environment experience</li><li>Proven track record of accomplishing technical goals that provide a visible impact on the product / business</li></ul><p><strong>Detailed Description and Job Requirements</strong></p><p>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.</p><p>As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.</p><p>Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.</p><p>Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law.</p><ul><li>Job:&nbsp;Product Development</li><li>Travel:&nbsp;No</li><li>Location:&nbsp;United States</li><li>Job Type:&nbsp;Regular Employee Hire</li><li>Organization:&nbsp;Oracle</li></ul>        </div><div>        <a href='https://oracle.taleo.net/careersection/2/jobdetail.ftl?job=20000B55' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "_lZHOx5wROeOxp5_PjZsLg",
    "url": "https://news.ycombinator.com/item?id=23077421",
    "title": "SO1 | Onsite (or remote onboarding) (Berlin, Germany)| Full-time | https://www.so1.ai/ SO1 is ...",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=8, nodejs=0, bigdata-ml=4, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 5, 2020 9:28:14 AM",
    "validThrough": "May 12, 2020 9:28:14 AM",
    "crawled": "May 5, 2020 11:05:56 AM",
    "content": "SO1 | Onsite (or remote onboarding) (Berlin, Germany)| Full-time | <a href='https://www.so1.ai/' rel='nofollow'>https://www.so1.ai/</a><p>SO1 is building AdTech solutions to hyper-personalize retail experiences at scale. Our AI core deeply understands every individual customer's shopping behavior and improves their experience just from recent shopping data. Our technology is already being implemented by several major FMCG retailers across Europe and the US and we are continuously scaling up.</p><p>We are looking for:</p><p>* Senior Machine Learning Engineers <a href='https://www.so1.ai/join-us/#op-387037-senior-machine-learning-engineer-mfx' rel='nofollow'>https://www.so1.ai/join-us/#op-387037-senior-machine-learnin...</a></p><p>* Senior DevOps Engineers <a href='https://www.so1.ai/join-us/#op-381527-senior-devops-engineer-mfx-' rel='nofollow'>https://www.so1.ai/join-us/#op-381527-senior-devops-engineer...</a></p><p>* Data Engineers <a href='https://www.so1.ai/join-us/#op-387040-data-engineer-mfx' rel='nofollow'>https://www.so1.ai/join-us/#op-387040-data-engineer-mfx</a></p><p>* Senior Product Managers <a href='https://www.so1.ai/join-us/#op-382115-senior-product-manager-mfx' rel='nofollow'>https://www.so1.ai/join-us/#op-382115-senior-product-manager...</a></p><p>Techstack: Python, Golang, Docker, Kubernetes, Azure, Terraform, Spark, Argo</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "AG6TiFdwQpGbY61Iw4-YsA",
    "url": "https://jobmote.com/job/4938109/earn-up-to-80-a-day-completing-simple-surveys-immediate-start-denver-co/",
    "title": "Earn up to $80 a Day Completing Simple Surveys - Immediate start (Denver, CO)",
    "tags": [
      "DBG:surround``work 2W from 2W home 3W OR(whenev,wherev,agil)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "InboxDollars",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 300,
      "maxValue": 3000,
      "info": "",
      "unit": "MONTH",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": "USD 300 - 3000 /Month"
    },
    "employmentType": "UNSET",
    "published": "May 4, 2020 7:45:27 PM",
    "validThrough": "May 7, 2020 7:45:27 PM",
    "crawled": "May 4, 2020 8:05:13 PM",
    "content": "<div><ul><li><p><strong><span><b>Immediate Start. No Joining Fee. Work from Home/ Remote Job.</b></span></strong></p><p><strong><span><b>Join Today &amp; Receive $5! (Offer Only Available until Tomorrow)</b></span></strong></p><p></p><p><span>InboxDollars pays members to </span><strong><span><b>read emails, take surveys online, play games, and go shopping! </b></span></strong><span>New users also </span><strong><span><b>receive $5 just for joining.</b></span></strong></p><p></p><p>We are currently looking for members to start working online and from home - flexible hours. All you need is a smartphone, tablet or laptop to get involved.</p><p></p><p><span>InboxDollars could help you </span><strong><span><b>earn up to $80 a day </b></span></strong><strong><span>t</span></strong><span>o</span><span> put towards whatever you like by completing Competitions, Offers, Games and Surveys from some of the UK’s top brands.</span></p><p></p><ul><li><p>Earn up to $80 a day</p></li><li><p>Payments via BACS or PayPal</p></li><li><p>Work from home</p></li><li><p>Immediate start</p></li></ul><p></p><p>You could earn up to $80 a day for completing simple tasks. Flexible working means you can be your own boss and work from home whenever you like.</p><p></p><p><strong><span><b>Suitable for full-time, part-time, evening and weekend workers or anyone looking for temporary income. </b></span></strong><span>No matter what your role, no previous experience is required to earn money for completing online tasks.</span></p><p><em><span>The amount of money you can earn depends on the offers you choose to complete.</span></em></p><p><strong><span><b></b></span></strong></p><p><strong><span><b>Click Apply Now to get started!</b></span></strong></p></li></ul><p><span><strong></strong></span></p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "2_ux1dVXSxqbWWGIl-NdPQ",
    "url": "https://news.ycombinator.com/item?id=23064361",
    "title": "Cookie.AI | Remote | Full time Cookie.AI, Inc. is a stealth startup based in the Silicon Valley ...",
    "tags": [
      "DBG:surround``4N( OR(look, search),     4N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=8, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 4, 2020 5:46:43 AM",
    "validThrough": "May 11, 2020 5:46:43 AM",
    "crawled": "May 4, 2020 6:06:07 AM",
    "content": "Cookie.AI | Remote | Full time<p>Cookie.AI, Inc. is a stealth startup based in the Silicon Valley / Bay Area. We are building a SaaS- based data security platform for the dynamic world of cybersecurity. We are well-funded and backed by top-tier VCs and CEOs as our angel investors. The founders and early team have very strong entrepreneurial experiences in the full 0-to-1 journey, late stage startups, and big companies. We are looking for our early engineers (backend system engineers, distributed systems, DevOps engineers, and UI/UX engineers) with strong interests in machine learning / security / SaaS. You will play a critical role in building products that customers will love and gain hands-on experience with cutting-edge technologies (Presto, Kafka, Golang, Docker, K8s, etc.) and many others from the open-source world. We are looking for characteristics such as ambition, commitment to build a company, passion to build products, and intellectual curiosity to innovate!  Please reach out: hello AT cookie.ai</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "myFNtjilQlittNPPHGz2Yw",
    "url": "https://stackoverflow.com/jobs/389737/senior-backend-developer-interested-in-wikifactory?a=26HKIBhVs40w&so_medium=Talent&so_source=TalentApi",
    "title": "Senior Backend Developer interested in collaborative hardware development at Wikifactory  ",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:flask/python/8",
      "DBG_TECH1:k/t/w:golang/go/16",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:python/python/6",
      "DBG_TECH1:k/t/w:sqlalchemy/python/8",
      "DBG_TECH1:techWeightMap:{python=22, other=0, dotnet=0, c=0, mobile=0, go=16, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go",
      "python"
    ],
    "hiringOrganization": {
      "name": "Wikifactory – No office location",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "EUR",
      "minValue": 45000,
      "maxValue": 65000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "EUR 45k - 65k /Year"
    },
    "employmentType": "UNSET",
    "published": "May 2, 2020 9:05:14 PM",
    "validThrough": "May 9, 2020 9:05:14 PM",
    "crawled": "May 2, 2020 9:05:14 PM",
    "content": "<h3><span>Senior Backend Developer interested in collaborative hardware development</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Senior</span>                                </div>                                <div>                                    <span>Role: </span>                                    <span>Backend Developer, DevOps</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Industry: </span>                                    <span>3D Models, 3D Printing, Software Development / Engineering</span>                                </div>                                <div>                                    <span>Company size: </span>                                    <span>11–50 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>Private</span>                                </div>                        </div>                </div>            <div>Company: Wikifactory – No office location<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT+01:00) Madrid </span>                            </div>                                                                                            </div>                </div>            <h4>Technologies</h4><div>python</div><div>flask-sqlalchemy</div><div>postgresql</div><div>amazon-web-services</div><div>ansible</div>            <h4>Job description</h4>            <div><p>Would you like to join a fast-growing international startup and shape the future of how products are designed, prototyped and manufactured?</p><p>Wikifactory is the world’s first social platform for collaborative product development which enables teams to design together, prototype faster, and manufacture smarter. Inspired by the workflows of agile and open source software development, we are building the tools to accelerate the development of (physical) products. Our community includes designers, engineers, makers, technologists, teachers, students and other creative problem solvers. Covering industries, including robotics and drones, electric vehicles, 3d printers, biotech, agri-tech, and smart furniture, our community spread across 130 countries and has published over 1000 open source hardware design projects on the platform.</p><p>Headquartered in Hong Kong with offices in Madrid and Shenzhen, Wikifactory is on a mission to connect the productive capacity of smart manufacturing with the creative potential of people through open standards and intuitive interfaces - an &quot;Internet of Production&quot;.</p><p><strong>The Role</strong></p><p>You will be playing a lead role in managing and improving our backend infrastructure (currently AWS centric), maintaining and improving our existing backend applications in Python and Golang. You will be responsible for developing new capabilities to enable our users to work together more effectively on improving product designs and specifications as well as manufacture the products they design together.</p><p><strong>Qualifications</strong></p><ul><li>Minimum 3 years strong experience building applications in Python and/or Golang.</li><li>Strong computer science knowledge (University not required)</li><li>Knowledge of linux system administration</li><li>AWS or similar cloud computing environment</li><li>Ansible or similar deployment automation tools</li><li>A fascination with digital fabrication technologies or interest in hardware development</li><li>Strong command of English is required</li></ul><p><strong>Nice-to-Haves</strong></p><p>Experience with:</p><ul><li>Documenting, releasing and maintaining open source libraries</li><li>SQLAlchemy, Flask, GraphQL</li><li>JavaScript/ES6</li><li>PostgresSQL, Dgraph</li></ul><p>Interest or Skills in:</p><ul><li>3D rendering and 3D application development</li><li>Robotics, CNC, g-code, etc.</li><li>Security best practices for web and mobile</li></ul>            </div>        <div>            <a href='https://stackoverflow.com/jobs/apply/389737?reset=False&amp;ra=26HKIBhVs40w&amp;oqs=a%3D26HKIBhVs40w%26so_medium%3DTalent%26so_source%3DTalentApi' rel='nofollow'>                                <span>Easy apply</span>            </a>                            </div>            <h4>About Wikifactory</h4>            <div><p>The products we use every day are ever more ingenious and complex. Yet today's product developers rely on decades old collaboration tools which are no longer fit for purpose. At Wikifactory we are building the tools to help people&nbsp;<em>develop better products together</em>.</p><p>We're a small international team with a culture of openness, experimentation, and ambitious pragmatism. We're always looking for opportunities to hire people who are better than us at what they do. We're eager learners who like to keep an attitude of intellectual humility.</p><p>If you're excited about building the tools to empower the next generation of product developers, you'll fit right in. Come join us and help build a company accelerating the next industrial revolution!</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Flexible working schedule</span>                            </li>                            <li>                                <span></span>                                <span>Great Work Life Balance</span>                            </li>                            <li>                                <span></span>                                <span>Awesome Team Atmosphere even remotely</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "TnEA99oURoiksAhq9iZxng",
    "url": "https://news.ycombinator.com/item?id=23046755",
    "title": "Opslock | Senior Backend Engineer | Full-Time | Onsite or Remote | https://opslock.com At ...",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:k/t/w:rust/other/5",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=0, go=6, nodejs=1, bigdata-ml=2, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 1, 2020 11:34:33 PM",
    "validThrough": "May 8, 2020 11:34:33 PM",
    "crawled": "May 2, 2020 12:06:02 AM",
    "content": "Opslock | Senior Backend Engineer | Full-Time | Onsite or Remote | <a href='https://opslock.com' rel='nofollow'>https://opslock.com</a><p>At Opslock we build tools to save lives at work. Workplace incidents have a massive impact on our communities and our economy, causing environmental disasters, production losses, and over 6000 lives lost annually in North America alone. Beyond devastating families, this represents a burden of &gt;3BN dollars WEEKLY.</p><p>We're empowering employers to proactively avoid disasters by revolutionizing the way activities are planned, monitored, and controlled. Our hardened platform allows even the harshest and most remote operations to go completely paperless, ensures OSHA compliance, while machine-learning and predictive analytics get the right information to employees at the right time - enabling smarter, safer operations.</p><p>We're currently looking for Senior Backend Engineers experienced in Event Driven Design to help us scale.</p><p>Backend: Go, Rust, Typescript, GraphQL Endpoint, MongoDB</p><p>To apply, email bryan@opslock.com</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3whRI2S2TRWBzpTymIpSlQ",
    "url": "https://news.ycombinator.com/item?id=23045819",
    "title": "strongDM | All Roles! Go / Golang | FULL REMOTE (core hours ~US timezones, any latitude) | Full ...",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``usa 3W OR(time,timezon)",
      "DBG_TECH1:k/t/w:go/go/12",
      "DBG_TECH1:k/t/w:golang/go/24",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=36, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 1, 2020 9:47:57 PM",
    "validThrough": "May 8, 2020 9:47:57 PM",
    "crawled": "May 1, 2020 11:06:01 PM",
    "content": "strongDM | All Roles! Go / Golang | FULL REMOTE (core hours ~US timezones, any latitude) | Full-time | <a href='https://www.strongdm.com' rel='nofollow'>https://www.strongdm.com</a><p>--------</p><p>May 2020 update: because we build remote access software, we're seeing a surge of teams everywhere go remote -- we could definitely use your help!</p><p>--------</p><p>strongDM is an identity-aware proxy for managing and auditing access to databases, k8s, and other servers. We build secure, high-throughput networking systems in Go.</p><p>We're a fully remote (UTC -4 to -7), building software to help people work remotely. We have high standards and high levels of respect for each other and our customers.</p><p>Current roles:</p><p>* Senior Software Engineer (Golang, distributed systems)</p><p>* Lead Engineer / Engineering Manager</p><p>* Product Manager</p><p>* Technical Writer</p><p>* Front End Developer</p><p>If this sounds like the type of work and the type of environment that would suit you, send me (Justin, co-founder &amp; CTO) a note at justin@strongdm.com</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "GbWdecB_QkuNeSW91AJjhQ",
    "url": "https://news.ycombinator.com/item?id=23046036",
    "title": "Clerk | Software Engineer | Remote or onsite in SF | Full-time Clerk is building an API for ...",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=8, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=9}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 1, 2020 10:11:33 PM",
    "validThrough": "May 8, 2020 10:11:33 PM",
    "crawled": "May 1, 2020 11:06:01 PM",
    "content": "Clerk | Software Engineer | Remote or onsite in SF | Full-time<p>Clerk is building an API for user and team management.  We give developers drop-in UIs for sign up, sign in, profile management, team onboarding &amp; management.</p><p>You will be joining two technical founders as the first employee, helping us launch in the next few months.</p><p>Ideally, you're comfortable developing anywhere in the stack, and have a strong eye for speed and reliability.  Knowledge of our stack isn't strictly required, but we use:</p><p></p><pre><code>  - Typescript and React for our UIs  - Golang for our APIs</code></pre>Please email colin@clerk.dev if you're interested.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "n1-61SvwRjmGj1yyZY4KeA",
    "url": "https://news.ycombinator.com/item?id=23044506",
    "title": "Percona | Remote (Worldwide) | Full-Time | https://www.percona.com/ Percona is a leader in ...",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=8, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 1, 2020 7:35:30 PM",
    "validThrough": "May 8, 2020 7:35:30 PM",
    "crawled": "May 1, 2020 8:06:04 PM",
    "content": "Percona |  Remote (Worldwide) | Full-Time | <a href='https://www.percona.com/' rel='nofollow'>https://www.percona.com/</a><p>Percona is a leader in providing best-of-breed enterprise-class support, consulting, managed services, training and software for MySQL®, MariaDB®, MongoDB®, PostgreSQL® and other open source databases in on-premises and cloud environments.</p><p>We are looking for a Golang Developer who knows how open source databases should run in Kubernetes and who can help us to build high availability clusters</p><p>Apply here: <a href='https://www.percona.com/about-percona/careers/golang-software-engineer-remote' rel='nofollow'>https://www.percona.com/about-percona/careers/golang-softwar...</a></p><p>Also Database Engineers are very welcome to join our team!Jobs here: <a href='https://www.percona.com/about-percona/careers' rel='nofollow'>https://www.percona.com/about-percona/careers</a></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "mk6f4AW1T_6arJsU544xOg",
    "url": "https://news.ycombinator.com/item?id=23043494",
    "title": "HomeVision | Frontend, Backend, Data Science/ML | REMOTE Only | https://homevision.co Hiring: ...",
    "tags": [
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/4",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/16",
      "DBG_TECH1:k/t/w:golang/go/16",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:k/t/w:typescript/frontend/2",
      "DBG_TECH1:k/t/w:typescript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=16, nodejs=2, bigdata-ml=20, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=18}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "frontend",
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 1, 2020 6:07:46 PM",
    "validThrough": "May 8, 2020 6:07:46 PM",
    "crawled": "May 1, 2020 8:06:04 PM",
    "content": "HomeVision | Frontend, Backend, Data Science/ML | REMOTE Only | <a href='https://homevision.co' rel='nofollow'>https://homevision.co</a><p>Hiring: full-stack engineers. We work on a &quot;GReaT&quot; stack - Golang on the backend, React/Typescript on the frontend. Remote only.</p><p>HomeVision is developing next-generation tools and technology for the real estate appraisals industry. We're obsessively focused on building a platform that will speed delivery of home valuations to the broader financial markets.</p><p>Backed by Initialized Capital, we're looking to add talented engineers to our founding team.</p><p>Email: jobs@homevision.co</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "EXW02zRcT7i2Y2DfwoiniQ",
    "url": "https://news.ycombinator.com/item?id=23042698",
    "title": "Linden Lab (Tilia) | Backend Software Developer (Golang) | Full-time | Remote in CA, CO, FL, GA ...",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:golang/go/24",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=24, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "May 1, 2020 5:07:22 PM",
    "validThrough": "May 8, 2020 5:07:22 PM",
    "crawled": "May 1, 2020 6:06:13 PM",
    "content": "Linden Lab (Tilia) | Backend Software Developer (Golang) | Full-time | Remote in CA, CO, FL, GA, MA, NH, TX, VA, WATilia is an emerging FinTech company that makes it possible for game companies to pay content creators for their game content. We are a small team of hard workers solving hard problems. We value work-life balance, have great senses of humor, trust each other, and embrace the habit of continual improvement.<p>We're looking for someone who shares those values and who is already productive in Golang.</p><p><a href='https://hire.withgoogle.com/public/jobs/lindenlabcom/view/P_AAAAAAHAACnMU3BmZ95DEM' rel='nofollow'>https://hire.withgoogle.com/public/jobs/lindenlabcom/view/P_...</a></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "upERUGMhTMu1FHQiyRc7Cg",
    "url": "https://remote.co/job/go-software-engineer/",
    "title": "Go Software Engineer",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go-developer/go/13",
      "DBG_TECH1:k/t/w:go/go/9",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=22, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "ScyllaDB",
      "sameAs": "https://www.scylladb.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 29, 2020 2:49:55 PM",
    "validThrough": "May 6, 2020 2:49:55 PM",
    "crawled": "Apr 29, 2020 3:06:07 PM",
    "content": "<div><span><i></i> Remote</span>         | <span> International </span></div><div>            <p>Israel<strong>&nbsp;or Remote</strong></p><p><strong>About The Position</strong></p><p>Join the team that is building Scylla Manager, the cluster operations automation tool for Scylla, and Scylla Cloud, our Database-as-a-Service (DBaaS) offering. Our mission is to make Scylla the #1 open source NoSQL database. To do so, we need leaders with strong engineering skills, deep technical knowledge, a personal commitment to Open Source principles, and a passion for customer and user success.</p><p>Your personal mission is to make our database as easy, boring, and fun to manage as possible! (i.e., remove roadblocks, cure headaches, add a little charm, and obliterate needless complexity and tediousness.)</p><p>You will be implementing new features of Scylla Manager to handle cluster maintenance operations (such as repairs, backups and recoveries) for our Open Source users and Enterprise clients as well as users of Scylla Cloud.</p><p>You will also be working on enhancements and bug fixes to the Scylla/Cassandra Go driver and its extension.</p><p>Beyond coding you will work with clients, supporting them with deployment and usage of Scylla Manager as well as the Go driver, its extension and other libraries that we own.</p><p><strong>Requirements</strong></p><ul><li>Experience of at least 1 year’ development using Go</li><li>Experience writing high-performance and concurrent applications</li><li>Experience in Open Source development is an advantage</li></ul>        </div><div>        <a href='https://www.scylladb.com/company/careers/co/engineering/81.21B/go-software-engineer/all/' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "EWGJqzX2SOe_SLhOt392WA",
    "url": "http://workinstartups.com/job-board/job/91562/digital-conference-specialist-remote-furloughteering-role-at-free-uk-genealogy-cio/",
    "title": "Digital Conference Specialist (Remote Furloughteering Role)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Free UK Genealogy CIO",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 29, 2020 12:57:05 PM",
    "validThrough": "May 6, 2020 12:57:05 PM",
    "crawled": "Apr 29, 2020 2:05:22 PM",
    "content": "<p>We hold an annual physical Conference in Autumn, but this year (pre-CV19) we decided to 'go global' and hold a virtual conference. Being entirely volunteer-led with a tiny support staff, we're seeking the help of a furlunteer with experience of planning and setting up digital conferences. We communicate over email/Slack and use Google apps for collaborating on documents and online Meets (usually weekly).</p><br /><p><em>Free UK Genealogy is an Open Source, Open Data charity supporting free access to historical records for family historians and others.&nbsp; We run www.freebmd.org.uk, www.freecen.org.uk, and www.freereg.org.uk, and support Open Genealogy for all.&nbsp; We're a lean organization, with no offices, and a staff to volunteer ratio of 1:1000.</em></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "eQXAigmcT7yn19byd75f2Q",
    "url": "https://stackoverflow.com/jobs/371619/software-architect-database-and-storage-ockam?a=20D1KmLgnwaI&so_medium=Talent&so_source=TalentApi",
    "title": "Software Architect - Database And Storage Infrastructure at Ockam (San Francisco, CA) ",
    "tags": [
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 3W OR(time,timezon)",
      "DBG:surround``remot 16W timezon",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 9W 4N( OR(offic,onsit), time)",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=14, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Ockam – San Francisco, CA",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 125000,
      "maxValue": 175000,
      "info": "Equity",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "USD 125k - 175k /Year | Equity"
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2020 3:05:12 PM",
    "validThrough": "May 5, 2020 3:05:12 PM",
    "crawled": "Apr 28, 2020 3:05:12 PM",
    "content": "<h3><span>Software Architect - Database And Storage Infrastructure</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Senior, Lead</span>                                </div>                                <div>                                    <span>Industry: </span>                                    <span>Cybersecurity, Developer APIs, Software Development / Engineering</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Company size: </span>                                    <span>1–10 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>VC Funded</span>                                </div>                        </div>                </div>            <div>Company: Ockam – San Francisco, CA<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT-08:00) Pacific Time +/- 4 hours</span>                            </div>                                                    <div>                                <span>Office Location:</span>                                <span>San Francisco, CA.</span>                                    <span>Employees can also work full time from this office.</span>                            </div>                                                                    </div>                </div>            <h4>Technologies</h4><div>amazon-web-services</div><div>graphql</div><div>go</div><div>database</div><div>blockchain</div>            <h4>Job description</h4>            <div><p>Your experiences building distributed systems, consensus protocols, graph databases, and GraphQL API design will be challenged in this role!</p><p>You will take responsibility for the&nbsp;<a href='https://www.ockam.io/product/registry' rel='nofollow'>Ockam Registry service</a>. The Ockam Registry is the data store for Decentralized IDs (DIDs), and verifiable credentials for Ockam Networks.&nbsp; You will build core components in the Ockam data layer and also build the tools that provision cloud instances of the Ockam Registry as a service.&nbsp;</p><p>Ockam is a small and extremely senior team. This role involves architecture, interface design, writing code, responsibility for testing, and publishing documentation. Everyone on the Ockam team takes responsibility for their parts from end-to-end, including the creation of long term objectives, issues in GitHub, task management in our Trello boards, and summaries of key results.</p><p><strong>Expertise</strong></p><ul><li>API design</li><li>Building complex code bases in the Go language</li><li>Graph query language (GraphQL)</li><li>Individual and collaborative project management leadership</li><li>Git and GitHub's workflow</li><li>Modern CI/CD pipelines and DevOps</li></ul><p><strong>Experience</strong></p><ul><li>10+ years of experience</li><li>Building with Docker and Kubernetes</li><li>Provisioning and operating cloud services in AWS, Azure or Google Cloud</li><li>Consuming and contributing to open source codebases</li><li>The basics of cryptography and PKI</li><li>Consensus protocolsComfort in switching between multiple programming languages</li></ul><p><strong>Level:</strong></p><ul><li>This is a Level 6-7 role at Ockam.</li><li>Individuals that consider themselves to be Level 5 or 8 are also encouraged to apply.</li><li>For more information about Role Levels at Ockam,&nbsp;<a title=&quot;Guide to Levels at Ockam&quot; href='https://www.ockam.io/learn/guides/engineering_levels/' rel='nofollow'>here is our guide</a>.</li></ul>            </div>        <div>        <a href='https://jobs.lever.co/ockam/b28aed59-6cd3-40b7-8128-b63d4f45ea29/apply' rel='nofollow'>            Apply        </a>                            </div>            <h4>About Ockam</h4>            <div><p>Ockam’s mission is to enable builders of the seamless connected future. We are builders who empower other builders to develop trustful IoT systems with our easy to use tools, methods, and protocols. We are building an open and thriving open source ecosystem to accrue ever increasing functionality for our users. Ockam is growing The Team to accelerate this mission. We are backed by a world class group of venture investors including Future Ventures, Core Ventures Group, Okta Ventures and others.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Remote / distributed team</span>                            </li>                            <li>                                <span></span>                                <span>Health care coverage</span>                            </li>                            <li>                                <span></span>                                <span>401k</span>                            </li>                            <li>                                <span></span>                                <span>High performance team culture</span>                            </li>                            <li>                                <span></span>                                <span>Best in class modern tool stack</span>                            </li>                            <li>                                <span></span>                                <span>Stock options</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "V37V3mVdQsaz-R_8PT0_Qw",
    "url": "https://stackoverflow.com/jobs/334503/senior-big-data-scalability-engineer-remote-us-vividcortex-database?a=1ObhlpSfmdHy&so_medium=Talent&so_source=TalentApi",
    "title": "Senior Big Data Scalability Engineer (Remote US Based) at VividCortex: Database Performance ...",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:golang/go/16",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=5, c=7, mobile=1, go=19, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "VividCortex: Database Performance Monitoring – No office location",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2020 3:05:12 PM",
    "validThrough": "May 5, 2020 3:05:12 PM",
    "crawled": "Apr 28, 2020 3:05:12 PM",
    "content": "<h3><span>Senior Big Data Scalability Engineer (Remote US Based)</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Mid-Level, Senior, Lead</span>                                </div>                                <div>                                    <span>Industry: </span>                                    <span>B2B, Big Data, SaaS</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Company size: </span>                                    <span>51–200 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>Private</span>                                </div>                        </div>                </div>            <div>Company: VividCortex: Database Performance Monitoring – No office location<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT-05:00) Eastern Time +/- 4 hours</span>                            </div>                                                                                            </div>                </div>            <h4>Technologies</h4><div>amazon-web-services</div><div>mysql</div><div>redis</div><div>apache-kafka</div><div>bigdata</div>            <h4>Job description</h4>            <div><strong>*Only candidates residing inside of the United States will be considered for this role*</strong><strong>About VividCortex</strong>Are you excited by designing and developing a high volume, highly available, and highly scalable SaaS product in AWS that supports Fortune 500 companies? Do you love the energy and excitement of being a part of growing and successful startup company? Are you passionate about diving deep into technologies such as microservices/APIs, database design, and data architecture?VividCortex, founded in 2012, is building a world-class company with a mixed discipline team to provide incredible value for our customers. Hundreds of industry leaders like GitHub, SendGrid, Etsy, Yelp, Shopify, and DraftKings rely on VividCortex. Our company’s growth continues to accelerate (#673 Inc. 5000) for yet another year so we need your help.We are extremely customer focused, engaged in building an authentic, low-drama team that is open, candid, sincerely practicing ‘disagree and commit’, constantly learning and improving, and with a focused, get-it-done attitude about our commitments.A successful candidate thrives in a highly collaborative and fast-paced environment. We expect and encourage innovation, responsibility, and accountability from our team members and expect you to make substantial contributions to the architectural and technical direction of both the product and company.<strong>About the Role</strong>VividCortex needs an experienced and senior hands-on data and software engineer who has “been there and done that” to help take our company to the next level. We are designing and building our next-generation system for continuous high volume data storage, analysis, and presentation. You are hands-on and working at the intersection of data, engineering, and product. You are key in defining the strategy and tactics of how we store and process massive amounts of performance metrics and other data we capture from our customers' database servers.Our platform is written in Go and hosted entirely on the AWS cloud. It currently uses Kafka, Redis, and MySQL technologies among others. We are a DevOps organization building a 12-factor microservices application; we practice small, fast cycles of rapid improvement and full exposure to the entire infrastructure, but we don't take anything to extremes.The position offers excellent benefits, a competitive base salary, and the opportunity for equity. Diversity is important to us, and we welcome and encourage applicants from all walks of life and all backgrounds.<p><strong>What You Will Be Doing</strong></p><ul><ul><li>Discover, define, design, document and assist in developing scalable backend storage and robust data pipelines for different types of data streams of both structured and unstructured data in an AWS environment and based on Linux and Golang</li><li>Work with others to define, and propose for approval, a modern data platform design strategy and matching architecture and technology choices to support it, with the goal of providing a highly scalable, economical, observable, and operable data platform for storing and processing very large amounts of data within tight performance tolerances.</li><li>Perform high-level strategy and hands-on infrastructure development for the VividCortex data platform, developing and deploying new data management services in AWS.</li><li>Collaborate with engineering management to drive data systems design, deployment strategies, scalability, infrastructure efficiency, monitoring, and security.</li><li>Write code, tests, and deployment manifests and artifacts.</li><li>Work with CircleCI and GitHub in a Linux environment.</li><li>Issue pull requests, create issues, and participate in code reviews and approval.</li><li>Continually seek to understand, measure, and improve performance, reliability, resilience, scalability, and automation of the system. Our goal is that systems should scale linearly with customer growth, and the effort of maintaining the systems should scale sub-linearly.</li><li>Support product management in prioritizing and coordinating work on changes and serve as a lead in creating user-focused technical requirements and analysis</li><li>Assist with customer support, sales, and other activities as needed.&nbsp;</li><li>Understand and enact our security posture and practices.</li><li>Rotate through on-call duty.</li><li>Contribute to a culture of continuous learning and clear responsibility and accountability.</li><li>Manage your workload, collaborating and working independently as needed, keeping management appropriately informed of progress and issues.</li></ul></ul><p><strong>Basic Qualifications:</strong></p><ul><ul><li>Experience developing and extending a SaaS multi-tenant application</li><li>Domain expert in scalable, highly available data storage, scaling, organization, formats, security, reliability, etc.</li><li>Capable of deep technical understanding and discussion of databases, software and service design, systems, and storage</li><li>10+ years of experience in distributed software systems design and development</li><li>7+ years of experience programming in Golang, Java, C#, or C</li><li>7+ years of experience designing and hands-on implementation and maintenance of data pipelines at big data scale, employing a wide variety of big data technologies, as well as cleaning and organizing data to be reliable and usable</li><li>Experience designing highly complex data infrastructures and maintenance of same</li><li>Mastery of relational database concepts including a strong knowledge of SQL and of technologies such as MySQL, Postgres</li><li>Experience with CI/CD, Git, and development in a Unix/Linux environment using the command line</li><li>Excellent written and verbal communication skills</li><li>Ability to understand and translate customer needs into leading-edge technology</li><li>Collaborative with a passion for highly effective teams and development processes</li></ul></ul><p><strong>Preferred Qualifications:</strong></p><ul><ul><li>Master’s degree in Computer Science or equivalent work experience</li><li>Experience designing and deploying solutions with no-SQL technologies such as Mongo, DynamoDB</li><li>3+ years of experience with AWS infrastructure development including experience with a variety of different ingestion technologies,, processing frameworks, storage engines and understand the tradeoffs between them</li><li>Experience with Linux systems administration and enterprise security</li></ul></ul>            </div>        <div>        <a href='https://jobs.lever.co/vividcortex/078548bf-05f8-4f94-8b6d-3c885d9846d8' rel='nofollow'>            Apply        </a>                            </div>            <h4>About VividCortex: Database Performance Monitoring</h4>            <div><p><strong>About VividCortex</strong> VividCortex provides deep database performance monitoring to drive speed, efficiency and savings. Our cloud-based SaaS platform offers full visibility into major open source databases – MySQL, PostgreSQL, Amazon Aurora, MongoDB, and Redis – at any scale without overhead. By giving entire engineering teams the ability to monitor database workload and query behavior, VividCortex empowers them to improve application speed, efficiency, and up-time. Founded in 2012, and headquartered in the Washington, DC metro area with remote teams in the US and abroad, our company’s growth continues to accelerate (#673 Inc. 5000). Hundreds of industry leaders like DraftKings, Etsy, GitHub, SendGrid, Shopify, and Yelp rely on VividCortex.&nbsp; We know our team is our greatest strength so we support our people with excellent benefits including 401k, professional development assistance, flexible paid leave (vacation, parental, sick, etc.), and a health/wellness benefit. We enjoy getting together and giving back to the community through volunteer services. We believe in offering every employee the tools and opportunity to impact the business in a positive way. We care about inclusiveness and working with people who help us learn and grow.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Take-as-you-need PTO</span>                            </li>                            <li>                                <span></span>                                <span>100$ per month gym reimbursement</span>                            </li>                            <li>                                <span></span>                                <span>Comprehensive Health, Vision, Dental</span>                            </li>                            <li>                                <span></span>                                <span>Generous paid parental leave</span>                            </li>                            <li>                                <span></span>                                <span>Commuter benefits</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "cVBoL7WXRoicSW8PDEgiAg",
    "url": "https://stackoverflow.com/jobs/376897/senior-developer-with-go-expereince-boyle-software?a=22oLVoIkSpNK&so_medium=Talent&so_source=TalentApi",
    "title": "Senior Developer with GO expereince at Boyle Software (Dallas, TX) ",
    "tags": [
      "DBG:surround``remot 16W timezon",
      "DBG:surround``remot 9W 4N( OR(offic,onsit), time)",
      "DBG_TECH1:k/t/w:c++/c/16",
      "DBG_TECH1:k/t/w:c/c/15",
      "DBG_TECH1:k/t/w:go/go/18",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:python/python/6",
      "DBG_TECH1:techWeightMap:{python=6, other=0, dotnet=0, c=31, mobile=2, go=26, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "go"
    ],
    "hiringOrganization": {
      "name": "Boyle Software – Dallas, TX",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 90000,
      "maxValue": 150000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "USD 90k - 150k /Year"
    },
    "employmentType": "UNSET",
    "published": "Apr 28, 2020 3:05:12 PM",
    "validThrough": "May 5, 2020 3:05:12 PM",
    "crawled": "Apr 28, 2020 3:05:12 PM",
    "content": "<h3><span>Senior Developer with GO expereince</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Mid-Level, Senior, Lead</span>                                </div>                                <div>                                    <span>Industry: </span>                                    <span>Custom IT Solutions, Software Development</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Company size: </span>                                    <span>51–200 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>Private</span>                                </div>                        </div>                </div>            <div>Company: Boyle Software – Dallas, TX<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT-06:00) Central Time +/- 2 hours</span>                            </div>                                                    <div>                                <span>Office Location:</span>                                <span>Dallas, TX.</span>                                    <span>Employees can also work full time from this office.</span>                            </div>                                                                    </div>                </div>            <h4>Technologies</h4><div>go</div><div>python</div><div>c</div>            <h4>Job description</h4>            <div>Boyle Software is looking for a full-time Software Engineer with Go experience. Ideally you've worked in a JavaScript, Python, Java or C/C++ environment where you have gotten the chance to work with Go &nbsp;as well.**This job is either remote or based in Dallas, TX. Must be in the US though**<br><br>There are many ways to define what qualifies an Engineer as &quot;Senior&quot;. We don't have a year requirement in mind, we believe there is more to it than that. We do need an experienced dev who will be able to work independently on a modern application without much guidance. If that's you apply below, let's chat!<br><br><strong>Requirements:</strong><ul><li>3+ years of Software Engineering experience</li><li>Strong software design skills; database modeling a plus</li><li>Experience with Go (Golang)</li><li>Experience with one or more: JavaScript, Python, Java, or C/C++</li><li>Experience with distributed systems</li><li>AWS experience is a huge plus</li><li>Experience building scalable web architecture and distributed systems</li></ul>            </div>        <div>        <a href='https://hire.withgoogle.com/public/jobs/boylesoftwarecom/view/P_AAAAAAGAAD6C-pFCZwONbE?trackingTag=stackOverflow' rel='nofollow'>            Apply        </a>                            </div>            <h4>About Boyle Software</h4>            <div><p><em><strong>Boyle Software designs, develops, and delivers custom technology solutions for a wide array of businesses and organizations: Fortune&nbsp;500 companies, start-ups, non-profits, etc.</strong></em></p><p>Boyle Software is more than the sum of its parts. We are a successful company because we attract and retain the top talent in the industry. Challenging each other with the latest technology packages, frameworks, and platforms, we are constantly evolving and improving ourselves. Boyle Software is a team&nbsp;full of talent and passion for the latest technology with offices in New York City and Kiev, Ukraine.</p><p>We want you to join our ever-growing team of smart, passionate engineers and expand your skills while you work!</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Generous salaries</span>                            </li>                            <li>                                <span></span>                                <span>Full health insurance</span>                            </li>                            <li>                                <span></span>                                <span>Dental reimbursement plan</span>                            </li>                            <li>                                <span></span>                                <span>Flexible work hours</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "MVWBImbmTCCVY5yIan15Qg",
    "url": "https://problogger.com/jobs/job/are-you-a-go-getter-looking-for-long-term-work/",
    "title": "Are you a go-getter looking for long term work?",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go"
    ],
    "hiringOrganization": {
      "name": "IM Group",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 3,
      "maxValue": 3,
      "info": "",
      "unit": "WEEK",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 3 /Week"
    },
    "employmentType": "UNSET",
    "published": "Apr 21, 2020 2:00:00 AM",
    "validThrough": "Apr 28, 2020 2:00:00 AM",
    "crawled": "Apr 24, 2020 8:10:32 PM",
    "content": "<h3>Are you a go-getter looking for long term work?</h3><div>Company: IM Group</div>Location: Anywhere<br>Job Type: Freelance<div>  <h5>Description</h5>  <div>                    <p>Are you willing to go above and beyond with your research?</p><p>Can you write with personality?</p><p>If so this job could be for you!</p><p>We are a small digital media company that runs multiple blogs in several different niches and are looking for the next star to add to our team.</p><p>The successful applicant will need to be able to write on a variety of topics in various writing styles, while injecting personality into each piece of content.</p><p>They will also be able to maintain a minimum of 10,000 words per week ongoing without compromising on content quality.</p><p>Some topics you might be requested to write on include:<br>Giftwares, hobbies, textile arts, needlework, musical instruments and much more.</p><p>&nbsp;</p><p><b>Please Do Not Apply If This Is Not You!</b></p><p>&nbsp;</p><p><strong>What we offer:</strong></p><p>10,000+ words per week</p><p>3 cents (USD) per word (potential for more if you excel)</p><p>Easy to follow article layout supplied by us</p><p>Fast Pay via Transferwise or Bank Transfer</p><p>Friendly &amp; Fast communication via email or skype</p><p>Content writing will be reviews, how to’s, guides, product descriptions etc</p><p>Work Remotely</p><p>Freelance Position</p><p><strong>&nbsp;&nbsp;</strong></p><p><strong>Our Expectations:</strong></p><p>You must produce at a minimum 10,000 words per week</p><p>You must be excellent at following instructions</p><p>You must be a native English writer</p><p>You must be prepared to go above and beyond in your research</p><p>You must have Microsoft Word</p><p>You must have Dropbox</p><p>&nbsp;</p><p><strong>What Now?</strong></p><p>We are only looking for serious applicants so please don’t waste our time or yours if you aren’t 100% sure you are a perfect fit for this position.</p><p>When applying please either attach 3 of your best articles in a word document or link to your 3 best articles you have written under your byline that are currently live on a website.</p><p>Please list you personal interests, hobbies and any qualifications (of any type) you may have.</p><p>All applicants must include the capital of New Zealand in the message box of your application. Any applicants who do not do this will be ignored.</p><p>A short list of applicants may be required to submit a 1000-word article to determine how well you follow instructions and to further confirm your writing quality.</p><p>Thanks again and I look forward to reading the applications.</p>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "DtmjivQGTNmI-mDDb607rw",
    "url": "https://news.ycombinator.com/item?id=22758142",
    "title": "Percona | Golang Software Engineer | REMOTE | Full-time | Worldwide | https://www.percona.com/ ...",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go-developer/go/39",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=42, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 2, 2020 2:12:32 PM",
    "validThrough": "Apr 9, 2020 2:12:32 PM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "Percona | Golang Software Engineer | REMOTE | Full-time | Worldwide | <a href='https://www.percona.com/' rel='nofollow'>https://www.percona.com/</a><p>Unbiased Open Source Database Experts</p><p>Yesssss, while the whole world still doubts, we already host databases in K8s! And Percona is looking for a Go Developer who will help us launching high availability database clusters in Kubernetes!</p><p>APPLY NOW: <a href='https://www.percona.com/about-percona/careers' rel='nofollow'>https://www.percona.com/about-percona/careers</a></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "UShTw7FaTjaTtNI78F8__g",
    "url": "https://news.ycombinator.com/item?id=22798455",
    "title": "Coder | Austin, TX | Full-time |On-site OR Remote|Golang Engineer| Typescript Engineer| ...",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go-developer/go/26",
      "DBG_TECH1:k/t/w:typescript/frontend/2",
      "DBG_TECH1:k/t/w:typescript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=26, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 7, 2020 12:21:05 AM",
    "validThrough": "Apr 14, 2020 12:21:05 AM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "Coder | Austin, TX | Full-time |On-site OR Remote|Golang Engineer| Typescript Engineer| Solution Architect |<a href='https://coder.com/' rel='nofollow'>https://coder.com/</a> |<p>Coder automatically configures, secures, and powers an organization's development environments, allowing developers to focus on the product.Pre-configured environments allow project team members to define what language version and tooling are required to provide consistency across the team and to allow new team members to quickly contribute.</p><p>We are a series B start up HQ'd out of Austin, TX and backed by some great VC's (Red Point, Founders Fund, GGV, and Mitchell from Hashicorp). Our product is built by engineers, for engineers. We’re committed to building an organization and product optimized for engineering happiness. You can expect a fast-paced workflow and minimal meetings. We offer great employee perks, a strong culture of passionate engineers, modern tech stack, and tons of room for career advancement.</p><p>Careers Page- <a href='https://coder.com/company#openings' rel='nofollow'>https://coder.com/company#openings</a></p><p>email: clever@coder.com</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ZfG-8ZDnTUqOGkc4F0v5tg",
    "url": "https://news.ycombinator.com/item?id=22821112",
    "title": "Hey there! We're looking for a remote iOS Developer who can work +/- 4hrs London working hours ...",
    "tags": [
      "DBG:surround``4N( OR(look, search),     4N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:ios/apple/4",
      "DBG_TECH1:k/t/w:ios/mobile/4",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=4, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=4, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/go",
      "TECH1/mobile",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "go",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 9, 2020 11:59:03 AM",
    "validThrough": "Apr 16, 2020 11:59:03 AM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "Hey there! We're looking for a remote iOS Developer who can work +/- 4hrs London working hours for our EdTech startup. We are building on the go audio courses! Here is the job spec, if you'd like to have a look: <a href='https://angel.co/company/avid/jobs/770952-remote-first-ios-developer' rel='nofollow'>https://angel.co/company/avid/jobs/770952-remote-first-ios-d...</a>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "KkX5PP-SQmSo3qgI-yGAUA",
    "url": "https://news.ycombinator.com/item?id=22750795",
    "title": "Segment | Engineering & many other roles | San Francisco, CA; Vancouver, BC; New York, NY | ...",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=11, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=9}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 1, 2020 6:51:34 PM",
    "validThrough": "Apr 8, 2020 6:51:34 PM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "Segment | Engineering &amp; many other roles | San Francisco, CA; Vancouver, BC; New York, NY | Full-Time | Onsite, Remote<p>Segment is building the customer data platform for everyone. We transform data and route to over 200 different integrations, adding new ones every day. We're processing billions of events daily and responsibly maintain the data infrastructure for companies like IBM, DigitalOcean, Instacart, and Docker. Our goal is to help companies learn from how their users interact with their products to build even better products as well as enable them to level up their customer data management. We also like to share our work and what we learn, here are some recent examples:</p><p>- <a href='https://segment.com/blog/the-10m-engineering-problem/' rel='nofollow'>https://segment.com/blog/the-10m-engineering-problem/</a></p><p>- <a href='https://segment.com/blog/separating-our-data-and-control-pla...' rel='nofollow'>https://segment.com/blog/separating-our-data-and-control-pla...</a>.</p><p>- <a href='https://segment.com/blog/autocomplete-for-your-analytics/' rel='nofollow'>https://segment.com/blog/autocomplete-for-your-analytics/</a></p><p>- <a href='https://segment.com/blog/goodbye-microservices' rel='nofollow'>https://segment.com/blog/goodbye-microservices</a></p><p>- <a href='https://open.segment.com' rel='nofollow'>https://open.segment.com</a></p><p>We have a modern stack consisting of Go (golang), AWS ECS, Docker, Javascript, React, GraphQL, Kafka, and others! If any of this sounds interesting, we'd love to hear from you! Check out our open positions at <a href='https://segment.com/jobs' rel='nofollow'>https://segment.com/jobs</a> If you have specific questions, feel free to reach out to me directly alan ⒜ segment.com (but please do apply on the site).</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "T4so4f_JTNS9RICvTlU2sA",
    "url": "https://news.ycombinator.com/item?id=22756204",
    "title": "Ferrum Health | REMOTE | Full Time | Senior Backend Engineer | https://ferrumhealth.com Medical ...",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(europ, european, europeanunion) 3W OR(timezon,time)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``usa 3W OR(time,timezon)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/4",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=4, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 2, 2020 6:29:56 AM",
    "validThrough": "Apr 9, 2020 6:29:56 AM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "Ferrum Health | REMOTE | Full Time | Senior Backend Engineer | <a href='https://ferrumhealth.com' rel='nofollow'>https://ferrumhealth.com</a><p>Medical errors are the third leading cause of death in the US, and Ferrum builds AI-powered monitoring systems to help health systems detect and address mistakes before they affect patient care.</p><p>Ferrum is a fully remote and distributed company focused around the US and European timezones. Since launching its first offering for lung cancer errors two years ago, Ferrum now covers over 10 million patients at nine health systems around the world, including the US. The company is backed by multiple top-tier venture capital firms and is led by an experienced digital health founding team that includes industry leaders in enterprise healthcare, machine learning, and edge infrastructure security.</p><p>We are looking for Senior Backend Engineers with a strong understanding of distributed systems and Linux internals to help build out infrastructure that is deployed to healthcare systems. The backend stack consists of Go and containerized environments with deployments in cloud and bare-metal environments. You would be joining an engineering team of nine people who have proven track records delivering solutions in the networking, storage, and machine learning spaces.</p><p>Our ideal candidates has proven technical skills in addition to a passion for improving the quality of healthcare.</p><p>To apply, send an email to jobs@ferrumhealth.com.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "7BEpEAK9T0OHQjuO9O_PTA",
    "url": "https://news.ycombinator.com/item?id=22752146",
    "title": "strongDM | All Roles! Go / Golang | FULL REMOTE (core hours ~US timezones, any latitude) | Full ...",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``usa 3W OR(time,timezon)",
      "DBG_TECH1:k/t/w:go/go/12",
      "DBG_TECH1:k/t/w:golang/go/24",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=36, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 1, 2020 8:42:51 PM",
    "validThrough": "Apr 8, 2020 8:42:51 PM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "strongDM | All Roles! Go / Golang | FULL REMOTE (core hours ~US timezones, any latitude) | Full-time | <a href='https://www.strongdm.com' rel='nofollow'>https://www.strongdm.com</a><p>--------</p><p><i></i> April 2020 update: because we build remote access software, we're seeing a surge of teams everywhere go remote -- we could definitely use your help!</p><p>--------</p><p>strongDM is an identity-aware proxy for managing and auditing access to databases, k8s, and other servers. We build secure, high-throughput networking systems in Go.</p><p>We're a fully remote (UTC -4 to -7), building software to help people work remotely. We have high standards and high levels of respect for each other and our customers.</p><p>Current roles:</p><p>* Senior Software Engineer (Golang, distributed systems)</p><p>* Lead Engineer / Engineering Manager</p><p>* Product Manager</p><p>* Technical Writer</p><p>* Front End Developer</p><p>If this sounds like the type of work and the type of environment that would suit you, send me (Justin, co-founder &amp; CTO) a note at justin@strongdm.com</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "oP7s3GYIQuCfykMNVFUksA",
    "url": "http://workinstartups.com/job-board/job/91097/sales-co-founder-at-myndup-mental-health-startup-at-myndup/",
    "title": "Sales Co-Founder at MYNDUP - Mental Health Startup",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "MYNDUP",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 15, 2020 10:13:21 PM",
    "validThrough": "Apr 22, 2020 10:13:21 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>We are looking for a Sales Co-Founder to join the MYNDUP team and help disrupt the Mental Health industry.</p><br /><p><strong>ABOUT US</strong><br /><br />MYNDUP provides live 1-1 video mental health coaching sessions with professionals ranging from therapists and counsellors to mindfulness practitioners. We are currently working with companies in the coworking sector and financial services space where MYNDUP is being used as an employee benefit.</p><br /><p>We have a network of over 250 professional and licensed coaches who go through an extensive vetting process to ensure that we deliver the highest standard of care. These coaches can help you with any issues you may be experiencing including; stress, anxiety, depression, loneliness, relationships, trauma and much more.</p><br /><p>Our coaches have experience that ranges from working with the emergency services and hospitals for acute mental health issues to taking on clinical psychology cases with ranging roles from Mental Health Nurses and CBT therapists to Counsellors.</p><br /><p>Volunterring Programme: We arrange for coaches to visit schools, hospitals and universities to help those in need. Our current project is aimed at helping frontline NHS staff and the vulnerable during COVID-19.</p><br /><p>&nbsp;</p><br /><p><strong>THE ROLE</strong><br /><br />-The key focus will be on powering enterprise sales efforts both inbound and outbound<br />-As a Co-founder, you will have responsibilities ranging every aspect of the business and its future development<br />-Develop and implement a sales &amp; marketing strategy and support with the future vision of the business<br />-You would join the current two founders and a small team of advisors/freelancers working remotely.</p><br /><p>&nbsp;</p><br /><div class=&quot;ad-details-body border-bottom&quot;><br /><div id=&quot;job-description&quot;><strong>BENEFITS and REMUNERATION</strong><br /><br />-A generous equity stake as well as performance-related bonuses<br />-Competitive salary offered at the next stage of investment.</div><br /></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "4Dv88kaJQgio_JsTsFwITQ",
    "url": "http://workinstartups.com/job-board/job/90871/senior-software-engineer-back-end-remote-at-ometria/",
    "title": "Senior Software Engineer (Back End) - Remote",
    "tags": [
      "DBG:surround``4N( OR(look, search),     4N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:k/t/w:flask/python/8",
      "DBG_TECH1:k/t/w:golang/go/32",
      "DBG_TECH1:k/t/w:python/python/10",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=18, other=0, dotnet=0, c=0, mobile=0, go=32, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Ometria",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 30, 2020 5:47:45 PM",
    "validThrough": "Apr 6, 2020 5:47:45 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p><strong data-redactor-tag=&quot;strong&quot;>Senior Software Engineer (Back End)</strong></p><br /><p><strong data-redactor-tag=&quot;strong&quot;>Location: Remote</strong></p><br /><p>We&rsquo;re looking for a Senior Software Engineer to join our growing engineering team and help us build out scalable, reliable, performant solutions in our SaaS platform.</p><br /><p><strong data-redactor-tag=&quot;strong&quot;>Who are we?</strong></p><br /><p>Ometria's purpose is to help retailers create marketing experiences their customers will love. We use AI and lots of data to truly understand each customer, and make sure that their experiences are ones they truly find personalised and valuable. We do this right now for some of the fastest growing retail brands, from Made.com to Hotel Chocolat and for 150 million individual people across the world.</p><br /><p>We have offices in London, New York and Southampton, and have raised over &pound;25M from leading VCs like Octopus and Summit.</p><br /><p>On this journey to providing a product that really stands out we have grown a team of driven, self-reflective and dedicated Ometrians. We&rsquo;re committed to finding potential candidates who can grow and flourish here, adding to the team culture.</p><br /><p><strong data-redactor-tag=&quot;strong&quot;>What will you be doing?</strong></p><br /><p>As a Senior Software Engineer, you will be working as part of our combined product and engineering team. You will work collaboratively to design scalable and robust solutions, developing those services in the most appropriate language (Python, Golang) according to best practices.</p><br /><p>Some of the current challenges we are working on right now:</p><br /><ul><br /><li>We&rsquo;re building a modern microservices-based infrastructure running in multiple availability regions.</li><br /><li>Data warehouse technology migration - We are growing like never before, with 100% year on year growth. Currently we use a combination of Postgres and Redshift, however we will consider other data warehouse technologies and also re-implement our ELT layer using modern tools.</li><br /><li>Building new features for our clients driven by innovation - some of these projects require super high availability and ultra low latency.</li><br /></ul><br /><p><strong data-redactor-tag=&quot;strong&quot;>Engineering at Ometria</strong></p><br /><p>We believe in modern software engineering principles, including DevOps and SRE practices, little &lsquo;a&rsquo; Agile (including Kanban and friends), delighting our users and investing in the growth of our team.</p><br /><p>The engineering team is currently 14 engineers (looking to double this year) - frontend, backend, SRE, and test. We have varied backgrounds in terms of experience, roles and responsibilities and all work in the same office. We work closely with our product team on new features, infrastructure, growth, and client-specific work.</p><br /><p><strong data-redactor-tag=&quot;strong&quot;>Our tech stack:</strong></p><br /><p>Our clients interact with the Ometria platform through a single page web app, which uses the Ampersand.js framework, with a separate section in React.<br /><br />The app communicates with the backend platform through various Python 3 and Golang. Flask powers our Python API layer. Golang powers some of our massively concurrent workloads and analytics services.</p><br /><p>We run on AWS/Docker/Kubernetes configured with Terraform. Data is stored in Postgres and Redshift, and we use various queueing/messaging tools (Google Pub/Sub, Kinesis, AWS SQS, Beanstalk, Celery, and Gearman)</p><br /><p><strong data-redactor-tag=&quot;strong&quot;>What kind of experience are we looking for?</strong></p><br /><ul><br /><li><strong data-redactor-tag=&quot;strong&quot;>Experience</strong></li><br /></ul><br /><p>You have written software at scale in either Python or Golang or another open source language and you are looking to learn Python. You will have mentored junior engineers and helped them with setting tasks, problem-solving and feedback. .</p><br /><ul><br /><li><strong data-redactor-tag=&quot;strong&quot;>Problem solver</strong></li><br /></ul><br /><p>You enjoy working collaboratively in a team, but can also work independently to solve complex problems. You seek help/feedback when required to ensure solutions are robust, performant, secure, etc&hellip; utilising product managers, test engineers and SRE&rsquo;s.</p><br /><p><strong data-redactor-tag=&quot;strong&quot;>Why join Ometria?</strong></p><br /><p>One of our values is &ldquo;It's awesome to be here&rdquo;, here are some of the reasons we love working here:</p><br /><ul><br /><li><strong data-redactor-tag=&quot;strong&quot;>Team of amazing people</strong><br />We are committed to hiring the right people and maintaining our culture as we grow</li><br /><li><strong data-redactor-tag=&quot;strong&quot;>Making sure you&rsquo;ll have an impact</strong><br />We&rsquo;re solving interesting challenges and you&rsquo;ll have a say in how we solve them</li><br /><li><strong data-redactor-tag=&quot;strong&quot;>Supporting learning and development</strong><br />We&rsquo;re in this together and want you to become the best and feel supported as you do so. We want all Ometrians to be able to continually learn and grow in their roles.</li><br /><li><strong data-redactor-tag=&quot;strong&quot;>Going above and beyond to help each other</strong><br />We&rsquo;re all part of the bigger picture. We love helping each other to thrive and celebrate success together.</li><br /></ul><br /><p><em data-redactor-tag=&quot;em&quot;>We review all applications on a continual basis, and as such have no 'application deadline'. If you are interested please apply below, or get in touch if you have any questions.</em></p><br /><p><strong data-redactor-tag=&quot;strong&quot;>We will be holding all interviews remotely.</strong></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Gmba72n0SLa1ZGU7WrM7AQ",
    "url": "http://workinstartups.com/job-board/job/90843/rd-tax-specialist-at-pearl-lemon/",
    "title": "R&D Tax Specialist",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Pearl Lemon",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 28, 2020 5:58:42 PM",
    "validThrough": "Apr 4, 2020 5:58:42 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<h1>R&amp;D Tax Specialist</h1><br /><p>Pearl Lemon is looking for a highly motivated and driven person to help drive forward our ambitious growth plans throughout 2020 and beyond. You will be an important part of a tight-knit team who have a hands-on approach and are passionate about taking the business to the next level.</p><br /><p>The R&amp;D Tax Specialist is an integral part of our team. We are looking for someone to help develop our R&amp;D Tax branch.</p><br /><p>We are looking for someone who prides themselves on their speed of communication, attention-to-detail, and meticulous planning skills, but can adapt to change in a very fast-moving environment.</p><br /><p>A strong understanding of digital marketing is essential, as is exceptional people and communication skills to help develop team members who you will manage directly.</p><br /><p>&nbsp;</p><br /><p>MUST be based in the United Kingdom.</p><br /><p>&nbsp;</p><br /><h2>POSSIBLE responsibilities will include:</h2><br /><ul><br /><li>Gathering information and explaining options for best practice to clients.</li><br /><li>Preparing documents for clients and for submission</li><br /><li>Ensure accurate and timely filing of forms</li><br /><li>Provide support with various internal audits and special tax related projects.</li><br /></ul><br /><h2>Required skills and experience:</h2><br /><ul><br /><li>Exceptional communication skills, verbal and written.</li><br /><li>Previous R&amp;D Tax experience</li><br /><li>Working knowledge of R&amp;D Tax</li><br /><li>Ability to learn restrictions for other countries besides UK</li><br /><li>Being punctual and quick to respond and communicate-daily.</li><br /><li>Experience with Word Press and SEO</li><br /><li>Proven people management track record.</li><br /><li>Incredibly fast learner.</li><br /></ul><br /><h2>Benefits:</h2><br /><ul><br /><li>Learn Very Very Fast</li><br /><li>Work with TedX Speakers</li><br /><li>Work with ultramarathon runners, speakers of multiple languages</li><br /><li>Work with a fully digital and remote team across different timezones</li><br /><li>Build and grow entirely in the cloud</li><br /><li>International work-cations where we meet and work in a foreign country for a week</li><br /><li>Worst case - learn tons, get an amazing reference and move forward</li><br /><li>Best case - go full time, build your personal brand and work from anywhere in the world</li><br /><li>Take your digital skills you learn with us and apply to any job in any industry</li><br /></ul><br /><p>&nbsp;</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "CaLZ1XDRROKGgGYoUAzCqw",
    "url": "http://workinstartups.com/job-board/job/90806/web-developercoder-intern-at-miskie-london-ltd/",
    "title": "Web developer/coder intern",
    "tags": [
      "DBG:surround``can 2W remot",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:magento/php/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=8, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go",
      "php"
    ],
    "hiringOrganization": {
      "name": "Miskie London LTD",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 26, 2020 2:31:53 PM",
    "validThrough": "Apr 2, 2020 2:31:53 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>New to the world of web designing or coding? Looking to gain real experience?</p><br /><p>We are Miskie London a new (launched december 2019) online underwear brand designing and creating amazing underwear here in the UK! we are a young and vibrant team. We are looking for a motivated and creative individual with an interest in eccom and a knowledge of web development (magento) or coding. You can work remotely.&nbsp; Offering a three or six month internship.&nbsp;</p><br /><p>Require skills:</p><br /><p>. Able to work on your own&nbsp;</p><br /><p>. creativity &amp; problem solving&nbsp;</p><br /><p>. quick learning&nbsp;</p><br /><p>. be able to meet pre-agreed deadlines</p><br /><p>. attention to detail&nbsp;</p><br /><p>. able to work in a fast paced environent</p><br /><p>Go to www.miskielondon.com to see more about our brand :)</p><br /><p>Your cup of tea? Go on... Apply!</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "xuq7SgFKTtydjzrD93ZgJA",
    "url": "https://remoteok.io/jobs/84465",
    "title": "Golang Software Engineer (remote)",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``4N( OR(look, search),     4N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:distributed-database/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go-developer/go/39",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=47, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Percona ",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 7, 2020 12:18:53 AM",
    "validThrough": "Apr 14, 2020 12:18:53 AM",
    "crawled": "Apr 24, 2020 8:09:12 PM",
    "content": "<span></span> <span><h4>Percona</h4>&nbsp;</span> <br> <h3>Golang Software Engineer</h3> <span></span> <span>verified</span> <br> <span>Worldwide</span> <div>  <div>   Percona is a leader in providing best-of-breed enterprise-class support, consulting, managed services, training and software for MySQL®, MariaDB®, MongoDB®, PostgreSQL® and other open source databases in on-premises and cloud environments. Our services and software accommodate rapid growth and application development, help companies develop and deploy agile solutions and improve your ability to keep up with customer needs.\\n \\nDiscover what it means to work with some of the smartest people in the industry, and help solve some of the most challenging customer problems. We offer flexible hours, competitive salaries, the ability to work remote and the amazing experience of working with a multinational team of experts.\\n\\nWe’re looking for a remote full-time developer to join our team and help to bring Open Source databases to Kubernetes. Ideally, we would love to find a Golang Software Engineer who has deep knowledge of both distributed databases and Kubernetes, but will consider an experienced programmer who has good knowledge in either area.\\n\\nThe work is challenging, but that’s why it’s also fun and rewarding! Plus, our team is small, so you and your work will have a significant impact on the Kubernetes ecosystem. This is a rare opportunity to work from home in a great team, on a 100% open source project!\\n\\nThis position is back-end development (but the talented full-stack developers are welcome too). You should find these keywords familiar and very appealing: Kubernetes, infrastructure orchestration, MongoDB, MySQL, PostgreSQL, database clustering, database high-availability strategies, containers. \\n\\n# Responsibilities\\n What You Will Do\\n\\n - Key contributor in building and implementing the Kubernetes Operators for relational and NoSQL databases\\n - Architect technical design of new features and improvements\\n - Collaborate with engineers and teams across the company to helping in the deployment and debugging of Kubernetes Operator to facilitate rapid integration and massive growth\\n - Participate in technical articles writing, blogging, conference speaking engagements \\n\\n# Requirements\\nYour Experience\\n\\n- 3+ years of commercial experience with Golang\\n- Excellent understanding of how to build distributed clusters for (at least one) MySQL, PostgreSQL, MongoDB\\n- Strong Kubernetes experience\\n- Team player first\\n- Strong desire to do QA work\\n- Proven communication skills: blog posts, speaking at conferences, leading community, etc\\n- Success working in a distributed environment where e-mail, instant messaging and voice calls are the only interactions with others on a daily basis\\nability to communicate effectively in English (speaking and writing) \\n\\n#Location\\n- Worldwide   <br>  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "2qq00vUBQ4-H3yeF2CZ5DA",
    "url": "https://www.indeed.co.uk/viewjob?t=Senior+Back+End+Developer&jk=15ee3cc0bfacf894&",
    "title": "Senior Back-end Developer (Remote Work) - Etoron Technologies - Login",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:pandas/python/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=7, other=0, dotnet=0, c=0, mobile=1, go=8, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/go",
      "TECH1/python",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "go",
      "python"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 25, 2019 1:50:28 PM",
    "validThrough": "May 2, 2019 1:50:28 PM",
    "crawled": "Apr 24, 2020 8:09:08 PM",
    "content": "<div><p></p><div><div><div><p>Keterangan Lengkap Lowongan Kerja Senior Back-end Developer (Remote Work) di Etoron Technologies: Keterangan Lengkap</p></div><div><b>Persyaratan</b><br><p><b>Responsibilities</b></p><ul><li>Build a high volume, high performance server with any cutting-edge technology.</li><li>Develop and improve the exciting features within our agile and fast-paced work environment.</li><li>Collaborate with the team to ensure all requirements are met and deliver high quality software.</li><li>Work with CTO to evaluate technologies, fulfill development or related tasks assigned.</li><li>Support and contribute to our happy work culture</li></ul><p><b>Qualifications</b></p><ul><li>At least 5 years’ programming experience as a backend developer using Python 2.7/3.*, Java or Golang .</li><li>Experienced in highload (projects with &gt; 1K QPS)</li><li>Familiar with HTTP protocol</li><li>Strong skills with SQL and NoSQL databases such as Redis, Mongodb, Aerospike</li><li>Sound knowledge of linux console</li><li>Experience with Vagrant, Docker, Pandas and Hadoop</li><li>A big plus if you have experience in advertising, especially in RTB</li><li>Background with Agile development</li></ul> </div></div><div></div><div><div><div><div><div><div><div><b>30/12/15 14:46</b></div></div><br><div><div></div><div> </div></div><br><div></div><div><div><b>Baru Lulus </b></div></div><br></div></div></div><div></div><div><div><div><div><div><div><div><b>Full Time</b></div></div><br> <div></div><div><div><b>Login untuk melihat gaji</b><b></b></div> </div><br><div></div><div><div><b>Lowongan Ini Ditutup</b></div></div><br> <div></div><div><div><b>Jumlah Pelamar 8</b></div></div></div></div></div></div></div></div></div></div><p></p></div><div><div><div><span></span></div><span>Login</span></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "kiaiydSwTMyNH871DH2XzQ",
    "url": "https://www.indeed.co.uk/viewjob?t=Software+Developer&jk=78c9d7eb4b2cae00&",
    "title": "Software Developer - IntaPeople - Cardiff",
    "tags": [
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:bash/other/1",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:javabeans/java/8",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:vue.js/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=1, dotnet=0, c=0, mobile=0, go=11, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=9}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/go",
      "TECH1/java",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend",
      "go",
      "java"
    ],
    "hiringOrganization": {
      "name": "IntaPeople",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 17, 2020 4:08:42 PM",
    "validThrough": "Mar 24, 2020 4:08:42 PM",
    "crawled": "Apr 24, 2020 8:09:08 PM",
    "content": "<div><div><div>Software Developer (Golang) – Cardiff<br>We’re helping to grow the team for a startup in Cardiff and are on the lookout for Software Developers who want to learn plenty of new skills and work in a rapidly growing early stage business, start-up environment.<br><br>What you’ll be doing…<br>This candidate will be joining a team who are responsible for the design, commercialisation and continuous improvement of the product, helping the client improve and scale appropriately.<br><br>Ideally, you’ll have experience as part of a team developing and managing software products in high growth, fast-moving consumer facing industries. We’re not expecting people to be experts in the tech, but successful candidates must be team players – the work here is driven with agile at its core, with collaborative working and the team at the heart of every deliverable, so the ability to effectively contribute to this process is essential. Candidates must be prepared to learn new technologies, face and resolve challenges and consistently deliver to high standards.<br><br>This is joining a company who have had heavy investment and already have a number of big partners on board – they’re at the beginning of their journey though so this role will suit someone who is focused, embraces change and wants to create something completely new.<br><br>About you…<br>In terms of skills, we’re not looking for someone who is a 100% expert in all of these areas, but we are interested in people who care about the needs of the users and enjoys investigating and solving complex issues!<br>We’re keen to speak to good developers that believe it’s easier to learn new syntax and frameworks than stick for too long to a given technology. If you have experience in the following it would be great, other than that you’ll be learning more about -<br><br><ul><li>Go</li><li>Mongo</li><li>JS/Vue</li><li>Node</li><li>Docker/Containerisation</li><li>Git and understanding of effective source control</li><li>Mongo aggregation</li><li>AWS (S3, EC2, ECC, Elastic Bean Stalk)</li><li>CI/CD platforms</li><li>Linux / Bash</li></ul><br>Other than that experience of DevOps and Security Architecture would be a huge plus!<br><br>Still here? Good!<br>The company have a competitive salary, bonus, flexible and remote options available as well. It’s a crucial role in the company as you’re in the driver’s seat to help deliver value and really put your own stamp on something – For more details/Job spec please apply to get in touch with Jonathan Edwards.</div></div></div><div><div><div><span></span></div><span>Cardiff</span></div><div><div><span></span></div><span>Permanent</span></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "hXY2r7JtTtW1gAATRWDxKQ",
    "url": "https://stackoverflow.com/jobs/368577/engineer-platform-mongodb-rds-auth0?a=1ZBM7WhNwhwc&so_medium=Talent&so_source=TalentApi",
    "title": "Engineer, Platform - MongoDB/RDS at Auth0  ",
    "tags": [
      "DBG:surround``2N( OR(employe,develop,engin,team,workmat), spread, OR(out,across) )",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:distributed-database/bigdata-ml/8",
      "DBG_TECH1:k/t/w:golang/go/16",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:techWeightMap:{python=4, other=0, dotnet=0, c=0, mobile=2, go=16, nodejs=13, bigdata-ml=8, ruby=0, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/nodejs",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "go",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "Auth0 – No office location",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 24, 2020 8:09:06 PM",
    "validThrough": "May 1, 2020 8:09:06 PM",
    "crawled": "Apr 24, 2020 8:09:07 PM",
    "content": "<h3><span>Engineer, Platform - MongoDB/RDS</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Mid-Level, Senior</span>                                </div>                                <div>                                    <span>Role: </span>                                    <span>Backend Developer, DevOps</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Industry: </span>                                    <span>Information Technology, IT Security, Software Development / Engineering</span>                                </div>                                <div>                                    <span>Company size: </span>                                    <span>201–500 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>VC Funded</span>                                </div>                        </div>                </div>            <div>Company: Auth0 – No office location<br></div><h4>Technologies</h4><div>postgresql</div><div>mongodb</div><div>golang</div><div>python</div><div>java</div>            <h4>Job description</h4>            <div><p>Auth0 is a pre-IPO unicorn. We are growing rapidly and looking for exceptional new team members to add to our teams and will help take us to the next level. One team, one score.&nbsp; We never compromise on identity. You should never compromise yours either. We want you to bring your whole self to Auth0. If you’re passionate, practice radical transparency to build trust and respect, and thrive when you’re collaborating, experimenting and learning – this may be your ideal work environment.&nbsp; We are looking for team members that want to help us build upon what we have accomplished so far and make it better every day.&nbsp; N+1 &gt; N. We are looking for Database Engineers who are passionate about distributed systems, availability, and delivering customer value. Our Database Engineers will maintain and automate all aspects of our database platform including infrastructure, tooling, and observability.&nbsp; Ideal candidates have advanced database knowledge, and likely are DBAs with senior level software engineering.</p><p><strong>You would be a good fit for this role if you have:</strong></p><ul><ul><li>8+ years production database engineering experience.</li><li>Expert knowledge of database internals either PostgreSQL or MongoDB.</li><li>Demonstrable expertise in database performance.</li><li>Experience developing large-scale schema migration solutions.</li><li>Experience with database performance analysis in either PostgreSQL or MongoDB.</li><li>Proficiency in Golang, Python, Node.js, or Java.</li><li>Demonstrable expertise in building distributed database applications at scale.</li><li>Demonstrated ability to implement proper test coverage.</li><li>Experience coaching and mentoring junior engineers.</li><li>Experience in disaster recovery planning and execution.</li><li>Deep understanding of microservice architecture and best practices.</li></ul></ul><p><strong>Also useful if you have:</strong></p><ul><ul><li>Experience with data governance laws such as HIPAA, SOC2, PCI, and GDPR.</li><li>Experience building data migration solutions in a heterogeneous environment.</li><li>Experience working with multi region geo-localized data and services.</li><li>Experience with RDS Aurora PostgreSQL.</li><li>Experience managing infrastructure with Terraform.</li><li>Experience with MongoDB Atlas.</li></ul></ul><p><strong>Preferred Locations:</strong></p><ul><ul><li>#US; #AR;</li></ul></ul><p>Auth0’s mission is to help developers innovate faster. Every company is becoming a software company and developers are at the center of this shift. They need better tools and building blocks so they can stay focused on innovating. One of these building blocks is identity: authentication and authorization. That’s what we do. Our platform handles 2.5B logins per month for thousands of customers around the world. From indie makers to Fortune 500 companies, we can handle any use case. We like to think that we are helping make the internet safer.&nbsp;&nbsp;We have raised $210M to date and are growing quickly. Our team is spread across more than 35 countries and we are proud to continually be recognized as a great place to work. Culture is critical to us, and we are transparent about our&nbsp;<a href='https://auth0.com/blog/the-developer-first-identity-platform-auth0-story-and-future' rel='nofollow'>vision and principles</a>.&nbsp; Join us on this journey to make developers more productive while making the internet safer! Auth0 is an Equal Employment Opportunity employer. Auth0 conducts all employment-related activities without regard to race, religion, color, national origin, age, sex, marital status, sexual orientation, disability, citizenship status, genetics, or status as a Vietnam-era special disabled and other covered veteran status, or any other characteristic protected by law. Auth0 participates in E-Verify and will confirm work authorization for candidates residing in the United States.</p>            </div>        <div>        <a href='https://jobs.lever.co/auth0/698e5fcf-cdd8-4209-8231-30c5f5ddcc5f?lever-origin=applied&amp;lever-source%5B%5D=StackOverflow' rel='nofollow'>            Apply        </a>                            </div>            <h4>About Auth0</h4>            <div><p>Auth0, a global leader in Identity-as-a-Service (IDaaS), provides thousands of enterprise customers with a Universal Identity Platform for their web, mobile, IoT, and internal applications. Its extensible platform seamlessly authenticates and secures more than 1.5B logins per month, making it loved by developers and trusted by global enterprises. Auth0 has raised more than $110 million to date and continues its global growth at a rapid pace. We are consistently recognized as a great place to work based our outstanding leadership and dedication to company culture, and are looking for the best people to join our incredible team spread across more than 35 countries!</p><p>We are an equal opportunity employer and value diversity at our company. We are transparent about how we run our recruiting process - you can read all about it <a href='https://auth0.com/blog/how-we-hire-engineers/' rel='nofollow'>here</a>. You can also read about our company culture <a href='https://auth0.com/blog/our-culture-and-values-at-auth0/' rel='nofollow'>here</a>.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Flexible Work Arrangements</span>                            </li>                            <li>                                <span></span>                                <span>Competitive Equity</span>                            </li>                            <li>                                <span></span>                                <span>Top-of-the-Line Macbooks and other great tools</span>                            </li>                            <li>                                <span></span>                                <span>Embrace Distributed Work</span>                            </li>                            <li>                                <span></span>                                <span>Inclusive Work Environment</span>                            </li>                            <li>                                <span></span>                                <span>Annual all-expenses paid international company offsite</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "UVXy-SLnTZ29cQGJtIZfBQ",
    "url": "https://stackoverflow.com/jobs/370764/senior-backend-go-developer-cel?a=20lfw531QzWo&so_medium=Talent&so_source=TalentApi",
    "title": "Senior backend go developer at CEL  ",
    "tags": [
      "DBG:surround``2N( OR(feasibl,OR(consid,consider),occas,possibl), remot)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/24",
      "DBG_TECH1:k/t/w:go-developer/go/26",
      "DBG_TECH1:k/t/w:go/go/12",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=38, nodejs=0, bigdata-ml=24, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "CEL – No office location",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 24, 2020 8:09:06 PM",
    "validThrough": "May 1, 2020 8:09:06 PM",
    "crawled": "Apr 24, 2020 8:09:07 PM",
    "content": "<h3><span>Senior backend go developer</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Mid-Level, Senior</span>                                </div>                                <div>                                    <span>Role: </span>                                    <span>Backend Developer</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Industry: </span>                                    <span>Data Science, Logistics and Supply Chain, Simulation Software</span>                                </div>                                <div>                                    <span>Company size: </span>                                    <span>11–50 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>Private</span>                                </div>                        </div>                </div>            <div>Company: CEL – No office location<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT+01:00) Paris +/- 4 hours</span>                            </div>                                                                                            </div>                </div>            <h4>Technologies</h4><div>go</div><div>amazon-web-services</div><div>docker</div><div>mongodb</div>            <h4>Job description</h4>            <div><p><span>Reports To: The Senior backend engineer will report to the Lead developer.</span></p><p>Preferred timezone&nbsp;are Paris+-2H&nbsp;OR Ho&nbsp;Chi Minh City +-2H</p><p><span>Job Overview: You will join the Simcel Product team which is working on a groundbreaking product that will change the way supply chain is done.&nbsp; A big part of the job will consist in transforming the huge experience gathered by decades of Supply Chain consulting with the biggest FMCG companies into an automated solution, then extend beyond this experience. Your role will be to take leadership in maintaining or implementing some of the core backend feature that will enable simcel to deliver the highest possible value, and grow beyond our first customers.</span></p><p><span>Responsibilities and Duties:</span></p><ul><li><span>Be in charge of designing, implementing and maintaining core backend features of our micro-services.</span></li><li><span>Insure backend features are developed with a high level of quality, as well as participate in our continuous refactoring endeavour.</span></li><li><span>Help conducting non technical, cross departements meetings to transform Supply Chain knowledge into clear code specifications.</span></li><li><span>Be a source of proposition for new features or improvements.</span></li><li><span>Collaborate with the Data team to integrate the data intelligence it produces into our micro services.</span></li><li><span>Be highly autonomous, especially be able to transform fuzzy, complex and various requirements into clear specifications, plan for their implementation and deliver.</span></li></ul><p><span>Qualifications:</span></p><ul><li><span>Good communication skills (fluent english)</span></li><li><span>At least 5 years as a backend developer</span></li><li><span>With at least 3 years in go</span></li><li><span>Experience with NoSQL databases (MongoDB&nbsp;preferred)</span></li><li><span>Experience working remotely</span></li><li><span>At least one experience in multicultural work environment highly appreciated</span></li><li><span>Python experience appreciated</span></li><li><span>Experience with non-web project highly appreciated</span></li><li><span>Experience with Supply Chain or Simulation highly appreciated</span></li><li><span>Autonomous. Driven. Excited to learn.</span></li><li><span>Experience with automated testing / continuous integration.</span></li><li><span>Appreciated: MS in computer science or engineering diploma</span></li><li><span>Appreciated: Docker, AWS</span></li><li><span>Git</span></li></ul>            </div>        <div>            <a href='https://stackoverflow.com/jobs/apply/370764?reset=False&amp;ra=20lfw531QzWo&amp;oqs=a%3D20lfw531QzWo%26so_medium%3DTalent%26so_source%3DTalentApi' rel='nofollow'>                                <span>Easy apply</span>            </a>                            </div>            <h4>About CEL</h4>            <div><p>Founded in 2005, CEL is a firm specialised in Supply Chain providing IT solutions, consultancy and training B2B services around the world. We are a team of multinational people with various domain of expertise ranging from business, to data science, to logistics, to software development, to finance… A nice blend of domain and technology expertise.</p><p><strong>CEL is putting together a full product team to create a ground breaking Simulation As A Service offer that will deeply impact the supply chain industry.</strong></p><p><em>Why is Supply Chain important?</em></p><p>Take a second and look around you - everything you see has came to you through a supply chain, starting from a natural resource into your home through hundreds of activities more or less coordinated so you have what you want when you want.</p><p>So Supply Chain is everything of the physical world. Without supply chains, there are no businesses, no jobs, no buildings, no economy, nothing.</p><p>So we think that it’s kind of important.</p><p>After 15 years of working with hundred of companies that make and distribute their products (from milk to shoes, from furniture to cement, from electronics to vegetables….) we have came to a simple conclusion: it is too complex for people to operate properly. Current IT system, organisation, processes actually don’t help much. All these networks of flows are inherently inefficient.</p><p>Why? Complexity. No human brain is capable to comprehend the actual dynamics of such complex systems. No IT tool, no ERP, no fancy solution is actually taking a holistic view of the problem, instead each of these focus on improving small pieces.</p><p>The result? massive wastes of resources, enormous amount of inventory, unnecessary impact on the environment… and ultimately rare are the cases when supply actually meets demand, creating massive systemic effect and rather low customer satisfaction. Pure waste.</p><p>So we decided to really do something about it.</p><p>We are currently developing a product that that combines technologies like Data Science, Simulation Modelling, Cloud computing - backed up with years of business experience - to help companies actually assess what their future could look like and figure out what alternatives exist.</p><p>To replace the common approach of guessing what could happen, we are aiming at answering “What if” questions in an easy, sexy and fast manner.</p><p>Imagine you could simulate various scenario of your own future, would your life decisions be better? Most likely!</p><p>If the challenge is of interest to you, if you are keen to understand how product-driven businesses actually works, if you are willing to make full use of your systemic thinking and bridge the gap between the physical and virtual world, and if you have the competencies we are after, then we may pretty much want to work together to change the world!</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Shares and revenu shares</span>                            </li>                            <li>                                <span></span>                                <span>Full remote possible</span>                            </li>                            <li>                                <span></span>                                <span>Team trips to Vietnam (head office)</span>                            </li>                            <li>                                <span></span>                                <span>Yearly team retreat</span>                            </li>                            <li>                                <span></span>                                <span>Cross field product with a huge disruption potential</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "G3KNPIPaTHKLKR33g2Zxrg",
    "url": "https://stackoverflow.com/jobs/287208/senior-go-backend-developer-refurbed?a=1yjSBbW1etEY&so_medium=Talent&so_source=TalentApi",
    "title": "Senior Go Backend Developer at refurbed (Wien, Österreich) ",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:embedded/c/1",
      "DBG_TECH1:k/t/w:embedded/embedded/8",
      "DBG_TECH1:k/t/w:go/go/21",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:vue.js/frontend/24",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=1, mobile=0, go=21, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=8, frontend=29}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "go"
    ],
    "hiringOrganization": {
      "name": "refurbed – Wien, Österreich",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "EUR",
      "minValue": 42000,
      "maxValue": 70000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "EUR 42k - 70k /Year"
    },
    "employmentType": "UNSET",
    "published": "Apr 24, 2020 8:09:06 PM",
    "validThrough": "May 1, 2020 8:09:06 PM",
    "crawled": "Apr 24, 2020 8:09:07 PM",
    "content": "<h3><span>Senior Go Backend Developer</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Senior, Lead</span>                                </div>                                <div>                                    <span>Role: </span>                                    <span>Backend Developer</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Industry: </span>                                    <span>Consumer Electronics, eCommerce, Marketplace</span>                                </div>                                <div>                                    <span>Company size: </span>                                    <span>51–200 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>VC Funded</span>                                </div>                        </div>                </div>            <div>Company: refurbed – Wien, Österreich<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT+01:00) Vienna </span>                            </div>                                                    <div>                                <span>Office Location:</span>                                <span>Wien, Österreich.</span>                                    <span>Employees can also work full time from this office.</span>                            </div>                                                    <div>                                <span>Visa Sponsorship:</span>                                <span>Yes</span>                            </div>                                                    <div>                                <span>Relocation Assistance:</span>                                <span>Yes</span>                            </div>                    </div>                </div>            <h4>Technologies</h4><div>go</div><div>postgresql</div><div>rabbitmq</div><div>gin-gonic</div><div>google-cloud-platform</div>            <h4>Job description</h4>            <div><p>Your Role:</p><ul><li>Development of our main API</li><li>Development of our smaller backend services</li><li>Integration of&nbsp;external systems into our platform</li></ul><p>Your Profile:&nbsp;</p><ul><li>Formal education in computer science</li><li>Significant experience designing and implementing backend&nbsp;services</li><li>Significant experience with software development in Go</li><li>Good knowledge of SQL and relational database design</li><li>You work independently and goal oriented</li><li>You have excellent English skills</li></ul><p>Additional factors we appreciate:</p><ul><li>You have experience with PostgreSQL</li><li>You are comfortable working with Linux/*BSD</li><li>You have experience working with backend services like Nginx or RabbitMQ</li><li>You have experience with Kubernetes/GCP</li><li>You are active in the open-source community</li><li>You can speak German</li></ul>            </div>        <div>            <a href='https://stackoverflow.com/jobs/apply/287208?reset=False&amp;ra=1yjSBbW1etEY&amp;oqs=a%3D1yjSBbW1etEY%26so_medium%3DTalent%26so_source%3DTalentApi' rel='nofollow'>                                <span>Easy apply</span>            </a>                            </div>            <h4>About refurbed</h4>            <div><p>We are the&nbsp;<strong>fastest-growing marketplace for refurbished electronics</strong>&nbsp;in the German-speaking region. Our products save up to&nbsp;<strong>70% of CO<sub>2</sub>&nbsp;emissions</strong>&nbsp;in comparison to a new device and are also up to&nbsp;<strong>40% cheaper</strong>. Additionally, for every sold device we plant a tree and we were already able to plant&nbsp;<strong>more than 200,000 trees</strong>&nbsp;to fight global warming.</p><p>We were founded in February 2017 and grew to&nbsp;<strong>more than 80 employees in less than three years</strong>&nbsp;and expanded to Italy and Poland already. Along the way we won several awards and have already sold tens of thousands of products, making us one of the<strong>&nbsp;fastest-growing startups in Europe in 2020.</strong>&nbsp;Additionally, we recently announced&nbsp;one of&nbsp;<strong>Austria's biggest Series A funding rounds of € 15.6 mn.&nbsp;</strong></p><p>Our main system consists of an&nbsp;HTTP API and backend workers written in Go, a&nbsp;public interface serving HTML pages to our customers written in Go and connecting to our API, Vue.js interfaces embedded into our public interface, and a standalone Vue.js management interface.</p><p>Key technologies are: Go, Vue.js, PostgreSQL, RabbitMQ and AMQP.</p><p>Together with you we want to&nbsp;<strong>build the leading marketplace for refurbished electronics in Europe.</strong></p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Remote work</span>                            </li>                            <li>                                <span></span>                                <span>Highly skilled team</span>                            </li>                            <li>                                <span></span>                                <span>Flexible working hours</span>                            </li>                            <li>                                <span></span>                                <span>Sustainability driven business</span>                            </li>                            <li>                                <span></span>                                <span>Startup atmosphere</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "MgSix1QdTjWTuGGVypZRrw",
    "url": "https://stackoverflow.com/jobs/336927/engineering-manager-cloud-infrastructure-full-heetch?a=1OZGgs13fYek&so_medium=Talent&so_source=TalentApi",
    "title": "Engineering Manager, Cloud Infrastructure - Full Remote in Europe at Heetch  ",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Heetch – No office location",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 24, 2020 8:09:06 PM",
    "validThrough": "May 1, 2020 8:09:06 PM",
    "crawled": "Apr 24, 2020 8:09:07 PM",
    "content": "<h3><span>Engineering Manager, Cloud Infrastructure - Full Remote in Europe</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Lead, Manager</span>                                </div>                                <div>                                    <span>Industry: </span>                                    <span>Carsharing, Marketplace, Transportation</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Company size: </span>                                    <span>201–500 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>Private</span>                                </div>                        </div>                </div>            <div>Company: Heetch – No office location<br></div><h4>Technologies</h4><div>microservices</div><div>go</div><div>mesos</div><div>marathon</div><div>amazon-web-services</div>            <h4>Job description</h4>            <div><p><strong>ℹ️</strong><u><strong>Note before applying:</strong></u> We're a young company iterating over our remote culture so for now, we're only working with people in locations where the time zone is: <strong>-1 hour &gt; France time zone&nbsp;&lt;&nbsp;+1 hour</strong></p><p><strong>Infrastructure Team at Heetch</strong></p><p>Heetch’s growing infrastructure reliably supports over ten thousand rides in five countries and a dozen cities. It handles millions of API requests and events every day without a snag.&nbsp;Currently, our distributed infrastructure, built on AWS and architected with open source components such as Mesos, Docker, ZooKeeper and Kafka orchestrates 160+ microservices, developed by 16+ teams. We are looking for an Engineering Manager to help expand our system to reliably support more rides in more countries. We are looking for someone technical, with experience in building and scaling distributed infrastructure. If this sounds like you,then join our infrastructure team and help us define and bring our technical vision to light. Come help us tackle big infrastructure challenges that supports events, API requests and services at scale.</p><p><strong>Our Values</strong></p><p><strong>- Make it happen:&nbsp; </strong>Bring intensity and discipline, but focus on important work.</p><p><strong>- Common interest first:</strong> Never let a teammate behind and embrace change.</p><p><strong>- Kindness: </strong>You treat people with respect regardless of their status or disagreement with you. Always assume good intentions.</p><p><strong>- Communicate Wisely: </strong>Listen to one another: everybody has the same right to speak up.</p><p><strong>- Free Mind: </strong>Accept everyone for who they are and embrace differing perspectives to make better decisions.</p><p><strong>What will you do?</strong></p><p>As an Engineering Manager, you will manage a fast-growing remote team to help us improve the performance and reliability of our current systems. You will maintain and build the automated systems that will allow us to scale our infrastructure to support our growth and our international expansion. You will also work hard to create a healthy environment with the team where it's safe to experiment while moving fast.</p><p><strong>Deliver</strong></p><p>- Work with Engineering, Product, and Data teams to facilitate project delivery by ensuring alignment and on time delivery</p><p>- Define, implement, and oversee a flexible and effective development process to reach the team's delivery goals</p><p>- Offer a collaborative and welcoming development environment for your team members</p><p>- Deliver high quality, availability, reliability, scalability, and secure distributed systems</p><p><strong>Coach</strong></p><p>- Support and inspire an ambitious group of engineers in their career goals</p><p>- Work with our people operations team to maintain our high performance and high morale</p><p>- Oversee a distributed team (fully remote across Europe) of motivated engineers spanning all experience levels</p><p>- Facilitate continuous learning and improvement for the team and its members</p><p>- Provide technical and non-technical guidance to the team, both individually and as a group</p><p>- Maximize team productivity and build loyalty by deeply understanding &amp; incorporating various motivations, working styles and preferences</p><p>- Cultivate high engagement, performance and commitment to the product through a motivational &amp; visionary approach</p><p>- Develop and mentor upcoming leaders and key engineers</p><p><strong>Hire</strong></p><p>- Be actively involved in hiring and growing our engineering team</p><p>- Plan and implement hiring strategies to attract talent within your team</p><p>- Advocate for engineering and management on the blog or at social and tech events</p><p><strong>Drive changes</strong></p><p>- Help us grow and evolve our engineering culture</p><p>- Work with other engineering managers to drive cultural changes across the organisation</p><p><strong>Does it sound&nbsp;like you?</strong></p><p>- You’ve managed teams that designed and operated critical infrastructure, particularly with a broad experience across service orchestration, deployment systems and the cloud.</p><p>- You know how to balance the reliability, usability, compliance and cost of critical systems.</p><p>- You have more than 4 years of engineering leadership experience with at least 2 years managing multiple teams in various locations.</p><p>- You have already worked in a fast-paced environment within a fast-growing company.</p><p>- You have strong communication skills: You're able to interact with a variety of people, technical or non-technical.</p><p>- You show a significant track record of attracting, retaining, and mentoring top talent within the industry.</p><p><strong>What's next?</strong></p><p>If your application is selected, the process will be composed of 4 steps:</p><p>1. Interview with a Technical Recruiter (45mn)</p><p>2. Interview with the CTO</p><p>3. Interview with 2 Engineering Manager peers (1h)</p><p>4. Day on site (Paris) to meet your future teammates and stakeholders</p>            </div>        <div>        <a href='https://jobs.lever.co/heetch/9a19bbaa-71e3-49a8-9c6e-af37569a6d2a?lever-origin=applied&amp;lever-source%5B%5D=StackOverflow' rel='nofollow'>            Apply        </a>                            </div>            <h4>About Heetch</h4>            <div><p>Heetch is a ride-hailing platform powering thousands of rides everyday in France, Belgium and multiple French-speaking countries in Africa. We provide a mobility solution allowing people to move around the city in an affordable yet reliable way by turning a moment as simple as a ride into an unexpectedly positive experience. Founded in 2013 with headquarters in Paris, Heetch has completed its series B funding in order to accelerate its international growth and build the future of mobility. Come work with us and find out what you can do!</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Full-remote &amp; remote friendly environment</span>                            </li>                            <li>                                <span></span>                                <span>Paid conferences attendance/travel</span>                            </li>                            <li>                                <span></span>                                <span>Annual company retreat</span>                            </li>                            <li>                                <span></span>                                <span>Team retreats</span>                            </li>                            <li>                                <span></span>                                <span>Heetch Credits</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "LMS9grkCSXmoFY493yHP5A",
    "url": "https://stackoverflow.com/jobs/235208/senior-go-developer-remote-x-team?a=1gSEmzL9KDTi&so_medium=Talent&so_source=TalentApi",
    "title": "Senior Go Developer (Remote) at X-Team  ",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:angular/frontend/8",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go-developer/go/26",
      "DBG_TECH1:k/t/w:go/go/15",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:vue.js/frontend/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=49, nodejs=14, bigdata-ml=10, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=25}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "X-Team – No office location",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 24, 2020 8:09:06 PM",
    "validThrough": "May 1, 2020 8:09:06 PM",
    "crawled": "Apr 24, 2020 8:09:07 PM",
    "content": "<h3><span>Senior Go Developer (Remote)</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Mid-Level, Senior, Lead</span>                                </div>                                <div>                                    <span>Role: </span>                                    <span>Data Scientist</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Industry: </span>                                    <span>Software Development</span>                                </div>                                <div>                                    <span>Company size: </span>                                    <span>51–200 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>Private</span>                                </div>                        </div>                </div>            <div>Company: X-Team – No office location<br></div><h4>Technologies</h4><div>go</div><div>machine-learning</div><div>python</div><div>node.js</div>            <h4>Job description</h4>            <div><p><strong>Most important:</strong></p><ul><li>3+ years of experience in software development</li><li>Outstanding experience in Go (Golang)</li><li>Experience with RESTful web services</li><li>Experience with relational and graph databases</li><li>Write well designed, testable, efficient code</li><li>A passion and curiosity for creating and building things</li></ul><p><strong>Nice to have:</strong></p><ul><li>Experience working remotely</li><li>Familiar/involved with open source projects</li><li>Experience working within a continuous integration and deployment (CI/CD) environment</li><li>Experience working with a front end JavaScript framework (e.g. React, Vue, Angular)</li></ul><p><strong>Personal:</strong></p><ul><li>Independent, self-motivated</li><li>Fluent in English, written and spoken</li><li>Proven track record of always learning and growing</li><li>Proactive attitude</li><li>Possess a spirit of generosity</li></ul><p><strong>Perks:</strong></p><ul><li>Get the chance to work with big brands like Riot Games (League of Legends), Sony, Fox Broadcasting, Kaplan Inc. (top education company), Coinbase (#1 crypto exchange), BeachBody (#1 fitness company), etc.</li><li>Work from anywhere as part of a community of digital nomads.</li><li>Live and work in one of our roaming hacker houses (<a href='https://bit.ly/2mdrB5N' rel='nofollow'>X-Outposts</a>) around the world:&nbsp;</li><li>Be part of the most energizing community for developers in the world by participating in our&nbsp;<a href='https://youtu.be/Th80vOGFvUE' rel='nofollow'>Seasons</a>, a 3-month experience filled with challenges, rewards, RPGs, competitions, and more, all centered around a theme that will inspire and energize you.&nbsp;</li><li>Get $2,500 per year (<a href='https://x-team.com/unleash' rel='nofollow'>Unleash+</a>) to spend on doing more of what you love and staying energized. Use it on conferences, courses, video games, photography gear, music gear, cooking gear, a gym membership, adventure sports, baby/pet sitting, productivity apps, restaurants, coworking, movie tickets, headphones, etc.</li></ul>            </div>        <div>        <a href='https://x-team.com/remote-go-developer-jobs/?utm_source=stackoverflow&amp;utm_medium=board' rel='nofollow'>            Apply        </a>                            </div>            <h4>About X-Team</h4>            <div><p><strong>&quot;X-Team provides high-performing, on-demand teams of developers for leading brands.&quot;</strong></p><p><a href='https://youtu.be/djmQ6W_qmNg' rel='nofollow'>Watch this video</a>&nbsp;from our CEO to learn more about the X-Team experience and the inspiration behind it.</p><p><a href='https://x-team.com/' rel='nofollow'>X-Team</a>&nbsp;is a 100% remote company that’s helped companies build remote development teams for more than a decade.</p><p>We believe in living a life of freedom that allows you to spend more time staying energized by doing more of what makes you come alive.</p><p>“These guys are from the future.” - Biz Stone, Twitter co-founder</p><p>The X-Team lifestyle, centered around passionate people doing more of what energizes them, attracts thousands of developers to apply every day.</p><p>If you want to be motivated to learn, grow and explore in an environment rooted in respect and positive energy, X-Team is where you belong. Join us and our community of developers from 40+ countries around the world as we continue to build the most energizing community for developers.</p><p><strong>Who is X-Team meant for?</strong></p><p>A potential X-Teamer is a developer with experience working on large-scale, remote teams and projects. They are self-motivated, proactive, and have a strong team spirit. If you're tired of the traditional freelancing platforms, you'll be happy to hear that we’re so much more. X-Team is a community of like-minded individuals, carefully chosen to ensure that they can become part of the community of the most motivated people in the world who come together to unleash their potential. What we've created is truly special and not merely a faceless platform. X-Team is where developers go to feel truly at home together while becoming more motivated than they've ever been.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Get the chance to work with big brands</span>                            </li>                            <li>                                <span></span>                                <span>Live and work in one of our roaming hacker houses around the world</span>                            </li>                            <li>                                <span></span>                                <span>Work from anywhere as part of a community of digital nomads</span>                            </li>                            <li>                                <span></span>                                <span>Join our vibrant community</span>                            </li>                            <li>                                <span></span>                                <span>We provide up to $2,500 in funding for your growth &amp; wellbeing</span>                            </li>                            <li>                                <span></span>                                <span>Gym reimbursement</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "jOOthZBCSjyQBozxXVGooA",
    "url": "https://jobmote.com/job/4510137/earn-up-to-80-a-day-completing-simple-surveys-start-today-westminster-co-usa/",
    "title": "Earn up to $80 a Day Completing Simple Surveys - Start Today (Westminster, CO, USA)",
    "tags": [
      "DBG:surround``work 2W from 2W home 3W OR(whenev,wherev,agil)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "InboxDollars",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 300,
      "maxValue": 3000,
      "info": "",
      "unit": "MONTH",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": "USD 300 - 3000 /Month"
    },
    "employmentType": "UNSET",
    "published": "Apr 24, 2020 10:29:30 AM",
    "validThrough": "Apr 27, 2020 10:29:30 AM",
    "crawled": "Apr 24, 2020 8:09:07 PM",
    "content": "<div><ul><li><p><strong><span><b>Immediate Start. No Joining Fee. Work from Home/ Remote Job.</b></span></strong></p><p><strong><span><b>Join Today &amp; Receive $5! (Offer Only Available until Tomorrow)</b></span></strong></p><p></p><p><span>InboxDollars pays members to </span><strong><span><b>read emails, take surveys online, play games, and go shopping! </b></span></strong><span>New users also </span><strong><span><b>receive $5 just for joining.</b></span></strong></p><p></p><p>We are currently looking for members to start working online and from home - flexible hours. All you need is a smartphone, tablet or laptop to get involved.</p><p></p><p><span>InboxDollars could help you </span><strong><span><b>earn up to $80 a day </b></span></strong><strong><span>t</span></strong><span>o</span><span> put towards whatever you like by completing Competitions, Offers, Games and Surveys from some of the UK’s top brands.</span></p><p></p><ul><li><p>Earn up to $80 a day</p></li><li><p>Payments via BACS or PayPal</p></li><li><p>Work from home</p></li><li><p>Immediate start</p></li></ul><p></p><p>You could earn up to $80 a day for completing simple tasks. Flexible working means you can be your own boss and work from home whenever you like.</p><p></p><p><strong><span><b>Suitable for full-time, part-time, evening and weekend workers or anyone looking for temporary income. </b></span></strong><span>No matter what your role, no previous experience is required to earn money for completing online tasks.</span></p><p><em><span>The amount of money you can earn depends on the offers you choose to complete.</span></em></p><p><strong><span><b></b></span></strong></p><p><strong><span><b>Click Apply Now to get started!</b></span></strong></p></li></ul><p><span><strong></strong></span></p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
