{
 "items": [
  {
    "id": "5GGHNvQxRy6dyJQu3dsyag",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/143072/field-application-engineer-consultant-for-iot-proemion?a=LYSsZLEC1OM",
    "title": "Field Application Engineer / Consultant for IoT Tech Company (m/f) at PROEMION (Fulda, Deutschland) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Embedded Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Services, Information Technology, Telematics</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Privat</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We give our customers the technology they need to globally transmit and analyze CAN-based telemetry data of mobile industrial machinery and therefore boost their efficiency.</p><p>We are at the forefront of the IoT/Telematics revolution and are looking for an enthusiastic <strong>Field Application Engineer / Consultant</strong> for our <strong>Embedded Systems</strong> <strong>and/or</strong> <strong>Cloud</strong> <strong>Web Services</strong>. We offer the position on-site in Fulda, Germany (relocation support offered) or as a full-time remote position at the earliest possible date.</p><p>You will be working closely with our sales and engineering teams to map customer business and to adapt our connectivity solution to fully integrate it into our customers’ value chain. Required is a combination of strong software (and hardware technical skills) plus excellent communication skills. Strong debug skills are essential as is the ability to time manage and service multiple large customers concurrently.</p><p><strong>Skills &amp; Requirements</strong></p><p><strong>Your Role</strong></p><ul><li>You act as a bridge between our internal engineering teams and our customers to develop technical solutions based on our products and services</li><li>You ensure the on-site technical integration of our telematics solutions at the customer to enable solution integration and issue resolution</li><li>You discuss new product definitions with the customer such as the implementation of custom protocols or the integration of web applications via our APIs</li><li>You are able to build and demonstrate proof-of-concepts that meets or exceeds customer business needs</li><li>You create the necessary technical documentation to support the customer</li><li>You consult our customers on best practices during the roll-out of our connectivity solution</li></ul><p><strong>Your Skills and Personality</strong></p><ul><li>Bachelors' or Masters' degree in engineering discipline; computer science, computer engineering or electrical engineering preferred</li><li>Minimum 2 years' related consultancy experience in a technical environment</li><li>Highly technical problem solver who understands system architecture, hardware and software interaction</li><li>Technical knowledge of Telematics/IoT/Global Connectivity applications and market, with a proven experience in such system development</li><li>Familiarity with CAN bus systems and microcontroller based devices and/or big data technologies and web Services</li><li>You are willing to travel and show a great business sense</li><li>Excellent team member with great communication and interpersonal skills and ability to progress in autonomy</li><li>You are able to work effectively in a high pressure environment</li></ul>                    </div>                            <h2>                About PROEMION            </h2>            <div><p><strong>About Proemion</strong></p><p>Since 1987 Proemion has delivered CAN devices and connectivity solutions for the most demanding industrial applications. The world’s most respected industrial equipment companies rely on Proemion, to design and build top-notch telematics solutions that enhance performance and safety. On the embedded side, we manufacture Telematics devices to collect and transmit CAN-based telemetry data. On the web services side, we use the latest Big Data technologies to process, analyze, and serve billions of data points through our APIs and web portal.</p><p><strong>We offer you</strong></p><ul><li>A dynamic environment, short communication ways and a flat hierarchy in an international Team</li><li>Room for innovative work in a highly attractive technology field</li><li>An attractive salary and development opportunities</li><li>Modern premises centered in the middle of Germany featuring lounge, kicker-table, pool table, Team events, additional allowance for a Fitness Club membership and child care, flextime, free soft drinks and fruit</li></ul><p>Are you curious?</p><p>We’re looking forward to your application via our career portal (<a href='https://career.proemion.com' rel='nofollow'>https://career.proemion.com</a>)&nbsp;or via mail (<a href='mailto:career@proemion.com' rel='nofollow'>career@proemion.com</a>)!</p><p><strong>Let’s build something great together!</strong></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive salary                            </div>                            <div>                                 Billiard table                            </div>                            <div>                                 Mentoring programm                            </div>                            <div>                                 Modern development environment                            </div>                            <div>                                 Team events                            </div>                            <div>                                 Sport sponsoring                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 10:59:50 PM",
    "tags": [
      "DBG_TECH1:k_t_w:boost_c_8",
      "DBG_TECH1:k_t_w:microcontroller_embedded_8",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=8, gamedev=0, mobile=0, php=0, nodejs=0, embedded=8, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_c",
      "TECH1_embedded",
      "TECH2_continuous-integration",
      "TECH2_embedded",
      "TECH2_iot",
      "TECH2_web-services",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "c",
      "continuous-integration",
      "embedded",
      "iot",
      "web-services"
    ]
  },
  {
    "id": "JZhJePxjR2y38nvKcZ0ayQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4037-hardware-firmware-engineer-cabana-blockchain",
    "title": "Hardware - Firmware Engineer @ Cabana Blockchain",
    "content": "<h2>              Hardware - Firmware Engineer<small> @ Cabana Blockchain</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-12-05 21:20</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>About Us</strong></p><p>Cabana Blockchain is a privately-owned stealth startup company that develops IoT devices which use a blockchain.</p><p>We started as an idea and a simple proof of concept. Then we were acquired and relocated to San Francisco, right in Silicon Valley. We employ creative problem solvers to work in our office and to work remotely from anywhere around the world.</p><p><strong>Our Mission</strong></p><p>There are many problems current IoT devices on the market face that we wish to solve. Using our own blockchain technology helps us achieve this.</p><p>Above all else, we value our customer’s privacy and security because a home is the most intimate place a person can be. We are a hardware company, looking to develop and sell hardware. This means that we don’t collect or store data about our customers. Our devices are designed to operate without storing customer data on our servers.</p><p>We believe that we can succeed without harvesting our customer’s data because our hardware will succeed. Each one of our devices is the result of clever engineering and fine craftsmanship. We never plan for obsolescence and the quality and testing of our products ensures that they will operate for a very long time.</p><p>The functionality of our devices is not dependent on the existence of Cabana Blockchain. Our devices will continue to operate even if we go out of business.</p><p>At Cabana Blockchain, firmware is what gives our devices intelligence. We are looking for Firmware Engineers to join our team and help us create devices that go into people’s homes.</p><p><strong>Responsibilities:</strong></p><ul><li>Work with our hardware team to design and program embedded systems</li><li>Work with our software team to bring our devices online</li></ul><p><strong>Requirements:</strong></p><ul><li>Bachelor’s degree (or equivalent) in electrical, computer, or firmware engineering</li><li>5+ years of work experience</li><li>Experience programming embedded systems in C/C++</li><li>Programming drivers for microcontroller peripherals</li><li>Using real-time operating systems</li><li>Consuming APIs on embedded systems</li></ul><p>To learn how to apply, please see our <a href='https://cabanablockchain.com/careers' rel='nofollow'>Careers</a> page.</p><p><em>Cabana Blockchain provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, gender, sexual orientation, national origin, age, disability or genetics.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 11:19:58 PM",
    "tags": [
      "DBG_TECH1:k_t_w:microcontroller_embedded_8",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=8, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_embedded",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "MIQ0e74RR-GFwLnIaAhpAw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63476",
    "title": "Hardware Firmware Engineer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>About Us</strong><br><br>Cabana Blockchain is a privately-owned stealth startup company that develops IoT devices which use a blockchain.<br><br>We started as an idea and a simple proof of concept. Then we were acquired and relocated to San Francisco, right in Silicon Valley. We employ creative problem solvers to work in our office and to work remotely from anywhere around the world.<br><br><strong>Our Mission</strong><br><br>There are many problems current IoT devices on the market face that we wish to solve. Using our own blockchain technology helps us achieve this.<br><br>Above all else, we value our customer’s privacy and security because a home is the most intimate place a person can be. We are a hardware company, looking to develop and sell hardware. This means that we don’t collect or store data about our customers. Our devices are designed to operate without storing customer data on our servers.<br><br>We believe that we can succeed without harvesting our customer’s data because our hardware will succeed. Each one of our devices is the result of clever engineering and fine craftsmanship. We never plan for obsolescence and the quality and testing of our products ensures that they will operate for a very long time.<br><br>The functionality of our devices is not dependent on the existence of Cabana Blockchain. Our devices will continue to operate even if we go out of business.<br><br>----<br><br>At Cabana Blockchain, firmware is what gives our devices intelligence. We are looking for Firmware Engineers to join our team and help us create devices that go into people’s homes.<br><br><strong>Responsibilities:</strong><br><br></p><ul><li>Work with our hardware team to design and program embedded systems<br></li><li>Work with our software team to bring our devices online<br><br><strong>Requirements:</strong><br><br></li><li>Bachelor’s degree (or equivalent) in electrical, computer, or firmware engineering<br></li><li>5+ years of work experience<br></li><li>Experience programming embedded systems in C/C++<br></li><li>Programming drivers for microcontroller peripherals<br></li><li>Using real-time operating systems<br></li><li>Consuming APIs on embedded systems<br><br>To learn how to apply, please see our <a href='https://cabanablockchain.com/careers' rel='nofollow'>Careers</a> page.<br><em>Cabana Blockchain provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, gender, sexual orientation, national origin, age, disability or genetics.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 11:19:58 PM",
    "tags": [
      "DBG_TECH1:k_t_w:microcontroller_embedded_8",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=8, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_embedded",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "kG-EK_IJTEGHzcPyv8SLMA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/64092/client-success-executive-sustainability-food-tech-startup-at-winnow-solutions/",
    "title": "Client Success Executive (sustainability food tech startup)",
    "content": "DESCRIPTION<br /><br />This is an exciting opportunity for a Client Success Executive to play an instrumental role in on-boarding and implementing our technology across one of our largest clients. The goal – successful deployments of new sites and ongoing success with existing sites to ensure they achieve their waste reduction targets.<br /><br />As a Client Success Executive, you will be helping our clients on-board, implement, drive food waste reductions and sustain change through our technology.<br /><br />Our mission is to reduce food waste globally; driving food waste reduction at site level is how this is achieved, and you will be responsible for helping our clients achieve this.<br /><br /><br /><br />KEY OBJECTIVES<br /><br />Build exceptionally strong relationships with clients ensuring they are bought in to making the Winnow system successful<br />Setup systems, menus and client profiles with our systems, enabling smooth onboarding<br />Train multi-disciplined teams to use Winnow both in person, in central training locations and remotely<br />Help chefs and managers embed Winnow into their daily operation<br />Work with clients to ensure their waste reduction targets are met through monitoring site performance<br />Analyse client reports and troubleshoot with the client where needed<br />Develop and manage KPIs jointly with the client and the implementation lead to ensure that the system is delivering a strong business case, implementing changes where necessary<br />Improve processes that lead to an even better customer experience<br />Gather client feedback and build it into our working processes or product backlog<br />An initial focus on implementing our technology across one of our largest clients<br /><br /><br /><br />REQUIREMENTS<br /><br />Education and experience<br /><br />You are degree educated and might have completed studies in a hospitality or environmental related subject<br />You may have experience within the hotel industry, ideally having worked within F&amp;B for a multi-national organisation<br />You will ideally have an intermediate to expert level of Excel and working knowledge of Word and Powerpoint<br />You will have had a minimum of two to three years working experience in Account Management, Consultancy, Client Success or a related field<br />Personal attributes<br /><br />You have proven experience of knowing what it takes to provide consistently first-class customer service to external customers, remaining calm and measured even when dealing with the most demanding individuals.<br />You are comfortable taking ownership and accountability for your work whilst working effectively as part of a larger team.<br />You are able to work independently with low supervision.<br />You have excellent attention to detail and a meticulous eye for identifying inconsistencies or inaccuracies in data. You take your time to get things right first time.<br />You have a solid grasp of financial analysis to build clear a business case for your customers.<br />You are organised and have effective scheduling, prioritisation and time management skills. You can manage multiple tasks in parallel and complete tasks to tight deadlines even when under pressure.<br />You are able to demonstrate excellent communication skills and have experience in dealing with individuals at all levels of seniority. You communicate clearly in both written and spoken language. You listen attentively; you process and comprehend what you hear and have the confidence to ask questions and to clarify ambiguous points.<br />You are a highly motivated, data driven person, who can use data to track the success of your clients and clearly communicate this back to them, as well as the business development team.<br />You understand how to manage change and are happy to ‘get your hands dirty’ in order to achieve the desired results.<br />You have a good understanding of continuous process improvement and good analytical acumen.<br />You are experienced in creating reports, analysing data and influencing client’s day to day decisions using findings.<br />You are both passionate and measured. You carefully balance the need for quick solutions and pragmatism with the ability to step back, take in the bigger picture and build for the long term. You listen to and act on what your customers need.<br />You are transparent in approach and enjoy healthy, respectful debate. You work hard to build open and honest collaborative relationships.<br />You get things done at pace and seek to continually improve. Your customers see you as someone who gets things done, and they want you on their team<br />You are passionate about the value of food and are committed to playing an active role in fight against food waste.<br />You are humble in approach and quick to pitch in if you see someone struggling, regardless of the task.<br /><br /><br /><br />BENEFITS<br /><br />Competitive base salary<br />Committed team members with broad experience who share a common passion to build a world class business<br />Shared office space in central London with free happy hours and a great working environment<br />Company part-funded health insurance<br />Matching pension scheme<br />25 days of paid vacation time in addition to national holidays<br />You will love what you do – waking up every day solving one of the biggest social problems of our generation",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 5:55:49 PM",
    "tags": [
      "DBG_TECH1:k_t_w:embed_embedded_2",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=2, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_embedded",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "fu9N8xxpRxeRAXjC5JzxHQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/143072/field-application-engineer-consultant-for-iot-proemion-gmbh?a=LYSsZLEC1OM",
    "title": "Field Application Engineer / Consultant for IoT Tech Company (m/f) at PROEMION GmbH (Fulda, Germany) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Services, Information Technology, Telematics</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company type: </span>                                            <span>Privat</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We give our customers the technology they need to globally transmit and analyze CAN-based telemetry data of mobile industrial machinery and therefore boost their efficiency.</p><p>We are at the forefront of the IoT/Telematics revolution and are looking for an enthusiastic <strong>Field Application Engineer / Consultant</strong> for our <strong>Embedded Systems</strong> <strong>and/or</strong> <strong>Cloud</strong> <strong>Web Services</strong>. We offer the position on-site in Fulda, Germany (relocation support offered) or as a full-time remote position at the earliest possible date.</p><p>You will be working closely with our sales and engineering teams to map customer business and to adapt our connectivity solution to fully integrate it into our customers’ value chain. Required is a combination of strong software (and hardware technical skills) plus excellent communication skills. Strong debug skills are essential as is the ability to time manage and service multiple large customers concurrently.</p><p><strong>Skills &amp; Requirements</strong></p><p><strong>Your Role</strong></p><ul><li>You act as a bridge between our internal engineering teams and our customers to develop technical solutions based on our products and services</li><li>You ensure the on-site technical integration of our telematics solutions at the customer to enable solution integration and issue resolution</li><li>You discuss new product definitions with the customer such as the implementation of custom protocols or the integration of web applications via our APIs</li><li>You are able to build and demonstrate proof-of-concepts that meets or exceeds customer business needs</li><li>You create the necessary technical documentation to support the customer</li><li>You consult our customers on best practices during the roll-out of our connectivity solution</li></ul><p><strong>Your Skills and Personality</strong></p><ul><li>Bachelors' or Masters' degree in engineering discipline; computer science, computer engineering or electrical engineering preferred</li><li>Minimum 2 years' related consultancy experience in a technical environment</li><li>Highly technical problem solver who understands system architecture, hardware and software interaction</li><li>Technical knowledge of Telematics/IoT/Global Connectivity applications and market, with a proven experience in such system development</li><li>Familiarity with CAN bus systems and microcontroller based devices and/or big data technologies and web Services</li><li>You are willing to travel and show a great business sense</li><li>Excellent team member with great communication and interpersonal skills and ability to progress in autonomy</li><li>You are able to work effectively in a high pressure environment</li></ul>                    </div>                            <h2>                About PROEMION GmbH            </h2>            <div><p><strong>About Proemion</strong></p><p>Since 1987 Proemion has delivered CAN devices and connectivity solutions for the most demanding industrial applications. The world’s most respected industrial equipment companies rely on Proemion, to design and build top-notch telematics solutions that enhance performance and safety. On the embedded side, we manufacture Telematics devices to collect and transmit CAN-based telemetry data. On the web services side, we use the latest Big Data technologies to process, analyze, and serve billions of data points through our APIs and web portal.</p><p><strong>We offer you</strong></p><ul><li>A dynamic environment, short communication ways and a flat hierarchy in an international Team</li><li>Room for innovative work in a highly attractive technology field</li><li>An attractive salary and development opportunities</li><li>Modern premises centered in the middle of Germany featuring lounge, kicker-table, pool table, Team events, additional allowance for a Fitness Club membership and child care, flextime, free soft drinks and fruit</li></ul><p>Are you curious?</p><p>We’re looking forward to your application via our career portal (<a href='https://career.proemion.com' rel='nofollow'>https://career.proemion.com</a>)&nbsp;or via mail (<a href='mailto:career@proemion.com' rel='nofollow'>career@proemion.com</a>)!</p><p><strong>Let’s build something great together!</strong></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive salary                            </div>                            <div>                                 Billiard table                            </div>                            <div>                                 Mentoring programm                            </div>                            <div>                                 Modern development environment                            </div>                            <div>                                 Team events                            </div>                            <div>                                 Sport sponsoring                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k_t_w:boost_c_8",
      "DBG_TECH1:k_t_w:microcontroller_embedded_8",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=8, gamedev=0, mobile=0, php=0, nodejs=0, embedded=8, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_c",
      "TECH1_embedded",
      "TECH2_continuous-integration",
      "TECH2_web-services",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "c",
      "continuous-integration",
      "embedded",
      "web-services"
    ]
  }
]
}
