{
 "items": [
  {
    "id": "W6n8unNRT4imBVP2Qt3NJA",
    "url": "http://jobmote.com/jobs/24419-senior-developer-remote-possibilities",
    "title": "Senior Developer (Remote Possibilities)",
    "tags": [
      "DBG:surround``2N( OR(feasibl,OR(consid,consider),occas,possibl), remot)",
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:unity3d/gamedev/8",
      "DBG_TECH1:k/t/w:unity3d/mobile/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=5, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "FitXR",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 4, 2018 3:20:47 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p><strong>Position Summary</strong></p><p>Are you passionate about gaming and fitness / sports? Do you want to get involved in combining games and technology to redefine fitness?</p><p>As a Senior Developer, you will be responsible for being an awesome generalist developing major game components, systems and tools as well as solving unique and challenging technical problems. You will collaborate closely with other development team members to create innovate fitness games and platform to transform the fitness gaming genre. As you will play a critical role in developing games and the platform, you will need exceptional knowledge and skills in many different aspects of game and technology development.</p><p>This is a permanent position based at our studio in South Bank, London, a 5 to 10 minute walk from London Waterloo and London Blackfriars. For the right candidate, this can be a part/fully remote position (UK only).</p><p><strong>About FitXR</strong></p><p>FitXR is a fitness game developer redefining the rules of fitness through technology and entertainment to enhance well being of the digital era. Our first product, BoxVR has won multiple awards and the game has been incorporated into players' lifestyle. We help burn calories and bring fun into fitness.</p><p>FitXR was founded in 2016 by two tech and game enthusiasts with passion for fitness. Teaming up with real fitness instructors, the team has grown to include developers and business leaders from some of the world's leading entertainment companies such as Electronic Arts, Sony, King and Media Molecule.</p><p><strong>Responsibilities</strong></p><ul><li>Work closely with other development team members to design, prototype and implement new game content and gameplay improvements from a technical perspective to result in efficient and scalable systems. </li><li>Help lead development planning including identifying technical risks/issues and coming up with solutions to overcome them. </li><li>Become an expert in the system and tools required for game development. </li><li>Assist with codebase maintenance to improve efficiency and maintainability of code. </li></ul><p><strong>Required Skills and Experience</strong></p><ul><li>Bachelor's degree in Computer Science or related discipline. </li><li>Experience with multiple disciplines of programming such as gameplay, system UI, tools, audio, etc. </li><li>Demonstrable games development experience on PC and console titles. Proven track record of successful releases. </li><li>Strong technical design skill, excelling in developing, documenting and communicating complex design ideas. </li><li>3+ years of experience with Unity. </li><li>Very strong debugging skills and proficient in identifying performance bottlenecks and ways to resolve them. </li><li>Flexibility and ability to adapt new technical challenges and changes. </li><li>Advanced understanding of the challenges multiplatform development brings. </li><li>Effectively communicate with people from wide range of expertise and responsibilities. </li><li>Strong analytical skills. </li></ul><p><strong>Desired Skills and Experience</strong></p><ul><li>Experience in prototyping and rapid iteration. </li><li>Experience with 3D asset content pipelines such as Maya </li><li>Experience in designing, developing and maintaining sound related systems. </li><li>Experience with Steam API and PSN. </li><li>Experience in VR / AR / MR software development. </li><li>Experience with PlasticSCM. </li><li>Passion for games, fitness, sports and music. </li></ul><p><strong>Benefits</strong></p><ul><li>Focussed, friendly and creative working environment. </li><li>Flexible office hours. </li><li>Competitive compensation (incl. stock) , perks, bonuses. </li><li>Fun team events. </li></ul><p>All candidates must be eligible to work in the UK.</p><p></p></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "uFiARO9mQW-Aa5xvX7A0AA",
    "url": "https://jobspresso.co/job/full-stack-marketing-developer/",
    "title": "Full-Stack Marketing Developer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=6}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "Doist",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2018 4:26:53 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Full-Stack Marketing Developer</h2><div>Developer<br></div><div>Anywhere<br></div><div>Company: Doist<br></div><div>Full Time<br></div><h3>Overview</h3><p>At Doist, our mission is to inspire the workplace of the future by creating simple yet powerful productivity tools that promote a calmer, more balanced, more fulfilling way to work and live.</p><p>We envision a future in which people can work without distractions from anywhere in the world on things that they are passionate about, and then unplug at the end of the day with the reassuring peace-of-mind that their tasks and teamwork are accounted for.</p><p>We are a multidisciplinary team that’s passionate about creating products, like&nbsp;&nbsp;and&nbsp;, that improve people’s lives. We thrive on innovating new solutions to old productivity challenges and seek to change how productivity tools are made.</p><a href='https://workable.com/nr?l=https%3A%2F%2Fwww.todoist.com%2F' rel='nofollow'>Todoist</a><a href='https://workable.com/nr?l=http%3A%2F%2Fwww.twistapp.com' rel='nofollow'>Twist</a><p>When you become a Doister, you’re not only joining a global, remote-first company, but a team of 62 people (and counting!) who value:</p><ul></ul><li>Inclusivity, open-mindedness, and diversity</li><li>Taking care of ourselves and each other</li><li>Empowering people to live fulfilling lives</li><li>Making long-term decisions, even if they’re harder</li><p>Our values aren’t just meant to paint a nice picture—they are the core of how we think, work, and interact.</p><p>We invite you to learn more about us, our values, and how we work at our&nbsp;.</p><a href='https://workable.com/nr?l=https%3A%2F%2Fblog.doist.com%2F' rel='nofollow'>Ambition &amp; Balance blog</a><p>Your role</p><p>At Doist, marketing isn’t just a pretty coat of paint and nice words to sell a product – it’s the process of distilling the values we stand for as a company and communicating those to the world in unique and engaging ways.</p><p>As a Marketing Developer, you’ll be the technical lead on key marketing projects, working closely with the marketing, design, and back-end development teams every step of the way – from strategy, planning, and design to implementation, testing, and optimization. This role is for a self-starter who’s excited to optimize existing marketing channels and explore new possibilities for engaging and growing our community.</p><p>Requirements</p><p>About you:</p><ul></ul><li>You have experience bringing a wide variety of marketing experiences to life from landing pages and lifecycle emails to simple web apps and ad campaigns.</li><li>You have solid foundation of web fundamental (HTML5/CSS3/ES6). You have experience working with back-end stacks and are comfortable working autonomously to create a website from scratch.</li><li>You know how to optimize a web page from top to bottom to make users’ browsing experience blazing fast. You know what it takes to make your web animation meet the 60 FPS bar. You sweat the details, but also know when to move on.</li><li>You understand that projects aren’t finished when they go live. Event tracking, A/B testing, and data analysis are part of your process to inform further optimization.</li><li>You’re not only a technical stand out–you also add valuable input throughout the entire process from marketing strategy and campaign planning to UX design and post-launch optimization.</li><li>You having a knack for developing reusable processes and frameworks that shorten implementation time, ensure quality, and help the marketing team become more independent (e.g. Contentful API, A/B testing, etc.).</li><li>You don’t wait around for someone to tell you what to do, and you wouldn’t want to anyway. You have ideas for how to improve and expand marketing efforts and are proactive enough to see those ideas through to implementation.</li><li>Bonus points if you have technical SEO experience.</li><p>Benefits</p><p>We’re bootstrapped, profitable, and committed to building a sustainable company that will grow for decades to come. We’ve built a benefits package that invests in our employee’s long-term personal and professional growth and well-being. Here’s a sample of what that includes:</p><ul></ul><li>Work-Life balance.&nbsp;That means 8 hours of work, 5 days each week (for a total of 40 hours) because the time you spend outside of work is just as important as the time you spend working.</li><li>Flexible schedule and location.&nbsp;This is a fully remote position, so you can work from wherever you please and on a schedule that works best for you. All you need is a computer and access to a stable internet connection (which we sponsor!).</li><li>Generous paid vacation + national holidays.&nbsp;You’ll receive 5 weeks of paid time off + national holidays where you live.</li><li>Paid parental leave.&nbsp;18 weeks of paid maternity leave and 5 weeks of paid paternity/adoption leave.</li><li>Education stipend.&nbsp;You’ll have a monthly budget to buy books, courses, and other resources you need to continue learning and developing.</li><li>Healthy snacks.&nbsp;You’ll have a budget to spend on fruit, nuts, and any other healthy snacks you need to keep you energized throughout the day.</li><li>Annual company retreats.&nbsp;Although we work remotely, we still enjoy bringing the whole team together to get to know each other, bond, and have face-to-face discussions in places like Spain (2015), Iceland (2016), Greece (2017), and Chile (2018).</li><li>Amazing people.&nbsp;Being a part of the Doist team means you get to work with incredibly diverse, talented people who also enjoy having fun!</li><li>And much more!</li><p>—</p><p></p><em>All information collected through this application is stored in Workable, Doist’s Applicant Tracking System, where it will be used for recruitment purposes only. For more information on how we handle candidate data at Doist, we invite you to review our&nbsp;. For questions, please contact us at jobs@doist.com.&nbsp;</em><a href='https://workable.com/nr?l=https%3A%2F%2Fdocs.google.com%2Fdocument%2Fd%2F1QeOFjp53JeGtfTCxluScbeuRgGeOeRuLA1y7HP_-bpU%2Fedit%3Fusp%3Dsharing' rel='nofollow'>recruitment privacy notice</a><div> <div><div><p>To apply for this job please visit the following URL: <a href='https://doist.com/jobs/#full-stack-marketing-developer' rel='nofollow'>https://doist.com/jobs/#full-stack-marketing-developer →</a></p></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "lj4ERae3RN29eNY7wBrFEQ",
    "url": "https://stackoverflow.com/jobs/198213/senior-web-engineer-maark?a=14tpWTngWZVK",
    "title": "Senior Web Engineer at Maark (Boston, MA) ",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=9}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend",
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "Maark",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Senior Web Engineer</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Contract</span>                                    </div>                            </div>                    </div>                <div>Company: Maark | Boston, MA<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Boston, MA.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div>ux</div><div>ui</div><div>javascript</div><div>react</div>                <h3>Job description</h3>                <div><p>At MAARK, we are passionate about bringing innovation and advanced concepts to life and sweating every detail in order to create the best possible experience for our clients and their customers. We believe that every interaction and transaction a user has with a product should be designed and built to work for that individual.</p><p>The clients we work with span a host of verticals – ranging from large financial institutions to telecoms to hospitality to bio-engineering. And the problems we solve for them range from highly animated, interactive frontends, to complex business rules on the backend, to IoT solutions that bridge digital and real worlds. We love diving into new subjects and researching our clients' businesses and look to work with people who are just as naturally curious.<br></p><p>In this role, you will work as part of our growing development team to craft and build frontend side of apps and web sites. We work on highly creative projects, utilize a wide variety of fullstack technologies, and empower each of our developers to create innovative solutions and explore and master emerging web technologies.</p><p>The ideal candidate would be Boston-based, but for this contractor role, we would be open to remote candidates as well. </p><br><p><strong>Benefits</strong></p><br><p><strong>About Maark</strong><br></p><p>Maark is a strategic marketing and innovation agency for global companies - headquartered in Boston, MA. We help our clients define and articulate their vision, design new connected customer experiences, and develop applications at the intersection of where what’s possible meets what’s relevant. </p><p>We are proud to foster a workplace free from discrimination. We strongly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better experience for our clients.</p><p><em>Maark is an Equal Employment Opportunity (EEO) employer. It is the policy of Maark to prohibit discrimination and harassment of any type and to afford equal employment opportunities to all persons without regard to race, color, religion, sex, national origin, age, gender, physical or mental disability, veteran-status, or any other characteristic protected by applicable federal, state or local law.</em></p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/198213?reset=False&amp;ra=14tpWTngWZVK&amp;oqs=a%3D14tpWTngWZVK' rel='nofollow'>Apply now</a></div>            <h3>About Maark</h3>            <div><p>Maark is a strategic marketing and innovation agency for global companies - headquartered in Cambridge, MA. We help our clients define and articulate their vision, design new connected customer experiences, and develop applications at the intersection of where what’s possible meets what’s relevant.</p>            </div>        ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "2ohp1AkxQ6OPOntDjfvfyw",
    "url": "https://weworkremotely.com/remote-jobs/cvedia-pte-ltd-remote-senior-unity3d-developer-for-cvedia-com-american-time-zone",
    "title": "Cvedia PTE. LTD.: Remote Senior Unity3D Developer for Cvedia.com - American Time Zone",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``usa 3W OR(time,timezon)",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:k/t/w:com/dotnet/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:k/t/w:unity3d/gamedev/24",
      "DBG_TECH1:k/t/w:unity3d/mobile/15",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=15, go=0, nodejs=0, bigdata-ml=4, ruby=0, apple=0, java=0, gamedev=24, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "Cvedia PTE. LTD.",
      "sameAs": "http://www.cvedia.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2018 10:45:42 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Remote Senior Unity3D  Developer for Cvedia.com - American Time Zone</h2><span>Company: Cvedia PTE. LTD.<br></span><span>Headquarters: Europe<br></span><span>www.cvedia.com<br><br></span>  <div>    <div><span></span></div><div><span>Cvedia is Simulating the world. &nbsp;We are generating hyper realistic simulator built for autonomous applications and machine learning. </span></div><div></div><div><br></div><div><h3><span>Requirements:</span></h3><h3><span>- 5 years experience with Unity3D</span></h3></div><div><span>- Desktop performance optimization (specially rendering optimization)</span></div><div></div><div><br></div><div><h3><span>We offer:</span></h3><h3><span>- Young Funded Start -Up company with Clients and endless opportunities In the most interesting and practical Industry of the Future.</span></h3></div><div><span>How should you apply for this job?</span></div><div></div><div><br></div><ul><li><span>Please state on the mail subject the job position you are applying for.</span><br><br></li><li><span>Please mention your country of origin in the email. Unfortunately, we only hire US time zone &nbsp;employees to avoid time zone differences.</span><br></li></ul><div><br></div><div><span>Please send your applications to jobs at Cvedia dot com</span></div><div></div><div><br></div><div><h3><span>About us: </span><span>Unleash the limitations of the physical world with a state-of-the-art simulation platform. Cvedia constructs synthetic 3D real or fictitious environments and provides sensor simulations robust enough to train, validate, and verify artificial intelligence algorithms for land, aerial, and marine autonomous applications. https://cvedia.com https://syncity.com</span></h3><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>please send your resume to <a href='mailto:jobs@cvedia.com' rel='nofollow'>jobs@cvedia.com</a></p>  </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "4BWjGIngTwmSdCqOlYKDmw",
    "url": "https://remoteok.io/jobs/68259",
    "title": "Senior Web Engineer",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "Maark",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 28, 2018 2:18:10 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<td><span><h2>Senior Web Engineer</h2></span><br><span><h3>Maark</h3></span></td><div><div><br>At MAARK, we are passionate about bringing innovation and advanced concepts to life and sweating every detail in order to create the best possible experience for our clients and their customers. We believe that every interaction and transaction a user has with a product should be designed and built to work for that individual.<br>The clients we work with span a host of verticals ranging from large financial institutions to telecoms to hospitality to bio-engineering. And the problems we solve for them range from highly animated, interactive frontends, to complex business rules on the backend, to IoT solutions that bridge digital and real worlds. We love diving into new subjects and researching our clients' businesses and look to work with people who are just as naturally curious.<br><br>In this role, you will work as part of our growing development team to craft and build frontend side of apps and web sites. We work on highly creative projects, utilize a wide variety of fullstack technologies, and empower each of our developers to create innovative solutions and explore and master emerging web technologies.<br>The ideal candidate would be Boston-based, but for this contractor role, we would be open to remote candidates as well. <br><br>Benefits<br><br>About Maark<br><br>Maark is a strategic marketing and innovation agency for global companies - headquartered in Boston, MA. We help our clients define and articulate their vision, design new connected customer experiences, and develop applications at the intersection of where whats possible meets whats relevant. <br>We are proud to foster a workplace free from discrimination. We strongly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better experience for our clients.<br>Maark is an Equal Employment Opportunity (EEO) employer. It is the policy of Maark to prohibit discrimination and harassment of any type and to afford equal employment opportunities to all persons without regard to race, color, religion, sex, national origin, age, gender, physical or mental disability, veteran-status, or any other characteristic protected by applicable federal, state or local law.<p>See more jobs at <span>Maark</span></p></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
