{
 "items": [
  {
    "id": "yA3qH3DQQ1uhIIoXRDBTSg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/171883/backend-developer-m-w-grandcentrix-gmbh?a=VDWpp6cSKKk",
    "title": "BACKEND DEVELOPER (M/W) at grandcentrix GmbH (Köln, Deutschland) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Services, Mobile, Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>BACKEND DEVELOPER (M/W)</strong></p><p><strong>Deine Aufgaben bei uns<br></strong></p><ul><li>Du realisierst, gemeinsam mit unserem Team,&nbsp;IoT- und Service-Plattformen als Bestandteil digitaler Produkte, die von Millionen Nutzern geliebt werden.</li><li>Du arbeitest maßgeblich an der Realisierung von hoch skalierenden, sicheren und professionell deployten Lösungen.</li><li>Hierbei verwendest du keine monolithischen Enterprise-Architekturen sondern nutzt vor allem Elixir, Python und JavaScript.</li><li>Unter Deiner Mitwirkung entstehen Lösungen, die von unserem Team auf eigener Hardware oder bei Cloud Anbietern betrieben und betreut werden.<br><br></li></ul><p><strong>Was wir uns von dir wünschen<br><br></strong></p><ul><li>Leidenschaft für die Backend-Entwicklung sowie ein abgeschlossenes Studium der Informatik oder eine vergleichbare Qualifikation mit mehrjähriger Berufserfahrung.</li><li>Vertiefte Kenntnisse in und Interesse an mehr als einer Programmiersprache oder Plattform.&nbsp;</li><li>Kenntnisse im Umgang mit HTTP und im Design von REST APIs.</li><li>Ausgeprägtes Interesse an Tests, Clean Code und Struktur bei der Software-Entwicklung.</li><li>Erfahrung mit Domain-Driven Design, Docker und Kubernetes sind von Vorteil.</li><li>Interesse an der Arbeit in interdisziplinären, agilen Entwicklungsteams sowie offenem Informationsaustausch unter Kollegen.</li><li>Einen offenen und klaren Kommunikationsstil – in deutscher und englischer Sprache.</li></ul>                    </div>                            <h2>                About grandcentrix GmbH            </h2>            <div><p><strong>Was wir dir bieten</strong></p><ul><li>Regelmäßig interne Lightning Talks, Hackathons, Kongressbesuche und Meet-ups.</li><li>Förderung von Weiterbildungen, aktivem Wissensaustausch sowie Mitarbeitertreffen.</li><li>Aktuelle Arbeitsgeräte und ein inspirierendes, modernes Arbeitsumfeld in attraktiver Atmosphäre.</li><li>Innovative Projekte, unbürokratische Strukturen und kurze Entscheidungswege.</li><li>Vertrauensarbeitszeiten und eine Home-Office-Regelung, bei der du für den Termin mit dem Techniker keinen Urlaub einreichen musst.</li></ul><p>Lerne uns einfach kennen und mach dir ein eigenes Bild über uns!&nbsp;</p><p><strong>Neugierig? Schreib uns!</strong></p><p>Wir freuen uns über deine Bewerbung. Schick uns deine Unterlagen sowie deine Gehaltsvorstellung an&nbsp;<a href='mailto:jobs@grandcentrix.net' rel='nofollow'>jobs@grandcentrix.net</a>.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive salary and permanent contracts                            </div>                            <div>                                 Great work atmosphere                            </div>                            <div>                                 Home office and remote work                            </div>                            <div>                                 Flexible working-hours                            </div>                            <div>                                 Softdrink flatrate, hot &amp; cold                            </div>                            <div>                                 Open &amp; transparent communication                            </div>                            <div>                                 Free drinks, hot &amp; cold                            </div>                            <div>                                 Company Pension Scheme                            </div>                            <div>                                 TaxSaver Tickets and Bike to Work Plans                            </div>                            <div>                                 Sunroof, Seaview &amp; icecream flat                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 15, 2018 2:07:51 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "KDjlg2cRSCuJ_3Zl8N12_Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/stack-builders-experienced-haskell-developer-remote-1",
    "title": "Stack Builders: Experienced Haskell Developer (Remote)",
    "content": "<div>  <div>    <h2>Experienced Haskell Developer (Remote)</h2>      <h4>Posted Apr 13</h4>    <h3>      <span>Stack Builders</span><br>      <span>Headquarters: Pittsford, New York, United </span><br>        <a href='https://stackbuilders.workable.com/j/E01709D897' rel='nofollow'>https://stackbuilders.workable.com/j/E01709D897</a>      <br>      <a rel='nofollow'>View all Stack Builders jobs →</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>If you’ve been passionate about Haskell for a while now and you’ve been looking forward to working in an environment that values best practices, clean code and contributing to the growth of the industry, this might be the right job for you.</span></div><div><br></div><div><span>The Job</span></div><div><br></div><div><span>You’d be working with Haskell on a daily basis, pairing regularly both with our remote and in-house teams, using agile methodologies, contributing to open source projects and sharing your knowledge with people that feel just as passionate about FP as you do.</span></div><div><br></div><div><span>We expect that you will be able to:</span></div><div><br></div><ul><li><span>Deliver high-quality code while meeting and exceeding client expectations.</span></li><li><span>Maintain, refactor and add to an existing code base.</span></li><li><span>Lead a team to tackle new projects when needed.</span></li><li><span>Conduct code review and pairing.</span></li><li><span>Communicate clearly and often about the project to us.</span></li><li><span>Keep expectations clear with the client.</span></li><li><span>When working with more junior developers support them and help them grow with clear, candid and respectful feedback.</span></li></ul><div><br></div><div><span>Requirements</span></div><div><br></div><ul><li><span>For this position, we require a developer experienced in the use of Haskell, with strong FP skills. Experience working with Agile methodologies and a passion for delivering high-quality results.</span><br></li><li><span>To assess the quality of code you deliver, please submit a link to your GitHub or a similar page where we can see your personal projects. We will be looking for clean, well-structured code, as well as automated tests. </span><br></li><li><span>This position would require a commitment to provide 40 hours a week (occasional vacations off with previous notice are fine).</span></li><li><span>A high English level is a must since we value strong communication skills and conduct all our work using this language.</span><span> </span></li></ul><div><br></div><div><span><span>If interested, please apply </span><a href='https://stackbuilders.workable.com/j/E01709D897' rel='nofollow'><span>through our site</span></a><em> </em><span>confirming your availability for full time work. This position is not open to agencies. </span></span></div><div><br></div><div><span>For Ecuadorian citizens, please apply through our portal for any full-time employee positions that may be available. </span></div><div><br></div><div><span>Stack Builders is proud to be an Equal Opportunity Employer. We do not discriminate based upon race, religion, color, nationality, gender, sexual orientation, age, disability or pregnancy.</span></div><div><br></div><div><span>About us</span></div><div><br></div><div><span>Stack Builders is an Agile software consultancy based in New York with offices in Quito, Ecuador. We are dedicated to going above and beyond not only by offering great services for our clients but also by pushing the software industry forward through the use of better tools and practices.</span></div><div><br></div><div><span>Some of our projects are currently using Ruby, Rails, and Haskell as a back-end, with some PureScript, JavaScript and TypeScript (Node.js) on the front-end. We are passionate about providing clean and maintainable code that surpasses our client's expectations.</span></div><div><br></div><div><span>We work in a variety of languages; therefore, we value developers who are flexible about working with different stack configurations, that feel confident about tackling new challenges, and that aim toward excellence.</span><br></div><div></div><div></div><div>&nbsp;<br></div><div></div><div></div><div><span>If you’d like to work with passionate developers that value quality and best practices, this is the place for you!</span><br></div><div></div><div></div><div><span><br></span></div><div><span>Benefits</span></div><div><br></div><div><span>Some of the perks are:</span><br></div><div></div><div></div><ul><li><span>Strong learning culture</span><br></li><li><span>Regular pairing sessions</span><br></li><li><span>Challenging projects</span><br></li><li><span>Opportunities for company-sponsored conference participation and technical talks</span></li><li>Exceptionally talented and passionate coworkers</li></ul><div><br></div><div><span>You can learn more about us visiting</span><span> </span><a href='https://workable.com/nr?l=https%3A%2F%2Fwww.stackbuilders.com%2F' rel='nofollow'><span>https://www.stackbuilders.com/</span></a><span> or take a look at our </span><a href='https://workable.com/nr?l=https%3A%2F%2Fwww.stackbuilders.com%2Fnews%2Fpage%2F1' rel='nofollow'><span>blog posts</span></a><span> and </span><a href='https://workable.com/nr?l=https%3A%2F%2Fwww.stackbuilders.com%2Ftutorials%2F' rel='nofollow'><span>tutorials</span></a><span>.</span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>If interested, please apply through our site confirming your availability for full-time work. This position is not open to agencies. For Ecuadorian citizens, please apply through our portal for any full-time employee positions that may be available. </p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 13, 2018 8:28:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "iWRU9CVaQlG2EtMGM4Km0g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/myabckit/jobs/51886-full-stack-developer",
    "title": "Full-stack developer",
    "content": "<div><h2>Full-stack developer at myABCKit</h2><div>Madrid, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>€40K–€42K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>We’re looking for a extremely talented full-stack developer to create honest, simple user experiences for kids aged 3 - 7.</p><p>WHAT WE OFFER YOU...<br>The opportunity to create meaningful educational apps and games for kids around the world.</p><p>A small respectful team to work with, create and develop new ideas.</p><p>A full integration into the educational community though our shared experiences with schools, professors, parents and kids.</p><p>BEING PART OF OUR TEAM MEANS...<br>We trust our team by giving them a lot of freedom when it comes to planning the work.</p><p>We are a high-performance team and for us it’s more important deliver extraordinary results, than how to do it.</p><p>myABCKit runs on Github, Slack, Trello and Sketch. We work remotely most of the time, but we keep track of the work and discussions through Hangouts when we need to.</p><p>WHAT WE ARE LOOKING FOR...<br>We've built a responsive Ember.js app, which we're slowly migrating to Elm. This app consumes a Elixir GraphQL API, and some old Ruby on Rails REST API endpoints.</p><p>We're looking for someone who:<br>- has experience with Javascript, Elm, Ruby on Rails, Elixir and PostgreSQL.<br>- is really in love of writting good, clean and maintenable Javascript and Ruby code.<br>- is highly experienced in HTML5, CSS3, ES6, web and mobile development in general.<br>- is not afraid of relational databases and complex SQL queries.<br>- is knowledgeable about web protocols, application servers and web servers.<br>- is able to see user experience from the user's point of view, and craft UIs to make their lives easier.<br>- is very focused on usability, maintainability and quality, building for the long term and for large scale number of users.</p><p>THESE WILL GIVE YOU EXTRA POINTS:<br>- You know how to improve an app's performance.<br>- Python, Go, Elixir, Shell script, Rust, Haskell... or any other language, are in your toolbelt.<br>- Experience in the EdTech or Kids industries.<br>- Motivated by children's education and great challenges.<br>- Proficiency in English and Spanish.</p></div>",
    "urlFetchPending": false,
    "published": "Apr 11, 2018 1:49:02 AM",
    "tags": [
      "Full Time",
      "Full-Stack Developer",
      "Madrid",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/frontend",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "other",
      "ruby"
    ]
  },
  {
    "id": "Dt5eyiQESTWHLUd1DPkOAg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4339-elm-or-elm-ish-developer-collegevine",
    "title": "Elm (or Elm-ish) Developer @ CollegeVine",
    "content": "<h2>              Elm (or Elm-ish) Developer<small> @ CollegeVine</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-04-10 01:24</p></dd>          <dt><span>Description</span></dt>          <dd><p>CollegeVine is seeking an Elm or PureScript developer to help engineer inviting front-end experiences that have real social impact.</p><p>At CollegeVine, our mission is to level the playing field of higher education attainment, regardless of socioeconomic status. To do this, we intend to make virtual guidance services available and affordable for all through a combination of near-peer mentorship and technology. We have an unending list of interesting problems to solve: how to predict if someone will be a good mentor for a given student; how to manage tens of thousands of high-quality, ongoing human relationships simultaneously; how to ingest thousands of applications requirements and produce an optimal plan of attack—just to name a few.</p><p>Our ideal candidate for this role satisfies three requirements:</p><ol><li>You have proven experience in Elm or PureScript (or even Haskell, F#, or OCaml, but want to apply your talents to the front-end) and want to get even better.</li><li>You have a product-focused mindset; this means you prioritize business value and project delivery above academic interests related to the language.</li><li>You are discerning about engineering culture. Some keywords for ours are growth-oriented, genuine, self-aware, pragmatic, autonomous, mindful, and remote-friendly.</li></ol><p>Note: We may have a more junior role available in the near future, but this one is not it! If you'd like to be considered for that role when it opens up, please apply for this one and note in your cover letter that you are interested in a junior role. We will add your resume to our database for future consideration.</p><h5>Your first month</h5><ul><li>Onboard rapidly in a pre-existing codebase. We loved the ideas behind Elm but felt that we could do it better in PureScript (we started off as a bunch of senior Haskell devs), so we made our own Elm-ish framework. It works almost exactly like Elm, except in (our opinion) a more powerful language.</li><li>Begin building a relationship with your manager in a weekly one-on-one. We'll discuss who you are, how you got here, what's important to you, how you want to grow, and anything else that matters to you.</li><li>Pair program with some of the senior devs on the team who have been doing FP for many years</li><li>Ship code to production within your first week</li></ul><h5>Your third month</h5><ul><li>Become autonomous in our codebase, having completed at least one small feature on your own and on your way to delivering a much larger one with much more business value.</li><li>Develop a deeper intuition for our various product lines. Begin having ideas about how you might impact their success.</li><li>Receive detailed feedback on your progress relative to our expectations. Give detailed feedback on our progress relative to your expectations.</li><li>If you are remote, have visited HQ at least once by now and joined us for our regular course of company social events.</li></ul><h5>Your first year</h5><ul><li>Build deep expertise in one or more areas of the code.</li><li>Try your hand at a few full-stack problems. If you know Elm and PureScript, Haskell is just a short hop away. And all the other languages are basically easy at this point.</li><li>Develop a reputation for shipping and delivering business value early while also pushing code quality forward along the axes that you care about.</li><li>Stay accountable to your personal development goals that you have discussed with your manager.</li><li>Gain clarity on where you want to go next in your career. We'll help you get there.</li></ul><h5>Other considerations</h5><ul><li>This position can be remote for the right person. Please be aware that the interview process may be slightly more drawn out for remote candidates if you are only able to do full-time right away. If you are able to contract with us first, we are much less risk-averse. Please mention your relevant situation in your cover letter.</li><li>We are pragmatically polyglot. Here's what we are serving in production: Haskell, PureScript, JS, Ruby, Python, Bash, PHP (don't worry - custom Wordpress blog plugin that we wrote long ago and never touched since), R, SQL.</li><li>Old-school ed-tech user experiences are not acceptable to us. Our software must impress and work for a wide audience since we serve students and their families. On any given day, your code will be run by high schoolers, college students, young professionals, guidance counselors, parents, and grandparents from all walks of life.</li><li>Please submit a cover letter. We read them carefully and it forms our first impression of you.</li></ul><h5>Benefits</h5><ul><li>Medical, dental, and vision insurance with a generous employer contribution.</li><li>Regular team dinners and company outings.</li><li>A culture of mentorship. Become the near-peer mentor for one (or more!) of our consultants or program managers and be the help you wish you had when you were in college.</li><li>Flexible hours with a 4-hour core - plan the rest of your workday as you wish, just give us the majority of your most creative hours. Productivity ideas: avoid traffic, never wait in line at the grocery store, wake up without an alarm clock, be around for your family.</li><li>Goal-based environment (as opposed to grind-based or decree-based environment; work smarter, not harder; intelligently, not mindlessly). We collaborate on setting goals, but you set your own process for accomplishing those goals. You will be entrusted with a lot of responsibility and you might even experience fulfillment and self-actualization as a result.</li><li>Join an engineering culture that celebrates mindfulness and takes the quality of your attention seriously. We don't spam our slack channels; your manager will not come tap you on the shoulder asking for pointless things; we write things down after we discuss them in person; we try to minimize meetings.</li></ul><p>Expect autonomy in exchange for transparency and results. Since you are well-read, curious, and self-aware, we will treat you like the awesome, interesting adult that you are. We have core hours and a goal-based environment; we understand mindfulness and the value of deep focus. We're chasing a big idea and we need every good teammate we can find.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Apr 10, 2018 4:23:36 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "6qTCDjaiSc6WBqMLt-T20w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16769920",
    "title": "SEEKING FREELANCER - Remote Perl developer Remote: Yes EU timezone is preferred, US also ok. Requirements: - Senior Perl developer ...",
    "content": "<div>                  <span>SEEKING FREELANCER - Remote Perl developer<p>Remote: YesEU timezone is preferred, US also ok.</p><p>Requirements:</p><p>- Senior Perl developer (4+ years of experience)</p><p>- Experience with: parsing XML, regex, algorithm design, data structures, unit testing</p><p>- Good knowledge of Python is a <i>big</i> plus</p><p>- Experience with building REST APIs is a plus</p><p>Please send resume and portfolio work.</p><p>Contact: onix7300@gmail.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 6, 2018 4:00:04 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "jwn34wZyQgehzQ1jsm2NaQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/171878/senior-backend-ethereum-engineer-argent?a=VDPXLtw0TPG",
    "title": "Senior Backend/Ethereum Engineer at Argent  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>About Argent</strong></p><p>Argent is lead by experienced entrepreneurs and funded by some of the best VCs in London. Our mission is to give millions of users access to a new decentralized web. We believe blockchain technology will lead to global, transparent and accessible financial and consumer services.</p><p><strong>About the Senior Backend Engineer position</strong></p><p>We are looking for a versatile and passionate backend developper who will join our team of talented engineers to help us build the best mobile blockchain browser.</p><p>You will design and operate the backend services that fuel our decentralised application, develop innovative services on top of Ethereum nodes, and help continuously improve our engineering practices.</p><p><strong>Senior Backend Engineer responsibilities are:</strong></p><ul><li>Develop new services that will enable seamless interactions between mobile clients and smart contracts</li><li>Lead the architecture, development and operation of our backend infrastructure in a DevOps manner</li><li>Build a layer of innovative services on top of Ethereum nodes</li><li>Continuously improve the efficiency, scalability, and reliability of our backend systems</li><li>Research and recommend testing and automation tools</li><li>Review and enforce security best-practices for all internal and external services</li><li>Collaborate closely with the other engineering teams to ensure an overall efficient architecture of our product</li></ul><p><strong>Senior Backend Engineer requirements are:</strong></p><ul><li>You have 5+ years of experience designing and delivering scalable distributed systems in Java. Knowledge of other languages such as Javascript, Clojure, Python or Go is a plus</li><li>You have hands-on experience in designing and operating a secure infrastructure on AWS</li><li>You like to get your hands dirty and you are never afraid to experiment with technology</li><li>You have good knowledge of cryptography and security best practices</li><li>You have strong problem solving and troubleshooting skills</li></ul><p><strong>How we work ?</strong></p><p>We are a distributed team but find communication much easier when working on similar time zones. You will need to be based in a timezone between GMT-3 and GMT+3.</p>                    </div>                            <h2>                About Argent            </h2>            <div><p>Cognoa is available to parents via their employers, and we have already served 300,000 families. Our company is well funded and growing quickly, and we are a team that loves working together.</p>            </div>        ",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 7:00:46 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "8evVf8CoSuC0EzCgNEW45w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16741999",
    "title": "ActiveState Software Inc. | Vancouver, BC | Remote | Full time | https://www.activestate.com/",
    "content": "<div>                  <span>ActiveState Software Inc. | Vancouver, BC | Remote | Full time | <a href='https://www.activestate.com/' rel='nofollow'>https://www.activestate.com/</a><p>I'm hiring for the team I manage. We're building the back end an ambitious language distribution platform so that no engineer ever has to suffer dependency hell again.</p><p>We're mostly using Go, with Perl for scripting, Docker, Kubernetes, Mesos, CircleCI, and other useful tools.</p><p>Please apply at <a href='https://www.activestate.com/careers#op-243215-senior-developer' rel='nofollow'>https://www.activestate.com/careers#op-243215-senior-develop...</a>.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 8:00:07 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "N4OUDoaER1e2UeUWpqM-nQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16739174",
    "title": "Eat to Perform | Software Engineer | REMOTE | $60-$100k | http://eattoperform.com",
    "content": "<div>                  <span>Eat to Perform | Software Engineer | REMOTE | $60-$100k | <a href='http://eattoperform.com' rel='nofollow'>http://eattoperform.com</a><p>We are seeking an experienced software engineer with a strong command of Clojure. This is an opportunity to join our growing startup which connects fitness and nutrition coaches with a passionate client base via our mobile and web applications.</p><p>The Role:</p><p>Leverage Clojure and ClojureScript to evolve both the business logic of our system and web and mobile UX. Orchestrate a cloud-based distributed system. Develop operational logging and monitoring systems to catch errors early and report on key performance metrics.</p><p>Ideal Candidate:</p><p>Professional experience working with Clojure and other functional and dynamic languages.</p><p>Experience delivering software in a team environment (source control, testing, estimating).</p><p>Bonus Points:</p><p>Along with your professional experience working with Clojure, we are especially keen to work with you if you have experience with any of the following.</p><p>Datomic; Re-frame; GraphQL; React Native; Data Science/ML</p><p>About Eat to Perform</p><p>Since launching in 2014 the company has assisted thousands of clients take control of their health through personalized nutrition coaching, powerful data and technology, a supportive community, and a passion for improving people’s lives. Our community and company is rapidly growing and improving in our ability to get clients results and improve their lives in a meaningful, impactful way.</p><p>Please contact bobby@eattoperform.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 11:55:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "czDoIr4uQ-2HG-OEqu5zcw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16736234",
    "title": "Circonus | Software Engineers | Remote, Full-time | https://www.circonus.com/",
    "content": "<div>                  <span>Circonus | Software Engineers | Remote, Full-time | <a href='https://www.circonus.com/' rel='nofollow'>https://www.circonus.com/</a><p>Circonus is a software company that is changing the way the world monitors both IT infrastructure and the business it powers. Our SaaS and On-­Premise solutions enable companies to combine monitoring, alerting, event processing, and predictive analytics into a unified solution. Visualize any data, in any application, from any system, in real ­time.</p><p>Listen to one of our CEO Theo's talks to get an idea of what Circonus does:<a href='https://www.youtube.com/watch?v=qh4hLIWqw6Q' rel='nofollow'>https://www.youtube.com/watch?v=qh4hLIWqw6Q</a></p><p>We are a 100% distributed and remote company, mostly across the US as well as Europe. You are also welcome to work from the Maryland office; most employees work from home.</p><p>We build web software using technologies such as C, C++, Lua, Java, Ruby, Go, Perl, JavaScript, jQuery, HTML, Scss</p><p>Circonus is seeking to fill two roles.</p><p>* Technical Account Manager - Customer service role as an expert in all things Circonus to build and maintain relationships <a href='https://jobs.lever.co/circonus/5342c10c-ae13-45f6-816f-cfbee20ee252' rel='nofollow'>https://jobs.lever.co/circonus/5342c10c-ae13-45f6-816f-cfbee...</a></p><p>* Perl Senior Software Engineer - Strong server-side development experience with Perl and working knowledge of mod_perl with Unix and RDBMS experience <a href='https://jobs.lever.co/circonus/0d485785-a66d-4de5-897e-969256caa9b7' rel='nofollow'>https://jobs.lever.co/circonus/0d485785-a66d-4de5-897e-96925...</a></p><p>All of our positions include a discretionary PTO policy, health insurance, gym reimbursement, a generous 401K, the opportunity for a bonus and more.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 7:45:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "frontend",
      "other"
    ]
  },
  {
    "id": "XaVvENLzRri0AUP4dwpz3g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16735718",
    "title": "Traitify | Full Stack/Backend Engineers | Full Time | Remote | Apply at https://traitify.breezy.hr",
    "content": "<div>                  <span>Traitify | Full Stack/Backend Engineers | Full Time | Remote | Apply at <a href='https://traitify.breezy.hr' rel='nofollow'>https://traitify.breezy.hr</a><p>Founded in 2011, Traitify is a Baltimore-based technology company working to make personality a core element of social engagement and electronic commerce. Offering an array of visual personality assessments and the world's first personality API, Traitify helps individuals and organizations to create more human experiences and unlock the power of psychology and big data.</p><p>Tech:Front End: Rails/React/Elixir/PostgresBack End: Java/Elixir/Postgres/ElasticSearch/Microservices</p><p>Hiring Process: Phone Screen by Me &gt; Interview with Team You'll Work With &gt; Interview with Founders &gt; Offer<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 7:02:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "other",
      "ruby"
    ]
  },
  {
    "id": "X8RXRg9GQ4y4LPfUfyZ83w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16735490",
    "title": "Telcoin | ONSITE (REMOTE for some positions) | Software Engineers, Designer, Community Managers | Full-Time (& INTERNS) | Tokyo ...",
    "content": "<div>                  <span>Telcoin | ONSITE (REMOTE for some positions) | Software Engineers, Designer, Community Managers | Full-Time (&amp; INTERNS) | Tokyo (&amp; Paris for some positions)<p>Telcoin is a Tokyo-based startup focused on providing financial services to developed and developing countries using crypto tokens delivered by mobile operators.</p><p>We are hiring for our Marketing, Product and Engineering departments. Therefore looking for community managers (experience with chat community management like Telegram or Slack is a nice plus), marketing managers and creatives/designers. We are also looking for programmers on Android, and back-end programmers (we use Rust and, for the time being, Solidity for our smart contracts).</p><p>As a young but properly funded company (raised $25M two months ago), we do test our software, have a flexible vacation policy, very competitive packages including tokens and equity, enough runway for several years, and are potentially open to remote workers for some positions.</p><p>We believe in fair interview processes so we won't ask you to whiteboard your way out of a red black tree, but will make sure you can perform on the task. We also won't do more than two rounds of interviews, as we're respectful of your time.</p><p>If you're interested in financial inclusion, Rust, blockchain/cryptocurrencies, or simply want to write software that helps people send money home efficiently, please email jobs at telco dot in.</p><p>For back-end positions, some experience with Rust, fraud management, payment processors, or telecom software would be a nice plus, but not necessary.</p><p>We also welcome (paid) interns.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 6:41:05 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "6UcbI4EUSjqXq4cQVtkfxQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/169640/backend-engineer-money-heetch?a=UTiPiWPCTGU",
    "title": "Backend Engineer - Money at Heetch (Paris, France) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Carsharing, Marketplace, Transportation</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>MONEY @ HEETCH</strong></p><p>The Money Team works behind the scenes to ensure a smooth experience for everyone involved in payment transactions.</p><p>We are responsible for the proper handling of millions of euros across thousands of daily rides , and everyone is counting on us to deliver reliably and efficiently.</p><p>We work hand in hand with the Data, Product and Operations teams to improve our product while protecting our bankrolls and maintaining compliance and cleanliness in our accounting records: <br>• Numbers, numbers everywhere. <br>• We help users manage their payment methods and coupons, a crucial part of the passenger onboarding experience. <br>• We make sure drivers get paid on time for their work by providing them with a seamless experience so they don’t have to worry about their money. <br>• Fraudsters are like zombies, one breach, and you’ll face an army of them. <br>• 1 cent can become over 9000 cents if you don’t pay attention.</p><p><strong>WHAT WE DO</strong> <br>• Take part in the design and specifications of new features and products. A new form to help the marketing teams launch their campaign in every bar in a new city? Check. Improve our fraud detection models to fight card testers that got their hands on thousands of stolen credit cards? Sure! <br><br>• Use state of the art tools and best practices to ship code quickly and safely (continuous integration, code review, automated testing, etc). The daily job of the money team is to write Ruby and Elixir microservices that communicate via HTTP, RabbitMQ and gRPC, deployed using Docker on a Mesos/Marathon cluster. <br><br>• Communicate with each other. We are a remote-first team and company, working from our home or our Parisian office. We synchronize whenever needed (discussions around specs, pair programming, code reviews) so no-one is left alone. <br><br>• Always improve. Everyone makes mistakes, and we all can learn from each other. We value personal progress and want you to look back proudly on what you’ve done. <br><br></p><p><strong>REQUIREMENTS</strong> <br>• 5+ years as a backend engineer. <br>• Eager to learn Elixir. <br>• Exposure to the architectural patterns of a large, high-scale application. You understand the pros and cons of microservices and embrace event-driven programming. <br>• You are used to dealing with complex business logic and ambiguous edge cases.</p><p><strong>Bonus points</strong> <br>• Prior knowledge of Ruby or Elixir. <br>• Experience with message brokers(such as Kafka, RabbitMQ) and event-driven architectures.</p><p><strong>PERKS</strong> <br>• Stocks. <br>• Paid conference attendance/travel. <br>• Heetch credits. <br>• A Spotify subscription. <br>• Medical care. <br>• Code retreats and company retreats. <br>• Travel budget (visit your remote coworkers and our offices).</p>                    </div>                            <h2>                About Heetch            </h2>            <div><p>Heetch is a ride-sharing app with a simple mission: we want people to enjoy going out. Every night and day, our drivers are doing everything to make your ride unforgettable and friendly! We are focusing on young people expectations and compete with many actors on this segment. The service has been launched in Paris in September, 2013 and is growing very fast since then, with thousands of rides every night in France, Italy, Sweden, Belgium and Morocco. With more than 1 million users in Europe, we are proud to be one of the French fastest growing startup!</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Full remote (in Europe only) and flexible ways of working                            </div>                            <div>                                 Paid conferences attendance/travel                            </div>                            <div>                                 Periodic team meetups                            </div>                            <div>                                 Stocks                            </div>                            <div>                                 Heetch credits                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "PPnss5VmT6GStl6fmuqW2A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/packlane-software-engineering-intern",
    "title": "Packlane: Software Engineering Intern",
    "content": "<div>  <div>    <h2>Software Engineering Intern</h2>      <h4>Posted Mar 18</h4>    <h3>      <span>Packlane</span><br>      <span>Headquarters: San Francisco, CA</span><br>        <a href='https://packlane.com/' rel='nofollow'>https://packlane.com/</a>      <br>      <a rel='nofollow'>View all Packlane jobs →</a>    </h3>  </div>    </div>  <div>    <div><span>Consider Packlane a unique challenge - you’ll be in collaborating on code that allows people with a range of design knowledge (from novice to expert craftsman) to create a product that truly helps them tell their business’s brand story. It’s a big job, but the apprentice we’re looking for will be excited to work on a career-defining startup that’s pioneering a new approach to designing and manufacturing packaging. Join our team as a paid apprentice and put your skills to work for good.</span></div><div><h3>What You'll Do:</h3></div><ul><li>Ideate. Create. Innovate. Help our small (but ultra-productive!) team build new and wonderful products.</li></ul><ul><li>Span the spectrum of frontend to backend development. CSS, Javascript, Elixir, Bash, you’ll encounter it all and eagerly learn as you go.</li><li>Build production systems in Elixir and React.js.</li><li>Hone your debugging skills and contribute suggestions to the overall team.</li><li>Utilize unit testing and continuous integration to keep the bugs out.</li><li>Collaborate with stakeholders, department heads and consultants to provide the best user experience possible.</li><li>Pair program with Senior Software Engineers to hone your skills and grow.</li><li>Bend steel with your bare hands (optional).</li></ul><div><h3>What You'll Love About Packlane:</h3></div><ul><li><span>Use the technologies you love -&nbsp;</span>Packlane is an opportunity to cut your teeth on an exciting technology stack, including innovative development frameworks and cutting-edge functional languages.</li></ul><ul><li><span>We’re a small team</span>&nbsp;- You’ll be one of few, which means you’ll have a real chance to make an impact. Expect (and hopefully enjoy!) a lot of control and influence over product decisions and prioritization.</li><li><span>You’ll help build our future&nbsp;</span>- We’ve got a lot of ambitious projects in the works, from building manufacturing infrastructure from the ground up, to implementing robust order management systems that orchestrate an intricate production flow, and you’ll be at the forefront of it all.</li><li><span>Flexibility</span>&nbsp;- We’re an international team who appreciates the freedom to work remotely/from home when we need to, and we value getting everyone together in-person for the occasional company retreat.</li></ul><div><h3>REQUIREMENTS</h3></div><ul><li>A vigorous curiosity and excitement about software engineering.</li><li>An easy-to-work-with attitude, well-organized and highly self-motivated.</li><li>Reliable. Accountable. Dependable. And all the other good -ables. You know what they are.</li><li>Great communication and collaboration skills.</li><li>Strong work ethic and a healthy obsession with learning new things.</li><li>Familiarity with functional programming paradigms, especially Elixir and Javascript with React.js.</li><li>Don’t see your strengths listed? Tell us about them! We want eager and gritty applicants :) not narrowly pigeon holed engineers.</li></ul><div><h3>Bonus Points</h3></div><ul><li>Prior internships and proven track record in positions of responsibility.</li><li>Open source contributions to show your capabilities.</li><li>Previous experience on remote teams.</li><li>Students, non-traditional backgrounds, and misfits welcome. We come from a variety of backgrounds and we welcome likewise in you.</li></ul><ul></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://packlane.breezy.hr/p/5582b4609005-software-engineering-intern?source=weworkremotely' rel='nofollow'>https://packlane.breezy.hr/p/5582b4609005-software-engineering-intern?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 18, 2018 4:31:40 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "ZRb5ZxdpRku_KqSOCT47xA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/packlane-software-engineer-1",
    "title": "Packlane: Software Engineer",
    "content": "<div>  <div>    <h2>Software Engineer</h2>      <h4>Posted Mar 18</h4>    <h3>      <span>Packlane</span><br>      <span>Headquarters: San Francisco, CA</span><br>        <a href='https://packlane.com/' rel='nofollow'>https://packlane.com/</a>      <br>      <a rel='nofollow'>View all Packlane jobs →</a>    </h3>  </div>    </div>  <div>    <div>Consider Packlane a unique challenge - you’ll be in charge of code that allows people with a range of design knowledge (from novice to expert craftsman) to create a product that truly helps them tell their business’s brand story. It’s a big job, but the generalist engineer we’re looking for will be excited to work on a career-defining startup that’s pioneering a new approach to designing and manufacturing packaging. Join our team as a software engineer and put your super-skills to work for good.</div><div><br></div><div><h3>What You'll Do:</h3></div><ul><li>Ideate. Create. Innovate. Help our small (but ultra-productive!) team build new and wonderful products.</li></ul><ul><li>Craft the back end of our web applications and pitch in on front end development.</li><li>Build reliable systems in Elixir and Phoenix.</li><li>Design fabulous user experience with modern JavaScript standards (ECMAScript 2015 via Babel) and scale the front end with React.js and Redux.</li><li>Utilize unit testing in Elixir and Javascript with continuous integration to keep the bugs out.</li><li>Collaborate with stakeholders, department heads and consultants to provide the best user experience possible.</li><li>Bend steel with your bare hands (optional).</li></ul><div><h3>What You'll Love About Packlane:</h3></div><ul><li><span>Use the technologies you love -&nbsp;</span>Packlane is an opportunity to cut your teeth on an exciting technology stack, including innovative development frameworks and cutting-edge functional languages.</li><li><span>Support Modern Browsers -&nbsp;</span>We’re living in the future and build for modern versions of Chrome, Firefox, Safari and IE. No IE8 here.</li><li><span>We’re a small team</span>&nbsp;- You’ll be one of few, which means you’ll have a real chance to make an impact. Expect (and hopefully enjoy!) a lot of control and influence over product decisions and prioritization.</li><li><span>You’ll help build our future</span>&nbsp;- We’ve got a lot of ambitious projects in the works, from building manufacturing infrastructure from the ground up, to implementing robust order management systems that orchestrate an intricate production flow, and you’ll be at the forefront of it all.</li><li><span>Flexibility</span>&nbsp;- We’re an international team who appreciates the freedom to work remotely/from home when we need to, and we value getting everyone together in-person for the occasional company retreat.</li></ul><div><h3>REQUIREMENTS</h3></div><ul><li>Junior to Mid level engineer with some experience in Javascript and Elixir (or comparable languages). You’ve built big projects in production and have a couple languages under your belt.</li><li>You’re excited by TDD but also know when perfectionism is the enemy of delivered.</li><li>An easy-to-work-with attitude, well-organized and highly self-motivated.</li><li>Reliable. Accountable. Dependable. And all the other good -ables. You know what they are.</li><li>Great communication and collaboration skills.</li><li>Strong work ethic and a healthy obsession with learning new things.</li><li>Familiarity with Git, NPM, AWS and Heroku.</li><li>Don’t see your strengths listed? Tell us about them! We want eager and gritty applicants :) not narrowly pigeon holed engineers.</li></ul><div><h3>Bonus Points</h3></div><ul><li>Pragmatic approaches to complex problems. Know when a hack is the right solution.</li><li>Debugging experts willing to jump into the fray.</li><li>Functional programming advocates: who value immutability and functional purity.</li><li>Previous experience on remote teams.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://packlane.breezy.hr/p/41ee57114cc0-software-engineer?source=weworkremotely' rel='nofollow'>https://packlane.breezy.hr/p/41ee57114cc0-software-engineer?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 18, 2018 4:31:16 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "Vf-yGp13QYi8vuFzAC_sTw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4271-experienced-haskell-developer-stack-builders",
    "title": "Experienced Haskell Developer @ Stack Builders",
    "content": "<h2>              Experienced Haskell Developer<small> @ Stack Builders</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-03-16 20:06</p></dd>          <dt><span>Description</span></dt>          <dd><h5>DESCRIPTION</h5><p>If you’ve been passionate about Haskell for a while now and you’ve been looking forward to working in an environment that values best practices, clean code and contributing to the growth of the industry, this might be the right job for you.</p><p><strong>The Job</strong></p><p>You’d be working with Haskell on a daily basis (for web development), pairing regularly both with our remote and in-house teams, using agile methodologies, contributing to open source projects and sharing your knowledge with people that feel just as passionate about FP as you do.</p><p>We expect that the developer hired for this position will be able to:</p><ul><li>Deliver high quality code while meeting and exceeding client expectations.</li><li>Maintain, refactor and add to an existing code base.</li><li>Lead a team to tackle new projects when needed.</li><li>Conduct code review and pairing.</li><li>Communicate clearly and often about the project to us.</li><li>Keep expectations clear with the client.</li><li>When working with more junior developers support them and help them grow with clear, candid and respectful feedback.</li></ul><p><strong>About Us</strong></p><p>Stack Builders is an Agile software consultancy based in New York with offices in Quito, Ecuador. We are dedicated to going above and beyond not only by offering great services for our clients, but also by pushing the software industry forward through the use of better tools and practices.</p><p>Some of our projects are currently using Ruby, Rails, and Haskell as a back-end, with some PureScript, JavaScript and TypeScript (Node.js) on the front-end. We are passionate about providing clean and maintainable code that surpasses our client's expectations.</p><p>We work in a variety of languages and therefore we value developers who are flexible about working with different stack configurations, that feel confident about tackling new challenges, and that aim toward excellence.</p><p>If you’d like to work with passionate developers that value quality and best practices, this is the place for you!</p><p>You can learn more about us visiting <a href='https://www.stackbuilders.com/' rel='nofollow'>https://www.stackbuilders.com/</a> or take a look at our blog posts and tutorials.</p><h5>REQUIREMENTS</h5><p>For this position we require a developer <strong>experienced in the use of Haskell</strong>, with strong FP skills. Experience working with Agile methodologies and a passion for delivering high quality results.</p><p>To be able to assess the quality of code you deliver, <strong>please submit a link to your GitHub</strong> or a similar page where we can see your personal projects. We will be looking for code written in Haskell, that applies good practices and has tests.</p><p>This position is open for remote work to be conducted from any country where we don’t have offices. For citizens of countries where we have offices, please apply through our portal for any full time employee positions that may be available.</p><p>We will need for you to <strong>commit to 40 hours of work a week</strong> and to have your <strong>schedule overlap with our Quito - Ecuador offices for at least 5 hours a day</strong> so that the team can pair with you on stories and so you can be present for estimation sessions, stand-ups and other client meetings.</p><p>Since the team uses English to communicate, a <strong>high English level is a must</strong>.</p><p>This position is not open to consulting firms or hiring agencies.</p><p>Stack Builders is proud to be an Equal Opportunity employer. We do not discriminate based upon race, religion, color, nationality, gender, sexual orientation, age, disability or pregnancy.</p><h5>BENEFITS</h5><ul><li>Strong teaching culture<ul><li>Regular pairing sessions</li><li>Challenging projects</li></ul></li><li>Opportunities for company sponsored:<ul><li>Conference participation</li><li>Technical talks</li></ul></li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Your schedule must overlap with our Quito - Ecuador offices for at least 5 hours a day</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Mar 16, 2018 10:06:28 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "dtNRGf5WT4ukcxsimzlfeA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16583552",
    "title": "Mullvad | Gothenburg, Sweden | FULL-TIME | ONSITE or REMOTE | Backend Developer",
    "content": "<div>                  <span>Mullvad | Gothenburg, Sweden | FULL-TIME | ONSITE or REMOTE | Backend Developer<p>Mullvad is a VPN service that helps keep internet users’ online activity, identity, and location private. We are a team fully dedicated to our goal - making internet censorship and surveillance ineffective.</p><p>We are looking for an experienced back-end developer to advance Mullvad’s back-end services, You will be part of a small team working together to improve existing services, as well as develop new ones.</p><p>Requirements</p><p></p><pre><code>    * You have a few years’ experience in developing, designing the architecture for, and deploying back-end services    * You are comfortable using the right tools for the job and open to learning new skills when necessary    * You have run and deployed services on Linux-based systems and know your way around a terminal    * You are fluent in English</code></pre>Nice but not necessary<p></p><pre><code>    * experience with running services on bare-metal infrastructure is a bonus    * extensive experience in developing services in Python, Rust, or Go    * familiarity with using Qubes OS    * experience with Docker and Kubernetes    * experience in using configuration management such as Ansible or Saltstack    * interest in building systems with a heavy focus on security and privacy    * experience with low-level performance testing</code></pre>Benefits<p>We believe in having a life outside of work. That’s why we offer</p><p></p><pre><code>    * flexible working hours    * 25 days of annual paid vacation    * 300 EUR annually in allowance toward wellness-related activities (friskvårdsbidrag)    * the possibility of working remotely for extended periods of time</code></pre>We also offer opportunities for growth. Aside from company-initiated opportunities for attending various national and international conferences, you will also have the option to attend one of your choosing per year. In addition, we’ll pay for any reading material that you feel contributes to your professional development.<p>If you’re interested in joining our team, send us an email at jobs@mullvad.net by 15 June 2018.</p><p>More information and job listings can be found at <a href='https://mullvad.net/blog/tag/jobs/' rel='nofollow'>https://mullvad.net/blog/tag/jobs/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 14, 2018 1:00:08 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "jy4kkEy_TSCrbXiKh2lo7Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/stack-builders-experienced-haskell-developer-remote",
    "title": "Stack Builders: Experienced Haskell Developer (Remote)",
    "content": "<div>  <div>    <h2>Experienced Haskell Developer (Remote) </h2>      <h4>Posted Mar 13</h4>    <h3>      <span>Stack Builders</span><br>      <span>Headquarters: Pittsford, NY, USA</span><br>        <a href='https://stackbuilders.workable.com/jobs/682504' rel='nofollow'>https://stackbuilders.workable.com/jobs/682504</a>      <br>      <a rel='nofollow'>View all Stack Builders jobs →</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>If you’ve been passionate about Haskell for a while now and you’ve been looking forward to working in an environment that values best practices, clean code and contributing to the growth of the industry, this might be the right job for you.</span></div><div></div><div><br></div><div><h3><span>The Job</span></h3><br></div><div><span>You’d be working with Haskell on a daily basis (for web development), pairing regularly both with our remote and in-house teams, using agile methodologies, contributing to open source projects and sharing your knowledge with people that feel just as passionate about FP as you do.</span></div><div></div><div><br></div><div><span>We expect that the developer hired for this position will be able to:</span></div><div></div><div><br></div><ul><li><span>Deliver high quality code while meeting and exceeding client expectations. </span><br><br></li><li><span>Maintain, refactor and add to an existing code base.</span><br><br></li><li><span>Lead a team to tackle new projects when needed. </span><br><br></li><li><span>Conduct code review and pairing. </span><br><br></li><li><span>Communicate clearly and often about the project to us.</span><br><br></li><li><span>Keep expectations clear with the client.</span><br><br></li><li><span>When working with more junior developers support them and help them grow with clear, candid and respectful feedback.</span><br><br></li></ul><div><h3><span>Requirements</span></h3><br></div><div><span>For this position we require a developer experienced in the use of Haskell, with strong FP skills. Experience working with Agile methodologies and a passion for delivering high quality results.</span></div><div></div><div><br></div><div><span>To be able to assess the quality of code you deliver, please submit a </span><span>link to your GitHub</span><span> or a similar page where we can see your personal projects. We will be looking for code written in Haskell, that applies good practices and has tests.</span></div><div></div><div><br></div><div><span>This position is open for </span><span>remote work </span><span>to be conducted from any country where we don’t have offices. For citizens of countries where we have offices, please apply through our portal for any full time employee positions that may be available.</span></div><div></div><div><br></div><div><span>We will need for you to commit to 40 hours of work a week and to have your schedule overlap with our Quito - Ecuador offices for at least 5 hours a day so that the team can pair with you on stories and so you can be present for estimation sessions, standups and other client meetings. </span></div><div></div><div><br></div><div><span>Since the team uses English to communicate, </span><span>a high English level is a must.</span></div><div><br></div><div><span>This position is not open to consulting firms or hiring agencies.</span></div><div></div><div><br></div><div><span>Stack Builders is proud to be an Equal Opportunity employer. We do not discriminate based upon race, religion, color, nationality, gender, sexual orientation, age, disability or pregnancy.</span></div><div></div><div><br></div><div><h3><span>About Us</span></h3><br></div><div><span>Stack Builders is an Agile software consultancy based in New York with offices in Quito, Ecuador. We are dedicated to going above and beyond not only by offering great services for our clients, but also by pushing the software industry forward through the use of better tools and practices.</span></div><div></div><div><br></div><div><span>Some of our projects are currently using Ruby, Rails, and Haskell as a back-end, with some PureScript, JavaScript and TypeScript (Node.js) on the front-end. We are passionate about providing clean and maintainable code that surpasses our client's expectations.</span></div><div></div><div><br></div><div><span>We work in a variety of languages and therefore we value developers who are flexible about working with different stack configurations, that feel confident about tackling new challenges, and that aim toward excellence.</span></div><div></div><div><br></div><div><span>If you’d like to work with passionate developers that value quality and best practices, this is the place for you!</span></div><div></div><div><br></div><div><span>You can learn more about us visiting </span><a href='https://www.stackbuilders.com/' rel='nofollow'><span>https://www.stackbuilders.com/</span></a><span> or take a look at our </span><a href='https://www.stackbuilders.com/news/page/1' rel='nofollow'><span>blog posts</span></a><span> and </span><a href='https://www.stackbuilders.com/tutorials/' rel='nofollow'><span>tutorials.</span></a></div><div><br></div><div><h3><span>Perks</span></h3><br></div><div><span>Strong teaching culture </span></div><div><br></div><ul><li><span>Regular pairing sessions</span><br><br></li><li><span>Challenging projects</span><br><br></li></ul><div><span>Opportunities for company sponsored: </span></div><div><br></div><ul><li><span>Conference participation</span><br><br></li><li><span>Technical talks</span><br></li></ul><div><br></div><div><span>If interested, please apply </span><a href='https://stackbuilders.workable.com/jobs/682504' rel='nofollow'><span>through our site</span></a><em> </em><span>confirming your availability to work 40 hours a week, and please</span><span> include a link to a GitHub profile with your projects in Haskell</span><span> that we can evaluate. We will only consider candidates that apply through </span><a href='https://stackbuilders.workable.com/jobs/682504' rel='nofollow'><em>our portal</em></a><span>.</span></div><div></div><div><br></div><div><span>If we think you might be a good fit, a technical interview will follow.</span></div><div></div><div><br></div><div><span>If you are not available to work now, but would like to be considered for further work, please apply making sure that you include a note about this and we can reach out on a later time when we are looking for more people. Otherwise, feel free to reach out to us when you are available!</span></div><div><br></div><div><span><br></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please visit <a href='https://stackbuilders.workable.com/jobs/682504' rel='nofollow'>https://stackbuilders.workable.com/jobs/682504</a> and fill in your application.</p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 13, 2018 9:36:09 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "UHfJgdeyRd62mu2YByx1IQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16507356",
    "title": "Telcoin | ONSITE (REMOTE for some positions) | VISA in exceptional cases | Software Engineers, Designer, Community Managers | Full-Time (& INTERNS) | Tokyo",
    "content": "<div>                  <span>Telcoin | ONSITE (REMOTE for some positions) | VISA in exceptional cases | Software Engineers, Designer, Community Managers | Full-Time (&amp; INTERNS) | Tokyo<p>Telcoin is a Tokyo-based startup focused on providing financial services to developed and developing countries using crypto tokens delivered by mobile operators.</p><p>We are hiring for our Marketing, Prooduct and Engineering departments. Therefore looking for community managers, project managers, creatives/designers, and Android and backend programmers (we use Rust and, for the time being, Solidity for our smart contracts).</p><p>As a young but properly funded company (raised $25M two months ago), we do test our software, have a flexible vacation policy, very competitive packages including tokens and equity, enough runway for several years, and are potentially open to remote workers for some positions.</p><p>We believe in fair interview processes so we won't ask you to whiteboard your way out of a red black tree, but will make sure you can perform on the task. We also won't do more than two rounds of interviews, as we're respectful of your time.</p><p>If you're interested in financial inclusion, Rust, blockchain/cryptocurrencies, or simply want to write software that helps people send money home efficiently, please email jobs at telco dot in.</p><p>For backend positions, some experience with Rust, fraud management, or telecom software would be a nice plus, but not necessary.</p><p>We also welcome interns.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 3, 2018 4:00:13 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "tq6k-W5GTsuGcGtfZjKJ-g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16496787",
    "title": "Tweag.io | Paris, France | REMOTE + ONSITE | Software Engineer | Formal methods, PL design",
    "content": "<div>                  <span>Tweag.io | Paris, France | REMOTE + ONSITE | Software Engineer | Formal methods, PL design<p><a href='http://tweag.io' rel='nofollow'>http://tweag.io</a></p><p>We are a research and development laboratory at the heart of Europe, applying functional programming techniques to tame the complexity of distributed systems and scale predictably. Most of our existing folks have a PL research and/or formal methods background and enjoy demonstrating the correctness of their solutions with gusto: randomized test case generation, model checking in SPIN/Promela or interactive theorem proving using Coq. We're very active in the Haskell community - contributing new language extenions (linear types, static pointers) to GHC, publishing and maintaining HaskellR, inline-java, sparkle, rules_haskell and many others. We hit the HN front page just yesterday with our Haskell support in Bazel.</p><p>Tweag.io are organized as a distributed team of experts around three main areas of focus: distributed systems engineering, functional programming based devops (Nix, Haskell etc) and mathematical modelling / machine learning. We are looking for formal engineers and PL designers to join our distributed systems team, to help us apply interactive theorem proving techniques to industrial scale projects and work on tools to make this cost effective for the masses.</p><p>If you'd love the opportunity and the space to solve the hard problems of science's large dataset infrastructure, by systematically decomposing them into simple, orthogonal solutions that compose and commute like in algebra, shoot us an email at jobs@tweag.io.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 2, 2018 12:01:06 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "dxnuGa1ZSMO1wR62_LZI7w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16494719",
    "title": "Cabify | Software Engineers| Madrid,Spain | REMOTE & ONSITE | VISA",
    "content": "<div>                  <span>Cabify | Software Engineers| Madrid,Spain | REMOTE &amp; ONSITE | VISA<p>We have just been recognised as one of Europe's fastest growing private company and we're looking to keep growing with the help of some great mid-senior level people with previous experience working with either Go, Elixir or Ruby, however if not we are still happy to consider your application. For us it is more important to have team members who are adaptable and can help us solve problems that have not been solved before.</p><p>Join us now and be part of revolutionising urban mobility!</p><p>Apply here: <a href='https://cabify.workable.com/jobs/' rel='nofollow'>https://cabify.workable.com/jobs/</a></p><p>If you want to ask us any questions before you apply to make sure this is the company for you please contact talent@cabify.com<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 8:36:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "2WF5gr3HQbGvdkSnsDQZMg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/901-sr-software-engineer",
    "title": "Sr. Software Engineer",
    "content": "Sr. Software&nbsp;Engineer - Jobmote<div><div><h2>Sr. Software&nbsp;Engineer</h2><h5>Adult Beverage Company</h5></div></div><div><div><div><div><div><h2>Sr. Software Engineer // Phoenix &amp; Nerves</h2><p>Adult Beverage Company is a start up in the self-serve beer world. Our concept, called Hop, is currently open on the Las Vegas strip. We are in the process of further developing the product, making revolutionary changes to software and hardware with the intention of leading the way in this industry. We’re looking for an experienced engineer that can be energetic about the concept, see its potential, and work to make our collective vision a reality. Setting and completing deadlines and communicating frequently with Upper Management will be required of this position. The ideal candidate will have experience in the development tools listed below, but will also be passionate about beer and excited about working for a new company with unlimited potential.</p><p>The current platform leverages the following modern frameworks and will be an exciting and stimulating codebase for the experienced full-stack developer:</p><ul><li></li></ul><p>Native iOS Client(s) - manages the tap-screens and the customer on-boarding process. This is the customer’s primary interaction with the Hop platform. Codebases are written in both Swift and Objective C</p><ul><li></li></ul><p>Hardware - Raspberry Pi controlling a custom hardware configuration. The software controlling these devices has been written using Elixir, leveraging the Nerves framework</p><ul><li></li></ul><p>Web Application (API) - A central API to manage the orchestration of all the devices and various consumers, this is also written in Elixir, largely utilizing the phoenix framework</p><ul><li></li></ul><p>AWS Lambda - image processing and AWS Rekognition, primarily python</p><p>This Role: Sr. Software Engineer // Full Stack</p><p>This role will develop and manage the api and hardware services listed above. The ideal candidate will be a senior engineer who is also experienced in developing elixir. The platform is still under active development and once hired the candidate will be onboarded for a period of 6-8 weeks before assuming full ownership of the platform.</p><p>The ideal candidate will</p><ul><li></li></ul><p>Have 8+ year experience developing web applications</p><ul><li></li></ul><p>Have 2+ years elixir development</p><ul><li></li></ul><p>Have worked in real time systems</p><ul><li></li></ul><p>Be passionate about writing tests, automation and continuous deployment</p><ul><li></li></ul><p>Embrace Agile / XP</p><ul><li></li></ul><p>Understand the excitement of remotely controlling hardware from a web application</p><p>This is a full time contract position with on-call responsibilities.</p><p>Competitive Salary, D.O.E</p><p>Benefits are currently not offered by Adult Beverage Company</p><p>Job Types: Full-time, Contract, Remote</p><p>To apply, please send an email with the subject line “Hop - Full Stack Engineer” to <a href='mailto:jobs-hop@verypossible.com' rel='nofollow'>jobs-hop@verypossible.com</a> with the following information:</p><ul><li></li></ul><p>What’s most important to you from a company culture and operating environment?</p><ul><li></li></ul><p>What are the biggest things that de-motivate you and make you unhappy when it comes to being an engineer working on teams within a company?</p><ul><li></li></ul><p>Your resume</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 6:21:50 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/mobile",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile",
      "other"
    ]
  },
  {
    "id": "7w16e2dGQauTNmsX13GFAw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30353?r=rss2",
    "title": "Adult Beverage Company: Sr. Software Engineer",
    "content": "<p>Full-time</p><p><strong>(Las Vegas, NV or Remote)</strong> </p><h2>Sr. Software Engineer // Phoenix &amp; Nerves</h2><p>Adult Beverage Company is a start up in the self-serve beer world. Our concept, called Hop, is currently open on the Las Vegas strip. We are in the process of further developing the product, making revolutionary changes to software and hardware with the intention of leading the way in this industry. We're looking for an experienced engineer that can be energetic about the concept, see its potential, and work to make our collective vision a reality. Setting and completing deadlines and communicating frequently with Upper Management will be required of this position. The ideal candidate will have experience in the development tools listed below, but will also be passionate about beer and excited about working for a new company with unlimited potential.</p><p>The current platform leverages the following modern frameworks and will be an exciting and stimulating codebase for the experienced full-stack developer:</p><ul><li><p>Native iOS Client(s) - manages the tap-screens and the customer on-boarding process. This is the customer’s primary interaction with the Hop platform. Codebases are written in both Swift and Objective C</p></li><li><p>Hardware - Raspberry Pi controlling a custom hardware configuration. The software controlling these devices has been written using Elixir, leveraging the Nerves framework</p></li><li><p>Web Application (API) - A central API to manage the orchestration of all the devices and various consumers, this is also written in Elixir, largely utilizing the phoenix framework</p></li><li><p>AWS Lambda - image processing and AWS Rekognition, primarily python</p></li></ul><p>This Role: Sr. Software Engineer // Full Stack</p><p>This role will develop and manage the api and hardware services listed above. The ideal candidate will be a senior engineer who is also experienced in developing elixir. The platform is still under active development and once hired the candidate will be onboarded for a period of 6-8 weeks before assuming full ownership of the platform.</p><p>The ideal candidate will</p><ul><li><p>Have 8+ year experience developing web applications</p></li><li><p>Have 2+ years elixir development</p></li><li><p>Have worked in real time systems</p></li><li><p>Be passionate about writing tests, automation and continuous deployment</p></li><li><p>Embrace Agile / XP</p></li><li><p>Understand the excitement of remotely controlling hardware from a web application</p></li></ul><p>This is a full time contract position with on-call responsibilities.</p><p>Competitive Salary, D.O.E</p><p>Benefits are currently not offered by Adult Beverage Company</p><p>Job Types: Full-time, Contract, Remote</p><p>To apply, please send an email with the subject line “Hop - Full Stack Engineer” to <a href='mailto:jobs-hop@verypossible.com' rel='nofollow'>jobs-hop@verypossible.com</a> with the following information:</p><ul><li><p>What’s most important to you from a company culture and operating environment?</p></li><li><p>What are the biggest things that de-motivate you and make you unhappy when it comes to being an engineer working on teams within a company?</p></li></ul><ul><li><p>Your resume</p></li></ul><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 6:13:55 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/mobile",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile",
      "other"
    ]
  },
  {
    "id": "L87y-sJsQgq7psu04Fm6YQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168839/sr-full-stack-engineer-remote-usa-only-socialchorus?a=UCEd7zFhaVy",
    "title": "Sr. Full Stack Engineer (Remote, USA ONLY) at SocialChorus  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Communications, Enterprise Software</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>The modern workplace is changing. It seems strange but in a world of connected everything, employees are feeling more disconnected than ever. <strong>Want to fix that?</strong></p><p><strong>SocialChorus</strong> believes everyone matters and our goal is to have every employee informed, supported, and connected to each other and the shared goals of the organization. The intranet and email are broken for organization communications.</p><p><strong>How do we fix it? </strong>We deliver the right content at the right time to each person. This is what it means to be truly personalized.</p><p><strong>Has it worked?</strong> Absolutely! Our client list includes household names and is growing daily and now we need your help!</p><p>We are currently seeking a <strong>Sr. Full Stack Engineer</strong> to meet growing demand and dream up new ways of integrating with complex systems at a massive scale.</p><p><strong>We are a distributed team</strong>. Yes, we have offices in several cities but we build solutions for distributed workforces so we model our workforce the same way. In this role you really can work where you want.</p><p><strong>RESPONSIBILITIES</strong></p><ul><li>Create clean, maintainable, and scalable code.</li><li>Create REST based web services and APIs for consumption by mobile and web platforms</li><li>Act a leader to mentor and guide other team members to improve technical designs and decision making</li><li>Foster an environment of &quot;coding as a craft&quot; where creative solutions are required</li><li>Work with all levels of SocialChorus staff to implement new features and give product demonstrations.</li></ul><p><strong>QUALIFICATIONS</strong></p><ul><li>Full-stack development experience on high-scale systems in Java, Ruby, Go, Node, Clojure, etc.</li><li>Proven track record of scaling distributed systems</li><li>Capable of designing and building out API's that a developer community could be engaged to leverage.</li><li>Strong knowledge in OOD, Domain-driven design, and micro-services</li><li>Experience working in an agile development&nbsp;&nbsp;</li></ul><p><strong>Why SocialChorus?</strong></p><p>Because you care. About people, the work you do, and the connections you make. Work is such a large part of life, it only makes sense to make it awesome.&nbsp;</p><p>If you want to engage brilliant minds in a true start-up environment where ideas are rewarded regardless of who they come from, join us. This is a rapidly changing space so if you thrive on ambiguity, are hungry for a challenge, and have the guts to speak your mind it could be a perfect fit.</p><p>So come for the challenges, come for the people, and the unlimited PTO, health benefits, 401k plan, casual and friendly environment, and a leadership team who truly believes in your growth both professionally and personally will keep you here.</p>                    </div>                            <h2>                About SocialChorus            </h2>            <div><p>SocialChorus is the leading employee engagement company by providing a&nbsp;<a href='https://www.socialchorus.com/platform/' rel='nofollow'>workforce communications platform</a>&nbsp;that transforms how workers and organizations connect every day. Designed for every worker from head office to the front line, our solution enables a more informed, connected and supported workforce. Organizations that depend on SocialChorus are able to connect and align their teams, power organizational initiatives and measure the business outcomes.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Unlimited PTO                            </div>                            <div>                                 Great work/life balance                            </div>                            <div>                                 Free Code Friday                            </div>                            <div>                                 Relaxed &amp; casual environment                            </div>                            <div>                                 Continuous learning environment                            </div>                            <div>                                 Remote work with great teammates                            </div>                            <div>                                 401k, Medical, Dental, Vision, Vacation bonuses, more!                            </div>                            <div>                                 Stock options for all new hires                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 23, 2018 10:10:12 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/Any"
    ],
    "tagsNames1": [
      "Any time zone"
    ],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "bDOlw9jaQXWwOFVsAKUN1w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/155699/software-engineer-control-systems-fastly?a=QdqFzyAAjU4",
    "title": "Software Engineer - Control Systems at Fastly (San Francisco, CA)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Internet Infrastructure</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>SOFTWARE ENGINEER – CONTROL SYSTEMS</strong></p><p>We’re looking for talented software engineers with experience in building backend systems to join our team. This role is responsible for building, enhancing and maintaining the platform to deliver our core CDN configurations as well as our future Edge Cloud products. We have local offices in San Francisco, Portland and other locations. Remote workers are also encouraged to apply. Pacific time zone or close to is preferred.</p><p>To be effective in this role, you would have:</p><ul><li>Experience with Perl, Go and other languages in interdependent environments.</li><li>Experience with database systems and applications.</li><li>Experience migrating data models, operating and deploying an always-on system.</li><li>Experience building APIs to handle complex and sensitive data.</li><li>Experience in distributed systems, caching and HTTP APIs.</li><li>Experience improving the reliability and efficiency of fault-tolerant distributed systems.</li><li>Experience with database and system profiling.</li></ul><p>We value a variety of voices, so this is not a laundry list. &nbsp;You’ll be a good candidate if you have experience and/or interest in SOME of these:</p><ul><li>Maintaining and developing large-scale and/or global production systems</li><li>Linux/UNIX systems, both high and low level</li><li>Writing code that is performant, maintainable, clear, and concise</li><li>Expertise in designing, analyzing, profiling, and troubleshooting APIs and large-scale, distributed systems</li><li>Experience with software engineering best practices (e.g. unit testing, code reviews, design documentation, release deployment)</li></ul><p><em>Fastly provides equal employment opportunity without regard to an applicant’s race, sex, pregnancy, sexual orientation, gender identity or expression, genetic information, national origin, age, physical or mental disability, medical condition, religion, marital status or veteran status.&nbsp;</em></p><p><em>Applicants with disabilities may be entitled to reasonable accommodation under the terms of the Americans with Disabilities Act and certain state or local laws. A reasonable accommodation is a change in the way things are normally done which will ensure an equal employment opportunity without imposing undue hardship on Fastly. Please inform us if you need assistance completing any forms or to otherwise participate in the application process.&nbsp;</em></p>                    </div>                            <h2>                About Fastly            </h2>            <div><p>Fastly helps the world’s most popular digital businesses keep pace with their customer expectations by delivering fast, secure, and scalable online experiences. Businesses trust Fastly to accelerate the pace of technical innovation, mitigate evolving threats, and scale on demand. Founded in 2011, Fastly powers online destinations including Airbnb, GitHub, Alaska Airlines, Pinterest, Vimeo, The Guardian, The New York Times and Ticketmaster.</p><p>The worldwide cloud services market is projected to grow rapidly to $236 billion in 2020, according to Forrester, Inc. As more and more businesses move operations to the cloud, Fastly is well positioned to continue increasing CDN, cloud networking and cloud security market share with edge cloud services that reach beyond content delivery.</p><p>We’re building a better Internet. Come join us.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Catered Lunches                            </div>                            <div>                                 Dog-Friendly                            </div>                            <div>                                 Flexible Working Hours                            </div>                            <div>                                 Beer, Wine, Cold Brew On Tap                            </div>                            <div>                                 Walking distance from BART and CalTrain                            </div>                            <div>                                 Unlimited PTO                            </div>                            <div>                                 Wellness: Yoga                            </div>                            <div>                                 Frequent Tech Talks                            </div>                            <div>                                 Sponsors Meetups                            </div>                            <div>                                 Fully-covered Health, Dental, and Vision Insurance                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "bXhjL80PShW1yiBHQAKzdQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16299035",
    "title": "Kadena | Software Engineer | REMOTE, ONSITE (Brooklyn, NY) | Full-Time $80k-$150k + Coin and/or Equity",
    "content": "<div>                  <span>Kadena | Software Engineer | REMOTE, ONSITE (Brooklyn, NY) | Full-Time $80k-$150k + Coin and/or Equity<p>Kadena is seeking Haskell engineers to join our team either in Brooklyn or remote. Kadena (<a href='http://kadena.io' rel='nofollow'>http://kadena.io</a>) is a tech-founded, post-revenue smart-contract blockchain startup founded in 2016 by Stuart Popejoy and Will Martino, two lead engineers from JP Morgan’s blockchain group. Kadena is poised to become the leading blockchain platform for businesses and enterprises by solving scalability and security concerns that impede widespread blockchain adoption. Our existing technology stack consists of our open-source smart contract language Pact and our private-chain protocol ScalableBFT, products that are already in use with Fortune-100 clients and coded entirely in Haskell. We firmly believe Haskell lends a decisive advantage through drastically enhanced productivity, excellent concurrency and parallelization support, unbeatable programming-language tooling, and sheer pleasure of coding. We’ve built a lot with just two devs, we can’t wait to see what you will add to our stack!</p><p>The ideal candidate will be able to work closely with a group but also drive projects independently. Developers are encouraged to interact at every level of product development. Initial focus is on building out our new public-chain protocol Chainweb and furthering our work in formal verification of Pact smart contracts; later projects will include operational pieces for the public platform like load balancers, monitoring, and messaging systems. Finally, partner integrations can lead to entirely new products integrating Pact smart contracts with bespoke systems. Public-chain projects are entirely open source (BSD3), and contributions to other projects are encouraged as well.</p><p>Exposure and expertise in any of the following areas is desirable:</p><p>- Network engineering</p><p>- Cryptography engineering</p><p>- Distributed Systems</p><p>- Programming language design (e.g. compilers, interpreters, development tools)</p><p>- Database Systems (RDBMS but also key-value systems)</p><p>- Software assurance/verification (Coq, SMTLIB2, QuickCheck, Jepsen, Coq, HOL)</p><p>- Industrial/production Haskell development</p><p>To apply please send a resume to hiring+hn@kadena.io.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:20:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "rI4WUV0vQgeh6FwDbv0PJQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16288851",
    "title": "Capital Match | Singapore | Full-time | Onsite or Remote | Visa Sponsorship",
    "content": "<div>                  <span>Capital Match | Singapore | Full-time | Onsite or Remote | Visa Sponsorship<p>Capital Match is the market-leading fintech startup in Singapore specializing in peer-to-peer loans and invoice financing. We have recently expanded to other regional markets like Hong Kong and we are growing tremendously. We just closed our Series B funding recently.</p><p>Technologies: Haskell, ClojureScript, React (Om), SCSS, Docker, AWS, Event sourcing</p><p>You will be a full-stack developer developing cutting-edge web applications, everything from the UI to the backend data storage.</p><p>Email hr+hn@capital-match.com. Mention that you saw the posting from Hacker News for bonus points.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 9:00:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "other"
    ]
  },
  {
    "id": "IsT80Kt8QOCK_1-JBKl-8g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16284001",
    "title": "Pirate Studios - https://www.piratestudios.co.uk | Senior and mid-weight Developers | ONSITE & REMOTE | Bristol, London, M4 Corridor, UK | Full-time Pirate ...",
    "content": "<div>                  <span>Pirate Studios - <a href='https://www.piratestudios.co.uk' rel='nofollow'>https://www.piratestudios.co.uk</a> | Senior and mid-weight Developers | ONSITE &amp; REMOTE | Bristol, London, M4 Corridor, UK | Full-time<p>Pirate Studios is building music rehearsal studios in multiple countries, and we're big on tech in our studios. We're the biggest rehearsal studio provider in the UK and rapidly expanding abroad. We build our own studios that are open 24/7, and all booking is handled online.</p><p>We're looking to expand our dev team right now. Being excited about music is definitely a bonus, but we have loads of fun and exciting programming projects in the pipeline. Ideas are welcome and many of our improvements come from people in the business suggesting them.</p><p>Our projects are primarily in Ruby and JavaScript, though we also develop IoT applications in languages like Rust and Haskell. We work in small project-based teams on our various components, and we have dedicated (and good!) project managers who help give us plenty of time and space to focus on programming.</p><p>Ideally we're looking for people in Bristol, where we're soon opening a new office. Many of the dev team work remotely, but the majority of us are within easy distance of Bristol (or London) and we meet up regularly to discuss/work/beer together.</p><p>I'm Head of Development, and working for Pirate Studios is the best job I've ever had. I'll go out of my way to make sure you get to build great things :)</p><p>Email us at tech-jobs@piratestudios.co.uk<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:59:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "PI4gJ5fTSUacZVnbHJLKRA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283822",
    "title": "AdRoll | San Francisco | On-site/remote | Full-time If you like developing open-source code, languages such as Python, Go, JS, ...",
    "content": "<div>                  <span>AdRoll | San Francisco | On-site/remote | Full-time<p>If you like developing open-source code, languages such as Python, Go, JS, C, D, Lua, Erlang, AWS, petabytes of data, and distributed low-latency systems, this may be your dream job.</p><p>This time we are particularly interested in finding full stack web developers with good JavaScript experience and experienced developers, tech leads and data scientists with great math knowledge and coding skills. This is a really unique opportunity to get to work with a massive scale (thousands of instances on AWS), low latency (real-time bidding with 100ms max latency and 70B requests daily, real-time machine learning with 1ms max latency), mission-critical systems (this is how we make money) and enjoy working on a strong frontend development team (<a href='http://tech.adroll.com/blog/frontend/2017/08/29/how-to-run-a...' rel='nofollow'>http://tech.adroll.com/blog/frontend/2017/08/29/how-to-run-a...</a>).</p><p>Learn more about us here <a href='http://tech.adroll.com/blog/' rel='nofollow'>http://tech.adroll.com/blog/</a></p><p>I am happy to tell you more over coffee in SF or by email, dialtone@adroll.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:39:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/go",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "go",
      "other"
    ]
  },
  {
    "id": "x2ggkWjPQ5iXRRzieF1lBg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283717",
    "title": "PSPDFKit | REMOTE | Full-time | JavaScript, Elixir PSPDFKit is the leading SDK for working with PDF files on Android, iOS ...",
    "content": "<div>                  <span>PSPDFKit | REMOTE | Full-time | JavaScript, Elixir<p>PSPDFKit is the leading SDK for working with PDF files on Android, iOS and Web. We're trusted by Dropbox, Box and many Fortune 500 companies to take care of these tricky yet essential parts in their Android and iOS apps.</p><p>PSPDFKit for Web is our youngest product - you can see it in action here: <a href='https://web-preview.pspdfkit.com' rel='nofollow'>https://web-preview.pspdfkit.com</a></p><p>Last year we released PSPDFKit for Web Standalone, which works completely in the browser, using WebAssembly: <a href='https://pspdfkit.com/blog/2017/webassembly-a-new-hope/' rel='nofollow'>https://pspdfkit.com/blog/2017/webassembly-a-new-hope/</a></p><p>If you're interested in working for a fully bootstrapped company, with a team all over the globe, that iterates quickly and uses a modern, pragmatic tech stack, then check out our job ad: <a href='https://pspdfkit.com/jobs/frontend-web-engineer/' rel='nofollow'>https://pspdfkit.com/jobs/frontend-web-engineer/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:28:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/mobile",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile",
      "other"
    ]
  },
  {
    "id": "rE_cNvT9Q061UlaoqliB8g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283268",
    "title": "RentPath | Software Engineer + Sr. SW Engineers | Atlanta, GA | Full Time REMOTE RentPath is a leading digital media company. Empowering ...",
    "content": "<div>                  <span>RentPath | Software Engineer + Sr. SW Engineers | Atlanta, GA | Full Time REMOTE RentPath is a leading digital media company. Empowering millions to find apartments and houses for rent.If you're looking for an opportunity to learn, teach, grow, and be a part of a dedicated team of engineers working with some interesting technologies, please apply.<p>-- Clojure: <a href='https://www.rentpath.com/openings/?uID=&amp;ref=Applied+Directly&amp;cjobid=CS981798105&amp;rpid=36239&amp;postid=DMOzvX95JLQ' rel='nofollow'>https://www.rentpath.com/openings/?uID=&amp;ref=Applied+Directly...</a></p><p>-- Elixir: <a href='https://www.rentpath.com/openings/?uID=&amp;ref=Applied+Directly&amp;cjobid=CS161865103&amp;rpid=36160&amp;postid=S_7cdhknQR0' rel='nofollow'>https://www.rentpath.com/openings/?uID=&amp;ref=Applied+Directly...</a></p><p>or email me at mperryman+hn@rentpath.com. Thanks!<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 6:45:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ]
  }
]
}
