{
 "items": [
  {
    "id": "7qR8_fVoT-KdZoMuPhNk-A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/131074/senior-javascript-engineer-security-expertise-elastic?a=HXp915iI6gE",
    "title": "Senior JavaScript Engineer -Security Expertise- Top Open Source Software at Elastic () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Frontend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Data &amp; Analytics, Search, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>501-1k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>In this role you will collaborate with bright people who share your knowledge of web security and JavaScript, and have a desire to take on new challenges.</p><p><em><strong>Please include a short note as to why you are a fit for the role and why working at Elastic interests you :)</strong></em></p><p>Do you want to work on an extensible platform for data exploration that impacts the lives of millions of people? Are you a creative JavaScript engineers with security experience who lives to tackle meaningful problems? Do you enjoy working on security-related architecture and features in Kibana?</p><p>If so, we'd love to talk.</p><p>If you read this far and think, “that's me!” then you probably won't need to read any further and we should have a conversation. But if you are in any doubt the type of experiences we expect you to have then the following should help clarify;</p><p><strong><strong>Engineering</strong> <strong>philosophy</strong></strong></p><p>We believe that engineering complex, pluggable software for the web that is built to last the test of time is both tricky and exciting. Doing so requires a team of diverse individuals, with sharp minds and the ability to empathize with our users, working together with mutual respect and a common mission.</p><p>We care deeply about giving you full ownership of what you're working on. Our company fundamentally believes great minds achieve greatness when they are set free and are surrounded and challenged by their peers, which is clearly visible throughout our organization. At Elastic, hierarchy does not determine how decisions get made. We feel that anyone needs to be in the position to comment on anything, regardless of their role within the company.</p><p><strong><strong>These</strong> <strong>are</strong> <strong>the</strong> <strong>kinds</strong> <strong>of</strong> <strong>problems</strong> <strong>you</strong> <strong>will</strong> <strong>work</strong> <strong>on</strong></strong></p><ul><li>Design and implement internal security mechanisms to secure individual Kibana servers</li><li>Implement access control for APIs, saved objects, and UI functionality</li><li>Build multi-layer solutions for safely executing server-side plugin code with node.js sandboxing and seccomp</li><li>Advocate for secure coding principles</li><li>Develop different single sign-on integrations</li><li>Support our support engineers with harder security problems</li></ul><p><strong><strong>Skills</strong> <strong>&amp;</strong> <strong>requirements</strong></strong></p><ul><li>7+ years building secure software for the web with JavaScript</li><li>Experience in penetration testing of web services and applications</li><li>Experience supporting and analyzing security incidents in production web services and applications</li><li>Experience writing and a deep appreciation for automated testing</li><li>Excellent verbal and written communication skills</li><li>A phenomenal teammate with strong analytical, problem solving, debugging and troubleshooting skills</li></ul><p><strong><strong>Experience</strong> <strong>in</strong> <strong>these</strong> <strong>areas</strong> <strong>is</strong> <strong>a</strong> <strong>plus</strong></strong></p><ul><li>Operational logging and monitoring</li><li>Running a popular open source project</li><li>Previous experience in a globally distributed team</li></ul>                    </div>                            <h2>                About Elastic            </h2>            <div><p>Elastic is the world's leading software provider for making structured and unstructured data usable in real time for search, logging, security, and analytics use cases. Founded in 2012 by the people behind the Elasticsearch, Kibana, Beats, and Logstash open source projects, Elastic's global community has more than 80,000 members across 45 countries, and since its initial release. Elastic's products have achieved more than 100 million cumulative downloads. Today thousands of organizations, including Cisco, eBay, Dell, Goldman Sachs, Groupon, HP, Microsoft, Netflix, <em>The New York Times</em>, Uber, Verizon, Yelp, and Wikipedia, use the Elastic Stack, X-Pack, and Elastic Cloud to power mission-critical systems that drive new revenue opportunities and massive cost savings. Elastic is backed by more than $104 million in funding from Benchmark Capital, Index Ventures, and NEA; has headquarters in Amsterdam, the Netherlands, and Mountain View, California; and has over 400 employees in more than 30 countries around the world.</p><p><strong>Additional Information</strong></p><ul><li>Competitive pay and benefits</li><li>Stock options</li><li>Catered lunches, snacks, and beverages in most offices</li><li>An environment in which you can balance great work with a great life</li><li>Passionate people building great products</li><li>Employees with a wide variety of interests</li><li>Your age is only a number. It doesn't matter if you're just out of college or your children are; we need you for what you can do.</li></ul><p>Elastic is an Equal Employment employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status or any other basis protected by federal, state or local law, ordinance or regulation. Elastic also makes reasonable accommodations for disabled employees consistent with applicable law.</p><p>Elastic is an Equal Employment employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status or any other basis protected by federal, state or local law, ordinance or regulation. Elastic also makes reasonable accommodations for disabled employees consistent with applicable law.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 401k Matching Up to 6 % in US and Pensions in some other countries                            </div>                            <div>                                 Health Care Insurance                            </div>                            <div>                                 Vacation Time Determined By Location                            </div>                            <div>                                 Lunch and Breakfast in Most Offices                            </div>                            <div>                                 100% Remote work possible                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "DBG_TECH1:k_t_w:javascript_frontend_4",
      "DBG_TECH1:k_t_w:javascript_mobile_4",
      "DBG_TECH1:k_t_w:javascript_nodejs_4",
      "DBG_TECH1:k_t_w:node.js_nodejs_13",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=4, php=0, nodejs=17, embedded=0, frontend=4, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TECH2_angular",
      "TECH2_javascript",
      "TECH2_node.js",
      "TECH2_reactjs",
      "TECH2_security",
      "TITLE1_dev",
      "TZ_America_East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "angular",
      "javascript",
      "node.js",
      "nodejs",
      "reactjs",
      "security"
    ]
  },
  {
    "id": "P37pZxVcTe2Y3KPS3bjM3w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/162775/full-stack-developer-neill-technologies?a=SAyKP7v27h6",
    "title": "Full Stack Developer at Neill Technologies () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Beauty, Point of Sale</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are looking for an exceptional individual to join our growing team of&nbsp;developers, working within the amazingly vibrant Salon and Spa world. As part of our team, you will own and drive technical projects from specification through to delivery and beyond. If you get a buzz from taking initiative, redefining expectations, building&nbsp;champion&nbsp;software&nbsp;and getting involved in challenging technical debates with the team, this is the place for you.</p><p>&nbsp;We are offering a flexible work at home environment: no more office commute!</p><p><strong>Responsibilities</strong></p><p>Reporting directly to the CTO, you will have&nbsp;ownership of building product components from the design stage, right through to production.&nbsp;&nbsp;</p><ul><li>You will deliver complete solutions to business problems,&nbsp;</li><li>You will shape product direction and roadmap choices.</li><li>You will design and deliver beautiful, scalable and robust solutions.</li><li>You will help build a friendly, supportive engineering team and culture</li></ul><p><strong>&nbsp;Job Role</strong></p><ul><li>Hands-on development: analyze product specifications, design implementations, write code and rapidly deliver features.</li><li>Develop engaging and robust digital experiences to complement our entire product suite.</li><li>Contribute technical ideas and suggestions to enhance the direction of the product.</li><li>Write efficient, maintainable and reusable code and associated unit tests.</li><li>Be an efficient and responsible team member, communicate, participate and help</li><li>Help to mentor other members of the team and contribute to system architecture and development process.</li><li>Work with QA in a biweekly release cycle.</li><li>Be enthused about teamwork in an AGILE environment: attend daily stand-ups, plan and demo your projects.</li><li>Work with our outsource partners to ensure all work meets our exacting standards.</li></ul><p><strong>Skills &amp; Requirements</strong>&nbsp;</p><ul><li>Full Stack&nbsp;developer with several years of relevant&nbsp;experience.</li><li>Product-focused, Agile&nbsp;application development experience.</li><li>Evidence of delivering consumer facing, mass market, networked, high-performance web and/or mobile&nbsp;applications.</li><li>Up to date with the latest application trends and technologies.</li><li>Good understanding of&nbsp;data structures, design patterns, and modern programming practices.</li><li>Understanding of analytics, remote reporting and measurements.</li><li>&nbsp;Experience of working with Continuous Integration (CI) and Unit Testing.</li><li>Experience in application&nbsp;performance tuning.</li><li>Strong&nbsp;design sensibilities</li><li>Experience building beautiful, responsive and high-quality systems.</li></ul><p><strong>&nbsp;Technical Skills</strong>&nbsp;</p><ul><li>at least one of&nbsp;Angular 2+/Angular/React (preferably&nbsp;Angular 2+)</li><li>HTML5/CSS&nbsp;and&nbsp;relevant build tools</li><li>Node.js</li><li>Lambda &amp;&nbsp;AWS api Gateway</li><li>Express.js</li><li>RESTful api experience</li><li>Automated testing</li></ul><p>also nice to have:</p><ul><li>Dynamo/Mongo/Cassandra</li><li>Python</li><li>Java</li><li>ElastiCache</li><li>Oracle</li></ul><p>About You:</p><ul><li>Self-motivated and able to achieve deadlines and work independently.</li><li>Love to write clean, reusable code and have a passion for web/mobile development.</li><li>Solid communication skills and team-working capability.</li><li>Positive and logical approach together with willingness to learn.</li><li>Attention to detail and a passion for quality.</li><li>Ability to work remotely, be self-motivated and disciplined in work/life balance.</li></ul>                    </div>                            <h2>                About Neill Technologies            </h2>            <div><p>SalonBiz was the first software management system in the beauty industry. We created it primarily as a tool to help our industry to&nbsp;measure and track performance. In today’s competitive market, SalonBiz remains the top software solution.</p><p>SalonBiz was created by&nbsp;<a href='http://neill.com/' rel='nofollow'>Neill Corporation</a>&nbsp;almost 30 years ago, before most salons had computers—but we’ve been in the beauty industry for over 70 years, building software and running our own chain of award winning salons, spas and barber shops. And here’s what we know to be true:</p><p><strong>Relationships are what make the beauty industry unlike any other.</strong></p><p>When you live it and love it like we do, you help grow it, from the salon’s bottom line to the individual stylist’s paycheck.</p><p>When our industry friends experience wild success, or get up and try again, they share their experiences with us. It’s those stories that built this software.</p><p><strong>That’s why over half of the</strong><em><strong>Salon Today</strong></em><strong>200 salons use SalonBiz.</strong></p><p>Thanks to this group of innovators, our software is a collective intelligence for growth.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from Home                            </div>                            <div>                                 Flexible Working Hours                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "DBG_TECH1:k_t_w:angular_frontend_16",
      "DBG_TECH1:k_t_w:express_nodejs_8",
      "DBG_TECH1:k_t_w:java_java_2",
      "DBG_TECH1:k_t_w:java_mobile_1",
      "DBG_TECH1:k_t_w:node.js_nodejs_13",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=2, java=2, dotnet=0, c=0, gamedev=0, mobile=1, php=0, nodejs=21, embedded=0, frontend=16, bigdata-ml=0, ruby=0}",
      "REMOTE1_50",
      "TECH1_nodejs",
      "TECH2_agile",
      "TECH2_angularjs",
      "TECH2_express",
      "TECH2_node.js",
      "TECH2_rest",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "agile",
      "angularjs",
      "express",
      "node.js",
      "nodejs",
      "rest"
    ]
  },
  {
    "id": "VBP_leLITr-7SrUXfPC0cA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15878708",
    "title": "MAARK | Senior Web Developer | Cambridge, MA | Full-time | Onsite",
    "content": "<div>                  <span>MAARK | Senior Web Developer      | Cambridge, MA | Full-time  | Onsite<p>MAARK | Senior Fullstack Engineer | Cambridge, MA | Contractor | Onsite/Remote</p><p>MAARK, a strategic marketing and innovation agency, is hiring a Senior Web Developer (fulltime) and Senior Fullstack Engineer (contractor) who can develop and implement responsive/MVC web apps and websites with a high degree of focus on the visual design and the overall UX. As a dev team, we work on creative projects, utilize a wide variety of fullstack technologies (e.g., React, Marrionette, Node.js, Laravel), and empower our developers to create innovative solutions and explore/learn emerging tech.</p><p>We are hiring for a full time role in our Cambridge, MA office, with considerable work-at-home flexibility. For the contractor role, the ideal candidate is in the Boston area, but remote candidates will also be considered. For full details on fullstack position, check out <a href='https://maark.workable.com/jobs/594381' rel='nofollow'>https://maark.workable.com/jobs/594381</a>.</p><p>For info on MAARK, see <a href='https://www.maark.com/' rel='nofollow'>https://www.maark.com/</a></p><p>To apply or for questions, email me (I head up engineering) directly at rwagner@maark.com. (No recruiters please.)<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Dec 8, 2017 4:15:09 PM",
    "tags": [
      "DBG_TECH1:k_t_w:laravel_php_8",
      "DBG_TECH1:k_t_w:node.js_nodejs_13",
      "DBG_TECH1:k_t_w:reactjs_frontend_8",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=8, nodejs=13, embedded=0, frontend=8, bigdata-ml=0, ruby=0}",
      "REMOTE1_50",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "w7VV5073Syq5Ngt-Xsuw2w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/64011/nodejs-back-end-developer-at-tallysticksio/",
    "title": "Node.js Back-end Developer",
    "content": "At Tallysticks, we believe that international trade brings the global community together. We’re opening up growth for independent businesses, building trust with their trading partners and confidence in their trade potential. We’ve simplified the end-to-end trade process by creating a single online tool for documentation, communications and payments. Tallysticks reduces the effort, cost and risk of trade management for independent businesses. Our aim is to help SMEs around the world grow their business.<br /><br />What is Tallysticks?<br />Tallysticks is a solution that helps customers create, negotiate, and agree international (containerised) trade contracts with ease. The solution is comprised of two key products:<br /><br />   1) a trade book - an application enabling importers and exporters to draft and sign legally binding trade contracts<br />   2) a payments mechanism - a framework that allows buyers and sellers to confidently exchange payment in a protected manner<br /><br />We have a number of different products and applications envisaged over the coming years, but the above two are the focus for 2018.<br /><br />Backend engineer<br />The role<br />We are an agile-based team looking to transform an old and static industry applying B2C customer service and tech principles to a B2B world. We’re looking for an ambitious Node.js Back-end Developer to join our engineering team and work on expanding our core product APIs. As well as building features, you’ll be expected to take part in tech planning sessions and shape the whole tech stack going forward.<br /><br />You must be an excellent communicator, face-to-face or over Slack. We are one team and work as a collective towards a common goal. This is not a place for a contracting mindset!<br /><br />Successful candidate profile<br />The successful candidate will want to build an industry-changing product and has a proven track record of building APIs and backend services with Node.js:<br />   - 5+ years Software or Web development experience, min. 2 years experience with Node.js<br />   - Confident using SQL databases and NoSQL databases (we use Postgres and Redis at the moment)<br />   - Has experience of web paradigms such as Microservices, REST, WebSockets, Authentication<br />   - Strong software engineering principles - you know your best practices for writing secure, fast and maintainable code<br />   - Good knowledge of modern JavaScript including the latest language features<br />   - Build, testing and automation tools such as CI tools and Docker<br />   - Familiar with cloud computing concepts (we use AWS)<br />   - Desirable: understanding of security and basic cryptography concepts<br />   - Desirable: some knowledge of data engineering for analytics<br />   - Desirable: experience with one or more other languages (Go, Python)<br /><br />When does the position start?<br />We only accept the best candidates and as such are in no rush. We hope to have the right person through the door by February 2018 but we will wait for the right person.<br /><br />Application process<br />   1) Send CV and Cover Letter<br />   2) Phone Screening Interview with competency based questions<br />   3) Take-home test<br />   4) Face-to-Face interview<br /><br />Remuneration and package<br />We offer a competitive package including salary and equity. We are a meritocracy and reward good work.<br /><br />Tallysticks leadership team<br />   - CEO: ex JP-Morgan Emerging Markets Analyst, ex US Diplomat and previous SME owner<br />   - CTO: ex CTO of CarThrottle<br />   - COO: ex KPMG Machine Learning Product Manager, ex Berlin Tech Accelerator<br />   - Head of Product: ex TechStars Mentor and B2B and B2C Product Manager",
    "urlFetchPending": false,
    "published": "Dec 4, 2017 11:12:19 AM",
    "tags": [
      "DBG_TECH1:k_t_w:javascript_frontend_1",
      "DBG_TECH1:k_t_w:javascript_mobile_1",
      "DBG_TECH1:k_t_w:javascript_nodejs_1",
      "DBG_TECH1:k_t_w:machine-learning_bigdata-ml_8",
      "DBG_TECH1:k_t_w:node.js_nodejs_52",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=2, java=0, dotnet=0, c=0, gamedev=0, mobile=1, php=0, nodejs=53, embedded=0, frontend=1, bigdata-ml=8, ruby=0}",
      "REMOTE1_50",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "2VkjyI4wT-Wda5ByeKpKXQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15828802",
    "title": "Podaris | Full or Part-time | REMOTE | London, UK Podaris (https://www.podaris.com/) is re-inventing how the world plans its ...",
    "content": "<div>                  <span>Podaris | Full or Part-time | REMOTE | London, UK<p>Podaris (<a href='https://www.podaris.com/' rel='nofollow'>https://www.podaris.com/</a>) is re-inventing how the world plans its cities. We're developing a platform for urban infrastructure planning, with a focus on agile, real-time collaboration, combining elements of BIM and GIS. We've been in tiny-startup mode for several years, but have built a serious and acquired a small but loyal customer base. Now we have an opportunity to scale rapidly. We're looking for:</p><p>- Full-stack developers with experience building complex single-page applications.</p><p>- Developers with experience in GIS, BIM, Parametric modelling, applied graph theory, transport microsimulation, or API design.</p><p>- Interface designers who can also code</p><p>- Documentation / technical writers who are familiar with urban planning, transport planning, architecture, civil engineering, or related industries (INTERN opportunity)</p><p>- People with a passion for making better cities around the world.</p><p>Our tech stack includes: OpenStreetMap, OpenLayers, Meteor, Node, Go, Kubernetes, Docker.</p><p>We're based at the Urban Innovation Centre in London, UK, but are open to remote workers from anywhere in the world, provided we can establish a collaborative rapport. Equity is also available for extraordinarily talented individuals. Currently we can only offer contract work, but we expect further financing to soon allow us to hire full-time as well.</p><p>Contact: jobs@podaris.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Dec 2, 2017 1:43:10 AM",
    "tags": [
      "DBG_TECH1:k_t_w:meteor_nodejs_8",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=8, embedded=0, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_50",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "tamPOvjBRm-Ucs1vmxSnjw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15825508",
    "title": "Built For Me Inc. | Seattle, New York, San Francisco, Remote (US-only) | Senior Software Engineer | Full Time | $150k-$250k",
    "content": "<div>                  <span>Built For Me Inc. | Seattle, New York, San Francisco, Remote (US-only) | Senior Software Engineer | Full Time | $150k-$250k<p>Who we are: We are a small company loathe to use the word “startup”. The phrase that most aptly describes us is “boutique consulting firm” as we are currently working on select software consulting projects and have a long term vision to build a stand-alone product in about a year. The future product will focus on enabling business workflows and growing workplace productivity. We are being smart in our approach balancing software consulting with our own product. We balance both to pay ourselves well and support our vision for the future.</p><p>Who you are: You are a self-starter who can work with little supervision. You are meticulous about details and sufficiently passionate to get things done, yet know when to pivot to a more experimental move-fast mode. You should be a great teammate who looks to make your colleagues more productive because you know they are doing the same for you. You love the state-of-the-art and yet understand the danger of being there and can articulate the reasons why.</p><p>Technologies:</p><p>NodeJS / JavaScript</p><p>Babel / ES6</p><p>RDMS: MySQL / Postgres</p><p>Amazon Web Services: EC2, Lambda, CloudFront, S3</p><p>GitHub</p><p>Apache Aurora / Mesos</p><p>Terraform</p><p>Docker</p><p>We’re open to new technologies too, in the right situation.</p><p><a href='https://www.builtforme.tech' rel='nofollow'>https://www.builtforme.tech</a></p><p><a href='https://blog.builtforme.tech' rel='nofollow'>https://blog.builtforme.tech</a></p><p>Apply via AngelList: <a href='https://angel.co/builtforme/jobs/' rel='nofollow'>https://angel.co/builtforme/jobs/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Dec 1, 2017 7:34:15 PM",
    "tags": [
      "DBG_TECH1:k_t_w:ecmascript-6_frontend_8",
      "DBG_TECH1:k_t_w:ecmascript-6_nodejs_1",
      "DBG_TECH1:k_t_w:javascript_frontend_1",
      "DBG_TECH1:k_t_w:javascript_mobile_1",
      "DBG_TECH1:k_t_w:javascript_nodejs_1",
      "DBG_TECH1:k_t_w:node.js_nodejs_13",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=1, php=0, nodejs=15, embedded=0, frontend=9, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "envlcK8rTYmXu4VpPvFEpA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-sysadmin",
    "url": "https://weworkremotely.com/jobs/5861-sr-production-engineer",
    "title": "PhishMe: Sr. Production Engineer",
    "content": "<div>  <div>    <h2>Sr. Production Engineer</h2>      <h4>Posted Dec  1</h4>    <h3>      <span>PhishMe</span><br>      <span>Headquarters: Leesburg, VA</span><br>    </h3>  </div></div>  <div>    <div><span>PhishMe is seeking an experienced Production Engineer to architect, automate, provision, monitor, and maintain administrative and production Linux-based infrastructure.</span></div><div><br></div><div><span>&nbsp;</span><br></div><div><span>The successful candidate must have professional work experience. This is a full-time position working for PhishMe, Inc. We actively encourage diversity on our team and overall company.</span><br></div><div><span><br></span></div><div><b>Responsibilities:&nbsp;</b></div><div><br></div><ul><li><span>Work closely with Engineering and Product teams to identify and implement solutions that meet production, QA, development, and administrative needs in Linux-based environments</span></li><li><span>Identify changes for the product architecture from the reliability, performance, and availability perspective with a data driven approach. </span></li><li><span>Interface with on-site system administrators</span></li><li><span>Architect and maintain multi-site, high-availability solutions</span></li><li><span>Own and suggest improvements to our deployment process and tools</span></li><li><span>Identify technical debt and provide plans to remediate.</span></li><li><span>Determine when code needs to be refactored without making it obscure.</span></li><li><span>Diagnose and resolve production system issues</span></li><li><span>Participate in rotating on-call schedule</span></li><li><span>Other duties as assigned</span></li></ul><div><span>The above statements are neither intended to be an all-inclusive list of the duties and responsibilities of the job described, nor are they intended to be a listing of all of the skills and abilities required to do the job. Rather, they are intended only to describe the general nature of the job. This job description is not a contract of employment, either express or implied. Employment with PhishMe will be voluntarily entered into and your employment is considered at will. PhishMe reserves the right to alter the job description at any time without notice.</span></div><div><span><strong>Successful applicants must be:</strong></span></div><div><br></div><ul><li><span>A self-starter who is willing to take a task from gathering requirements to deployment and maintenance</span></li><li><span>Able to work effectively and be pragmatic as part of a remote team in a dynamic business environment</span></li><li><span>Know a domain really well and able to share that knowledge</span></li><li><span>Comfortable working independently and able to escalate problems when necessary</span></li><li><span>Able to take charge of a nebulous requirement and drive it through design to completion</span></li><li><span>Can identify problem or opportunity areas, develop and implement fixes and changes as necessary</span></li><li><span>Able to communicate effectively with developers, engineers and upper management</span></li><li><span>Eager to learn; able to understand and apply new things relatively quickly</span></li><li><span>Willing to mentor and guide fellow team members effectively and constructively in a wide variety of disciplines, both technical and business-like in nature</span></li><li><span>Happy to travel occasionally for team meetings and events</span></li></ul><div><span>&nbsp;</span></div><div><br></div><div><span><strong>Your experience should demonstrate that you:</strong></span></div><div><br></div><ul><li><span>Have experience with Ubuntu and Red Hat/CentOS in production environments</span></li><li><span>Have acted in a leadership capacity (led teams) to provide services/functions in a production setting</span></li><li><span>Have championed new technologies/processes, and architected their design, implementation and delivery to production</span></li><li><span>Are proficient with configuration management tools (Ansible preferred)</span></li><li><span>Have experience supporting full stack Java applications(Maven/Artifactory)</span></li><li><span>Have experience using and supporting CI environments (Jenkins/Docker)</span></li><li><span>Can manage and support cloud (AWS) production environments</span></li><li><span>Familiar with managing and maintaining Route53 configurations</span></li><li><span>Can implement and manage high-availabiity infrastructure solutions with automatic failover</span></li><li><span>Managed PostgreSQL, Hazelcast, and Elastic Search in production environments</span></li><li><span>Are able to coordinate large feature development</span></li><li><span>Polyglot (multi-lingual) programming expertise</span></li><li><span>Ready to lead or has lead small teams</span></li><li><span>Stay on top of current DevOps and infrastructure news</span></li><li><span>Have used docker in a production environment as part of the &quot;product&quot;, not just in the CI workflow.</span></li><li><span>Have experience with docker orchestration - eg. Kubernetes, Rancher etc.</span></li></ul><div><span><strong>It would really be outstanding if you:</strong></span></div><div><br></div><ul><li><span>Have used docker in a remote environment (think appliance)</span></li></ul><div><span>&nbsp;</span></div><div><br></div><div><span><strong>Compensation:</strong></span></div><div><br></div><ul><li><span>Competitive salary and stock options</span></li><li><span>401k plan with company match</span></li><li><span>Health, vision, dental, disability, and life insurance</span></li><li><span>Telecom expense reimbursement</span></li></ul><div><br></div><div><span><strong>Location:</strong></span></div><div><br></div><ul><li><span>US Telecommute</span></li></ul><div><span>&nbsp;</span></div><div><br></div><div><span>PhishMe is committed to equal employment opportunity. We will not discriminate against employees or applicants for employment on any legally recognized basis [protected class] including, but not limited to: veteran status, uniform service member status, race, color, religion, sex, national origin, age, physical or mental disability, genetic information or any other protected class under federal, state, or local law.</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>To apply for this position please follow the link below:<a href='https://careers-phishme.icims.com/jobs/1384/sr.-production-engineer/job' rel='nofollow'>https://careers-phishme.icims.com/jobs/1384/sr.-production-engineer/job</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 1, 2017 6:26:26 PM",
    "tags": [
      "DBG_TECH1:k_t_w:express_nodejs_8",
      "DBG_TECH1:k_t_w:java_java_2",
      "DBG_TECH1:k_t_w:java_mobile_1",
      "DBG_TECH1:techWeightMap:{python=0, java=2, dotnet=0, c=0, gamedev=0, mobile=1, php=0, nodejs=8, embedded=0, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "gKyIMPUDRlO_Y_sIEyLDEg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/63848/seniorlead-fullstackfrontend-engineer-at-concreteplatform-inc/",
    "title": "Senior/Lead Fullstack/Frontend engineer",
    "content": "Ever thought about leading a bunch of extremely talented engineers working on engaging and beautiful applications on mobile and desktop platforms? How about branching out to VR and AR? Do you like to work in a fast-paced environment with a fantastic product team? Do you feel like your current job is just a job and you have to fight for flexible hours, ability to work from home, and your innovation time is reduced to an occasional hackathon? Are you tired of various business stakeholders treating you like a waiter in a fast-food restaurant? If the answer is yes, then read on and hit that 'Apply Now' button, because we are different!<br /><br />At Concrete we work hard to create a perfect environment for our engineers. We don't have a Michelin star chef to serve your lunch but we do have an established working from home policy so you can spend more time with your family. We also don't have a barista on-site to serve your almond milk latte, but we are flexible - you can start your day in the office at any time providing you make it for our daily standup (because it is important! and yes, we do have a very good coffee machine).<br /><br />This time we are looking for a Senior Fullstack engineer to take ownership and guide our multi-skilled development team. You will be working alongside management and the backend lead to deliver applications for a new retail platform using the very latest JavaScript technologies and Frameworks.<br /><br />We are constantly building new applications for our clients - Marks and Spencer, GAP and many more. Working on a real-time collaboration software is challenging - you will have to learn new technologies and prototype new apps at a speed of light, but not because it is a high-pressure environment, simply because you like to see your code working in production. That said, we don't tolerate sloppy coding - for every single line of code we write, there is almost always a line of unit-testing code.<br /><br />If you're a frontend lead right now or a driven senior engineer with a burning desire for a career progression and a skillset to match - get in touch!<br /><br />Skills &amp; Requirements<br /><br />Must have<br />* Strong experience developing web apps and mobile-first websites<br />* 5+ years experience in development using modern stacks / frameworks / technologies<br />* An expert understanding of Javascript (ES6) <br />* Experience with OO and MVC design patterns<br />* Understanding of functional programming<br />* Solid experience with React/Redux/Redux-saga<br />* Solid experience with Node.js<br />* Knowledge of when and how to apply design patterns<br />* Good grasp of functional programming and SOLID principles<br />* TDD/Unit testing<br />* Clean code is your second nature<br />* Experience with testing frameworks such as jest, mocha, chai etc...<br />* Experience developing SaaS products<br />* Previous experience of managing, mentoring and coaching teams of engineers<br />* Worked previously in an international environment<br />* Links to existing work or projects on Git<br />* Experience with AWS<br /><br />Nice to have<br />* Other programming languages (Go, Rust)<br />* Experience designing APIs from scratch<br />* Kubernetes/Docker<br />* Exposure to event-sourcing architecture<br />* Experience with CQRS",
    "urlFetchPending": false,
    "published": "Nov 28, 2017 9:16:23 AM",
    "tags": [
      "DBG_TECH1:k_t_w:asp.net-mvc-3_dotnet_8",
      "DBG_TECH1:k_t_w:coffeescript_frontend_1",
      "DBG_TECH1:k_t_w:coffeescript_nodejs_1",
      "DBG_TECH1:k_t_w:ecmascript-6_frontend_8",
      "DBG_TECH1:k_t_w:ecmascript-6_nodejs_1",
      "DBG_TECH1:k_t_w:javascript_frontend_2",
      "DBG_TECH1:k_t_w:javascript_mobile_2",
      "DBG_TECH1:k_t_w:javascript_nodejs_2",
      "DBG_TECH1:k_t_w:node.js_nodejs_13",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=8, c=0, gamedev=0, mobile=2, php=0, nodejs=17, embedded=0, frontend=11, bigdata-ml=0, ruby=0}",
      "REMOTE1_50",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "qrJw9wffTOmx32hd8h2z0w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/160011/backend-full-stack-web-developer-senior-tudocelularcom?a=RF5wkxG4kCs",
    "title": "Backend / Full stack web developer, senior at Tudocelular.com () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer, Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Digital Media, Information Technology, Web Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are looking for a talented back-end or full-stack web developers.</p><p><strong>Requirements:<br></strong></p><ul><li>OOP: <em>strong knowledge of concepts and principles</em></li><li>PHP: <em>extended experience with no secrets</em></li><li>MySQL/sqlServer: <em>performance oriented skills</em></li><li>Experience on high traffic websites</li><li>Ability to write pure code without libraries.</li></ul><p><strong>Nice to Have:</strong>&nbsp;</p><ul><li>Javascript, must-to-have if full-stack</li><li>Node.js</li><li>Mongodb</li></ul><p>You will be a key part of a small team that will build our next generation websites, apps and chatbots.</p>                    </div>                            <h2>                About Tudocelular.com            </h2>            <div><p>We are a publisher and our websites are tudocelular.com, hdblog.it, todotech.com and mobilescout.com. Our mission is to help users choose the best smartphone for their needs.&nbsp;</p><p>For more informations about our stack or other openings please take a look to our <a href='https://stackoverflow.com/jobs/companies/tudocelularcom' rel='nofollow'>company profile</a>.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote work from anywhere in the world                            </div>                            <div>                                 Flexible time and space for life                            </div>                            <div>                                 Productivity bonus                            </div>                            <div>                                 Time to work on your ideas                            </div>                            <div>                                 4 weeks paid vacation annually                            </div>                            <div>                                 Training and possibility to learn from from our full stack                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k_t_w:javascript_frontend_1",
      "DBG_TECH1:k_t_w:javascript_mobile_1",
      "DBG_TECH1:k_t_w:javascript_nodejs_1",
      "DBG_TECH1:k_t_w:node.js_nodejs_13",
      "DBG_TECH1:k_t_w:php_php_3",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=1, php=3, nodejs=14, embedded=0, frontend=1, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TECH2_javascript",
      "TECH2_mysql",
      "TECH2_node.js",
      "TECH2_php",
      "TECH2_sql-server",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "javascript",
      "mysql",
      "node.js",
      "nodejs",
      "php",
      "sql-server"
    ]
  },
  {
    "id": "LdgJmjcCS1qJN1EGzH6j2w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/jobs/5763-senior-web-developer-remote",
    "title": "PayrollPanda: Senior Web Developer | Remote",
    "content": "<div>  <div>    <h2>Senior Web Developer | Remote</h2>      <h4>Posted Nov 15</h4>    <h3>      <span>PayrollPanda</span><br>      <span>Headquarters: Kuala Lumpur, Malaysia (South-East Asia)</span><br>        <a href='https://payrollpanda.workable.com/jobs/575413' rel='nofollow'>https://payrollpanda.workable.com/jobs/575413</a>    </h3>  </div>    </div>  <div>    <div><h3><b>DESCRIPTION</b></h3></div><div>Our company is growing! We're looking for an awesome full-stack senior developer to work on PayrollPanda - Malaysia's fastest growing cloud Payroll app. It's an exciting time to join a proven group of international entrepreneurs and developers.<br></div><div><h3>REQUIREMENTS</h3></div><ol><li>At least 5 years of commercial development experience or you're some kind of genius coder straight out of university.</li><li>Extensive experience with web development technologies including Javascript frameworks (preferably Backbone), NodeJS, MongoDB</li><li>Agile (Kanban) software development</li></ol><div><h3>BENEFITS</h3></div><ol><li><strong>REMOTE working</strong>&nbsp;- literally work anywhere, our only requirement is that you work at least 4-6 hours during Malaysian working times daily, 9am to 6pm and have fast Internet access.</li><li><strong>Live in Malaysia (Optional)</strong>: If you want to move to Malaysia you are encouraged to apply. We have an international team that all love living here. We will also provide you with a working visa.</li><li><strong>Work-life balance:</strong>&nbsp;Typically work only 35 hours. Many of us have burnt out before and we want to prevent it happening again to any of our team.</li><li><b>Competitive salary</b><span> and potential to earn equity.&nbsp;Work with us not for us!</span></li></ol>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply via: <a href='https://payrollpanda.workable.com/jobs/575413' rel='nofollow'>https://payrollpanda.workable.com/jobs/575413</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 15, 2017 5:34:16 AM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG_TECH1:k_t_w:backbone.js_frontend_8",
      "DBG_TECH1:k_t_w:javascript_frontend_1",
      "DBG_TECH1:k_t_w:javascript_mobile_1",
      "DBG_TECH1:k_t_w:javascript_nodejs_1",
      "DBG_TECH1:k_t_w:node.js_nodejs_13",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=1, php=0, nodejs=14, embedded=0, frontend=9, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "oqERbqguQkmYBJN1ZwWe4Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63072",
    "title": "Senior Web Developer | Remote",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div></div><div>Our company is growing! We're looking for an awesome full-stack senior developer to work on PayrollPanda - Malaysia's fastest growing cloud Payroll app. It's an exciting time to join a proven group of international entrepreneurs and developers.<br></div><div></div><ol><li>At least 5 years of commercial development experience or you're some kind of genius coder straight out of university.</li><li>Extensive experience with web development technologies including Javascript frameworks (preferably Backbone), NodeJS, MongoDB</li><li>Agile (Kanban) software development</li></ol><div></div><ol><li><strong>REMOTE working</strong>&nbsp;- literally work anywhere, our only requirement is that you work at least 4-6 hours during Malaysian working times daily, 9am to 6pm and have fast Internet access.</li><li><strong>Live in Malaysia (Optional)</strong>: If you want to move to Malaysia you are encouraged to apply. We have an international team that all love living here. We will also provide you with a working visa.</li><li><strong>Work-life balance:</strong>&nbsp;Typically work only 35 hours. Many of us have burnt out before and we want to prevent it happening again to any of our team.</li><li><b>Competitive salary</b><span> and potential to earn equity.&nbsp;Work with us not for us!</span></li></ol><p><strong>To apply:</strong> Apply via: <a href='https://payrollpanda.workable.com/jobs/575413' rel='nofollow'>https://payrollpanda.workable.com/jobs/575413</a></p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 15, 2017 5:34:16 AM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k_t_w:backbone.js_frontend_8",
      "DBG_TECH1:k_t_w:javascript_frontend_1",
      "DBG_TECH1:k_t_w:javascript_mobile_1",
      "DBG_TECH1:k_t_w:javascript_nodejs_1",
      "DBG_TECH1:k_t_w:node.js_nodejs_13",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=1, php=0, nodejs=14, embedded=0, frontend=9, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "b01c-_rCQCCAYLSpEHe1Qw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62946",
    "title": "Senior Node.js / React Developer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div></div><div><strong>ManageFlitter</strong>&nbsp;–&nbsp;<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Fworkable.com%2525252525252Fnr%2525252525253Fl%2525252525253Dhttp%252525252525253A%252525252525252F%252525252525252Fworkable.com%252525252525252Fnr%252525252525253Fl%252525252525253Dhttp%25252525252525253A%25252525252525252F%25252525252525252Fworkable.com%25252525252525252Fnr%25252525252525253Fl%25252525252525253Dhttp%2525252525252525253A%2525252525252525252F%2525252525252525252Fmanageflitter.com%2525252525252525252F' rel='nofollow'>http://ManageFlitter.com</a>&nbsp;– is a multi-award winning SaaS social media management product. ManageFlitter is used by over 3 million people around the world with paid customers from over 100 countries.</div><div><br></div><div>Our new product&nbsp;<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttp%2525253A%2525252F%2525252Fworkable.com%2525252Fnr%2525253Fl%2525253Dhttp%252525253A%252525252F%252525252Fworkable.com%252525252Fnr%252525253Fl%252525253Dhttp%25252525253A%25252525252F%25252525252Fworkable.com%25252525252Fnr%25252525253Fl%25252525253Dhttp%2525252525253A%2525252525252F%2525252525252Fworkable.com%2525252525252Fnr%2525252525253Fl%2525252525253Dhttp%252525252525253A%252525252525252F%252525252525252Fworkable.com%252525252525252Fnr%252525252525253Fl%252525252525253Dhttp%25252525252525253A%25252525252525252F%25252525252525252Fworkable.com%25252525252525252Fnr%25252525252525253Fl%25252525252525253Dhttp%2525252525252525253A%2525252525252525252F%2525252525252525252Fmanagesocial.com%2525252525252525252F' rel='nofollow'>http://ManageSocial.com</a>&nbsp;is well into development (we are very close to private alpha release). You can get a sneak peak of a very early version of ManageSocial here -&gt;&nbsp;<a href='http://workable.com/nr?l=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DW2oABEOCdpo%26feature%3Dyoutu.be' rel='nofollow'>https://www.youtube.com/watch?v=W2oABEOCdpo&amp;featur...</a>&nbsp;</div><div><br></div><div>This is a unique opportunity to work on an interesting greenfield project. Initially you will be working with 1 mid-weight engineer , 1 UI designer, and a tech lead to take this product from alpha to launch and beyond. You will also be working directly with the CEO.</div><div><br></div><div>ManageFlitter is headquartered in Sydney with team members in Canada, Brazil, Ukraine &amp; Russia. We are approximately 50% remote based.</div><div><br></div><div>We believe Social Media is changing the world and we love being part of the change.</div><div><br></div><div>We are looking for someone with outstanding technical experience and a preference for working with a small smart team to work with us on our new ManageSocial product.</div><div><br></div><div>Whilst this is a remote friendly role our headquarters are based in Sydney Australia - time crossover is required with the team in Sydney and team members in other parts of the world. Depending on your location this may require you to time shift to some degree.&nbsp;</div><div></div><div></div><div><br></div><div>Team is everything and we are proud of the great ManageFlitter and ManageSocial team that we have built. To ensure that the team remains of a very high standard we follow a fairly rigorous hiring process:</div><div></div><div></div><div><br></div><ul><li>Initial 10-20 minute Skype chat.</li><li>Technical task: a custom designed technical task that allows us to gain insight into your approach to solving technical problems: 2-4 hours for someone familiar with our stack.</li><li>Technical interview: in depth technical chat based on your technical task: 1-2 hours.</li><li>Skype chat with 1-2 additional team members - 1 hour.</li></ul><div></div><div></div><div></div><div></div><div><br></div><div></div><div></div><div></div><div><br></div><ul><li>Impeccable English communication skills.</li><li>5+ years experience building APIs preferably with Node.js, Express.js / Koa.js or similar.</li><li>Strong literacy with ES6 features and stay up to date with standards using babel.</li><li>Experience working with TDD including writing unit, integration &amp; functional tests.</li><li>Experience working with BDD.</li><li>Experience delivering responsive UX/UI.</li><li>Understands Websockets and using Redis pub/sub model for real time communication with clients.</li><li>Previously worked on development of products using a SQL storage backend.</li><li>Experience building SPAs using React.</li><li>Experience working with AWS cloud services including Lambda.</li><li>Experience working with Postgres at scale.</li><li>Has built an application implementing the following:<br>Redux<br>Redux Sagas<br>Reselect<br>React Router<br>ImmutableJS<br>PostCSS</li><li>Experience working in an agile environment with a working knowledge of scrum and kanban workflows.</li><li>Relevant tertiary education.<br><br><br><br></li></ul><div><strong>BONUS SKILLS &amp; EXPERIENCE:</strong></div><div><br></div><ul><li>Product flair.</li><li>Strong working knowledge of the Twitter and Instagram API.</li><li>Experience writing technical specifications and documentation.</li><li>Has contributed to open source projects (provide examples if available).</li><li>Experience leading technical teams.</li></ul><div></div><div>Our company culture is easygoing but hardworking. We believe in work-life balance but we also all enjoy being part of a fast moving focused and productive team.</div><div><br></div><div>We are committed to creating a culture where every team member can do their best work.</div><div><br></div><div>If the above sounds like a role you may be interested in please apply! We would love to hear from you.</div><div><br></div><p><strong>To apply:</strong> Please apply at the following url:<a href='https://manageflitter.workable.com/jobs/544542' rel='nofollow'>https://manageflitter.workable.com/jobs/544542</a></p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 9, 2017 9:21:49 AM",
    "tags": [
      "DBG:surround``OR(home,remot,telecommut) 3W OR(role,work) 4W OR(offic,headquart,onsit)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR( australia, japan, newzealand)",
      "DBG:surround``remot 3N OR(role, employment)",
      "DBG_TECH1:k_t_w:ecmascript-6_frontend_8",
      "DBG_TECH1:k_t_w:ecmascript-6_nodejs_1",
      "DBG_TECH1:k_t_w:express_nodejs_8",
      "DBG_TECH1:k_t_w:node.js_nodejs_26",
      "DBG_TECH1:k_t_w:reactjs_frontend_16",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=35, embedded=0, frontend=24, bigdata-ml=0, ruby=0}",
      "REMOTE1_50",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_Asia"
    ],
    "tagsNames1": [
      "50% remote",
      "Asia time zones"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "GqtyplyEQRKA8I_GHq4F4g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/129292/contract-to-hire-backend-engineer-at-growing-liveschool-inc?a=HmlRDS4JVQI",
    "title": "Contract to Hire Backend Engineer at Growing Edtech Company in Nashville, TN at LiveSchool Inc. (Nashville, TN) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer, DevOps</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Education Technology</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Role Overview</strong></p><p>This is a negotiable contract to hire position starting as a part-time remote friendly position.</p><p>As a Backend Engineer at LiveSchool, you will contribute to the services and APIs that<br>power real-time school culture reporting and dashboards for K12 schools across the US.<br>Your code will turn tens of millions of “behavior points” per month into actionable<br>insights about students, teachers, schools, and more. You will leverage socket<br>connectivity to make this data as real-time and engaging as possible for users. Last but<br>not least, you will join a committed team working to make school more engaging, fun,<br>and fair for students everywhere.</p><p><strong>Skills &amp; Requirements</strong></p><p><br>We are looking for an engineer with strong experience using Amazon Web Services,<br>building RESTish APIs and websockets using Node.js and Python.&nbsp; Working on large-scale database systems that handle high user concurrency must be a passion. You must be a critical thinker, effective communicator, and take pride in your work.</p><p>Prior work with large reporting systems, pdf generation, and message queue based systems is preferred.<br>CS/MIS degree or equivalent preferred.</p>                    </div>                            <h2>                About LiveSchool Inc.            </h2>            <div><p>Why LiveSchool?<br>We’re a fun, committed team working to make a positive impact in schools. We have an<br>informal office environment complete with dog, snacks, and a keg. Your role will come<br>with a competitive compensation package, including salary, health insurance, and stock<br>options.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``benefit 2N 2N(remot,work)",
      "DBG_TECH1:k_t_w:node.js_nodejs_13",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=13, embedded=0, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TECH2_amazon-web-services",
      "TECH2_aws-lambda",
      "TECH2_devops",
      "TECH2_mysql",
      "TECH2_node.js",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "aws-lambda",
      "devops",
      "mysql",
      "node.js",
      "nodejs"
    ]
  },
  {
    "id": "gGTxh62YSEqPK46iAzJn3w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/149767/backend-developer-nodejs-plus-nosql-peerio-technologies-inc?a=Oe5nKntFNaE",
    "title": "Backend Developer (nodejs + nosql) at Peerio Technologies Inc (Montreal, QC, Canada) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Security Software</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are hiring an experienced developer to work on backend services. Most of our backend services are written in nodejs, so you should have some&nbsp;JavaScript chops, although deep knowledge of other programming languages is also desirable.</p><p>You should have several years of experience with distributed systems, in particular NoSQL database and/or queueing systems. You will be working on a team with other backend developers and devops, and your mission will be to make our systems more resilient and performant.</p><p>While we do not require you to have deep knowledge of cryptography, we expect senior team members to have awareness of and interest in security best practices.</p><p><strong>Requirements</strong></p><ul><li>2+ years of experience in JavaScript development;</li><li>5+ years of experience in backend/platform development;</li><li>An excellent understanding of distributed systems and their tradeoffs;</li><li>Excellent documentation skills;</li><li>Ability to clearly articulate technical problems, design and implementation choices to a broad range of stakeholders (e.g. sales team, users, security experts);</li><li>Approachable, friendly team player — no rock stars!</li></ul><p><strong>Assets</strong></p><ul><li>Experience with Cassandra, Riak, or other AP databases;</li><li>Experience with configuration management systems and with DevOps tasks/environments;</li><li>Experience working with NoSQL, RDBS, and queuing systems (e.g. RabbitMQ);</li><li>Experience in application security testing;</li><li>Working knowledge of applied cryptography;</li><li>Familiarity with client-side JavaScript frameworks and best practices;</li><li>Contributions to open source communities (whether code or other kinds of content, e.g. localization, documentation).</li></ul>                    </div>                            <h2>                About Peerio Technologies Inc            </h2>            <div><p>Our mission is to provide easy-to-use privacy to everyone. We are currently working on end-to-end encrypted tools for team communication, collaboration, and email.</p><p>Our ideal teammates are invested in making security accessible and are excited by the challenges presented by the security space. Our friendly and dedicated team is headquartered in Montreal, with some remote team members in Europe and the Americas. Across all areas and skill sets, we are looking for excellent communicators who enjoy learning new things, are eager to be part of a vibrant community, and love to share their knowledge and skills with others.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 stock options                            </div>                            <div>                                 flexible schedule                            </div>                            <div>                                 flexible location                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k_t_w:javascript_frontend_3",
      "DBG_TECH1:k_t_w:javascript_mobile_3",
      "DBG_TECH1:k_t_w:javascript_nodejs_3",
      "DBG_TECH1:k_t_w:node.js_nodejs_26",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=3, php=0, nodejs=29, embedded=0, frontend=3, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TECH2_cassandra",
      "TECH2_nodejs",
      "TECH2_rabbitmq",
      "TECH2_redis",
      "TECH2_riak",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "cassandra",
      "nodejs",
      "rabbitmq",
      "redis",
      "riak"
    ]
  },
  {
    "id": "SIaBBsAAQaamo_XEZ9eBBg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/127727/nodejs-developer-remote-chaser?a=GPOkBxERNSM",
    "title": "Node.js Developer (Remote) at Chaser (London, UK) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Accounting, Data &amp; Analytics, Financial Technology</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Note:</strong>&nbsp;<em>Although this is a remote position, we are only considering candidates in timezones between UTC-2 and UTC+2.</em></p><p>This role presents an incredible opportunity for someone to really place their stamp on our product and company as we scale.</p><p>Our current stack is ES6, Meteor, Node.js 4.x and MongoDB, with Python 3 for our data infrastructure.<br><br><strong>Responsibilities</strong></p><ul><li>You will play a key role in shaping product direction and roadmap choices.</li><li>You will be working directly with our Lead Software Engineer and help make important software architecture decisions.</li><li>You will help with the rapid iterative development of our product to meet the needs of our identified addressable market.</li><li>Work as a key part of our development team to implement robust and scalable technology solutions that integrate with our full product stack.</li><li>Work with our team to design solutions to the data visualization and reporting challenges that our customers need us to solve.</li><li>Maintain and improve the existing repository code.</li></ul>                    </div>                            <h2>                About Chaser            </h2>            <div><p>Chaser was started to transform the way in which businesses sell on credit to their customers.</p><p>We are developing and delivering the market leading SaaS solution; powered by big data informed intelligence, automation and artificial intelligence. We are transforming a process that has seen minimal technological innovation to date. In doing so we are helping businesses make better decisions about who to grant credit to, take the best chasing actions to boost their cashflow, and saving them time.</p><p>We are incredibly proud to be recognised as 2016 Xero Add-on Partner of the Year from among their 500+ add-on ecosystem. And are very fortunate to be backed by top venture capital and angel investors.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Generous remuneration                            </div>                            <div>                                 Free fruit and tea/coffee                            </div>                            <div>                                 Share options                            </div>                            <div>                                 Lunch and Learn on Tuesday                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k_t_w:boost_c_8",
      "DBG_TECH1:k_t_w:ecmascript-6_frontend_8",
      "DBG_TECH1:k_t_w:ecmascript-6_nodejs_1",
      "DBG_TECH1:k_t_w:meteor_nodejs_8",
      "DBG_TECH1:k_t_w:node.js_nodejs_26",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=2, java=0, dotnet=0, c=8, gamedev=0, mobile=0, php=0, nodejs=35, embedded=0, frontend=8, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TECH2_mongodb",
      "TECH2_node.js",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "mongodb",
      "node.js",
      "nodejs"
    ]
  },
  {
    "id": "SlKdsgBoT7yjgdKc8j8n5w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3959-full-stack-developer-remote-flightpath-finance",
    "title": "Full Stack Developer - Remote @ Flightpath Finance",
    "content": "<h2>              Full Stack Developer - Remote<small> @ Flightpath Finance</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-11-03 02:20</p></dd>          <dt><span>Description</span></dt>          <dd><p>Interested in changing the finance industry for the better?</p><p>We are building software to replace the need for a spreadsheet-based financial model. Our current clients include founders and CEOs of fast-growing SaaS companies and they use our product to make some of the most important financial decisions about their business.</p><p>We're looking for a strong, creative software engineer to work closely with the CTO and the founder. You're employee #3 and the second engineer, so your work is going to matter A LOT.</p><p><strong>Here's what you would be doing (among plenty of other things):</strong></p><ul><li>Develop new features used by our clients to run their businesses </li><li>Collaborate closely with the team to plan and prioritize our roadmap </li><li>Design and develop tests to ensure accuracy of the presented data </li><li>Participate in hiring and onboarding of new engineers</li></ul><p><strong>Here's what we are looking for:</strong></p><ul><li>3-5 years of professional experience as a software engineer (must have) </li><li>Experience as a full-stack developer (nice to have) </li><li>Experience with React and/or NodeJS (at least one is a must have) </li><li>Experience with Redux / Apollo / GraphQL (nice to have) </li><li>Most importantly, you are a person with high integrity, passionate about learning new things and care deeply about delighting the customer. (needless to say, this is a must have)</li></ul><p><strong>You'll get:</strong></p><ul><li>Competitive salary &amp; equity package </li><li>Competitive vacation, and we actually want you to use those weeks to recharge </li><li>Freedom to work remotely from anywhere in the world </li><li>Annual team retreats </li><li>Front seat to building a business: We work with founders of fast-growing SaaS companies, and the metrics and forecasts we are building will directly help them grow their business.</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Nov 3, 2017 4:20:02 AM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG:surround``2N(anywher, remot)",
      "DBG_TECH1:k_t_w:node.js_nodejs_13",
      "DBG_TECH1:k_t_w:reactjs_frontend_8",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=13, embedded=0, frontend=8, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "ScZ9jqdzTBeF90JnoHtkSg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62440",
    "title": "Full Stack Developer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Interested in changing the finance industry for the better?<br><br>We are building software to replace the need for a spreadsheet-based financial model. Our current clients include founders and CEOs of fast-growing SaaS companies and they use our product to make some of the most important financial decisions about their business.<br><br>We're looking for a strong, creative software engineer to work closely with the CTO and the founder. You're employee #3 and the second engineer, so your work is going to matter A LOT.<br><br><strong>Here's what you would be doing (among plenty of other things):</strong><br><br></p><ul><li>Develop new features used by our clients to run their businesses <br></li><li>Collaborate closely with the team to plan and prioritize our roadmap <br></li><li>Design and develop tests to ensure accuracy of the presented data <br></li><li>Participate in hiring and onboarding of new engineers<br><br><strong>Here's what we are looking for:</strong><br><br></li><li>3-5 years of professional experience as a software engineer (must have) <br></li><li>Experience as a full-stack developer (nice to have) <br></li><li>Experience with React and/or NodeJS (at least one is a must have) <br></li><li>Experience with Redux / Apollo / GraphQL (nice to have) <br></li><li>Most importantly, you are a person with high integrity, passionate about learning new things and care deeply about delighting the customer. (needless to say, this is a must have)<br><br><strong>You'll get:</strong><br><br></li><li>Competitive salary &amp; equity package <br></li><li>Competitive vacation, and we actually want you to use those weeks to recharge <br></li><li>Freedom to work remotely from anywhere in the world <br></li><li>Annual team retreats <br></li><li>Front seat to building a business: We work with founders of fast-growing SaaS companies, and the metrics and forecasts we are building will directly help them grow their business.<br><br></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 3, 2017 4:20:02 AM",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG_TECH1:k_t_w:node.js_nodejs_13",
      "DBG_TECH1:k_t_w:reactjs_frontend_8",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=13, embedded=0, frontend=8, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "nOFHLl1KQoqjSb0wUP_hFg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/63101/software-engineer-javascript-at-spiritus-partners/",
    "title": "Software Engineer (JavaScript)",
    "content": "About Spiritus Partners:<br /><br />We're building a platform to improve patient safety using cutting edge technologies including Blockchain, and looking for versatile technologists to join our team.<br /><br />Our innovative product consists of trust and analytics services supporting an instrumented, interoperable and intelligent digital healthcare ecosystem.<br /><br />Inspired by shared value principles, Spiritus supports innovation at the intersection of business, society and the academy.<br /><br />Our offices in Edinburgh's New Town are conveniently located for public transport, and we offer the option of working from home when appropriate.<br /> <br /><br />Responsibilities:<br /><br />You will craft high-quality, efficient, reusable, modular software in collaboration with the lead architect and other developers on our groundbreaking cloud-based system for tracking medical devices throughout their lifecycle, and support the ongoing integration and automation of numerous systems.<br /><br />This is an opportunity to have a big influence on company culture and direction in an energizing environment, and work with new technologies on a greenfield project.  The main working language will initially be JavaScript (Node.js), and you will also have some exposure to Blockchain technologies (Ethereum, Hyperledger).<br /><br />You'll also collaborate with other team members to scale the platform and improve and expand the CI/CD pipeline used to test and deploy services.<br /><br />You will feel comfortable working on your own initiative, and have excellent communication skills. You'll be working in a dynamic environment, co-ordinating tasks with a small team of highly skilled colleagues.<br /> <br /><br />Required:<br /><br />·       3+ years of experience with one or more of the following: JavaScript, Python, JSON, Docker, RESTful APIs, HTML5<br /><br />·       Demonstrated ability to craft robust, elegant applications<br /><br />·       Experience with agile software development<br /><br />·       Relational and NoSQL databases<br /><br />·       Good understanding of REST APIs, Service Orientated Architecture and Microservices<br /><br />·       Exposure to working in a DevOps model, continuous integration/continuous delivery in a cloud deployment environment<br /><br />·       Knowledge of data security and encryption<br /><br />·       Strong analytical skills<br /><br />·       Self-motivated learner, able to work without continual direction<br /><br />·       Meticulous attention to detail<br /><br />·       Strong verbal and written communication<br /><br />·       Thorough documentation and proper test coverage<br /> <br /><br />Desirable:<br /><br />·       Bachelor's degree in computer science or equivalent experience<br /><br />·       Industry experience in Healthcare<br /><br />·       Development with Ethereum, Multichain, Hyperledger (or equivalent)<br /><br />·       Jenkins, Travis<br /><br />Equal employment opportunity statement:<br /><br />We are committed to equal opportunity regardless of race, colour, ancestry, religion, gender, gender identity, parental or pregnancy status, national origin, sexual orientation, age, citizenship, marital status and disability. We're happy to discuss flexible working arrangements with you.",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 5:58:14 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG_TECH1:k_t_w:html5_frontend_5",
      "DBG_TECH1:k_t_w:javascript_frontend_3",
      "DBG_TECH1:k_t_w:javascript_mobile_3",
      "DBG_TECH1:k_t_w:javascript_nodejs_3",
      "DBG_TECH1:k_t_w:node.js_nodejs_13",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=2, java=0, dotnet=0, c=0, gamedev=0, mobile=3, php=0, nodejs=16, embedded=0, frontend=8, bigdata-ml=0, ruby=0}",
      "REMOTE1_50",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "4wYsIoPnTXKb0LjZ7R8vWg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15603462",
    "title": "Built For Me Inc. | Seattle, New York, San Francisco, Remote (US-only) | Senior Software Engineer | Full Time | $150k-$250k",
    "content": "<div>                  <span>Built For Me Inc. | Seattle, New York, San Francisco, Remote (US-only) | Senior Software Engineer | Full Time | $150k-$250k<p>Who we are: We are a small company loathe to use the word “startup”. The phrase that most aptly describes us is “boutique consulting firm” as we are currently working on select software consulting projects and have a long term vision to build a stand-alone product in about a year. The future product will focus on enabling business workflows and growing workplace productivity. We are being smart in our approach balancing software consulting with our own product. We balance both to pay ourselves well and support our vision for the future.Who you are: You are a self-starter who can work with little supervision. You are meticulous about details and sufficiently passionate to get things done, yet know when to pivot to a more experimental move-fast mode. You should be a great teammate who looks to make your colleagues more productive because you know they are doing the same for you. You love the state-of-the-art and yet understand the danger of being there and can articulate the reasons why.</p><p>Technologies:</p><p>NodeJS / JavaScript</p><p>Babel / ES6</p><p>RDMS: MySQL / Postgres</p><p>Amazon Web Services: EC2, Lambda, CloudFront, S3</p><p>GitHub</p><p>Apache Aurora / Mesos</p><p>Terraform</p><p>Docker</p><p>We’re open to new technologies too, in the right situation.</p><p><a href='https://www.builtforme.tech' rel='nofollow'>https://www.builtforme.tech</a></p><p><a href='https://blog.builtforme.tech' rel='nofollow'>https://blog.builtforme.tech</a></p><p>Apply via AngelList: <a href='https://angel.co/builtforme/jobs/' rel='nofollow'>https://angel.co/builtforme/jobs/</a><span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Nov 1, 2017 7:24:04 PM",
    "tags": [
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k_t_w:ecmascript-6_frontend_8",
      "DBG_TECH1:k_t_w:ecmascript-6_nodejs_1",
      "DBG_TECH1:k_t_w:javascript_frontend_1",
      "DBG_TECH1:k_t_w:javascript_mobile_1",
      "DBG_TECH1:k_t_w:javascript_nodejs_1",
      "DBG_TECH1:k_t_w:node.js_nodejs_13",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=1, php=0, nodejs=15, embedded=0, frontend=9, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "Nkc9yIh7Rr6qI96ZkNogJg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-sysadmin",
    "url": "https://weworkremotely.com/jobs/5620-security-production-engineer",
    "title": "PhishMe: Security Production Engineer",
    "content": "<div>  <div>    <h2>Security Production Engineer</h2>      <h4>Posted Oct 26</h4>    <h3>      <span>PhishMe</span><br>      <span>Headquarters: Leesburg</span><br>        phishme.com/company/careers    </h3>  </div>    </div>  <div>    <div><span>PhishMe is seeking a mid to senior level Security Production Engineer. &nbsp;As a Security Production Engineer, you will play a critical role in effectively building, maintaining and improving the security of our systems, platform, and infrastructure deployed in AWS and in On Premise security appliances.&nbsp; You will be responsible for the development and deployment of tools and processes that for securely managing environments used by PhishMe Simulator, Triage, and other SaaS and Managed Service offerings.&nbsp; You will also work with other security-focused engineers, production engineers, and software engineers to manage traditional systems and network security tools such as web application firewalls, DDoS service, HIDS while working to integrate security into dynamic cloud environments that leverage AWS services and Docker.</span></div><div><br></div><div><span>You will have the opportunity to influence and design current strategies and procedures for securing our environments.&nbsp; You will directly influence the application configuration, deployment process of our application and create tools to improve our processes, monitoring and application infrastructure to implement a SecDevOps approach that is integrated into the deployment pipelines, continuous, and low-friction where security cannot be a blocker.&nbsp;</span></div><div><br></div><div><span>&nbsp;</span><br></div><div><span>This role will report to a Director of Production Engineering or the Vice President Production Engineering.&nbsp;&nbsp;</span></div><div><br></div><div><span>&nbsp;</span><span>This is a full-time position working for PhishMe, Inc.&nbsp;</span><strong><strong>Outsourced or software development contractors will not be considered.</strong></strong></div><div><br></div><div><b>&nbsp;Responsibilities:</b></div><div><br></div><ul><li>Work across multiple production engineering and development teams to establish, enforce, and socialize security practices and procedures in the building of environments and deployment of code</li><li>Implement, configure, and manage of security tooling for hosts and applications and cloud services</li><li>Perform vulnerability identification and remediation including patch management for systems and networks</li><li>Objectively assess risks based on business critical of system and data assets</li><li>Manage and monitor AWS account security including best practices, security groups, user access</li><li>Manage and configure of security tooling such as web application firewall, HIDS, VPNs.&nbsp;</li><li>Manage of user access, roles, and permissions to critical services</li><li>Harden systems and cloud infrastructure according to industry best practices such as CIS</li><li>Implement security controls to address compliance requirements such as SOC2, ISO, HIPPA, and GDPR.</li><li>Cross-team work with the various product offerings within PhishMe</li><li>Provide support to Sales Engineering in developing responses to RFP/RFQs</li></ul><div><br></div><div>The above statements are neither intended to be an all-inclusive list of the duties and responsibilities of the job described, nor are they intended to be a listing of all of the skills and abilities required to do the job. Rather, they are intended only to describe the general nature of the job. This job description is not a contract of employment, either express or implied. Employment with PhishMe will be voluntarily entered into and your employment is considered at will. PhishMe reserves the right to alter the job description at any time without notice.</div><div><br></div><div><b>Required Skills and Experience:</b></div><div><br></div><ul><li>Solid knowledge of Enterprise security fundamentals and how they must to be adapted DevOps/Cloud Environments</li><li>Ability to analyze security event and vulnerability findings from disparate sources (network, application, operating system, etc.) using a variety of manual and automated tools and processes</li><li>Comfortable with a fast-moving development pace where security cannot be a blocker</li><li>Knowledge of AWS Cloud Infrastructure (EC2, VPC, ELB, RDS) and security technology (security groups, CloudTrail, VPC Flow Logs, CloudWatch)</li><li>Familiarity with automated configuration management such as Puppet, Chef, or Ansible</li><li>Strong Linux (CentOS/Ubuntu) background with experience working in large AWS deployments</li><li>A strong interest in the field of information security principles</li></ul><div><b><br></b></div><div><b>Desired Skills and Experience:</b></div><div><br></div><ul><li>Past experience working as part of distributed, remote-first team.</li><li>Docker CLI familiarity and knowledge of repositories and container management</li><li>Experience managing and building virtual appliances.</li><li>Python or Ruby development background.</li><li>Experience automating tasks in AWS using CloudFormation or Terraform</li><li>Experience automating AWS tasks with Lambda Functions</li><li>Experience Non-AWS Cloud providers such Azure or GCE</li><li>Familiarity with Jenkins, Git, Artifactory</li><li>Experience with Signal Sciences, JumpCloud, Jenkins, OSSEC HIDS and Zscaler</li></ul><div><b><br></b></div><div><b>Compensation:</b></div><div><br></div><ul><li>Competitive salary and incentive stock options</li><li>401k plan with company match</li><li>Health, vision, dental, disability, and life insurance</li><li>Telecom expense reimbursement</li></ul><div><strong><br></strong></div><div><b>Location</b></div><div><br></div><ul><li>Full-time Telecommute&nbsp;<strong>(The United States only)</strong></li></ul><div>&nbsp;</div><div><br></div><div>PhishMe is committed to equal employment opportunity. We will not discriminate against employees or applicants for employment on any legally recognized basis [protected class] including, but not limited to: veteran status, uniform service member status, race, color, religion, sex, national origin, age, physical or mental disability, genetic information or any other protected class under federal, state, or local law.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>To apply for this position, please follow the link below: <a href='https://careers-phishme.icims.com/jobs/1415/security-production-engineer/job' rel='nofollow'>https://careers-phishme.icims.com/jobs/1415/security-production-engineer/job</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 26, 2017 10:35:24 PM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``fulltim 4N telecommut",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k_t_w:express_nodejs_8",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:k_t_w:ruby_ruby_2",
      "DBG_TECH1:techWeightMap:{python=2, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=8, embedded=0, frontend=0, bigdata-ml=0, ruby=2}",
      "REMOTE1_50",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "maZFhR7WTxCN0_v2PwJZIQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3950-nodejs-developer-linux-academy",
    "title": "NodeJS Developer @ Linux Academy",
    "content": "<h2>              NodeJS Developer<small> @ Linux Academy</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-26 11:51</p></dd>          <dt><span>Description</span></dt>          <dd><h5>DESCRIPTION</h5><p>NodeJS Developers at Linux Academy are tasked with building the next generation of our software using JavaScript in an event-driven context. Employees are expected to build solutions for existing and new products using serverless infrastructure and modern programming techniques. This allows us to solve inefficiencies in our products and stay ahead of the curve as leaders in both technology education and education technology.</p><p><strong>Develop Node.js software</strong></p><ul><li>Write Lambda handlers to make event-driven Linux Academy tasks more efficient</li><li>Contribute to JavaScript-based open source projects that Linux Academy uses</li></ul><p><strong>Work on Serverless Academy offerings</strong></p><ul><li>Plan and write code and systems that will become part of the Serverless LMS.</li><li>Maintain Serverless Blog with feature additions and bugfixes.</li></ul><p><strong>Maintain open source projects</strong></p><ul><li>Vet and accept pull requests to Serverless Academy open source projects.</li><li>Respond to GitHub issue reports promptly and appropriately.</li><li>Help develop a community around Serverless Academy open source projects through discussion and interaction with users.</li><li>Help enforce contribution and code of conduct policies on Serverless Academy projects.</li></ul><p><strong>Evangelize Node and serverless technology to other employees</strong></p><ul><li>Find independent, modular elements of the existing Linux Academy stack that can be replaced by serverless architecture for increased efficiency and reduced cost.</li><li>Explain the benefits of using Node.js and/or serverless architecture to other Linux Academy employees.</li><li>Recognize when non-serverless solutions may be better for some applications, and fit those into our stack in a way that still follows the best practices of serverless architecture when viewed from a high level.</li></ul><h5>REQUIREMENTS</h5><ul><li>Familiarity with JavaScript development, particularly in the Node runtime.</li><li>Familiarity with and experience in event-driven programming.</li><li>Experience architecting solutions using at least one cloud computing provider with serverless offerings, such as Amazon Web Services or Microsoft Azure.</li><li>Knowledge of and passion for open source project organization, maintenance, and participation.</li><li>Able to write organized, thoroughly tested and documented code.</li><li>Can work with communicate with, and disagree with team members in a respectful manner.</li><li>You must be authorized to work in the United States without sponsorship</li><li>If remote, must be able to travel to Keller, TX office occasionally and work during normal business hours</li></ul><h5>BENEFITS</h5><ul><li>Best in Industry compensation with bonus potential for high performers</li><li>Health, dental, vision, life insurance provided free to employee; discounted to spouse/family</li><li>Simple IRA with non-elective contribution made by Linux Academy</li><li>3 weeks’ vacation, 1 week sick leave</li><li>Great family leave policy</li><li>Free snacks/drinks to on-site personnel</li><li>Casual work environment</li><li>Great creative, innovative and fun group of people to work with</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>If remote, must be able to travel to Keller, TX office occasionally and work during normal business hours</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 26, 2017 2:51:46 PM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG:surround``abl 4W OR(travel,visit)",
      "DBG_TECH1:k_t_w:javascript_frontend_2",
      "DBG_TECH1:k_t_w:javascript_mobile_2",
      "DBG_TECH1:k_t_w:javascript_nodejs_2",
      "DBG_TECH1:k_t_w:node.js_nodejs_65",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=2, php=0, nodejs=67, embedded=0, frontend=2, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "QQPyQUvvQGq1sYp-xuCCeQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62338",
    "title": "NodeJS Developer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><h4>DESCRIPTION<br></h4><p><br>NodeJS Developers at Linux Academy are tasked with building the next generation of our software using JavaScript in an event-driven context. Employees are expected to build solutions for existing and new products using serverless infrastructure and modern programming techniques. This allows us to solve inefficiencies in our products and stay ahead of the curve as leaders in both technology education and education technology.<br><br><strong>Develop Node.js software</strong><br><br></p><ul><li>Write Lambda handlers to make event-driven Linux Academy tasks more efficient<br></li><li>Contribute to JavaScript-based open source projects that Linux Academy uses<br><br><strong>Work on Serverless Academy offerings</strong><br><br></li><li>Plan and write code and systems that will become part of the Serverless LMS.<br></li><li>Maintain Serverless Blog with feature additions and bugfixes.<br><br><strong>Maintain open source projects</strong><br><br></li><li>Vet and accept pull requests to Serverless Academy open source projects.<br></li><li>Respond to GitHub issue reports promptly and appropriately.<br></li><li>Help develop a community around Serverless Academy open source projects through discussion and interaction with users.<br></li><li>Help enforce contribution and code of conduct policies on Serverless Academy projects.<br><br><strong>Evangelize Node and serverless technology to other employees</strong><br><br></li><li>Find independent, modular elements of the existing Linux Academy stack that can be replaced by serverless architecture for increased efficiency and reduced cost.<br></li><li>Explain the benefits of using Node.js and/or serverless architecture to other Linux Academy employees.<br></li><li>Recognize when non-serverless solutions may be better for some applications, and fit those into our stack in a way that still follows the best practices of serverless architecture when viewed from a high level.<br><br>----<br><br><h4>REQUIREMENTS<br></h4><p><br></p></li><li>Familiarity with JavaScript development, particularly in the Node runtime.<br></li><li>Familiarity with and experience in event-driven programming.<br></li><li>Experience architecting solutions using at least one cloud computing provider with serverless offerings, such as Amazon Web Services or Microsoft Azure.<br></li><li>Knowledge of and passion for open source project organization, maintenance, and participation.<br></li><li>Able to write organized, thoroughly tested and documented code.<br></li><li>Can work with communicate with, and disagree with team members in a respectful manner.<br></li><li>You must be authorized to work in the United States without sponsorship<br></li><li>If remote, must be able to travel to Keller, TX office occasionally and work during normal business hours<br><br>----<br><br><h4>BENEFITS<br></h4><p><br></p></li><li>Best in Industry compensation with bonus potential for high performers<br></li><li>Health, dental, vision, life insurance provided free to employee; discounted to spouse/family<br></li><li>Simple IRA with non-elective contribution made by Linux Academy<br></li><li>3 weeks’ vacation, 1 week sick leave<br></li><li>Great family leave policy<br></li><li>Free snacks/drinks to on-site personnel<br></li><li>Casual work environment<br></li><li>Great creative, innovative and fun group of people to work with</li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 26, 2017 2:51:46 PM",
    "tags": [
      "DBG:surround``abl 4W OR(travel,visit)",
      "DBG_TECH1:k_t_w:javascript_frontend_2",
      "DBG_TECH1:k_t_w:javascript_mobile_2",
      "DBG_TECH1:k_t_w:javascript_nodejs_2",
      "DBG_TECH1:k_t_w:node.js_nodejs_52",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=2, php=0, nodejs=54, embedded=0, frontend=2, bigdata-ml=0, ruby=0}",
      "REMOTE1_50",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "cGvJsgVxSGG07-q_WyZ0oA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3949-senior-software-engineer-node-js-brave-software",
    "title": "Senior Software Engineer (Node.js) @ Brave Software",
    "content": "<h2>              Senior Software Engineer (Node.js)<small> @ Brave Software</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-26 02:58</p></dd>          <dt><span>Description</span></dt>          <dd><p>Brave is looking for an experienced Senior Software Engineer to work on back-end systems that support our desktop and mobile browsers. This is a high ­profile and impactful, hands-­on position in an early stage startup.</p><p><strong>Requirements</strong></p><ul><li>5+ years experience with back-end server side development </li><li>Strong JavaScript development skills</li><li>Postgres, Mongo, Go, data warehousing and jQuery experience preferred</li><li>Experience with software development via distributed development teams</li><li>Comfortable working in an open source setting</li><li>A passion for helping protect users' privacy and security</li><li>Written and verbal communication skills in English</li><li>Proven record of getting things done</li></ul><p><strong>Benefits</strong></p><ul><li>Competitive salary</li><li>4 weeks (20 days) of paid vacation per year</li><li>Excellent medical coverage</li><li>Generous 401k plan</li><li>Stock option grant</li><li>Travel and conference budgets</li><li>Commuters benefit (On­site only)</li><li>Hip office in the SoMA neighborhood of SF</li></ul><p>Candidates must be legally authorized to work in the United States or Canada.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Candidates must be legally authorized to work in the United States or Canada.</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 26, 2017 5:57:57 AM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG_TECH1:k_t_w:javascript_frontend_1",
      "DBG_TECH1:k_t_w:javascript_mobile_1",
      "DBG_TECH1:k_t_w:javascript_nodejs_1",
      "DBG_TECH1:k_t_w:jquery_frontend_8",
      "DBG_TECH1:k_t_w:node.js_nodejs_26",
      "DBG_TECH1:techWeightMap:{python=0, java=0, dotnet=0, c=0, gamedev=0, mobile=1, php=0, nodejs=27, embedded=0, frontend=9, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_nodejs",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  }
]
}
