{
 "items": [
  {
    "id": "JvQIqviERseD_YCxejvdFw",
    "url": "http://workinstartups.com/job-board/job/70841/software-developer-at-m-driftrock/",
    "title": "Software Developer",
    "tags": [
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG_TECH1:k/t/w:elixir/other/10",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=4, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=9}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 11, 2018 2:29:51 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Location: Old Street, London N1<br />Start Date: ASAP<br />Salary: £40K-£55K depending on experience and skill level<br /><br />WHO ARE DRIFTROCK?<br /><br />Driftrock aims to make advertising through social channels better. There’s no excuse for being chased around the internet by images of products you’ve already bought. It’s irritating for the end user and counterproductive for the company attempting to sell their products or services. Using our tooling marketers can refine their targeting such that the ads are only shown to people who have shown genuine interest.<br /><br />WORKING AT DRIFTROCK<br /><br />Driftrock’s tooling provides our users with a way to receive, transform, track and optimise leads from social channels. Currently these tools look and feel very separate so we’re in the process of bringing them together, with the view to having Driftrock be more of a platform than a set of tools. Other problems we’re solving, and are looking to solve in the near future, include:<br />. How to securely and safely handle personally identifying information;<br />. How to enrich incoming data with information that will help our users decide on the best next steps for their leads;<br />. What reports to provide to our users such that they can see if their efforts are resulting in quality leads and what they can do to improve.<br /><br />The technology is a mixture of Ruby, Elixir and React applications hosted on Kubernetes and Google Cloud. We make use of Redis and Postgres for data storage and RabbitMQ for event processing.<br /><br />You will be expected to:<br />. Build RESTful APIs, event-based systems and front-end applications;<br />. Work with well-known public APIs like Facebook and LinkedIn;<br />. Design and improve user experience;<br />. Support production systems;<br />. Manage cloud infrastructure.<br /><br />ABOUT THE TEAM<br /><br />We’re a small team of 15 people at Driftrock but we’re growing. Our product development team is 7 people with 6 developers and 1 CTO, this means that anyone we bring in can have a huge impact on the culture and practices of the team. <br /><br />We believe in continuous improvement and we are constantly refining and improving how we work and communicate. One of the ways we do this is by performing fortnightly retrospectives, which are often run by different team members. <br /><br />Currently we make use of daily standups and weekly prioritisation meetings to ensure we're pulling in the same direction and maintaining our focus of delivering value to our end users early and often.<br /><br />ABOUT YOU<br /><br />. You should be keen to learn and improve technical, product and personal skills;<br />. You want to be involved in crafting products whilst building on the culture and process of the product team;<br />. You are happy working in a small team, collaborating closely with other engineers as well as our product and sales teams;<br />. You can provide new and diverse viewpoints for our technical and product discussions;<br />. You are interested in agile practices such as continuous delivery, TDD, pair programming, code reviews and retrospectives;<br />. You are keen to ensure there is a high standard of quality and security in the software we produce as a team;<br />. You have had some exposure to Ruby, Elixir or Javascript (we do not expect you to have experience in all of those languages); <br />. You have the right to work in the UK.<br /><br />WHAT HAPPENS NEXT?<br /><br />The interview process has some flexibility but is primarily made up of the following stages:<br /><br />. An initial phone conversation with an engineer;<br />. A take home technical test/coding challenge;<br />. Followed by an on-site pairing interview, where we'll build on your code challenge solution. We then do an informal problem solving task and we finish up with an informal chat with the rest of the team;<br /><br />We try our hardest to reduce the amount of stress involved in the process, we’re not trying to catch you out with trick questions and if at any point (even on the take home test) you have any questions for us we encourage you to ask them.<br /><br />BENEFITS<br /><br />. You will work with passionate and smart people, in an environment where we firmly believe in sharing knowledge;<br />. You will be an integral part of a growing and innovative tech startup;<br />. You can be enrolled to the Company’s pension scheme;<br />. The company atmosphere is social and friendly; <br />. You will be part of fun monthly team events.<br /><br /><br />We will not be considering any recruitment agencies for this role.<br /><br />&quot;By applying for this job you hereby give us permission to store your data on our secure applicant tracking system and to contact you with regards to Driftrock Ltd and our job opportunities. We will store your data for a year before deleting all individually identifiable information. If you wish data to be deleted sooner, respond to this email requesting the deletion of your data&quot;."
  },
  {
    "id": "mb-pu1ZbSe-3HVC1WXYrPw",
    "url": "http://jobmote.com/jobs/16556-software-developer-enamored-of-text-and-data",
    "title": "Software Developer Enamored of Text and Data",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:bash/other/1",
      "DBG_TECH1:k/t/w:perl/other/5",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=6, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 11, 2018 1:23:56 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p>Needed yesterday: A competent (read: excellent) developer who truly enjoys solving complex scripting challenges with efficiency and precision. We’re looking for people who love to tinker with computers (hardware and software), who work with text terminals all the time (and prefer it!), and who work well with limited management (i.e., take initiative). People who like to track down problems hidden in haystacks and solve them with solutions that prevent that <em>category</em> of problems in the future.&nbsp; Does this describe you?</p><p><strong>Skills &amp; Requirements</strong></p><ul><li>enough experience to dive in quickly and be up-to-speed quickly</li><li>ability to work on multiple tasks simultaneously</li><li>strong coding skills, of course (essential familiarity:&nbsp; ruby, bash; very helpful:&nbsp; mechanize, xpath, text processing; extras: perl, lua, mysql)</li><li>self-motivated and objective-based (we don’t care about face time)</li><li>Debian or Ubuntu experience is very helpful; working in Linux essential</li></ul><p><strong>Additional Details</strong></p><p>Work remotely from anywhere (many employees do so full-time, others on occasion), in-person routinely in Los Angeles, or on-site in Huntersville, North Carolina.</p><p>Looking for mid-level, but will consider junior and senior level as well, as long as you have been coding as a hobby for a long time (in the case of the former), and aren’t stuck in your ways (in the case of the latter).</p><p>Challenging, but supportive environment with a fun team that knows how to balance life and work.</p><p>Full-time. Competitive compensation. Planning to hire immediately.</p><p>&nbsp;</p><p><em>No recruiters please.</em></p><p><strong>About Data Driven Safety</strong></p><p>How DDS is described by our employees: “No bs, no corporate politics, no dress code, financially-secure company, flexible work schedules, objective-based approach, employees all over the world, telecommuting is as normal as on-site, love what I do (at least most days), … what did you want me to say again?”</p><p>DDS is a small company with a close-knit employee group. We have maintained a nearly 100% client and employee retention rate. We offer competitive salary and benefit packages to smart, loyal, creative thinkers that excel at problem solving.</p><p>DDS collects public record data (e.g., arrest, crash, judicial, etc.) directly from thousands of governmental agencies. This information fuels a number of unique services that are utilized nationally by large and small corporations, a state risk pool, municipalities, educational institutions, hospital systems and insurance underwriters. Our only publicly marketed service is Envision, a comprehensive driver improvement platform. However, most of our growth during the past several years has been driven by a set of predictive underwriting, fraud prevention and claims management services that were created at the request of our customers in the automotive and health care industries.</p><p>Data Driven Safety, LLC is dedicated to improving public safety. We have been in existence since 2009 and are owned through the Graham Group, a billion-dollar investment vehicle.</p></div></div><div></div></div></div>"
  },
  {
    "id": "3XV7Eb7_SSyhXAt8eTv33w",
    "url": "https://authenticjobs.com/jobs/30729?r=rss2",
    "title": "Data Driven Safety, LLC: Software Developer Enamored of Text and Data",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:bash/other/1",
      "DBG_TECH1:k/t/w:perl/other/5",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=6, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 11, 2018 5:40:58 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<p>Full-time</p><p><strong>(&quot;Huntersville, NC&quot;, &quot;Anywhere&quot;)</strong> </p><p>Needed yesterday: A competent (read: excellent) developer who truly enjoys solving complex scripting challenges with efficiency and precision. We're looking for people who love to tinker with computers (hardware and software), who work with text terminals all the time (and prefer it!), and who work well with limited management (i.e., take initiative). People who like to track down problems hidden in haystacks and solve them with solutions that prevent that <em>category</em> of problems in the future.&nbsp; Does this describe you?</p><p><strong>Skills &amp; Requirements</strong></p><ul><li>enough experience to dive in quickly and be up-to-speed quickly</li><li>ability to work on multiple tasks simultaneously</li><li>strong coding skills, of course (essential familiarity:&nbsp; ruby, bash; very helpful:&nbsp; mechanize, xpath, text processing; extras: perl, lua, mysql)</li><li>self-motivated and objective-based (we don't care about face time)</li><li>Debian or Ubuntu experience is very helpful; working in Linux essential</li></ul><p><strong>Additional Details</strong></p><p>Work remotely from anywhere (many employees do so full-time, others on occasion), in-person routinely in Los Angeles, or on-site in Huntersville, North Carolina.</p><p>Looking for mid-level, but will consider junior and senior level as well, as long as you have been coding as a hobby for a long time (in the case of the former), and aren't stuck in your ways (in the case of the latter).</p><p>Challenging, but supportive environment with a fun team that knows how to balance life and work.</p><p>Full-time. Competitive compensation. Planning to hire immediately.</p><p>&nbsp;</p><p><em>No recruiters please.</em></p><p><strong>About Data Driven Safety</strong></p><p>How DDS is described by our employees: &quot;No bs, no corporate politics, no dress code, financially-secure company, flexible work schedules, objective-based approach, employees all over the world, telecommuting is as normal as on-site, love what I do (at least most days), ... what did you want me to say again?&quot;</p><p>DDS is a small company with a close-knit employee group. We have maintained a nearly 100% client and employee retention rate. We offer competitive salary and benefit packages to smart, loyal, creative thinkers that excel at problem solving.</p><p>DDS collects public record data (e.g., arrest, crash, judicial, etc.) directly from thousands of governmental agencies. This information fuels a number of unique services that are utilized nationally by large and small corporations, a state risk pool, municipalities, educational institutions, hospital systems and insurance underwriters. Our only publicly marketed service is Envision, a comprehensive driver improvement platform. However, most of our growth during the past several years has been driven by a set of predictive underwriting, fraud prevention and claims management services that were created at the request of our customers in the automotive and health care industries.</p><p>Data Driven Safety, LLC is dedicated to improving public safety. We have been in existence since 2009 and are owned through the Graham Group, a billion-dollar investment vehicle.</p><p></p><p><strong>Job Perks:</strong> Odd hours celebrated; anywhere in the world acceptable.  If you decide to work from our Huntersville office, there's a Jimmy John's right outside.  And to eat what you find there, we have a large, private, outdoor patio.  Before and after, have some decent espresso (well, iperEspresso) in the kitchen.</p><p><strong>Apply:</strong> Please include, in your first message, the phrase, &quot;my favorite color is [color]&quot;, replacing [color] with any color (doesn't actually have to be your favorite, if that's a secret.  Also, find and report the error in the previous sentence.  No phone calls, thanks.</p>"
  },
  {
    "id": "y7BD0hSrRSGjzaxfvpbNOQ",
    "url": "https://whereverjobs.com/listing/3474/microservices-engineer",
    "title": "Microservices Engineer",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=2, go=3, nodejs=1, bigdata-ml=0, ruby=4, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java",
      "other",
      "ruby"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 10, 2018 5:02:14 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<h3>Microservices Engineer</h3><div>Company: Citrusbyte<br><br></div><div>                                <div>Citrusbyte&nbsp;is a software consultancy that believes in&nbsp;simplicity as a core priority in software design. We build custom systems for both startups and enterprises - You can see our&nbsp;<a href='https://citrusbyte.com/portfolio' rel='nofollow'>portfolio</a>&nbsp;for more information about our clients.</div><div><br></div><div>We have offices in Los Angeles and New York, but we work remotely with people from all around the world.</div><div><br></div><div>Our engineers have experience in a consultative environment, excellent communication skills and a desire to work with talented teams building innovative products. We work closely with our clients, sharing our experience and processes to help them define and create their products.</div><div><br></div><div>We are looking for&nbsp;experienced backend engineers with&nbsp;experience building&nbsp;<span>service-oriented architectures</span>, using tools like&nbsp;<span>Kafka</span>&nbsp;and RabbitMQ and&nbsp;having experience with languages such as Java, Ruby, Elixir, Go, JavaScript.</div><div><br></div><div><span>Job Requirements:</span><br></div><ul><li>Proficient in Ruby or Java and at least one other programming language.</li><li>Proficient with&nbsp;<span>Kafka</span>.</li><li>Experience building&nbsp;service-oriented&nbsp;architectures.</li><li>Experience as a software consultant.</li><li>Experience working remotely in a distributed company</li><li>Open-minded&nbsp;and demonstrates a passion for continuous learning.</li><li>Smart, gets things done.</li></ul>            </div><div>How to apply:<br>You can apply directly at our career page: <a href='http://careers.citrusbyte.com/apply/yO2gVYWNF7/Experienced-Microservices-Engineer?source=WJ' rel='nofollow'>careers.citrusbyte.com/apply/yO2gVYWNF7/Experienced-Microservices-Engineer</a></div>"
  },
  {
    "id": "L1pW0BRVQmeRJ5Izw5SLiQ",
    "url": "https://whereverjobs.com/listing/3459/backend-engineer-money",
    "title": "Backend Engineer - Money",
    "tags": [
      "DBG:surround``remot W OR(career,first)",
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "DBG_TECH1:k/t/w:elixir/other/15",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=4, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 8, 2018 5:32:23 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<h3>Backend Engineer - Money</h3><div>Company: Heetch<br><br></div><div>                                <p><strong>MONEY @ HEETCH</strong></p><p>The Money Team works behind the scenes to ensure a smooth experience for everyone involved in payment transactions. We are responsible for the proper handling of millions of euros across thousands of daily rides , and everyone is&nbsp;<em>counting</em>&nbsp;on us to deliver reliably and efficiently.</p><p>We work hand in hand with the Data, Product and Operations teams to improve our product while protecting our bankrolls and maintaining compliance and cleanliness in our accounting records:&nbsp;</p><ul><li>Numbers, numbers everywhere.</li><li>We help users manage their payment methods and coupons, a crucial part of the passenger onboarding experience.</li><li>We make sure drivers get paid on time for their work by providing them with a seamless experience so they don’t have to worry about their money.</li><li>Fraudsters are like zombies, one breach, and you’ll face an army of them.</li><li>1 cent can become over 9000 cents if you don’t pay attention.</li></ul><p><strong>WHAT WE DO</strong></p><p><strong>Take part in the design and specifications of new features and products.</strong> A new form to help the marketing teams launch their campaign in every bar in a new city? Check. Improve our fraud detection models to fight card testers that got their hands on thousands of stolen credit cards? Sure!</p><p><strong>Use state of the art tools and best practices to ship code quickly and safely</strong>&nbsp;(continuous integration, code review, automated testing, etc). The daily job of the money team is to write Ruby and Elixir microservices that communicate via HTTP, RabbitMQ and gRPC, deployed using Docker on a Mesos/Marathon cluster.</p><p><strong>Communicate with each other.</strong>&nbsp;We are a remote-first team and company, working from our home or our Parisian office. We synchronize whenever needed (discussions around specs, pair programming, code reviews) so no-one is left alone.</p><p><strong>Always improve.</strong>&nbsp;Everyone makes mistakes, and we all can learn from each other. We value personal progress and want you to look back proudly on what you’ve done.</p><p><strong>REQUIREMENTS</strong></p><ul><li>5+ years as a backend engineer.</li><li>Eager to learn Elixir.</li><li>Exposure to the architectural patterns of a large, high-scale application. You understand the pros and cons of microservices, and embrace event-driven programming.</li><li>You are used to dealing with complex business logic and ambiguous edge cases.</li></ul><p><strong>Bonus points</strong>&nbsp;</p><ul><li>Prior knowledge of Ruby or Elixir.</li><li>Experience with message brokers(such as Kafka, RabbitMQ) and event-driven architectures</li></ul><p><strong>PERKS</strong>&nbsp;</p><ul><li>Stocks.</li><li>Paid conference attendance/travel.</li><li>Heetch credits.</li><li>A Spotify subscription.</li><li>Medical care.</li><li>Code retreats and company retreats.</li><li>Travel budget (visit your remote coworkers and our offices).</li></ul>            </div><div>How to apply:<br><a href='https://jobs.lever.co/heetch/f320a9da-5be9-4a1c-8be7-9e9f8fdd98dd?lever-origin=applied&amp;lever-source%5B%5DWhereverJobs' rel='nofollow'>jobs.lever.co/heetch/f320a9da-5be9-4a1c-8be7-9e9f8fdd98dd</a></div>"
  },
  {
    "id": "FEQWC-OASfSGyFl3x89hAQ",
    "url": "https://whereverjobs.com/listing/3426/senior-engineer",
    "title": "Senior Engineer",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "DBG_TECH1:k/t/w:elixir/other/15",
      "DBG_TECH1:k/t/w:gdb/c/13",
      "DBG_TECH1:k/t/w:jquery/frontend/8",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=13, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=16}",
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c",
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 7, 2018 5:02:08 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<h3>Senior Engineer</h3><div>Company: Blockit, Inc.<br><br></div><div>                                <div><span>You'll be our second engineer, working directly with our CTO, to build integrations into medical software for our greenfield platform. You'll have a major impact on the code and shape the direction of the product.</span></div><div><br></div><div><span>We're looking for a Senior Elixir engineer that isn't afraid to get their hands dirty. This role involves building connectors into 3rd party systems. Each integration is unique challenge and requires creativity and out-of-the box thinking.</span></div><div><br></div><div><span>You Will</span></div><div><br></div><div><span>- Build connectors/integrations into 3rd party medical systems</span><br></div><div></div><div><span>- Build data parsers for our data ingestion engine</span><br></div><div></div><div><span>- Help design the architecture for our integration and ingestion engine</span></div><div><br></div><div><span>Our Tech Stack</span></div><div><br></div><div><span>- Microservices built in Elixir, connected using GraphQL and GRPC.</span><br></div><div></div><div><span>- React/Redux on the frontend (not even a single line jQuery, phew!)</span><br></div><div></div><div><span>- Kubernetes on Google Cloud Platform, Docker, Redis, Postgres, Elasticsearch, RabbitMQ</span><br></div><div></div><div><span>- Github and TravisCI for Development/CD.</span></div><div><br></div><div><span>Our Ideal Candidate</span></div><div><br></div><div><span>- Has experience with UI Automation (i.e, Selenium, UIPath, or AutoIT)</span><br></div><div></div><div><span>- Isn't afraid to drop down to Wireshark or GDB to figure out how something works</span><br></div><div></div><div><span>- Has worked with healthcare technology before (HL7, FHIR, etc.)</span><br></div><div></div><div><span>- Knowledge of (but not necessarily an expert in) writing Elixir</span><br></div><div></div><div><span>- Has experience consuming REST or GraphQL APIs</span><br></div><div></div><div><span>- Knowledge and experience of agile software development methods</span><br></div><div></div><div><span>- You are passionate about the quality of your code</span></div><div><br></div><div><span>The team is located in Austin, TX and Dallas, TX, but we are open to remote candidates outside of Texas.</span></div>            </div><div>How to apply:<br><a href='mailto:sean@blockitnow.com' rel='nofollow'>sean@blockitnow.com</a></div>"
  },
  {
    "id": "1LK_4OIuQuCuLtkvXcofoA",
    "url": "https://news.ycombinator.com/item?id=17461685",
    "title": "Waldo | Austin, TX | Back-end Software Engineer | $80 - $100k + equity | Full-time | REMOTE",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:clojure/other/5",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=5, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 5, 2018 12:00:06 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<span>Waldo | Austin, TX | Back-end Software Engineer | $80 - $100k + equity | Full-time | REMOTE<p>Waldo Photos is a photo finding platform utilizing facial and object recognition to empower consumers to toss their selfie sticks, put their phones back in their pockets and live in the moment. Waldo is the only platform that removes all of the friction in getting photos of you taken by others and creates new opportunities for photographers to market and sell their photos. Users can enjoy life’s most precious events and automatically receive images taken of them right on their phones.</p><p>We're looking for an independent problem-solver who values learning, keeps current on technology trends, and enjoys the ownership and accountability that is expected from early-stage team members.</p><p>Backend engineer ~ 6+ years experience. Built and shipped complex, high-performance, highly-available distributed systems. Strong background in Python &amp; Java. Clojure a plus. <a href='https://waldo-photos.workable.com/jobs/751504' rel='nofollow'>https://waldo-photos.workable.com/jobs/751504</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span>"
  },
  {
    "id": "sa9gqRCAT_aWOdG25ihsFQ",
    "url": "http://jobmote.com/jobs/15460-full-stack-developer-elixir-part-remote",
    "title": "Full Stack Developer - Elixir (PART REMOTE)",
    "tags": [
      "DBG:surround``12N(work, OR(home,remot), 5N(OR(offic,headquart,onsit), OR(dai,daili,week,weekli,month,monthli)) )",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 4, 2018 10:21:12 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p>Do you consider yourself to be an ambitious Full Stack Developer?<br>Are you looking for the flexibility to work 2 days in the office and 3 from home?<br>If YES keep reading!<br>My client, an Independent Bookmaker, is looking for someone to take over the future development of their projects as well as the support and maintenance..... click apply for full job details </p></div></div><div></div></div></div>"
  },
  {
    "id": "1nVqSQE0Qq2M-U7InzKDgw",
    "url": "https://news.ycombinator.com/item?id=17453306",
    "title": "ReifyHealth | Full-time Software Engineer or Data Engineer | Boston | ONSITE, REMOTE (U.S.) | $100-150K + equity",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:clojure/other/10",
      "DBG_TECH1:k/t/w:clojurescript/other/10",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/24",
      "DBG_TECH1:k/t/w:frontend-developer/frontend/13",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=20, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=24, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=24}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 3, 2018 11:16:07 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<span>ReifyHealth | Full-time Software Engineer or Data Engineer | Boston | ONSITE, REMOTE (U.S.) | $100-150K + equity<p>Hi. We are building clinical trial software that makes a difference in people's lives. Clinical trials are slow, unpredictable and expensive and we aim to improve this for everyone's benefit. We have multiple apps in production and have plenty of interesting features coming up. We care about building meaningful products, providing delightful user experiences and actively listening to our users with the goal of continuous improvement. We actively use, contribute to and author open source libraries. We care about having a good remote culture and bring remoters in quarterly.</p><p>We are hiring for three positions (full stack developers feel free to apply to Frontend and Backend):</p><p>* Senior Data Engineer: Kafka, PostgreSQL, Clojure - <a href='https://jobs.lever.co/reifyhealth/258735ad-71d0-4ebe-b551-fbbcf2f3213c?lever-origin=applied&amp;lever-source%5B%5D=Hacker%20News' rel='nofollow'>https://jobs.lever.co/reifyhealth/258735ad-71d0-4ebe-b551-fb...</a></p><p>* Junior to Senior Frontend Engineer: HTML, CSS, ReactJS, ClojureScript - <a href='https://jobs.lever.co/reifyhealth/089e5e4c-13e9-49c8-93a9-11e7f5a8b78f?lever-origin=applied&amp;lever-source%5B%5D=Hacker%20News' rel='nofollow'>https://jobs.lever.co/reifyhealth/089e5e4c-13e9-49c8-93a9-11...</a></p><p>* Junior to Senior Backend Engineer: ClojureScript, Clojure, PostgreSQL - <a href='https://jobs.lever.co/reifyhealth/dd9f818f-d94c-4a0c-b97c-06e19f5939a2?lever-origin=applied&amp;lever-source%5B%5D=Hacker%20News' rel='nofollow'>https://jobs.lever.co/reifyhealth/dd9f818f-d94c-4a0c-b97c-06...</a></p><p>We are also looking for an engineering manager (position coming shortly). Please contact engineering-hiring AT reifyhealth.com if you're interested.</p><p>We value diversity and believe the unique contributions each of us brings drives our success. If this sounds exciting, we'd love to hear from you!<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span>"
  },
  {
    "id": "vTYKgsjhQD60lw7JNsvuKg",
    "url": "https://remoteok.io/jobs/67845",
    "title": "Backend Engineer",
    "tags": [
      "DBG:surround``remot W OR(career,first)",
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "DBG_TECH1:k/t/w:elixir/other/15",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=4, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 3, 2018 8:36:49 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<td><a rel='nofollow'><h2>Backend Engineer</h2></a><br><a rel='nofollow'><h3>Heetch</h3></a></td><div><div><br>MONEY @ HEETCH<br><br>The Money Team works behind the scenes to ensure a smooth experience for everyone involved in payment transactions. We are responsible for the proper handling of millions of euros across thousands of daily rides , and everyone is&nbsp;counting&nbsp;on us to deliver reliably and efficiently.<br><br>We work hand in hand with the Data, Product and Operations teams to improve our product while protecting our bankrolls and maintaining compliance and cleanliness in our accounting records:&nbsp;<br><br><br>* Numbers, numbers everywhere.<br><br>* We help users manage their payment methods and coupons, a crucial part of the passenger onboarding experience.<br><br>* We make sure drivers get paid on time for their work by providing them with a seamless experience so they don’t have to worry about their money.<br><br>* Fraudsters are like zombies, one breach, and you’ll face an army of them.<br><br>* 1 cent can become over 9000 cents if you don’t pay attention.<br><br><br><br><br><br>WHAT WE DO<br><br>Take part in the design and specifications of new features and products. A new form to help the marketing teams launch their campaign in every bar in a new city? Check. Improve our fraud detection models to fight card testers that got their hands on thousands of stolen credit cards? Sure!<br><br>Use state of the art tools and best practices to ship code quickly and safely&nbsp;(continuous integration, code review, automated testing, etc). The daily job of the money team is to write Ruby and Elixir microservices that communicate via HTTP, RabbitMQ and gRPC, deployed using Docker on a Mesos/Marathon cluster.<br><br>Communicate with each other.&nbsp;We are a remote-first team and company, working from our home or our Parisian office. We synchronize whenever needed (discussions around specs, pair programming, code reviews) so no-one is left alone.<br><br>Always improve.&nbsp;Everyone makes mistakes, and we all can learn from each other. We value personal progress and want you to look back proudly on what you’ve done.<br><br><br><br>REQUIREMENTS<br><br><br>* 5+ years as a backend engineer.<br><br>* Eager to learn Elixir.<br><br>* Exposure to the architectural patterns of a large, high-scale application. You understand the pros and cons of microservices, and embrace event-driven programming.<br><br>* You are used to dealing with complex business logic and ambiguous edge cases.<br><br><br><br><br>Bonus points&nbsp;<br><br><br>* Prior knowledge of Ruby or Elixir.<br><br>* Experience with message brokers(such as Kafka, RabbitMQ) and event-driven architectures<br><br><br><br><br><br>PERKS&nbsp;<br><br><br>* Stocks.<br><br>* Paid conference attendance/travel.<br><br>* Heetch credits.<br><br>* A Spotify subscription.<br><br>* Medical care.<br><br>* Code retreats and company retreats.<br><br>* Travel budget (visit your remote coworkers and our offices).<br><br><br><p>See more jobs at <a rel='nofollow'>Heetch</a></p></div></div>"
  },
  {
    "id": "9gwt4YpFQd2vgfCNuvVYrA",
    "url": "https://stackoverflow.com/jobs/195949/backend-engineer-money-heetch?a=13IlijcAQyDC",
    "title": "Backend Engineer - Money at Heetch  ",
    "tags": [
      "DBG:surround``remot W OR(career,first)",
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "DBG_TECH1:k/t/w:elixir/other/15",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=4, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 3, 2018 4:07:53 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Backend Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Carsharing, Marketplace, Transportation</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>elixir</a><a rel='nofollow'>ruby-on-rails</a><a rel='nofollow'>microservices</a><a rel='nofollow'>machine-learning</a><a rel='nofollow'>event-sourcing</a>                    </div>                                            <h2>Job description</h2>                <div><p><strong>MONEY @ HEETCH</strong></p><p>The Money Team works behind the scenes to ensure a smooth experience for everyone involved in payment transactions. We are responsible for the proper handling of millions of euros across thousands of daily rides , and everyone is&nbsp;<em>counting</em>&nbsp;on us to deliver reliably and efficiently.</p><p>We work hand in hand with the Data, Product and Operations teams to improve our product while protecting our bankrolls and maintaining compliance and cleanliness in our accounting records:&nbsp;</p><ul><li>Numbers, numbers everywhere.</li><li>We help users manage their payment methods and coupons, a crucial part of the passenger onboarding experience.</li><li>We make sure drivers get paid on time for their work by providing them with a seamless experience so they don’t have to worry about their money.</li><li>Fraudsters are like zombies, one breach, and you’ll face an army of them.</li><li>1 cent can become over 9000 cents if you don’t pay attention.</li></ul><p><strong>WHAT WE DO</strong></p><p><strong>Take part in the design and specifications of new features and products.</strong> A new form to help the marketing teams launch their campaign in every bar in a new city? Check. Improve our fraud detection models to fight card testers that got their hands on thousands of stolen credit cards? Sure!</p><p><strong>Use state of the art tools and best practices to ship code quickly and safely</strong>&nbsp;(continuous integration, code review, automated testing, etc). The daily job of the money team is to write Ruby and Elixir microservices that communicate via HTTP, RabbitMQ and gRPC, deployed using Docker on a Mesos/Marathon cluster.</p><p><strong>Communicate with each other.</strong>&nbsp;We are a remote-first team and company, working from our home or our Parisian office. We synchronize whenever needed (discussions around specs, pair programming, code reviews) so no-one is left alone.</p><p><strong>Always improve.</strong>&nbsp;Everyone makes mistakes, and we all can learn from each other. We value personal progress and want you to look back proudly on what you’ve done.</p><p><strong>REQUIREMENTS</strong></p><ul><li>5+ years as a backend engineer.</li><li>Eager to learn Elixir.</li><li>Exposure to the architectural patterns of a large, high-scale application. You understand the pros and cons of microservices, and embrace event-driven programming.</li><li>You are used to dealing with complex business logic and ambiguous edge cases.</li></ul><p><strong>Bonus points</strong>&nbsp;</p><ul><li>Prior knowledge of Ruby or Elixir.</li><li>Experience with message brokers(such as Kafka, RabbitMQ) and event-driven architectures</li></ul><p><strong>PERKS</strong>&nbsp;</p><ul><li>Stocks.</li><li>Paid conference attendance/travel.</li><li>Heetch credits.</li><li>A Spotify subscription.</li><li>Medical care.</li><li>Code retreats and company retreats.</li><li>Travel budget (visit your remote coworkers and our offices).</li></ul>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://jobs.lever.co/heetch/f320a9da-5be9-4a1c-8be7-9e9f8fdd98dd?lever-origin=applied&amp;lever-source%5B%5D=StackOverflow' rel='nofollow'>                        Apply now        </a></div>                                    </div>                        </div>        </div>            <h2>About Heetch</h2>            <div><p><strong>WHO WE ARE</strong> Heetch is a ride-sharing app with a simple mission: we want people to enjoy going out. Every night and day, our drivers are doing everything to make your ride unforgettable and friendly! We are focusing on young people expectations and compete with many actors on this segment. The service has been launched in Paris in September, 2013 and is growing very fast since then, with thousands of rides every night in France, Italy, Sweden, Belgium and Morocco. With more than 1 million users in Europe, we are proud to be one of the French fastest growing startup!</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Full remote (in Europe only) and flexible ways of working</span>                            </li>                            <li>                                <span></span>                                <span>Paid conferences attendance/travel</span>                            </li>                            <li>                                <span></span>                                <span>Periodic team meetups</span>                            </li>                            <li>                                <span></span>                                <span>Stocks</span>                            </li>                            <li>                                <span></span>                                <span>Heetch credits</span>                            </li>                    </ul>                "
  },
  {
    "id": "bM8yTnjPT0S5aHYmqIhG8A",
    "url": "https://whereverjobs.com/listing/3392/senior-full-stack-engineer-remote-usa-only-125k-165k-equity",
    "title": "Senior Full Stack Engineer - Remote, USA ONLY ($125k - 165k | Equity)",
    "tags": [
      "DBG:surround``OR(work,remot) 3W 3W(OR(wherev,whenev,where), OR(want,comfort))",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``work 3W where 2W want",
      "DBG_TECH1:k/t/w:clojure/other/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=1, go=3, nodejs=0, bigdata-ml=0, ruby=2, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/Any"
    ],
    "tagsNames1": [
      "Any time zone"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 3, 2018 5:32:37 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<h3>Senior Full Stack Engineer - Remote, USA ONLY ($125k - 165k | Equity)</h3><div>Company: SocialChorus<br><br></div><div>                                <p><span>The modern workplace is changing. It seems strange but in a world of connected everything, employees are feeling more disconnected than ever. </span><strong>Want to fix that?</strong></p><p><strong>SocialChorus</strong><span> believes everyone matters and our goal is to have every employee informed, supported, and connected to each other and the shared goals of the organization. The intranet and email are broken for organization communications.</span></p><p><strong>How do we fix it? </strong><span>We deliver the right content at the right time to each person. This is what it means to be truly personalized. </span></p><p><strong>Has it worked?</strong><span> Absolutely! Our client list includes household names and is growing daily and now we need your help!</span></p><p><span>We are currently seeking a </span><strong>Sr. Full Stack Engineer</strong><span> to meet growing demand and dream up new ways of integrating with complex systems at a massive scale.</span></p><p><strong>We are a distributed team</strong><span>. Yes, we have offices in several cities but we build solutions for distributed workforces so we model our workforce the same way. In this role you really can work where you want.</span></p><p><strong>RESPONSIBILITIES</strong></p><ul><li><span>Create clean, maintainable, and scalable code.</span></li><li><span>Create REST based web services and APIs for consumption by mobile and web platforms</span></li><li><span>Act a leader to mentor and guide other team members to improve technical designs and decision making</span></li><li><span>Foster an environment of &quot;coding as a craft&quot; where creative solutions are required </span></li><li><span>Work with all levels of SocialChorus staff to implement new features and give product demonstrations.</span></li></ul><p><strong>QUALIFICATIONS</strong></p><ul><li><span>Full-stack development experience on high-scale systems in Java, Ruby, Go, Node, Clojure, etc.</span></li><li><span>Proven track record of scaling distributed systems</span></li><li><span>Capable of designing and building out API's that a developer community could be engaged to leverage.</span></li><li><span>Strong knowledge in OOD, Domain-driven design, and micro-services</span></li><li><span>Experience working in an agile development&nbsp;&nbsp;</span></li></ul><p><strong>Why SocialChorus?</strong></p><p><span>Because you care. About people, the work you do, and the connections you make. Work is such a large part of life, it only makes sense to make it awesome.</span></p><p><span>If you want to engage brilliant minds in a true start-up environment where ideas are rewarded regardless of who they come from, join us. This is a rapidly changing space so if you thrive on ambiguity, are hungry for a challenge, and have the guts to speak your mind it could be a perfect fit.</span></p><p><span>So come for the challenges, come for the people, and the unlimited PTO, health benefits, 401k plan, casual and friendly environment, and a leadership team who truly believes in your growth both professionally and personally will keep you here.</span></p>            </div><div><a href='https://jobs.lever.co/socialchorus/e884e4f3-b7a4-4f4d-a338-98d6d1b4be9f' rel='nofollow'>jobs.lever.co/socialchorus/e884e4f3-b7a4-4f4d-a338-98d6d1b4be9f</a></div>"
  },
  {
    "id": "cYYN0w1ES7aG8yk0pywrOQ",
    "url": "https://www.remotejobr.com/jobs/senior-engineer",
    "title": "Senior Engineer",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "DBG_TECH1:k/t/w:elixir/other/15",
      "DBG_TECH1:k/t/w:gdb/c/13",
      "DBG_TECH1:k/t/w:jquery/frontend/8",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=13, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=16}",
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c",
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 2, 2018 9:55:38 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                <br>                <div><p></p>                <div><a title=&quot;Share to Twitter&quot; rel='nofollow'></a><a title=&quot;Share to Facebook&quot; rel='nofollow'></a><a title=&quot;Share to Google+&quot; rel='nofollow'></a><a title=&quot;Share to Tumblr&quot; rel='nofollow'></a><a title=&quot;Share to Pinterest&quot; rel='nofollow'></a><a title=&quot;Share to Email&quot; rel='nofollow'></a><a title=&quot;Share to Linkedin&quot; rel='nofollow'></a><a title=&quot;Share to Reddit&quot; rel='nofollow'></a><a title=&quot;Share to Hacker News&quot; rel='nofollow'></a></div>            <h2>Senior Engineer</h2>                            <p>      </p><p>  <strong>Headquarters:</strong> McKinney, TX    <br><strong>URL:</strong> <a href='http://www.blockitnow.com' rel='nofollow'>www.blockitnow.com</a></p><div><span>You'll be our second engineer, working directly with our CTO, to build integrations into medical software for our greenfield platform. You'll have a major impact on the code and shape the direction of the product.</span></div><div><br></div><div><span>We're looking for a Senior Elixir engineer that isn't afraid to get their hands dirty. This role involves building connectors into 3rd party systems. Each integration is unique challange and requires creativity and out-of-the box thinking.</span></div><div><br></div><div><span>You Will</span></div><div><br></div><div><span>- Build connectors/integrations into 3rd party medical systems</span><br></div><div><span>- Build data parsers for our data ingestion engine</span><br></div><div><span>- Help design the architecture for our integration and ingestion engine</span></div><div><br></div><div><span>Our Tech Stack</span></div><div><br></div><div><span>- Microservices built in Elixir, connected using GraphQL and GRPC.</span><br></div><div><span>- React/Redux on the frontend (not even a single line jQuery, phew!)</span><br></div><div><span>- Kubernetes on Google Cloud Platform, Docker, Redis, Postgres, Elasticsearch, RabbitMQ</span><br></div><div><span>- Github and TravisCI for Development/CD.</span></div><div><br></div><div><span>Our Ideal Candidate</span></div><div><br></div><div><span>- Has experience with UI Automation (i.e, Selenium, UIPath, or AutoIT)</span><br></div><div><span>- Isn't afraid to drop down to Wireshark or GDB to figure out how something works</span><br></div><div><span>- Has worked with healthcare technology before (HL7, FHIR, etc.)</span><br></div><div><span>- Knowledge of (but not necessarilly an expert in) writing Elixir</span><br></div><div><span>- Has experience consuming REST or GraphQL APIs</span><br></div><div><span>- Knowledge and experience of agile software development methods</span><br></div><div><span>- You are passionate about the quality of your code</span></div><div><br></div><div><span>The team is located in Austin, TX and Dallas, TX, but we are open to remote candidates outside of Texas.</span></div><p><strong>To apply:</strong> <a rel='nofollow'><span>[email&nbsp;protected]</span></a></p>    <p></p>        <p>            </p></div>        <br>            </div><div>            </div>"
  },
  {
    "id": "LIf0bu0ySJmCvRvY_SwYdQ",
    "url": "https://weworkremotely.com/remote-jobs/blockit-inc-senior-engineer",
    "title": "Blockit, Inc.: Senior Engineer",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "DBG_TECH1:k/t/w:elixir/other/15",
      "DBG_TECH1:k/t/w:gdb/c/13",
      "DBG_TECH1:k/t/w:jquery/frontend/8",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=13, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=16}",
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c",
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 2, 2018 9:46:53 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>  <div>    <h2>Senior Engineer</h2>      <h4>Posted Jul  2</h4>    <h3>      <span>Blockit, Inc.</span><br>      <span>Headquarters: McKinney, TX</span><br>        <a href='http://www.blockitnow.com' rel='nofollow'>www.blockitnow.com</a>      <br>      <a rel='nofollow'>View all Blockit, Inc. jobs →</a>    </h3>  </div>    </div>  <div>    <div><span>You'll be our second engineer, working directly with our CTO, to build integrations into medical software for our greenfield platform. You'll have a major impact on the code and shape the direction of the product.</span></div><div><br></div><div><span>We're looking for a Senior Elixir engineer that isn't afraid to get their hands dirty. This role involves building connectors into 3rd party systems. Each integration is unique challenge and requires creativity and out-of-the box thinking.</span></div><div><br></div><div><span>You Will</span></div><div><br></div><div><span>- Build connectors/integrations into 3rd party medical systems</span><br></div><div></div><div><span>- Build data parsers for our data ingestion engine</span><br></div><div></div><div><span>- Help design the architecture for our integration and ingestion engine</span></div><div><br></div><div><span>Our Tech Stack</span></div><div><br></div><div><span>- Microservices built in Elixir, connected using GraphQL and GRPC.</span><br></div><div></div><div><span>- React/Redux on the frontend (not even a single line jQuery, phew!)</span><br></div><div></div><div><span>- Kubernetes on Google Cloud Platform, Docker, Redis, Postgres, Elasticsearch, RabbitMQ</span><br></div><div></div><div><span>- Github and TravisCI for Development/CD.</span></div><div><br></div><div><span>Our Ideal Candidate</span></div><div><br></div><div><span>- Has experience with UI Automation (i.e, Selenium, UIPath, or AutoIT)</span><br></div><div></div><div><span>- Isn't afraid to drop down to Wireshark or GDB to figure out how something works</span><br></div><div></div><div><span>- Has worked with healthcare technology before (HL7, FHIR, etc.)</span><br></div><div></div><div><span>- Knowledge of (but not necessarily an expert in) writing Elixir</span><br></div><div></div><div><span>- Has experience consuming REST or GraphQL APIs</span><br></div><div></div><div><span>- Knowledge and experience of agile software development methods</span><br></div><div></div><div><span>- You are passionate about the quality of your code</span></div><div><br></div><div><span>The team is located in Austin, TX and Dallas, TX, but we are open to remote candidates outside of Texas.</span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='mailto:sean@blockitnow.com' rel='nofollow'>sean@blockitnow.com</a></p>  </div>"
  },
  {
    "id": "fAv7ODSzT0yrxXxWBPn1WQ",
    "url": "https://news.ycombinator.com/item?id=17443627",
    "title": "Transview Logistics, LLC | Software Engineer, DevOps | Boulder, CO | Full-time | On-site or Remote | http://transviewlogistics.com At Transview, we build transformative ...",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:rust/other/10",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=10, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other",
      "ruby"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 2, 2018 8:28:06 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<span>Transview Logistics, LLC | Software Engineer, DevOps | Boulder, CO | Full-time | On-site or Remote | <a href='http://transviewlogistics.com' rel='nofollow'>http://transviewlogistics.com</a><p>At Transview, we build transformative cloud-based ERP and logistics support platforms designed specifically for metals service centers. This includes structural steel, alloys and other metals for industry.</p><p>Our flagship product is a shipping optimization solution. We plan product shipments with truck loading constraints, traffic constraints, delivery constraints and more all in a single optimization solution; which allows us to find cost savings no other routing platform can. We build solutions that meet specific industry and customer needs in our flexible and comprehensive routing engine.</p><p>Hiring for:</p><p>1) Ruby on Rails - Come build web-based ERP integrations that perform efficiently and reliably for our clients running multi-million dollar operations.</p><p>2) Rust - Our routing engine is built in Rust. Come build cutting edge algorithms with us! Optimize the engine for speed, performance and new features.</p><p>3) DevOps - We integrate with a lot of legacy and modern ERP systems. Our routing engine uses a lot of CPU resources that need to be ready when our customers need them. Our app servers are utilized by around the clock warehouses that ship millions of dollars worth of product a day. We want you to help us succeed!</p><p>We offer competitive pay, flexible hours and interesting problems to solve! Come join our growing team. Please send your resume and any questions to justin@transviewlogistics.com.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span>"
  },
  {
    "id": "leh4Ub7hTPewAZgxmaYUEQ",
    "url": "https://news.ycombinator.com/item?id=17443232",
    "title": "Cyient | FULL TIME | ONSITE (remote for the right candidate) | Melbourne, FL; Bangalore, India; or Hyderabad, India ...",
    "tags": [
      "DBG:surround``remot 3W right",
      "DBG_TECH1:k/t/w:f#/other/5",
      "DBG_TECH1:k/t/w:haskell/other/5",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:lisp/other/5",
      "DBG_TECH1:k/t/w:maven/java/13",
      "DBG_TECH1:k/t/w:ocaml/other/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=20, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=15, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/java",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "java",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 2, 2018 7:49:06 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<span>Cyient | FULL TIME | ONSITE (remote for the right candidate) | Melbourne, FL; Bangalore, India; or Hyderabad, India | <a href='http://certsafe.com/' rel='nofollow'>http://certsafe.com/</a><p>CertSAFE is a software suite developed by Cyient for the design, development, simulation, verification, and validation of safety-critical systems. CertSAFE features a graphical development environment for a visual modeling language based on dataflow/circuit diagram notation, a simulation engine and interactive testing interface, an automatic test generator based on Satisfiability Modulo Theories (SMT) solving, and more.</p><p>As a member of the CertSAFE team, you will get to apply your software engineering and computer science knowledge in diverse areas, including programming language theory, graph theory, user interface design, concurrent and parallel software design, and software test automation. You will get to interact on a day-to-day basis with real-world users and customers working on safety-critical applications in aerospace, defense, transportation, medical devices, and other fields.</p><p>CertSAFE is developed by a small team with a Lean Kanban development process. We use a variety of technologies including Java, Maven, Jenkins, Python, and AWS, and also especially appreciate experience with functional languages such as Haskell, F#, OCaml, Lisp, etc.</p><p>Positions available include Software Engineer, Software Quality Assurance Engineer, Application Engineer, and DevOps Engineer. Visit <a href='http://certsafe.com/careers/' rel='nofollow'>http://certsafe.com/careers/</a> for full position descriptions.</p><p>If you plan on working outside of Melbourne, FL, these roles require travel to Melbourne, FL for 90-180 days to undergo necessary training. Visa assistance is available.</p><p>Interested? Email your resume to careers@certsafe.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span>"
  },
  {
    "id": "xNst2q7BTimiFldRs_Uf9A",
    "url": "https://whereverjobs.com/listing/3343/clojure-engineer-gmt-5-gmt-1-europe-preferred",
    "title": "Clojure Engineer - (GMT-5 - GMT+1, Europe preferred)",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:clojure/other/25",
      "DBG_TECH1:techWeightMap:{python=0, other=25, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 30, 2018 5:02:11 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<h4>Clojure Engineer - (GMT-5 - GMT+1, Europe preferred)</h4><div>Company: NomNom Insights<br><br></div><div>                                <div><h2><b>About NomNom</b></h2></div><div>NomNom is a B2B Saas application that helps customer-obsessed professionals learn from their customers faster. We aggregate customer feedback from different sources, making it easy to search, analyze and share it across the business.</div><div><br></div><div>Our team is small and distributed, and our culture is driven by talented individuals who love perfecting their craft. We like scrappy hustlers who are excited about solving hard problems with practical solutions.<br></div><div></div><div></div><div>We help our team members grow in their roles. We encourage and finance continuous learning and development. As part of NomNom, you’ll attend events, improve your skills and explore new ones.<br></div><div></div><div></div><div><span>We have no set hours, as long as your work is getting done, you're free to work whatever schedule suits you. We have a flexible vacation policy - You take the time you need.</span><br></div><div></div><div></div><div><h2><br></h2></div><div><h2><b>About you</b></h2></div><div><br></div><div>We are seeking a Clojure Engineer to help us shape and execute our product roadmap. This is an opportunity to join a brilliant team and demonstrate your ability to learn fast and scale an early stage product. As the ideal candidate for this job, you’ll have had previous experience working at startups and feel comfortable in a self-managed environment.</div><div>As a fully distributed team, we rely on the following tools for collaboration; GitHub, Slack, Trello, Status Hero, and Zoom. Each commit we push is tested in CircleCI, and we review all pull requests.<br></div><div></div><div></div><div>Our frontend talks to a suite of services written in Clojure, backed by Postgres, RethinkDB, Redis, Elasticsearch, and RabbitMQ. Each service is deployed as a Docker container and is running in Google Cloud. We manage our infrastructure with Terraform and Ansible.<br></div><div></div><div></div><div>We deploy our code several times a day, with one command.</div><div><br></div><div><h3>Required knowledge and experience</h3></div><ul><li>Practical experience of working with Clojure - your code made it to production and served customers at any scale.</li><li>Demonstratable knowledge of Postgres</li><li>Familiarity with RabbitMQ, Elasticsearch is a big plus</li><li>Proficiency in English - both written and spoken</li></ul><div><h3>Desirable knowledge and experience</h3></div><ul><li>Experience in managing operations and monitoring (or willing to learn such skills)</li><li>Experience of working with document databases such as RethinkDB or MongoDB</li></ul><div><h3>Salary and Perks</h3></div><div>Budget allowance for professional development (up to $1,000)<br></div><div></div><div></div><div>Pick your equipment<br></div><div></div><div></div><div>FancyHands.com access<br></div><div></div><div></div><div>Salary range: $40k - $52k USD</div><div><br></div><div>To get started, apply now.</div><div><br></div><div><span>Important</span>:&nbsp;<em>NomNom does not work with outsourcing firms, staffing agencies or recruiters. We only accept direct applications.</em></div>            </div><div>Apply here: <a href='https://nomnom.recruiterbox.com/jobs/fk01x2h/' rel='nofollow'>nomnom.recruiterbox.com/jobs/fk01x2h/</a></div>"
  },
  {
    "id": "tT9CyFOtRl2SeRnuLyYbYw",
    "url": "http://workinstartups.com/job-board/job/70524/senior-software-developer-at-m-driftrock/",
    "title": "Senior Software Developer",
    "tags": [
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG_TECH1:k/t/w:elixir/other/10",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=4, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=9}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 29, 2018 3:14:34 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Location: Old Street, London N1<br /><br />Start Date: ASAP<br /><br />Salary: depending on experience and skill level<br /><br />WHO ARE DRIFTROCK?<br /><br />Driftrock was started with the aim of making advertising through social channels better. There’s no excuse for being chased around the internet by images of products you’ve already bought. It’s irritating for the end user and counterproductive for the company attempting to sell their products or services. Using our tooling marketers can refine their targeting such that the ads are only shown to people who have shown genuine interest.<br /><br />WORKING AT DRIFTROCK<br /><br />Driftrock’s tooling provides our users with a way to receive, transform, track and optimise leads from social channels. Currently these tools look and feel very separate so we’re in the process of bringing them together, with the view to having Driftrock be more of a platform than a set of tools. Other problems we’re solving, and are looking to solve in the near future, include:<br /><br />* How to securely and safely handle personally identifying information; <br />* How to enrich incoming data with information that will help our users decide on the best next steps for their leads; <br />* What reports to provide to our users such that they can see if their efforts are resulting in quality leads and what they can do to improve.<br /><br />The technology is a mixture of Ruby, Elixir and React applications hosted on Kubernetes and Google Cloud. We make use of Redis and Postgres for data storage and RabbitMQ for event processing.<br /><br />You will be expected to:<br /><br />* Build RESTful APIs, event-based systems and front-end applications; <br />* Work with well-known public APIs like Facebook and LinkedIn; <br />* Design and improve user experience; <br />* Support production systems; <br />* Manage cloud infrastructure.<br /><br />ABOUT THE TEAM<br /><br />We’re a small team of 15 people at Driftrock but we’re growing. Our product development team is 7 people with 6 developers and 1 CTO, this means that anyone we bring in can have a huge impact on the culture and practices of the team.<br /><br />We believe in continuous improvement and we are constantly refining and improving how we work and communicate. One of the ways we do this is by performing fortnightly retrospectives, which are often run by different team members.<br /><br />Currently we make use of daily standups and weekly prioritisation meetings to ensure we're pulling in the same direction and maintaining our focus of delivering value to our end users early and often.<br /><br />ABOUT YOU<br /><br />* You should be keen to learn and improve technical, product and personal skills; <br />* You want to be involved in crafting products whilst building on the culture and process of the product team; <br />* You are happy working in a small team, collaborating closely with other engineers as well as our product and sales teams; <br />* You can provide new and diverse viewpoints for our technical and product discussions; <br />* You are interested in agile practices such as continuous delivery, TDD, pair programming, code reviews and retrospectives; <br />* You are keen to ensure there is a high standard of quality and security in the software we produce as a team; <br />* You are interested in mentoring and coach other team members; <br />* You have had some exposure to Ruby, Elixir or Javascript (we do not expect you to have experience in all of those languages); <br />* You have the right to work in the UK.<br /><br />WHAT HAPPENS NEXT?<br /><br />The interview process has some flexibility but is primarily made up of the following stages:<br /><br />* An initial phone conversation with an engineer; <br />* A take home technical test/coding challenge; <br />* Followed by an on-site pairing interview, where we'll build on your code challenge solution. We then do an informal problem solving task and we finish up with an informal chat with the rest of the team. <br /><br />We try our hardest to reduce the amount of stress involved in the process, we’re not trying to catch you out with trick questions and if at any point (even on the take home test) you have any questions for us we encourage you to ask them.<br /><br />BENEFITS<br /><br />* You will work with passionate and smart people, in an environment where we firmly believe in sharing knowledge; <br />* You will be an integral part of a growing and innovative tech startup; <br />* You can be enrolled to the Company’s pension scheme; <br />* The company atmosphere is social and friendly; <br />* You will be part of fun monthly team events.<br /><br />We will not be considering any recruitment agencies for this role.<br /><br />&quot;By applying for this job you hereby give us permission to store your data on our secure applicant tracking system and to contact you with regards to Driftrock Ltd and our job opportunities. We will store your data for a year before deleting all individually identifiable information. If you wish data to be deleted sooner, respond to this email requesting the deletion of your data&quot;."
  },
  {
    "id": "-QuVya7-RzS1LB1SW7kZiQ",
    "url": "https://stackoverflow.com/jobs/195597/senior-full-stack-engineer-remote-usa-only-socialchorus?a=13B1vIt7itwc",
    "title": "Senior Full Stack Engineer - Remote, USA ONLY at SocialChorus  ",
    "tags": [
      "DBG:surround``OR(work,remot) 3W 3W(OR(wherev,whenev,where), OR(want,comfort))",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``work 3W where 2W want",
      "DBG_TECH1:k/t/w:clojure/other/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=1, go=3, nodejs=0, bigdata-ml=0, ruby=2, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/Any"
    ],
    "tagsNames1": [
      "Any time zone"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 125000,
      "maxValue": 165000,
      "info": "Equity",
      "unit": "YEAR",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 29, 2018 11:11:49 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Full Stack Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Cloud-Based Solutions, Communications, Enterprise Software</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>ruby</a><a rel='nofollow'>javascript</a><a rel='nofollow'>reactjs</a><a rel='nofollow'>backbone.js</a><a rel='nofollow'>amazon-web-services</a>                    </div>                                            <h2>Job description</h2>                <div><p><span>The modern workplace is changing. It seems strange but in a world of connected everything, employees are feeling more disconnected than ever. </span><strong>Want to fix that?</strong></p><p><strong>SocialChorus</strong><span> believes everyone matters and our goal is to have every employee informed, supported, and connected to each other and the shared goals of the organization. The intranet and email are broken for organization communications.</span></p><p><strong>How do we fix it? </strong><span>We deliver the right content at the right time to each person. This is what it means to be truly personalized. </span></p><p><strong>Has it worked?</strong><span> Absolutely! Our client list includes household names and is growing daily and now we need your help!</span></p><p><span>We are currently seeking a </span><strong>Sr. Full Stack Engineer</strong><span> to meet growing demand and dream up new ways of integrating with complex systems at a massive scale.</span></p><p><strong>We are a distributed team</strong><span>. Yes, we have offices in several cities but we build solutions for distributed workforces so we model our workforce the same way. In this role you really can work where you want.</span></p><p><strong>RESPONSIBILITIES</strong></p><ul><li><span>Create clean, maintainable, and scalable code.</span></li><li><span>Create REST based web services and APIs for consumption by mobile and web platforms</span></li><li><span>Act a leader to mentor and guide other team members to improve technical designs and decision making</span></li><li><span>Foster an environment of &quot;coding as a craft&quot; where creative solutions are required </span></li><li><span>Work with all levels of SocialChorus staff to implement new features and give product demonstrations.</span></li></ul><p><strong>QUALIFICATIONS</strong></p><ul><li><span>Full-stack development experience on high-scale systems in Java, Ruby, Go, Node, Clojure, etc.</span></li><li><span>Proven track record of scaling distributed systems</span></li><li><span>Capable of designing and building out API's that a developer community could be engaged to leverage.</span></li><li><span>Strong knowledge in OOD, Domain-driven design, and micro-services</span></li><li><span>Experience working in an agile development&nbsp;&nbsp;</span></li></ul><p><strong>Why SocialChorus?</strong></p><p><span>Because you care. About people, the work you do, and the connections you make. Work is such a large part of life, it only makes sense to make it awesome.</span></p><p><span>If you want to engage brilliant minds in a true start-up environment where ideas are rewarded regardless of who they come from, join us. This is a rapidly changing space so if you thrive on ambiguity, are hungry for a challenge, and have the guts to speak your mind it could be a perfect fit.</span></p><p><span>So come for the challenges, come for the people, and the unlimited PTO, health benefits, 401k plan, casual and friendly environment, and a leadership team who truly believes in your growth both professionally and personally will keep you here.</span></p>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://jobs.lever.co/socialchorus/e884e4f3-b7a4-4f4d-a338-98d6d1b4be9f' rel='nofollow'>                        Apply now        </a></div>                                    </div>                        </div>        </div>            <h2>About SocialChorus</h2>            <div><p>SocialChorus is the leading employee engagement company by providing a&nbsp;<a href='https://www.socialchorus.com/platform/' rel='nofollow'>workforce communications platform</a>&nbsp;that transforms how workers and organizations connect every day. Designed for every worker from head office to the front line, our solution enables a more informed, connected and supported workforce. Organizations that depend on SocialChorus are able to connect and align their teams, power organizational initiatives and measure the business outcomes.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Unlimited PTO</span>                            </li>                            <li>                                <span></span>                                <span>Great work/life balance</span>                            </li>                            <li>                                <span></span>                                <span>Free Code Friday</span>                            </li>                            <li>                                <span></span>                                <span>Relaxed &amp; casual environment</span>                            </li>                            <li>                                <span></span>                                <span>Continuous learning environment</span>                            </li>                            <li>                                <span></span>                                <span>Remote work with great teammates</span>                            </li>                            <li>                                <span></span>                                <span>401k, Medical, Dental, Vision, Vacation bonuses, more!</span>                            </li>                            <li>                                <span></span>                                <span>Stock options for all new hires</span>                            </li>                    </ul>                "
  },
  {
    "id": "QgyCqippSC6_INxvbXk-Og",
    "url": "https://remoteok.io/jobs/67782",
    "title": "Senior Full Stack Engineer",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``OR(work,remot) 3W 3W(OR(wherev,whenev,where), OR(want,comfort))",
      "DBG:surround``work 3W where 2W want",
      "DBG_TECH1:k/t/w:clojure/other/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=1, go=3, nodejs=0, bigdata-ml=0, ruby=2, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/Any"
    ],
    "tagsNames1": [
      "Any time zone"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 28, 2018 11:17:40 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<td><a rel='nofollow'><h2>Senior Full Stack Engineer</h2></a><br><a rel='nofollow'><h3>Socialchorus</h3></a></td><div><div><br>The modern workplace is changing. It seems strange but in a world of connected everything, employees are feeling more disconnected than ever. Want to fix that?<br><br>SocialChorus believes everyone matters and our goal is to have every employee informed, supported, and connected to each other and the shared goals of the organization. The intranet and email are broken for organization communications.<br><br>How do we fix it? We deliver the right content at the right time to each person. This is what it means to be truly personalized. <br><br>Has it worked? Absolutely! Our client list includes household names and is growing daily and now we need your help!<br><br>We are currently seeking a Sr. Full Stack Engineer to meet growing demand and dream up new ways of integrating with complex systems at a massive scale.<br><br>We are a distributed team. Yes, we have offices in several cities but we build solutions for distributed workforces so we model our workforce the same way. In this role you really can work where you want.<br><br>RESPONSIBILITIES<br><br><br>* Create clean, maintainable, and scalable code.<br><br>* Create REST based web services and APIs for consumption by mobile and web platforms<br><br>* Act a leader to mentor and guide other team members to improve technical designs and decision making<br><br>* Foster an environment of &quot;coding as a craft&quot; where creative solutions are required <br><br>* Work with all levels of SocialChorus staff to implement new features and give product demonstrations.<br><br><br><br><br>QUALIFICATIONS<br><br><br>* Full-stack development experience on high-scale systems in Java, Ruby, Go, Node, Clojure, etc.<br><br>* Proven track record of scaling distributed systems<br><br>* Capable of designing and building out API's that a developer community could be engaged to leverage.<br><br>* Strong knowledge in OOD, Domain-driven design, and micro-services<br><br>* Experience working in an agile development&nbsp;&nbsp;<br><br><br><br><br>Why SocialChorus?<br><br>Because you care. About people, the work you do, and the connections you make. Work is such a large part of life, it only makes sense to make it awesome.<br><br>If you want to engage brilliant minds in a true start-up environment where ideas are rewarded regardless of who they come from, join us. This is a rapidly changing space so if you thrive on ambiguity, are hungry for a challenge, and have the guts to speak your mind it could be a perfect fit.<br><br>So come for the challenges, come for the people, and the unlimited PTO, health benefits, 401k plan, casual and friendly environment, and a leadership team who truly believes in your growth both professionally and personally will keep you here.<p>See more jobs at <a rel='nofollow'>Socialchorus</a></p></div></div>"
  },
  {
    "id": "rXadAo7IR3u6PZFmqRK4ug",
    "url": "https://www.workingnomads.co/jobs/senior-perl-developer-full-stack-remote-greystar-solutions",
    "title": "Senior Perl Developer (Full-Stack) Remote",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:perl/other/30",
      "DBG_TECH1:techWeightMap:{python=0, other=30, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 28, 2018 10:54:44 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<p>Greystar had immediate need for a few exceptional Senior Perl Developers to work full-time with staunch determination and take complex data projects from conception to completion through all development and test stages. We are a thriving IT company of 17 years provinding direct sales companies unmatched software and services that transform how they support and manage their organization.</p><p><strong>Job Responsibilities:</strong></p><ul><li>Create and modify new functions for large scale Perl system</li><li>Ability to handle both front and back end development</li><li>Analyze transactions to predict mode and behavior</li><li>Create fully automated system that verifies aspects and pinpoints issues</li><li>Identify and solve other issues for growing system</li></ul><p><strong>Skills Required:</strong></p><ul><li>3+ years of Perl experience in systems/software development</li><li>Strong knowledge of Linux</li><li>Usage of Perl Frameworks helpful but not required</li><li>Experience upgrading Perl versions</li><li>Ability to document findings in clear, concise manner</li><li>Self-motivated with excellent troubleshooting skills</li><li>Abilty to work independently on task with minimal need for management oversight</li><li>Must live in United States and be US citizen</li></ul><p>As mentioned, these postions are full-time remote as company employees. All salary and benefits are negotiable and commensurate with experience.</p>"
  },
  {
    "id": "aToFfKL1Toy3x0FEo4uJDQ",
    "url": "https://remote.co/job/clojure-engineer/",
    "title": "Clojure Engineer",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:clojure/other/35",
      "DBG_TECH1:k/t/w:elixir/other/10",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:jvm/java/13",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=45, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=2, ruby=2, apple=0, java=13, gamedev=0, php=0, embedded=0, frontend=17}",
      "REMOTE1/50",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 28, 2018 6:55:19 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<h2>Clojure Engineer at <span>Aquesst</span></h2><div><span><i></i> Remote</span>        </div><div>            <p><strong>*MUST BE ELIGIBLE TO WORK IN THE US WITHOUT SPONSORSHIP*</strong></p><p>Join a team of Engineers who are forward-thinking, world class and not afraid of cutting-edge technology. They are building and scaling systems that drive our applications and continuously improve our engineering practices. From adopting new frameworks and languages like React and Elixir to implementing machine learning in voice search engines are just some examples of the innovative technology that we use.</p><p>Environment consists of Clojure, Elixir, Ruby, and JavaScript, and are investing heavily in React/Redux. Our client is in the process of completing their move to continuous deployment, leverage micro-services, and invest heavily in creating components that are reusable and provide a framework for our portfolio of sites.</p><p><strong>Apply now if:</strong></p><ul><li>You are a pragmatic Software Engineer who is sold on functional programming and enjoys Clojure, but you’ve also used it and the JVM in anger.</li><li>You’re excited to build backend services of all types, geek our on mentoring and alerting for your apps.</li><li>You enjoy contributing to open source.</li><li>You don’t get to use Clojure Script to build a web UI, you’re going to be perfectly happy, but hey, an occasional internal dashboard might be nice.</li><li>You are looking for an opportunity to&nbsp;<strong>work remotely</strong>&nbsp;but stay connected to your team.</li><li>No, not every Clojure service needs core.async</li><li>Every time you touch existing code, you leave it a little better than you found it</li><li>You use Clojure alphas/betas in your `:dev` profile but in production, you run the latest stable</li><li>You don’t refactor code that doesn’t have test</li><li>You usually pass map, filter, and other sequence functions just one argument, these days</li><li>You seek out feedback on your work</li><li>You give others constructive feedback</li><li>macros &lt; functions &lt; data &lt; code you shouldn’t have written in the first place</li></ul><p><strong>Sound interesting? If so, apply know for your chance to learn more!</strong></p><p><strong>Base Salary: $120-135k</strong></p><p>If you feel you are qualified please send resumes to: matt@aquesst.com</p>        </div><div>        <a href='http://www.aquesst.com/Jobs.html?uID=&amp;ref=Applied Directly&amp;cjobid=AB29863626&amp;rpid=144233&amp;postid=NTwM0c6ByjA' rel='nofollow'>Apply for job</a>    </div>"
  },
  {
    "id": "eNUKTwIXSci2210O5fAKZA",
    "url": "https://weworkremotely.com/remote-jobs/nomnom-insights-clojure-engineer-gmt-5-gmt-1-europe-preferred",
    "title": "NomNom Insights: Clojure Engineer - (GMT-5 - GMT+1, Europe preferred)",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:clojure/other/25",
      "DBG_TECH1:techWeightMap:{python=0, other=25, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 25, 2018 1:29:36 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>  <div>    <h2>Clojure Engineer - (GMT-5 - GMT+1, Europe preferred)</h2>      <h4>Posted Jun 25</h4>    <h3>      <span>NomNom Insights</span><br>      <span>Headquarters: London, UK</span><br>        <a href='https://nomnominsights.com' rel='nofollow'>https://nomnominsights.com</a>      <br>      <a rel='nofollow'>View all NomNom Insights jobs →</a>    </h3>  </div>    </div>  <div>    <div><h2><b>About NomNom</b></h2></div><div>NomNom is a B2B Saas application that helps customer-obsessed professionals learn from their customers faster. We aggregate customer feedback from different sources, making it easy to search, analyze and share it across the business.</div><div><br></div><div>Our team is small and distributed, and our culture is driven by talented individuals who love perfecting their craft. We like scrappy hustlers who are excited about solving hard problems with practical solutions.<br></div><div></div><div></div><div>We help our team members grow in their roles. We encourage and finance continuous learning and development. As part of NomNom, you’ll attend events, improve your skills and explore new ones.<br></div><div></div><div></div><div><span>We have no set hours, as long as your work is getting done, you're free to work whatever schedule suits you. We have a flexible vacation policy - You take the time you need.</span><br></div><div></div><div></div><div><h2><br></h2></div><div><h2><b>About you</b></h2></div><div><br></div><div>We are seeking a Clojure Engineer to help us shape and execute our product roadmap. This is an opportunity to join a brilliant team and demonstrate your ability to learn fast and scale an early stage product. As the ideal candidate for this job, you’ll have had previous experience working at startups and feel comfortable in a self-managed environment.</div><div>As a fully distributed team, we rely on the following tools for collaboration; GitHub, Slack, Trello, Status Hero, and Zoom. Each commit we push is tested in CircleCI, and we review all pull requests.<br></div><div></div><div></div><div>Our frontend talks to a suite of services written in Clojure, backed by Postgres, RethinkDB, Redis, Elasticsearch, and RabbitMQ. Each service is deployed as a Docker container and is running in Google Cloud. We manage our infrastructure with Terraform and Ansible.<br></div><div></div><div></div><div>We deploy our code several times a day, with one command.</div><div><br></div><div><h3>Required knowledge and experience</h3></div><ul><li>Practical experience of working with Clojure - your code made it to production and served customers at any scale.</li><li>Demonstratable knowledge of Postgres</li><li>Familiarity with RabbitMQ, Elasticsearch is a big plus</li><li>Proficiency in English - both written and spoken</li></ul><div><h3>Desirable knowledge and experience</h3></div><ul><li>Experience in managing operations and monitoring (or willing to learn such skills)</li><li>Experience of working with document databases such as RethinkDB or MongoDB</li></ul><div><h3>Salary and Perks</h3></div><div>Budget allowance for professional development (up to $1,000)<br></div><div></div><div></div><div>Pick your equipment<br></div><div></div><div></div><div>FancyHands.com access<br></div><div></div><div></div><div>Salary range: $40k - $52k USD</div><div><br></div><div>To get started, apply now.</div><div><br></div><div><span>Important</span>:&nbsp;<em>NomNom does not work with outsourcing firms, staffing agencies or recruiters. We only accept direct applications.</em></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://nomnom.recruiterbox.com/jobs/fk01x2h/' rel='nofollow'>https://nomnom.recruiterbox.com/jobs/fk01x2h/</a></p>  </div>"
  },
  {
    "id": "r_qkP7CSRaWlwq_10spVfQ",
    "url": "https://stackoverflow.com/jobs/156020/security-expert-wallethub?a=Qk6up1ny6Xu",
    "title": "Security Expert at Wallethub  ",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``OR(&quot;not&quot;,no) 3W locat W requir",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:perl/other/5",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=2, other=5, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=2, ruby=2, apple=0, java=2, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other",
      "php"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 20, 2018 1:08:14 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior, Lead</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Backend Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Personal Finance</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>penetration-testing</a><a rel='nofollow'>security</a><a rel='nofollow'>java</a>                    </div>                                            <h2>Job description</h2>                <div><p><strong>Note:&nbsp;</strong>This position does not have a location requirement and can be performed either remotely (including from outside the U.S.) or from WalletHub’s offices in downtown Washington, D.C.</p><p><strong>Company details</strong></p><p>WalletHub is one of the leading personal finance destinations in the US. We're looking for a motivated and experienced Security Expert for a full-time, permanent, remote position.</p><p><strong>Ideal Candidate</strong></p><p>You are the ideal candidate for this job if you have:</p><ul><li>Hands on experience in Vulnerability assessment and Penetration testing</li><li>Experience with one or more scripting languages (e.g. Perl, Python, PHP, Ruby)</li><li>Experience developing Java based applications</li><li>Solid knowledge of Cryptography</li><li>Experience in Ethical Hacking of web applications and networked infrastructure</li><li>Experience in web application development and/or code auditing</li><li>Experience in systems engineering with Linux systems is a plus</li><li>Very good English</li></ul><p><strong>Responsibilities</strong></p><ul><li>Perform security architecture review of the full stack and ensure that we are always ahead of potential threats</li><li>Perform manual security testing and source code auditing for various technologies</li><li>Handle penetration testing targeting critical data, services and environments and develop scalable test strategies</li><li>Report underlying security issues and propose enhanced security protections</li><li>Work proactively with product teams throughout the development cycle and integrate the best security practices</li><li>Research vulnerability on our systems and develop security tools automating complex tasks</li><li>Have a hands-on role in building security solutions as well as improving existing ones</li></ul><p><strong>Our Offer</strong></p><ul><li>Very competitive salary based on skills and prior experience</li><li>Potential for stock options after the first year</li><li>Raise and advancement opportunities based on periodic evaluations</li><li>Visa sponsorship (if outside the US sponsorship is granted after 18 months with the company, based on performance)</li></ul><p><strong>More about WalletHub</strong></p><p>WalletHub is a high-growth fintech company based in Washington, D.C. that is looking for talented, hard-working individuals to help us reshape personal finance. More specifically, we are harnessing the power of data analytics and artificial intelligence to build the brain of a smart financial advisor, whose services we’re offering to everyone for free. The WalletHub brain enables users to make better financial decisions in a fraction of the time with three unique features:</p><p>1) Customized Credit-Improvement Tips: WalletHub identifies improvement opportunities and guides you through the necessary corrections.</p><p>2) Personalized Money-Saving Advice: WalletHub’s savings brain constantly scours the market for load-lightening opportunities, bringing you only the best deals.</p><p>3) Wallet Surveillance: Personal finance isn’t as scary with 24/7 credit monitoring providing backup, notifying you of important credit-report changes.</p><p>In addition to the valuable intelligence the brain provides, WalletHub is the first and only service to offer free credit scores and full credit reports that are updated on a daily basis absent of user interaction, rather than weekly or monthly and only when a user logs in. Some other services hang their hats on free credit scores and reports, yet they’re still inferior to what WalletHub considers minor pieces to a much larger puzzle.</p><p><strong>How to Apply</strong><br><br>To get our attention, all you need to do is send us a resume. If we believe that you will be a good match, we'll contact you to arrange the next steps. You can&nbsp;Easy Apply&nbsp;here or email your application to&nbsp;<a href='mailto:jobs.dev@wallethub.com' rel='nofollow'>jobs.dev@wallethub.com</a></p>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://stackoverflow.com/jobs/apply/156020?reset=False&amp;ra=Qk6up1ny6Xu&amp;oqs=a%3DQk6up1ny6Xu' rel='nofollow'>Apply now</a></div>                                                <div>                                                    <a rel='nofollow'>Ask a question</a>                                                                                                        </div>                                    </div>                        </div>        </div>            <h2>About Wallethub</h2>            <div><p>WalletHub helps all consumers reach top financial fitness by providing:<br><br>• Free credit scores and credit reports that are updated on a daily basis.<br><br>• Free 24/7 credit monitoring and personalized advice that will help you improve your credit and save money. <br><br>• More reviews on financial products, professionals and companies than any other website.<br><br>• An extensive education center coupled with the ability to ask financial experts your money-related questions for free .</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Stock options</span>                            </li>                            <li>                                <span></span>                                <span>Health benefits</span>                            </li>                            <li>                                <span></span>                                <span>Work visa sponsorship</span>                            </li>                            <li>                                <span></span>                                <span>Competitive salary</span>                            </li>                            <li>                                <span></span>                                <span>Work from home</span>                            </li>                    </ul>                "
  },
  {
    "id": "4lT4MnliRBqMsL9RkL-45w",
    "url": "https://stackoverflow.com/jobs/190589/experienced-microservices-engineer-100-remote-citrusbyte?a=11UTpcdnHFe0",
    "title": "Experienced Microservices Engineer - 100% Remote at Citrusbyte (Indianapolis, IN) ",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=2, go=3, nodejs=1, bigdata-ml=0, ruby=4, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java",
      "other",
      "ruby"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 80000,
      "maxValue": 130000,
      "info": "",
      "unit": "YEAR",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 20, 2018 1:08:14 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior, Lead, Manager</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Backend Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Software Development, Web Design</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>ruby</a><a rel='nofollow'>java</a><a rel='nofollow'>apache-kafka</a><a rel='nofollow'>rabbitmq</a><a rel='nofollow'>microservices</a>                    </div>                                            <h2>Job description</h2>                <div><p>Citrusbyte&nbsp;is a software consultancy that believes in&nbsp;simplicity as a core priority in software design. We build custom systems for both startups and enterprises - You can see our&nbsp;<a href='https://citrusbyte.com/portfolio' rel='nofollow'>portfolio</a>&nbsp;for more information about our clients.</p><p>We have offices in Los Angeles and New York, but we work remotely with people from all around the world.</p><p>Our engineers have experience in a consultative environment, excellent communication skills and a desire to work with talented teams building innovative products. We work closely with our clients, sharing our experience and processes to help them define and create their products.</p><p>We are looking for&nbsp;experienced backend engineers with&nbsp;experience building <strong>service-oriented architectures</strong>, using tools like <strong>Kafka</strong> and RabbitMQ and&nbsp;having experience with languages such as Java, Ruby, Elixir, Go, JavaScript.</p><p>Job Requirements:</p><ul><li>Proficient in Ruby or Java and at least one other programming language.</li><li>Proficient with Kafka.</li><li>Experience building&nbsp;service-oriented&nbsp;architectures.</li><li>Experience as a software consultant.</li><li>Experience working remotely in a distributed company</li><li>Open-minded&nbsp;and demonstrates a passion for continuous learning.</li><li>Smart, gets things done.</li></ul>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://citrusbyte.applytojob.com/apply/yO2gVYWNF7/Experienced-Microservices-Engineer?source=stackoverflow' rel='nofollow'>                        Apply now        </a></div>                                    </div>                        </div>        </div>            <h2>About Citrusbyte</h2>            <div><p><strong><a href='https://citrusbyte.com/' rel='nofollow'>Citrusbyte</a></strong>&nbsp;is a software consultancy that believes in using simple tools to solve all types of problems. Our teams&nbsp;work closely with clients to create products of great quality and improve existing ones. We have considerable experience building custom systems for both startups and enterprises - check out our <a href='https://citrusbyte.com/portfolio' rel='nofollow'>portfolio</a>&nbsp;for more information about our clients.</p><p>We strongly advocate minimalism and this is represented in the tools we choose to work with. Every team gets to decide their own stack depending on the requirements of the project.</p><p>Our main offices are in Los Angeles and New York, but we work remotely with people from all around the world.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Open Vacation Policy</span>                            </li>                            <li>                                <span></span>                                <span>Hardware</span>                            </li>                            <li>                                <span></span>                                <span>Health, Vision, Dental Benefits</span>                            </li>                            <li>                                <span></span>                                <span>Fitness Reimbursement Program</span>                            </li>                            <li>                                <span></span>                                <span>Flexible Work Hours</span>                            </li>                            <li>                                <span></span>                                <span>Paternity &amp; Maternity Leave</span>                            </li>                            <li>                                <span></span>                                <span>Education Allowance</span>                            </li>                            <li>                                <span></span>                                <span>Conference Assistance</span>                            </li>                            <li>                                <span></span>                                <span>Annual Company Retreat</span>                            </li>                    </ul>                "
  },
  {
    "id": "R_BDrYfvQDK4OOZXhQ5e0Q",
    "url": "http://www.indeed.com/viewjob?t=Perl+Developer&jk=d0033e609e1340c4&",
    "title": "Perl Developer - Brooksource - Green Bay, WI",
    "tags": [
      "DBG:surround``4N( OR(look, search),     4N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:perl/other/40",
      "DBG_TECH1:techWeightMap:{python=0, other=40, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=4}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 18, 2018 6:26:20 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<h3>Perl Developer</h3><div>Company: Brooksource<br></div><div>Location: Green Bay, WI<br></div><div>Contract<br><br></div><span><div><p>Sr. Perl Developer</p><p>Remote</p><p>Brooksource is searching for a Sr. Perl Developer who will be responsible for backend and web interface programming for an internal database driven web application that connects multiple systems used for internal operations. The position requires primarily Perl/web development work, but the candidate must be very proficient with SQL and able to author complex queries for reporting purposes. The applicant should be prepared to participate in decision-making on broader information architecture and design questions. What are we looking for?</p><ul><li>Extreme proficiency in Object Oriented Perl programming for both system administration and web applications</li><li>Proficiency with the following Perl Modules: DBI, DBD::Oracle, Date, HTML::Template, LWP, CGI, JSON</li><li>Ability to write own Perl Modules and subroutine packages</li><li>Solid understanding of multidimensional data structures, references, regular expressions</li><li>Extreme proficiency in SQL</li><li>Solid understanding of database concepts: keying, subquerying, triggers, stored procedures</li><li>Strong experience in command line Unix/Linux environments</li><li>Ability to read the manual and self-teach</li><li>Ability to quickly read and understand legacy code.</li><li>Ability to write Oracle PL/SQL triggers, functions, stored procedures</li><li>Strong experience in front-end development - CSS, HTML, javascript.</li></ul></div></span>"
  },
  {
    "id": "rt4GDCgTQIetI_ALY-q_Fw",
    "url": "https://weworkremotely.com/remote-jobs/seated-ember-elixir-full-stack-web-developer",
    "title": "Seated: Ember & Elixir Full Stack Web Developer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:elixir/other/30",
      "DBG_TECH1:k/t/w:ember.js/frontend/40",
      "DBG_TECH1:k/t/w:ruby-developer/ruby/13",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=30, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=15, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=40}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 13, 2018 9:06:58 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>  <div>    <h2>Ember &amp; Elixir Full Stack Web Developer</h2>      <h4>Posted Jun 13</h4>    <h3>      <span>Seated</span><br>      <span>Headquarters: New York City</span><br>        <a href='https://www.seated.com' rel='nofollow'>https://www.seated.com</a>      <br>      <a rel='nofollow'>View all Seated jobs →</a>    </h3>  </div>    </div>  <div>    <div>Seated is a music ticketing company founded to completely change the experience of buying tickets to high demand events. We aim to remove the frustration from the buying process, identify scalpers and put tickets in the hands of true fans. We work directly with artists and ensure they are involved at every stage.<br></div><div></div><div><br></div><div>We've already launched with some great early partners including Leon Bridges, Death Cab for Cutie, Christina Aguilera, Robert Plant, Nathaniel Rateliff and others.<br></div><div></div><div><br></div><div><strong>Role</strong><br></div><div></div><div><strong><br></strong></div><div>We are looking for a full stack web developer who can build features across the the frontend and backend and as needed. Overtime this role will grow and could become more specialised as the team expands or as interests change.<br></div><div></div><div><br></div><div><strong>Tech</strong><br></div><div></div><div><strong><br></strong></div><div>We run multiple Ember apps in the frontend for buying tickets and for administration. This is all backed by an Elixir Phoenix JSON API running on Heroku and Postgres.<br></div><div></div><div><br></div><div><strong>Requirements</strong><br></div><div></div><div><strong><br></strong></div><div>The ideal candidate will have both experience in building frontend Ember applications and backend Elixir APIs. We are open to candidates who only have one of these skills and would like to learn about the other. See more below.<br></div><div></div><div><br></div><div><strong>The role is 100% remote.</strong>&nbsp;Work wherever makes you the most productive. The founders are currently based in NYC so&nbsp;<strong>crossover with ET is required (the Americas and Western Europe)</strong>. Fluency in English is required.<br></div><div></div><div><br></div><div><strong>Team</strong><br></div><div></div><div><strong><br></strong></div><div>Seated was founded by people passionate about making a better experience for fans and we believe having a happy and productive team is the best way to achieve that. We are a remote first company and will try to accommodate most working preferences. We do daily video hangouts and face to face company meetups several times a year.<br></div><div></div><div><br></div><div>As a developer at Seated you’ll be working closely with the founders to impact the product roadmap and technical direction. We operate a flat and open structure so you will have a ton of influence.<br></div><div></div><div><br></div><div>If you are a Ruby developer looking to get started with Elixir, or maybe an Elixir developer who is looking to learn Ember then you will have ample time and support to round out your skills. We also have the budget for conferences and training as needed.<br></div><div></div><div><br></div><div><strong>To apply please email&nbsp;<a href='mailto:jobs@seated.com' rel='nofollow'>jobs@seated.com</a>&nbsp;with the following</strong><br></div><div></div><ul><li>CV/resume</li><li>Intro/cover letter</li><li>Links to recent work or work you are proud of</li><li>Your location</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='mailto:jobs@seated.com' rel='nofollow'>jobs@seated.com</a></p>  </div>"
  },
  {
    "id": "lDb_OQelQZq-zJgrFN4dzA",
    "url": "https://weworkremotely.com/remote-jobs/ello-back-end-developer-ruby-elixir",
    "title": "Ello: Back End Developer (Ruby & Elixir)",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:elixir/other/40",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:kotlin/mobile/5",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:k/t/w:ruby/ruby/10",
      "DBG_TECH1:k/t/w:swift/apple/5",
      "DBG_TECH1:k/t/w:swift/mobile/8",
      "DBG_TECH1:techWeightMap:{python=0, other=40, dotnet=0, c=0, mobile=17, go=3, nodejs=0, bigdata-ml=0, ruby=18, apple=7, java=1, gamedev=0, php=0, embedded=0, frontend=16}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 12, 2018 3:47:54 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>  <div>    <h2>Back End Developer (Ruby &amp; Elixir)</h2>      <h4>Posted Jun 12</h4>    <h3>      <span>Ello</span><br>      <span>Headquarters: Boulder, CO</span><br>        <a href='https://ello.co/wtf/resources/back-end-dev/' rel='nofollow'>https://ello.co/wtf/resources/back-end-dev/</a>      <br>      <a rel='nofollow'>View all Ello jobs →</a>    </h3>  </div>    </div>  <div>    <div><b>Highlights</b></div><div><br></div><ul><li>Elixir and Ruby APIs<br></li><li>Remote (in North America)<br></li><li>2 years experience suggested<br></li><li>Open Source (mostly)<br></li><li>Bonus for iOS, Android, or React experience<br></li><li>Inspiring Art, Passionate Community<br></li><li>Millions of post impressions a day</li></ul><div><span><br></span></div><div><span><b>What we are looking for</b></span></div><div><br></div><div>Ello is looking for an experienced&nbsp;back-end&nbsp;developer to work on the&nbsp;ello.co APIs. While most of our high volume requests are served by Elixir, we are still in the process of porting the rest of our endpoints away from Ruby to Elixir - you should be comfortable with both.</div><div><br></div><div>Our API serves millions of posts a day - and has to handle everything that goes along with that scale. We have been building all our new APIs in Elixir, and porting everything else to Elixir/GraphQL as time allows. We also have some extremely exciting technical challenges ahead that we need help with.</div><div><br></div><div>You can check out our open source&nbsp;repos&nbsp;at https://github.com/ello.</div><div><br></div><div><b>About Ello</b></div><div><br></div><div>Ello is the Creators Network. Our mission is to provide Artists, Writers, Photographers and other creators with opportunities to build their reputation and get paid. Every day Ello serves millions of views to our passionate community - your work at Ello will matter.</div><div><br></div><div>You can learn more about Ello, including our stance on privacy and user data on our help site https://ello.co/wtf/, also make sure to poke around https://ello.co and check out some cool art.</div><div><br></div><div><b>Working at Ello</b></div><div><br></div><div>Ello is a small, distributed team of experienced designers and engineers. We work US hours and collaborate via Slack and Github. Most of our software is developed in the open as public repositories under an MIT license (except our Rails API).</div><div><br></div><div>Ello is built with modern technology, React/Redux, Kotlin, and Swift on the front ends, Ruby, Elixir and Go on the back end. We deploy frequently (except not on Fridays) to Heroku and AWS.</div><div><br></div><div>Our routine consists of:</div><div><br></div><ul><li>Daily “standup” slack messages following the standard scrum format<br></li><li>Daily “watercooler&quot; calls where we just chat about casual topics<br></li><li>Weekly planning meetings<br></li><li>Bi-weekly retrospectives<br></li><li>Weekly cross-department standups<br></li><li>Planning is collaborative - some of our most successful features and initiatives have been proposed by the dev team.<br></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please send an email to <a href='mailto:alan@ello.co' rel='nofollow'>alan@ello.co</a>, subject: &quot;Back End Developer&quot;.Please include a resume, any applicable code samples, and any relevant social links you would like to share.</p>  </div>"
  },
  {
    "id": "pTdXPVPERRejo3Pgq2Q-tg",
    "url": "https://remote.com/jobs/browse/preview/clojurescript-developer-1",
    "title": "ClojureScript developer",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG:surround``OR(partial,share,amen,semi) 3W remot",
      "DBG_TECH1:k/t/w:clojure/other/15",
      "DBG_TECH1:k/t/w:clojurescript/other/10",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:sass/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=25, dotnet=0, c=0, mobile=0, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=18}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 8, 2018 12:28:11 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "JOB TYPE: Full time<br /><br />LOCATION: <br />Barcelona, Spain<br /> (Partial remote)<br /><br />Anywhere in<br />Barcelona<br /><br /><br />EXPERIENCE: intermediate<br /><br />COMPANY: GreenPowerMonitor; 0-25 employees; 0-25% remote;<br /><br />SKILLS: <br />• Clojure<br />• SASS<br />• Javascript<br /><br />Be part of our clojure development team to build our GPM Horizon project.<br /><br />Duties may include (depending on experience):<br /><br />Analyse and propose architectures from a performance and minimum response time perspective<br />Follow and embrace SOLID patterns<br />Implement unit tests<br />Estimate developer tasks and participate in the design of new functionalities<br />Expose and discuss about technology with other developers<br /><br />Position Qualifications<br />Previous experience working on Clojure projects - preferably 1-2 years<br />Comfortable with macro development and Repl usage  <br />Experience and knowledge of CSS and Core.Async<br />Knowledge and experience in unit testing with cljstest   <br />Familiarity with Templating in hiccup or sablono   <br />Good understanding of framework such as OM and React<br />Knowledge of other modern JS frameworks favouring functional approaches would be an asset<br />Experience with building front-end for web applications using Clojurescript would be a strong asset<br />Experience in Web development would be a plus<br />Good communication skills, including the ability to write clear and accurate reports in English<br />Enthusiasm and self-motivation, including a willingness to develop and enjoy taking challenges and responsibilities<br />Customer centricity and business development experience"
  },
  {
    "id": "MBEjZcZSQQS0TSVEYcepZw",
    "url": "http://jobs.github.com/positions/4be6e340-6a96-11e8-90a8-161f76f849b1",
    "title": "Full Time: Experienced Ruby / Elixir Developer at Cultivate Software Ltd in Edinburgh or Remote",
    "tags": [
      "DBG:surround``4N( OR(look, search),     4N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:elixir/other/15",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:k/t/w:rust/other/5",
      "DBG_TECH1:k/t/w:scala/java/3",
      "DBG_TECH1:techWeightMap:{python=0, other=20, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=4, apple=0, java=3, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 8, 2018 12:04:54 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<p>We’re looking for an experienced developer, either remote (within the UK) or at our Edinburgh office. If you’re interested in working with a team that strives for the highest level of technical excellence and wants to build the right solutions for our clients, we would love to hear from you.  </p><p>As a consultancy, we partner with a range of different clients including startups, enterprises, public sector and charities. Our work is predominantly in Ruby, but we are very excited about Elixir. We've used Elixir on a number of projects and are actively looking for opportunities to do more. We also work with other languages including Rust, Go and Scala.</p><p>Where relevant and as much as possible we practice test driven development, code reviews and pair programming. We value empathy and respect, quality, professionalism, honesty, shared ownership, simplicity, and sustainability.</p><p>You can find more information here: <a href='https://cultivatehq.com/jobs/' rel='nofollow'>https://cultivatehq.com/jobs/</a></p>"
  },
  {
    "id": "zMya78ENTAqCUvWnr6Zqig",
    "url": "https://news.ycombinator.com/item?id=17245593",
    "title": "Binary.com | Software Engineers | Malaysia | Onsite/Remote | www.binary.com",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:ajax/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:perl/other/5",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=2, other=5, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=4}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/other",
      "TECH1/php",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "other",
      "php"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 6, 2018 1:00:08 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                  <span>Binary.com | Software Engineers | Malaysia | Onsite/Remote | www.binary.com<p>Binary.com is an award-winning leader in online binary options trading. Launched in 2000, the Binary.com platform allows you to trade currencies, stocks, indices, and commodities. Today, we have more than one million registered clients from around the world with a recorded turnover of over USD 4.6 billion since we started operating.</p><p>At Binary.com, we offer our IT staff the best possible working conditions to help them advance in their careers. This means flexible working hours, a casual dress code, and the best equipment available. We provide each of our engineers with a high-end MacBook laptop, and use only the newest and best equipment in our production server environment. We customised a purpose-built office, designed to provide our engineers with a comfortable and productive workspace.</p><p>We are looking for talented Software Engineers, including:</p><p>- Front-end Developers (Javascript, AJAX, Json)</p><p>- Back-end Developers (Python, PHP, Ruby)</p><p>- Perl Developers</p><p>- Blockchain Developers</p><p>- DevOps Engineers (Chef)</p><p>- Database Administrators (PostgreSQL)</p><p>You may also visit our career page: <a href='https://www.binary.com/en/careers.html' rel='nofollow'>https://www.binary.com/en/careers.html</a> to know more! And submit your applications to hr@binary.com if you are interested.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>"
  },
  {
    "id": "wfWX-yVFRW60hIZk-yNDXw",
    "url": "http://jobmote.com/jobs/12348-microservices-engineer",
    "title": "Microservices Engineer",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=2, go=3, nodejs=1, bigdata-ml=0, ruby=4, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java",
      "other",
      "ruby"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 5, 2018 8:24:52 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Microservices Engineer - Jobmote<div><div><h2>Microservices Engineer</h2><h5>Citrusbyte</h5></div></div><div><div><div><div></div></div><div><div><div><p><a href='https://citrusbyte.com/' rel='nofollow'>Citrusbyte</a> is a software consultancy that believes in simplicity as a core priority in software design. We build custom systems for both startups and enterprises - You can see our <a href='https://citrusbyte.com/portfolio' rel='nofollow'>portfolio</a> for more information about our clients.</p><p>We have offices in Los Angeles and New York, but we work remotely with people from all around the world.</p><p>Our engineers have experience in a consultative environment, excellent communication skills and a desire to work with talented teams building innovative products. We work closely with our clients, sharing our experience and processes to help them define and create their products.</p><p>We are looking for experienced backend engineers with experience building service-oriented architectures, using tools like <strong>Kafka</strong> and having experience with languages such as Java, Ruby, Elixir, Go, JavaScript.</p><h4>Job Requirements:</h4><ul><li>Proficient in Ruby or Java and at least one other programming language.</li><li>Proficient with <strong>Kafka</strong>.</li><li>Experience building service-oriented architectures.</li><li>Experience as a software consultant.</li><li>Experience working remotely in a distributed company</li><li>Open-minded and demonstrates a passion for continuous learning.</li><li>Smart, gets things done.</li></ul></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>"
  },
  {
    "id": "3lnPIYkZQgCVHsHx7JM43w",
    "url": "https://weworkremotely.com/remote-jobs/citrusbyte-microservices-engineer",
    "title": "Citrusbyte: Microservices Engineer",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=2, go=3, nodejs=1, bigdata-ml=0, ruby=4, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java",
      "other",
      "ruby"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 5, 2018 6:13:00 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>  <div>    <h2>Microservices Engineer</h2>      <h4>Posted Jun  5</h4>    <h3>      <span>Citrusbyte</span><br>      <span>Headquarters: Los Angeles</span><br>        <a href='https://citrusbyte.com' rel='nofollow'>https://citrusbyte.com</a>      <br>      <a rel='nofollow'>View all Citrusbyte jobs →</a>    </h3>  </div>    </div>  <div>    <div>Citrusbyte&nbsp;is a software consultancy that believes in&nbsp;simplicity as a core priority in software design. We build custom systems for both startups and enterprises - You can see our&nbsp;<a href='https://citrusbyte.com/portfolio' rel='nofollow'>portfolio</a>&nbsp;for more information about our clients.</div><div><br></div><div>We have offices in Los Angeles and New York, but we work remotely with people from all around the world.</div><div><br></div><div>Our engineers have experience in a consultative environment, excellent communication skills and a desire to work with talented teams building innovative products. We work closely with our clients, sharing our experience and processes to help them define and create their products.</div><div><br></div><div>We are looking for&nbsp;experienced backend engineers with&nbsp;experience building&nbsp;<span>service-oriented architectures</span>, using tools like&nbsp;<span>Kafka</span>&nbsp;and RabbitMQ and&nbsp;having experience with languages such as Java, Ruby, Elixir, Go, JavaScript.</div><div><br></div><div><span>Job Requirements:</span><br></div><ul><li>Proficient in Ruby or Java and at least one other programming language.</li><li>Proficient with&nbsp;<span>Kafka</span>.</li><li>Experience building&nbsp;service-oriented&nbsp;architectures.</li><li>Experience as a software consultant.</li><li>Experience working remotely in a distributed company</li><li>Open-minded&nbsp;and demonstrates a passion for continuous learning.</li><li>Smart, gets things done.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>You can apply directly at our career page: <a href='http://careers.citrusbyte.com/apply/yO2gVYWNF7/Experienced-Microservices-Engineer?source=wwr' rel='nofollow'>http://careers.citrusbyte.com/apply/yO2gVYWNF7/Experienced-Microservices-Engineer?source=wwr</a></p>  </div>"
  },
  {
    "id": "5g0Yq7f1Q8WXUBx5Zr_Hlw",
    "url": "http://jobs.github.com/positions/448acf4c-686d-11e8-8811-4cdaadd9edb8",
    "title": "Full Time: Microservices Engineer at Citrusbyte in Remote within USA",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=2, go=3, nodejs=1, bigdata-ml=0, ruby=4, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java",
      "other",
      "ruby"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 5, 2018 6:05:59 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<p><a href='https://citrusbyte.com/' rel='nofollow'>Citrusbyte</a> is a software consultancy that believes in simplicity as a core priority in software design. We build custom systems for both startups and enterprises - You can see our <a href='https://citrusbyte.com/portfolio' rel='nofollow'>portfolio</a> for more information about our clients.</p><p>We have offices in Los Angeles and New York, but we work remotely with people from all around the world.</p><p>Our engineers have experience in a consultative environment, excellent communication skills and a desire to work with talented teams building innovative products. We work closely with our clients, sharing our experience and processes to help them define and create their products.</p><p>We are looking for experienced backend engineers with experience building service-oriented architectures, using tools like <strong>Kafka</strong> and having experience with languages such as Java, Ruby, Elixir, Go, JavaScript.</p><h3>Job Requirements:</h3><ul><li>Proficient in Ruby or Java and at least one other programming language.</li><li>Proficient with <strong>Kafka</strong>.</li><li>Experience building service-oriented architectures.</li><li>Experience as a software consultant.</li><li>Experience working remotely in a distributed company</li><li>Open-minded and demonstrates a passion for continuous learning.</li><li>Smart, gets things done.</li></ul>"
  },
  {
    "id": "JIFnGAvgTseotZNGjwi9Iw",
    "url": "https://news.ycombinator.com/item?id=17209823",
    "title": "Aclaimant | Remote, North America | Junior to Mid Full-stack developer | https://aclaimant.com/careers-developer Aclaimant is changing the way companies manager ...",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:clojure/other/5",
      "DBG_TECH1:k/t/w:clojurescript/other/5",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 1, 2018 11:26:06 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                  <span>Aclaimant | Remote, North America | Junior to Mid Full-stack developer | <a href='https://aclaimant.com/careers-developer' rel='nofollow'>https://aclaimant.com/careers-developer</a><p>Aclaimant is changing the way companies manager their risk. We're building a platform to actively manage workplace incidents and claims. We are small team that works entirely remotely. In order to make this work we rely heavily on pair-programming. Our tech stack consists of Clojure and ClojureScript. For more information view our careers page (<a href='https://aclaimant.com/careers-developer' rel='nofollow'>https://aclaimant.com/careers-developer</a>) or email jobs@aclaimant.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>"
  },
  {
    "id": "d9wBqAKwSZmHZ5IzBDVvaA",
    "url": "https://news.ycombinator.com/item?id=17208669",
    "title": "Circonus | Software Engineer | Remote | Full-time | https://www.circonus.com/",
    "tags": [
      "DBG:surround``OR(you,we,employe,develop,engin,abl,workmat) 2W work 2W from 2W home",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:jquery/frontend/8",
      "DBG_TECH1:k/t/w:perl/other/10",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:sass/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=10, dotnet=0, c=13, mobile=1, go=6, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=14}",
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 1, 2018 9:47:06 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                  <span>Circonus | Software Engineer | Remote | Full-time | <a href='https://www.circonus.com/' rel='nofollow'>https://www.circonus.com/</a><p>Circonus is a software company that is changing the way the world monitors both IT infrastructure and the business it powers. Our SaaS and On-­Premise solutions enable companies to combine monitoring, alerting, event processing, and predictive analytics into a unified solution. Visualize any data, in any application, from any system, in real ­time.</p><p>Listen to one of our CEO Theo's talks to get an idea of what Circonus does: <a href='https://www.youtube.com/watch?v=qh4hLIWqw6Q' rel='nofollow'>https://www.youtube.com/watch?v=qh4hLIWqw6Q</a></p><p>We are a 100% distributed and remote company, mostly across the US as well as Europe. You are also welcome to work from the Maryland office; most employees work from home.</p><p>We build web software using technologies such as C, C++, Lua, Java, Ruby, Go, Perl, JavaScript, jQuery, HTML, Scss</p><p>We're looking a server-side and systems tools developer that has equal experience with Perl and Go, who also has strong knowledge and experience with a RDBMS (PostgreSQL preferred) <a href='https://jobs.lever.co/circonus/0d485785-a66d-4de5-897e-969256caa9b7' rel='nofollow'>https://jobs.lever.co/circonus/0d485785-a66d-4de5-897e-96925...</a></p><p>All of our positions include a discretionary PTO policy, health insurance, gym reimbursement, a generous 401K, the opportunity for a bonus and more.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>"
  },
  {
    "id": "sj8nZ0G5QHKwLfZmcoUejQ",
    "url": "https://news.ycombinator.com/item?id=17207971",
    "title": "Weever Apps | Haskell Developer | Hamilton, ON CA | Full-time, REMOTE OK | https://weeverapps.com",
    "tags": [
      "DBG:surround``remot 16W timezon",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:haskell/other/15",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 1, 2018 8:47:14 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                  <span>Weever Apps | Haskell Developer | Hamilton, ON CA | Full-time, REMOTE OK | <a href='https://weeverapps.com' rel='nofollow'>https://weeverapps.com</a><p>We're developing a workforce automation solution for regulated industries in the food and drug manufacturing sectors.</p><p>Our stack consists of: <i>Haskell</i>, <i>TLA+</i>, <i>GraphQL</i>, <i>Web Sockets</i>, <i>PostgreSQL</i>, <i>Docker</i></p><p>The system architecture is built around event-sourcing and CQRS.</p><p>Please see our full listing for more details:</p><p><a href='https://weeverapps.com/jobs/haskell-developer/' rel='nofollow'>https://weeverapps.com/jobs/haskell-developer/</a></p><p><i>Update</i></p><p>For remote candidates, some overlap with EST/EDT is preferred as it is our primary time zone.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>"
  },
  {
    "id": "Q2zyWZXESqGZ2cIG6e_dPQ",
    "url": "https://stackoverflow.com/jobs/190589/experienced-microservices-engineer-citrusbyte?a=11UTpcdnHFe0",
    "title": "Experienced Microservices Engineer at Citrusbyte (Indianapolis, IN) ",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=2, go=3, nodejs=1, bigdata-ml=0, ruby=4, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java",
      "other",
      "ruby"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 1, 2018 7:40:45 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior, Lead, Manager</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Backend Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Software Development, Web Design</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>ruby</a><a rel='nofollow'>java</a><a rel='nofollow'>apache-kafka</a><a rel='nofollow'>rabbitmq</a><a rel='nofollow'>microservices</a>                    </div>                                            <h2>Job description</h2>                <div><p>Citrusbyte&nbsp;is a software consultancy that believes in&nbsp;simplicity as a core priority in software design. We build custom systems for both startups and enterprises - You can see our&nbsp;<a href='https://citrusbyte.com/portfolio' rel='nofollow'>portfolio</a>&nbsp;for more information about our clients.</p><p>We have offices in Los Angeles and New York, but we work remotely with people from all around the world.</p><p>Our engineers have experience in a consultative environment, excellent communication skills and a desire to work with talented teams building innovative products. We work closely with our clients, sharing our experience and processes to help them define and create their products.</p><p>We are looking for&nbsp;experienced backend engineers with&nbsp;experience building <strong>service-oriented architectures</strong>, using tools like <strong>Kafka</strong> and RabbitMQ and&nbsp;having experience with languages such as Java, Ruby, Elixir, Go, JavaScript.</p><p>Job Requirements:</p><ul><li>Proficient in Ruby or Java and at least one other programming language.</li><li>Proficient with Kafka.</li><li>Experience building&nbsp;service-oriented&nbsp;architectures.</li><li>Experience as a software consultant.</li><li>Experience working remotely in a distributed company</li><li>Open-minded&nbsp;and demonstrates a passion for continuous learning.</li><li>Smart, gets things done.</li></ul>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://citrusbyte.applytojob.com/apply/yO2gVYWNF7/Experienced-Microservices-Engineer?source=stackoverflow' rel='nofollow'>                        Apply now        </a></div>                                    </div>                        </div>        </div>            <h2>About Citrusbyte</h2>            <div><p><strong><a href='https://citrusbyte.com/' rel='nofollow'>Citrusbyte</a></strong>&nbsp;is a software consultancy that believes in using simple tools to solve all types of problems. Our teams&nbsp;work closely with clients to create products of great quality and improve existing ones. We have considerable experience building custom systems for both startups and enterprises - check out our <a href='https://citrusbyte.com/portfolio' rel='nofollow'>portfolio</a>&nbsp;for more information about our clients.</p><p>We strongly advocate minimalism and this is represented in the tools we choose to work with. Every team gets to decide their own stack depending on the requirements of the project.</p><p>Our main offices are in Los Angeles and New York, but we work remotely with people from all around the world.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Open Vacation Policy</span>                            </li>                            <li>                                <span></span>                                <span>Hardware</span>                            </li>                            <li>                                <span></span>                                <span>Health, Vision, Dental Benefits</span>                            </li>                            <li>                                <span></span>                                <span>Fitness Reimbursement Program</span>                            </li>                            <li>                                <span></span>                                <span>Flexible Work Hours</span>                            </li>                            <li>                                <span></span>                                <span>Paternity &amp; Maternity Leave</span>                            </li>                            <li>                                <span></span>                                <span>Education Allowance</span>                            </li>                            <li>                                <span></span>                                <span>Conference Assistance</span>                            </li>                            <li>                                <span></span>                                <span>Annual Company Retreat</span>                            </li>                    </ul>                "
  },
  {
    "id": "SFfmxwu6T1SVpYjX0ptw0Q",
    "url": "https://stackoverflow.com/jobs/190519/blockchain-engineer-in-a-cryptocurrency-startup-chorus-one?a=11TraftHxIqY",
    "title": "Blockchain Engineer in a cryptocurrency startup at Chorus One (Berlin, Germany) ",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:golang/go/16",
      "DBG_TECH1:k/t/w:haskell/other/10",
      "DBG_TECH1:k/t/w:ocaml/other/10",
      "DBG_TECH1:techWeightMap:{python=0, other=20, dotnet=0, c=0, mobile=0, go=19, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 1, 2018 7:40:45 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <div>                        <div></div>                        <div>                            <h3>High response rate</h3>                            <div>This company responds to the majority of applications it receives.</div>                        </div>                    </div>                                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Backend Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Cryptocurrency, Digital Asset Management, Security Software</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>1-10 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>go</a><a rel='nofollow'>haskell</a><a rel='nofollow'>salt-stack</a><a rel='nofollow'>terraform</a><a rel='nofollow'>ocaml</a>                    </div>                                            <h2>Job description</h2>                <div><p>Chorus One is close to releasing a validating node for the <a title=&quot;Cosmos&quot; href='https://cosmos.network/' rel='nofollow'>Cosmos network</a>. We are actively searching for a Blockchain Engineer to build validating nodes for other decentralized networks. The work consists of reviewing codebases of other decentralized networks, designing a path forward to deploy validating nodes using our internal infrastructure and to ensure operational security in deployed infrastructure. This position is a unique opportunity to work with a very experienced team on cutting-edge decentralized networks and financial services around cryptocurrency.</p><p><strong>Responsibilities:</strong></p><ul><li>Review core codebases of decentralized networks such as <a title=&quot;LVP&quot; href='https://livepeer.org/' rel='nofollow'>LivePeer</a>, <a title=&quot;XTZ&quot; href='https://tezos.com/' rel='nofollow'>Tezos</a>, <a title=&quot;Eth&quot; href='https://www.ethereum.org/' rel='nofollow'>Ethereum</a> and map out infrastructure requirements for validating nodes.</li><li>Design, implement and merge additional functionality in codebases of said networks, as needed, to make validating nodes compatible with our infrastructure.</li><li>Write functional and integration tests to verify software upgrades in blockchain networks for which company runs validating nodes.</li><li>Design and implement processes to reduce the lead-time of deployment of validating nodes in new blockchain networks.</li></ul><p><strong>The ideal candidate:</strong></p><ul><li>Is able to work independently. Has a minimum of 2-3 years work experience with a medium size company or a startup.</li><li>Has work experience with distributed algorithms. Prior experience with blockchain clients such as <a href='https://github.com/ethereum/go-ethereum' rel='nofollow'>Go-Ethereum</a>, <a href='https://github.com/bitcoin/bitcoin' rel='nofollow'>Bitcoin Core</a>, <a href='https://github.com/tendermint/tendermint' rel='nofollow'>Tendermint</a> or similar is a huge plus.</li><li>Has a strong interest to understand blockchain network code bases in depth. Is able to design requirements from network nodes, point out codebase issues and field technical questions from team members.</li><li>Possesses either Bachelor or advanced degrees in Computer Science or allied fields.</li><li>Is skilled with the Go language. Production experience with functional languages (Haskell, OCaml) is also desirable.</li><li>Is curious and able to take initiative in team discussions pertaining to business economics and business opportunities.</li><li>Knowledge of DevOps tools such as Terraform and Saltstack is an added plus.</li><li>Keywords pertaining to tools: Golang, Haskell, OCaml, DynamoDB, Saltstack, Terraform</li></ul><p><strong>We offer:</strong></p><ul><li>Competitive salary plus equity.</li><li>5 weeks annual leave.</li><li>Full-time position.</li><li>Location: Remote work.</li><li>Work on cool technology and interesting problems at the intersection of finance, cryptocurrency, information security and DevOps.</li></ul>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://stackoverflow.com/jobs/apply/190519?reset=False&amp;ra=11TraftHxIqY&amp;oqs=a%3D11TraftHxIqY' rel='nofollow'>Apply now</a></div>                                                <div>                                                    <a rel='nofollow'>Ask a question</a>                                                                                                        </div>                                    </div>                        </div>        </div>            <h2>About Chorus One</h2>            <div><p>Chorus One is a community of ambitious, self-reflective people building high reliability infrastructure for decentralized networks. We believe that crypto-economics and decentralized networks will enable collaboration on a global scale and propel the next stage in human evolution. Chorus One is building validator nodes for decentralized networks, allowing our users to earn more tokens and shape the emerging open financial system. Our work lies at the rich intersection of financial services, cryptocurrency, DevOps and information security.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Competitive salary plus equity</span>                            </li>                            <li>                                <span></span>                                <span>5 weeks annual leave</span>                            </li>                            <li>                                <span></span>                                <span>Remote work</span>                            </li>                            <li>                                <span></span>                                <span>Work on cool tech at intersection of Cryptocurrency, Infosec &amp; DevOps</span>                            </li>                    </ul>                "
  },
  {
    "id": "sxIn5NmjTMCIKjN0klKjOw",
    "url": "https://news.ycombinator.com/item?id=17206975",
    "title": "CourtDrive | Senior Full Stack Perl Developer | REMOTE| Market | Full-time (preferred) or Part-time | CourtDrive.com & CourtAPI.com",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:perl/other/15",
      "DBG_TECH1:techWeightMap:{python=0, other=15, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 1, 2018 7:29:05 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                  <span>CourtDrive | Senior Full Stack Perl Developer | REMOTE| Market | Full-time (preferred) or Part-time | CourtDrive.com &amp; CourtAPI.com<p>We are building solutions that enable law firms and other power courthouse website users to become more efficient by automating daily tasks. We’re a bootstrapped, profitable company launched in March of 2012. We are a remote company based in Los Angeles but have a worldwide team (Canada, Europe, Armenia to name a few).</p><p>We’re looking for a senior, full stack developer, preferably with Perl experience, to help us advance our mission by: building new webservices to integrate with other SaaS solutions, and building and supporting our CourtAPI solution.</p><p>Testimonial from a team member: “Long story, but I worked there for maybe 6ish months part time a while back. They offered me full time, but I ended up going to a startup because I wanted to learn some specific technologies + up my skills in Data Science. That job was definitely good for some people, but it wasn’t as remote as they advertised it (had me fly in alot), and the team was somewhat difficult to work with ;) I ended up starting my own consulting and at the same time CourtDrive reached back out to me (perfect timing). Point I was trying to make was that I went back to work with them because they were so nice to work with. Not super demanding and very open to listening to ideas/suggestions - just a pleasant environment.”</p><p>Full job listing and specific skills we are looking for: <a href='https://docs.google.com/document/d/1-Ffwezl2D76eFT_X9qnNMU51Ti7b74g9dKEQl1-8sPI/edit?usp=sharing' rel='nofollow'>https://docs.google.com/document/d/1-Ffwezl2D76eFT_X9qnNMU51...</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>"
  },
  {
    "id": "3P5CrNW3QCmKPlDNHUb66Q",
    "url": "https://news.ycombinator.com/item?id=17205990",
    "title": "Cyient | FULL TIME | ONSITE (remote for the right candidate) | Melbourne, FL; Bangalore, India; or Hyderabad, India ...",
    "tags": [
      "DBG:surround``remot 3W right",
      "DBG_TECH1:k/t/w:f#/other/5",
      "DBG_TECH1:k/t/w:haskell/other/5",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:lisp/other/5",
      "DBG_TECH1:k/t/w:maven/java/13",
      "DBG_TECH1:k/t/w:ocaml/other/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=20, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=15, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/java",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "java",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 1, 2018 6:12:06 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                  <span>Cyient | FULL TIME | ONSITE (remote for the right candidate) | Melbourne, FL; Bangalore, India; or Hyderabad, India | <a href='http://certsafe.com/' rel='nofollow'>http://certsafe.com/</a><p>CertSAFE is a software suite developed by Cyient for the design, development, simulation, verification, and validation of safety-critical systems. CertSAFE features a graphical development environment for a visual modeling language based on dataflow/circuit diagram notation, a simulation engine and interactive testing interface, an automatic test generator based on Satisfiability Modulo Theories (SMT) solving, and more.</p><p>As a member of the CertSAFE team, you will get to apply your software engineering and computer science knowledge in diverse areas, including programming language theory, graph theory, user interface design, concurrent and parallel software design, and software test automation. You will get to interact on a day-to-day basis with real-world users and customers working on safety-critical applications in aerospace, defense, transportation, medical devices, and other fields.</p><p>CertSAFE is developed by a small team with a Lean Kanban development process. We use a variety of technologies including Java, Maven, Jenkins, Python, and AWS, and also especially appreciate experience with functional languages such as Haskell, F#, OCaml, Lisp, etc.</p><p>Positions available include Software Engineer, Software Quality Assurance Engineer, Application Engineer, and DevOps Engineer. Visit <a href='http://certsafe.com/careers/' rel='nofollow'>http://certsafe.com/careers/</a> for full position descriptions.</p><p>If you plan on working outside of Melbourne, FL, these roles require travel to Melbourne, FL for 90-180 days to undergo necessary training. Visa assistance is available.</p><p>Interested? Email your resume to careers@certsafe.com.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>"
  },
  {
    "id": "Ayw3i8HhS8CnmGYHXUDKzA",
    "url": "http://www.indeed.com/viewjob?t=Programmer+Analyst&jk=af6333c5312fd9f7&",
    "title": "Programmer Analyst - Remote - Imperial Supplies - Green Bay, WI",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:shell/other/2",
      "DBG_TECH1:techWeightMap:{python=0, other=2, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=3}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 30, 2018 9:38:09 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<h3>Programmer Analyst - Remote</h3><div>Company: Imperial Supplies<br></div><div>Location: Green Bay, WI<br></div><span><div><div><p><b>Help us drive record-breaking, double-digit growth!</b></p><p>Imperial Supplies, a Grainger company, is a national distributor of quality maintenance products. Serving the fleet maintenance industry since 1958, Imperial has formed lasting relationships with customers by tailoring our services to meet their changing needs.</p><p>With more National Account Programs in the fleet industry than all of our competition combined, we are recognized for innovative technology and solutions that reduce costs through efficient ordering methods and stringent controls.</p><p>Imperial Programmer Analysts work cross-functionally to write, maintain, test, and document programs of a complex nature.</p><ul><li>Produce structured and efficient code in Progress OpenEdge.</li><li>Assume on-call responsibility for emergency situations (rotating basis)</li><li>Assist with evaluation and design of system architecture</li><li>Back-up to the Database Administrator as needed</li></ul><br><p><b>Requirements</b></p><ul><li>Bachelor’s degree and 2 years of programming experience or Associate's degree and equivalent work experience</li><li>Bachelor’s degree with emphasis in data processing plus UNIX/Progress education and 3-5 years of experience in data processing preferred</li><li>Programming proficiency in one or more of the following languages: Progress OpenEdge, Database administration, Linux shell scripting, HTML, CSS</li><li>Effective written and verbal communication skills, logic and analytical skills. Effective organizational skills. Ability to handle multiple priorities.<br></li></ul><p><b>Imperial offers</b></p><ul><li>A competitive wage, annual bonus opportunity, and industry leading benefits including immediate health, dental, vision, life, and disability insurance.</li><li>Excellent work-life balance, 18 days paid time off plus paid holidays</li><li>Generous profit sharing and 401K programs</li><li>Education reimbursement and opportunities for internal advancement &amp; professional growth</li></ul><br><p><i>Imperial is an Equal Opportunity / Affirmative Action Employer.</i></p><p><i>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected veteran status</i>.</p><p><br><b>Job Segment: </b>Developer, Programmer, DBA, Database, Linux, Technology</p></div></div></span>"
  },
  {
    "id": "qYfiEoc-TCiWwSryQFKeZg",
    "url": "https://weworkremotely.com/remote-jobs/amazix-full-stack-elixir-developer",
    "title": "AmaZix: Full Stack Elixir Developer",
    "tags": [
      "DBG:surround``remot 16W timezon",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/6",
      "DBG_TECH1:k/t/w:elixir/other/20",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/16",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=20, dotnet=0, c=0, mobile=0, go=0, nodejs=13, bigdata-ml=0, ruby=18, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=14}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/other",
      "TECH1/ruby",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "other",
      "ruby"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 29, 2018 4:50:59 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>  <div>    <h2>Full Stack Elixir Developer</h2>      <h4>Posted May 29</h4>    <h3>      <span>AmaZix</span><br>      <span>Headquarters: Hong Kong (but entire team is distributed)</span><br>        <a href='https://www.amazix.com/' rel='nofollow'>https://www.amazix.com/</a>      <br>      <a rel='nofollow'>View all AmaZix jobs →</a>    </h3>  </div>    </div>  <div>    <div>AmaZix is the leading provider of community management services for crypto projects. We specialise in helping projects running on the Ethereum blockchain, especially those building up to their ICOs. Projects we work on include Bancor, BANKEX, WePower, GBX and Cardstack.</div><div><br></div><div>We are growing extremely fast and from our founding nine months ago we now have over 100 team members and manage over 60 high level projects, with many more asking to come aboard than we can take. We are profitable and have been since day one.</div><div><br></div><div>If you are not technically familiar with blockchain based projects then no problem - it is not required. However some knowledge of what Ethereum is would be useful.</div><div><br></div><div>Though our company is based in Hong Kong our team is distributed around the world (primarily Europe).</div><div><br></div><div><b>Your position:</b></div><div><br></div><div>You will be the fifth member of our development team working directly alongside our CTO and lead developer. You'll work on various new projects such as:</div><div><br></div><ul><li>Complete rebrand and rewrite of our amazix.com site</li><li>Internal analytics tools to offer insights to our projects</li></ul><div><br></div><div>And many more in the pipe.</div><div><br></div><div>We are looking for highly motivated and experienced full-stack developers ideally with experience with Elixir and/or Elm, though experience with Rails and/or React might be acceptable given a willingness to learn. As a full stack developer you'll be expected to be comfortable with CSS and one of its preprocessors.</div><div><br></div><div>The position requires strong technical expertise, enthusiasm and a desire not only to write good code, but also deliver value to the business. The position is open to full time remote developers (preferably within 4 hours of GMT for timezone consideration).</div><div><br></div><div><b>Technical environment:</b></div><div><br></div><div>Our current team and projects are working with PostgreSQL, AWS/Heroku, NodeJS, Elixir, Ruby / Rails, Node, Elm, CSS, HTML. We are open to options.</div><div><br></div><div><b>Requirements:</b></div><div><br></div><div>Perfect command of English (written and spoken)</div><div><br></div><div>Invoicing structure and proper registration. Willingness to be paid in Ethereum would be a huge plus.</div><div><br></div><div>Full-time contract position preferred, part-time possible.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send your application to <a href='mailto:luke.saunders%2Bjunedev@amazix.com' rel='nofollow'>luke.saunders+junedev@amazix.com</a></p>  </div>"
  },
  {
    "id": "LvgxRearRlmbSkuPL0aZ6Q",
    "url": "https://stackoverflow.com/jobs/147899/backend-engineer-truly?a=NBfeA1XyWDC",
    "title": "Backend Engineer at Truly (San Francisco, CA) ",
    "tags": [
      "DBG:surround``2N( OR(across,digit),     2N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:clojure/other/5",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:jvm/java/13",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:k/t/w:perl/other/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:shell/other/1",
      "DBG_TECH1:techWeightMap:{python=2, other=11, dotnet=0, c=0, mobile=4, go=0, nodejs=0, bigdata-ml=2, ruby=2, apple=2, java=14, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 24, 2018 5:31:24 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Backend Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Communications, Enterprise Software, SaaS</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>11-50 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>VC Funded</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>api</a><a rel='nofollow'>amazon-web-services</a><a rel='nofollow'>clojure</a><a rel='nofollow'>asterisk</a>                    </div>                                            <h2>Job description</h2>                <div><p><strong>About you:</strong></p><ul><li><span>You are a seasoned Software Engineer with strong microservices experience and customer-first mindset</span></li><li><span>You are passionate about writing clean, scalable, bug free code</span></li><li><span>You are obsessed with learning to make better design decisions by engaging and partnering with peers</span></li><li><span>You are a subject matter expert who knows how to translate complex technical concepts that a recipient can understand</span></li><li><span>You are a influential team player who volunteer to do pair programming with remote peers</span></li></ul><p><strong>What You Will Be Doing:</strong></p><ul><li><span>Design and implement RESTful APIs for mobile, web and 3rd party integrations</span></li><li><span>Design and implement highly scalable microservice-based services</span></li><li><span>Write unit tests, integration tests, performance tests and deploy using CI/CD pipeline</span></li><li><span>Be actively involved in the design and code review process</span></li><li><span>Debug &amp; fix production issues and participate in strategies to prevent future occurrence</span></li><li><span>Work in a fast-paced agile scrum environment with distributed teams across US</span></li></ul><p><strong>Required Skills:</strong></p><ul><li><span>Experience building large scale, distributed and performant applications for Customer facing product</span></li><li><span>Deep understanding of API design principles and patterns</span></li><li><span>Expert skills on Clojure </span></li><li><span>Experience writing and fine tuning SQL queries for performance </span></li><li><span>Experience with at least one scripting language - Python, Perl, Ruby or Shell</span></li><li><span>Experience configuring and debugging applications running on JVM</span></li></ul><p><strong>Desired Skills:</strong></p><ul><li><span>Experience with SIP or VOIP or Video frameworks and tools</span></li><li><span>Experience with Machine Learning and Speech/Voice recognition</span></li></ul><p><strong>Qualifications:</strong></p><ul><li><span>5+ years of experience as Software engineer</span></li><li><span>Authorized to work in the US</span></li></ul><p><br><br></p>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://jobs.lever.co/truly/e31dfc62-6847-4ab4-93c9-12ceee8c48f6?lever-origin=applied&amp;lever-source%5B%5D=StackOverflow' rel='nofollow'>                        Apply now        </a></div>                                    </div>                        </div>        </div>            <h2>About Truly</h2>            <div><p><strong>Connect Conversations to Revenue.</strong></p><p>Founded in 2013, Truly is a complete enterprise voice platform for sales, account management, and customer success teams.</p><p>Our customers use Truly to solve their top strategic challenges. From sales performance management and capacity planning, to shortening on-boarding/training cycles - Truly’s voice platform enables leadership an HD-view of entire customer conversation lifecycle. IT organizations embrace Truly because it helps them consolidate and simplify their entire voice infrastructure.</p><p><strong>Some things that make us different include:&nbsp;</strong><br>* A team of founders. Most of us have either been founders or ‘first engineer’ at startups that have gone places. We know and love building products that create big companies.&nbsp;<br>* Engineers who love product. We take part in the entire product lifecycle from brainstorming to design and implementation.&nbsp;<br>* We’re not your typical CRUD app. Our software runs across many different platforms (web/chrome/iOS/Android) and connects to a core communications infrastructure that we’ve built from scratch. You’ll interface with every technology/interface connected to each device to create an incredibly rich and resilient experience.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Competitive Salary + equity package at a profitable, growing startup</span>                            </li>                            <li>                                <span></span>                                <span>Google-Level benefit plans, including health, dental and vision</span>                            </li>                            <li>                                <span></span>                                <span>Unlimited vacation policy + work remote</span>                            </li>                            <li>                                <span></span>                                <span>Ability to rotate across projects (FE/BE/Big-Data)</span>                            </li>                            <li>                                <span></span>                                <span>Commuter  + Team Outings</span>                            </li>                            <li>                                <span></span>                                <span>A culture of 'do-ers': former mountain climbers, inventors, founders</span>                            </li>                    </ul>                "
  },
  {
    "id": "voLWTNoQRlGuKHDPB5PJFg",
    "url": "https://stackoverflow.com/jobs/163590/senior-erlang-developer-scrapinghub?a=SRvpZQcCecg",
    "title": "Senior Erlang Developer at Scrapinghub  ",
    "tags": [
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG:surround``remot 2W work W experi",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:erlang/other/10",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=10, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 24, 2018 5:31:24 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Contract</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Full Stack Developer, Backend Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Big Data</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>python</a><a rel='nofollow'>design</a><a rel='nofollow'>erlang</a><a rel='nofollow'>linux</a><a rel='nofollow'>unix</a>                    </div>                                            <h2>Job description</h2>                <div><p><strong>About the Job:</strong></p><p>You will join our top talented engineers on the Crawlera team in making the world a better place for web crawler developers.</p><p><a title=&quot;Crawlera&quot; href='https://scrapinghub.com/crawlera' rel='nofollow'>Crawlera</a> is a smart downloader designed specifically for web crawling and scraping. It allows crawler developers to crawl quickly and reliably by managing thousands of proxies internally. It is part of the Scrapinghub platform, the world’s most comprehensive web crawling stack which powers crawls of over 4 billion pages a month.</p><p><strong>Job Responsibilities:</strong></p><ul><ul><li>Develop, maintain and support a high load distributed system.</li><li>Analyze our current and historical Crawlera usage to augment and enhance its routing and rotation logic.</li><li>Leverage the Scrapinghub platform to provide extended functionality, both to end users and for internal purposes.</li><li>Identify and resolve performance and scalability issues with distributed crawling at scale.</li><li>Liaison with other platform teams to provide Crawlera with the best possible integration to the growing Scrapinghub platform.</li></ul></ul><p><strong>Required Skills:</strong></p><ul><ul><li>2+ years of production experience with Erlang.</li><li>Good communication in written English.</li><li>Strong knowledge of Linux/UNIX, HTTP and Networking.</li></ul></ul><p><strong>Desired Skills:</strong></p><ul><ul><li>Python Knowledge.</li><li>Familiarity with techniques and tools for crawling, extracting and processing data.</li><li>Knowledge of ELK, Graylog, Docker and Mesos.</li><li>Good spoken English.</li><li>Previous remote working experience.</li></ul></ul>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://jobs.lever.co/scrapinghub/2a7dddd9-76f4-41f4-b55b-cb8e2641d9ab/apply' rel='nofollow'>                        Apply now        </a></div>                                    </div>                        </div>        </div>            <h2>About Scrapinghub</h2>            <div><p>Scrapinghub is a fast growing and diverse technology business turning web content into useful data with a cloud-based web crawling platform, off-the-shelf datasets, and turn-key web scraping services.</p><p>We’re a globally distributed team of over 100 Scrapinghubbers working from over 30 countries who are passionate about scraping, web crawling, and data science.</p><p>As a new Scrapinghubber, you will:</p><p>Become part of a self-motivated, progressive, multi-cultural team.</p><p>Have the freedom to work from&nbsp;<a href='http://blog.scrapinghub.com/2015/05/12/traveling-tips-for-remote-workers/' rel='nofollow'>wherever you want</a></p><p>Have the opportunity to go to conferences and meet with the team from across the globe.</p><p>Get the chance to work with cutting-edge open source technologies and tools.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Flexible working hours</span>                            </li>                            <li>                                <span></span>                                <span>Remote working</span>                            </li>                            <li>                                <span></span>                                <span>Paid time off</span>                            </li>                            <li>                                <span></span>                                <span>Paid open source work</span>                            </li>                            <li>                                <span></span>                                <span>Global team meet ups</span>                            </li>                    </ul>                "
  },
  {
    "id": "YIMkuqhmRD6FYsKvXZOvuw",
    "url": "http://jobs.github.com/positions/5617ee0e-7140-11e7-9a32-da9f312e2883",
    "title": "Full Time: Ember & Elixir Full Stack Web Developer at Seated in Remote",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/16",
      "DBG_TECH1:k/t/w:elixir/other/25",
      "DBG_TECH1:k/t/w:ember.js/frontend/32",
      "DBG_TECH1:k/t/w:ruby-developer/ruby/13",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=25, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=16, ruby=15, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=32}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/other",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "other"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "May 15, 2018 9:59:02 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<p><strong>Seated is an early stage ticketing startup founded to completely change the experience of buying tickets to high demand events.</strong> We aim to remove the frustration from the buying process, identify scalpers and put tickets in the hands of true fans. We work directly with artists and ensure they are involved at every stage.</p><p>We've already launched with some great early partners including Leon Bridges, Death Cab for Cutie, Christina Aguilera, Robert Plant, Nathaniel Rateliff and others.</p><p><strong>Role</strong></p><p>We are looking for a full stack web developer who can contribute to the backend and frontend as needed. Overtime this role will grow and could become more specialised as the team expands or as interests change.</p><p><strong>Tech</strong></p><p>We run multiple Ember apps in the frontend for buying tickets and for administration. This is all backed by an Elixir Phoenix JSON API running on Heroku and Postgres.</p><p><strong>Requirements</strong></p><p>The ideal candidate will have both experience in building frontend Ember applications and backend Elixir APIs. We are open to candidates who only have one of these skills and would like to learn about the other. See more below.</p><p><strong>The role is 100% remote.</strong> Work wherever makes you the most productive. The founders are currently based in NYC so <strong>crossover with ET is required (the Americas and Western Europe)</strong>. Fluency in English is required.</p><p><strong>Team</strong></p><p>Seated was founded by people passionate about making a better experience for fans and we believe having a happy and productive team is the best way to achieve that. We are a remote first company and will try to accommodate most working preferences. We do daily video hangouts and face to face company meetups several times a year.</p><p>As a developer at Seated you’ll be working closely with the founders to impact the product roadmap and technical direction. We operate a flat and open structure so you will have a ton of influence.</p><p>If you are a Ruby developer looking to get started with Elixir, or maybe an Elixir developer who is looking to learn Ember then you will have ample time and support to round out your skills. We also have the budget for conferences and training as needed.</p><p><strong>To apply please email <a href='mailto:jobs@seated.com' rel='nofollow'>jobs@seated.com</a> with the following</strong></p><ul><li>CV/resume</li><li>Intro/cover letter</li><li>Links to recent work or work you are proud of</li><li>Your location</li></ul><p><strong>Hiring process</strong></p><ul><li>CV/resume review</li><li>Interview with CTO</li><li>Remotely collaborate on a real project for Seated (this will make it into production and will be paid for)</li><li>Interview with CEO</li></ul>"
  }
]
}
