{
 "items": [
  {
    "id": "5VuwnAteQdWk1Rb1TPwWnw",
    "url": "http://workinstartups.com/job-board/job/86652/unity-software-engineer-founding-team-equity-at-inplace-tech/",
    "title": "Unity Software Engineer / Founding team / Equity",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``hour 2W time W differ",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:cocos2d-iphone/gamedev/8",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:game-developer/gamedev/13",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:unity3d/gamedev/24",
      "DBG_TECH1:k/t/w:unity3d/mobile/15",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=5, c=2, mobile=15, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=45, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "Inplace Tech",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Nov 7, 2019 5:38:49 PM",
    "validThrough": "Nov 14, 2019 5:38:49 PM",
    "crawled": "Nov 8, 2019 8:30:36 PM",
    "content": "<p><strong>Who are we</strong></p><br /><p>We want to revolutionize advertising for apps and games. The company was founded in 2019 by a Software Engineer with 11 years of experience in Google, in both Ads and Play. It is still in stealth mode and pre-seed phase. We have enthusiastic feedback about the product, and we are now building the founding team to bring it to market. Equity can be part of the offer, for the right person.</p><br /><p><strong>Who are we looking for</strong></p><br /><p>We are looking for ambitious people that are thrilled to join a high potential early venture. You&rsquo;ll have to be an excellent software engineer, that has a passion for mobile games and an ace when it comes to coding in Unity. You&rsquo;ll also need to be curious, love to learn about things outside of your core expertise, and excited to wear more than the pure engineering hat when required. You will be reporting to the founder &amp; CEO of the company.</p><br /><p><strong>Who fits the role</strong></p><br /><ul><br /><li>A software engineer with a BSc degree, related to CS.</li><br /><li>Experience in Unity development in a professional environment.</li><br /><li>Excellent C# knowledge and OO design.</li><br /><li>Excellent knowledge of integration and unit testing.</li><br /><li>Passion for Product and Engineering excellence coupled with a good dose of pragmatism.</li><br /></ul><br /><p><strong>What&rsquo;s nice to have</strong></p><br /><ul><br /><li>Experience in mobile development, outside of games.</li><br /><li>Having launched a mobile game in a store.</li><br /><li>Experience in mentoring junior engineers.</li><br /><li>Degree from a top engineering school (any country).</li><br /><li>Knowledge of more game development platforms and tools (e.g. Cocos2D, HTML5).</li><br /><li>Knowledge of server-side software development.</li><br /><li>Knowledge of more than one programming languages (go and python highly desirable).</li><br /></ul><br /><p>If this seems interesting, apply with your CV as well as a couple of sentences on why you want to work in this, early-stage company.</p><br /><p>The company is based in London UK, but applications from people leaving in timezones with up to 4 hours time difference to London are very welcome.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "zKitavqQTCKvMOBjM1TIjA",
    "url": "https://jobmote.com/job/94999/cisco-uc-engineers-100-remote-90k-125k-no-c2c/",
    "title": "Cisco UC Engineers, 100% REMOTE (90k-125k) NO C2C",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 6W OR(dai,daili,week,weekli,month,monthli) 5W OR(offic,headquart,onsit)",
      "DBG_TECH1:k/t/w:express/nodejs/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:unity3d/gamedev/8",
      "DBG_TECH1:k/t/w:unity3d/mobile/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=5, go=3, nodejs=8, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TECH1/nodejs",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "Kelly Services",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 24, 2019 10:08:04 PM",
    "validThrough": "Oct 27, 2019 10:08:04 PM",
    "crawled": "Oct 25, 2019 3:06:31 AM",
    "content": "<div><p><strong>UC Engineers</strong></p> <p><strong>100% Remote </strong>(Does require 2-weeks onsite in Tampa for training) </p> <p><strong>Note: </strong>U.S. Citizens and those authorized to work in the U.S. without sponsorship are encouraged to apply. We are unable to sponsor at this time.</p> <p><strong>This is a direct-hire role with our client. </strong> Talented and competitive people are rewarded with outstanding career development, personal growth and leadership opportunities - the Sky is the Limit here! </p> <p><strong>Target Salaries: $90k - $125k base salary + annual bonus and exceptional full benefits package</strong></p> <p><strong>HIGHLIGHTS</strong>:</p> <p><br> • Work collaboratively with the highest caliber talent. Our client is committed to hiring and developing great people who have a passion for excellence and a commitment to continuous improvement.<br> • Utilize cutting-edge technology and processes - creating the next generation of products and services that will impact the world for generations to come.<br> • Foster growth and professional development capabilities - because they are a large, global organization with many disciplines and locations, you'll have the opportunity to explore different roles.<br> • Be recognized &amp; rewarded - our client values their employees, recognizes talent, encourages growth and rewards contributions</p> <p> </p> <p><strong>Overview:</strong> </p> <p>We have both Level 2 &amp; 3 opportunities open. You will work in a fast-paced virtual NOC with teammates across North America. You will provide support and troubleshooting UC related incidents for customers in the financial, healthcare, retail, and insurance industries (among others) across 70 countries. </p> <p> </p> <p><strong>Experience (minimum requirements):</strong> </p> <p>5+ years with UC/UCC Engineer or equivalent </p> <p><strong>Certifications:</strong> </p> <p><strong>CCIE </strong>Collaboration. Expert level experience may be substituted. </p> <p>· Troubleshoot incidents in the following technologies: </p> <p>o <strong>Cisco Unified Communications Manager</strong> 9.x and above. </p> <p>o <strong>Cisco </strong>Unity Connection <strong>Unified Communications Manager</strong></p> <p>o <strong>Cisco </strong>IM&amp;P and Jabber Clients </p> <p>o <strong>Cisco </strong>Voice Gateways / CUBEs </p> <p>o <strong>Cisco </strong>Telepresence (Servers and video end-points) </p> <p>o <strong>Cisco </strong>Unified Contact Center Enterprise 7.x and above. </p> <p>o <strong>Cisco </strong>Unified Contact Center Express </p> <p>o <strong>Cisco </strong>Finesse / CTIOS / Cisco Agent Desktop </p> <p>o <strong>Cisco </strong>Voice Portal (CVP) </p> <p>o <strong>Cisco </strong>Historical Data Server (HDS) </p> <p>o <strong>Cisco </strong>CCMP </p> <p>o <strong>Cisco </strong>UCS Platform </p> <p>o <strong>VMWare </strong>5.x and above </p> <p>o <strong>Cisco </strong>Unified SIP Proxy (CUSP) </p> <p>o Signaling protocols such as SIP, H323, SCCP, and MGCP </p> <p> </p> <p><strong>Feel free to send resumes directly to: </strong></p> <p> </p> <br><br>Why Kelly ® ?  <p>With Kelly, you'll have direct connections to leading IT organizations in the best companies around the globe-offering you the chance to work on some of today's most intriguing, innovative and high-visibility projects. In a field where change is the only constant, our connections and opportunities will help you take your career exactly where you want to go. We work with 90 of the Fortune 100™ companies companies and found opportunities for more than 8,600 IT professionals last year. Let us help advance your career today.</p> <p> </p>About Kelly ®   <p>At Kelly, we're always thinking about what's next and advising job seekers on new ways of working to reach their full potential. In fact, we're a leading advocate for temporary/nontraditional workstyles, because we believe they allow flexibility and tremendous growth opportunities that enable a better way to work and live. Connecting great people with great companies is what we do best, and our employment opportunities span a wide variety of workstyles, skill levels, and industries around the world.</p> <p>Kelly is an equal opportunity employer committed to employing a diverse workforce, including, but not limited to, minorities, females, individuals with disabilities, protected veterans, sexual orientation, gender identity. Equal Employment Opportunity is The Law. </p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "RD6VftHaTVagbAU1KRbgow",
    "url": "https://remoteok.io/jobs/75265",
    "title": "Full Stack Web Developer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=5, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "SOCi ",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 24, 2019 7:28:24 AM",
    "validThrough": "Oct 1, 2019 7:28:24 AM",
    "crawled": "Oct 21, 2019 10:30:37 PM",
    "content": "<span></span> <span><h4>SOCi</h4>&nbsp;</span> <br> <h3>Full Stack Web Developer</h3> <div>  <div>   \\nAbout SOCi\\nSOCi is the leading enterprise solution for social content discovery and social media marketing. Our next-generation, all-in-one social media SaaS platform utilizes a proprietary scoring algorithm to discover, evaluate, and rank social content, changing how enterprises, franchises, and affiliates market on social media to their target audiences. SOCi has a growing team of passionate, innovative, and fun people in both our San Diego, CA and Austin, TX offices.\\n*This position is open to fully remote candidates\\nThe job\\n* We work collaboratively in groups of 3-4 (mobs) where you group program with other great engineers and product people, each representing different viewpoints and bringing different skills to the table.\\n* Iterating and shipping daily in small increments, you're able to progress fast and have a sense of achievement every day going home.\\n* Sometimes you'll need to complete other tasks and duties as needed.\\n\\n\\nYou\\n* Love writing elegant code.\\n* Have a solid foundation of core programming skills in MySQL, PHP and JavaScript\\n* Have a strong sense of visual aesthetics on web and ability to make it reality with cutting-edge CSS.\\n* Shiver in horror at the thought of copy-pasting coding.\\n* Have&nbsp;experience working in social media space (a plus).\\n* Get nightmares from badly formatted code.\\n* Understand that usability and attention to visual details matters just as much as good performance and clean architecture.\\n* You are equally comfortable discussing database architecture as you are in debating animations and shadows in the UI all the while keeping the user story in mind to ensure you're solving the right problem.\\n* Have experience working with enterprise-grade SaaS products (a plus).\\n\\n\\nWhat's SOCi's culture like?\\nOur primary driver is professional growth and learning, coupled with a desire to help our customer succeed. We focus heavily on individual mentorship and guidance, peer feedback and are always pushing ourselves and each other to the next level. We're huge on collaboration - mobing/swarming to solve problems either as individual engineering teams, or even Product/Engineering/Design leaders mobing to work out the best new product approach. We focus on moving fast, learning fast, and not looking back.\\nSOCi is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Ds0-es7FQiOISUweu0LcnA",
    "url": "https://remoteok.io/jobs/75532",
    "title": "Senior Game Engineer",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:devise/ruby/8",
      "DBG_TECH1:k/t/w:game-developer/gamedev/91",
      "DBG_TECH1:k/t/w:html5/frontend/15",
      "DBG_TECH1:k/t/w:javascript/frontend/4",
      "DBG_TECH1:k/t/w:javascript/nodejs/4",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=18, bigdata-ml=0, ruby=8, apple=0, java=0, gamedev=99, php=0, embedded=0, frontend=28}",
      "REMOTE1/50",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "Game Closure",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 8, 2019 6:41:29 AM",
    "validThrough": "Oct 15, 2019 6:41:29 AM",
    "crawled": "Oct 21, 2019 10:30:37 PM",
    "content": "<span></span> <span><h4> Game Closure </h4></span> <br> <h3>Senior Game Engineer</h3> <div>  <div>   GAME CLOSURE\\n\\nSan Francisco, Mountain View, Tokyo, Remote &nbsp;-&nbsp; Full Time\\n\\nGame Closure is on the hunt for Senior Game Engineers to help us build the social games that will be tomorrow’s biggest hits on Facebook and other social media platforms. We are a growing team with offices in San Francisco and Mountain View, California, Tokyo, Japan and also some possibilities for remote work. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you! \\n\\nGame Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass instant games, you will play a pivotal role in creating a platform which will revolutionize the future of game development. \\n\\nIt's always a bonus if you know more than JavaScript! We write cross-compilers, GPU shaders, NodeJS back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.\\n\\n**The Role:**\\n\\n- Be responsible for designing, developing and deploying major game features\\n- Own game feature areas from end-­to­-end\\n- Be the champion for the user!\\n- Insist on the highest standards and create functional and engaging features that will delight our users\\n- Be part of a tight game development team looking to iterate fast on a fun concept and then building it out\\n- Have real input on end-user product\\n- Be a key member of a high performing software engineering team\\n- Collaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements\\n- Hands­ on architect and coder for sophisticated client/server systems for mobile gaming\\n- Innovate and iterate on process, systems and technology to deliver world­-class social games\\n- Be a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!\\n\\n**Desired Skills:**\\n\\n- Bachelor's degree in Computer Science or related field, or equivalent experience.\\n- 3+ years of professional software engineering experience, working on cross functional teams.\\n- Proven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).\\n- Capable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.\\n- Proficient at using script debuggers like Chrome Debugger.\\n- Strong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.\\n- Advanced software engineering skills, including the ability to write maintainable and robust code in a p popular object oriented language.\\n- Solid familiarity with analytics and A/B testing in mobile games\\n- Familiarity with git, svn or other VCS.\\n- Self starter, analytical and creative\\n- Strong team player with a positive attitude.\\n- Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.\\n- Check out Everwing on Facebook Instant Games in Messenger. Can you build this game? \\n- Understanding of the reactive UI paradigm and experience building UIs using reactive UI frameworks (such as React, and state management Utilities like Redux).\\n\\n**Bonus:**\\n\\n- Canvas animation work\\n- 2+ years of game development experience with multiple shipped titles\\n- Specialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)\\n- Expert knowledge of TypeScript\\n\\n**GC Perks:**\\n\\n- Medical, Dental, &amp; Vision: Top quality insurance options with 100% of premiums covered\\n- Social Events: Weekly team dinners, quarterly team excursions, game nights, karaoke, and more\\n- Commuter Pass + Free Parking: Your commute and parking to the office is on us! \\n- PTO: Unlimited vacation policy\\n- Meals: Free daily lunches, well stocked kitchen, healthy snacks and drinks\\n- Pet-Friendly Office: Bring your pets to work to foster a friendlier and happier workplace  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "dQJPrw1nSIiV4BNBsEGGRQ",
    "url": "https://jobs.github.com/positions/e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
    "title": "Senior Game Engineer (REMOTE)",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:devise/ruby/8",
      "DBG_TECH1:k/t/w:game-developer/gamedev/78",
      "DBG_TECH1:k/t/w:html5/frontend/15",
      "DBG_TECH1:k/t/w:javascript/frontend/4",
      "DBG_TECH1:k/t/w:javascript/nodejs/4",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=18, bigdata-ml=0, ruby=8, apple=0, java=0, gamedev=86, php=0, embedded=0, frontend=28}",
      "REMOTE1/50",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 3, 2019 2:50:23 AM",
    "validThrough": "Aug 10, 2019 2:50:23 AM",
    "crawled": "Oct 21, 2019 10:30:34 PM",
    "content": "GAME CLOSURESan Francisco, Mountain View, Tokyo, Remote  -  Full TimeGame Closure is on the hunt for  Senior Game Engineers to help us build the social games that will be tomorrow’s biggest hits on Facebook and other social media platforms. We are a growing team with offices in San Francisco and Mountain View, California, Tokyo, Japan and also some possibilities for remote work. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you! Game Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass instant games, you will play a pivotal role in creating a platform which will revolutionize the future of game development. It's always a bonus if you know more than JavaScript! We write cross-compilers, GPU shaders, NodeJS back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.**The Role:**- Be responsible for designing, developing and deploying major game features- Own game feature areas from end-­to­-end- Be the champion for the user!- Insist on the highest standards and create functional and engaging features that will delight our users- Be part of a tight game development team looking to iterate fast on a fun concept and then building it out- Have real input on end-user product- Be a key member of a high performing software engineering team- Collaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements- Hands­ on architect and coder for sophisticated client/server systems for mobile gaming- Innovate and iterate on process, systems and technology to deliver world­-class social games- Be a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!**Desired Skills:**- Bachelor's degree in Computer Science or related field, or equivalent experience.- 3+ years of professional software engineering experience, working on cross functional teams.- Proven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).- Capable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.- Proficient at using script debuggers like Chrome Debugger.- Strong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.- Advanced software engineering skills, including the ability to write maintainable and robust code in a p popular object oriented language.- Solid familiarity with analytics and A/B testing in mobile games- Familiarity with git, svn or other VCS.- Self starter, analytical and creative- Strong team player with a positive attitude.- Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.- Check out Everwing on Facebook Instant Games in Messenger. Can you build this game? - Understanding of the reactive UI paradigm and experience building UIs using reactive UI frameworks (such as React, and state management Utilities like Redux).**Bonus:**- Canvas animation work- 2+ years of game development experience with multiple shipped titles- Specialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)- Expert knowledge of TypeScript**GC Perks:**- Medical, Dental, &amp; Vision: Top quality insurance options with 100% of premiums covered- Social Events: Weekly team dinners, quarterly team excursions, game nights, karaoke, and more- Commuter Pass + Free Parking: Your commute and parking to the office is on us! - PTO: Unlimited vacation policy- Meals: Free daily lunches, well stocked kitchen, healthy snacks and drinks- Pet-Friendly Office: Bring your pets to work to foster a friendlier and happier workplace",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "GQmqkKnsRJyG9rbNlV2JFA",
    "url": "https://remote.co/job/full-stack-web-developer-14/",
    "title": "Full Stack Web Developer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=5, embedded=0, frontend=4}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "SOCi",
      "sameAs": "https://www.meetsoci.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 17, 2019 3:48:14 PM",
    "validThrough": "Sep 24, 2019 3:48:14 PM",
    "crawled": "Sep 17, 2019 4:07:48 PM",
    "content": "<h3>Full Stack Web Developer at <span>SOCi</span></h3><div><span><i></i> Remote</span>        </div><div>            <h5><strong>About SOCi</strong></h5><p>SOCi is the leading enterprise solution for social content discovery and social media marketing. Our next-generation, all-in-one social media SaaS platform utilizes a proprietary scoring algorithm to discover, evaluate, and rank social content, changing how enterprises, franchises, and affiliates market on social media to their target audiences. SOCi has a growing team of passionate, innovative, and fun people in both our San Diego, CA and Austin, TX offices.</p><p><strong>*This position is open to fully remote candidates</strong></p><h5><strong>The job</strong></h5><ul><li>We work collaboratively in groups of 3-4 (mobs) where you group program with other great engineers and product people, each representing different viewpoints and bringing different skills to the table.</li><li>Iterating and shipping daily in small increments, you’re able to progress fast and have a sense of achievement every day going home.</li><li>Sometimes you’ll need to complete other tasks and duties as needed.</li></ul><h5><strong>You</strong></h5><ul><li>Love writing elegant code.</li><li>Have a solid foundation of core programming skills in MySQL, PHP and JavaScript</li><li>Have a strong sense of visual aesthetics on web and ability to make it reality with cutting-edge CSS.</li><li>Shiver in horror at the thought of copy-pasting coding.</li><li>Have&nbsp;experience working in social media space (a plus).</li><li>Get nightmares from badly formatted code.</li><li>Understand that usability and attention to visual details matters just as much as good performance and clean architecture.</li><li>You are equally comfortable discussing database architecture as you are in debating animations and shadows in the UI all the while keeping the user story in mind to ensure you’re solving the right problem.</li><li>Have experience working with enterprise-grade SaaS products (a plus).</li></ul><h5><strong>What’s SOCi’s culture like?</strong></h5><p>Our primary driver is professional growth and learning, coupled with a desire to help our customer succeed. We focus heavily on individual mentorship and guidance, peer feedback and are always pushing ourselves and each other to the next level. We’re huge on collaboration – mobing/swarming to solve problems either as individual engineering teams, or even Product/Engineering/Design leaders mobing to work out the best new product approach. We focus on moving fast, learning fast, and not looking back.</p><p><em>SOCi is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.</em></p>        </div><div>        <a href='https://soci.applytojob.com/apply/Acdmv4rAVy/Full-Stack-Web-Developer?referrer=20190205013335NI1WZL0KLPWE4M5Y' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Vq3PVEI_Tg-bZHSbwHC3wQ",
    "url": "https://remote.co/job/staff-software-engineer-game-systems/",
    "title": "Staff Software Engineer, Game Systems",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:embedded/c/1",
      "DBG_TECH1:k/t/w:embedded/embedded/8",
      "DBG_TECH1:k/t/w:unity3d/gamedev/8",
      "DBG_TECH1:k/t/w:unity3d/mobile/5",
      "DBG_TECH1:k/t/w:unreal-engine/gamedev/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=14, mobile=5, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=16, php=0, embedded=8, frontend=0}",
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/gamedev",
      "TITLE1/dev",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "Sony",
      "sameAs": "https://www.sie.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2019 3:41:37 PM",
    "validThrough": "Sep 18, 2019 3:41:37 PM",
    "crawled": "Sep 11, 2019 4:07:14 PM",
    "content": "<h3>Staff Software Engineer, Game Systems at <span>Sony</span></h3><div><span><i></i> Remote</span>        </div><div>            <p><strong>Location:</strong> <strong>Remote Employment Eligible</strong></p><p>PlayStation isn’t just the Best Place to Play it’s also the Best Place to Work. We’ve thrilled gamers since 1994, when we launched the original PlayStation. Today, we’re recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation.</p><p><strong>Staff Software Engineer, Game Systems </strong></p><p><strong>Remote </strong><strong>employment</strong><strong> eligible.</strong></p><p>We will consider staff to senior-staff level professional experience.</p><p>How would you like to influence the next generation of the most successful gaming platform of all time? Does it interest you to develop technology used by every single next generation PlayStation developer? We are offering a career opportunity combining both your passion and skills as a software engineer while also allowing you to work with state-of-the-art technology.</p><p>The Worldwide Studios Platform Architecture Group lives at the intersection of PlayStation’s game and platform development. We seek an engineer to develop CPU and IO-focused technologies for a wide range of games and internal systems. If this is you please apply!</p><p><strong>Responsibilities:</strong></p><ul><li>You will enhance our platform technologies and tools including but not limited to:<ul><li>Runtime I/O stack</li><li>Compression and decompression technologies</li><li>I/O and storage device simulation</li></ul></li><li>Liaise with highly motivated teams to effectively apply these innovative technologies</li><li>Provide performance analysis and optimization of game titles and system software</li></ul><p><strong>Qualifications</strong></p><ul><li>A min. of 5 years professional experience working with games, embedded systems or kernel development, including direct experience in one or more of:<ul><li>Game streaming systems</li><li>Memory management and memory mapping</li><li>Filesystem development</li></ul></li><li>Strength and a real passion for C and C++ programming</li><li>Prior exposure to CPU profiling and performance analysis tools</li><li>Excellent ability in testing and debugging complex systems</li><li>Great interpersonal skills (written and oral)</li><li>An interest in games and a dream to create something better</li></ul><p><strong>Nice-to-Have:</strong></p><ul><li>Development on the PlayStation platforms or equivalent experience</li><li>Experience of Unity or Unreal Engine or equivalent experience</li><li>Deep knowledge of FreeBSD or Linux kernel development</li><li>Familiarity with LLVM</li><li>Japanese language skills</li></ul><p>Sony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, gender identity, marital status, genetic information or membership in any other legally protected category.</p><p>We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.</p><p>We sincerely appreciate the time and effort you spent in contacting us and we thank you for your interest in PlayStation.</p>        </div><div>        <a href='https://boards.greenhouse.io/sonyinteractiveentertainmentplaystation/jobs/1788412' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
