{
 "items": [
  {
    "id": "7Nhs0N7-S26_1E75XTcMnw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/162978/software-engineer-data-team-britecore?a=SEMsaELTLzi",
    "title": "Software Engineer (Data Team) at BriteCore (Springfield, MO) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Insurance, Web Development</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>BriteCore is looking for creative Software Engineers for our Data team. Product Development is the branch of the company responsible for building new replacement modules for BriteCore, our flagship cloud-based insurance software.</p><p><strong>Your job will involve...</strong></p><p>● Maintaining our current ETL, DWH and reports using Python, SQL and Pandas</p><p>● Developing new vendor integrations using external APIs</p><p>● Developing new reports using Python, Pandas and SQL</p><p>● Designing and developing new products including DWH, Dashboards and Reports using different AWS solutions</p><p>● Solving support tickets and new funded requests coming from our current clients</p><p>● Collaborating with other Product Development engineers Benefits and Compensation</p><p>● $50k-$70k based on experience and proven performance</p><p>● Benefit from working alongside and observing world-class developers first hand</p><p>● Comprehensive health insurance coverage including medical, dental, and vision</p><p>● Flexible schedule</p><p>● Relaxed work environment</p><p>● Remote work</p><p>● Flexible learning time - explore your ideas and new technologies on the clock</p><p><strong>Technologies You Will Utilize </strong></p><p>● Python ● Django ● Pandas ● SQLAlchemy and SQL ● MySQL ● GitHub ● Linux (Command line knowledge such as BASH, ZSH, or FISH) ● Amazon Web Services ● Docker</p><p><strong>We Will Expect You To</strong></p><p>● Communicate clearly and fluently in English both verbally and written (native or advanced level required since you will interact with clients frequently)</p><p>● Stay familiar with the latest web development trends</p><p>● Follow industry best practices</p><p>● Be friendly, confident, and patient with others</p><p>● Communicate clearly and effectively over chat and video conference</p><p>● Ship code on time</p><p>● Self-direct</p><p>● Welcome feedback and collaboration</p>                    </div>                            <h2>                About BriteCore            </h2>            <div><p>At BriteCore, we build gorgeous, scalable, and usable cloud-based insurance software. This is a company founded by, and run by software engineers. We have created a team of top performers developing modern systems for the insurance industry. Our team enjoys working together, and takes tremendous pride and ownership in our platform. <br><br>We promote a high quality of life for our employees by allowing them to choose their own schedule and location. Bring creativity, focus, and productivity to your job, and enjoy 40 hour work weeks, flexible paid time off, and remote work.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Hours                            </div>                            <div>                                 3+ weeks Paid Time Off                            </div>                            <div>                                 Competitive Compensation                            </div>                            <div>                                 Comprehensive Health Insurance                            </div>                            <div>                                 Most employees work remotely                            </div>                            <div>                                 Relaxed Work Environment                            </div>                            <div>                                 Explore ideas, new technologies on the clock                            </div>                            <div>                                 Annually attend a conference of your choice                            </div>                            <div>                                 Work alongside talented developers                            </div>                            <div>                                 Can buy shares of company stock                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 10:59:50 PM",
    "tags": [
      "DBG_TECH1:k_t_w:django_python_8",
      "DBG_TECH1:k_t_w:pandas_python_15",
      "DBG_TECH1:k_t_w:python_python_6",
      "DBG_TECH1:k_t_w:sqlalchemy_python_8",
      "DBG_TECH1:techWeightMap:{python=37, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_python",
      "TECH2_amazon-web-services",
      "TECH2_django",
      "TECH2_docker",
      "TECH2_python",
      "TECH2_sql",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "django",
      "docker",
      "python",
      "sql"
    ]
  },
  {
    "id": "JXHhRZ58QbaEf_rz2_FE3A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/64234/senior%e2%80%8b-%e2%80%8bpython%e2%80%8b-%e2%80%8bdeveloper%e2%80%8b-at-causalens/",
    "title": "Senior​ ​Python​ ​Developer​",
    "content": "Senior Python Developer - Full Time (Remote)<br /><br />Summary<br /><br />We are looking for a motivated and high-achieving Senior Python Developer based anywhere in<br />Europe to join the team working on an exciting new Big Data/Machine Learning platform. This is<br />a full time placement with significant opportunities for growth and advancement as one of the<br />first employees of the company.<br /><br />The Company<br /><br />causaLens is high-tech startup based in London. We are bringing machine learning and big data<br />technologies to the World’s leading asset managers. We are an extraordinary team and the<br />founders have worked for some of the most prominent global hedge funds and scientific<br />institutions.<br /><br />Core requirements<br /><br />* Smart, capable and can write clean code.<br />* Ability to design and architect high-performance distributed software.<br />* Development experience in at least one scripting language - preferably Python.<br />* Interest in machine learning/big data (prior experience plus).<br />* Knowledge of the Git version control system.<br />* Good organisational skills both in management of time and code.<br />* Ability to effectively work remotely (from home or a coworking space).<br /><br />Roles and Responsibilities<br /><br />Developing a big data platform for quantitative finance. The application stack is Python, Numpy,<br />Scipy, Sklearn, Keras, Django, Celery, Postgres, AWS, GCP.<br /><br />Benefits<br /><br />Successful candidate will have the opportunity to join a fast-growing, agile, and international<br />team passionate about innovation and making a difference. We will offer guidance, mentorship,<br />and opportunities for professional development.",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 5:43:30 PM",
    "tags": [
      "DBG_TECH1:k_t_w:django_python_8",
      "DBG_TECH1:k_t_w:keras_bigdata-ml_8",
      "DBG_TECH1:k_t_w:machine-learning_bigdata-ml_8",
      "DBG_TECH1:k_t_w:numpy_python_5",
      "DBG_TECH1:k_t_w:python_python_6",
      "DBG_TECH1:k_t_w:scikit-learn_bigdata-ml_8",
      "DBG_TECH1:k_t_w:scikit-learn_python_5",
      "DBG_TECH1:k_t_w:scipy_python_5",
      "DBG_TECH1:techWeightMap:{python=29, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=24, ruby=0}",
      "REMOTE1_50",
      "TECH1_bigdata-ml",
      "TECH1_python",
      "TITLE1_dev",
      "TZ_Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "python"
    ]
  },
  {
    "id": "CxXuH-GtRu2ougNTXBRBqQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4040-senior-software-engineer-tiledb",
    "title": "Senior Software Engineer @ TileDB",
    "content": "<h2>              Senior Software Engineer<small> @ TileDB</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-12-05 21:27</p></dd>          <dt><span>Description</span></dt>          <dd><h5>DESCRIPTION</h5><p>We are looking for a Senior Software Engineer to contribute to the development of the TileDB array management system and build new exciting features and tools for scientific applications, such as genomics, medical imaging, point cloud data and more. You should have a strong systems development background and excellent organization and problem-solving skills. Your goal will be to develop high-quality software that is aligned with user needs and business goals.</p><p><strong>Responsibilities</strong></p><ul><li>Develop high-quality software design and architecture</li><li>Identify, prioritize and execute tasks in the software development life cycle</li><li>Develop tools and applications by producing clean, efficient code</li><li>Automate tasks through appropriate tools and scripting</li><li>Review and debug code</li><li>Perform validation and verification testing</li><li>Collaborate with internal teams and vendors to fix and improve products</li><li>Document development phases and monitor systems</li><li>Ensure software is up-to-date with latest technologies</li></ul><h5>REQUIREMENTS</h5><ul><li>MSc or PhD in Computer Science or related experience</li><li>Strong experience with C/C++</li><li>Extensive experience in software development, scripting and project management</li><li>Experience using Github and automated testing frameworks</li><li>Analytical mind with problem-solving aptitude</li><li>Ability to work independently</li><li>Excellent organizational and leadership skills</li><li>Knowledge of distributed platforms (e.g., HDFS, Azure, S3, Spark)</li><li>Knowledge of data science programming languages and tools (e.g. Python, NumPy, Pandas, R, Matlab)</li><li>Knowledge of high performance computing libraries (e.g., MPI)</li><li>Knowledge of Linear Algebra computational packages (e.g., BLAS, LAPACK)</li></ul><h5>BENEFITS</h5><p>TileDB, Inc. offers very competitive compensation and benefits, which include:</p><ul><li>Health Care Plan (Medical)</li><li>Stock Option Plan</li><li>Paid Time Off (Vacation, Sick &amp; Public Holidays)</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 11:27:46 PM",
    "tags": [
      "DBG_TECH1:k_t_w:matlab_bigdata-ml_8",
      "DBG_TECH1:k_t_w:numpy_python_5",
      "DBG_TECH1:k_t_w:pandas_python_5",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=12, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=8, ruby=0}",
      "REMOTE1_100",
      "TECH1_python",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "R_qLtBwQS7qhFkVc9sOHXg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4013-senior-software-engineer-parse-ly",
    "title": "Senior Software Engineer @ Parse.ly",
    "content": "<h2>              Senior Software Engineer<small> @ Parse.ly</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-11-24 17:44</p></dd>          <dt><span>Description</span></dt>          <dd><p>Do you enjoy distributed systems, large-scale data analysis, and modern open source stacks? Do you also enjoy engineering management books, and believe in  the value of engineering apprenticeship, which can allow junior engineers to level up in their career? If so, you might enjoy being a Senior Software Engineer at Parse.ly.</p><p>First, let’s answer a key question: what’s Parse.ly? Well, Parse.ly is a real-time content measurement layer for the entire web. Our analytics platform helps digital storytellers at some of the web's best sites, such as Arstechnica, The New Yorker, The Wall Street Journal, TechCrunch, The Intercept, Mashable, and many more. In total, our analytics system handles over 65 billion monthly events from over 1 billion monthly unique visitors.</p><p>Our entire stack is in Python and JavaScript, and our team has innovated in areas related to real-time analytics, building some of the best open source tools for working with modern stream processing technologies.</p><p>On the open source front, we maintain <a href='https://github.com/Parsely/streamparse' rel='nofollow'>streamparse</a>, the most widely used Python binding for the Apache Storm streaming data system. We also maintain <a href='https://github.com/Parsely/pykafka' rel='nofollow'>pykafka</a>, the most performant and Pythonic binding for Apache Kafka.</p><p>Our colleagues are talented: our UX/design team has also built one of the best-looking dashboards on the planet, using AngularJS and D3.js, and our infrastructure engineers have built a scalable devops-friendly cloud environment.</p><p>As a Senior Software Engineer, you would master our backend stack -- or,  fill in whatever gaps you might be missing if you already know some of our technologies. But you’d also spend a portion of your time defining a roadmap for our “Customer Success Engineering” group, which is a group of bright engineers, more junior in their career, who are focusing on customer-facing and customer-deployed data integration challenges. It’s an ideal opportunity to put your programming skills to use, while also flexing some engineering and project management skills, to boot.</p><h4>Responsibilities</h4><p>Parse.ly’s data engineering team already makes use of modern technologies like Python, Storm, Spark, Kafka, and Elasticsearch to analyze large datasets. As a Software Engineer at Parse.ly, you will be expected to master these technologies, while also being able to write code against them in Python, and debug issues down to the native C code and native JVM code layers, as necessary.</p><p>However, your focus will be on deep understanding, commensurate with your technical background. Our product is widely used by over 250 enterprises with over 30,000 active seats, each of whom is viewing our data on a regular basis, and we have a team of engineers who help assist these customers with understanding their data, debugging data integration problems, and investigating code and data discrepancies. You would lead this team with its own focused roadmap of how to apply programming skills to solve customer problems.</p><p>Examples of past projects this team has built:</p><ul><li>A page data debugging tool, using web crawling</li><li>An automated system for re-processing customer data to correct historical errors</li><li>A public API explorer tool, for understanding how to use our HTTP/JSON API</li><li>An admin panel for tracking customer usage, pricing tiers, and invites</li><li>An Amazon Redshift based data warehouse for doing product usage analytics</li></ul><p>If you get excited by the idea of specifying and clarifying requirements around “quick-win” engineering projects that have a huge impact on the business and on how our customers interact with our support team, this is an ideal role for you.</p><h4>What you'll do</h4><p>For this role, you should already be a proficient programmer who wants to work with data at scale. You should already have, or be willing to gain, a full level of Python expertise.</p><p>In the role, you’ll...</p><ul><li>Write Python code using the best practices. See <a href='https://github.com/amontalenti/elements-of-python-style' rel='nofollow'>The Elements of Python Style</a>, written by our CTO, for an example of our approach to code readability and design.</li><li>Analyze data at massive scale. You need to be comfortable with the idea of your code running across 3,000 Python cores, thanks to process-level parallelization.</li><li>Brainstorm new ideas for how automation can solve problems for our customer success team. You need to be a good communicator, especially in written form.</li><li>Own a product roadmap for &quot;Customer Success Engineering&quot;, with a team of at least 5 junior engineers who would execute that roadmap.</li><li>Directly mentor these 5 engineers as they gain new skills in programming, web development, and data analysis.</li><li>Master cloud technologies and systems. You should love UNIX and be able to reason about distributed systems.</li></ul><h4>Benefits</h4><p>Our distributed team is best-in-class and we happily skip commutes by working out of our ergonomic home offices. Here's <a href='https://flic.kr/p/v1NZ73' rel='nofollow'>a photograph of our CTO's setup running two full-screen Parse.ly dashboards</a>.</p><ul><li>Work from home or anywhere else in our industry-leading distributed team.</li><li>Earn a competitive salary and benefits (health/dental/401k).</li><li>Splurge with a generous equipment budget.</li><li>Work with one of the brightest teams in tech.</li><li>Speak at and attend conferences like PyData on Parse.ly's dime.</li></ul><h4>Parse.ly Tech</h4><ul><li>Python for both backend and frontend -- 2.7, some systems in 3.x, and we're going full-on 3.x soon.</li><li>Amazon Web Services used for most systems.</li><li>Modern databases like Cassandra, ElasticSearch, Redis, and Postgres.</li><li>Frameworks like Django, Tornado and the PyData stack (e.g. Pandas).</li><li>Running Kafka, Storm, Spark in production atop massive data sets.</li><li>Easy system management with Fabric and Chef.</li></ul><h4>Fully distributed team</h4><p>Parse.ly is a fully distributed team, with engineers working from across the world. People with past experience working remotely will be prioritized. US/Eastern timezones will be prioritized.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>United States</p></dd>            <dt><span>Location</span></dt>            <dd><p>EST or CST (or nearby)</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Nov 24, 2017 7:34:08 PM",
    "tags": [
      "DBG_TECH1:k_t_w:angularjs_frontend_8",
      "DBG_TECH1:k_t_w:apache-storm_java_24",
      "DBG_TECH1:k_t_w:c_c_5",
      "DBG_TECH1:k_t_w:django_python_8",
      "DBG_TECH1:k_t_w:fabric_python_8",
      "DBG_TECH1:k_t_w:javascript_frontend_1",
      "DBG_TECH1:k_t_w:javascript_mobile_1",
      "DBG_TECH1:k_t_w:javascript_nodejs_1",
      "DBG_TECH1:k_t_w:pandas_python_5",
      "DBG_TECH1:k_t_w:python_python_20",
      "DBG_TECH1:techWeightMap:{python=41, java=24, dotnet=0, c=5, gamedev=0, mobile=1, php=0, nodejs=1, embedded=0, frontend=9, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_python",
      "TITLE1_dev",
      "TZ_America_East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "0oElmY-rQleutbfZYgnQnw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/153412/senior-python-engineer-sqlalchemy-graphql-plus-shiphero?a=PrSmEjwSXcY",
    "title": "Senior Python Engineer - SQLAlchemy, GraphQL + Business Logic. Talented Team at ShipHero () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>eCommerce, Logistics &amp; Distribution, SaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Hello. We are ShipHero (<a href='http://shiphero.com' rel='nofollow'>http://shiphero.com</a>). We have built a software platform entrusted by hundreds of ecommerce companies, large and small to run their operations. Many of our customers sell on Shopify and/or Amazon. We’re driven to help our customers grow their businesses, by providing a platform that solves complex problems, and is engineered to be reliable and fast. We are obsessed with building great technology, that is beautiful and easy to use. Our culture also reflects our ethos and belief that by bringing passionate, talented and great people together - you can do great things.</p><p>Our team is remote, with all our engineers either in New York or Argentina (BS AS and Mar del Plata). We do daily stand-ups via Google Hangouts and communicate regularly using video chat and Slack.</p><p>We are seeking a senior software engineer with extraordinary programming and analytic abilities. You would be a fundamental member of the team focusing on building a solid foundation for the platform. We seek people who are excited and driven to grow with the experience of working with talented engineers. We are obsessed with disrupting an industry that desperately needs it, by continuing to build tools that help make our customers do great things.</p><p><strong>About You</strong></p><ul><li>You understand that great things are accomplished when teams work together.</li><li>You’ve got lots of experience with Python, SQLAlchemy, FLASK and ideally GraphQL.</li><li>You have lots of AWS experience.</li><li>You can code review other team members work and provide assistance and appreciate feedback.</li><li>You take pride in your craft.</li><li>You’ve learned from building systems and solutions the reasons to avoid technical debt, and how to approach and implement TDD and CI practices.</li><li>You can craft elegant solutions when solving complex features and solutions.</li><li>You’ve worked on eCommerce solutions.</li><li>You want to build something that is disrupting an entire industry.</li><li>While hands on experience is not a requirement, you’re interested in learning how to apply machine learning and AI technologies and tools.</li><li>You can handle a fast paced environment.</li><li>You’ve made a lot of mistakes, and most importantly, have learned from them.</li></ul><p><strong>The Role</strong></p><ul><li>Work on a cross-functional team including front end and UX to build solutions that are easy for customers to understand, work consistently and scale well.</li><li>Review features and requirements and guide, design and implement solutions.</li><li>Understand business requirements and think through solutions in terms of not just the coding implementation but also how the solution fits into the solution and how it solves a customer need.</li><li>Ability to estimate effort and ship on agreed schedule. Comfortable pushing yourself and your team members when challenges pop up.</li><li>Lead regular code reviews, with the goal of code quality, good design and approach along with pushing engineers to improve and evolve.</li><li>Optimize existing tech stack and solutions, determine path to next step in the evolution.</li><li>Learn, and push those around you to do the same - this is a craft that you’re constantly improving upon.</li><li>Implement solutions that are pragmatic to get the platform built.</li><li>Have the confidence to work with experienced and talented people to just build great things, you’re not a “rockstar”.</li><li>Work with ShipHero leadership to implement practices and principles for the team.</li></ul><p><br><br><br></p>                    </div>                            <h2>                About ShipHero            </h2>            <div><p>Hello. We are ShipHero (<a href='http://shiphero.com' rel='nofollow'>http://shiphero.com</a>). We have built a software platform entrusted by hundreds of ecommerce companies, large and small to run their operations and we continue to grow. Many of our customers sell on Shopify and/or Amazon. We’re driven to help our customers grow their businesses, by providing a platform that solves complex problems, and is engineered to be reliable and fast. We are obsessed with building great technology, that is beautiful, easy to use and is loved by our customers. Our culture also reflects our ethos and belief that by bringing passionate, talented and great people together - you can do great things.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Team Members distributed in the US and Argentina.                            </div>                            <div>                                 Talented and experienced engineering team.                            </div>                            <div>                                 Work with ShipHero leadership to implement practices and principles                            </div>                            <div>                                 Interesting business problems to solve, that require in-depth thinking                            </div>                            <div>                                 Disrupting an industry that needs it by building great software.                            </div>                            <div>                                 Think through and build completely new product lines for the business                            </div>                            <div>                                 Work with other talented team mates in Argentina                            </div>                            <div>                                 Help shape the future of ecom and fulfillment                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 18, 2017 10:29:16 PM",
    "tags": [
      "DBG_TECH1:k_t_w:artificial-intelligence_bigdata-ml_5",
      "DBG_TECH1:k_t_w:flask_python_8",
      "DBG_TECH1:k_t_w:machine-learning_bigdata-ml_8",
      "DBG_TECH1:k_t_w:python_python_4",
      "DBG_TECH1:k_t_w:sqlalchemy_python_16",
      "DBG_TECH1:techWeightMap:{python=28, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=13, ruby=0}",
      "REMOTE1_100",
      "TECH1_python",
      "TECH2_amazon-web-services",
      "TECH2_flask",
      "TECH2_graphql",
      "TECH2_python",
      "TECH2_sqlalchemy",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "flask",
      "graphql",
      "python",
      "sqlalchemy"
    ]
  },
  {
    "id": "6g68kKZkTXy0uQg6SahY0w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159976/software-engineer-in-test-carbon-black?a=REmoRaPZmdW",
    "title": "Software Engineer in Test at Carbon Black (Portland, OR) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Computer Software, Cybersecurity, Information Technology</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>501-1k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Why Carbon Black?</strong></p><p>At Carbon Black, you’ll have the chance to make an impact in the ever-evolving cybersecurity space. Our advanced technology tackles even the toughest challenges and stays ahead of the latest threats.&nbsp;If you want to join an agile company that’s building bleeding edge technology in the cloud, Carbon Black is the place for you. Driven by passionate people who are dedicated to making the world safer, it’s no wonder we’ve been named a “Top Place to Work” by the Boston Globe for three consecutive years. Join us!</p><p><strong>Why You Matter</strong></p><p>We at Carbon Black are seeking a highly technical continuous learner to fill a critical SDET position. In this role, you will work closely with developers to build out and maintain automation infrastructure as well as contribute in active ways to the test automation and product code. You will have the opportunity to work actively as part of an agile team focused on the world’s leading network endpoint security solutions, and gain exposure to cutting edge technology.</p><p><strong>What You’ll Do</strong></p><ul><li>Develop and maintain test infrastructure and supporting libraries and contribute to system, API, and component automated tests</li><li>Integrate automation into the build system</li><li>Assist in automation adoption within engineering organization</li><li>Work with developers on improving the system quality (during design and implementation phases)</li><li>Assist where needed on other development tasks as a member of the Scrum team</li></ul><p><strong>What You’ll Bring</strong></p><ul><li>Strong programming skills in Python (with C/C++ experience also preferred)</li><li>Strong track record of exploring and implementing new technologies and specializing in multiple technical disciplines</li><li>Experience with VMWare, VSphere, and Vagrant</li><li>Experience with Jenkins, including Pipelines and other more advanced features</li><li>Solid understanding of core Quality Engineering principles and best practices</li><li>Solid experience with the software development cycle, including common tools (e.g.&nbsp;&nbsp;Jira,&nbsp;git, SVN, etc.)</li><li>Ability to function well in an Agile development team, with a functional knowledge of Agile Scrum methodology</li><li>Experience with AWS</li></ul><p><strong>Preferred:</strong></p><ul><li>BS in Computer Science or related discipline</li><li>3-5 years’ experience working in a Quality Engineering role, with a strong level of exposure to implementing, improving, and maintaining test infrastructure</li><li>2+ years’ experience writing either production code or extensive automation code for distributed enterprise products in a professional context</li><li>2+ years’ experience working with and configuring Jenkins, Team City or other similar CI tools</li><li>Kernel driver or other deeper programming exposure or experience</li><li>Experience with cyber security</li></ul>                    </div>                            <h2>                About Carbon Black            </h2>            <div><p><strong>Who We Are</strong></p><p>Carbon Black is the leading provider of next-generation endpoint security. Carbon Black’s Next-Generation Antivirus (NGAV) solution, Cb Defense, leverages breakthrough prevention technology, “Streaming Prevention,” to instantly see and stop cyberattacks before they execute. Cb Defense uniquely combines breakthrough prevention with market-leading detection and response into a single, lightweight agent delivered through the cloud. With more than 7 million endpoints under management, Carbon Black has more than 2,500 customers, including 30 of the Fortune 100. These customers use Carbon Black to replace legacy antivirus, lock down critical systems, hunt threats, and protect their endpoints from the most advanced cyberattacks, including non-malware attacks.<br><br><em>Carbon Black, Inc. is an EEO/AA employer.</em>&nbsp;<em>Carbon Black is an inclusive employer that believes in workplace equality, supports diversity, creates a welcoming environment, and respects the unique qualities each individual brings to the company.</em>&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible vacation                            </div>                            <div>                                 Remote/Work-from-home options                            </div>                            <div>                                 Medical/Dental/Vision                            </div>                            <div>                                 Stand-up desks and unique workspaces                            </div>                            <div>                                 Free snacks/drinks, Happy Hours, and regular catering                            </div>                            <div>                                 Care.com access and pet insurance                            </div>                            <div>                                 On-site gym                            </div>                            <div>                                 Career development programs                            </div>                            <div>                                 Lounge/game room                            </div>                            <div>                                 Competitive salaries, 401k, and stock options                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=2, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_50",
      "TECH1_python",
      "TECH2_agile",
      "TECH2_automation",
      "TECH2_jenkins",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "agile",
      "automation",
      "jenkins",
      "python"
    ]
  },
  {
    "id": "DhifH8wnSqmgn_k5rKVWrQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62960",
    "title": "Senior Python Software Engineer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Want to work remotely as a full time developer for a company that has been writing software for 35 years but is also using the latest technologies? We are currently looking to add a remote back end web developer to our team rewriting our existing software products from scratch. You will work on the team which is responsible for developing the entire application stack. You will need to collaborate with other team members to solve problems and design systems that meet the specified requirements.</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 10, 2017 12:17:15 AM",
    "tags": [
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=2, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_python",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "VpiuKZfFSOaCU2vhxU3yNw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/158585/software-engineer-qntfy?a=Rbrbga58VEs",
    "title": "Software Engineer at Qntfy (Arlington, VA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Behavioral Analytics, Data &amp; Analytics, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Software Engineer</strong></p><p>Qntfy is looking for a talented and highly motivated software engineer to join our development team. This team is responsible for building robust, flexible, and performant services and APIs. We like to move fast and aren’t beholden to any single technology, but we do have some favorites. An ideal candidate will have experience with, or the ability to figure out quickly, technologies like Kafka, Docker, gRPC, Redis, and Cassandra. Go has become our language of choice, but we do plenty of work in Python and Java too.</p><p><strong>Responsibilities:</strong></p><ul><li>Communicate with peers, customers, and partners to foster cooperation and development.</li><li>Design and implement major new features for our platform.</li><li>Translate customer needs into usable services.</li><li>Effectively estimate time to implement designs.</li><li>Write and test code for highly available and high volume workloads.</li></ul><p><strong>Qualifications:</strong></p><ul><li>BS or Master’s degree in Computer Science, related degree, or equivalent experience.</li><li>3+ years experience with software engineering and service design skills.</li><li>Write well-structured, maintainable, idiomatic code with good documentation.</li><li>Strong work-ethic and passion for problem solving.</li></ul><p><strong>Preferred Qualifications:</strong></p><ul><li>Experience with Golang and Python development (Especially with frameworks like Gin and Flask).</li><li>Experience writing flexible APIs and deploying them in production environments.</li><li>Proficiency with a range of SQL and NoSQL databases.</li><li>Strong understanding of microservice oriented architecture</li></ul>                    </div>                            <h2>                About Qntfy            </h2>            <div><p>We are a distributed team of engineers, data scientists, and psychologists covering every corner of the US and a few more internationally. We love to use the latest technology to bridge the gap between data science and human behavior. We solve hard problems fast&nbsp;while ensuring our solutions scale.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote Work                            </div>                            <div>                                 401k                            </div>                            <div>                                 Full Medical Benefits                            </div>                            <div>                                 Flexible Hours                            </div>                            <div>                                 Unlimited Paid Time Off                            </div>                            <div>                                 Travel Reimbursement                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``benefit 2N 2N(remot,work)",
      "DBG_TECH1:k_t_w:flask_python_8",
      "DBG_TECH1:k_t_w:java_java_2",
      "DBG_TECH1:k_t_w:java_mobile_1",
      "DBG_TECH1:k_t_w:python_python_4",
      "DBG_TECH1:techWeightMap:{python=12, java=2, dotnet=0, c=0, gamedev=0, mobile=1, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_python",
      "TECH2_api",
      "TECH2_docker",
      "TECH2_go",
      "TECH2_grpc",
      "TECH2_python",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "api",
      "docker",
      "go",
      "grpc",
      "python"
    ]
  },
  {
    "id": "HAA-3kZ6QNqBOXlAFyifFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/149133/python-developer-web-scraping-scrapinghub?a=O0U3vEcJzIQ",
    "title": "Python Developer - Web Scraping at Scrapinghub () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div>Scrapinghub is looking for experienced and senior software engineers to join our Professional Services team to work on web crawler development with Scrapy, our flagship open source project.Are you interested in building web crawlers harnessing the Scrapinghub platform, which powers crawls of over 3 billion pages a month? Do you like working in a company with a strong open source foundation? Scrapinghub helps companies, ranging from Fortune 500 enterprises to up and coming early stage startups, turn web content into useful data with a cloud-based web crawling platform, off-the-shelf datasets, and turn-key web scraping services.Join us in making the world a better place for web crawler developers with our team of top talented engineers working remotely from more than 30 countries.Role Responsibilities:&nbsp;<ul><li>Design, develop and maintain Scrapy web crawlers</li><li>Leverage the Scrapinghub platform and our open source projects to perform distributed information extraction, retrieval and data processing</li><li>Identify and resolve performance and scalability issues with distributed crawling at scale</li><li>Help identify, debug and fix problems with open source projects, including Scrapy</li></ul>Scrapinghub’s platform and Professional Services offerings have been growing tremendously over the past couple of years but there are a lot of big projects waiting in the pipeline, and in this role you would be a key part of that process. Here’s what we’re looking for:About You:&nbsp;<ul><li>2+ years of software development experience.</li><li>Solid Python knowledge.</li><li>Scrapy experience a plus.</li><li>Familiarity with Linux/UNIX, HTTP, HTML, Javascript and Networking.</li><li>Good communication in written and spoken English.</li><li>Availability to work full time.</li></ul>                    </div>                            <h2>                About Scrapinghub            </h2>            <div><p>Founded in 2010, Scrapinghub is a fast growing and diverse technology business turning web content into useful data through use of our open source projects, such as Scrapy web crawling framework.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible working hours                            </div>                            <div>                                 Remote working                            </div>                            <div>                                 Paid time off                            </div>                            <div>                                 Paid open source work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``benefit 2N 2N(remot,work)",
      "DBG_TECH1:k_t_w:javascript_frontend_1",
      "DBG_TECH1:k_t_w:javascript_mobile_1",
      "DBG_TECH1:k_t_w:javascript_nodejs_1",
      "DBG_TECH1:k_t_w:python_python_4",
      "DBG_TECH1:k_t_w:scrapy_python_32",
      "DBG_TECH1:techWeightMap:{python=36, java=0, dotnet=0, c=0, gamedev=0, mobile=1, php=0, nodejs=1, embedded=0, frontend=1, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_python",
      "TECH2_python",
      "TECH2_scrapy",
      "TECH2_scrapy-spider",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "python",
      "scrapy",
      "scrapy-spider"
    ]
  },
  {
    "id": "u8zyyuAbSBG1g_k9vqAS_Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/129873/full-stack-engineer-build-the-smartest-way-to-unhaggle-inc?a=HyqRHMOS6pG",
    "title": "Full Stack Engineer - Build the smartest way to buy a car (Remote) at Unhaggle Inc. () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, DevOps</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Automotive</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Unhaggle is currently the #1 web portal in Canada for new car buying. The data we provide powers our own tools and products, including our flagship consumer car buying service at Unhaggle.com and leading automotive portals including Yahoo Autos, MSN Autos, Autofocus, AutoGuide, Globe Drive, and others. We have also recently partnered with auto makers to launch a large eCommerce platform allowing the complete purchase of new cars online.</p><p>We are looking for full stack&nbsp;developers with <strong>Strong Python skills</strong> and experience with web application development. This is a full-time remote position, we accept applications from anywhere in the world.&nbsp;</p><p>We use GitHub to manage tasks and code reviews as well as tools/services like Travis-CI, Docker, New Relic, Sentry, Browserstack, Stripe, Twilio&nbsp; and Redis. Our dev team is regularly connected in Slack for communication. We are constantly seeking the best tools available for our development team.</p><p>You will be primarily involved in the following projects/areas:</p><p>* Our new eCommerce platform for new car buying, serving major car brands<br>* Our web portal unhaggle.com<br>* Several enterprise SaaS products, some more info here&nbsp;<a href='https://www.motoinsight.com' rel='nofollow'>https://www.motoinsight.com</a></p><p>* REST APIs, for integration with different partners<br>* An internal and innovative SaaS web application we built for industry clients<br>* Widgets we built for third-party integration, they run in some of the most popular auto websites in Canada.<br>* Maintenance of our test suite and code base<br>* Implementation of new features<br>* We take quality seriously and you should expect to be involved in well written code bases following standards such as PEP-8 and good software engineering practices.</p><p><strong>Skills &amp; Requirements</strong></p><p>* Strong hands on experience with Python, experience with Django is important, but we might still be willing to consider candidates with strong Python skills and none or little knowledge with Django.<br>* Strong web development experience: we expect that you know XHTML, CSS and Javascript well. Hands on experience with Javascript frameworks&nbsp; is a big plus<br>* Track record of delivering completed projects, preferably web-based<br>* Good SQL knowledge and databases, PostgreSQL is a plus<br>* You should be very familiar with Linux<br>* Experience using version control software, Git is a plus<br>* Understanding of code best practices and standards. We also expect that you follow PEP-8 style guide and&nbsp;are familiar with tools like Pyflakes and Pylint.<br>* Experience writing Python test cases is a plus. Prior experience with TDD and/or Selenium is a plus.<br>* Easy-going personality. You will actively participate in design discussions and code review</p><p>This position might grow into a technical lead position. Experience leading development teams is a plus.</p>                    </div>                            <h2>                About Unhaggle Inc.            </h2>            <div><p>We are helping consumers to get the best price on new cars in Canada and changing the industry along the way. &nbsp;Working at Unhaggle brings unique challenges, you will have the opportunity to leave a large footprint and have real impact in the product we ship every day to our customers.</p>            </div>        ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k_t_w:css_frontend_3",
      "DBG_TECH1:k_t_w:django_python_8",
      "DBG_TECH1:k_t_w:javascript_frontend_2",
      "DBG_TECH1:k_t_w:javascript_mobile_2",
      "DBG_TECH1:k_t_w:javascript_nodejs_2",
      "DBG_TECH1:k_t_w:python_python_8",
      "DBG_TECH1:techWeightMap:{python=16, java=0, dotnet=0, c=0, gamedev=0, mobile=2, php=0, nodejs=2, embedded=0, frontend=5, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_python",
      "TECH2_devops",
      "TECH2_django",
      "TECH2_javascript",
      "TECH2_postgresql",
      "TECH2_python",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "devops",
      "django",
      "javascript",
      "postgresql",
      "python"
    ]
  },
  {
    "id": "wYxntckPSiCSyhAdR-W7xQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/143954/full-stack-web-developer-python-react-sql-level-12?a=MhdvkEqezMA",
    "title": "Full Stack Web Developer - Python, React, SQL (Mid-Level & Senior/Lead) at Level 12 (Jeffersonville, IN) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Agile Software Development, Software Consulting, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are looking for two full stack (Python) web application developers to join the team at Level 12.&nbsp; One position is Mid-Level and the other is for Senior/Engineering Lead.</p><p><strong>TL;DR: Why Consider This Position?</strong></p><ul><li>We give you <strong>a lot of information</strong> in the job description so that you can figure out if you'd really like to work here.</li><li>We have a commitment to transparency and offer a “no surprises experience” throughout the interview and hiring process.</li><li>We practice and preach sound development practices. You are likely to <strong>learn and grow as a developer</strong> while working here.</li><li>Our pay and benefits will be somewhere between good and great, depending on what you are used to and where you live (see below for specifics).</li><li>You will have the option of <strong>working from home or our office</strong>, whatever suits you best. Let’s make the most of our time and minimize commuting when not necessary.</li><li>We have a no-drama office policy. We value and cultivate enjoyable working relationships among team members.</li><li>We emphasize work/life balance and adopt policies that make sure our people don’t get burnt out. For instance, our PTO/Vacation policies are <strong>designed so that you actually use them.</strong></li><li>A commitment to Agile Principles while not being enslaved to any particular methodology.</li><li>You have the skills and experience to be a mid-level or senior level full-stack web application developer. That is, you need to be able to architect &amp; run with a medium sized project mostly on your own.</li><li>You like building full stack web applications with technologies like Python, React, SQL, etc.</li><li>You are <strong>committed to automated testing</strong> of all the software you write (our apps typically have 92%+ test coverage).</li><li>You recognized that there is a lot of idealism in the software development community and are not disenchanted with the the day-to-day realities of programming.</li><li>You like working independently but can contribute to a team as needed</li><li>If you apply, we will give you a yay or nay response. No black holes here!</li></ul><p><strong>Daily Responsibilities</strong></p><p>Daily responsibilities primarily consist of coding database-driven web applications and other web-related development work. In a typical day, you will likely work mostly with Python based web applications using frameworks like Django or Flask that interact heavily with a database (PostgreSQL or MSSQL).&nbsp; In the course of that work, you will have to interact with related technologies like JavaScript, React, HTML, and CSS/SASS.</p><p>This is not a design job. It will require a lot of in-depth programming and database work including the ability to architect maintainable code that gets the job done.</p><p>While we do prefer to do most of our back-end work in Python, we will occasionally take projects in other languages if they seem to be a good fit for us and the customer.</p><p>Some days you will jump from project to project as issues come up. At other times you may work primarily on one project for weeks or months.</p><p>The ability to take ownership for a project, engineer a sound technical solution, and “drive” a project to completion is <strong>essential</strong>.</p><p>Our customers have varied needs and so we tend to have varied responsibilities and projects. We have a focus on serving the customer and making software conform to their company rather than making the company conform to software.</p><p><strong>What We Offer</strong></p><ul><li>Pay: $75K-95K (Mid-Level) and $95-115K (Senior/Lead).<br><ul><li>We are happy to talk about money as one of the first parts of our conversation so we don’t waste each others time if we aren’t in the ballpark.</li><li>Everyone wants to be paid as much as possible, but the economics of business usually require that we meet in the middle.</li><li>Our offer will take into consideration your salary history, experience, references, and a skills assessment.</li></ul></li><li>Profit Sharing: In addition to a salary, our employees will earn a bonus based on how profitable our company is each year (roughly $1-2K annually).</li><li>One of the best things about working for us is that we really value work/family balance.<ul><li>We rarely work more than 40 hours a week.</li><li>We recently gave everyone an extra day off for Valentine’s Day just for extra quality time with their family.</li><li>I know there are devs out there putting in 50-60 hours a week. We can give them 10-20 hours a week of their life back.</li></ul></li><li>PTO/Vacation:<ul><li>Everyone receives 3 weeks of PTO/Vacation per year.</li><li>Up to 12 sick days per year.</li><li>9 Holidays</li></ul></li><li>Healthcare: We provide a stipend to offset the cost of health insurance</li><li>Flexibility: While we expect a regular schedule during normal business hours, we are pretty flexible when schedule changes are needed for legitimate reasons.</li><li>Telecommuting:<ul><li>Remote candidates are welcome to apply.</li><li>Many of us work from home frequently, even those of us who are local.</li><li>If you are local, we do have an office if you prefer to get away from home to focus on work.</li></ul></li><li>We Care: It’s easy to say, harder to do. We all need to make a living, our company needs to be successful in the marketplace, and hard decisions sometimes need to be made. But, at the end of the day, we really care about our employees, their families, their needs, and their desires.</li></ul><p><strong>Full Job Description &amp; Application Instructions<br></strong></p><p>Above are just highlights. The full job description for both positions are on our website and includes salary information, videos, and instructions on applying: <a href='https://level12.io/careers/' rel='nofollow'>https://level12.io/careers/</a></p><p><strong>Skills &amp; Requirements</strong></p><p><strong>Character First</strong></p><p>Level 12 is <a href='https://www.level12.io/about/' rel='nofollow'>founded on biblical principles</a> and has biblically informed goals. Accordingly, the reputation of Level 12 and the character of our employees is of utmost importance. You <strong>do not</strong> need to share our leadership's religious convictions, but you will need to share our commitment to the following principles:</p><ul><li><strong>Integrity</strong>: honest, trustworthy, reliable, ethical. We have high moral standards and we expect our employees to share those standards. If you use pirated software or media, don’t mind “tweaking” the truth, or think `porn == entertainment`, this is not the job for you!</li><li><strong>Good work ethic</strong>: you work hard and like to work hard. You also work efficiently, seeking to make the best use of your time.</li><li><strong>Dedicated</strong>: you really desire to contribute to and improve our company; you are not just earning a paycheck. You demonstrate a high level of “ownership” for and initiative with projects that are assigned to you.</li><li><strong>Teachable</strong>: you have a willingness and desire for feedback/correction. You are always looking to improve. You are willing to ask for help even if it makes you “look bad.”</li><li><strong>Resourceful</strong>: you know how to solve problems or are at least able to explain that the problem is not solvable with the requirements given. You use all resources at your disposal in an efficient manner to troubleshoot. You know when to ask someone for help and when more effort is needed on your part.</li><li><strong>Technical Prowess</strong>: you just “get” programming, computers, technology. The thought of solving a problem in an entirely new programming language, one you have never even heard of before, excites you.</li><li><strong>Technical Diversity</strong>: while we all have our preferences when it comes to programming languages or operating systems, you should be willing to work with anything, in any language, if that’s what it takes to get the job done. If you are easily lead into a “______ rocks, everything else sucks” mentality, this isn’t the job for you.</li><li><strong>Flexible</strong>: we are small, things change. You should be able to “roll with the punches.”</li><li><strong>Professional</strong>: at the end of the day, you like what you do, you take your job seriously, you do it extremely well, and you <strong>pay attention to the details</strong>!</li></ul><p><strong>Senior Developer &amp; Engineering Lead</strong></p><p>The candidate for the Senior Developer/Lead position will usually have 6-10 years relevant experience and meet the following requirements:</p><ol><li>Technical Skills<ul><li>Are able to write modular, well-tested, and maintainable code</li><li>Know a software development domain really well and radiate that knowledge to our team and beyond</li><li>Are able to work on multiple projects as needed</li></ul></li><li>Leadership<ul><li>Leads the design for customer projects with feedback from other engineers</li><li>Proposes new ideas for improving the development team, customer projects, and/or our tech stack</li><li>Adheres to and promotes our <a href='https://level12.io/blog/development-mission-statement/' rel='nofollow'>development culture and mission</a></li><li>Invests in other team members to see that they are growing as individuals and to facilitate productivity within our team.</li></ul></li><li>Code quality<ul><li>Leaves code in substantially better shape than before</li><li>Fixes bugs/regressions quickly</li><li>Monitors overall code quality/build failures</li><li>Creates tests religiously and makes sure the rest of the team is doing the same</li><li>Proactively identifies and reduces technical debt</li><li>Proactively defines and solves important architectural issues</li></ul></li><li>Communication<ul><li>Provides thorough and timely code feedback for peers</li><li>Able to communicate clearly on technical topics</li><li>Keeps issues up-to-date with progress</li><li>Helps guide other merge requests to completion</li><li>Helps with recruiting</li><li>Is able to manage conversations directly with customer contacts when needed.</li></ul></li><li>Performance &amp; Scalability<ul><li>Excellent at writing production-ready code with little assistance</li><li>Able to write complex code that can scale with a significant number of users</li><li>Avoids premature optimization</li></ul></li></ol><p><strong>Mid-Level Developer<br></strong></p><p>Mid-Level Developers usually have 3-6 years relevant experience and meet many but not all of the requirements listed above for the Senior/Lead position.</p><p><strong>Everything Else</strong></p><ul><li>General Requirements<ul><li>You agree with and would be pleased to work under our <a href='https://level12.io/blog/development-mission-statement/' rel='nofollow'>development mission statement and guiding principles</a>.</li><li>You can reason about software, algorithms, and performance from a high level.</li><li>You have worked on a production-level web and database applications using Python.</li><li>You are committed to automated testing in your software development process.</li><li>Strong oral and written communication skills</li><li>Self-motivated and have strong organizational skills</li><li>US citizen or ability to work in the United States without sponsorship</li><li>Bachelor’s Degree in computer science (or similar degree) or ability to demonstrate comparable education &amp; experience</li><li>4+ years developing database-driven web applications in a dynamic programming language</li><li>Would prefer local or within a 1-2 hours drive of Louisville. Will consider long-distance remote for the right candidate and/or if we can’t find local first.</li></ul></li><li>Languages &amp; Tools on a scale of 1 (novice) to 5 (expert)<ul><li>Proficient (4):&nbsp;Have significant experience working with Python in a web context.</li><li>Proficient (4): Database Development (SQL, multiple-joins, views, triggers, stored procedures)</li><li>Competent (3): Common Python libraries: Django, Flask, SQLAlchemy, Celery, Requests, pytest, etc.</li><li>Competent (3): HTML(5), CSS/SASS, web standards</li><li>Competent (3): JavaScript, Ajax, JSON, React, etc.</li><li>Competent (3): Writing unit and functional tests. Believing in a TDD approach is a big plus.</li><li>Competent (3): Version Control (Git, Mercurial)</li><li>Competent (3): Networking fundamentals (HTTP, DNS, TCP/IP, etc.)</li><li>Familiar&nbsp;(2): Linux and related tools</li></ul></li></ul><p><strong>Full Job Description &amp; Application Instructions<br></strong></p><p>Above are just highlights. The full job description for both positions are on our website and includes salary information, videos, and instructions on applying: <a href='https://level12.io/careers/' rel='nofollow'>https://level12.io/careers/</a></p>                    </div>                            <h2>                About Level 12            </h2>            <div><p><strong>Who Are We?</strong></p><p>Level 12 is development firm that specializes in building custom software for our customers.&nbsp; We manage the entire process including planning, managing, and building software exactly as the customer needs it.</p><p>We serve customers in diverse industries including: railroad, automotive, manufacturing, and retail payments.</p><p>We set ourselves apart by digging into the customer’s problem until we can own it and then delivering highly functional software that brings significant value to the customer’s organization.&nbsp; That may not sound unique, but the longer we do this, the more we encounter people who have been burned by bad development experiences with other firms.&nbsp; We look for long-term relationships with our customers and have some that go back over 12 years.</p><p>We may not be changing the world, but we are impacting the lives of our customers and their employees.&nbsp; You don’t have to take our word for it, <a href='https://www.google.com/search?q=Level+12&amp;ludocid=3455085814419693503&amp;#lrd=0x0:0x2ff2ee3e0cfa1fbf,1' rel='nofollow'>checkout some of our reviews by our customers</a>.</p><p>Please <a href='https://level12.io/careers/full-stack-python-web-developer-engineering-lead/' rel='nofollow'>watch the video on our website</a> to learn why milk trucks are better than tanks (and learn more about our development process at the same time) (&lt; 2 mins).</p><p><strong>Emphasis on Development Best Practices</strong></p><p>Behind the scenes, we are using software development best practices to ensure that the code we deliver is flexible, maintainable, and works well for the user for years to come.</p><p>We know what it’s like to work in a substandard development environment or culture that accepts or maybe even promotes practices that kill developer productivity and enjoyment. We work hard at promoting development best practices and ingraining them into our culture. If you come work for us, you can look forward to:</p><ul><li>All projects managed in a DVCS (mostly Git, there might be a few obscure mercurial repos laying around that will eventually get converted)</li><li>Project management mostly on GitHub for pull requests, issue management, code coverage, CI integration, etc.</li><li>Developer friendly project setup: all our projects can be run locally on a developer’s machine.</li><li>Test-centric development methodology:<ul><li>Asking “how can we test this” is ingrained into our engineering and development workflow.</li><li>We have Continuous Integration (CI) running for almost all of our projects for at least the backend code (Python mostly) and some of the projects also run the JavaScript tests in CI.</li></ul></li><li>A focus on <a href='https://level12.io/agile-manifesto-software-development/' rel='nofollow'>Agile Principles</a> while not being enslaved to them.</li><li>A openness to changing our processes and using new technologies when those changes add value to Level 12 and/or our customers.</li></ul><p>If you’d like to learn more about what makes us tick, our Chief Executive Developer (CED) gave a talk on the importance of CI and automation in an agile software development process (<a href='https://level12.io/careers/full-stack-python-web-developer-engineering-lead/' rel='nofollow'>video on our website</a>) and has given <a href='https://github.com/rsyring/presentation-toc' rel='nofollow'>other talks and presentations</a> on various topics.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Commitment to transparency                            </div>                            <div>                                 Work from home option                            </div>                            <div>                                 No drama office policy                            </div>                            <div>                                 Emphasize work-life balance                            </div>                            <div>                                 PTO/Vacation policies are designed so that you use them                            </div>                            <div>                                 Commitment to Agile Principles                            </div>                            <div>                                 Commitment to Automated Testing                            </div>                            <div>                                 Profit sharing                            </div>                            <div>                                 Healthcare stipend                            </div>                            <div>                                 Schedule flexibility                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``remot 3W right",
      "DBG_TECH1:k_t_w:ajax_frontend_3",
      "DBG_TECH1:k_t_w:django_python_16",
      "DBG_TECH1:k_t_w:flask_python_16",
      "DBG_TECH1:k_t_w:javascript_frontend_3",
      "DBG_TECH1:k_t_w:javascript_mobile_3",
      "DBG_TECH1:k_t_w:javascript_nodejs_3",
      "DBG_TECH1:k_t_w:py.test_python_8",
      "DBG_TECH1:k_t_w:python_python_16",
      "DBG_TECH1:k_t_w:reactjs_frontend_32",
      "DBG_TECH1:k_t_w:sql-server_dotnet_1",
      "DBG_TECH1:k_t_w:sqlalchemy_python_8",
      "DBG_TECH1:techWeightMap:{python=64, java=0, dotnet=1, c=0, gamedev=0, mobile=3, php=0, nodejs=3, embedded=0, frontend=38, bigdata-ml=0, ruby=0}",
      "REMOTE1_50",
      "TECH1_python",
      "TECH2_django",
      "TECH2_flask",
      "TECH2_python",
      "TECH2_reactjs",
      "TECH2_sql",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "django",
      "flask",
      "python",
      "reactjs",
      "sql"
    ]
  },
  {
    "id": "-jguonCcTu-ZJLaIh3wMZQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159147/small-firm-technology-leader-remote-dorsia-investment-group-llc?a=Rn7GH6BaR8Y",
    "title": "Small Firm Technology Leader (Remote) at Dorsia Investment Group LLC () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead, Manager</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Finance</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Our firm</strong></p><p>We’re a small investment firm in New York, run by two quants. Even though we’ve been trading stocks successfully since 2012, we have never hired anybody to help – we have done all the strategy, trading, and technology ourselves. Our focus is on the investment strategy, but we are good coders and have built a solid infrastructure for a two-man operation.</p><p>Now it’s time to take off, and we’re hiring a small team to expand the business.</p><p><strong>Here’s where you come in—</strong></p><p>We need a top notch tech guru to lead the entire tech of our firm as we expand. Think of it as a CTO type role – you will report directly to the founders. You’d have a wide range of skills (enterprise IT admin, app dev) and be managing everything – from finding the right enterprise solutions as we expand, to extending our Python quantitative backend infrastructure, to managing databases, networks and permissions. Everything technology-related will be under your purview. And at least initially, you will be the only person on our team focused on tech full-time.</p><p>Our culture is casual with a start-up feel. We care deeply about efficiency and robust tech, but not how you choose to manage your schedule. We care about our lifestyles but don’t want to dictate yours. You’ll be working remotely but will have constant access to the founders, who will give you feedback and growth.</p><p><strong>Ideal candidate would have:</strong></p><ul><li>Top notch coding skills. You will need to be able write robust, clean code with a focus on extensibility and performance. We use Python throughout, but as tech lead you might decide e.g. Java/C++ is more suitable for a particular solution.</li><li>Experience with hedge fund technology (managing positions, broker data, market data, etc.) a big plus.</li><li>Experience with databases and managing data.</li><li>Experience with configuring and permissioning enterprise apps for a growing organization.</li><li>Experience with integration of back-end systems with Excel. Currently we use PyXLL, a cool system that integrates a Python backend with Excel.</li><li>Strong communication skills and ability to work remotely and manage your own schedule.</li><li>Creativity and being highly proactive in your solutions, passion about tech and coding, and staying well-informed of cool new solutions for tech problems.</li></ul>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Remote Work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG:surround``benefit 2N 2N(remot,work)",
      "DBG_TECH1:k_t_w:python_python_6",
      "DBG_TECH1:techWeightMap:{python=6, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_50",
      "TECH1_python",
      "TECH2_excel",
      "TECH2_mysql",
      "TECH2_python",
      "TECH2_python-2.7",
      "TECH2_pyxll",
      "TITLE1_unknown",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "excel",
      "mysql",
      "python",
      "python-2.7",
      "pyxll"
    ]
  },
  {
    "id": "fMhPYH_oTSWUP3EIhaGjSA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62822",
    "title": "Small Firm Technology Leader",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>Our firm</strong></p><br><p>We’re a small investment firm in New York, run by two quants. Even though we’ve been trading stocks successfully since 2012, we have never hired anybody to help – we have done all the strategy, trading, and technology ourselves. Our focus is on the investment strategy, but we are good coders and have built a solid infrastructure for a two-man operation.</p><br><p>Now it’s time to take off, and we’re hiring a small team to expand the business.</p><br><p><strong>Here’s where you come in—</strong></p><br><p><span>We need a top notch tech guru to handle the entire tech infrastructure of our firm as we expand. Think of it as a one-man CTO type role – you will report directly to the founders. You’d have a wide range of skills (enterprise IT admin, app dev) and be managing everything infrastructure-related from top to bottom – from finding the right enterprise solutions as we expand, to extending our Python quantitative backend, to managing databases, networks and permissions. </span><strong>At least initially, you will be the only person on our team focused on tech full-time (i.e. not a managerial role).</strong></p><br><p><span>Our culture is casual with a start-up feel. We care deeply about efficiency and robust tech, but not how you choose to manage your schedule. We care about our lifestyles but don’t want to dictate yours. You’ll be working remotely but will have constant access to the founders, who will give you feedback and growth.</span></p><br><p><strong>Some examples of projects you might do:</strong></p><br><ul><br><li><span>Manage permissions and active directory, set up a VPN or figure out a virtual desktop solution if required.</span></li><br><li><span>Create a desktop/web app with&nbsp;integrated views on the firm’s P&amp;L and risk.</span></li><br><li><span>Maintain database of tick data received from third-party vendors and write high-performance accessor functions in Python.</span></li><br><li><span>Integrate an on-demand market data service, e.g. Factset, into our Python environment with high-performance queries or batching API calls with intelligent caching.</span></li><br><li><span>Create a lightweight alert system for Windows to warn us of upcoming earnings and other time-critical events.</span></li><br><li><span>Create a system that integrates real-time positions from our brokers into Python and Excel.</span></li><br><li><span>Create automated trade reports to send to a middle-office team.</span></li><br></ul><br><p><strong>Ideal candidate would have:</strong></p><br><ul><br><li><span>Top notch coding skills. You will need to be able write robust, clean code with a focus on extensibility and performance. We use Python throughout, but as tech lead you might decide e.g. Java/C++ is more suitable for a particular solution for performance.</span></li><br><li><span>Experience with hedge fund infrastructure (position tracking, broker data, market data, etc.) a big plus. </span><strong>Experience developing trading strategies not required</strong><span>.</span></li><br><li><span>Experience with managing databases and writing highly efficient queries..</span></li><br><li><span>Experience with configuring and permissioning enterprise IT for a growing organization.</span></li><br><li><span>Experience with integration of back-end infrastructure with Excel is a plus. Currently we use PyXLL, a cool system that integrates a Python backend with Excel.</span></li><br><li><span>Strong communication skills and ability to work remotely and manage your own schedule.</span></li><br><li><span>Creativity and being highly proactive in your solutions, passionate about tech and coding, and staying well-informed of cool new solutions for tech problems.</span></li><br></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 7:56:55 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG_TECH1:k_t_w:python_python_10",
      "DBG_TECH1:techWeightMap:{python=10, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_50",
      "TECH1_python",
      "TITLE1_unknown",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "pDJTL3lzRrWfmDhPMhk9pw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62392",
    "title": "Python Developer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><h3>About us<br></h3><p>MADE.com are a disruptive homeware company founded in 2010. Since our inception, Made.com’s tech and design have won us industry awards, from Initiative of the Year from the Retail Week Tech Awards to the Most Disruptive Business 2017 from The Sunday Times Fast Track. We consistently make the top 30 retailers by productivity and we've won many design awards for our product lines.<br><br></p><h3>The role<br></h3><p>We’re looking for an experienced Python Developer to join our first fully distributed development team. The new team will be working closely with the existing back-office team in London on the ongoing replatforming of the Made.com backend onto a modern architecture employing Python services as part of an event driven system running on AWS Cloud infrastructure.<br><br>We want you to be a strong communicator, having previous experience developing cloud-native services, and a passion for writing readable and maintainable code using XP techniques such as TDD, DDD and pair-programming.<br><br>This is a remote role, but we will get the whole team together in London for one week each quarter. In order to be able to collaborate effectively with the rest of the team, you will need to live in a time zone between -2 and +3 hours of London time. Salary range £28-52k, depending on experience.</p></span></td><td></td><td></td><td><a href='mailto:jon.bramley%40made.com?subject=Application%20for%20Python%20Developer%20at%20Made.com&amp;body=Hi%21%0A%0AI%27d%20like%20to%20apply%20for%20your%20position%20for%20a%20Python%20Developer%20at%20Made.com' rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 2:18:47 PM",
    "tags": [
      "DBG:surround``remot 3N OR(role, employment)",
      "DBG_TECH1:k_t_w:python_python_6",
      "DBG_TECH1:techWeightMap:{python=6, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_python",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "eaSBP4PdRSmYTOsLKS_gbw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/jobs/5622-full-stack-engineer-strong-python",
    "title": "Unhaggle Inc.: Full Stack Engineer (Strong Python) - Build the smartest way to buy a car",
    "content": "<div>  <div>    <h2>Full Stack Engineer (Strong Python) - Build the smartest way to buy a car</h2>      <h4>Posted Oct 27</h4>    <h3>      <span>Unhaggle Inc.</span><br>      <span>Headquarters: Toronto, Canada</span><br>        <a href='https://www.unhaggle.com' rel='nofollow'>https://www.unhaggle.com</a>    </h3>  </div>    </div>  <div>    <div>Unhaggle is currently the #1 web portal in Canada for new car buying. The data we provide powers our own tools and products, including our flagship consumer car buying service at Unhaggle.com and leading automotive portals including Yahoo Autos, MSN Autos, Autofocus, AutoGuide, Globe Drive, and others. We have also recently partnered with auto makers to launch a large eCommerce platform allowing the complete purchase of new cars online.</div><div><br></div><div>We are looking for a Full Stack Engineer with experience in Python and web application development. This is a full-time remote position, we accept applications from anywhere in the world.</div><div><br></div><div>We use GitHub to manage tasks and code reviews as well as tools/services like Travis-CI, Docker, New Relic, Sentry, Browserstack, Stripe, Twilio and Redis. Our dev team is regularly connected in Slack for communication. We are constantly seeking the best tools available for our development team.</div><div><br></div><div><b>You will be primarily involved in the following projects/areas:</b></div><div><br></div><div>* Our new eCommerce platform for new car buying, serving major car brands</div><div>* Our web portal unhaggle.com</div><div>* Several enterprise SaaS products, some more info here&nbsp;https://www.motoinsight.com</div><div>* REST APIs, for integration with different partners<br></div><div>* An internal and innovative SaaS web application we built for industry clients</div><div>* Widgets we built for third-party integration, they run in some of the most popular auto websites in Canada.</div><div>* Maintenance of our test suite and code base</div><div>* Implementation of new features</div><div>* We take quality seriously and you should expect to be involved in well written code bases following standards such as PEP-8 and good software engineering practices.</div><div></div><div><br></div><div><b>Requirements:</b></div><div><br></div><div>* Strong hands on experience with Python, experience with Django is important, but we might still be willing to consider candidates with strong Python skills and none or little knowledge with Django.</div><div>* Strong web development experience: we expect that you know XHTML, CSS and Javascript well. Hands on experience with Javascript frameworks is a big plus</div><div>* Track record of delivering completed projects, preferably web-based</div><div>* Good SQL knowledge and databases, PostgreSQL is a plus</div><div>* You should be very familiar with Linux</div><div>* Experience using version control software, Git is a plus</div><div>* Understanding of code best practices and standards. We also expect that you follow PEP-8 style guide and use tools like Pyflakes and Pylint very often</div><div>* Experience writing Python test cases is a plus. Prior experience with TDD and/or Selenium is a plus.</div><div>* Easy-going personality. You will actively participate in design discussions and code review</div><div>* This position might grow into a technical lead position. Experience leading development teams is a plus</div><div><br></div><div>We are helping consumers to get the best price on new cars in Canada and changing the industry along the way. Working at Unhaggle brings unique challenges, you will have the opportunity to leave a large footprint and have real impact in the product we ship every day to our customers.</div><div><br></div><div>No relocation available, we are a distributed team.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please submit resume and cover letter to <a href='mailto:emiquelito@motoinsight.com' rel='nofollow'>emiquelito@motoinsight.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 27, 2017 4:56:21 AM",
    "tags": [
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k_t_w:css_frontend_3",
      "DBG_TECH1:k_t_w:django_python_8",
      "DBG_TECH1:k_t_w:javascript_frontend_2",
      "DBG_TECH1:k_t_w:javascript_mobile_2",
      "DBG_TECH1:k_t_w:javascript_nodejs_2",
      "DBG_TECH1:k_t_w:python_python_12",
      "DBG_TECH1:techWeightMap:{python=20, java=0, dotnet=0, c=0, gamedev=0, mobile=2, php=0, nodejs=2, embedded=0, frontend=5, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_python",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "j_Ge4DTWRoqiV7jE9JCSQQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/62824/junior-python-developer-at-causalens/",
    "title": "Junior Python Developer",
    "content": "Junior Python Developer - Full Time (Remote)<br /><br />Summary<br /><br />We are looking for a motivated and high-achieving Junior Python Developer based anywhere in Europe to join the team working on an exciting new Big Data/Machine Learning platform. This is a full time placement with significant opportunities for growth and advancement as one of the first employees of the company.<br /><br />The Company<br /><br />causaLens is high-tech startup based in London. We are bringing machine learning and big data technologies to the World’s leading asset managers. We are an extraordinary team and the founders have worked for some of the most prominent global hedge funds and scientific institutions. <br /><br />Core requirements:<br /><br />* Smart, capable and can write clean code.<br />* Development experience in at least one scripting language - preferably Python.<br />* Interest in machine learning/big data.<br />* Knowledge of the Git version control system.<br />* Good organisational skills both in management of time and code.<br />* Ability to effectively work remotely (from home or coworking space).<br /><br />Roles and Responsibilities:<br /><br />Developing a big data platform for quantitative finance. The application stack is Python, Numpy, Scipy, Sklearn, Keras, Django, Celery, Postgres, AWS, GCP.<br /><br />Benefits:<br /><br />Successful candidate will have the opportunity to join a fast-growing, agile, and international team passionate about innovation and making a difference.  We will offer guidance, mentorship, and opportunities for professional development.",
    "urlFetchPending": false,
    "published": "Oct 25, 2017 7:16:19 AM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``fulltim 4N (telecommut OR remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k_t_w:django_python_8",
      "DBG_TECH1:k_t_w:keras_bigdata-ml_8",
      "DBG_TECH1:k_t_w:machine-learning_bigdata-ml_8",
      "DBG_TECH1:k_t_w:numpy_python_5",
      "DBG_TECH1:k_t_w:python_python_8",
      "DBG_TECH1:k_t_w:scikit-learn_bigdata-ml_8",
      "DBG_TECH1:k_t_w:scikit-learn_python_5",
      "DBG_TECH1:k_t_w:scipy_python_5",
      "DBG_TECH1:techWeightMap:{python=31, java=0, dotnet=0, c=0, gamedev=0, mobile=0, php=0, nodejs=0, embedded=0, frontend=0, bigdata-ml=24, ruby=0}",
      "REMOTE1_50",
      "TECH1_python",
      "TITLE1_dev",
      "TZ_Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "vT_UWVgwQKGoxOnW7R2o4Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3940-developer-evangelist-wallaroo-labs",
    "title": "Developer Evangelist @ Wallaroo Labs",
    "content": "<h2>              Developer Evangelist<small> @ Wallaroo Labs</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-23 03:06</p></dd>          <dt><span>Description</span></dt>          <dd><p>Wallaroo Labs is working on a huge idea, and this is a phenomenal opportunity for a person who enjoys challenges. We believe in open source and strive to build on these technologies. Our distributed team is ten people and growing. We had have generated a lot of interest through our product and vision and raised a large seed round with several well-known VCs.</p><p>Faster data, more data sources, and business requirements are driving increasingly sophisticated algorithms and putting more and more demands on data applications. Wallaroo Labs solves these problems with Wallaroo, a data engine for building highly elastic big data applications.</p><p>We are looking for a Developer Evangelist to drive the adoption of Wallaroo open-source offering within the developer community. This position is essential to our success; you will be responsible for identifying friction points with Wallaroo and systematically eliminate to improve the developer experience.</p><p>Although Wallaroo's headquarters is in New York, this position can be remote.  Candidates located in a Tech Hub cities or that have deep connections within existing developer networks would prove invaluable in building our community.</p><p><strong>Responsibilities</strong></p><ul><li>Monitor communication channels (HN, Reddit, StackOverflow, Mailing lists, IRC) and interact with the community, answer questions and assist developers.</li><li>Identify and build relationships with the developer community, meetups, and conferences and leverage relationships to evangelize Wallaroo.</li><li>Own problem resolution and participate with the development team to create solutions.</li><li>Publish content from blog posts to video demos.</li></ul><p><strong>Qualities we are looking for</strong></p><ul><li>Ability to learn new technologies quickly.</li><li>Comfortable with a variety of programming languages, experience with Python, Go, JavaScript are a plus.</li><li>Familiar with Big Data technologies.</li><li>Desire and ability to work with enterprise clients and our open source community.</li><li>Experience working with open source software, GitHub etc.</li><li>Familiar with software development process in a business setting.</li><li>Outstanding verbal and written communication skills.</li></ul><p><strong>Learn more about Wallaroo</strong></p><ul><li>Corporate site: <a href='http://www.wallaroolabs.com' rel='nofollow'>http://www.wallaroolabs.com</a></li><li>Wallaroo Community Site: <a href='http://www.wallaroolabs.com/community' rel='nofollow'>http://www.wallaroolabs.com/community</a></li><li>Wallaroo Blog: <a href='https://blog.wallaroolabs.com/' rel='nofollow'>https://blog.wallaroolabs.com/</a></li><li>GitHub: <a href='https://github.com/WallarooLabs/wallaroo' rel='nofollow'>https://github.com/WallarooLabs/wallaroo</a></li></ul><p><em>We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:06:14 AM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG:surround``can 2W remot",
      "DBG_TECH1:k_t_w:javascript_frontend_1",
      "DBG_TECH1:k_t_w:javascript_mobile_1",
      "DBG_TECH1:k_t_w:javascript_nodejs_1",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=2, java=0, dotnet=0, c=0, gamedev=0, mobile=1, php=0, nodejs=1, embedded=0, frontend=1, bigdata-ml=0, ruby=0}",
      "REMOTE1_100",
      "TECH1_python",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "Xno8wcicRX6weSlQQiaa8w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62242",
    "title": "Developer Evangelist",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Wallaroo Labs is working on a huge idea, and this is a phenomenal opportunity for a person who enjoys challenges. We believe in open source and strive to build on these technologies. Our distributed team is ten people and growing. We had have generated a lot of interest through our product and vision and raised a large seed round with several well-known VCs.<br><br>Faster data, more data sources, and business requirements are driving increasingly sophisticated algorithms and putting more and more demands on data applications. Wallaroo Labs solves these problems with Wallaroo, a data engine for building highly elastic big data applications.<br><br>We are looking for a Developer Evangelist to drive the adoption of Wallaroo open-source offering within the developer community. This position is essential to our success; you will be responsible for identifying friction points with Wallaroo and systematically eliminate to improve the developer experience.<br><br>Although Wallaroo's headquarters is in New York, this position can be remote. Candidates located in a Tech Hub cities or that have deep connections within existing developer networks would prove invaluable in building our community.<br><br><strong>Responsibilities</strong><br><br></p><ul><li>Monitor communication channels (HN, Reddit, StackOverflow, Mailing lists, IRC) and interact with the community, answer questions and assist developers.<br></li><li>Identify and build relationships with the developer community, meetups, and conferences and leverage relationships to evangelize Wallaroo.<br></li><li>Own problem resolution and participate with the development team to create solutions.<br></li><li>Publish content from blog posts to video demos.<br><br><strong>Qualities we are looking for</strong><br><br></li><li>Ability to learn new technologies quickly.<br></li><li>Comfortable with a variety of programming languages, experience with Python, Go, JavaScript are a plus.<br></li><li>Familiar with Big Data technologies.<br></li><li>Desire and ability to work with enterprise clients and our open source community.<br></li><li>Experience working with open source software, GitHub etc.<br></li><li>Familiar with software development process in a business setting.<br></li><li>Outstanding verbal and written communication skills.<br><br><strong>Learn more about Wallaroo</strong><br><br></li><li>Corporate site: <a href='http://www.wallaroolabs.com' rel='nofollow'>http://www.wallaroolabs.com</a></li><li>Wallaroo Community Site: <a href='http://www.wallaroolabs.com/community' rel='nofollow'>http://www.wallaroolabs.com/community</a></li><li>Wallaroo Blog: <a href='https://blog.wallaroolabs.com/' rel='nofollow'>https://blog.wallaroolabs.com/</a></li><li>GitHub: <a href='https://github.com/WallarooLabs/wallaroo' rel='nofollow'>https://github.com/WallarooLabs/wallaroo</a><br><em>We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:06:14 AM",
    "tags": [
      "DBG:surround``can 2W remot",
      "DBG_TECH1:k_t_w:javascript_frontend_1",
      "DBG_TECH1:k_t_w:javascript_mobile_1",
      "DBG_TECH1:k_t_w:javascript_nodejs_1",
      "DBG_TECH1:k_t_w:python_python_2",
      "DBG_TECH1:techWeightMap:{python=2, java=0, dotnet=0, c=0, gamedev=0, mobile=1, php=0, nodejs=1, embedded=0, frontend=1, bigdata-ml=0, ruby=0}",
      "REMOTE1_50",
      "TECH1_python",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "python"
    ]
  }
]
}
