{
 "items": [
  {
    "id": "Cz-omgiwSsq4cDS09n0Y0A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/160005/c-plus-plus-expert-web-crawling-or-web-api-experience-core-data?a=REXMLorPj7G",
    "title": "C++ expert; web crawling or web API experience strongly preferred at Core Data () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data, Developer APIs, Sports betting odds algorithms</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Core Data&nbsp;has an opening for two (2) experienced senior-level C++ programmers to add to our EU-based remote work&nbsp;team. &nbsp;This work-from-home contract style position offers a full time&nbsp;opportunity&nbsp;to each developer selected for the position. &nbsp;Candidates selected for this position will work under a full-time&nbsp;independent contractor relationship with our EU-based division.</p><p>C++ is the main programming language used on company projects; however, candidates are expected to be &quot;full stack&quot; and have experience in web APIs, web services, JSON, etc, since nearly all of our in-house applications either produce or consume web services. &nbsp;Many of the services we interact with are undocumented or legacy code, so patience and investigative skills to determine how a given remote API works and how to extract the needed information from it are of the highest importance. &nbsp;Many projects will involve creation of web bots, crawlers, or automatic web scraping programs to gather data from specified sites or endpoints.</p><p>For this position, emphasis is placed on the applicant's ability to produce solutions with minimal outside help. &nbsp;As this is a senior-level position, all applicants are expected to be able to write the required applications from start to finish, including design of any database queries or tables. &nbsp;Design specifications will be provided for each project prior to commencement. &nbsp;While actual programming ability is one of the key requirements of this position, applicants for this senior-level posting are expected to show initiative and take a practical approach towards solving real-world problems.</p><p>Most of the applications developed at&nbsp;Core Data&nbsp;are related to data feeds for sports odds, betting, and statistics.</p>                    </div>                            <h2>                About Core Data            </h2>            <div>Core Data is a data and statistics provider with an emphasis on low-latency, real-time sports data feeds. Core Data's product lineup is the backbone of a variety of innovative products, including live score trackers, play by play game trackers, and real-time AI-based odds. The company's statistics database includes detailed play by play records for past matchups across 22 sports. Additionally, Core Data's low-latency real-time data feeds offer live coverage on over 18,000 events monthly. The company offers a variety of pricing structures, ranging from starter plans that allow clients to choose events on a pay-as-you-go basis to comprehensive monthly packages that include all major leagues and sports.<p>            </p></div>                                <h2>Benefits</h2>                            <div>                                 Monthly paid time off                            </div>                            <div>                                 Competitive Compensation                            </div>                            <div>                                 Flexible hours / work schedules                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k_t_w:asp.net-web-api_dotnet_16",
      "DBG_TECH1:k_t_w:backbone.js_frontend_8",
      "DBG_TECH1:k_t_w:c++_c_24",
      "DBG_TECH1:k_t_w:core-data_apple_56",
      "DBG_TECH1:techWeightMap:{python=0, dotnet=16, c=24, mobile=0, nodejs=0, bigdata-ml=0, ruby=0, apple=56, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1_100",
      "TECH1_apple",
      "TECH2_api",
      "TECH2_c++",
      "TECH2_web-services",
      "TITLE1_dev",
      "TZ_unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "api",
      "apple",
      "c++",
      "web-services"
    ]
  }
]
}
