{
 "items": [
  {
    "id": "BQj5yzPER7axU8g6YzaA_w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/67134/help-needed-to-build-simple-alexa-skills-at-desire-path/",
    "title": "Help needed to build simple Alexa Skills",
    "content": "We are a small team of designers and developers creating experiences for mobile, chatbots and now voice!<br /><br />I'm looking for a talented programmer to help develop an Alexa Skill. Initially just one skill is needed, but more will be required for the right person.<br /><br />You must have experience in creating skills and can point to existing Alexa skills you have created in the marketplace. <br /><br />The first skill to be created is a simple one, but more information about the projects can be supplied during selection process.<br /><br />It is immediate start for the right person! This would suit a freelancer or evening/weekend work. Remote work acceptable!<br /><br />Thanks!<br />",
    "urlFetchPending": false,
    "published": "Mar 15, 2018 7:57:15 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "e2Z0bNtnTjqybEslMkcxyw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4151-build-and-release-engineer-ruby-exp-bamtech-media",
    "title": "Build and Release Engineer - Ruby exp. @ BAMTECH Media",
    "content": "<h2>              Build and Release Engineer - Ruby exp.<small> @ BAMTECH Media</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-21 04:00</p></dd>          <dt><span>Description</span></dt>          <dd><p>BAMTECH Media is a place for the creative and the bold. We’re seeking talent across disciplines to join our team. Whether New York City, San Francisco, Manchester or Amsterdam we provide opportunities to elevate your career and transform an industry.</p><p>BAMTECH is a leading technology services and video streaming company owned by The Walt Disney Company, MLBAM, and the National Hockey League. Our proprietary technology provides direct-to-consumer video solutions, especially for live events with high viewership, offering viewers high-quality visuals any time and on any device.</p><p>Build and Release Engineer - New York, NY We are looking for a Ruby Engineer to join our Apple &amp; Android Platforms Core Engineering team. This is an opportunity to help build tooling around industry leading apps while getting to work closely with some of the greatest minds in the app development world. If working in a collaborative team environment and facing new challenges every day while your apps get used by millions of people excites you, then this is the role for you.</p><p>We believe we offer a unique opportunity for any technologist:</p><ul><li>The opportunity to work on a bleeding edge and ever growing technology stack.</li><li>The opportunity to work with a world-class team of software and systems engineers.</li><li>The opportunity to work on award-winning, highly complex apps and systems.</li><li>The opportunity to work in a highly collaborative team environment.</li><li>The opportunity to face new challenges and reap new rewards every day.</li><li>Amazing benefits including - 100% employer-paid Medical, Dental and Vision.</li></ul><p><strong><em>This permanent position is located in New York, NY or remote.</em></strong></p><p><strong>Responsibilities</strong></p><ul><li>Work with the Build and Release Manager, engineering leads, project managers, and QA leads to manage build and release processes across multiple applications simultaneously.</li><li>Help manage continuous integration process for iOS, tvOS, Android, Android TV and Fire Tablet/TV platforms.</li><li>Help maintain and grow build management systems (Jenkins, scripts, build servers, tools, etc.).</li><li>Continuously work to improve the efficiency and scalability of our build and release processes and environments.</li><li>Help automation and mobile engineers build and maintain testing systems for all applications.</li><li>Help application engineers maintain lint, unit test, code coverage reports, and other app health.</li></ul><p>Tools</p><ul><li>Build custom tools to improve the development process and automate tasks.</li><li>Research and develop improvements to our Continuous Integration system.</li><li>Stay connected to emerging technologies in the build and release industry.</li></ul><p><strong>Basic Qualifications</strong></p><ul><li>1+ years experience with the Ruby language.</li><li>2+ years experience with any Object Oriented language.</li><li>Strong understanding of continuous integration principles and practices.</li><li>Excellent understanding of the software development lifecycle.</li><li>Excellent communication and collaborative skills, be a team player.</li><li>Knowledge of stateless servers.</li><li>Passion for DevOps.</li></ul><p><strong>Preferred Qualifications</strong></p><ul><li>Knowledge of Ansible or equivalent strongly preferred.</li><li>Knowledge of containerization using Docker or equivalent preferred.</li><li>Knowledge of Amazon Web Services preferred.</li><li>Knowledge of Test Driven Development (TDD) preferred.</li></ul><p><strong>Company Overview</strong></p><p>BAMTECH is a streaming technology joint venture between The Walt Disney Company, Major League Baseball Advanced Media, and the National Hockey League. BAMTECH handles streaming for numerous partners, some of which include, HBO, MLB, NHL, Eurosport, ESPN, and World Wrestling Entertainment. Fans demand access to content on their own terms on any device, anytime, anywhere. We are those fans. As a result, the BAMTECH Media team helped pioneer live event streaming over the Internet in 2002 for Major League Baseball. The passion to improve that experience led to many impressive firsts: the first 720p or “HD Ready” stream, the consecutive record for concurrent streams and the first stream in 8K ultra HD. Today, BAMTECH has a proven, scalable platform that powers direct-to-consumer applications for leading entertainment brands; and is now a major player in sports and eSports rights acquisition.</p><p><strong>Additional Information</strong></p><p><em>This position is a legal entity of BAMTECH LLC, an equal opportunity employer.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 21, 2018 6:00:03 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/ruby",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "ruby"
    ]
  },
  {
    "id": "QTsEQeDPTFGRNZmw9k9iMQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168495/engineer-integrations-auth0?a=UvuJX2uIsta",
    "title": "Engineer, Integrations at Auth0  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, IT Security, Software Development / Engineering</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Auth0 provides the simplest and most secure identity platform for developers to make the internet safer. We believe in crafted software, in end-to-end ownership of projects and hyper-fast iterations. The company continues to grow rapidly and services major startups and enterprise customers. We are processing hundreds of millions of logins for thousands of customers from startups to big organizations.</p><p>We are looking for an engineer to join our Integrations team to help us enhance our existing product and add new features. The Integrations Engineer is responsible for solving complex challenges related to communications between multiple systems, in an effort to provide customizability to the authentication pipeline and expand the existing feature set through third-party services. The role will act as a liaison between internal teams and external services.&nbsp;</p><p><strong>We:</strong></p><ul><ul><li>Are remote-by-design. Work from anywhere, your office is The Internet (but we also have physical locations around the world).</li><li>Are obsessed with delivering customer value. Everything we do assumes we only succeed if our customers do.</li><li>Trust and respect each other. Building a new product is like hacking a new path through the jungle. We’ve got your back. We expect the same from you. We respect our differences and use them to our advantage.</li><li>Hold ourselves to high standards. We take pride in work done well, and constantly push ourselves towards personal betterment.</li><li>Are collaborative in nature. We believe a team is bigger than the sum of its parts.</li><li>Innovate through experiments, failure, and learning. Failure is part of our process, no blame attached.</li><li>Are transparent. We are making an explicit effort to share all data relevant to the making of better decisions. No politics. &nbsp;</li><li>Are passionate. Our common driver is trying to accomplish something meaningful.</li></ul></ul><p><strong>You will:</strong></p><ul><ul><li>Design, build, and maintain extensibility solutions for internal and external services.</li><li>Debug production issues across multiple levels of our stack.</li><li>Collaborate with fellow engineers to build new features at large-scale.</li><li>Refine engineering practices, standards, and tooling.</li></ul></ul><p><strong>You might work on:</strong></p><ul><ul><li>Adding new extensibility points to our platform (think Rules, Hooks, and Extensions).</li><li>Creating new Auth0 Extensions that expand the capabilities of the product.</li><li>Distributed systems that need to communicate well and maintain high availability.</li></ul></ul><p><strong>You might be a good fit for this role if you:</strong></p><ul><ul><li>Have a history of developing and supporting intuitive and robust extensibility solutions.</li><li>Are familiar with the challenges and approaches for designing interconnected, scalable systems.</li><li>Take an iterative approach to development, dividing long-term goals into incremental milestones.</li><li>Thrive in a fast-paced and collaborative environment.</li><li>Have familiarity with the tools we currently use, such as NodeJS, React/Redux, and MongoDB. However, we always try to use the best tool for the job, therefore we care more about your general engineering skill than knowledge of a particular language or tool.</li><li>Have experience working in a remote-first organization.</li><li>Place a high value on security.</li></ul></ul><p>It’s not expected that a single candidate has expertise in all these areas. We’re looking for professional engineers, who can quickly learn and adapt as our systems and situation changes, rather than candidates with a rigid skill set.</p><p>You can learn more about our hiring process&nbsp;<a href='https://auth0.com/blog/how-we-hire-engineers/' rel='nofollow'>here</a>.</p><p>Auth0 is an Equal Employment Opportunity employer. Auth0 conducts all employment-related activities without regard to race, religion, color, national origin, age, sex, marital status, sexual orientation, disability, citizenship status, genetics, or status as a Vietnam-era special disabled and other covered veteran status, or any other characteristic protected by law. Auth0 participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.</p>                    </div>                            <h2>                About Auth0            </h2>            <div><p>Auth0 provides an enterprise-grade platform that secures billions of log-ins every year. The company makes it easy to implement even the most complex identity solutions for their web, mobile, IoT and internal applications, as well as sophisticated identity management for employees, customers and partners. Auth0 has raised over $54 million from Meritech Capital, NTT DoCoMo, Trinity Ventures, Bessemer Venture Partners, K9 Ventures, Silicon Valley Bank, Founders Co-Op, Portland Seed Fund and NXTP Labs.</p><p>Thousands of enterprises and millions of users worldwide depend on Auth0 for authentication and authorization of their most mission-critical apps, APIs and IoT devices. Auth0’s top priorities are availability and security.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Competitive Equity                            </div>                            <div>                                 Free Nespresso                            </div>                            <div>                                 Top-of-the-Line Macbooks and other great tools                            </div>                            <div>                                 Embrace Distributed Work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 18, 2018 11:18:35 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "2zeQevypSqq_5-WdkH2OlQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/164747/accounts-and-integration-developer-bigchange-apps-ltd?a=TfyYu300Ipy",
    "title": "Accounts and Integration Developer at BigChange Apps Ltd (Leeds, UK)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>CRM, SaaS, Vehicle Tracking</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Technologies</strong></p><p>.net&nbsp;c# AWS SQL Server</p><p><strong>Job Description</strong></p><p>We are looking for a skilled developer who wants to be part of a growing company where they can design and deliver great, high quality, innovative software. This doesn't mean you have been working on the industry for years and years - just that you're really good at your job.</p><p><strong>Profile</strong></p><ul><li>Loves writing code to solve problems</li><li>Interested in the latest developments in .NET and development in general</li><li>Flexible enough to get requirements from customers and see it all the way through to release</li><li>Open minded about approach or the technology to use for each problem</li><li>Wants to work with the latest cloud based solutions</li><li>Deep knowledge of C#, SQL,</li><li>Preferably experience of cloud solutions, mobile, Big Data (and probably lots more)</li><li>Eager to share knowledge with the rest of the small, dedicated but geographically diverse team</li><li>Accounting integration experience, preferably with Sage 50 / 200 / Xero / Quickbooks and more</li></ul><p><strong>Advantages</strong></p><ul><li>Flexible working hours</li><li>The convenience of working from home (but feel free to come to the office anytime you want)</li><li>Working with the latest releases&nbsp;</li><li>The chance to influence our next steps and build something really different</li><li>New diverse challenges&nbsp;regularly</li><li>Anything else: just ask!</li></ul><p><strong>About BigChange Apps Ltd</strong></p><ul><li>BigChange are a UK based technology company specialising in Mobile Resource Management Software. We have developed in-house a SAAS system that enables businesses to improve operational efficiency and all paperwork from field operations.</li><li>We are growing by 80% year on year and have plans to grow globally in 2018</li><li>Our Founder and CEO is an Entrepreneur who values providing excellent service to our customers</li><li>We have a fantastic product… No honestly it’s brilliant.</li><li>Our customers love us</li></ul>                    </div>                            <h2>                About BigChange Apps Ltd            </h2>            <div><p><strong>About BigChange Apps Ltd</strong></p><ul><li>BigChange are a UK based technology company specialising in Mobile Resource Management Software. We have developed in-house a SAAS system that enables businesses to improve operational efficiency and all paperwork from field operations.</li><li>We are growing by 80% year on year and have plans to grow globally in 2018</li><li>Our Founder and CEO is an Entrepreneur who values providing excellent service to our customers</li><li>We have a fantastic product… No honestly it’s brilliant.</li><li>Our customers love us</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from Home                            </div>                            <div>                                 Flexible time                            </div>                            <div>                                 Family culture                            </div>                            <div>                                 Latest technology                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  }
]
}
