{
 "items": [
  {
    "id": "cRiC1g7ZTC68RBZdMcBmog",
    "url": "https://jobspresso.co/job/technical-software-support-analyst/",
    "title": "Technical Software Support Analyst",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k/t/w:magento/php/16",
      "DBG_TECH1:k/t/w:php/php/10",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:k/t/w:woocommerce/php/24",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=4, apple=0, java=0, gamedev=0, php=50, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "TaxJar",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 26, 2018 6:20:10 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Technical Software Support Analyst</h2><div>Developer<br></div><div>Anywhere in US<br></div><div>Company: TaxJar<br></div><div>Full Time<br></div><h3>Overview</h3><p>TaxJar is the leading technology solution for busy eCommerce sellers to manage sales tax and is trusted by more than 10,000 businesses.</p><p>Our core values:</p><ul></ul><li>We do the right thing for our customers.</li><li>We’re a team, built on trust.</li><li>We’re proud to be remote.</li><li>We’re in control of our own destiny.</li><p></p><strong>Description</strong><p>TaxJar’s remote-only team of almost 50 people is growing quickly. We have an immediate opening for a Technical Software Support Analyst to be a part of our team that directly supports our customers using TaxJar and our sales tax integrations for Magento and WooCommerce.</p><p>You will join our technical support team within the product engineering group and help us support and improve the TaxJar product our customers love. You will serve as the first point of contact for our customers and partners seeking technical assistance over the phone or email for the TaxJar application and services. You will perform remote troubleshooting and use targeted questions to provide customers the best solution based on the provided information and knowledge of TaxJar’s application.</p><p></p><strong>*This is a full-time remote position available to folks located in the US.</strong><p></p><strong>On the Technical Support team you will</strong><ul></ul><li>Solve technical problems for customers on a daily basis. Our software support analysts need to be fast learners and get up to speed quickly on our product and integrations.</li><li>Categorize and quickly respond to customer questions and requests via email (we use Help Scout).</li><li>Face debugging issues not only within our own Ruby and PHP codebase but also with the many technologies employed by our customers.</li><li>Troubleshoot&nbsp;questions, and help customers with&nbsp;&nbsp;and&nbsp;</li><a href='https://workable.com/nr?l=https%3A%2F%2Fdevelopers.taxjar.com%2Fapi%2Freference%2F' rel='nofollow'>SmartCalcs API</a><span>&nbsp;</span><a href='https://workable.com/nr?l=https%3A%2F%2Fwww.taxjar.com%2Fguides%2Fsales-tax-guide-for-woocommerce%2F%23how-to-install-the-woocommerce-sales-tax-plugin-from-taxjar' rel='nofollow'>WooCommerce plugin</a><a href='https://workable.com/nr?l=https%3A%2F%2Fwww.taxjar.com%2Fguides%2Fintegrations%2Fmagento%2F%23getting-started-with-taxjar' rel='nofollow'>Magento extension</a><li>Track &amp; monitor all customer requests and trending product issues.</li><li>Distill complex issues into underlying causes and work directly with our product development teams to deploy solutions while consistently delivering world-class support.</li><li>Interact with the developers to help identify root causes to bugs and exceptions reported by customers or by our application.</li><p></p><strong>REQUIREMENTS</strong><ul></ul><li>Proven experience in a technical help desk or customer support role</li><li>Demonstrate an ability to troubleshoot errors in one or all SQL, Ruby and PHP</li><li>Experience supporting open source carts like WooCommerce and Magento</li><li>Highly-skilled in written and verbal communications</li><li>Experience working with a remote team</li><li>Extremely patient…sales tax can be painful and our goal is to ease that pain </li><li>Ability to multitask on various client issues and prioritize issues.</li><li>Approaches success from the customer’s point of view</li><li>You enjoy teaching</li><li>Able to explain complex concepts in easy to understand language</li><li>Interested in understanding the ins-and-outs of sales tax</li><li>Attentive to details, both in communication and in explaining how TaxJar works</li><p></p><strong>You’ll be a great fit on our team if you</strong><ul></ul><li>Only want to work remotely</li><li>Are a PRO at communicating and collaboration</li><li>Highly value working with people you like and respect</li><li>Are accountable</li><li>Are confident in your skills and a solid team player (We’re peers here, no egos please) but also comfortable working asynchronously</li><li>Hungry to play an impactful role and not afraid to fail</li><p>&nbsp;and we all really love what we do. We’ve created a space where high-achievers can succeed, but are also safe to fail. We’re profitable and focused on growing TaxJar sustainably. We’re always learning how to make TaxJar the best place to work for all of us, and not just another tech startup. We’re always looking for an amazing new teammates to come share in the excitement of solving real-world problems with technology.</p><a href='https://workable.com/nr?l=https%3A%2F%2Flife.taxjar.com%2F' rel='nofollow'>We’re a happy team</a><p></p><strong>BENEFITS</strong><ul></ul><li>Excellent health, vision and dental benefits</li><li>Flexible vacation policy (we’ll actually pay you $500 a year to take time off!)</li><li>$1,000 in professional development credit</li><li>Home office stipend</li><li>Equity in a profitable company</li><li>2x year all-company in person retreats (fully paid for by us of course)</li><li>Brand new Macbook computer</li><li>Mandatory Birthday holiday!</li><li>12 week paid maternity/ 6 week paid paternity leave</li><li>Monthly perks reimbursement for things like Netflix, Amazon Prime, your gym membership, home internet and more.</li><p>We offer all of our employees amazing benefits. Visit&nbsp;&nbsp;for a full list of our benefits and to learn more about how we work and what we stand for.</p><a href='https://workable.com/nr?l=https%3A%2F%2Fwww.taxjar.com%2Fjobs' rel='nofollow'>www.TaxJar.com/jobs</a><p></p><strong>If you’re not the perfect fit for this position, but you know someone who is, we’ll pay you $1,000 if you refer us to the person we hire.</strong><div> <div><div><p>To apply for this job please visit the following URL: <a href='https://taxjar.workable.com/j/C87D8ABF4A' rel='nofollow'>https://taxjar.workable.com/j/C87D8ABF4A →</a></p></div></div></div>"
  },
  {
    "id": "6xDAAW-9SAq4yNefsYVP3w",
    "url": "https://whereverjobs.com/listing/3889/customer-success-engineer-remote-americas-equity",
    "title": "Customer Success Engineer (Remote, Americas) (Equity)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Platform.sh",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 26, 2018 4:32:19 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h3>Customer Success Engineer (Remote, Americas) (Equity)</h3><div>Company: Platform.sh<br><br></div><div>                                <a href='https://WhereverJobs.com//jobs/developer-jobs-using-git' rel='nofollow'>git</a><a href='https://WhereverJobs.com//jobs/developer-jobs-using-php' rel='nofollow'>php</a><a href='https://WhereverJobs.com//jobs/developer-jobs-using-python' rel='nofollow'>python</a><a href='https://WhereverJobs.com//jobs/developer-jobs-using-node.js' rel='nofollow'>node.js</a><a href='https://WhereverJobs.com//jobs/developer-jobs-using-ruby' rel='nofollow'>ruby</a>            </div><div>How to apply:<br><a href='https://grnh.se/d619f86f2' rel='nofollow'>grnh.se/d619f86f2</a></div>"
  },
  {
    "id": "eZMY4bn7SIeqArOZrpJVVw",
    "url": "https://jobspresso.co/job/customer-advocate-4/",
    "title": "Customer Advocate",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 3W OR(time,timezon)",
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/support",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "InVision",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 25, 2018 5:24:48 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Customer Advocate</h2><div>Support<br></div><div>Pacific Time Zone<br></div><div>Company: InVision<br></div><div>Full Time<br></div><h3>Overview</h3><p>InVision is the Digital Product Design platform used to make the world’s best customer experiences. We provide design tools and educational resources for teams to navigate &nbsp;every stage of the product design process, from ideation to development.</p><p>Today, more than 3.5 million people use InVision to create a repeatable and streamlined design workflow; rapidly design and prototype products before writing code, and collaborate across their entire organization. That includes more than 80 percent of the Fortune 100, and organizations like Airbnb, Amazon, HBO, Netflix, Nike, Slack, Starbucks and Uber, who are now able to design better products, faster.</p><p>InVision is a fully distributed company with employees in 25 countries around the world. The company has raised more than $235 million in funding from leading investors including Accel, ICONIQ, FirstMark, Tiger Global, Battery Ventures, and Spark Capital. Visit us at&nbsp;and&nbsp;.</p><a href='https://www.invisionapp.com/' rel='nofollow'>&nbsp;InVisionApp.com</a><a href='https://www.invisionapp.com/blog' rel='nofollow'>InVisionApp.com/blog</a><p></p><strong>Requirements:</strong><ul></ul><li>You have weekend availability &amp; flexibility to help ensure our customers are always assisted regardless of when they reach out.</li><li>You have excellent written and verbal communication skills.</li><li>You’re a natural-born evangelist with infectious enthusiasm.</li><li>You have provided thoughtful technical and product support to those of varying technical fluencies.</li><li>You love to teach, and in order to do that well, you’re also eager to learn as much as you can.</li><li>You’ve worked as or with designers or other creative professionals and understand their needs.</li><li>You have related customer support or account management experience, preferably in a SaaS B2B setting.</li><li>You’re flexible, love having many irons in the fire, and have the skills to stay organized and on top of it all.</li><li>You’re located in the Pacific timezone in North America and able to work first shift to help provide coverage for our customers in the US.</li><p></p><strong>Bonus:</strong><ul></ul><li>Prior knowledge of design practices (UI, UX, research, testing) and design tools (Adobe Photoshop, Adobe Illustrator, Sketch) preferred.</li><li>Familiarity with modern ticketing, customer engagement, and CMS solutions leveraged within customer service environments (Zendesk, Desk.com, Help Scout).</li><li>Previous InVision experience and familiarity.</li><p></p><strong>Responsibilities:</strong><ul></ul><li>Directly respond to and engage customer inquiries and requests.</li><li>Compare, analyze, and escalate customer requests to appropriate teams or individuals.</li><li>Prioritize and respond to customer support inquiries regarding product, functionality, account management, and billing.</li><li>Develop, author, and maintain product &amp; process documentation.</li><li>Share industry best practices on web/mobile design tools with clients.</li><p></p><strong>Benefits:</strong><p>InVision offers an incredibly unique work environment. The company employs a diverse team all over the world. In the United States we have team members throughout 40+ states including New York, San Francisco, Austin, Portland, and Boston. Each InVision team member is given the freedom and tools to do their best work from wherever they choose. The benefits we offer in the United States include competitive health plans and a 401k plan.</p><p>Some InVision-wide benefits offered to all employees across the globe include a flexible vacation policy, monthly coffee shop stipends, annual allowances for books related to your profession, and home office setup &amp; wellness reimbursements. InVision is an international employer so some benefit offerings will vary from country to country. Please ask our recruiting team about the benefits and perks package available in your country.</p><div> <div><div><p>To apply for this job please visit the following URL: <a href='https://boards.greenhouse.io/invision/jobs/1287832' rel='nofollow'>https://boards.greenhouse.io/invision/jobs/1287832 →</a></p></div></div></div>"
  },
  {
    "id": "18oTFq5tRYSWtL4taIXjLg",
    "url": "https://jobspresso.co/job/customer-service-agent-2/",
    "title": "Customer Service Agent",
    "tags": [
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Wayfair",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 25, 2018 2:38:58 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Customer Service Agent</h2><div>Support<br></div><div>Various Locations in Texas<br></div><div>Company: Wayfair<br></div><div>Full Time<br></div><h3>Overview</h3><p></p><strong>Hiring Locations: San Antonio, Texas&nbsp;·&nbsp;Lancaster, Texas · Bryan, Texas · Flower Mound, Texas · Houston, Texas</strong><p>Wayfair is seeking Customer Service Agents for our&nbsp;&nbsp;customer service team in San Antonio, Dallas, Houston, and other major metropolitan areas in Texas!&nbsp;The hours of this position vary.</p><u>virtual</u><p>**This is a remote/work from home position**</p><p></p><strong>Key Job Duties:</strong><ul></ul><li>Service customers seeking assistance with post-order issues such as returns, replacements, refunds, delivery status and back order inquiries, problem resolution, and any other issues that may arise from the order fulfillment process.</li><li>Meet customer satisfaction, efficiency metrics and issue resolution targets, exceeding customer expectations, building customer loyalty and taking advantage of sales opportunities when appropriate.</li><li>Project a professional company image through phone and email interactions.</li><li>Recognize, document and alert supervisors of trends in customer calls.</li><li>Uphold high customer service standards.</li><li>Perform other job-related duties and responsibilities as may be assigned to you from time to time by the Company and/or your supervisor or manager i.e. process calls or emails to service customers when call demand dictates.</li><p></p><strong>Requirements:</strong><ul></ul><li>Bachelor’s Degree or equivalent experience</li><li>Excellent communication and relationship building skills</li><li>Passion for helping customers</li><li>Desire to make Customer Service a career</li><li>Service experience, preferably in a call center</li><li>A successful track record working in a high volume environment</li><li>Strong desire to be part of a team achieving personal and company financial goals</li><li>Able to solve problems by thinking analytically and creatively</li><li>Familiar with the latest e-commerce trends</li><li>Regular and reliable attendance is an essential function of this position</li><p></p><strong>Essential Job Functions:</strong><ul></ul><li>Computer equipment provided. You must provide a workspace that is free from noise or distraction</li><li>Ability to maintain the required internet speed of at least 25 Mbps&nbsp;(download) and 5 (upload) to support voice traffic and HTTPS web traffic using a hard-wired Ethernet internet connection (no WiFi)</li><li>Ability to use a computer keyboard and computer screen.</li><li>Ability to use a telephone headset and telephone system.</li><li>Ability to handle and solve all types of customer service issues via phone and/or email.</li><li>Ability to alternate sitting and standing throughout an 8 hour period, and sometimes longer.</li><li>Offers for this position will be contingent on successful completion of a background check, including criminal history and drug screening.</li><p></p><strong>About Wayfair:</strong><p>Wayfair believes everyone should live in a home they love. Through technology and innovation, Wayfair makes it possible for shoppers to quickly and easily find exactly what they want from a selection of more than 10 million items across home 2 furnishings, décor, home improvement, housewares and more. Committed to delighting its customers every step of the way, Wayfair is reinventing the way people shop for their homes – from product discovery to final delivery.</p><p>The Wayfair family of sites includes:</p><ul></ul><li>Wayfair, an online destination for all things home</li><li>Joss &amp; Main, where beautiful furniture and finds meet irresistible savings</li><li>AllModern, unbelievable prices on everything modern</li><li>Birch Lane, a collection of classic furnishings and timeless home décor</li><li>Perigold, unparalleled access to the finest home décor and furnishings</li><p>Wayfair generated $5.2 billion in net revenue for the twelve months ended March 31, 2018. Headquartered in Boston, Massachusetts with operations throughout North America and Europe, the company employs more than 8,700 people.</p><div> <div><div><p>To apply for this job please visit the following URL: <a href='http://jobs.jobvite.com/wayfair/job/olDf8fw5' rel='nofollow'>http://jobs.jobvite.com/wayfair/job/olDf8fw5 →</a></p></div></div></div>"
  },
  {
    "id": "Q_tvCDJcS1eCU0FHywEYyg",
    "url": "https://jobspresso.co/job/site-director-customer-care-support/",
    "title": "Site Director of Customer Care and Support ",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Wayfair",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 25, 2018 2:38:50 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Site Director of Customer Care and Support&nbsp;</h2><div>Support<br></div><div>Anywhere in US<br></div><div>Company: Wayfair<br></div><div>Full Time<br></div><h3>Overview</h3><p>Wayfair is searching for a Virtual Site Leader to expand our Remote Customer Care and Support&nbsp;functions to deliver revenue and profit growth, high levels of customer satisfaction, and service level achievement in a virtual environment.</p><p>Responsible for overseeing a team of approximately 350 consultants, you will have both deep contact center experience and strong hands-on general management skills with the ability to drive transformation in a high-growth environment. You will continue to strategically grow and develop our virtual service team to infuse flexibility and broaden our footprint for adding top talent that is imperative for offering the best customer experience.</p><br><p></p><strong>Responsibilities:</strong><p>· Develop future vision and implementation strategy to exceed customer experience targets and sales generation goals · Drive the overall performance of the customer service organization: service levels, revenue generation, customer satisfaction, cost reduction · Effectively build, lead and manage staff of +500, overseeing all remote workforce operations including functions of Customer Care and Email/Chat and partner effectively with other contact center operations teams including workforce management, training, recruiting and process transformation · Build a winning culture at the site, with enthusiastic leadership and the ability to communicate and connect with all levels of personnel · Provide a voice of the customer feedback loop to the business · Partner with Operations, Marketing and other functions to drive innovation in the customer experience and in sales channels</p><br><br><br><br><br><br><p> · 7+ years of experience in managing operations (500+ agents), ideally in a high-growth, virtual environment · Ability to both set strategy and follow through on tactical implementation and execution of initiatives – an operator with vision · Hands on and enthusiastic leadership style with excellent interpersonal skills&nbsp; can connect with staff at all levels and effectively manage change · Proven experience leveraging technology to optimize customer operations and sales · Track record of driving cost reductions without negatively impacting performance or customer satisfaction · Deep knowledge and experience managing workforce planning, high volume recruiting, and training · Very knowledgeable with utilizing and implementing enabling technology (i.e. CRM applications) to drive process improvement · Ability to think and perform both tactically and strategically · Analytical and data driven · Thrives in a fast-paced environment</p><strong>Qualifications:</strong><br><br><br><br><br><br><br><br><br><br><p></p><strong>Essential Job Functions:</strong><ul></ul><li>Ability to alternate sitting and standing throughout an 8-hour period, and sometimes longer</li><li>Ability to use a computer keyboard and computer screen</li><li>Ability to maintain the required internet speed.</li><li>Ability to use a telephone headset and telephone system</li><li>Ability to handle stressful customer interactions via telephone and email</li><li>Ability to perform all above-mentioned duties with or without accommodation</li><p></p><strong>About Wayfair Inc.</strong><p>Wayfair believes everyone should live in a home they love. Through technology and innovation, Wayfair makes it possible for shoppers to quickly and easily find exactly what they want from a selection of more than 10 million items across home furnishings, décor, home improvement, housewares and more. Committed to delighting its customers every step of the way, Wayfair is reinventing the way people shop for their homes – from product discovery to final delivery.</p><p>The&nbsp;Wayfair&nbsp;family of sites includes:</p><ul></ul><li>, an online destination for all things home</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.wayfair.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=Wayfair&amp;index=6&amp;md5=7ff2d781b9a5f7830b6b03f9b6e23578' rel='nofollow'>Wayfair</a><li>, where beautiful furniture and finds meet irresistible savings</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.jossandmain.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=Joss+%26+Main&amp;index=7&amp;md5=858573d4005bcbf2bcf1753109b4f731' rel='nofollow'>Joss &amp; Main</a><li>, unbelievable prices on everything modern</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.allmodern.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=AllModern&amp;index=8&amp;md5=1623432ea9e10ed33771fef0c7f7ac86' rel='nofollow'>AllModern</a><li>, a collection of classic furnishings and timeless home décor</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.birchlane.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=Birch+Lane&amp;index=9&amp;md5=fae47b06ccc3dd67bd45be7e171d6438' rel='nofollow'>Birch Lane</a><li>, unparalleled access to the finest home décor and furnishings</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.perigold.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=Perigold&amp;index=10&amp;md5=423afe98da4795b56959330d82bbf2c6' rel='nofollow'>Perigold</a><p>Wayfair generated $4.7 billion in net revenue for the twelve months ended December 31, 2017. Headquartered in Boston, Massachusetts with operations throughout North America and Europe, the company employs more than 7,700 people.</p><div> <div><div><p>To apply for this job please visit the following URL: <a href='http://jobs.jobvite.com/wayfair/job/o7h86fwm' rel='nofollow'>http://jobs.jobvite.com/wayfair/job/o7h86fwm →</a></p></div></div></div>"
  },
  {
    "id": "hl9QBHerT7GQIOgClmABRw",
    "url": "https://jobspresso.co/job/people-operations-associate/",
    "title": "People Operations Associate",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(home,remot,telecommut) 3W OR(meet, face, person)",
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Aptible",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 25, 2018 12:14:56 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> People Operations Associate</h2><div>Various<br></div><div>Anywhere<br></div><div>Company: Aptible<br></div><div>Full Time<br></div><h3>Overview</h3><p>We’re looking for a People Operations Associate to help find, support, and develop members of the Aptible Team.</p><p>This is a unique opportunity to be a high-impact, early member of Aptible, while learning the skills necessary for a successful career in Business Operations and People Operations. Reporting directly to our VP of People Operations, you will be responsible for creating, implementing, and optimizing the foundational programs to build an effective, high-performing team and a culture where everyone feels empowered to do their best work.</p><p></p><strong>About Aptible</strong><p>It’s true: Software is eating the world, powered by the Internet. A growing wave of developers all over the world are using web-scale technology to build and deploy healthcare, fintech, banking, payments, IoT, blockchain, machine learning, and other B2B applications.</p><p>Security and compliance are mandatory from day one for these teams of developers, but many of them struggle. When their teams are small, they can’t afford to hire full-time for security or compliance. When they scale, they find that existing security and compliance management tools suck.</p><p>At Aptible, we make people-centered security products that help developer teams build security into their architecture and their organization’s culture. Today, we have two products: Enclave and Gridiron.</p><p>&nbsp;is a container orchestration platform built for developers that automates security best practices and controls needed for deploying and scaling Dockerized apps in regulated industries.&nbsp;&nbsp;is like the missing QuickBooks + TurboTax for security management. It helps developers design and run security management programs that meet and exceed requirements like HIPAA, SOC 2, and ISO 27001. Customers use it to build trust with their own customers and partners, and prepare for certifications.</p><em>Enclave</em><em>Gridiron</em><p></p><strong>What You’ll Do</strong><ul></ul><li>You’ll help create the end-to-end People Strategy at Aptible, assisting with the planning and roll-out of People Operations programs and initiatives, including (but not limited to): Organizational Design, Diversity and Inclusion, Recruiting, Compensation and Benefits, Onboarding, Performance Management, Employee Engagement, Employee Relations, Learning and Development, and Career Planning.</li><li>You’ll collaborate with Team Leads to influence organizational change at Aptible, designing and implementing cross-functional, people-related solutions that solve complex organizational challenges.</li><li>You’ll collect, analyze, and identify trends in qualitative and quantitative data to monitor and improve organizational health, and assist in making informed business decisions.</li><p></p><strong>About You: Strengths</strong><ul></ul><li>: You enjoy building relationships with people—consulting with, coaching, mentoring them—to influence change and action. Experience in Client and/or Professional Services is helpful, but not required.</li><strong>Passion for People</strong><li>: You enjoy actively listening to and communicating with people to understand their needs and gain their trust. You have experience drafting clear communications that demonstrate discretion, good judgement, and attention to detail.</li><strong>Verbal and Written Communication Skills</strong><li>: You have experience running several projects at once in a dynamic environment. You’re comfortable working collaboratively with multiple stakeholders, taking initiative to move projects forward and deliver results on time.</li><strong>Project Management Skills</strong><li>: You have experience analyzing data to understand trends, develop recommendations for action, and engage in strategy discussions.</li><strong>Problem Solving Skills</strong><li>: You have a track record of personal accountability, and a high standard of integrity and professionalism. You’ve demonstrated resilience and a desire to succeed in the face of new and/or unforeseen challenges.</li><strong>Work Ethic</strong><p></p><strong>About You: Other Attributes</strong><ul></ul><li>: You take ownership, responsibility, and initiative. You have a track record of consistently delivering impactful, high-quality work on time.</li><strong>Ownership Mentality</strong><li>: You’re excited to work with a small group of high-performers. You foster collaboration, build trust, and support information sharing with colleagues.</li><strong>People-Oriented</strong><li>: You’re looking for an environment that challenges you to gain new knowledge and grow professionally every day. You’re adaptable in the face of change.</li><strong>Love for Learning</strong><li>: You’re ready to work with a fully distributed team, communicating asynchronously, deliberately, and openly across time zones and cultures.</li><strong>Appetite for Remote Work</strong><li>: You want to create a more secure Internet, and are excited to help innovative companies solve their hardest engineering and regulatory problems.</li><strong>Passion for Internet Security</strong><p></p><strong>Why Aptible</strong><ul></ul><li>Making the Internet safe to trust with sensitive data is a good thing! It’s also pretty fun. You’ll learn a lot about Security, Compliance, DevOps, and SaaS.</li><li>You’ll feel invested in your work and make an impact. We’re highly transparent internally with business strategy, important decisions, and our failures and successes.</li><li>You’ll help build a business for the long-term and invest in a sustainable business model. We’re backed by excellent investors and have the resources we need to do a great job.</li><li>Everyone gets to live in the place that suits them best. We work remotely, and meet up at least twice a year in places like Barcelona, Mexico, and New York. Next Up: Paris?</li><p></p><strong>Job Details</strong><ul></ul><li>Commitment: Full-Time</li><li>Location: Anywhere</li><li>Compensation: Competitive Salary, Equity, Health Benefits, Flexible Paid Time Off</li><p></p><strong>Our Commitment to Diversity and Inclusion</strong><p>We prioritize diversity within our team and value different perspectives, educational backgrounds, and life experiences. We encourage people from underrepresented backgrounds to apply.</p><div> <div><div><p>To apply for this job please visit the following URL: <a href='https://jobs.lever.co/aptible/e740d33d-37f6-4189-9615-6b08ddad401f' rel='nofollow'>https://jobs.lever.co/aptible/e740d33d-37f6-4189-9615-6b08ddad401f →</a></p></div></div></div>"
  },
  {
    "id": "VOzhxCpAQ4uqnswIk5hDUA",
    "url": "https://stackoverflow.com/jobs/54740/sr-mobile-pwa-developer-angular-enterprise-primotus-division-of-cargotel?a=imcwQ9N6Ir6",
    "title": "Sr. Mobile/PWA Developer (Angular): Enterprise Workflow Platform at Primotus Division of CargoTel (Washington, DC) ",
    "tags": [
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG:surround``remot 16W timezon",
      "DBG:surround``remot 9W 4N( OR(offic,onsit), time)",
      "DBG_TECH1:k/t/w:akka/java/16",
      "DBG_TECH1:k/t/w:angular/frontend/96",
      "DBG_TECH1:k/t/w:angularjs/frontend/8",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:jbpm/java/8",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:scala/java/6",
      "DBG_TECH1:k/t/w:typescript/frontend/2",
      "DBG_TECH1:k/t/w:typescript/nodejs/2",
      "DBG_TECH1:k/t/w:webpack/frontend/10",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=2, go=0, nodejs=4, bigdata-ml=0, ruby=0, apple=0, java=34, gamedev=0, php=0, embedded=0, frontend=126}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/support",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Primotus Division of CargoTel",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Sr. Mobile/PWA Developer (Angular): Enterprise Workflow Platform</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior, Lead, Manager</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Mobile Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Business Process Optmization, Enterprise Software, Mobile Development</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>11-50 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Primotus Division of CargoTel | Washington, DC<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                            <div>                                    <span>Preferred Timezone:</span>                                    <span>(GMT-05:00) Eastern Time +/- 4 hours</span>                                </div>                                                            <div>                                    <span>Office Location:</span>                                    <span>Washington, DC.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>angularjs</div><div>redux</div><div>webpack</div><div>angular6</div><div>ionic-framework</div>                <h3>Job description</h3>                <div><p><strong>Overview</strong></p><p>Primotus is an&nbsp;Enterprise scale, user-configurable mobile workflow platform, which allows users to design an entire system - including drag-and-drop database, forms, entitlements, processes, mobile applications, business decisions, messages, reports, and even maps - with little to no software development. The platform is flexible enough to be deployed for a myriad of business&nbsp;verticals.<br><br>Our mobile platform employs an Ionic Framework hybrid approach since entire application can be&nbsp;configured by users. Deployed&nbsp;version is in Angular 1.6 and we're migrating to Angular 6 (Ionic 3). It's a complex&nbsp;application&nbsp;with off-line, web sockets and data syncing capabilities.&nbsp;</p><p>We’re looking for an experienced frontend mobile developer having strong UI and architectural skills associated with&nbsp;data-driven applications&nbsp;along with&nbsp;Angular 1.x, Angular 2+, and ideally Ionic experience.&nbsp; &nbsp;</p><p>If you think you’re a good fit and are interested in building something highly configurable and really innovative, please shoot us an email.</p><p><strong>You’d be working on some of the following initiatives:&nbsp;</strong><strong><br></strong></p><ul><li>Migrating from Angular 1x to&nbsp;Angular 6&nbsp;</li><li>Deploying new Web Sockets architecture</li><li>Creating pricing, scanning, beacon modules</li><li>Building Mobile data visualizations</li><li>Developing an Enterprise chat application</li><li>Developing/ingesting JSON RestfulAPIs</li><li>Working with team making key architecture and stack decisions</li><li>Coordinating with QA</li></ul><p><strong>You're Expected To Have:</strong></p><p>- 5+ years of modern JavaScript (JS)<br>- 1+ years&nbsp;Angular 2+ production development<br>- 1+ years Angular 1 production development<br>- 2+ years production mobile application development<br>- Production experience with TypeScript<br>- UI/UX and architecture skills<br>- JSON, REST and Web Services<br>- WebSockets<br>- Protractor Karma Jasmine or other testing&nbsp;tools<br>- Willingness to share knowledge and mentor team members</p><p><strong>Nice To Have Some of the Following:<br></strong><br>-&nbsp;Experience&nbsp;Ionic Framework; both 1 and 3.&nbsp;<br>- Offline storage<br>- Mobile BI visualization tools&nbsp;<br>- Exposure&nbsp;with our backend platform consisting of Scala, Akka, Kafka, ElasticSearch<br>- Workflow applications, particularly BPM (Activiti, Camunda, JBPM, etc).&nbsp;</p><p><strong>Our Stack : Includes many of the most-desired technologies, including:<br></strong></p><p><em>Frontend</em><strong>:</strong></p><ul><li>Angular 1x, Angular 6, TypeScript, Ionic Mobile</li><li>Cordova</li><li>React, Redux</li><li>Web Sockets</li><li>Protractor, Selenium (Unit, end-to-end, performance testing tools)</li></ul><p><em>Backend</em><strong>:</strong></p><ul><li>BPMN (Java), DMN (Java)</li><li>Scala/Akka, Play Framework, Slick</li><li>Kafka (event-based processing)</li><li>Postgres, ElasticSearch</li><li>Restful API (GraphQL)</li></ul><p><em>DevOps</em><strong>:</strong></p><ul><li>Jenkins&nbsp;</li><li>Webpack</li><li>GIT, GitHub</li><li>AWS</li></ul><p><strong>Our development team:</strong></p><ul><li>Is small and growing with 10 members, so you'll&nbsp;have a significant impact.&nbsp;</li><li>Is divided into frontend and backend teams</li><li>Separates code into distinct modules and services</li><li>Uses JSON API for backend/frontend integration</li><li>Applies Agile programming and paired development methodology in 2-week sprints</li><li>Works in a virtual environment</li></ul>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/54740?reset=False&amp;ra=imcwQ9N6Ir6&amp;oqs=a%3DimcwQ9N6Ir6' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About Primotus Division of CargoTel</h3>            <div><p>Primotus is a well-funded and stable development-stage company. Developers work remotely but we embrace paired development and sharing knowledge including &quot;lunch-n'-learns&quot;.&nbsp; We encourage developer creativity, provide a high-degree of flexibility, and don't put developers on the clock.&nbsp;&nbsp;</p><p>Please see&nbsp;web site&nbsp;<a href='http://loki.primotus.com:8080/' rel='nofollow'>http://primotus.com</a>&nbsp;for more inforation.&nbsp;</p><p>Competitive salary and full benefits including medical, dental, 401k (including Primotus contributions), and flex time.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>vacation of holidays</span>                            </li>                            <li>                                <span></span>                                <span>medical and dental</span>                            </li>                            <li>                                <span></span>                                <span>flexible working hours</span>                            </li>                            <li>                                <span></span>                                <span>work at home</span>                            </li>                    </ul>                "
  },
  {
    "id": "1S7YSvAxR4-FimWTM9_6Rg",
    "url": "https://stackoverflow.com/jobs/170468/senior-net-core-developer-tsp-consulting-services-inc?a=Vawfxux4ebK",
    "title": "Senior .NET Core Developer at TSP Consulting Services, Inc  ",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``your W own W equip",
      "DBG_TECH1:k/t/w:asp.net-mvc/dotnet/8",
      "DBG_TECH1:k/t/w:c#/c/4",
      "DBG_TECH1:k/t/w:c#/dotnet/10",
      "DBG_TECH1:k/t/w:dotnet/dotnet/56",
      "DBG_TECH1:k/t/w:visual-studio/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=82, c=4, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "TSP Consulting Services, Inc",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 75,
      "maxValue": 75,
      "info": "",
      "unit": "HOUR",
      "parser": "SalaryParserLargeText",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Senior .NET Core Developer</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Contract</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Full Stack Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>IT Consulting</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>11-50 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: TSP Consulting Services, Inc | No office location<br></div><h3>Technologies</h3><div></div><div>c#</div><div>.net</div><div>sql</div><div>.net-core</div><div>asp.net-mvc</div>                <h3>Job description</h3>                <div><p><strong>* We are looking for applicants who live within the&nbsp;contiguous United States. Recruiting firms need not respond.</strong></p><p>We are looking for a senior level developer to join our team for the final three months of an active client engagement.&nbsp; You would join our team in building a custom API that exposes services to an integration with an Enterprise level Loan Origination system in an Azure hosted environment.</p><p>As part of that team, you would be expected to work remotely, on your own equipment through a vpn client connection to our internally hosted development environment.&nbsp;</p><p>The initial two week period would involve shadowing a current senior team member to understand the current project and the third party platform that we are integrating with.</p><p><strong>The ideal candidate would have the following skills:</strong></p><ul><li>Exceptional C# and .net core experience.</li><li>Strong understanding of DI and test-driven methodologies.</li><li>Experience with Git</li><li>A personal license for Visual Studio 2017 professional</li><li>Strong knowledge of service based architecture</li><li>Strong SQL experience and knowledge of entity framework</li><li>Experience working in an agile continuous integration environment</li><li>Excellent communication and documentation skills.</li><li>Knowledge and Experience of the mortgage industry is a huge plus</li></ul><p>We are looking for a minimum weekly commitment of 40 hours, but more may be available should you desire extra hours.&nbsp; There is permanent hiring potential for the right applicant moving forward as well.&nbsp; There are no travel requirements, but there are regular meetings and daily standups that you would be expected to attend.&nbsp; We would expect you to be available and working during the client’s normal business hours (they are on the west coast USA)</p><p>Our team primarily communicates though Hipchat and phone calls and is very responsive.&nbsp; You would be in close communication with the team at all times and highly supported.</p><p>If you think this might be a good fit for your skill set, please contact us.&nbsp; This position is available immediately.</p><p>This is a remote work position, however, you must be permitted to work in the US without sponsorship. US candidates only.</p><p><strong>Rate: $75 Hr.</strong></p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/170468?reset=False&amp;ra=Vawfxux4ebK&amp;oqs=a%3DVawfxux4ebK' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>                    <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>We encourage creative license</span>                            </li>                            <li>                                <span></span>                                <span>Great team of developers</span>                            </li>                            <li>                                <span></span>                                <span>Family oriented</span>                            </li>                            <li>                                <span></span>                                <span>Highly flexible</span>                            </li>                            <li>                                <span></span>                                <span>Offer leading edge development projects</span>                            </li>                    </ul>                "
  },
  {
    "id": "eLMIBAZ0R0a1zxFSowP5mA",
    "url": "https://stackoverflow.com/jobs/132227/customer-success-engineer-remote-americas-platformsh?a=IlnxNbWBU9q",
    "title": "Customer Success Engineer (Remote, Americas) at Platform.sh  ",
    "tags": [
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:drupal/php/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:magento/php/16",
      "DBG_TECH1:k/t/w:node.js/nodejs/26",
      "DBG_TECH1:k/t/w:php/php/10",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:symfony/php/8",
      "DBG_TECH1:techWeightMap:{python=4, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=26, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=39, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Platform.sh",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Customer Success Engineer (Remote, Americas)</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Full Stack Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Cloud-Based Solutions, Continuous Delivery, PaaS</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>VC Funded</span>                                    </div>                            </div>                    </div>                <div>Company: Platform.sh | No office location<br></div><h3>Technologies</h3><div></div><div>git</div><div>php</div><div>python</div><div>node.js</div><div>ruby</div>                <h3>Job description</h3>                <div><p>The position is remote insofar as work-from-home is expected, but you need to be on the right continent (American timezone). Thanks!<br><br></p><p>As a&nbsp;<strong>Customer Success Engineer, you liaise with customers with concerns and feed the engineering team with feedbacks.&nbsp;</strong>You will also be essential for diagnostics and debugging of failing applications and systems, and you have a strong mandate to help us automate and streamline everything we do. You are periodically on call in case disaster strikes. You're our front line, and when our customers think of how great Platform.sh is, they think of you.</p><ul><li>diagnose and debug failing applications and systems</li><li>respond to customer inquiries concerns and suggestions about our product in a timely manner</li><li>deploy and configure cloud resources</li><li>participate in on-call response to high priority tickets and incidents</li><li>troubleshoot issues pertaining to the infrastructure running customer applications</li><li>active participation to automation and streamlining projects</li></ul><p><strong>Must have:&nbsp;</strong></p><ul><li>Extensive experience&nbsp;with web applications of various kinds. PHP, Node.js, and Python applications are especially important to our current business</li><li>Experience with IaaS solutions, such as AWS, Microsoft Azure</li><li>Excellent communication and presentation skills: demoing products, explaining value and fielding technical, process and business-related questions</li><li>Ability to do the job in exquisite written and spoken English</li><li>Deep understanding of complete, modern hosting stacks</li><li>Experience with CDNs</li><li>Knowledge of DNS</li><li>Understanding of SSL certificates and encryption</li><li>Ability to use Git</li></ul><p><strong>Nice to have:</strong></p><ul><li>Knowledge of Magento Ecommerce, Symfony, Drupal, eZ Platform, or Typo3</li><li>Relational database skills</li><li>Public speaking experience</li><li>Blogging or writing experience</li><li>Experience as a performing musician, competitive athlete, dancer, actor, scout, sailor, or magician</li><li>Ability to kick ass in Chess or Go</li></ul>                </div>            <div>        <a href='https://grnh.se/d619f86f2' rel='nofollow'>                        Apply now        </a></div>            <h3>About Platform.sh</h3>            <div><p>Platform.sh is an idea-to-cloud application platform that simplifies cloud infrastructures.</p><p>We give developers the tools they need to experiment, innovate, get rapid feedback and deliver better-quality features with speed and confidence thanks to our unique rapid cloning technology.</p><p>Platform.sh serves thousands of customers worldwide including The Financial Times, Gap, Magento Commerce, Orange, Hachette, Ikea, Stanford University, Harvard University, The British Council, and Lufthansa.</p><p>We want people who are passionate, open, multicultural, friendly, humble and smart to join us and help this fast-growing, award-winning company to revolutionize the tech industry.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Work from home, wherever you are</span>                            </li>                            <li>                                <span></span>                                <span>Safe and friendly working environment</span>                            </li>                            <li>                                <span></span>                                <span>Stock options for everyone</span>                            </li>                            <li>                                <span></span>                                <span>Rest and recovery are essential to health and happiness; we get that</span>                            </li>                    </ul>                "
  },
  {
    "id": "ZwMTw04MS5O-C1Oy1dudYQ",
    "url": "https://stackoverflow.com/jobs/190131/dynamics-ax-developer-considering-remote-wb-mason-company-inc?a=11LmYfQQxukU",
    "title": "Dynamics AX Developer (Considering remote candidates) at W.B. Mason Company, Inc. (Boston, MA) ",
    "tags": [
      "DBG:surround``2N( OR(feasibl,OR(consid,consider),occas,possibl), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:sql-server/dotnet/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=1, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "W.B. Mason Company, Inc.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Dynamics AX Developer (Considering remote candidates)</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>B2B, eCommerce, Information Technology</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>1k-5k people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: W.B. Mason Company, Inc. | Boston, MA<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Boston, MA.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>x++</div><div>dynamics-ax-2009</div><div>sql</div>                <h3>Job description</h3>                <div><p>W.B. Mason has an interesting opportunity for Dynamics AX developers!&nbsp; Come join the development team of an end-user of Dynamics AX, where you can help us build out our highly customized AX 2009 platform and see firsthand the results and direct impact to the business.&nbsp; From electronic invoicing to warehouse management and inventory sourcing systems, our customized solutions gain the business efficiencies and save it cost.</p><p>Stick around for a huge Dynamics 365 re-implementation project which we are in the very early phases of.</p><p>The successful candidate for this position would provide immediate impact by contributing to Dynamics AX 2009 development and be able to contribute long term to our future.&nbsp;</p><p>We are considering remote candidates.</p><p><strong><u>Basic Qualifications</u></strong></p><ul><li>BS/Associates or equivalent technical experience in Computer Science or related field</li><li>Experience with Dynamics AX/365 for Finance and Operations and X++</li><li>Experience with Microsoft SQL Server, including T-SQL, stored procedures and functions</li><li>Knowledge of basic Computer Science concepts - data structures, OO design, problem solving, etc.</li></ul><p><strong><u>Preferred Qualifications</u></strong></p><ul><li>Experience with Dynamics AX 2009</li></ul><p><strong><u>What you will do at W.B. Mason:</u></strong></p><ul><li>Contribute to the architecture, design, and coding of our Dynamics AX 2009 customizations</li></ul><ul><li>Contribute to the group and organization by engaging and producing work with our development team and business analysts</li><li>Stay current with, identify and recommend emerging technologies and frameworks</li><li>Adhere to and help define coding best practices within the organization</li></ul>                </div>            <div>        <a href='https://careers-wbmason.icims.com/jobs/1847/dynamics-ax-developer/job' rel='nofollow'>                        Apply now        </a></div>            <h3>About W.B. Mason Company, Inc.</h3>            <div><p>Over the last decade, W.B. Mason has built an in-house, on-shore software development team to support its unique role in the market.&nbsp; W.B. Mason believes in tailoring our services to the needs of each customer.&nbsp; Developing software to handle that kind of variety and complexity is a great challenge.&nbsp; Managing the software for ourselves means we can focus on agility and continual delivery.&nbsp; A role on our team will give you experience in a wide variety of technologies as well as an opportunity to learn about every part of our business.&nbsp; From the web to the warehouse, our design &amp; development teams have created the tools our company uses to compete with the largest distribution and e-commerce companies in the world.&nbsp;</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Medical, Dental, and Vision Insurance Plans</span>                            </li>                            <li>                                <span></span>                                <span>Short-Term and Long-Term Disability</span>                            </li>                            <li>                                <span></span>                                <span>Medical Flexible Spending Account &amp; Dependent Care Spending Account</span>                            </li>                            <li>                                <span></span>                                <span>Company-Paid Life Insurance</span>                            </li>                            <li>                                <span></span>                                <span>401(k)</span>                            </li>                            <li>                                <span></span>                                <span>Paid Time Off</span>                            </li>                            <li>                                <span></span>                                <span>Company-Paid Holidays</span>                            </li>                            <li>                                <span></span>                                <span>Company-Paid Cell Phone Plan</span>                            </li>                            <li>                                <span></span>                                <span>Home &amp; Auto Insurance Discounts</span>                            </li>                            <li>                                <span></span>                                <span>And Much More!</span>                            </li>                    </ul>                "
  },
  {
    "id": "ERHcBwygTDasK39VdcnkHQ",
    "url": "https://stackoverflow.com/jobs/167524/geospatial-developer-geographic-information?a=UbiY2rOPIDS",
    "title": "Geospatial Developer at Geographic Information Services, Inc. (GISinc) (Hoover, AL) ",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:k/t/w:html5/frontend/10",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=8, c=0, mobile=2, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=2, java=0, gamedev=0, php=0, embedded=0, frontend=12}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Geographic Information Services, Inc. (GISinc)",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Geospatial Developer</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Geographic Information System</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Geographic Information Services, Inc. (GISinc) | Hoover, AL<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Hoover, AL.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>javascript</div><div>html5</div><div>json</div><div>dojo</div>                <h3>Job description</h3>                <div><p>GISinc is a small business whose core purpose is to create insight through spatial technology. Since 1991, our team of professionals has been using Geographic Information Systems to solve staffing, technology, and business needs in markets ranging from Federal, State, and Local Governments to some of the largest public and privately-held companies in the world. If you have exceptional talent and interpersonal skills and meet the following description, please submit your resume using the link below.</p><p><strong>Role:</strong> Geospatial Developer<br><br></p><p><strong>Role Summary:</strong> The function of the Geospatial Developer is the design, development, and implementation of geospatial software solutions. The role is responsible for development of mobile, desktop and/or web-based GIS solutions.<br> <br> <strong>Essential Functions:</strong></p><ul><li>Crafting and developing customized web applications</li><li>Developing custom routines, viewers, and/or databases</li><li>Application design, development and collaboration in a distributed team environment using source control</li><li>Development and implementation of test plans and automated test scripts</li><li>Developing and applying service orientated architectures to enterprise solutions</li></ul><p><strong>Competencies and Skills:</strong></p><ul><li>A real passion for working with teammates and customers to solve problems</li><li>Excellent interpersonal skills</li><li>Ability to multi-task, prioritize and meet deadlines</li><li>Ability to work in a high-tempo environment</li><li>Experience developing in .NET, Javascript, iOS, HTML5, and/or Python</li><li>Knowledge of internet architectures and technologies</li><li>Knowledge of geospatial concepts</li><li>Familiarity with standard software development protocols and coding standards</li><li>Application documentation including system design and technical specifications</li><li>Development of custom geospatial solutions</li></ul><p><strong>Experience Required:</strong></p><ul><li>Bachelors Degree in Computer Science, Geography/GIS, Engineering or related field*</li><li>1+ years experience as a software developer**</li></ul><p>* Additional experience can be substituted for education<br> ** Additional education can be substituted for years of experience<br> <br> <strong>Ideal (in addition to required experience):</strong></p><ul><li>Demonstrated experience developing geospatial applications</li><li>Application documentation including system design and technical specifications</li><li>MCPD and/or Esri technical certifications</li><li>Experience developing in a team</li></ul><p><strong>Work Environment:</strong></p><ul><li>Location: Headquarters in Birmingham, AL or work at home considered</li><li>Travel approximately 10% of the time.</li></ul><p>You might be required to obtain a security clearance and proof of U.S. Citizenship is required.<br> <br> <strong>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</strong></p>                </div>            <div>        <a href='https://gisinc.applicantstack.com/x/apply/a2isqas9no0u' rel='nofollow'>                        Apply now        </a></div>            <h3>About Geographic Information Services, Inc. (GISinc)</h3>            <div><p>Looking for a Great Place to Work?&nbsp; GISinc is thrilled to be recognized by Great Place to Work® on the annual 2017 Great Place to Work® Best Small &amp; Medium Workplaces list! &nbsp;Here’s what our folks have to say about working here:</p><p>“I am amazed at the quality of people that GISinc hires. I am surrounded by people that are not only great individuals, but absolutely brilliant minds.”</p><p>“Fun and games are incorporated into every day work making it an easy going, relaxed, stress free work place. The benefits offered are very unique and we use a point system so that people can pick and choose what best suits their needs.”</p><p>“With more than 50% of its workforce NOT in a physical company office, this company does an exemplary job of creating a sense of culture for all its employees.”</p><p>“Very open and transparent about the financial health and goals of the company.&nbsp; &nbsp;Amazing environment to work in where there are numerous interesting challenges involved in the work.”</p><p>At GISinc, our core purpose is to Create Insight through Location Technology.&nbsp; Check us out on the web at&nbsp;<a href='http://www.gisinc.com/' rel='nofollow'>http://www.gisinc.com</a>&nbsp;and see if your passion aligns with ours.</p><p><strong>We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</strong></p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Health Insurance</span>                            </li>                            <li>                                <span></span>                                <span>Dental Insurance</span>                            </li>                            <li>                                <span></span>                                <span>Vision Insurance</span>                            </li>                            <li>                                <span></span>                                <span>Employee Assistance Program (EAP)</span>                            </li>                            <li>                                <span></span>                                <span>Employee Stock Ownership (ESOP)</span>                            </li>                            <li>                                <span></span>                                <span>401K Contribution Matching</span>                            </li>                            <li>                                <span></span>                                <span>Disability and Life Insurance</span>                            </li>                            <li>                                <span></span>                                <span>Flexible Spending Accounts (FSA)</span>                            </li>                            <li>                                <span></span>                                <span>Tuition Reimbursement</span>                            </li>                            <li>                                <span></span>                                <span>22 Days of Paid Time Off (PTO)</span>                            </li>                    </ul>                "
  },
  {
    "id": "Kh4MbDd_QV6koOa7RNK_tw",
    "url": "https://stackoverflow.com/jobs/196841/engineer-services-wikimedia-foundation-inc?a=140TdVkKcOqI",
    "title": "Engineer, Services at Wikimedia Foundation, Inc.  ",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``OR(no,no W central) W offic",
      "DBG_TECH1:k/t/w:c/c/10",
      "DBG_TECH1:k/t/w:distributed-database/bigdata-ml/8",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=10, mobile=0, go=0, nodejs=13, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/nodejs",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "Wikimedia Foundation, Inc.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Engineer, Services</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Backend Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Education Technology, eLearning, Non-Profit</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>201-500 people</span>                                    </div>                            </div>                    </div>                <div>Company: Wikimedia Foundation, Inc. | No office location<br></div><h3>Technologies</h3><div></div><div>http</div><div>web-services</div><div>security</div>                <h3>Job description</h3>                <div><p>Wikipedia is where the world turns to understand almost any topic — The Wikimedia Foundation is the nonprofit that operates Wikipedia and its sister projects with a small staff. &nbsp;We are looking for a great engineer who wants to modernize the infrastructure underlying Wikipedia and make it scalable and sustainable. If this excites you we welcome you to join us.</p><p><strong><strong>Description</strong></strong></p><ul><li>Contribute to a dedicated team that develops and evolves the software infrastructure powering the Wikimedia projects</li><li>Gather requirements and architect software solutions supporting the Foundation’s strategic direction</li><li>Create modular, highly-scalable, distributed services</li><li>Assist and mentor other teams in integrating their projects with the core software platform</li><li>Build automated tests and thorough monitoring for the components being developed, and help package them for internal and third-party distribution.</li><li>Change the world for more than half a billion people every month ;)</li></ul><p><strong><strong>Example Projects</strong></strong></p><p>Here are some of the projects you would be contributing to:</p><ul><li>Distributed storage component. Our datasets include tens of terabytes of content spread across multiple data centres, which can be quite challenging and time-consuming when developing features and products. Our team is tasked with designing and implementing a PaaS-like robust, distributed storage component that can easily be leveraged to speed up new user-facing features and products.</li><li>Session management service. Privacy is of great concern to Wikipedia’s communities. By isolating session management into a separate service, we are minimising the attack surface and increasing the security of our systems.</li><li>Event propagation and dependency tracking. While the number of direct edits is rather small, they can cause updates to several million pages at once. Hence, our infrastructure must be able to reliably update the databases and HTML representations and purge content from the caches at large scale. &nbsp;</li></ul><p><strong><strong>Requirements</strong></strong></p><ul><li>You have experience building large-scale server applications.</li><ul><li>You think about clusters, caching and latencies</li><li>You are familiar with issues in large-scale systems and are eager to learn new technology</li></ul><li>You are familiar with a diverse set of programming languages and have a solid understanding of core engineering concepts:</li><ul><li>Unix process and concurrency models</li><li>Server application deployment and infrastructure automation</li><li>Relational &amp; distributed databases (e.g. MySQL, Cassandra, Riak, HBase, DynamoDB)</li><li>Principles of fault tolerance and security</li></ul><li>With freedom comes responsibility; you direct your own work and are proactive in seeking input</li><li>You have a scientific mindset and empirically test your hypotheses</li><li>BS, MS, or PhD in Computer Science or equivalent work experience</li></ul><p><strong><strong>Pluses</strong></strong></p><ul><li>Familiarity with Node.js</li><li>Experience with contributing to open source software and free culture</li><li>Self-organised, with experience in working in a geographically-distributed environment</li><li>You know what it means to be a volunteer or to coordinate the work of volunteers</li><li>Big ups if you are a contributor to Wikipedia and/or its sister projects</li></ul><p>Show us your stuff! If you have any existing open source software that you've developed (these could be your own software or patches to other packages), please share the URLs for the source. Links to GitHub, etc. are exceptionally useful.</p><p><strong>The Wikimedia Foundation is... </strong></p><p>...the nonprofit organization that supports Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge, free of interference. We host the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. The Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive <a href='https://donate.wikimedia.org/w/index.php?title=Special:LandingPage&amp;uselang=en&amp;utm_medium=wmfWikiLink&amp;utm_source=B_FAQ&amp;utm_campaign=C_FAQ' rel='nofollow'>financial support</a> from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.</p><p><em>The Wikimedia Foundation is an equal opportunity employer, and we encourage people with a diverse range of backgrounds to apply.</em></p><p><strong>Benefits &amp; Perks *</strong>&nbsp;</p><ul><li>Fully paid medical, dental and vision coverage for employees and their eligible families (yes, fully paid premiums!)</li><li>The Wellness Program provides reimbursement for mind, body and soul activities such as fitness memberships, baby sitting, continuing education and much more</li><li>The 401(k) retirement plan offers matched contributions at 4% of annual salary</li><li>Flexible and generous time off - vacation, sick and volunteer days, plus 19 paid holidays - including the last week of the year.</li><li>Family friendly! 100% paid new parent leave for seven weeks plus an additional five weeks for pregnancy, flexible options to phase back in after leave, fully equipped lactation room.</li><li>For those emergency moments - long and short term disability, life insurance (2x salary) and an employee assistance program</li><li>Pre-tax savings plans for health care, child care, elder care, public transportation and parking expenses</li><li>Telecommuting and flexible work schedules available</li><li>Appropriate fuel for thinking and coding (aka, a pantry full of treats) and monthly massages to help staff relax</li><li>Great colleagues - diverse staff and contractors speaking dozens of languages from around the world, fantastic intellectual discourse, mission-driven and intensely passionate people</li></ul><p>* for benefits eligible staff, benefits may vary by location</p><p><strong>More information</strong></p><p><a href='https://wikimediafoundation.org' rel='nofollow'>WMF</a></p><p><a href='https://blog.wikimedia.org' rel='nofollow'>Blog</a></p><p><a href='https://annual.wikimedia.org/2017/' rel='nofollow'>Annual Report - 2017</a></p><p><a href='https://meta.wikimedia.org/wiki/Strategy/Wikimedia_movement/2017' rel='nofollow'>Wikimedia 2030</a></p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/196841?reset=False&amp;ra=140TdVkKcOqI&amp;oqs=a%3D140TdVkKcOqI' rel='nofollow'>Apply now</a></div>            <h3>About Wikimedia Foundation, Inc.</h3>            <div><p><strong>The Wikimedia Foundation is...</strong></p><p>...the nonprofit organization that supports Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared&nbsp;knowledge,&nbsp;and that everyone should be able to access that knowledge, free of interference. We host the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. The Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive&nbsp;<a href='https://donate.wikimedia.org/w/index.php?title=Special:LandingPage&amp;uselang=en&amp;utm_medium=wmfWikiLink&amp;utm_source=B_FAQ&amp;utm_campaign=C_FAQ' rel='nofollow'>financial support</a>&nbsp;from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.</p><p><em>The Wikimedia Foundation is an equal opportunity employer, and we encourage people with a diverse range of backgrounds to apply.</em></p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Fully paid premiums for medical, dental &amp; vision insurance premiums</span>                            </li>                            <li>                                <span></span>                                <span>401(k) with 4% matching contribution</span>                            </li>                            <li>                                <span></span>                                <span>7-12 weeks parental leave with 100% pay + lactation room</span>                            </li>                            <li>                                <span></span>                                <span>Wellness Program ($1800 annual) to promote wellness &amp; personal growth</span>                            </li>                            <li>                                <span></span>                                <span>Pre-tax savings plans for Transportation &amp; Parking</span>                            </li>                            <li>                                <span></span>                                <span>Flexible work schedules and remote working options</span>                            </li>                            <li>                                <span></span>                                <span>Pet Friendly office</span>                            </li>                            <li>                                <span></span>                                <span>Commitment to diversity &amp; inclusion throughout the employee lifecycle</span>                            </li>                            <li>                                <span></span>                                <span>12 days vacation, 19 days holiday, 2 days volunteer work and more!</span>                            </li>                            <li>                                <span></span>                                <span>Lean more at https://wikimediafoundation.org/wiki/Work_with_us</span>                            </li>                    </ul>                "
  },
  {
    "id": "7zzUQz-iTu-4146lDsi7Jw",
    "url": "https://remote.co/job/client-support-associate/",
    "title": "Client Support Associate",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:express/nodejs/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=16, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/nodejs",
      "TITLE1/support",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "50% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "MaxMind",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 5:57:39 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Client Support Associate at <span>MaxMind</span></h2><div><span><i></i> Remote</span>         | <span> Entry-level </span></div><div>            <p><strong>REMOTE:&nbsp;<em>We require you to be eligible/authorized to work in the USA or Canada.&nbsp;<u>Regrettably, for regulatory reasons, we cannot currently hire in NY, NJ, TX and WA.</u></em></strong></p><p><strong>SUPPORT</strong></p><p><strong>FULL-TIME</strong></p><p>MaxMind (www.maxmind.com) is looking for a talented Client Support Associate to join our team. We help protect thousands of companies worldwide from fraud, screening over a billion online transactions each year, and we provide IP intelligence data to thousands more. Our clients rely on us to keep their businesses running smoothly, and we want you to help!</p><p><strong>Position Overview</strong></p><p>Are you a night owl looking for a rewarding, remote work opportunity? Do you enjoy problem solving? Are you excited and intrigued by different types of technology? Can you Google your way to virtually any information you can think of? Do you pride yourself on your ability to communicate better than most, and do you especially love to communicate via text? If you’re ticking off boxes as you read, we absolutely want to hear from you.</p><p>As a MaxMind Support Associate, you will play an integral role in helping our clients in their efforts to fight fraud and glean valuable insights into their users’ behavior. You’ll be right at the front lines, ensuring that all of their issues are resolved and their needs heard. This position requires you to approach your work with an inquisitive and independent mindset. There are no scripts to read from here at MaxMind. All of our customers receive authentic, case-by-case analysis from well-trained, well-informed associates. We provide the same type of customer service we like to receive ourselves.</p><p>At this time, we are only considering candidates who are comfortable with working hours in the range of midnight through 11 AM Eastern Time. A temporary daytime schedule will be required during your training period. After that, this will be a standard 8 hour shift, on the same schedule each day, Monday through Friday. We recognize that there can be challenges to working overnights, so we’ll consider it a priority to ensure that you maintain your comfort and health while doing so.</p><p><strong>Responsibilities</strong></p><p>You don’t need to know how to do all of the things below when you join, but you should be willing and able to learn how to perform these and a variety of other important tasks. You’ll be trained and supported by others along the way. Our support team is a tight-knit group, and we’ll make sure you always have the resources you need to get things done properly.</p><ul><li>Direct communication with our business customers via email and live chat</li><li>Careful and thorough troubleshooting of a wide variety of issues, both big and small; and triaging so you can notify our sysadmins in the event of something critical</li><li>Complete immersion into all things MaxMind, specifically our full product suite: you’ll learn it all, inside and out</li><li>Close monitoring and logging of bugs and other system issues in our internal project management tool</li><li>Collaboration with engineering, and other teams: you’ll share knowledge, ask lots of questions, and advocate for our customers’ needs</li><li>Maintenance and creation of FAQs and other much-needed content for our customer support center</li><li>Maintenance and creation of support-related internal documentation</li><li>Assistance, on an as-needed basis, with various data review and analysis projects</li></ul><p><strong>Minimum Qualifications (You will know you are a strong candidate for this position if you have)</strong></p><ul><li>Excellent communication skills, including the ability to type and write clearly and professionally</li><li>Aptitude for, and interest in, computer and information technology, and learning new kinds of tech</li><li>A natural inclination toward approaching things analytically</li><li>Enthusiasm for problem-solving and troubleshooting</li><li>Preference for, or at least comfort with, working late night and/or very early morning hours</li><li>Preference for, or at least comfort with, working independently (often by yourself)</li></ul><p><strong>Highly Desired (But not required)</strong></p><ul><li>Previous work in tech, and especially any customer support role</li><li>Professional OR personal experience with any computer programming languages</li><li>Experience working with remote coworkers</li></ul><p><strong>Bonus Skills (Also not required, just a nice to have)</strong></p><ul><li>Fluency in any, or more than one of, the following languages: Spanish, Portuguese, German, Japanese, Chinese, Russian, French</li></ul><p><strong>Working at MaxMind</strong></p><p>MaxMind is a casual, friendly, results-focused company of 40+ employees. About half of the company works remotely, so communication centers around video chat, group chat, and Agile planning tools. You will work remotely or out of our Waltham, MA, US office if you’re nearby.</p><p>In addition to medical, dental, and vision coverage, we offer several other benefits in the US, including a 401k with employer contribution, Health Savings Account, Limited Purpose Flexible Spending Account, paid parental leave, and a public transit reimbursement. Everyone is eligible to participate in a company performance-based bonus plan. MaxMind offers a $2,000 professional development budget and five days for professional development annually.</p><p>Our office is located near downtown Waltham, MA, outside of Boston, a five minute walk from the nearest commuter rail line and several express bus lines.</p><p>MaxMind’s founder gladly donates over 60% of corporate profits to charities (https://www.maxmind.com/en/corporate-giving).</p><p><strong>Diversity and Inclusion</strong></p><p>We’re committed to diversity and inclusion and are mindful of incorporating them into all aspects of our company. New ideas and perspectives come from diverse ways of seeing and thinking. MaxMind is sensitive to all individuals and viewpoints and believes everyone’s contributions and opinions are valuable assets to our team.</p><p>We hold regular diversity and inclusion meetings and conduct informative sessions on improving collaboration and communication. We value bringing individuals and different perspectives together within and across every department.</p><p>We encourage and sincerely welcome applications from candidates of color, women, queer candidates, candidates with family caregiving responsibilities, transgender candidates, and from other communities not well represented in the tech world.</p><p>If you have suggestions on how we may better promote or express our commitment to diversity and inclusion, we would love to hear from you. Please send your suggestions to hr@maxmind.com.</p><p><em>Resumes without cover letters will not be considered. We want to know about you. Please also share any projects or accomplishments and include a link so we can learn more.</em></p>        </div><div>        <a href='https://jobs.lever.co/maxmind/5ebc23ac-2131-4d7f-85d1-f8b355be1bc3' rel='nofollow'>Apply for job</a>    </div>"
  },
  {
    "id": "jcuN6JhkQm25xO_FlSPD9w",
    "url": "https://weworkremotely.com/remote-jobs/pressable-customer-success-engineer",
    "title": "Pressable: Customer Success Engineer",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:wordpress/php/35",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=40, embedded=0, frontend=9}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Pressable",
      "sameAs": "https://pressable.com/careers/apply/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 23, 2018 5:05:20 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Customer Success Engineer</h2><span>Company: Pressable<br></span><span>Headquarters: San Antonio, TX<br></span><span>https://pressable.com/careers/apply/<br><br></span>  <div>    <div>Pressable provides the best WordPress hosting in the world. Our world-class hosting offers a rock-solid platform, fair pricing, and a team that cares deeply about our customers. This is where you come in!</div><div><br></div><div>We are looking to grow our diverse team of individuals with a background in WordPress, the technical knowledge for anything that comes their way, and the determination to get the job done. Our Customer Success Engineers establish relationships with our customers by listening to their needs, understanding their problems, and providing tailored solutions.</div><div><br></div><div><b>Your day may involve:</b></div><div><b><br></b></div><ul><li>Interacting with existing and potential customers by responding to WordPress and platform related inquiries through email-based tickets, live chats, and potentially other mediums.&nbsp;<br></li><li>Migrating WordPress installs from other hosted providers to the Pressable platform.<br></li><li>Identifying and cleaning up malware-infected sites, providing advice, and preventing recurrence.<br></li><li>Writing and maintaining documentation, writing blog posts, and contributing to the community of WordPress support around the globe.<br></li><li>Deeply diving into WordPress issues for high-touch enterprise clients and agencies.</li></ul><div><br></div><div><b>Being a Customer Success Engineer requires:</b></div><div><b><br></b></div><ul><li>A solid foundation in WordPress, its inner-workings, common issues, community, and proper use-cases.<br></li><li>An eagerness to learn and the ability to adapt, allowing you to teach others. You are a lifelong learner.<br></li><li>Knowledge and experience with common web technologies, including HTML, JavaScript, CSS, and Git. You are comfortable working with and solving problems with PHP code.<br></li><li>Excellent writing and communication skills with a passion for taking technical language and making it understandable. You are fluent and eloquent in written English.<br></li><li>Advanced proficiency using the command line, WP-CLI, and an understanding of the domain name system (DNS), domain registration, and email various email setups. You are not afraid of the terminal.<br></li><li>A willingness to regularly assist with weekend coverage and some holiday and evening coverage. You are flexible, we support being able take care of your own needs however, our customers are global, and rely on us to provide expedient support, at any time of day<br></li><li>Self-driven work ethic. You are a self-starter who loves taking initiative and seeing things through to completion.</li></ul><div><span><br></span></div><div><b>How to Apply:</b></div><div><b><br></b></div><div>When applying you will be required to select one of the following open shifts:</div><div><br></div><div>Shift 1: 6pm - 2am PST / 8pm - 4am CST / 9pm – 5am EST</div><div><br></div><div>Shift 2: 10pm – 6am PST / 12am – 8am CST / 1am – 9am EST</div><div><br></div><div>We may invite applicants to complete a limited-time paid trial as part of the hiring process. A trial is a shared opportunity for our team and the applicant to get experience working together to see if we’re the right fit.</div><div><br></div><div>If applicants demonstrate the aforementioned knowledge, skills and abilities necessary to be a Customer Success Engineer during the trial, they'll be invited to join us full-time.</div><div><br></div><div><b>Our benefits are great. You can expect:</b></div><div><br></div><ul><li>Flexibility. Our team is remote, meaning you can work from anywhere you want as long as you have an internet connection.<br></li><li>Medical, dental, vision, and life insurance for less than $10. We pay 99% of premiums for you and your family.<br></li><li>401(k) matching. We match your 401(k) contributions up to 6% of your salary.<br></li><li>A generous time off policy. We want our team members to enjoy a phenomenal work–life balance.<br></li><li>An annual company retreat.<br></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://pressable.com/careers/apply' rel='nofollow'>https://pressable.com/careers/apply</a></p>  </div>"
  },
  {
    "id": "X-t4anORQVWte2d9E8mOFQ",
    "url": "http://workinstartups.com/job-board/job/72296/weekend-customer-services-representative-at-hubbox/",
    "title": "Weekend Customer Services Representative",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "HubBox",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 23, 2018 9:46:41 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "What is HubBox? <br />HubBox is an award-winning, VC-backed, high-growth start-up based in London. We are solving the problem of missed parcel deliveries, revolutionising how the largest online retailers in the UK offer Click & Collect via our innovative technology platform. Our clients include retailers such as Boohoo, Jack Wills, Warehouse, and AX Paris.<br /><br />We’re on track to become a market leader in last mile delivery in the UK. We do this by finding brilliant people, creating superior processes, and combining that with the intelligent application of cutting-edge technology.<br /><br />Our Collect Point network spans the whole of the UK and earlier this year we won the coveted Retail Week Launch Pad Award. We were also named as one of the top 100 businesses in the UK under three years old by the prestigious Startups 100 index.<br /><br />Customer service is one of the most important parts of our business and your role is an integral part of our successful team. You will need a passion for customer service and will adopt the critical responsibility of ensuring that the HubBox customer experience is consistently excellent.<br /><br />We are looking for a smart, ambitious candidate who is excited to lead our Customer Service department on Saturdays and Sundays. We are based in Wandsworth, London, however, this role can also be remote.<br /><br />The Role<br />The key responsibilities for this role include:<br />Handling phone and email queries from retailers, Collect Points, and customers with care and professionalism<br />Training Collect Point locations over the phone <br /><br />Requirements<br />We are looking for someone with the following characteristics, skills and experience:<br />A friendly and outgoing nature<br />Excellent written and spoken English<br />Previous customer service roles and experience using different software systems, moving from one to another easily (training provided)<br />Extremely well organised and punctual<br />Able to stay calm and focused while working in a fast-paced, deadline-oriented environment<br />Good at problem-solving<br />Ability to think on your feet and use your own initiative<br />Strong team player with a positive, results-focused attitude"
  },
  {
    "id": "c43vhy3HT2KAtJUJAsHJqA",
    "url": "https://www.remoteage.com/remote-jobs/support-engineer-kinsta/",
    "title": "Support Engineer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:lamp/php/13",
      "DBG_TECH1:k/t/w:php-7/php/8",
      "DBG_TECH1:k/t/w:php/php/15",
      "DBG_TECH1:k/t/w:wordpress/php/45",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=81, embedded=0, frontend=4}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Kinsta",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2018 7:53:16 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Support Engineer</h2><div>Worldwide</div><div>Company: Kinsta<p></p></div><div>FULL-TIME</div><div><h3>Overview</h3><p>We (Kinsta.com) are a modern cloud hosting startup focused on WordPress hosting. Our awesome, young, and motivated team is scattered across the globe: Europe, Asia, Australia, and North America.</p><p>Our client base is growing steadily and we’re looking for a competent support engineer with exceptional communication skills who can provide enterprise level technical support to our customers via our support system.</p><p>We are looking for someone to start immediately!</p><p>Our support team works with our customers using chat and email (we use Intercom.io exclusively for these purposes). As a Kinsta Support Engineer you will:</p><ul><li>Take ownership of issues reported by customers and see problems through to resolution.</li><li>Research, troubleshoot, and identify solutions to resolve customer issues.</li><li>Follow standard procedures for proper escalation of unresolved issues to the appropriate internal teams.</li><li>Provide prompt and accurate feedback to customers.</li><li>Monitor uptime and analyze transactions data using third party analytics tool to resolve more advanced issues.</li><li>Document troubleshooting and problem resolution steps for internal use and to extend our Knowledge Base.</li><li>Carefully follow internal documentation to perform website migrations and repair websites infected with malware.</li></ul><h2><strong>REQUIREMENTS</strong></h2><p>The ideal Kinsta Support Engineer is technically-knowledgeable, upbeat, professional, curious, and self-motivated.</p><p>Excellent support is one of the cornerstones of our business. Our clients have come to expect industry-leading support and it’s our pleasure to deliver that to them. As a result, we’re pretty careful about adding new Support Engineers to our team.</p><p>We hire Support Engineers with a variety of different areas of expertise – some of us are WordPress developers, others are Linux server gurus, while others are technically-knowledgeable internet generalists who have mastered the art of customer service.</p><h3><strong>All of our Engineers must meet the following core requirements:</strong></h3><ul><li>Completely fluent in English with excellent written communication skills.</li><li>Capable of thriving in a fast-paced and occasionally stressful environment interacting with multiple clients simultaneously while maintaining a professional and friendly tone.</li><li><strong>Our Support Engineers must know WordPress deeply</strong>. All we host is WordPress and we have the best support team in the business (even if we do say so ourselves). While you don’t have to be a full-fledged WordPress developer to be a Kinsta Support Engineer, you do need to know the WordPress database and file/directory structure as well as the wp-config.php file like the back of your hand.</li><li>A basic understanding of or familiarity with the following technologies: Linux, nginx, PHP, MySQL/MariaDB, HTML, CSS, JavaScript, DNS, CDN, and caching (object and page).</li><li>Consummate professionalism: we’re a distributed team and we expect you to act like the professional we know you are. That means being a member of the Kinsta team requires excellent communication, rock-solid reliability, and the drive to bring your best effort to bear on your work every single day.</li></ul><p><strong>Our Support Engineers deal with a lot more than just WordPress! While you don’t need to be a full-stack developer to fill this role, you will be providing hosting support to full-stack developers, so you do need to be familiar with the full-stack, from Linux web servers to browser dev tools.</strong></p><h2><strong>Bonus points:</strong></h2><ul><li>Completely fluent in a second language. Languages we’re currently targeting include: Italian, French, Japanese, Dutch, Portuguese, Swedish, Finnish, Danish, and Norwegian.&nbsp;<strong>If you are fluent in one of these languages please highlight this information when you apply!</strong></li><li>Deep expertise in any (or all!) of the following: WordPress, Linux, NGINX, PHP and MySQL.</li><li>Experience setting up, managing, and supporting LEMP/LAMP stacks.</li><li>Prior experience working with customers over chat in a technical role in a fast-paced environment – particularly experience providing live support for web hosting or WordPress products.</li></ul><h2><strong>BENEFITS</strong></h2><p><strong>This is a fully-remote role.</strong>&nbsp;Our Support Engineers can work from anywhere they have reliable internet access.</p><p>We always use the latest version of everything: PHP 7.2, NGINX, Ubuntu 18.04, Linux containers, Google Cloud and more, so you’ll be able to work with a bunch of exciting technologies and use them every day!</p><p>This position offers a great deal of flexibility, responsibility, competitive salary, and opportunity for growth for the right candidate.</p><p>If you want to learn more about Kinsta and what it’s like to work for our team, head to our website, Kinsta.com, and look for the About Us link in the footer.</p><p></p><div> <a href='https://kinsta.workable.com/jobs/795942/candidates/new' rel='nofollow'>Apply for job</a></div></div>"
  },
  {
    "id": "xx0Fo2XCTd60hqpIwPuxow",
    "url": "https://www.workingnomads.co/jobs/customer-champion-part-time-west-coast-hours-akkroo",
    "title": "Customer Champion (Part Time, West Coast Hours)",
    "tags": [
      "DBG:surround``OR(eastern, east, est, edt, newyork) 2W hour",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/support",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Akkroo",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2018 11:26:58 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<p><strong>About Us</strong></p><p>Launched in 2013, Akkroo is a fast-growing, London headquartered B2B SaaS company, at the forefront of a new, emerging category that helps businesses bridge the gap between exhibiting at live events, and their sales, Marketing Automation and CRM solutions.</p><p>We’ve spent the last 4 years developing the platform, building an incredible international customer base and laying the foundations for further global growth. After reaching $1M in Annual Recurring Revenue (ARR) and raising a preSeries A round in 2016, we are growing and on the journey to $10M ARR and beyond.</p><p><strong>About the Role</strong></p><ul><li>This is a part time, remote position ideally based in West Coast of the US (or working the hours of 12:30pm to 5:30pm PST).&nbsp;</li><li>You will have some time overlap with our other US-based Customer Champion, who works East Coast hours.&nbsp;</li><li>Our ideal team mate will be familiar with working with customers in adopting and troubleshooting B2B software, have an empathetic attitude to customer success and is someone who believes in our vision for better events.&nbsp;</li><li>You’ll be part of our larger, UK-based Customer Experience &amp; Support team, who supports customers globally through delivering a world-class customer service, crafting documentation, troubleshooting bugs, customer training, and go above and beyond to ensure that all customers have a great experience.</li><li>You’ll become an Akkroo product expert, which will involve accurately identifying, analyzing, and resolving technical and non-technical issues, by promptly dealing with tickets in a timely, human manner and answering questions via a number of channels (phone, email, and live chat).</li><li>As the second US-based hire, you’ll be part of a growing team in the Americas. This is an excellent opportunity to get on the ground floor and help build a strong Akkroo presence in the US.</li></ul><p><strong>Requirements</strong></p><ul><li>At least 2 years support experience, ideally with B2B or SaaS software</li><li>We’re looking for someone who can work 12.30pm-5.30pm PST, Monday to Friday (flexibility to work earlier or later if required)</li></ul><p><strong>About You</strong></p><ul><li>You’re self-suﬃcient and love the challenge of solving problems and learning new things, but also thrive in an environment where you can do great work independently.&nbsp;</li><li>You’re patient and good humored. You’re an excellent listener and educator, and you’re always in search of new opportunities to contribute.</li><li>You’re passionate about support. You’re able to empathize with customers in a genuine way that lets them know you care about their issues.</li><li>You’re an excellent communicator, ﬂuent in written English with a style focused on building human relationships with customers. You’re just as comfortable on the phone as you are in an email or Live Chat.</li><li>You’re curious and have a natural ability to “zoom out” of a problem, in order to ask the right questions. An empathetic problem solver who goes out of their way to help people succeed.</li><li>You’re proactive when it comes to challenges. When you don’t know something, you embrace the chance to grow and get better.</li><li>You’ve ideally worked a remote/work-from-home position before, and have your own office setup</li></ul><p><strong>What We Value</strong></p><p>Choosing your next a job is a big commitment for both you and us, so we are careful to select people who demonstrate they will be a great ﬁt from day one.</p><p>We seek people who closely share in our ﬁve values (chosen by our team) and apply them carefully in their own life and work.</p><ul><li>Good judgment&nbsp;</li><li>Make an impact&nbsp;</li><li>Be curious &amp; innovate&nbsp;</li><li>Build trust&nbsp;</li><li>Embrace the journey</li></ul><p>Every member of our team actively shapes our startup business; so personal learning, contribution and growth is very important to us all.</p><p><strong>What We’re Offering</strong></p><ul><li>Competitive salary, based on an hourly rate&nbsp;</li><li>Plus range of beneﬁts&nbsp;</li><li>This is a part time, remote based role in the US, so all applicants must be authorized to work in the US</li></ul>"
  },
  {
    "id": "hM0N1UgCQPqMqQQcvMY27A",
    "url": "http://workinstartups.com/job-board/job/72239/technical-support-engineer-software-support-at-edge10/",
    "title": "Technical Support Engineer (Software Support)",
    "tags": [
      "DBG:surround``2N(work,remot) 9W OR(travel,visit)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:macos/apple/2",
      "DBG_TECH1:k/t/w:windows/dotnet/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=16, c=0, mobile=2, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=4, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/support",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "EDGE10",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2018 10:28:12 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "EDGE10 is perfecting human performance.<br />We provide advanced analytics solutions to the world’s top sports teams. We empower elite sport with actionable insights, leading to faster and higher quality decision making.<br /><br />We work with over 250 teams across the world including Olympic organisations, the AFL, NRL, NFL, NBA, EPL, and MLS; and sport is just the beginning, we have even put EDGE10 to work tracking astronaut performance as part of the European space programme.<br /><br />We’re recruiting for a technical support engineer to join our team based in Central London and help our clients to use our existing suite of products for the professional sports industry.<br /><br />The Role<br /><br />Supporting EDGE10's clients as the front line of our support service you will be the first point of contact for clients seeking help and advice regarding our products. We will train you up on our bespoke software products and your core tasks will be analysing client issues, resolving them where able, or liaising with one or more of our other teams as appropriate based on your assessment of the issue or request. You will also be involved in ad-hoc support related projects and have the opportunity to assist all EDGE10 teams in a number of areas.<br /><br />A focus on troubleshooting and quick and professional fault resolution is key and if you have some understanding of SQL Databases, JSON, or Java scripting, and can read and make basic changes to Config Files then even better.<br /><br />Due to our international client base, in future the hours for this role may move to a shift pattern, e.g. 6am to 3pm, 9am to 6pm, 11am to 8pm.<br /><br />Essential Skills and Knowledge:<br /><br />Excellent fault finding, problem analysis, and prioritisation ability<br />Excellent and professional communication skills<br />Experience in a technical support capacity<br />Good knowledge of Installing, supporting, and trouble shooting software<br />Good organisation skills<br />A fantastic work ethic.<br />Willingness to go the extra mile for the team!<br /><br />Useful Skills and Knowledge:<br />Support ticket management<br />Support of Windows 7, Windows 10, and MacOS based systems.<br />Basic knowledge of SQL Databases<br />Basic knowledge of JSON<br />Basic knowledge of Java scripting<br /><br />We offer the opportunity to join a company poised for rapid and exciting global growth, who count some of the most famous sports teams in the world as customers.<br /><br />The role will be based in East Central London. As a progressive business we offer flexible working patterns and the opportunity, in part, to work remotely. International travel, on-call, and on occasion, unsociable working hours are to be expected given our global client base.<br /><br />You will be working with a team of people who really care about their customers. Every member of the team gets recognised for their great work and we encourage all our employees to improve themselves both technically and by expanding their role at the company."
  },
  {
    "id": "F4FsZY0hQiK3g02WyNITyw",
    "url": "https://weworkremotely.com/remote-jobs/award-force-book-keeping-administration-bilingual-english-french-speaker",
    "title": "Award Force: Book keeping & administration, bilingual English / French speaker",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(europ, european, europeanunion)",
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 3W OR(time,timezon)",
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/support",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Award Force",
      "sameAs": "https://www.awardforce.com/careers"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2018 5:01:54 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Book keeping &amp; administration, bilingual English / French speaker</h2><span>Company: Award Force<br></span><span>Headquarters: Sydney, Australia<br></span><span>https://www.awardforce.com/careers<br><br></span>  <div>    <div>Awesome opportunity to join a fast-growth small business with a great product, operating globally. Flexibility to work remotely from wherever you are— we have a preference for you to be settled in a Europe or Asia Pacific region time zone, due to location of other team members you will interact with.</div><div><br></div><div>Award Force (www.awardforce.com) is a reputable Australian SaaS company, scaling internationally. We are looking for a detail-obsessed person to help support our growth by taking responsibility for all day-to-day book keeping and general administration, reporting directly to the Managing Director.</div><div><br></div><div><b>Responsibilities</b></div><div><br></div><ul><li>Daily review and issue of invoices<br></li><li>Daily reconciliation of bank statements with accounts<br></li><li>Respond to client queries and requests regarding their invoices / payments<br></li><li>Facilitate credit card payments<br></li><li>Keep business records and information up-to-date across multiple online tools and systems<br></li><li>Assist leadership team with weekly, monthly, quarterly and annual business reporting needs<br></li><li>Identify and implement opportunities for process improvement<br></li><li>Liaise with our accountants and financial advisors (external) as necessary<br></li><li>General administration and communication with external finance and insurance providers and government departments</li></ul><div><br></div><div><b>Essentials</b></div><div><br></div><ul><li>Business-level fluency in both English and French (the role is dealing with accounts and communication in both English and French)<br></li><li>Book keeping experience with either Xero or QuickBooks, or both (we use Xero for our primary Australian entity, and QuickBooks for our French subsidiary)<br></li><li>You’re curious, and love learning. If you don’t know something, you speak up, and if you have an idea for improvement you can’t keep quiet<br></li><li>You’re super organised and process oriented. You will be comfortable using multiple tools for various aspects of the role<br></li><li>You have fantastic interpersonal skills and are an excellent communicator, verbal and written<br></li><li>You can work independently, are self-motivated, but enjoy being part of a team<br></li><li>Working remotely suits you perfectly, your natural work ethic and real passion for helping people keeps you motivated<br></li><li>You have access to fast, reliable internet and a dedicated space to work without distractions</li></ul><div><br></div><div><b>What we offer</b></div><div><br></div><ul><li>Full-time role, based remotely, work from anywhere from Europe to Asia Pacific<br></li><li>Competitive salary, commensurate with experience<br></li><li>Friendly, sociable, mature, responsible team<br></li><li>Lots of training and excellent internal support<br></li><li>We’re ready to go when you are, the sooner the better<br></li><li>Your birthday is a holiday every year<br></li><li>20 days paid annual leave<br></li><li>38-hour working week, Monday to Friday (your weekends are yours)<br></li><li>A budget for computer equipment (pending 3 month probationary period)<br></li></ul><div><span><br></span></div><div><b>Award Force is an equal opportunity employer. We are a growing business made up of professional, like-minded, mature individuals who celebrate diversity, work in a discrimination free environment, value continuous improvement and support environmental initiatives.</b><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Submission is via the Award Force system only, the application will take you about 15-20 minutes and applications outside the system will not be considered.Ready? Here you go… <a href='https://careers.awardsplatform.com' rel='nofollow'>https://careers.awardsplatform.com</a></p>  </div>"
  },
  {
    "id": "YwEVOqcRRmmj6AWc_CZ71g",
    "url": "https://weworkremotely.com/remote-jobs/ifttt-platform-support-specialist-part-time-contract",
    "title": "IFTTT: Platform Support Specialist (part-time contract)",
    "tags": [
      "DBG:surround``OR(abl,will,challeng,flexibl,experi,get,prefer) 2W 2N(work,remot)",
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 3W OR(time,timezon)",
      "DBG_TECH1:k/t/w:applet/java/8",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/support",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "IFTTT",
      "sameAs": "https://ift.tt/platform-support-specialist"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 21, 2018 9:52:36 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Platform Support Specialist (part-time contract)</h2><span>Company: IFTTT<br></span><span>Headquarters: San Francisco, CA<br></span><span>https://ift.tt/platform-support-specialist<br><br></span>  <div>    <div>As a Platform Support Specialist, you will help us respond to technical customers working to build high quality services. Ideally, you’re able to work in a time zone that helps us provide improved response times to customers that reach out.</div><div><br></div><div>This role involves collaborating 10 to 15 hours per week with a small team that works cross-functionally with every team at IFTTT.&nbsp; You’ll have an opportunity to make a meaningful impact as we build the platform of the future.</div><div><br></div><div><b>What you will do:</b></div><ul><li>Efficiently triage technical questions and feedback from developers building services and Applets on the IFTTT Platform<br></li><li>Help to continuously improve the platform documentation and in-product explanations<br></li><li>Become an IFTTT Platform expert who can explore answers to internal questions from IFTTT sales teams<br></li><li>Identify and reproduce technical issues, documenting product enhancements, and user experience improvements<br></li><li>Assist with the platform’s service review process<br></li></ul><div><span><br></span></div><div><b>We are looking for:</b><br></div><ul><li>Fluent in written and spoken English<br></li><li>Available to work between 10pm and 6am Pacific Standard Time<br></li><li>Experience working remotely<br></li><li>Experience working with product and engineering teams<br></li><li>Experience with email support, CRM tools<br></li><li>Plus: familiarity with APIs and OAuth 2<br></li><li>Plus: familiarity with JavaScript or other programming languages<br></li><li>Plus: developer platform experience<br></li></ul><div><span><h4></h4></span></div><div><span></span></div><div><span></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Submit your resume via <a href='https://ift.tt/platform-support-specialist' rel='nofollow'>https://ift.tt/platform-support-specialist</a></p>  </div>"
  },
  {
    "id": "S2ulZn2vT7aM9r757IwvYA",
    "url": "https://weworkremotely.com/remote-jobs/modern-tribe-wordpress-technical-support",
    "title": "Modern Tribe: WordPress Technical Support",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:wordpress/php/35",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=40, embedded=0, frontend=9}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Modern Tribe",
      "sameAs": "https://modern-tribe.breezy.hr/p/5a79905b1bdf-wp-technical-support?source=weworkremotely"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 21, 2018 1:27:08 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>WordPress Technical Support</h2><span>Company: Modern Tribe<br></span><span>Headquarters: Worldwide<br></span><span>https://modern-tribe.breezy.hr/p/5a79905b1bdf-wp-technical-support?source=weworkremotely<br><br></span>  <div>    <div><h3><span>The Opportunity</span></h3></div><div>Our team is growing and we’re looking for a seriously support-loving person to add to the mix. We currently provide technical support for a growing suite of WordPress plugins through the forums we run and manage on our website, but have hit a spot where extra help building relationships with our customers will make a world of difference.</div><div><br></div><div>We’re looking for someone for around 10-15 hours a week to help us go the extra mile when customers reach out for help with the both the tech-y and less tech-y side of things, like bug reports, feature requests, product reviews, account access and questions about product features.</div><div><br></div><div>However, we won’t lie. This will be a fast-paced position where a successful person will be genuinely happy to help customers with a myriad of questions. There are more than 400,000 active installs of The Events Calendar running on websites around the world and many of them have questions that require timely assistance.</div><div><br></div><div>Support is at the center of everything we do here at Modern Tribe, we want you to help our community thrive.</div><div><br></div><div><h3><span>Inclusion Statement</span></h3></div><div>Modern Tribe is committed to a culture that embraces diversity and inclusion. We foster an environment of collaboration, open engagement, fairness and respect regardless of differences in age, race, disability, national origin, gender identity, religion, sexual orientation or veteran status. As a hybrid workspace ranging from distributed contractors to traditional employees, we value the unique perspectives and experiences of our global team.</div><div><br></div><div>We come from all walks of life. We are small business owners. We are tattoo aficionados and 80’s movie buffs and ex-pats. We are homeschool teachers. We are single parents. We are musicians, college drop-outs, and entrepreneurs. We are travelers, feminists, runners, volunteers, and makers. We are a Modern Tribe.</div><div><br></div><div>Everyday we strive to fulfill our motto: live well and do good work. We hope you will consider joining us.</div><div><br></div><div><h3><span>Responsibilities</span></h3></div><ul><li>Moderating the support inbox, ensuring customers and potential customers receive responses within 24 hours of submission</li><li>Field incoming feature requests and document them for consideration in the roadmap</li><li>Take point on the WordPress.org forums for our core plugin offerings</li><li>Testing bug reports locally and logging them in our projects system, with appropriate detail and testing instructions, when a bug is confirmed as legitimate</li><li>Pre-release quality assurance testing for every new release and product</li><li>Recording video walkthroughs highlighting plugin functionality</li><li>Creating tutorials, documentation, screencasts and other forum materials to help guide people to success</li><li>Writing snippets to solve one-off problems</li><li>Helping run regular user testing sessions</li><li>Being the voice of the community during roadmap discussions</li><li>Supporting product partners (other theme/plugin authors) and nonprofits</li></ul><div><h3><span>Personal Competencies</span></h3></div><ul><li>Strong communication skills</li><li>Experience working as part of a remote team</li><li>Self-motivated, detail-oriented</li><li>Strong organizational skills</li><li>A methodical approach to all tasks</li><li>Ability to prioritize workloads and meet deadlines</li><li>Fluent English speaker</li></ul><div><h3><span>Knowledge &amp; Experience</span></h3></div><ul><li>Strong communication and/or experience working as part of a remote team</li></ul><ul><li>A strong comprehension of PHP, CSS, HTML and JavaScript and can provide 4-5 original code samples to back it up. This is important because our products are highly technical, and you will not succeed without these skills.</li><li>A love for all things WordPress with a good understanding of its codebase and community</li><li>Basic familiarity with The Events Calendar, our main product. Bonus points for experience using any of premium add-ons, such as Events Calendar PRO.</li><li>Experience working with GitHub or other repo-sharing platforms. In other words, you can clone repos, pull branches and set up local WordPress installs without hassle.</li><li>Self-motivated, detail-oriented, strong organizational skills, with a methodical approach to all tasks</li><li>Ability to prioritize workloads and meet deadlines</li></ul><div><h3><span>Additional Experience (Bonus Points)</span></h3></div><div></div><div><br></div><ul><li>Have built your own WordPress plugins. Double bonus points if those plugins extend The Events Calendar.</li></ul><ul><li>Love doing video tutorials and have a home setup to do it</li><li>Have a proven track record providing support specifically for WordPress plugins, or have an active track record in the WordPress.org community</li></ul><div></div><div><br></div><div><h3><span>Location</span></h3></div><div>Work from anywhere in North, Central or South America. If your timezone is outside of US business hours, but you work at least 3+ hours of overlap each day, let's chat. You must be fluent in English. You just need a computer and a strong wifi signal to support daily video chats with the Tribe.</div><div><br></div><div><h3><span>Compensation</span></h3></div><div>Pay range is between&nbsp;<span>$15-$22</span>&nbsp;US per hour commensurate with qualifications and experience. We are currently looking for freelance contractors about&nbsp;<span>15&nbsp;</span>hours a week for this gig.</div><div><br></div><div><h3><span>Perks</span></h3></div><div>We believe that distributed working is a way of life. We understand what it means to work remotely. We offer consistency in expectations, payment, and support. We believe in learning from each other and fostering personal growth. You can expect to learn a lot while working with us.</div><div><br></div><div>(Also, if you work enough with us, we’ll bring you on the&nbsp;<a href='https://vimeo.com/254214062' rel='nofollow'>team trips</a>.)</div><div><br></div><div><h3><span>Who We Are</span></h3></div><div>Modern Tribe, Inc. is a rapidly growing software &amp; design company. We develop custom solutions for some of the world’s largest companies, government institutions and smaller growing organizations. We pride ourselves on our ability to bridge people and technology and to bring the passion and dedication of an entrepreneur to every project. Our team is composed of talented employees and freelancers around North &amp; South America (and a smattering across the globe).</div><div><br></div><div><h3><span>Who You Are</span></h3></div><div>We love working with each other because we have built a culture that suits us well. We work primarily with freelancers and coordinate their talents for large projects. To be on our team, you must be:</div><div><br></div><ul><li><span>HAPPY:&nbsp;</span>Where there is a will, there is a way. Having a positive disposition allows us to achieve great things and to support each other.</li><li><span>HELPFUL:&nbsp;</span>Always looking for ways that you can help others.</li><li><span>CURIOUS:&nbsp;</span>It is essential that you have a passion for learning. Technology changes daily, and life has a way of constantly raising the bar.</li><li><span>ACCOUNTABLE:&nbsp;</span>Our clients expect us to get the right thing done on budget and on time. Communicating expectations and meeting them is the cornerstone of success.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://modern-tribe.breezy.hr/p/5a79905b1bdf-wp-technical-support?source=weworkremotely' rel='nofollow'>https://modern-tribe.breezy.hr/p/5a79905b1bdf-wp-technical-support?source=weworkremotely</a></p>  </div>"
  },
  {
    "id": "KsFy0V8QQYOdgZ3SIy9Qdg",
    "url": "https://jobspresso.co/job/customer-service-representative-7/",
    "title": "Customer Service Representative",
    "tags": [
      "DBG:surround``12N(work, OR(home,remot), 5N(OR(offic,headquart,onsit), OR(dai,daili,week,weekli,month,monthli)) )",
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG_TECH1:k/t/w:coffeescript/frontend/3",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=3, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=3}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "Bulletproof",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 21, 2018 6:18:18 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Customer Service Representative</h2><div>Support<br></div><div>Greater Seattle Area<br></div><div>Company: Bulletproof<br></div><div>Full Time<br></div><h3>Overview</h3><p>Bulletproof is an omni-channel content driven consumer products company. Our vision is to make high performance a daily reality for everyone by upgrading the earth’s coffee and food. Our mission is to help people perform better, think faster, and live better using a proven blend of ancient knowledge and new technologies, informed by science, and measured results from our customers. BP products help people live better by using fat for fuel, saying goodbye to sugar and supercharging mitochondria.</p><p>Our customers know that our coffee, beverages, food, and supplements are the purest you can get anywhere, and you can expect to feel a difference in how you perform the first time you experience them. Environmentally conscious and ethically sourced products build a sustainable foundation for future generations to thrive.</p><p>The Bulletproof team is looking for a flexible, committed, self-motivated&nbsp;&nbsp;to join our Customer Service group. Bulletproof is a high-performance team of experienced entrepreneurs and biohackers working to upgrade human performance with industry-leading supplements, coffee, products and technology.&nbsp; We have a great virtual work environment with our workforce centralized on the West Coast.&nbsp; While our culture is casual and our schedules flexible, everyone on the team is smart, focused and driven. We’re passionate about our own biohacking, achieving impressive individual results and sharing actionable, accurate, science-backed information that changes people’s lives every day.</p><strong>Customer Service Representative</strong><p></p><strong>Key Responsibilities:</strong><ul></ul><li>Conduct operations in support of Enterprise helpdesk environment: execute scripts, answer calls, troubleshoot, resolve, and/or escalate customer issues, open and close tickets, correlate events and incidents for management of customer support services.</li><li>Provide one-on-one customer support over multiple communication platforms; includingemail, phone and live chat.</li><li>Assist customers with accessing and navigating various Bulletproof platforms, including: e-commerce site, Bulletproof forum, email subscription, etc.</li><p></p><strong>Skills and Experience:</strong><ul></ul><li>Highly knowledgeable about the Bulletproof lifestyle and products.</li><li>Skilled in using Zendesk, MS Office 365: Outlook, Excel, PowerPoint and Word.</li><li>Strong client facing communication skills, including patience, empathy, and the ability to intently listen.</li><li>Highly evolved ability to address customer’s needs and concerns, and identify quick resolutions.</li><li>Experience in online customer support is preferred – 6 months – 2 years customer service experience is a plus.</li><li>High-school diploma or equivalent.</li><p></p><strong>About You:</strong><strong>&nbsp;&nbsp;</strong><ul></ul><li>You live in the greater Seattle area.</li><li>You have a passion for the Bulletproof lifestyle, our products, learning and high-performance.</li><li>You have a passion for helping customers and believe in customer driven communication.</li><li>You are flexible, organized, tech savvy and customer focused.</li><li>You lead a gratitude fueled lifestyle.</li><li>You are detail oriented, have excellent time management skills, and the ability to multitask/prioritize.</li><li>You possess strong organizational, written and interpersonal communication skills.</li><li>You demonstrate the ability to accurately communicate complex issues, facts, information and/or ideas in written and verbal communication.</li><li>You possess emotional intelligence with the ability to work independently and as a team player while presenting a professional demeanor.</li><li>You have the ability to handle sensitive situations and confidential information with the utmost care, professionalism and good judgment.</li><li>You are solution focused and have the ability to identify customer needs, challenges and opportunities for improvement.</li><p>This is a full-time, remote position, that requires some weekend work and occasional work days at our headquarters in downtown Seattle. Maximum fun, maximum knowledge, and maximum performance, are a part of the job description, and you’ll get to work with the team on a regular basis to upgrade your game, your mental performance, and your life. This is also a great opportunity to grow with the company.</p><p>Think you’ve got what it takes?</p><p>Let’s talk!</p><div> <div><div><p>To apply for this job please visit the following URL: <a href='https://jobs.jobvite.com/bulletproof/job/oiif8fwH' rel='nofollow'>https://jobs.jobvite.com/bulletproof/job/oiif8fwH →</a></p></div></div></div>"
  },
  {
    "id": "x1jPy7liTAKe_9tkzpFvsA",
    "url": "https://www.remoteage.com/remote-jobs/support-hero-hotjar/",
    "title": "Support Hero",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 2W hour",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:css/frontend/6",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/support",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Hotjar",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 44000,
      "maxValue": 60000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 18, 2018 1:16:16 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Support Hero</h2><div>Americas - EST</div><div>Company: Hotjar<p></p></div><div>FULL-TIME</div><div><h3>Overview</h3><p><strong>Note:</strong>&nbsp;Although this is a remote position, we are currently only considering candidates in timezones within the Americas and&nbsp;willing to work EST hours.</p><p>Hotjar’s Hero team is on the hunt for a&nbsp;<strong>support champion</strong>&nbsp;to join us in providing world class technical help and assistance to the growing user base of our SaaS product. We take support seriously, and our Hero team is dedicated to going above and beyond for our users day in and day out. Support is not just something we do, it’s who we are!</p><p>As a Hotjar Hero, you will take care of hundreds of Hotjar users every week to ensure they get the reactive support they need to be successful using our product. You’ll also be dedicated to delivering top notch self-service, as we invest a lot in documentation, content and defining changes to continuously improve the overall customer experience. Due to the technical nature of our product, you should have a good understanding of web development. This includes being able to debug HTML, CSS and JavaScript in web browser based developer tools.</p><h2><strong>As a Hotjar Hero, you will also:</strong></h2><ul><li>Be on the front line interacting with our customers through Zendesk.</li><li>Consistently deliver world class support with empathy and understanding.</li><li>Accurately identify, analyze, and resolve technical and non-technical issues in a timely manner.</li><li>Thrive on problem solving – with a huge range of customers using a complex product, it’s a crucial part of the job.</li><li>Update the pipeline of user suggestions and feedback to improve Hotjar.</li><li>Write and develop documentation for internal and external knowledge bases.</li><li>Regularly interact with other departments including Product, Legal, Marketing and Customer Success.</li><li>Occasionally take part in demonstrations or webinars with our users.</li><li>Represent the support team at a company level during weekly team meetings.</li><li>Own projects related to improving our support, processes, and self-service.</li></ul><h2><strong>Compensation Range</strong></h2><p>The budgeted compensation range for this role is $44,000 to $60,000 annually. Ranges are based on market research and are equitable to other roles within Hotjar. The actual compensation offered to a successful candidate will be based on relative experience and skills. At this time we are only able to provide official employment status to those located in Malta. All other candidates will join our team as full-time consultants and will be responsible for paying any taxes or applicable fees where they reside.</p><h2><strong>Requirements</strong></h2><ul><li>2+ years experience working in technical support roles and teams. Rather than seeing Support as an entry level role, we place a high value on the team who are on the front-line of ensuring our users’ success.</li><li>Fluency in English, with flawless writing skills. If you also speak other languages, tell us! Portuguese, German, French, Spanish and Japanese will be considered assets.</li><li>Previous experience wrangling HTML &amp; CSS (JavaScript is a plus), like putting together websites and using web based developer tools to locate bugs.</li><li>Naturally empathetic and able to communicate in a way that empowers, never belittles.</li><li>Sensitive to varied customer personalities and levels of technical experience.</li><li>Ability to work independently and within a team towards both personal and shared work goals.</li><li>Comfortable taking initiative and making decisions independent of others.</li><li>Flexible and adaptable in a fast workplace environment (remote experience is a plus!).</li><li>Desire to work in a caring, transparent, and giving work environment, in line with Hotjar’s&nbsp;<a href='https://hotjar.atlassian.net/wiki/spaces/REC/pages/269942884/Hotjar+Core+Values' rel='nofollow'>company values</a>,&nbsp;<a href='https://careers.hotjar.com/' rel='nofollow'>culture</a>&nbsp;and&nbsp;<a href='https://hotjar.atlassian.net/wiki/spaces/REC/pages/269779142/Working+at+Hotjar' rel='nofollow'>ways of working</a>.</li><li>Must submit to a background check confidentially processed by our third party.</li></ul><p></p><div> <a href='https://careers.hotjar.com/o/support-hero-americas/c/new' rel='nofollow'>Apply for job</a></div></div>"
  },
  {
    "id": "niEBUpZ3Toa8SuDStSkThg",
    "url": "https://remoteok.io/jobs/68525",
    "title": "Customer Support Team Manager - Bilingual (French/English)",
    "tags": [
      "DBG:surround``2N( OR(employe,develop,engin,team,workmat), spread, OR(out,across) )",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Wave",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 17, 2018 10:50:08 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<td><span><h2>Customer Support Team Manager - Bilingual (french/english)</h2></span><br><span><h3>Wave</h3></span> <span>verified</span></td><div><div>**Our Mission**<br><br>In 2017, one billion immigrants worldwide sent over $600 billion home to family and friends, dwarfing foreign governmental aid. In the age of cheap, quick transfers through services like Paypal and Venmo, these people are trekking to stores to pay fees averaging over 7% for transfers that typically take 24 hours or more. <br><br>Wave's mission is to change that by making sending money anywhere in the world easy and affordable. Since 2014, our app has allowed Africans in the US, the UK, and Canada to send money instantly to mobile money wallets in Kenya, Uganda, &amp; Tanzania, saving our users over 70% relative to Western Union and MoneyGram. <br><br>We recently launched remittances to Ghana, where we're growing quickly, and are looking to rapidly expand throughout Africa in the next year. That's where you come in... <br><br>**How you'll help us achieve it**<br><br>“You should take extraordinary measures not just to acquire users, but also to make them happy” - Paul Graham <br><br>Delighting our users is a core value at Wave. Excellent customer support is essential to this, but difficult to scale. We're looking for someone with experience running and scaling a customer service team so that we continue to wow our users as we expand to new markets.<br><br>**Our company**<br><br>* We are a distributed group of six engineers and twelve operations team members spread across three continents who are deeply passionate about our mission. <br>* Each quarter, we go on a five-day retreat together. In 2018, we've been to Vancouver, Lisbon and Austin. <br>* We play in bands, teach dance classes, run Vipassana retreats, played semi-pro basketball, and built tools to help Doctors' Without Borders respond to the Ebola crisis. <br>* We’re backed by top Silicon Valley venture capital firms and investors.<br><br><br><h2>Responsibilities</h2>**You might be a good fit if *** You have a high-level of proficiency in both English and French.* You've had experience leading and scaling customer service teams.* You feed off interacting with people and getting the best out of them.* You possess an analytical mind and enjoy looking at data to both track trends and develop your team.* You're passionate about Wave's mission, and excited to do what needs to be done to reach our customer experience goals.<h2>Requirements</h2>If interested, please email your resume to Wave's Head of Growth, Taryn McKenzie-Mohr, at taryn@wave.com. Applications will be assessed on a rolling basis.Please note we will only be able to respond to candidates with whom we want to move forward in the interview process.Wave is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.<p><strong>Location:</strong> You can be based anywhere in, or between, CST and GMT+2 timezones.</p><p>See more jobs at <span>Wave</span></p></div></div>"
  },
  {
    "id": "LFsy5vjSTqyHhtBO-7yXlA",
    "url": "http://workinstartups.com/job-board/job/71840/customer-care-champion-at-cornerstone/",
    "title": "Customer Care Champion",
    "tags": [
      "DBG:surround``OR(home,remot,telecommut) 3W OR(meet, face, person)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH1/go",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "go"
    ],
    "hiringOrganization": {
      "name": "Cornerstone",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "£",
      "minValue": 23000,
      "maxValue": 24000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 17, 2018 12:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "*Hello, we’re Cornerstone*<br />We sell our own high-quality range of grooming, wellbeing and dental products on a flexible, regular subscription at cornerstone.co.uk. Having started from our founder’s kitchen table with a £5,000 loan, we now have 170,000 subscribers around the UK and a team of 30 in our London HQ. <br /><br />*What we’re looking for*<br />Customer care is the at the heart of what we do and we’re looking for someone who will go out of their way to delight our members. <br /><br />*What you’ll be doing* <br />* You will be handling our members’ queries over email, live chat and social media.<br />* You will be the voice of our members, representing their needs to the rest of the business.<br />* You’ll be spotting patterns and trends in the queries we receive.<br />* You will be communicating these with examples and context to other teams in the business. <br />* Our Champions share the responsibility for prioritising the workflow of the whole care team, so you will have to give directions and assign tasks to fellow team members.<br /><br />*A bit more about you*<br />* You get a genuine kick out of helping people.<br />* You have impeccable written English - we really care about grammar and hitting the right tone.<br />* You go the extra mile and want to make each and every interaction with a customer count.<br />* You’re positive, calm and composed under pressure.<br />* You’re able to step back from your day-to-day tasks to see the bigger picture.<br />* You’re able to receive and give constructive feedback.<br />* You’re willing to cover some weekend shifts.<br />* Ideally you have experience of delivering customer care over email and chat (not essential). <br />* Ideally you have experience of working in a fast growth environment (not essential).<br /><br />*Interview process*<br />* Application with your CV and a brief email introducing yourself and your relevant experience.<br />* Phone interview.<br />* A short task to complete from home.<br />* Face-to-face interview with members of the Customer Care team.<br />* Face-to-face interview with our founder Ollie.<br /><br />*On inclusivity*<br />We’re building a working environment and recruitment process that is open to all sections of society. We’re committed to providing equal opportunities for employment regardless of race, religion or belief, ethnic origin, disability, family structure, socio-economic status, age, marital, domestic or civil partnership status, sexual orientation, gender identity or any other basis (it's the law, but it also matters to us). <br /><br />If you have a disability, caring duties, or any other additional need that require considerations, accommodation or adjustments to our role or recruitment process, please do let us know. And if you have suggestions on how we could improve, we’d really like to hear from you.<br /><br />*What we’re offering* <br />* £23,000 to £24,000 plus a quarterly bonus<br />* Company pension<br />* Flexible working<br />* 25 days of holiday plus Bank Holidays<br />* 1 paid day per year to volunteer with a charity of your choice<br />* Personal learning and development budget of £300 per year<br />* A great office in London Bridge/ Borough, filled with snacks and drinks<br />* Shower and a Cycle to Work scheme<br />* Regular team lunches and fun nights out<br />* Apple laptop<br /><br />*Please note that we will not consider applications without a brief cover letter – we wouldn’t want you to miss out, so do make sure to include a few lines to be considered.*"
  },
  {
    "id": "4NnaJn6jTM6mWFOnPV6Xew",
    "url": "http://workinstartups.com/job-board/job/72057/tier-2-support-engineer-invision-at-invision/",
    "title": "Tier 2 Support Engineer, InVision",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG_TECH1:k/t/w:backbone.js/frontend/16",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=17}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "InVision",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 16, 2018 9:49:10 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "InVision is the Digital Product Design platform used to make the world’s best customer experiences. We provide design tools and educational resources for teams to navigate  every stage of the product design process, from ideation to development.   <br /><br />Today, more than 4 million people use InVision to create a repeatable and streamlined design workflow; rapidly design and prototype products before writing code, and collaborate across their entire organization. That includes more than 80 percent of the Fortune 100, and organizations like Airbnb, Amazon, HBO, Netflix, Nike, Slack, Starbucks and Uber, who are now able to design better products, faster.<br /><br />InVision is a fully distributed company with employees in 25 countries around the world. The company has raised more than $235 million in funding from leading investors including Accel, ICONIQ, FirstMark, Tiger Global, Battery Ventures, and Spark Capital. Visit us at InVisionApp.com and InVisionApp.com/blog.<br /><br />We're looking for a Tier 2, Support Engineer to act as the technical backbone of InVision's Support team.<br /><br />*ABOUT YOU*<br /><br />REQUIRED<br /><br />*You possess excellent written and verbal communication skills.<br />*You're a natural-born evangelist with infectious enthusiasm.<br />*You genuinely relish troubleshooting and problem-solving complex puzzles.<br />*Experience serving as quality assurance for escalated customer requests and bugs.<br />*You have prior knowledge of design practices (UI, UX, research, testing).<br />*You’ve demonstrated technical support experience, preferably in a SaaS B2B setting.<br />*Ability to think on one’s feet, learn a complex product inside and out, and discover creative methods to resolve customer issues.<br />*Demonstrable experience troubleshooting and documenting replication steps for complex technical issues, while collaborating with engineering to ensure resolution.<br />*Experience supporting, troubleshooting, and assisting with development of desktop applications and web application integrations leveraging API; e.g. REST, SOAP, etc.<br />Familiarity with modern ticketing, customer engagement, and CMS solutions within customer service environments (Zendesk, Desk.com, Help Scout).<br /><br />BONUS POINTS<br /><br />*Expert knowledge of the design tools: Adobe Photoshop, Adobe Illustrator, Sketch.<br />*Versed in agile development methodologies and its best practices.<br />*Previous InVision experience and familiarity strongly preferred.<br />*GitHub experience preferred.<br /><br />*YOUR RESPONSIBILITIES*<br /><br />*Directly respond to and engage qualified customer inquiries and requests.<br />*Compare, analyze, and escalate user requests to Product & Engineering teams.<br />*Directly engage and collaborate with Engineering teams to quickly resolve customer issues or reported bugs.<br />*Act as quality assurance for escalations and technical backbone and resource for Customer Support teams.<br />*Develop, author, and maintain internal and customer-facing technical documentation.<br />*Compile, prioritize, and report feature requests for product direction and implementation.<br />*Share industry best practices on web/mobile design tools with clients.<br /><br />*Benefits & Perks*<br /><br />InVision offers an incredibly unique work environment. The company employs a diverse team all over the world. In the United States we have team members throughout 40+ states including New York, San Francisco, Austin, Portland, and Boston. Each InVision team member is given the freedom and tools to do their best work from wherever they choose. The benefits we offer in the United States include competitive health plans and a 401k plan.<br /><br />Some InVision-wide benefits offered to all employees across the globe include a flexible vacation policy, monthly coffee shop stipends, annual allowances for books related to your profession, and home office setup & wellness reimbursements. InVision is an international employer so some benefit offerings will vary from country to country. Please ask our recruiting team about the benefits and perks package available in your country."
  },
  {
    "id": "ZLq4lwcoRJqAmMCSaSkYWg",
    "url": "https://www.workingnomads.co/jobs/wordpress-customer-support-niteo",
    "title": "WordPress Customer Support",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot W OR(career,first)",
      "DBG_TECH1:k/t/w:woocommerce/php/8",
      "DBG_TECH1:k/t/w:wordpress/php/15",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=23, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Niteo",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 15, 2018 11:01:21 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<p>Hi, I'm Dejan, the project lead at&nbsp;<a href='https://niteo.co/' rel='nofollow'>Niteo</a>, a remote-first SaaS company with&nbsp;<a href='https://workable.com/nr?l=https%3A%2F%2Fniteo.co%2Fteam' rel='nofollow'>team members</a>&nbsp;from Slovenia, Romania, Ukraine, India, and the Philippines. We live and breathe Open Source: you can read about how we work in our&nbsp;<a href='https://github.com/niteoweb/handbook' rel='nofollow'>public Handbook</a>&nbsp;and on&nbsp;<a href='https://blog.niteo.co/' rel='nofollow'>our blog</a>.</p><p>Our current main project is a fully automated WordPress hosting platform for SEOs. Our upcoming project is a “WooCommerce-as-a-Service” and our goal is to make WooCommerce as approachable as Shopify.</p><p>And that's where you come in!</p><p>We're looking for someone who knows WordPress really well, is patient, knows how to follow instructions, and has good attention to detail so the customer questions get replied accurately.&nbsp;</p><p>It is our belief that the ratio of women and/or people of color in tech teams should be higher. We believe diversity has its challenges, but the benefits far outweigh them. We strongly encourage people from underrepresented groups to apply for this position.</p>"
  },
  {
    "id": "kkKM8NzuTpuG9TvvAr_RIg",
    "url": "https://www.workingnomads.co/jobs/client-engagement-specialist-asia-pacific-kraken",
    "title": "Client Engagement Specialist - Asia Pacific",
    "tags": [
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Kraken",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 14, 2018 10:15:00 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<p>By joining Kraken, you’ll work on the bleeding edge of bitcoin and other digital currencies, and play an important role in helping shape the future of how the world sees and uses money. At Kraken, we constantly push ourselves to think differently and forge new paths in a rapidly growing industry fraught with unexplored territory, which is why Kraken has grown to be among the largest and most successful bitcoin exchanges in the world. If you’re truly interested in pushing the envelope by disrupting an industry that some say cannot be disrupted, then we just might have the job meant for you.</p><p>We’re hiring for our Client Engagement team, which provides customer support to our users and also handles most aspects of payments operations. Our team is one of the best in the industry, and we’re looking for people who can make us better.</p><p>Many of us work remotely, but we’re in touch with each other constantly. We collaborate to solve tough problems and meet regularly to stay up to date on what’s going on in the company and industry. We have a great community-feel, and many of us have become close friends.</p><p>Responsibilities</p><ul><li>Respond to 20 to 150 client requests by email regarding trading (explaining margin, answering questions about order execution), digital asset transfers (looking at block explorers, answering questions about bitcoin transactions), and other general questions on daily basis</li><li>Strive to make your team’s work as efficient as possible by improving or creating processes, automating as much of your work as possible, and so on</li></ul><p>Requirements</p><ul><li>Strong written English communication skills (other languages are helpful)</li><li>Crypto trading experience, preferably on multiple platforms</li><li>High output -- metrics-based experience is helpful</li><li>Able to make quick decisions autonomously</li><li>Security and privacy focused</li><li>Detail oriented</li><li>Loves helping people</li><li>Technical background a major plus</li><li>Experience with Kraken’s API a major plus</li></ul>"
  },
  {
    "id": "nD_40mRGSECk3Eb1TlmXvA",
    "url": "https://www.workingnomads.co/jobs/client-engagement-specialist-europe-kraken",
    "title": "Client Engagement Specialist - Europe",
    "tags": [
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Kraken",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 14, 2018 10:11:05 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<p>By joining Kraken, you’ll work on the bleeding edge of bitcoin and other digital currencies, and play an important role in helping shape the future of how the world sees and uses money. At Kraken, we constantly push ourselves to think differently and forge new paths in a rapidly growing industry fraught with unexplored territory, which is why Kraken has grown to be among the largest and most successful bitcoin exchanges in the world. If you’re truly interested in pushing the envelope by disrupting an industry that some say cannot be disrupted, then we just might have the job meant for you.</p><p>We’re hiring for our Client Engagement team, which provides customer support to our users and also handles most aspects of payments operations. Our team is one of the best in the industry, and we’re looking for people who can make us better.</p><p>Many of us work remotely, but we’re in touch with each other constantly. We collaborate to solve tough problems and meet regularly to stay up to date on what’s going on in the company and industry. We have a great community-feel, and many of us have become close friends.</p><p>*** Must be willing to work evenings and weekends ***</p><p>Responsibilities</p><ul><li>Respond to 20 to 150 client requests by email regarding trading (explaining margin, answering questions about order execution), digital asset transfers (looking at block explorers, answering questions about bitcoin transactions), and other general questions on daily basis</li><li>Strive to make your team’s work as efficient as possible by improving or creating processes, automating as much of your work as possible, and so on</li></ul><p>Requirements</p><ul><li>Strong written English communication skills (other languages are helpful)</li><li>Crypto trading experience, preferably on multiple platforms</li><li>High output -- metrics-based experience is helpful</li><li>Able to make quick decisions autonomously</li><li>Security and privacy focused</li><li>Detail oriented</li><li>Loves helping people</li><li>Technical background a major plus</li><li>Experience with Kraken’s API a major plus</li></ul>"
  },
  {
    "id": "cFowWpPTTEih2a2QG_c2cQ",
    "url": "https://angel.co/consensys/jobs/376369-customer-success-manager",
    "title": "Customer Success Manager",
    "tags": [
      "Boston",
      "Customer Service",
      "Customer Success",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "REMOTE1/100",
      "Remote",
      "Remote OK",
      "Romania",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "ConsenSys",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=585912&listings[0][]=58885"
    },
    "salary": {
      "currency": "$",
      "minValue": 70000,
      "maxValue": 80000,
      "info": "0.01% – 0.01%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 14, 2018 6:49:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Customer Success Manager at ConsenSys</h2><div>Boston, Romania, Remote, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Customer Service, Customer Success</div><div>Compensation</div><div>$70K–$80K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ConsenSys is a venture production studio and the leading technology firm in blockchain globally. We deliver products, solutions and platforms built using blockchain technology to transform how business is done in complex network of buyers, suppliers and consumers.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, the music industry, security, and infrastructure, and more. To accomplish this we've built out a flat organizational structure which we call the ConsenSys Mesh: a network of individuals &amp; teams working autonomously and towards the same goal. If you think of yourself as someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p>About Customer Success at ConsenSys:</p><p>The Customer Success team provides dedicated, tailor made support solutions to emerging ConsenSys ventures. Being a newly formed function within ConsenSys, the Customer Success Lead will be a prominent resource in defining the Customer Experience Strategy.</p><p>About the role:</p><p>The Customer Success Manager will be responsible for ensuring Ethereum &amp; Consensys’s customer satisfaction, realized value and longevity. High levels of customer satisfaction and realized return on investment will lead to strong customer advocacy, renewal rates and growth through expansion. The Customer Success Manager will be our customer's ambassador working closely with Sales, Support, Product, Marketing and Field Engineering to ensure optimal customer experience. Key measures will be Net Promoter Scores/Customer Satisfaction, Customer Churn and Upsell/Cross Sell on our renewals. </p><p>Responsibilities:</p><p>Define the stages and key measures for optimal customer success<br>Promote customer satisfaction and loyalty by demonstrating an understanding of their critical business issues and needs while delivering products and services that help them meet their business objectives<br>Build and maintain strong relationships within key accounts<br>Design and facilitate customer campaigns  that keep customers apprised of Ethereum &amp; Consensys’s recent developments as well as continuous reporting on customer engagement<br>Educate customers on the use and benefits of Ethereum &amp; Consensys’s solutions<br>Work closely with Our Support and Field Services teams to ensure a consistently positive customer experience by providing escalation and management for issues and initiatives.<br>Serve as a customer advocate while capturing customer's feedback (VOC) and reporting requests to Product Management and Engineering<br>Prepare, schedule, and conduct account reviews; maintain accurate record of discussions and action items<br>Efficiently manage time to focus on essential activities to ensure customer satisfaction, account renewal, and account growth.<br>Proactively monitor and identify opportunities to optimize current pricing and packaging<br>Coach CSM team members as needed to ensure strategic renewal success and quarterly renewal rate achievement.</p><p>Requirements:</p><p>BA/BS degree required<br>Nimble thinker<br>Minimum of 5 years customer facing role<br>Experience building and executing strategic plans<br>Strong analytical and organizational skills<br>Quota carrying sales or renewal role<br>Experience working with cross-functional sales teams<br>Able to work in dynamic startup environment under constant change<br>Ability to make quick decisions without involving the whole command chain<br>Experience working with senior and executive management<br>Possess strong written and verbal communication skills<br>Ability to rapidly learn and adapt to new technical products is seen as a key differentiator.<br>Willing to travel up to 40% of the time<br>Familiarity and interest in non-hierarchical decision-making and decentralized systems (beneficial)</p></div>"
  },
  {
    "id": "kxlEXcCoRoyJiwn0lyFfzw",
    "url": "https://remoteok.io/jobs/68386",
    "title": "Customer Support Specialist",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(europ, european, europeanunion)",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG:surround``remot 4W OR(skype, slack)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/support",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Loom",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 7, 2018 4:21:24 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<td><span><h2>Customer Support Specialist</h2></span><br><span><h3>Loom</h3></span></td><div><div>## Who We Are<br>Loom is a new kind of work communication tool that helps people get their messages across through instantly shareable videos. With Loom, you can capture your screen, record your front-facing camera, and narrate your video all at once — no switching apps or upload required. Whether it’s training new teammates or replying to a customer inquiry, Loom enhances the way people communicate at work by allowing them to send the next best thing to being there. Loom is a horizontal tool and has unique challenges within the work communication landscape:<br>**Loom is for colleagues and customers.** Loom is a tool that anyone at work can benefit from, so we make product decisions with all types of people in mind. We build our product so that it remains clear, intuitive, and inclusive of all of our users' needs.<br>**Loom is video recording, simplified**. Video is known to be more effective than text, yet so many video products make recording an intimidating and confusing experience. We constantly strive to make recording videos an accessible and effortless experience.<br>**Loom provides a human touch**. How do we build out an online communication platform that still feels personal? Loom allows people to bring their authentic selves to asynchronous communication. As we grow, we design for people to continue to bring every aspect of their bright, expressive, human selves with our product.<br>## The Role<br>Our Customer Support &amp; Success team loves architecting people's path of discovering, using, and sharing with Loom. We go above and beyond to provide the knowledge needed every step of the way.<br>As a Customer Support Specialist, you’ll be the hero in our front lines assisting hundreds of Loom customers every week. Your main responsibility will be to deliver a fast, personal, and respectful support experience. You will also play a critical role in anticipating where our customers are having issues so our Engineering team can act fast.<br>We are looking for support champions who are genuinely happy to help others. If this sounds like you, you came to the right place! <br>### As a Customer Support Specialist, your responsibilities include...<br>* Helping customers through live chat, email and social media to ensure they are successful with our tool<br>* Troubleshooting, investigating, and creating detailed bug reports for our Engineering team<br>* Contributing to our culture of &quot;user delight&quot; by sharing examples of user interactions with the rest of team<br>* Correctly identifying and reporting on support requests so the Product team can plan future product iterations<br>* Auditing and updating any support resources as the product changes (Help Center, Saved Replies, etc...)<br>* Helping write and maintain documentation for internal knowledge base<br>* Assisting with projects related to improving our support at scale processes <br>### You could be a good fit if you...<br>* Have previous experience delivering a superior support experience with respect, empathy and understanding<br>* Know how to to work under pressure and adapt to a fast-paced environment<br>* Have excellent written and spoken English<br>* Have the ability to pick up new technology quickly<br>* Have the technical understanding and ability to troubleshoot and resolve technical problems on your own<br>* Are available for a full time schedule that spans weekends and may include holidays as our customers need us (working hours may include evening or early morning hours depending on your location)<br>### Bonus Points <br>* Active and passionate Loom user<br>* Previous experience working remotely<br>* Familiarity with Intercom, Slack and Notion - you'll be living in these tools<br>* Previous experience working in SaaS<br>## The Good Stuff<br>* Work with a driven, welcoming team at a company that is changing how people communicate every single day.<br>* Yearly retreat with the team (last year we went to Mexico! )<br>* Unlimited PTO<br>* Shiny new Apple computer &amp; budget for home office equipment<br>**Please note:** This is a remote role. You can be located anywhere in the world, but note that we are looking for someone who can support our growing customer base mainly during European business hours, and who is available for a full time schedule that spans weekends and may include holidays.<br>Loom is an equal opportunity employer. We are actively seeking to create a diverse work environment because teams are stronger with different perspectives and experiences.<br>We value a diverse workplace and encourage women, people of color, LGBTQIA individuals, people with disabilities, members of ethnic minorities, foreign-born residents, older members of society, and others from minority groups and diverse backgrounds to apply. We do not discriminate on the basis of race, gender, religion, color, national origin, sexual orientation, age, marital status, veteran status, or disability status. All employees and contractors of Loom are responsible for maintaining a work culture free from discrimination and harassment by treating others with kindness and respect.<h2>Requirements</h2>Please apply via the link. <p>See more jobs at <span>Loom</span></p><p>Visit <a href='http://www.useloom.com' rel='nofollow'>Loom</a>'s website</p></div></div>"
  },
  {
    "id": "ziChchgqSMGq66aexdrZVQ",
    "url": "http://workinstartups.com/job-board/job/71699/customer-support-advisor-night-shift-at-gocardless/",
    "title": "Customer Support Advisor - Night shift",
    "tags": [
      "DBG:surround``12N(work, OR(home,remot), 5N(OR(offic,headquart,onsit), OR(dai,daili,week,weekli,month,monthli)) )",
      "DBG:surround``from 4W your 2W home",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "GoCardless",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 6, 2018 4:47:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "*Go the extra mile to delight our customers.*<br /><br />GoCardless is growing fast. We’ve built a world-class product that opens up Direct Debit to small and medium-sized businesses across the UK, Europe and now Australia! We have recently extended our offering to multinational companies like the Guardian, TripAdvisor and Box. Thousands of businesses already rely on us to handle their payments, and hundreds more join us every week.<br /><br />We're looking for bright, empathic people to join our night team and provide first-rate support and guidance to our Australian and UK users.<br /><br />*The role*<br /><br />We pride ourselves on listening to our users and doing everything we can to solve their problems, from sending an email to getting a new feature added to our product roadmap.<br /><br />You’ll be working remotely handling emails from our merchants and from customers using GoCardless to pay, utilising our in-house systems to help ensure that you can deliver the best support experience possible.<br /><br />You’ll learn the complexities of our product and how to distill this into clear, useful answers. Over time, you will become an expert in the multiple ways in which our merchants use GoCardless, from the API to partner integrations, so that you can solve every problem that comes your way.<br /><br />You'll listen to our users, help them with their problems and ensure they know how to get the most out of our product. You'll make sure our emails are always accurate and helpful, and use your knowledge to anticipate any potential for further issues and address them early on.<br /><br />As a member of our Support team, you'll represent the customer's voice across the company. As your knowledge and experience grows, you’ll have opportunities to help inform our product roadmap to ensure we are always building something people want.<br /><br />You'll work as part of a wider team of 10 who work with our UK and European merchants to solve tough problems and provide legendary service. We also run regular internal training sessions to ensure the whole team understand the complexities of the product and the implications of any new features.<br /><br />We've built a friendly, collaborative culture, where we hire and develop driven people that share our desire to do work we can be proud of. We value learning and feedback, and are devoted to encouraging and supporting each other's continual professional growth. Once you’ve built the core foundations of knowledge required to succeed in your support role here at GoCardless, there will be scope for you to develop a specialism and take on more responsibility as our team continues to grow.<br /><br />*Want the comfort of working from your own home?*<br /><br />After the first few weeks of onsite training at our HQ in London this role will then be remote based. We are looking for people who are available to work from the hours of Midnight - 9am. <br /><br />The ideal candidate:<br /><br />* you love helping people<br />* you're organised, diligent and attentive to detail<br />* you learn quickly and are comfortable with complexity<br />* you thrive in small teams<br />* you have a flawless command of English and communicate with clarity<br />* Our team comes from a variety of backgrounds and we embrace diversity – if you have an additional language, even better!<br />* This role would suit someone who is passionate about the client-facing experience operating within a fast-paced tech company, and has the drive to go above and beyond to ensure the service we provide is always second to none.<br /><br />We welcome a wide diversity of applicants, and our team are from a variety of backgrounds, so if you’re unsure please apply."
  },
  {
    "id": "JdbFIB-tRT6hivH3Xs2AeQ",
    "url": "https://remoteok.io/jobs/68281",
    "title": "Customer Support Specialist",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:lamp/php/13",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:woocommerce/php/24",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=47, embedded=0, frontend=4}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Skyverge",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 31, 2018 12:55:14 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<td><span><h2>Customer Support Specialist</h2></span><br><span><h3>Skyverge</h3></span> <span>verified</span></td><div><div>SkyVerge is looking for a talented Customer Support Specialist to join our fully-distributed team and help support our entire suite of products.<br><br>**The Role**<br><br>You’ll be the first point of contact for our customers, helping them with problems, and answering questions. As part of a small team, you'll likely get your hands dirty with a little bit of everything.<br><br>**Here are some things you may do on a given day:**<br><br>-Assist customers by troubleshooting technical problems and escalating to the engineering team as needed<br><br>-Answer pre-sales questions and other feedback from customers<br><br>-Document and optimize our support process to improve customer satisfaction<br><br>-Write technical documentation and other content so customers can help themselves<br><br>-Help our engineering &amp; product teams to identify areas where we can improve the customer experience<br><br>-Monitor social media and forums where customers may have questions or issues with our products and get them the help they need<br><br>With over 70 products that we support, there's plenty to learn. We’re aiming for you to have broad knowledge (mile-wide, inch-deep) and work closely with the product &amp; engineering team to tackle more technical or in-depth questions that go beyond your knowledge.<br><br>**On the first day you will:**<br><br>-Onboard and get to know your new team members<br><br>-Pair with a customer support specialist for training, and answer some customer questions together<br><br>-Have a complete WooCommerce setup with major plugins installed<br><br>-Read and review support guide<br><br>**In the first week you will:**<br><br>-Answer customer questions (draft, review from team member or manager, send)<br><br>-Dive into learning WooCommerce and our major extensions (Memberships, for example)<br><br>-Fix at least one documentation issue<br><br>**In the first month you will:**<br><br>-Own your own queue<br><br>-Answer customer questions with minimal review<br><br>-Contribute to documentation as necessary<br><br>**You**<br><br>You have that unique combination of technical aptitude and empathy for the user. You’re comfortable with code but prefer to be customer-facing. You’re self-driven with a sense of urgency and draw satisfaction from going above and beyond to provide solutions. You’re an excellent communicator and have the ability to thrive in a distributed environment. Perhaps most importantly, you have a willingness to learn.<br><br>**To succeed in this position, you must have:**<br><br>-A solid understanding of HTML / CSS<br><br>-A working knowledge of JavaScript<br><br>-Native-level fluency in English (Are you fluent in other languages? Tell us! We love being able to support customers in their native language.)<br><br>-Outstanding written communication and interpersonal skills<br><br>-Boundless curiosity for our products and our customers<br><br>-Ability to thrive in a remote environment (along with a reliable internet connection)<br><br>**It’s helpful if you have:**<br><br>-Experience with PHP / Ruby (or other programming languages)<br><br>-Experience with WordPress<br><br>-Experience with WooCommerce (or other eCommerce platforms)<br><br>-Experience supporting SaaS products<br><br>-Experience supporting downloadable software (especially in the LAMP stack)<br><br>**The Team**<br><br>Our team is fully-remote and we communicate primarily through Slack, GitHub, Help Scout, Intercom, and weekly stand-ups via Zoom (a few short meetings) — we believe the best work happens when given lots of uninterrupted time that’s free of distractions.<br><br>As a remote team, we believe that regular meet-ups are invaluable for getting to know each other better, so you should be available for 1-2 company-paid team trips per year. Curious about these trips? Check out our recap of our last team retreat ([SkyTrip!](https://www.skyverge.com/blog/skytrip-2018-recap/)) to get an idea of what they’re like.<br><br>This is a full-time, salaried position, but hours are flexible. We know your work will speak for itself with thoughtful replies to customers, wiki edits, and published documentation.<br><br>**Process**<br><br>After an initial screening, you’ll get an email with a few questions to answer. Following that, you’ll have a few 30 minute phone chats with different people on our team to learn more about you and answer any questions you have about the position and company.<br><br>If this goes well, we’ll invite you to join our team and start your paid 4 week trial period. During this period you’ll work full-time as a contractor, or part-time on nights/weekends if you already have a full-time position. This gives you an opportunity to make sure you enjoy the work and the team, and it gives us an opportunity to evaluate your work. We’ll have regular chats each week to share feedback and make sure we’re on the same page. At the end of the trial, you’ll be offered a permanent position <br><br>**Benefits**<br><br>Here are some benefits we're happy to offer to our team members:<br><br>-Competitive salary<br><br>-Annual incentive for meeting team and company goals<br><br>-27 days of paid time-off, in addition to 2 company holidays (SkyVerge Day in March, Founders Day in June )<br><br>-Medical, Dental, and Vision insurance for US and Canadian residents and their families (reimbursements for comparable care for non-US/Canadian residents)<br><br>-401k/RRSP Retirement plan with 4% company match for US/Canadian residents (contributions to comparable plans for non-US/Canadian residents)<br><br>-Work flexible hours from anywhere that has a reliable internet connection<br><br>-Tools (hardware/software) to help you be productive<br><br>-Allowance for professional growth (books, courses, conferences)<br><br>-Home office or co-working allowance<br><br>-A Kindle to help you keep learning<br><br>*We support workplace diversity and do not discriminate on any protected class. We believe when we work together as a team of different views, experiences, and ideas, we can build amazing things.*<h2>Requirements</h2>Please apply directly through the link below. Applications accepted through August 15th.<p>See more jobs at <span>Skyverge</span></p><p>Visit <a href='https://www.skyverge.com/' rel='nofollow'>Skyverge</a>'s website</p></div></div>"
  },
  {
    "id": "o9WXnj0yQKm1v4SRXBgmxQ",
    "url": "http://workinstartups.com/job-board/job/71438/technical-sales-representative-at-aurity/",
    "title": "Technical Sales Representative",
    "tags": [
      "DBG:surround``5N( cultur, 2N(remot, OR(work,worker)) )",
      "DBG_TECH1:k/t/w:boost/c/8",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=8, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=16}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Aurity",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 27, 2018 4:47:39 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "DESCRIPTION<br /><br />We are Aurity, a cutting-edge team with a great passion for development, always looking for new solutions and the best technology. We work with clients from all around the world who have projects that keep us motivated and help us to learn and constantly grow. We support huge startups similar to Uber and Monzo in developing web, mobile apps and backends.<br /><br />If you’re looking for a new role, which includes Direct Sales, Account Management and Lead Generation whilst being rewarded well for your efforts then this one could be for you! We have been extremely successful in providing solid solutions to our clients and pairing them with the best developers.<br /><br />We’re looking for a results-driven sales representative to actively seek out and engage customer prospects. You will provide complete and appropriate solutions for every customer in order to boost top-line revenue growth, customer acquisition levels and profitability. You will be required to ;<br /><br />Seek out new leads, providing us with solid clients who require the assistance of developers.<br />Present, promote and sell technical products/services using solid arguments to existing and prospective customers<br />Perform cost-benefit and needs analysis of existing/potential customers to meet their needs<br />Establish, develop and maintain positive business and customer relationships<br />Reach out to customer leads through conferences, meetups, cold calling and emailing.<br />Take part in sales and strategic account management on projects ranging from £50k - £500k, to accelerate the company’s growth<br />Achieve agreed upon sales targets and outcomes within schedule<br />Coordinate sales effort with team members and other departments<br />Analyse the territory/market’s potential, track sales and status reports<br />Supply management with reports on customer needs, problems, interests, competitive activities, and potential for new products and services.<br />Keep abreast of best practices, promotional trends and technology<br />Generating and following up new leads, sales and ensuring customer loyalty through excellent account management.<br />Following up new business opportunities and setting up meetings, planning and preparing presentations/proposals<br />Maintains internal CRM and meets minimum data standards<br />REQUIREMENTS<br /><br />You are a former entrepreneur, consultant, software agency project manager or business developer.<br />Passionate about the value add of technology to the business world<br />Have knowledge of React, React Native, Node, Elixir and other cutting-edge technologies.<br />You live in the territory of Western Europe or the United States<br />Available to travel to meet new clients and attend conferences<br />Familiarity with BRM and CRM practices along with ability to build productive business professional relationships<br />Highly motivated and target driven with a proven track record in sales preferably with projects above £50k<br />Excellent selling, communication and negotiation skills<br />Prioritizing, time management and organizational skills<br />BS/BA degree or equivalent<br />Ability to do market research and acquire knowledge and understanding of market Organisations and planning skills<br />Negotiating and influencing skills<br />8 years’ solid experience in B2B selling experience, ideally in the technology sector<br />You are a driven sales person, comfortable with selling in person, over the phone or email. Willing and ready to pick up a completely cold desk and turn clients in to tangible, high- returning partners.<br />BENEFITS<br /><br />A great opportunity for professional development within a innovative and fast growing company.<br />One month #hackerhouse that we arrange every 6-8 months at various tropical destinations.You can join the team there, have some fun and work! We make sure the internet connection is very good. Our next one will be in Bali.<br />The opportunity to work within a dynamic company with a start-up culture.<br />Remote working<br />Get paid for additional education and conferences.<br />For additional benefits take a look at our blog."
  },
  {
    "id": "3CrUCnFaTBiGKbRKpQaeYw",
    "url": "https://unicornhunt.io/jobs/technical-sales-representative-at-aurity-ltd",
    "title": "Technical Sales Representative",
    "tags": [
      "DBG:surround``5N( cultur, 2N(remot, OR(work,worker)) )",
      "DBG_TECH1:k/t/w:boost/c/8",
      "DBG_TECH1:k/t/w:elixir/other/5",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=8, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=16}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Aurity Ltd.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 27, 2018 2:19:18 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<p>We’re looking for a results-driven sales representative to actively seek out and engage customer prospects. You will provide complete and appropriate solutions for every customer in order to boost top-line revenue growth, customer acquisition levels and profitability. You will be required to ;</p><ul><li>Seek out new leads, providing us with solid clients who require the assistance of developers.</li><li>Present, promote and sell technical products/services using solid arguments to existing and prospective customers</li><li>Perform cost-benefit and needs analysis of existing/potential customers to meet their needs</li><li>Establish, develop and maintain positive business and customer relationships</li><li>Reach out to customer leads through conferences, meetups, cold calling and emailing.</li><li>Take part in sales and strategic account management on projects ranging from £50k - £500k, to accelerate the company’s growth</li><li>Achieve agreed upon sales targets and outcomes within schedule</li><li>Coordinate sales effort with team members and other departments</li><li>Analyse the territory/market’s potential, track sales and status reports</li><li>Supply management with reports on customer needs, problems, interests, competitive activities, and potential for new products and services.</li><li>Keep abreast of best practices, promotional trends and technology</li><li>Generating and following up new leads, sales and ensuring customer loyalty through excellent account management.</li><li>Following up new business opportunities and setting up meetings, planning and preparing presentations/proposals</li><li>Maintains internal CRM and meets minimum data standards</li></ul> REQUIREMENTS <ul><li>You are a former entrepreneur, consultant, software agency project manager or business developer.</li><li>Passionate about the value add of technology to the business world</li><li>Have knowledge of React, React Native, Node, Elixir and other cutting-edge technologies. </li><li>You live in the territory of Western Europe or the United States </li><li>Available to travel to meet new clients and attend conferences</li><li>Familiarity with BRM and CRM practices along with ability to build productive business professional relationships</li><li>Highly motivated and target driven with a proven track record in sales preferably with projects above £50k</li><li>Excellent selling, communication and negotiation skills</li><li>Prioritizing, time management and organizational skills</li><li>BS/BA degree or equivalent</li><li>Ability to do market research and acquire knowledge and understanding of market Organisations and planning skills</li><li>Negotiating and influencing skills</li><li>8 years’ solid experience in B2B selling experience, ideally in the technology sector</li><li>You are a driven sales person, comfortable with selling in person, over the phone or email. Willing and ready to pick up a completely cold desk and turn clients in to tangible, high- returning partners.</li></ul> BENEFITS <ul><li>A great opportunity for professional development within a innovative and fast growing company.</li><li>One month #hackerhouse that we arrange every 6-8 months at various tropical destinations.You can join the team there, have some fun and work! We make sure the internet connection is very good. Our next one will be in Bali.</li><li>The opportunity to work within a dynamic company with a start-up culture. </li><li>Remote working</li><li>Get paid for additional education and conferences.</li><li>For additional benefits take a look at our blog.</li></ul>"
  },
  {
    "id": "f4QkO1EnTbqwXNNcU2YNKQ",
    "url": "http://jobs.github.com/positions/bfc8cc8c-9189-11e8-98cb-b047263fa644",
    "title": "Full Time: Support Engineer at Tower in Remote",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(europ, european, europeanunion) 3W OR(timezon,time)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:macos/apple/4",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:windows/dotnet/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=16, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=4, java=0, gamedev=0, php=5, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/support",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 27, 2018 12:43:05 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<p>We're looking for a <strong>support engineer</strong> to help us provide great technical support to our customers around the world. We are a fully <strong>remote team</strong> and are looking for someone based in a European timezone.</p><p><strong>Our product Tower helps over 100,000 users in companies like Apple, Google, Amazon, and Microsoft to easily &amp; productively work with the Git version control system.</strong>&nbsp;</p><p>Providing helpful &amp; qualified <strong>customer support</strong> is an important part of our own aspiration. With Tower being a software development tool, customer questions are mostly technical. Therefore, we're looking for someone with a background in software development to help our customers with their technical questions on Git and version control.You'll work closely with our software engineers and be part of a friendly, open, and reliable team of professionals.</p><h3>Job</h3><ul><li>you'll provide <strong>support to our customers</strong> and prospective customers via our ticketing system (no phone or chat support)</li><li>you accept <strong>accountability</strong> for providing a <strong>fast, high-quality, and helpful support experience</strong> for our customers (and improve our process where possible)</li><li>questions range from simple sales and billing issues to bug reports and <strong>complex technical problems</strong> with Git and web app setups</li><li>you'll <strong>document issues and communicate with our engineering teams</strong> in search for solutions to our customers' problems</li><li>you're happy to help our engineering team with <strong>testing and QA</strong></li><li>you can <strong>deal with our product management saying &quot;no&quot;</strong> to many feature requests and fixes because you understand that, as a small team, our resources are painfully limited</li><li>optional: in case you are proficient with PHP / CSS3 / JS, you might also want to help us develop and maintain our many web projects (the Tower website and blog, our learning platform, the Tower online documentation...)</li></ul><h3>Skills</h3><ul><li>3+ years background in web / software development</li><li>Fluent in English with excellent writing / grammar skills</li><li>Advanced knowledge of Git and version control</li><li>Experience writing bug reports or other technical documents</li><li>Experience on both macOS and Windows</li><li>You love to help people with technical / dev problems</li><li>You are a good and mindful communicator</li></ul><h3>You</h3><ul><li> very reliable &amp; thorough: you accept responsibility for your own work and its quality</li><li>hungry to be part of a team that creates things that matter</li><li>self-motivated and capable of working from home</li><li>open to discussions and a mindful communicator</li><li>willing to be part of a team &amp; yet able to work independently</li><li>paying attention to details</li><li>open-minded and respectful – regarding people, technologies and projects</li><li>happy to become part of a small team of friendly &amp; skilled professionals</li></ul><h3>About Tower &amp; fournova</h3><p>We are a small, fully remote software company based in Germany. Founded in 2010, we set out to make Git’s powerful feature set accessible to developers, designers, and non-technical people.</p><p><strong>Today, our software Tower is the best Git client for Mac and Windows and is used by over 100,000 customers - from startups to Fortune 100 companies.</strong></p><p>We know we can achieve great goals only with the help of our peers. And at fournova, we are blessed to work in a team of extraordinary people. We’re not looking for someone to do the job. We’re looking for someone to join the team.</p><h3>Values at fournova</h3><p>We are a team driven by values. Not the ones that look nice on a poster, but ones that are truly and honestly lived.</p><ul><li><p><strong>TRUST</strong>&nbsp;- We believe our colleagues make good &amp; fair decisions. For example when they take as many vacation days as they need (there's no maximum number of holidays, but a minimum of 24 days). Or when they handle company money responsibly (you can make any purchases without asking for permission). We don't control or micro-manage people.</p></li><li><p><strong>RELIABILITY</strong>&nbsp;- At fournova, you're allowed to make any decision. Even if it's outside of your typical scope of duty. As a consequence, however, you also have to accept responsibility. We rely on our teammates to do their very best work.</p></li><li><p><strong>RESPECT</strong>&nbsp;- We have a deep and sincere respect for each other. Both on a professional and on a personal level. We know we can achieve great goals only with the help of our peers.</p></li><li><p><strong>HUMILITY</strong>&nbsp;- We do what's best for the team. This shows when you're supporting a team decision even if you'd prefer something else. And this shows when making profits: we donate 10% to a good cause every year.</p></li><li><p><strong>HEALTH</strong>&nbsp;- We require everyone to give 100%. But not more than that! Working long hours or weekends is rarely seen at fournova. If you want, you can even choose to work only a 4-day week. We encourage you to pursue a life beyond work!</p></li><li><p><strong>PRAGMATISM</strong>&nbsp;- We concentrate on the tasks that matter. Many things at fournova could be improved. But reality limits our time and energy in a painful way. To get meaningful work done, we need to live with countless little annoyances and concentrate on the things that bring us forward.</p></li><li><p><strong>GROWTH</strong>&nbsp;- All of us have a strong desire to grow. And fournova wants to help you achieve this. On the professional and on the personal, human level.</p></li><li><p><strong>REMOTE WORK</strong>&nbsp;- We are strong believers in freedom &amp; flexibility. Therefore, you can work from wherever you want. In order to keep in touch, however, we meet in person at least once every quarter: for our &quot;General Assemblies&quot; in Frankfurt or Berlin, and for our great team retreats in places like Corsica or Barcelona.</p></li></ul><p>Is this a culture that resonates with you? Can you contribute something to make fournova even better? Yes and yes? Then please get in touch with us!</p>"
  },
  {
    "id": "uBauT5iqSf2Hw0sy_VsSaA",
    "url": "http://workinstartups.com/job-board/job/71396/customer-success-executive-at-sweatcoin/",
    "title": "Customer Success Executive",
    "tags": [
      "DBG:surround``OR(you,we,employe,develop,engin,abl,workmat) 2W work 2W from 2W home",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Sweatcoin",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 26, 2018 11:48:41 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "* Always dreamed of working in tech?<br />* Believe you can use your amazing customer service skills to turn our users into long term advocates and superfans?<br />* Would you like to be able to work from home and choose your own hours?<br /><br />If this sounds like you, we have an exciting opportunity to gain unparalleled experience, working at the fastest growing health and fitness startup and app in history – helping to grow our customer success function.<br /><br />So, If.. <br /><br />1. You’re good at making friends;<br /><br />– Enjoy having a range of conversations with a diverse mix of people (both online and in person)<br />– Love helping people and making people happy<br /><br />2. You take pride in what you do and keep yourself to account;<br /><br />– You have strong attention to detail and have very strong written communication<br />– Have the ability to manage your own workload and meet deadlines<br />– Report on customer engagements and demonstrate your value<br />– You have previous experience with customer support software (a bonus)<br /><br />3. You have plenty of energy to share;<br /><br />– Do sport/fitness yourself and appreciate the value of physical exercise<br />– Have a positive mindset and good sense of humour<br /><br />What You’ll Be Doing…<br /><br />* Manage and respond to incoming and backlogged user queries and support tickets via our support system (no phone calls)<br />* Be the friendly, helpful and professional first point of contact for our users<br />* Follow communication procedures, guidelines and policies<br />* Provide suggestions, and look for better ways of delivering amazing customer support<br /><br />We look forward to working with you! <br /><br />"
  },
  {
    "id": "VezPu6CHTO6wtG8Nhn3lfA",
    "url": "http://workinstartups.com/job-board/job/71392/estate-agent-at-agendavideo/",
    "title": "Estate Agent",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Agenda.Video",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 26, 2018 6:03:21 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "London-based startup Agenda.Video is looking for a super talented Business Development Manager with good knowledge of the real estate market. A great opportunity to join an international team that will change the market.<br /><br />About the company:<br />“Video is a megatrend” (Mark Zuckerberg) and videos are taking over internet. Businesses marketing on the web will either embrace videos or be disrupted. Agenda.Video produces effective internet videos cheaper and faster than anyone else, operates a network of trained video editors – a “Uber for videos”. We are now looking for a talented Business Development Executive to promote our video offering among the estate agents, and thus transform the real estate industry.<br /><br />Some of the things we’d like you to do:<br /><br />– Build relationships with marketing decision makers in estate agents <br />– Convince them to use videos for their property ads to accelerate sales and lettings <br />– Understand current and future marketing needs of the estate agents to optimise and improve Agenda.Video offering<br /><br />A bit about yourself: <br />– Successful experience (2-5 years) with an established estate agent <br />– Open-minded, out-of-the-box thinking <br />– Strong motivation and initiative <br />– Ability to network, build relationships with potential customers and close sales<br /><br />What you can expect from Agenda.Video: <br />- OTE: £ 30.000 - 80.000 per year <br />30.000 base + a good commission on sales<br />– Remote working <br />– Flexible working hours <br />– Exciting international colleagues and clients <br />– European corporate culture based on values and feedback <br />– Opportunity to participate and grow with a great startup that will change the industry"
  },
  {
    "id": "_NOLt3yiST6jlQplgyuMDQ",
    "url": "http://workinstartups.com/job-board/job/70982/success-consultant-at-chaser/",
    "title": "Success Consultant",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Chaser",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 16, 2018 9:45:25 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "*Role Summary*<br /><br />We’re looking for a passionate, customer-focused Success Consultant to join our growing team. Our primary route to market is through accounting and bookkeeping firms. You will be responsible for the delivery of Partner Success to those partner accounting and bookkeeping firms to ensure they make the most out of the block licences we sell to them. You will also be responsible for the delivery of Customer Success to new direct trialists to ensure maximum conversion from free trial. You will have responsibility for both ongoing retention and expansion MRR.<br /><br />We are growing at a fantastic rate. Success and support are absolutely integral to our growth. This is an incredible opportunity for someone talented and ambitious to make a huge impact.<br /><br />You'll be reporting directly to the Head of Success. Our head office is located in Moorgate London. Over half our team work remotely and we do offer remote working for the right candidate.<br /><br />Your Role Will Consist Of<br /><br />* Building a deep understanding of accounting and bookkeeping firms. You will need to develop a deep empathy that can enable us to work with them to successfully introduce Chaser to their clients<br />* Delivering and refining training programmes for accounting and bookkeeping firm staff. This training will need to provide them with a detailed understanding of how Chaser as a product works. It will also need to equip them to identify opportunities and successfully sell and market Chaser to clients who could benefit from it<br />* Ongoing partner and customer account management to both avoid churn and maximise upsell opportunities for growth in their use of Chaser<br />* Delivering demonstrations of Chaser<br />* Production educational resources about Chaser, including inter alia our help centre and educational videos<br />* Ensuring partners and customers are aware of all new developments to the product and enabled to make the most out of them<br />* Creating and running webinars about Chaser<br />* Delivering and refining our Customer Success outreach and training process to new direct trialists so as to maximise trial conversion and retention<br />* Ensuring that all customer and partner support is prompt and comprehensive. We pride ourselves on the quality of our support as a company<br />* Work closely with Sales, Marketing, Product and Engineering in carrying out these responsibilities; relaying feedback and insights as the voice of our partner and customer to shape our ongoing product roadmap<br />* Attending and representing Chaser at events<br /><br />*About You*<br /><br />* You will have a deep passion for helping our customers and partners succeed<br />* You will be a proactive self-starter who is comfortable taking the initiative and solving problems autonomously<br />* You will be positive with an ability to engender the energy and excitement in partners and customers to use Chaser<br />* You will be extremely ambitious<br />* You will love learning (fast!). You will be comfortable (well, as comfortable as it’s possible to be!) learning through trial and error<br />* You will have strong commercial and business acumen with an instinct for opportunity<br />* You don’t need to be an amateur netless tightrope walker, but you will be comfortable with the need to take risks in the role<br />* You will have excellent written communication skills<br />* You will have excellent spoken communication skills, both in person and over the phone. You will need to explain what are often complex technical matters in simple terms<br />* You will have strong time management and prioritisation skills. There will be lots of balls to juggle in this role<br />* You will be someone who thrives working in a high speed environment<br />* You will be excited about working as part of a small, tight-knit team<br />* Digitally proficient, you will be excited to build an excellent understanding of how to best use Chaser as a product. Curiosity about how and why our product works will serve you well in this role<br />* Any sales, success or account management experience, along with any experience of working in SaaS, with accounting firms or in credit control is a bonus<br /><br />*Benefits*<br /><br />* Competitive salary<br />* Share options<br />* Company pension scheme<br />* 25 days holiday<br />* Flexible working hours<br /><br />*How to apply*<br /><br />In applying please answer the following questions:<br /><br /># Why have you applied for this role? (Max 100 words)<br /># What is your proudest achievement and why? ( Max 200 words)<br /># What is a company or product that you think has excellent educational resources and/or support materials; and what makes them so good?<br /># Are you eligible to work in the UK?"
  },
  {
    "id": "t2OZCcscT_G4for5wNh6Nw",
    "url": "http://workinstartups.com/job-board/job/70734/user-adoption-agents-at-taskforce/",
    "title": "User adoption agents",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``OR(you,we,employe,develop,engin,abl,workmat) 2W work 2W from 2W home",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "TaskForce",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 8, 2018 1:33:35 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "I am looking for 4-5 enterprising university students, based in London, to help launch a new mobile app. The app enables community based commerce and will be piloted in September 2018 in central London. The successful individuals will be responsible for new user subscription and for marketing the app. This is great experience for the right individual to learn about digital enterprise, mobile apps, and business development. Plus, its a great way to generate easy money quickly. You will need to start in July 2018 - there are no fixed hours, and you can work from home/university, so long as you can engage with young professionals easily. You will earn a healthy commission from the sales you generate, which will continue until the end of the year even if you stop working before then. Please message me if interested."
  },
  {
    "id": "mkbrjKsoR_G_WLRRkH5KHA",
    "url": "http://workinstartups.com/job-board/job/70684/client-success-manager-at-looop/",
    "title": "Client Success Manager",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Looop",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 5, 2018 4:19:07 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "We’re looking for someone who’s experienced at managing relationships to join our team and play a crucial (and exciting) role helping our customers make the most of our technology and approach. Whilst you will have the opportunity to work from home, this role will involve working at customer sites, the vast majority of which are in Central London. <br /><br />*Your role will involve:* <br /><br />* A bit of consulting; <br />* A bit of customer support; <br />* A bit of detective work; and<br />* Plenty of opportunity to exercise your strategic and creative sides, as you may be planning and producing short videos and writing copy in order to build digital resources. <br /><br />If you’re not familiar with what digital resources are then don’t worry. What’s more important to us is that you have some experience dealing with (or working in) large-ish companies, you are great at managing relationships, and that you have a bit of a flair for producing written content.<br /><br />*What we do:* <br />It seems quite grand but we really do transform the way that business people work, learn and grow as professionals, with Looop’s innovative Digital Learning Platform and methodology. And we do this working with some of the most progressive and well-known companies in the world. <br /><br />*Who we are:*<br />Looop is a post-revenue, high-growth technology start-up, which means (in real language) we've done the really hard bit, turning a great idea into a business, and now we're growing the team to build on our initial success!<br /><br />Since 2014, we've been challenging the Learning & Development (L&D) industry to catch up with the way that technology enhances our daily lives: to ditch rubbish e-learning and keep out of the training room! By doing this, L&D can help everybody be better at their jobs and take on exciting new roles.<br /><br />Our customers are not just companies who pay us in exchange for tech. We build deep relationships with the brilliant people at ASOS, Amazon, Sky, Financial Times, and more, and they rely on us for thought-leading, practical support to get better results through their Learning & Development.<br /><br />As people, we are experts at what we do, driven to make a difference, and friends who like working with each other. We challenge and support each other to be the best we can be and celebrate the many successes we have along the way.<br /><br />*The exciting new role in our team:*<br />Our customers have come to rely on our expertise and responsiveness and we are looking for someone to help them with this. So, we're looking for somebody to join us who wants to:<br /><br />Help the brilliant and ambitious people, that we’re fortunate enough to call our customers, to do what they want to do with Looop… but better. You'll do this by responding to - and anticipating - their needs and staying close to them, leading them on their way, and providing expert, hands-on support;<br /><br />Help deliver consulting services to our customers following our proven (and improving) Looop methodology, which will include:<br /><br />* Helping them unpack business performance problems using the Looop methodology<br />* Designing and building resources<br />* Designing and leading campaigns for engagement<br />* Helping to quantify and report successful campaigns;<br />* Continuously improve Looop’s customer onboarding - and subsequent experiences - so their entire organisation benefits from what we know they can achieve with us.<br /><br />*Experience:*<br />We are really pushing our customers to think differently about their L&D and their business, and - in so doing - we’re helping them to improve. For this reason, we need somebody with at least some experience of working in a corporate environment. <br /><br />Developing ‘content’ is also a core element of this role, which will mean designing and building of learning resources as well as gaining high user-engagement, with the skills for this including writing, basic video production and running marketing campaigns.<br /><br />*You are:*<br />Real customer success comes from the heart.  You believe in what you do and are passionate about engaging people and driving positive change in business through the use of innovative technology. If this is you, we’d love you to speak with you!<br /><br />Many of the world’s most exciting and progressive companies are transforming their Learning & Development by adopting our technology and our approach, and we would love your help in taking care of them.<br /><br />*If you sound like the right person for this role then please apply below.*"
  }
]
}
