{
 "items": [
  {
    "id": "Jy6lAqSHSRua2UkDJv7cqA",
    "url": "https://problogger.com/jobs/job/jr-accounting-software-writer-remote-friendly/",
    "title": "Jr. Accounting Software Writer (Remote Friendly)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Fit Small Business",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 26, 2019 2:00:00 AM",
    "validThrough": "Sep 2, 2019 2:00:00 AM",
    "crawled": "Aug 26, 2019 5:06:53 PM",
    "content": "<h3>Jr. Accounting Software Writer (Remote Friendly)</h3><div>Company: Fit Small Business</div>Location: New York, NY<br>Job Type: Full-time<div>  <h5>Description</h5>  <div>                    <h4><strong>Jr. Accounting Software Writer&nbsp; (Remote Friendly)</strong></h4><h4><strong>Your role in a nutshell:&nbsp;The Jr. Accounting Software Writer will be an integral part of building the most comprehensive small business accounting and bookkeeping portal on the internet.</strong></h4><h5><strong>This position includes:</strong></h5><ul><li><span>The Jr. Accounting Software Writer will be writing in-depth comparison articles of accounting, bookkeeping, and tax software.</span></li><li><span>Researching (including interviewing experts and participating in demos) and writing articles about specialty software and apps.</span></li><li><span>Updating product features and pricing information.&nbsp;</span></li><li><span>Providing detailed responses to reader questions.</span></li><li><span>Developing infographics and visuals to support written content.</span></li></ul><h5><strong>Our mission:To deliver the best answers to people's questions.</strong></h5><h6><span>Recently named to the Inc. 500 list of America’s fastest-growing private companies, Fit Small Business has more than 3 million small business owners and managers reading our content each month. We deliver well-researched, authoritative articles so these owners can make informed decisions to grow businesses that fuel the economy. Our founders have built successful businesses before, and FSB is profitable with no outside funding. Part of the team of 170+ people is in our NYC headquarters, near Grand Central. Others are distributed across the U.S., Canada, and the Philippines.</span></h6><h5><strong>Does this sound like you?</strong></h5><ul><li><h6><span>As the new Jr. Accounting Software Writer you will have a professional or educational background in bookkeeping and accounting.&nbsp;</span></h6></li><li><h6><span>You’re excited about the ways software and other technology can create efficiencies for small businesses and provide them with new insights.&nbsp;</span></h6></li><li><h6><span>You are passionate about writing and want to share your knowledge in written form to teach our eager readership how to make their small businesses succeed.</span></h6></li></ul><h5><strong>Your Background:</strong></h5><ul><li><h6><span>At least one year of relevant experience.</span></h6></li><li><h6><span>Strong working knowledge of common accounting software, like QuickBooks.&nbsp;</span></h6></li><li><h6><span>You enjoy learning the ins and outs of software and apps.&nbsp;</span></h6></li><li><h6><span>You are a great researcher and writer.</span></h6></li><li><h6><span>You are high energy, and passionate about helping small businesses.</span></h6></li><li><h6><span>You are comfortable working in a startup environment, where things change quickly.</span></h6></li><li><h6><span>You have a strong work ethic.</span></h6></li></ul><h5><strong>Tools We Use:</strong></h5><h6><span>WordPress, Insightly, G Suite, Slack, Trello, Guru, Zoom</span></h6><h6><span>*It's ok if you have not used these, just be enthusiastic to learn them.</span></h6><h6><strong>What we offer you:</strong></h6><ul><li><h6><span>Competitive salary</span></h6></li><li><h6><span>Quality health insurance (subsidized by FSB)</span></h6></li><li><h6><span>Short-term and long-term disability (Paid by FSB)</span></h6></li><li><h6><span>Traditional &amp; Roth 401K plans with matching from first day</span></h6></li><li><h6><span>Vision, dental, and life insurance</span></h6></li><li><h6><span>Flexible Spending Accounts and Commuter Benefits</span></h6></li><li><h6><span>PTO</span></h6></li><li><h6><span>Flexibility</span></h6></li><li><h6><span>Perks and discounts via our PEO</span></h6></li><li><h6><span>A collaborative workplace, which will challenge you and celebrate your work</span></h6></li><li><h6><span>A chance to learn with and from interesting and enthusiastic colleagues</span></h6></li></ul><h6><span>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</span></h6><h6></h6>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "__A3FNNbSMC5jtxV3qNE7Q",
    "url": "https://remote.co/job/bookkeeper-16/",
    "title": "Bookkeeper",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "AudiologyDesign",
      "sameAs": "http://www.audiologydesign.com/"
    },
    "salary": {
      "currency": "USD",
      "minValue": 20,
      "maxValue": 20,
      "info": "",
      "unit": "HOUR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 20 /Hour"
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2019 5:37:08 PM",
    "validThrough": "Aug 29, 2019 5:37:08 PM",
    "crawled": "Aug 22, 2019 6:24:55 PM",
    "content": "<h3>Bookkeeper at <span>AudiologyDesign</span></h3><div><span><i></i> Remote</span>         | <span> Part-time </span></div><div>            <p>Stalwart Journeys LLC (dba AudiologyDesign) is seeking a part-time bookkeeper for our growing business. In business since 2002, AudiologyDesign is the leading digital marketing agency in hearing healthcare. <strong>We are a completely virtual office environment affording the opportunity to conveniently work from home. </strong></p><p><strong>We are seeking a dependable bookkeeper with QuickBooks expertise to:</strong></p><ul><li>Develop, enhance and manage bookkeeping policies and procedures, along with developing a framework to track financial transactions with an established chart of accounts</li><li>Conduct and manage the general ledger</li><li>Appease accounts by balancing entries</li><li>Support accounts by verifying, allocating, and posting transactions</li><li>Put together financial reports by collecting, analyzing, and summarizing account information</li><li>Examine payments received and record deposits</li><li>May also include HR administration, and special projects as assigned</li></ul><p><strong>Competencies</strong>:</p><ul><li><strong>BS Degree in Accounting, Finance or Business Administration preferred or equivalent experience</strong></li><li>5+ years of previous experience as a Bookkeeper</li><li>Solid understanding of QuickBooks</li><li>Prior experience using accounting software</li><li>Strong familiarity with billing</li><li>Comprehensive knowledge of payroll</li></ul><p><strong>Desired Qualities:</strong></p><ul><li>A passion for and sense of personal satisfaction in delighting clients and helping small businesses succeed.</li><li>Ability to communicate clearly and professionally, both orally and in writing.</li><li>Willingness to consistently and accurately follow established policies and procedures.</li><li>Confidence in learning and embracing new technology to solve client issues.</li><li>Experience in developing strong remote team relationships based on trust, accountability, integrity, and sharing of best practices.</li><li>Ability to maintain the highest level of confidentiality</li></ul><p><strong>Mission:</strong> The PT Bookkeeper’s mission is to establish and document solid bookkeeping policies and procedures and ensure accurate and timely data entry and monthly financial reporting – providing the organization the utmost confidence that our accounting records are in order.</p><p><strong>Compensation:</strong></p><ul><li><strong>Part-Time Position</strong></li><li>$20 per hour; 15 hours per week</li></ul>        </div><div>        <a href='https://audiologydesign.com/bookkeeper/' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "e_fI0LsxSt6SwUsN0-BSEw",
    "url": "https://jobmote.com/job/63632/14k-per-month-work-at-home-financial-services/",
    "title": "$14K+ per month - Work At Home - Financial Services",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Google",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 19, 2019 11:24:31 AM",
    "validThrough": "Aug 22, 2019 11:24:31 AM",
    "crawled": "Aug 19, 2019 4:06:26 PM",
    "content": "<div>Salary 100% Commission, <p><strong>This a realistic 6-figure plus career opportunity</strong> for a highly motivated individual who is willing to follow a <strong>PROVEN SYSTEM</strong> and put in the work<strong>. </strong><br><br>Our parent organization paid out <strong>$985 Million </strong>in commissions in 2016,<strong> </strong>and they intend to<strong> </strong>pay out <strong>$4 Billion in 2020</strong>. <br><br>We are taking t<strong>he most successful business model </strong>in the Financial Services industry into a completely virtual environment with solid backing from one of the strongest and best known companies in America.<br><br><br><strong>We are seeking experienced sales &amp; recruiting pros as well as sales trainees.</strong><br><br>You bring the skills, attitudes, and habits of success... We teach you the details. OK to start Part Time.</p><p><br>----------------------------------------------------------------------------------------------------------------------------------------<br>If you would like to learn more, <strong>your NEXT STEP is to watch our intro video.</strong><br><br>If you like what you see on the video, then click the link to request for an initial phone interview<br>to get your questions answered and to see if we're a match.</p><p>---------------------------------------------------------------------------------------------------------------------------------------------</p><p><br><strong>WORK FROM ANYWHERE... </strong>We do everything online: Live training 4 times weekly via livestream<br>presentations, recorded training 24/7 on video, and our client presentations are done via private web conferences<br>using screen sharing technology.<br><br><strong>DO BUSINESS NATIONWIDE</strong> ... This virtual model eliminates all the wasted drive time and<br>no more boring office meetings... you can get a lot more done in a lot less time and you can expand<br>your territory to the entire United States!<br><br><br>Our system enables individuals new to the industry to earn great income as they learn the business,<br>and it enables seasoned industry professionals to expand their business from their local home town<br>to the entire country, and <strong>build a nationwide \\&quot;virtual agency\\&quot;.</strong><br><br><br>This is a unique, lucrative, dynamic opportunity to<strong> take back control of your life and of your financial destiny.</strong><br><br>Set your own hours. <strong>We pay for RESULTS, not attendance</strong>... so if you're looking for a job,<br>this is not for you...but if you're looking for a <strong>SYSTEM </strong>that can allow you to get to a level of income<br>that just has not been possible before, then we might be a match because<strong>...<br><br>We don't punish success, we throw money at it.</strong><br><br><br><strong>What we offer...</strong><br><br>1. <strong>NO LIMITS on your income... be paid what you're really worth.</strong><br>2. Commission advances, overrides, and bonuses <strong>paid twice weekly</strong><br>3. Great quality of life.. work from anywhere<br>4 .<strong> Flexible hours / Time Freedom</strong>... you're the boss<br>5 . Fun, supportive, and positive team culture<br>6. A marketing position that doesn't require any selling<br>7. <strong>Proven SYSTEM</strong> that that produced $732 million in commissions &amp; bonuses in 2015<br>8. Thorough training both live and recorded. Personal mentoring.<br>9. Company wide recognition and bonuses for significant achievement<br>10. Company paid celebrations at beautiful destinations for top producers<br>11. Leadership that cares about your success<br>12. <strong>Leveraged and residual income</strong> over time and <strong>ability to earn equity</strong><br><br>Most importantly, <strong>an opportunity to make a real difference</strong> in people's lives while you<br>escape the 9-5 rat race and <strong>take back control of your life.</strong><br><br><br><strong>What we DON'T do...</strong><br><br>1. No cold calling or door-to-door<br>2. No evening or weekend appointments away from home<br>3. No wasting time fighting traffic &amp; No boring office meetings<br>4. No dress code<br>5. No quotas or minimums except those you set for yourself<br>6. No micro-managing<br>7. No corporate favoritism. Promotions based on results, not politics.<br><br><br><strong>Who We Are Looking For...</strong><br><br>Our ideal candidate is a self-motivated winner who is HUNGRY and just looking<br>for <strong>the right opportunity, the right team, and the right SYSTEM.</strong></p><p>We are looking for self-motivated achievers who are looking for the<strong> freedom and flexibility</strong><br>to work on your own schedule from a virtual office in a REAL business of your own, with one<br>of the strongest companies in the industry.<br><br>Must have strong communication and \\&quot;people skills\\&quot;, a great attitude, HIGH INTEGRITY,<br>enjoy helping people, and be willing to follow our proven system and put in the time and<br>work that we all know is required in order to achieve extraordinary success.<br><br>If that's you, then lets talk.<br><br><br><strong>Part time OK</strong> if you can put in at least 12 hours/week minimum in income producing activity<br>plus 3+ hours per week of online training.<br><br><strong>This is a 1099 independent contractor position. Income is based on results. </strong>Life insurance license<br>is required, which is easy to get. OK to start while working on your pre-license education.</p><p><br><br><strong>YOUR NEXT STEP...</strong><br><br>If you would like to learn more, <strong>your NEXT STEP is to watch our intro video.</strong><br><br>If you like what you see on the video, then click the link to request for an initial phone interview<br>to get your questions answered and to see if we're a match.<br><br><br><strong>TO WATCH THE VIDEO...</strong></p><ol><li>Click the green 'APPLY NOW' button on the lower right side of this page</li><li>Fill in the brief info form and click SUBMIT</li><li>On the next page, click the link to get to our website with the video</li></ol><p><br>We look forward to meeting you on the phone very soon if you would like to discuss the possibilities.<br><br><br>DOUG JONES<br>Senior Vice President</p><p> </p><p>P.S. <strong>As you watch the video, take notes and jot down your questions,</strong> then click the NEXT<br> button below the video to request and initial phone interview so we can get them answered<br> for you and see if we are a match.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "MpEQSibzTBaxaIAcnfiUEQ",
    "url": "https://jobmote.com/job/63610/it-architect-patient-accounting-remote/",
    "title": "IT Architect - Patient Accounting (REMOTE)",
    "tags": [
      "DBG:surround``can 2W remot",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "TIER4 GROUP",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 19, 2019 11:24:30 AM",
    "validThrough": "Aug 22, 2019 11:24:30 AM",
    "crawled": "Aug 19, 2019 4:06:26 PM",
    "content": "<div>Job DescriptionJOB SUMMARYRobinson Key has been contracted by a leading hospital system undergoing a technology transformation to fill the role of IT Architect - Patient Accounting. Join a HIMSS Stage 7 healthcare system with a highly-optimized tech infrastructure including Cerner Smart Room technology. The IT team is also building a new highly collaborative office space designed with innovation in mind. IT Architect, Business Operations Optimizes application usage and workflow efficiency by working with assigned department heads. Serves as an escalation point for upgrades and services for reported issues or for assigned projects. Focuses on revenue cycle, scheduling, HIM, and registration operations for both inpatient and outpatient practices. Assists in training efforts for designated applications as deemed appropriate. Analyze reports to identify operational issues throughout all departments. Design, develop, implement and maintain business solutions and recommendations to improve efficiency. Specialty specifics:o Patient Accounting Must have 3 years of experience, prefer 5 years, building and maintaining Cerner Patient Accounting Must have experience in Cerner CPA. Experience with nThrive (MedAssets) a plus but not required. DEPARTMENT STANDARDS? Provide outstanding customer service to our clients and maintain positive relationships with other employees and contractors. ? Desire and willingness to work in a collaborative, innovative, flexible and team-oriented environment, while displaying a problem solving orientation to issues on a daily basis.? Troubleshoot identified issues, solve end user problems, enhance and optimize applications. ? Particulate in ongoing support and maintenance of existing systems and applications. Perform after-hours maintenance as required. ? Create and maintain detailed technical documentation in regards to enterprise systems and applications. ? Provides on-call coverage as deemed appropriate by management. ? Flexible to complete any assigned task.? Ability to quickly learn and adapt to new procedures, processes, technology and applications. ? Strong planning and organizational skills. ? Exhibit strong communication skills by pro-actively responding to telephone calls, email, in-person, and automated requests for technical support. ? Identify and escalate production-critical issues to appropriate IT personnel. ? Use ticketing system to log and monitor tickets. ? Participates in projects as deemed appropriate by management. ? Evaluates and corrects issues involving configuration of applications. EDUCATION, EXPERIENCE AND QUALIFICATIONS? Minimum of a Bachelor??s Degree in Business, Technology, or related field a MUST.? Prefer 5+ years of experience required. ? Candidates can work remotely from home and travel as needed. Relocation is offered (if desired) but is not required.? Excellent verbal and written communication skills.? Ability to solve complex problems in a timely manner. ? Accurate with good attention to detail. ? Ability to work under own initiative / self-motivated. ? Experience working in a large cross-functional team environment. ? Experience with information technology optimization. ? Dexterity to learn new systems and programs rapidly. ? Must have working knowledge of the industry. This includes but is not limited to configuration management principle and practices, software development lifecycle, and application security practices. ? Must have working knowledge of a within the specific department. ? Must have an understanding of testing methodologies. ? Must have experience working as an intermediary between technical and non-technical teams. ? Proficient in the Microsoft Office Suite (Word, Excel, PowerPoint, OneNote, Outlook, Visio). ? Certifications not required. SDL2017</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3NS2Ij-QSbKUxnwvsLx7gw",
    "url": "https://stackoverflow.com/jobs/282425/analytics-engineer-interested-in-data-science-plus-capital?a=1wIqyqLoJ4tO",
    "title": "Analytics Engineer Interested in Data Science + Finance at Capital (New York, NY) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/24",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/4",
      "DBG_TECH1:k/t/w:numpy/python/5",
      "DBG_TECH1:k/t/w:pandas/python/5",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:k/t/w:scikit-learn/bigdata-ml/8",
      "DBG_TECH1:k/t/w:scikit-learn/python/5",
      "DBG_TECH1:techWeightMap:{python=19, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=44, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Capital",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 17, 2019 1:06:24 PM",
    "validThrough": "Aug 24, 2019 1:06:24 PM",
    "crawled": "Aug 17, 2019 1:06:25 PM",
    "content": "<h3><span>Analytics Engineer Interested in Data Science + Finance</span>                </h3>                    <h4>About this job</h4>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior, Lead</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Backend Developer, Data Scientist</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Finance, Financial Technology</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>1–10 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Capital | New York, NY<br></div>                    <h4>Remote details</h4>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>New York, NY.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                        <div>                                    <span>Relocation Assistance:</span>                                    <span>Yes</span>                                </div>                        </div>                    </div>                <h4>Technologies</h4><div></div><div>python</div><div>d3.js</div><div>pandas</div><div>scikit-learn</div><div>numpy</div>                <h4>Job description</h4>                <div><p><strong>Who we are</strong></p><p>We are a team of passionate and intellectually diverse individuals, who are building financial services that help companies grow to their fullest potential. We believe that fast, fair, and equitable access to financial intelligence can level the playing field for high performing and high potential companies at any stage in their financing.</p><p>The Capital Machine is a systematic financial analysis tool that functions like Bloomberg, but for private companies. Private companies connect their data to the machine and receive financing offers within hours from Capital’s balance sheet. On the back-end, the machine analyzes and benchmarks company data, facilitating data-driven engagement between those who invest capital and those who need it to scale their businesses.</p><p><strong>What you’ll contribute</strong></p><p>As an Analytics Engineer at Capital, you will work on mission-critical problems related to building robust, scalable data pipelines and productionizing analytics. You understand basic probability theory, applied machine learning, and textual analysis. You’re comfortable writing tested, performant code to migrate ideas from the workbench to production. You love visualization and get excited about making data beautiful and intuitively accessible to end users. At Capital, you’ll develop fluency in the language of capital markets and finance. You are an effective communicator who is excited to build bridges between members of these communities and your own.</p><p><strong>Who you are</strong></p><ul><li>You have strong foundations in machine learning and probability theory, with demonstrated success working on applied challenges</li><li>You’ve mastered OOP in Python and have experience working on backend systems that are deployed to production environment</li><li>You understand fundamental software engineering concepts such as modularity, separation of concerns, data structures and interfaces, and computational complexity</li><li>You’ve implemented unit and functional testing as part of a continuous integration workflow</li><li>You have a good eye for data visualization and experience with static (e.g. ggplot2, Plotly) and dynamic (e.g. Dash, Bokeh) toolkits</li><li>You have solid written and verbal communication skills, with the ability to bridge the gap between those who do and don’t speak fluent “data”</li><li>You’ve worked with a distributed processing framework, such as spark, hive, or hadoop</li><li>You have experience implementing workflow/scheduling frameworks such as luigi or airflow</li><li>You have experience working on--or are interested in learning about and attacking--hard financial problems</li></ul><p><strong>How you'll be supported at Capital</strong></p><ul><li>Unlimited PTO and flexible WFH policy</li><li>Learning stipend to pursue any kind of professional development or continuing education related or not related to your field</li><li>Platinum medical, vision and dental coverage and OneMedical membership for you and your dependents. Includes FSA &amp; HSA options</li><li>Unlimited parental leave plus fertility benefits</li><li>401k plans and co-investment opportunities so you can be a part of Capital's stellar investment performance</li><li>Stipends for wellness, transportation, and electronics (laptops, headphones, monitors - anything you need to do your best work)</li><li>Stocked office with 24/7 access and custom workstations</li><li>Another request? Just let us know!</li></ul>                </div>            <div>        <a href='https://grnh.se/d5c123142' rel='nofollow'>                        Apply now        </a></div>            <h4>About Capital</h4>            <div><p>Capital is on a mission to make the $5 trillion private financial markets fair, transparent, and accessible to anyone who has an innovate idea and is seeking funding. Together, we are creating The Capital Machine to connect founders with investors.</p><p>The Capital Machine is a systematic financial analysis tool that functions like Bloomberg, but for private companies. Private companies connect their data to the machine and receive financing offers for complex $5 to 75 million transactions within hours. On the back-end, the machine analyzes and benchmarks company data. This enables it to select opportunities to hold in the Capital captive balance sheet entity and syndicate other opportunities across its network of institutional Capital partners.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Unlimited PTO and flexible WFH policy</span>                            </li>                            <li>                                <span></span>                                <span>Medical, dental, and vision coverage</span>                            </li>                            <li>                                <span></span>                                <span>Unlimited parental leave plus fertility benefits</span>                            </li>                            <li>                                <span></span>                                <span>401k plans and co-investment opportunities</span>                            </li>                            <li>                                <span></span>                                <span>Stipends for wellness, transportation, and electronics</span>                            </li>                            <li>                                <span></span>                                <span>Comped outings</span>                            </li>                            <li>                                <span></span>                                <span>Stocked office (In-office snacks &amp; cold brew)</span>                            </li>                            <li>                                <span></span>                                <span>Learning and Mentorship Program</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "zeeOcx9sTu2rYROA82002Q",
    "url": "https://remote.co/job/staff-accountant-bookkeeper/",
    "title": "Staff Accountant / Bookkeeper",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:generics/java/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/finacc",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "Bookkeeping for Dentists LLC",
      "sameAs": "https://www.bookkeepingfordentists.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 16, 2019 10:07:03 PM",
    "validThrough": "Aug 23, 2019 10:07:03 PM",
    "crawled": "Aug 16, 2019 10:32:14 PM",
    "content": "<h3>Staff Accountant / Bookkeeper at <span>Bookkeeping for Dentists LLC</span></h3><div><span><i></i> Remote</span>        </div><div>            <h5><b><strong>ABOUT US:</strong></b></h5><p>Bookkeeping for Dentists LLC is a blend of custom software and super passionate people. We are a very tech savvy and modern bookkeeping firm specializing in dental practice benchmarking. We have over 100 clients whom we love and our #1 priority each day is the quality in our work. To achieve high quality, we utilize technology to the fullest and find ways to make every bookkeeping task as streamlined and automated as possible so we can focus on quality in our work and our relationships with clients.</p><h5><b><strong>POSITION WE NEED TO FILL:</strong></b></h5><p>With the immense growth this past year after developing our online web application, we need a personable Staff Accountant to assist with onboarding and cleaning up bookkeeping for new clients. Your primary function is to interface with potential and new clients as an onboarding accountant. You will be supporting them in the transition, answering bookkeeping related questions and helping new clients get started with us by gathering the items we need start, then you will be setting up and or cleaning-up their bookkeeping. We will train you in easy stages and taking new client calls will be the last stage, so don’t be nervous, you’ll be a pro by then.</p><h5><b><strong>ROOM TO GROW:</strong></b></h5><p>There is room for growth in this position. You could be our onboarding accountant forever, or you can later head into other roles as we quickly grow. The choice is yours.</p><h5><b><strong>SPECIFICS:</strong></b></h5><p>The position is 100% remote (work from home) because our entire team is also 100% remote. You will be working directly under the founder, 40 hours per week. Health insurance and 401k benefits are also provided.</p><h5><b><strong>IMPORTANT QUALIFICATIONS (Read Carefully):</strong></b></h5><ul><li>You MUST be SUPER personable with both email and phone calls.</li><li>You must be an excellent conversationalist, professional, and upbeat attitude consistently.</li><li>You MUST have a college degree in accounting (4 years)</li><li>You MUST have more than 2 years of public accounting (CPA Firm) experience</li><li>You must be fantastic with figuring out online/desktop software applications.</li><li>You must have a quiet room with a door, computer, and high-speed internet</li></ul><h5><b><strong>ESSENTIAL FUNCTIONS:</strong></b></h5><ul><li>Right-hand person to the founder with a mission to efficiently support new clients onboarding for bookkeeping services.</li><li>Take the phone calls scheduled with potential clients (all inbound and scheduled, never out-bound) and help them get started</li><li>Gather “getting started” items needed from new clients</li><li>Ability to clean up disastrous bookkeeping or start books from scratch for new clients</li><li>Light sales/marketing tasks</li></ul><h5><strong>BONUS FUNCTIONS:&nbsp;(if you are an impressive candidate)</strong></h5><ul><li>Marking/sales support</li><li>Streamline onboarding processes (find bottlenecks and develop solutions)</li><li>Develop client relationships</li></ul><h5><b><strong>SOFTWARE APPLICATIONS YOU SHOULD KNOW:</strong></b></h5><ul><li>QuickBooks Online (You will use this daily)</li><li>QuickBooks Desktop (we don’t use desktop often)</li><li>Microsoft Office (We use Office 365)</li></ul><h5><b><strong>YOU WON’T BE DOING ANY OF THE FOLLOWING (below):</strong></b></h5><ul><li>No Taxes… seriously, none.</li><li>A/R: we don’t do A/R or collections</li><li>Bill paying: we don’t offer any bill paying or check writing for our clients</li><li>Payroll: we don’t do payroll, but we assist clients by answering payroll questions and reconciling transactions to payroll reports.</li></ul><h5><b><strong>WHAT TO SEND US:</strong></b></h5><p>Please send a resume with cover letter. The cover letter should not be a generic cover letter you send everyone. Make it specific to the job, and explain why you’d be the right candidate. Be yourself.</p><p><strong>Apply to:</strong> careers@bookkeepingfordentists.com</p><h5><b><strong>BONUS:</strong></b></h5><p>We suggest creating a LinkedIn profile if you don’t have one. We give significant points for LinkedIn</p><p>Location: <strong>US Locations Only</strong></p>        </div><div>        <a href='mailto:careers@bookkeepingfordentists.com?subject=Application%20via%20Staff%20Accountant%20%2F%20Bookkeeper%20listing%20on%20https%3A%2F%2Fremote.co' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "4yXO-UHsQNCLMFtc6EkBYQ",
    "url": "https://remote.co/job/international-finance-associate-2/",
    "title": "International Finance Associate",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Shield GEO",
      "sameAs": "https://shield-geo.breezy.hr/p/140fe3fe0223-international-finance-associate-startup-remote-work-for-graduates?source=remote.co"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 15, 2019 4:14:18 PM",
    "validThrough": "Aug 22, 2019 4:14:18 PM",
    "crawled": "Aug 15, 2019 5:08:30 PM",
    "content": "<h3>International Finance Associate at <span>Shield GEO</span></h3><div><span><i></i> Remote</span>         | <span> International </span></div><div>            <h5><strong>Finance Associate</strong></h5><p>Are you passionate about International Business, looking for flexibility in your career and craving creative freedom?</p><p>Then come join our team! We are looking for team-oriented, resourceful and self-motivated candidates.</p><h5><strong>Job Purpose: Finance Associate</strong></h5><p>Shield GEO provides outsourced employment and payroll for hundreds of employees in over 60 countries. Our Finance team is the engine that makes sure all our GEO employees get paid on time every month. They create invoices, process payments, generate payslips and resolve issues. The team collaborates closely with colleagues in Global Mobility, Subject Matter Experts and Implementation to ensure our clients have a great experience.</p><p>This is an administration heavy role as you’ll be creating many invoices and payslips every month. You’ll also be helping our internal teams with any questions they may have around international tax, payroll and finance. You’ll have plenty of support from our operational teams, systems and technology platform.</p><p>You will have the opportunity to work remotely and with flexible hours. You’ll also have the opportunity to advance your career in a young, growing company.</p><h5><strong>Working with Shield</strong></h5><p>If you are excited by the thought of playing an active role in a company that provides opportunities to create and innovate, you’re at the right place.</p><p>We’re a remote-friendly company with employees all around the world. We don’t want to be limited by location and are open to hiring anyone from anywhere – as long as it’s a great fit for us both. Before we get to know you, you might like to get an idea of who we are so you can decide if you want to be a part of what we’re about.</p><p>Every person is unique. At Shield GEO, we encourage an inclusive culture that embraces each individual’s differences. We believe that diversity of thought and experience is vital to generating creative ideas, developing effective strategies and making better decisions.</p><p>When hiring we do not discriminate by any unlawful means including, but not limited to, race, color, religion, gender, gender identity or expression, sexual orientation, national origin, disability, age or veteran status.</p><p>We can’t quite show you what it’s like to work with us but you can hear from our employees themselves. Here’re some articles written by our&nbsp;<a href='https://www.linkedin.com/feed/update/urn:li:activity:6323671460300890112' rel='nofollow'>Co-Founder,</a>&nbsp;<a href='https://www.linkedin.com/feed/update/urn:li:activity:6337257974012137472/' rel='nofollow'>Customer Success Manager&nbsp;</a>and&nbsp;<a href='https://medium.com/@sujah/heres-how-hiring-remote-workers-helped-our-company-culture-c797272677e1' rel='nofollow'>Digital Marketing Manager.</a></p><ul><li><a href='http://shieldgeo.com/about/our-policies/' rel='nofollow'>Working remotely and flexibly with Shield Geo</a></li><li><a href='http://shieldgeo.com/about/our-policies/#leave-policy' rel='nofollow'>Leave policy</a></li><li><a href='http://shieldgeo.com/about/our-policies/#work-equipment-policy' rel='nofollow'>Work equipment policy</a></li><li><a href='https://shieldgeo.com/about/our-policies/#workplace-diversity-policy' rel='nofollow'>Workplace Diversity policy</a></li></ul><h5><strong>Do you share our values?</strong></h5><p>Our 4 values are integral to who we are. Our company culture is constantly evolving, every person who joins us adds something unique to our culture. But our values are shared by all Shield GEO employees. Do these values resonate with you?</p><h5><strong>Grow</strong></h5><p>We believe that personal growth and company growth go hand in hand. We look to foster our own growth and help grow the company. Every day is an opportunity to face a new challenge and get a little better. In our world of international employment it is impossible to know all the answers. Instead of trying to know everything, we focus on knowing how to solve problems. When mistakes happen we know it’s all part of the learning curve and we seek feedback to help us improve. We keep an eye on the big picture so we can identify improvements to processes and systems. As the problems become larger and more complex, it means that we’ll need more flexible and agile minds to come up with solutions.</p><h5><strong>Own It</strong></h5><p>We are self-motivated and love to see tasks to completion. Our managers and team mates are often in different time zones, and that’s ok! We aren’t afraid to step up when things get a little tough. We don’t like to micro-manage or&nbsp;be&nbsp;micromanaged. We trust our team mates to carry out their part of the process. We are responsible for our own workload and making sure we get our most important things done each day. If we get stuck we proactively seek help. And we show our reliability and accountability by keeping our systems updated. This also means our results can speak for themselves.</p><h5><strong>Do The Right Thing</strong></h5><p>Our clients trust us with compliance on their most important asset – their employees. This is a big responsibility! Doing the right thing means often times we choose a harder path and see it through to the end. It means we are open with our colleagues, clients and suppliers about bad news just the same as we share good news. And sometimes doing the right thing means we have to make decisions that will upset the very person we are trying to help. It’s a high standard but we stand by this very strongly. Doing the right thing also means considering how our actions impact those around us.</p><h5><strong>Be Human</strong></h5><p>We are a service business and helping people is at the core of everything we do. We pride ourselves on how we interact with colleagues, service providers and clients. We recognize that in all areas we’re dealing with real humans.<br>We know that working remotely and dealing with such a mix of people around the world is challenging. We know that if we are having trouble understanding someone, they are also struggling to understand us. Empathy is fundamental to helping us discover what people mean and how they are feeling. To avoid misinterpretation we assume best intent in others.<br>Because so much of our communication is written and asynchronous, we default to&nbsp;<em>over-communication</em>. This means we give extra details because we don’t leave people guessing. We make sure our words are clear and easy to understand. And we are kind to our fellow humans.</p><h5><strong>Your Background</strong></h5><ul><li>At least two to three years’ experience within Finance</li><li>International tax or payroll experience strongly preferred. It will be helpful if you are familiar with concepts like employer social security, foreign exchange, gross ups and expense reimbursements.</li><li>Comfortable with technology. We are mostly remote and that means we rely on a bunch of applications to keep connected. That means video conferences (Zoom), chat and messaging (Slack, Skype and Salesforce Chatter), shared documents (Dropbox). You’ll likely be working by yourself during parts of your day without access to tech support.</li><li>Experience with Salesforce or Xero is helpful but not essential.</li></ul><h5><strong>Essential Characteristics of this role</strong></h5><ul><li>Excellent written and verbal communication skills and the ability to absorb information quickly.</li><li>Able to prioritize effectively and work autonomously while coordinating with an international team.</li><li>Exceptional attention to detail and maintaining accurate records.</li><li>Ideally located between UTC+3 and UTC+8 time zones</li><li>Some flexibility in working hours. We discourage overtime work and you will only be expected to work a standard number of hours each week. But we have clients and colleagues all over the world so sometimes you will need to be on calls in the morning or evening.</li><li>Request invoices from our providers located around the world</li><li>Create client invoices to cover the monthly payroll cost for each GEO employee</li><li>Request payslips from our providers around the work</li><li>Record and check payroll outputs within our systems to share with our clients</li><li>Record incoming payments and setup ongoing payments</li><li>Help to manage the team Accounts mailbox</li><li>Keep an accurate record of information in our internal systems by the process due dates</li><li>Check invoices for accuracy before sending to your clients</li></ul><h5><strong>Responsibilities</strong></h5><h6>Payroll and Invoicing</h6><h6>Process Improvement and Projects</h6><p>Everyone at Shield gets involved in projects. These can range from a simple creation of a template to speed up a task through to creating complex automations which eliminate hours of admin work.</p><ul><li>Assist the project team and other internal resources with recommending and implementing process and system improvements.</li><li>Act as a superuser in project teams</li><li>Help train other users when rolling out project solutions</li><li>Keep internal systems updated with progress on all core tasks</li><li>Weekly summary reporting</li><li>Ensure accuracy of all invoicing, payslip and payment data is entered in our internal CRM</li></ul><h6>Reporting</h6><h5><strong>Next Steps</strong></h5><p>If you like what you’re read so far, this is a fantastic opportunity to join a global team committed to service. We’d really like to hear from you! Please keep your cover letter under 250 words and share with us what achievement you’re most proud of.</p><p>Be sure to submit your application quickly, as applications will close Thursday, 22 August, 11:59pm AoE!</p>        </div><div>        <a href='https://shield-geo.breezy.hr/p/140fe3fe0223-international-finance-associate-startup-remote-work-for-graduates?source=remote.co' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "6hB5rzfvTeel2mCq95tUTg",
    "url": "https://jobmote.com/job/62043/14k-per-month-work-at-home-financial-services/",
    "title": "$14K+ per month - Work At Home - Financial Services",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Google",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 15, 2019 12:21:16 PM",
    "validThrough": "Aug 18, 2019 12:21:16 PM",
    "crawled": "Aug 15, 2019 5:06:26 PM",
    "content": "<div>Salary 100% Commission, <p><strong>This a realistic 6-figure plus career opportunity</strong> for a highly motivated individual who is willing to follow a <strong>PROVEN SYSTEM</strong> and put in the work<strong>. </strong><br><br>Our parent organization paid out <strong>$985 Million </strong>in commissions in 2016,<strong> </strong>and they intend to<strong> </strong>pay out <strong>$4 Billion in 2020</strong>. <br><br>We are taking t<strong>he most successful business model </strong>in the Financial Services industry into a completely virtual environment with solid backing from one of the strongest and best known companies in America.<br><br><br><strong>We are seeking experienced sales &amp; recruiting pros as well as sales trainees.</strong><br><br>You bring the skills, attitudes, and habits of success... We teach you the details. OK to start Part Time.</p><p><br>----------------------------------------------------------------------------------------------------------------------------------------<br>If you would like to learn more, <strong>your NEXT STEP is to watch our intro video.</strong><br><br>If you like what you see on the video, then click the link to request for an initial phone interview<br>to get your questions answered and to see if we're a match.</p><p>---------------------------------------------------------------------------------------------------------------------------------------------</p><p><br><strong>WORK FROM ANYWHERE... </strong>We do everything online: Live training 4 times weekly via livestream<br>presentations, recorded training 24/7 on video, and our client presentations are done via private web conferences<br>using screen sharing technology.<br><br><strong>DO BUSINESS NATIONWIDE</strong> ... This virtual model eliminates all the wasted drive time and<br>no more boring office meetings... you can get a lot more done in a lot less time and you can expand<br>your territory to the entire United States!<br><br><br>Our system enables individuals new to the industry to earn great income as they learn the business,<br>and it enables seasoned industry professionals to expand their business from their local home town<br>to the entire country, and <strong>build a nationwide \\&quot;virtual agency\\&quot;.</strong><br><br><br>This is a unique, lucrative, dynamic opportunity to<strong> take back control of your life and of your financial destiny.</strong><br><br>Set your own hours. <strong>We pay for RESULTS, not attendance</strong>... so if you're looking for a job,<br>this is not for you...but if you're looking for a <strong>SYSTEM </strong>that can allow you to get to a level of income<br>that just has not been possible before, then we might be a match because<strong>...<br><br>We don't punish success, we throw money at it.</strong><br><br><br><strong>What we offer...</strong><br><br>1. <strong>NO LIMITS on your income... be paid what you're really worth.</strong><br>2. Commission advances, overrides, and bonuses <strong>paid twice weekly</strong><br>3. Great quality of life.. work from anywhere<br>4 .<strong> Flexible hours / Time Freedom</strong>... you're the boss<br>5 . Fun, supportive, and positive team culture<br>6. A marketing position that doesn't require any selling<br>7. <strong>Proven SYSTEM</strong> that that produced $732 million in commissions &amp; bonuses in 2015<br>8. Thorough training both live and recorded. Personal mentoring.<br>9. Company wide recognition and bonuses for significant achievement<br>10. Company paid celebrations at beautiful destinations for top producers<br>11. Leadership that cares about your success<br>12. <strong>Leveraged and residual income</strong> over time and <strong>ability to earn equity</strong><br><br>Most importantly, <strong>an opportunity to make a real difference</strong> in people's lives while you<br>escape the 9-5 rat race and <strong>take back control of your life.</strong><br><br><br><strong>What we DON'T do...</strong><br><br>1. No cold calling or door-to-door<br>2. No evening or weekend appointments away from home<br>3. No wasting time fighting traffic &amp; No boring office meetings<br>4. No dress code<br>5. No quotas or minimums except those you set for yourself<br>6. No micro-managing<br>7. No corporate favoritism. Promotions based on results, not politics.<br><br><br><strong>Who We Are Looking For...</strong><br><br>Our ideal candidate is a self-motivated winner who is HUNGRY and just looking<br>for <strong>the right opportunity, the right team, and the right SYSTEM.</strong></p><p>We are looking for self-motivated achievers who are looking for the<strong> freedom and flexibility</strong><br>to work on your own schedule from a virtual office in a REAL business of your own, with one<br>of the strongest companies in the industry.<br><br>Must have strong communication and \\&quot;people skills\\&quot;, a great attitude, HIGH INTEGRITY,<br>enjoy helping people, and be willing to follow our proven system and put in the time and<br>work that we all know is required in order to achieve extraordinary success.<br><br>If that's you, then lets talk.<br><br><br><strong>Part time OK</strong> if you can put in at least 12 hours/week minimum in income producing activity<br>plus 3+ hours per week of online training.<br><br><strong>This is a 1099 independent contractor position. Income is based on results. </strong>Life insurance license<br>is required, which is easy to get. OK to start while working on your pre-license education.</p><p><br><br><strong>YOUR NEXT STEP...</strong><br><br>If you would like to learn more, <strong>your NEXT STEP is to watch our intro video.</strong><br><br>If you like what you see on the video, then click the link to request for an initial phone interview<br>to get your questions answered and to see if we're a match.<br><br><br><strong>TO WATCH THE VIDEO...</strong></p><ol><li>Click the green 'APPLY NOW' button on the lower right side of this page</li><li>Fill in the brief info form and click SUBMIT</li><li>On the next page, click the link to get to our website with the video</li></ol><p><br>We look forward to meeting you on the phone very soon if you would like to discuss the possibilities.<br><br><br>DOUG JONES<br>Senior Vice President</p><p> </p><p>P.S. <strong>As you watch the video, take notes and jot down your questions,</strong> then click the NEXT<br> button below the video to request and initial phone interview so we can get them answered<br> for you and see if we are a match.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "jDd2v2HKRWiGnRBB39y9xQ",
    "url": "https://remote.co/job/international-finance-associate/",
    "title": "International Finance Associate",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Shield GEO",
      "sameAs": "https://shieldgeo.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 14, 2019 4:35:52 PM",
    "validThrough": "Aug 21, 2019 4:35:52 PM",
    "crawled": "Aug 14, 2019 5:07:19 PM",
    "content": "<h3>International Finance Associate at <span>Shield GEO</span></h3><div><span><i></i> Remote</span>         | <span> International </span></div><div>            <ul><li><strong>Remote Worldwide</strong></li><li><strong>Full-Time</strong></li><li><strong>Finance</strong></li></ul><p><strong>Finance Associate</strong></p><p>Are you passionate about International Business, looking for flexibility in your career and craving creative freedom?</p><p>Then come join our team! We are looking for team-oriented, resourceful and self-motivated candidates.</p><p><strong>Job Purpose: Finance Associate</strong></p><p>Shield GEO provides outsourced employment and payroll for hundreds of employees in over 60 countries. Our Finance team is the engine that makes sure all our GEO employees get paid on time every month. They create invoices, process payments, generate payslips and resolve issues. The team collaborates closely with colleagues in Global Mobility, Subject Matter Experts and Implementation to ensure our clients have a great experience.</p><p>This is an administration heavy role as you’ll be creating many invoices and payslips every month. You’ll also be helping our internal teams with any questions they may have around international tax, payroll and finance. You’ll have plenty of support from our operational teams, systems and technology platform.</p><p><strong>You will have the opportunity to work remotely and with flexible hours.</strong>&nbsp;You’ll also have the opportunity to advance your career in a young, growing company.</p><p><strong>Working with Shield</strong></p><p>If you are excited by the thought of playing an active role in a company that provides opportunities to create and innovate, you’re at the right place.</p><p>We’re a remote-friendly company with employees all around the world. We don’t want to be limited by location and are open to hiring anyone from anywhere as long as it’s a great fit for us both. Before we get to know you, you might like to get an idea of who we are so you can decide if you want to be a part of what we’re about.</p><p>Every person is unique. At Shield GEO, we encourage an inclusive culture that embraces each individual’s differences. We believe that diversity of thought and experience is vital to generating creative ideas, developing effective strategies and making better decisions.</p><p>When hiring we do not discriminate by any unlawful means including, but not limited to, race, color, religion, gender, gender identity or expression, sexual orientation, national origin, disability, age or veteran status.</p><p><strong>Do you share our values?</strong></p><p>Our 4 values are integral to who we are. Our company culture is constantly evolving, every person who joins us adds something unique to our culture. But our values are shared by all Shield GEO employees. Do these values resonate with you?</p><p><strong>Grow</strong></p><p>We believe that personal growth and company growth go hand in hand. We look to foster our own growth and help grow the company. Every day is an opportunity to face a new challenge and get a little better. In our world of international employment it is impossible to know all the answers. Instead of trying to know everything, we focus on knowing how to solve problems. When mistakes happen we know it’s all part of the learning curve and we seek feedback to help us improve. We keep an eye on the big picture so we can identify improvements to processes and systems. As the problems become larger and more complex, it means that we’ll need more flexible and agile minds to come up with solutions.</p><p><strong>Own It</strong></p><p>We are self-motivated and love to see tasks to completion. Our managers and teammates are often in different time zones, and that’s ok! We aren’t afraid to step up when things get a little tough. We don’t like to micro-manage or&nbsp;<strong>be</strong>&nbsp;micromanaged. We trust our teammates to carry out their part of the process. We are responsible for our own workload and making sure we get our most important things done each day. If we get stuck we proactively seek help. And we show our reliability and accountability by keeping our systems updated. This also means our results can speak for themselves.</p><p><strong>Do The Right Thing</strong></p><p>Our clients trust us with compliance on their most important asset – their employees. This is a big responsibility! Doing the right thing means often times we choose a harder path and see it through to the end. It means we are open with our colleagues, clients and suppliers about bad news just the same as we share good news. And sometimes doing the right thing means we have to make decisions that will upset the very person we are trying to help. It’s a high standard but we stand by this very strongly. Doing the right thing also means considering how our actions impact those around us.</p><p><strong>Be Human</strong></p><p>We are a service business and helping people is at the core of everything we do. We pride ourselves on how we interact with colleagues, service providers and clients. We recognize that in all areas we’re dealing with real humans. We know that working remotely and dealing with such a mix of people around the world is challenging. We know that if we are having trouble understanding someone, they are also struggling to understand us. Empathy is fundamental to helping us discover what people mean and how they are feeling. To avoid misinterpretation we assume best intent in others. Because so much of our communication is written and asynchronous, we default to&nbsp;<em>over-communication</em>. This means we give extra details because we don’t leave people guessing. We make sure our words are clear and easy to understand. And we are kind to our fellow humans.</p><p><strong>Your Background</strong></p><ul><li>At least two to three years’ experience within Finance</li><li>International tax or payroll experience strongly preferred. It will be helpful if you are familiar with concepts like employer social security, foreign exchange, gross ups and expense reimbursements.</li><li>Comfortable with technology. We are mostly remote and that means we rely on a bunch of applications to keep connected. That means video conferences (Zoom), chat and messaging (Slack, Skype and Salesforce Chatter), shared documents (Dropbox). You’ll likely be working by yourself during parts of your day without access to tech support.</li><li>Experience with Salesforce or Xero is helpful but not essential.</li></ul><p><strong>Essential Characteristics of this role</strong></p><ul><li>Excellent written and verbal communication skills and the ability to absorb information quickly.</li><li>Able to prioritize effectively and work autonomously while coordinating with an international team.</li><li>Exceptional attention to detail and maintaining accurate records.</li><li>Ideally located between UTC+3 and UTC+8 time zones</li><li>Some flexibility in working hours. We discourage overtime work and you will only be expected to work a standard number of hours each week. But we have clients and colleagues all over the world so sometimes you will need to be on calls in the morning or evening.</li><li>Request invoices from our providers located around the world</li><li>Create client invoices to cover the monthly payroll cost for each GEO employee</li><li>Request payslips from our providers around the work</li><li>Record and check payroll outputs within our systems to share with our clients</li><li>Record incoming payments and setup ongoing payments</li><li>Help to manage the team Accounts mailbox</li><li>Keep an accurate record of information in our internal systems by the process due dates</li><li>Check invoices for accuracy before sending to your clients</li></ul><p><strong>Responsibilities</strong></p><p>Payroll and Invoicing Process Improvement and Projects</p><p>Everyone at Shield gets involved in projects. These can range from a simple creation of a template to speed up a task through to creating complex automations which eliminate hours of admin work.</p><ul><li>Assist the project team and other internal resources with recommending and implementing process and system improvements.</li><li>Act as a superuser in project teams</li><li>Help train other users when rolling out project solutions</li><li>Keep internal systems updated with progress on all core tasks</li><li>Weekly summary reporting</li><li>Ensure accuracy of all invoicing, payslip and payment data is entered in our internal CRM</li><li>Reporting</li></ul>        </div><div>        <a href='https://shield-geo.breezy.hr/p/140fe3fe0223?source=remote.co' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ojJbdA9EQ_SIR2-HBFjzbw",
    "url": "http://workinstartups.com/job-board/job/83372/business-support-at-followapp/",
    "title": "Business Support",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "FollowApp",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 13, 2019 2:09:30 PM",
    "validThrough": "Aug 20, 2019 2:09:30 PM",
    "crawled": "Aug 13, 2019 4:06:31 PM",
    "content": "<h4><strong>Job Description</strong></h4><br /><p><strong>Job Listing</strong></p><br /><p>Business Support for an expanding healthcare technology startup (English &amp; Spanish required)&nbsp;</p><br /><p><strong>About FollowApp Care</strong></p><br /><p>We are a healthcare technology company specialising in AI-driven patient communication. Our current customers are healthcare providers in the Australian, American, and European regions.</p><br /><p>We are a small team based in London with some remote team members currently. We have plans to expand very quickly with the help of several more contracts underway and plans for investment.</p><br /><p><strong>The Position:</strong></p><br /><p>This is a great role for those who are looking to gain experience in a variety of business functions across a technology startup. You will be mainly working alongside and supporting the Sales, Customer Success, and Product Teams.&nbsp;</p><br /><p><strong>Key Tasks You Will be Involved With Are:</strong></p><br /><ul><br /><li>Working alongside Customer Success, Sales, and Product for client relationship management and setting clients up for long term success&nbsp;</li><br /><li>Engaging in day-to-day communications with clients to ensure successful onboard, uptake and maintenance of our technology with our clients</li><br /><li>Coordination of different internal teams and administrative tasks</li><br /><li>Proactively identifying process improvements</li><br /><li>Strategically leverage customer feedback to influence the product roadmap</li><br /><li>Producing documentation&nbsp;</li><br /><li>Providing training to the users&nbsp;</li><br /><li>Any ad hoc tasks from Sales, Customer Success, and Product</li><br /></ul><br /><p><strong>Ideally You Are A Person Who:</strong></p><br /><ul><br /><li>Has a bachelor degree</li><br /><li>Has proven experience in communication with clients (excellent verbal and written communication skills)</li><br /><li>Is ambitious and motivated&nbsp;</li><br /><li>Enjoys working in a startup environment</li><br /><li>Is tech-savvy and quick at understanding our technology, particularly healthcare technology</li><br /><li>Creative, resourceful, detail-oriented and highly organised (problem solver)</li><br /><li>Self-starter who thrives under ambiguity in a fast-paced, deadline oriented startup environment</li><br /><li>Has experience in PPT and documentation design</li><br /></ul><br /><p><strong>The Location:</strong></p><br /><p>Located conveniently in East Central London, right by Liverpool St station, we are in a co-working space (WeWork) where unlimited coffees, biscuits, and beer are just some of the perks!&nbsp;</p><br /><p>This will be a position available from September, 2019.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "aP3_4Z-vQQKbh0-daQu7-Q",
    "url": "https://jobmote.com/job/60469/telecommute-insurance-national-accounts-director/",
    "title": "Telecommute insurance national accounts director",
    "tags": [
      "DBG:surround``3W(open, telecommut)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "VirtualVocations",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 12, 2019 10:41:21 AM",
    "validThrough": "Aug 15, 2019 10:41:21 AM",
    "crawled": "Aug 12, 2019 3:06:24 PM",
    "content": "<div>An insurance company needs applicants for an opening for a Telecommute Insurance National Accounts Director. Must be able to: Develop, contract, and execute</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "qIf7vw4SRZeadfRveiIFfg",
    "url": "https://remote.co/job/accountant-6/",
    "title": "Accountant",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Sandbox VR",
      "sameAs": "https://sandboxvr.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 7, 2019 5:24:44 PM",
    "validThrough": "Aug 14, 2019 5:24:44 PM",
    "crawled": "Aug 7, 2019 6:23:51 PM",
    "content": "<h3>Accountant at <span>Sandbox VR</span></h3><div><span><i></i> Remote</span>        </div><div>            <p><strong>REMOTE</strong></p><p><strong>EXECUTIVE FINANCE</strong></p><p><strong>FULL TIME</strong></p><p><strong>Who are we?</strong></p><p>We’re Sandbox VR, and we’re the most advanced virtual reality experience in the world. Inside our rooms, we take you on thrilling adventures and transform you into new characters. Our experience is like the movies, except you’re actually with your friends inside the movie.</p><p>Our team is comprised of successful start-up veterans with deep experience in VR, gaming, technology and hospitality. We’re funded by leading global tech investors including Andreessen Horowitz and Alibaba.</p><p>Since we launched in 2017, we’re now live in 6 locations and 4 countries around the world (4.5 stars on Yelp, and the #1 Activity in Hong Kong and Singapore on TripAdvisor), and we’re quickly expanding.</p><p><strong>What you’ll be doing?</strong></p><ul><li>Prepare month-end journal entries and account reconciliations in areas such as cash, prepaids, and various expenses.</li><li>Process AP invoices and communicate appropriately with vendors.</li><li>Assist with monthly P/L reporting and variance explanations.</li><li>Assist in analyzing and interpreting accounting information for operational and budgetary purposes.</li><li>Provide support for external audits.</li><li>Assist in Ad-Hoc projects such as system integrations and developing financial processes to support a fast-paced growing company.</li><li>Developing technical accounting, NetSuite, and Excel skills to maintain processes and create efficiencies within responsibilities.</li></ul><p><strong>Who are we looking for?</strong></p><ul><li><strong>Bachelor’s or equivalent degree from an accredited university in accounting.</strong></li><li>1-2 years of applicable accounting experience required.</li><li>Solid understanding of accounting principles and concepts based on US GAAP.</li><li>Proficient in Excel/Google Sheets.</li><li>Strong communication skills to successfully work as a team in a remote setting.</li><li>A willingness to learn and take initiative.</li><li>Ability to manage and prioritize multiple tasks with emphasis on meeting deadlines.</li><li>Ability to work independently, effectively analyze and solve problems.</li><li>CPA or pursuing CPA preferred.</li></ul><p><strong>Benefits</strong></p><ul><li>Medical, dental and vision</li><li>Disability and life insurance</li><li>401(k)</li></ul>        </div><div>        <a href='https://jobs.lever.co/sandboxvr/4648dfb7-0aff-4337-8b8a-8c9a224008b5' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "y3t2wvWQREaA6u32OUTafQ",
    "url": "https://remote.co/job/operations-coordinator-finance-accounting/",
    "title": "Operations Coordinator- Finance-Accounting",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Digital Reach",
      "sameAs": "https://www.digitalreachagency.com/"
    },
    "salary": {
      "currency": "USD",
      "minValue": 40000,
      "maxValue": 45000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 40k - 45k /Year"
    },
    "employmentType": "UNSET",
    "published": "Aug 6, 2019 4:44:29 PM",
    "validThrough": "Aug 13, 2019 4:44:29 PM",
    "crawled": "Aug 6, 2019 5:07:19 PM",
    "content": "<h3>Operations Coordinator- Finance-Accounting at <span>Digital Reach</span></h3><div><span><i></i> Remote</span>        </div><div>            <p><strong>Job Description:</strong></p><p>Digital Reach is looking for an operations coordinator. You will be working with the operations manager to maintain internal company operations. This position is multi faceted and will require someone who can handle varying projects and responsibilities happening at the same time. This position will have a stronger focus on the Finance/Accounting side of operations.</p><p><strong>Responsibilities:</strong></p><ul><li>Maintaining and continually updating Sheets with important company financial data</li><li>Setting up and sending invoices to clients</li><li>Sending payment to service providers</li><li>Maintenance of monthly expense data</li><li>Integrating our Quickbooks account with other programs to automate our systems</li><li>Following up on and retrieving overdue invoices</li><li>Data entry in Salesforce, Salesloft, Constant Contact, and more.</li><li>Assisting team members throughout the company with operations related requests</li><li>Working with customers to set up new billing accounts or to update old accounts</li><li>Setting up SOWs for Clients (Statements of work)</li><li>Perform extensive quarterly audits to make sure all bookkeeping activities have been done correctly</li><li>Various sales support tasks</li><li>Assist operations manager and head of operations with various tasks and projects</li><li>Evaluate new technologies and add-on applications to improve and optimize operations team performance.</li><li>And more</li></ul><p><strong>Requirements:</strong></p><ul><li>Strong analytical skills (including mastery of Microsoft Excel and Google Sheets)</li><li>2+ yrs work experience in finance, accounting or similar field</li><li>2+ yrs experience in operations</li><li>2+ yrs experience using and integrating systems with QuickBooks</li><li><strong>Bachelors degree in business management, finance, accounting or a related field </strong></li><li>Ability to manage multiple projects at the same time in a fast-paced environment.</li><li>Technically capable, excellent communicator, and a desire to improve processes.</li><li><strong>Desire/ability to work remotely</strong></li><li>Self starter, able to get things done without being asked</li></ul><p><strong>Pluses:</strong></p><ul><li><strong>Experience working remotely</strong></li><li>Experience with B2B companies</li><li>Experience with SaaS companies</li><li>Experience in Digital Marketing (SEM, SEO, Marketing Automation, Web Development/ Design)</li></ul><p><strong>Position:</strong> Full Time</p><p><strong>Location: 100% Remote</strong></p><p><strong>Benefits:</strong> Health Insurance, Dental, Vision, 401k, Bonuses, Generous PTO, 100% Remote</p><p><strong>Compensation:</strong> $40k-$45k/yr</p>        </div><div>        <a href='https://www.digitalreachagency.com/careers/' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Rgaw9yJkQra4beIOCO_0JA",
    "url": "https://jobmote.com/job/55072/14k-per-month-work-at-home-financial-services/",
    "title": "$14K+ per month - Work At Home - Financial Services",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Google",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2019 10:22:31 AM",
    "validThrough": "Aug 4, 2019 10:22:31 AM",
    "crawled": "Aug 1, 2019 3:06:25 PM",
    "content": "<div>Salary 100% Commission, <p><strong>This a realistic 6-figure plus career opportunity</strong> for a highly motivated individual who is willing to follow a <strong>PROVEN SYSTEM</strong> and put in the work<strong>. </strong><br><br>Our parent organization paid out <strong>$985 Million </strong>in commissions in 2016,<strong> </strong>and they intend to<strong> </strong>pay out <strong>$4 Billion in 2020</strong>. <br><br>We are taking t<strong>he most successful business model </strong>in the Financial Services industry into a completely virtual environment with solid backing from one of the strongest and best known companies in America.<br><br><br><strong>We are seeking experienced sales &amp; recruiting pros as well as sales trainees.</strong><br><br>You bring the skills, attitudes, and habits of success... We teach you the details. OK to start Part Time.</p><p><br>----------------------------------------------------------------------------------------------------------------------------------------<br>If you would like to learn more, <strong>your NEXT STEP is to watch our intro video.</strong><br><br>If you like what you see on the video, then click the link to request for an initial phone interview<br>to get your questions answered and to see if we're a match.</p><p>---------------------------------------------------------------------------------------------------------------------------------------------</p><p><br><strong>WORK FROM ANYWHERE... </strong>We do everything online: Live training 4 times weekly via livestream<br>presentations, recorded training 24/7 on video, and our client presentations are done via private web conferences<br>using screen sharing technology.<br><br><strong>DO BUSINESS NATIONWIDE</strong> ... This virtual model eliminates all the wasted drive time and<br>no more boring office meetings... you can get a lot more done in a lot less time and you can expand<br>your territory to the entire United States!<br><br><br>Our system enables individuals new to the industry to earn great income as they learn the business,<br>and it enables seasoned industry professionals to expand their business from their local home town<br>to the entire country, and <strong>build a nationwide \\&quot;virtual agency\\&quot;.</strong><br><br><br>This is a unique, lucrative, dynamic opportunity to<strong> take back control of your life and of your financial destiny.</strong><br><br>Set your own hours. <strong>We pay for RESULTS, not attendance</strong>... so if you're looking for a job,<br>this is not for you...but if you're looking for a <strong>SYSTEM </strong>that can allow you to get to a level of income<br>that just has not been possible before, then we might be a match because<strong>...<br><br>We don't punish success, we throw money at it.</strong><br><br><br><strong>What we offer...</strong><br><br>1. <strong>NO LIMITS on your income... be paid what you're really worth.</strong><br>2. Commission advances, overrides, and bonuses <strong>paid twice weekly</strong><br>3. Great quality of life.. work from anywhere<br>4 .<strong> Flexible hours / Time Freedom</strong>... you're the boss<br>5 . Fun, supportive, and positive team culture<br>6. A marketing position that doesn't require any selling<br>7. <strong>Proven SYSTEM</strong> that that produced $732 million in commissions &amp; bonuses in 2015<br>8. Thorough training both live and recorded. Personal mentoring.<br>9. Company wide recognition and bonuses for significant achievement<br>10. Company paid celebrations at beautiful destinations for top producers<br>11. Leadership that cares about your success<br>12. <strong>Leveraged and residual income</strong> over time and <strong>ability to earn equity</strong><br><br>Most importantly, <strong>an opportunity to make a real difference</strong> in people's lives while you<br>escape the 9-5 rat race and <strong>take back control of your life.</strong><br><br><br><strong>What we DON'T do...</strong><br><br>1. No cold calling or door-to-door<br>2. No evening or weekend appointments away from home<br>3. No wasting time fighting traffic &amp; No boring office meetings<br>4. No dress code<br>5. No quotas or minimums except those you set for yourself<br>6. No micro-managing<br>7. No corporate favoritism. Promotions based on results, not politics.<br><br><br><strong>Who We Are Looking For...</strong><br><br>Our ideal candidate is a self-motivated winner who is HUNGRY and just looking<br>for <strong>the right opportunity, the right team, and the right SYSTEM.</strong></p><p>We are looking for self-motivated achievers who are looking for the<strong> freedom and flexibility</strong><br>to work on your own schedule from a virtual office in a REAL business of your own, with one<br>of the strongest companies in the industry.<br><br>Must have strong communication and \\&quot;people skills\\&quot;, a great attitude, HIGH INTEGRITY,<br>enjoy helping people, and be willing to follow our proven system and put in the time and<br>work that we all know is required in order to achieve extraordinary success.<br><br>If that's you, then lets talk.<br><br><br><strong>Part time OK</strong> if you can put in at least 12 hours/week minimum in income producing activity<br>plus 3+ hours per week of online training.<br><br><strong>This is a 1099 independent contractor position. Income is based on results. </strong>Life insurance license<br>is required, which is easy to get. OK to start while working on your pre-license education.</p><p><br><br><strong>YOUR NEXT STEP...</strong><br><br>If you would like to learn more, <strong>your NEXT STEP is to watch our intro video.</strong><br><br>If you like what you see on the video, then click the link to request for an initial phone interview<br>to get your questions answered and to see if we're a match.<br><br><br><strong>TO WATCH THE VIDEO...</strong></p><ol><li>Click the green 'APPLY NOW' button on the lower right side of this page</li><li>Fill in the brief info form and click SUBMIT</li><li>On the next page, click the link to get to our website with the video</li></ol><p><br>We look forward to meeting you on the phone very soon if you would like to discuss the possibilities.<br><br><br>DOUG JONES<br>Senior Vice President</p><p> </p><p>P.S. <strong>As you watch the video, take notes and jot down your questions,</strong> then click the NEXT<br> button below the video to request and initial phone interview so we can get them answered<br> for you and see if we are a match.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "b89rmHVySRGog5tTRh8Ipg",
    "url": "https://remote.co/job/senior-accountant-10/",
    "title": "Senior Accountant",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``avail 8W 2N( OR(core,busi), hour)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Fix My Cash Flow",
      "sameAs": "http://www.fixmycashflow.com/"
    },
    "salary": {
      "currency": "USD",
      "minValue": 35,
      "maxValue": 45,
      "info": "",
      "unit": "HOUR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 35 - 45 /Hour"
    },
    "employmentType": "UNSET",
    "published": "Jul 30, 2019 7:30:21 PM",
    "validThrough": "Aug 6, 2019 7:30:21 PM",
    "crawled": "Jul 30, 2019 7:32:15 PM",
    "content": "<h3>Senior Accountant at <span>Fix My Cash Flow</span></h3><div><span><i></i> Remote</span>         | <span> Part-time </span></div><div>            <p><strong>Experience / Skills</strong></p><ul><li><strong>Bachelor’s degree in Accounting</strong></li><li>CPA license (preferred but not required)</li><li>Big 4 accounting experience (preferred by not required)</li><li>At least five (5) years of full-time accounting experience at a public accounting firm</li><li>At least five (5) years of experience using QuickBooks Online (QBO) to prepare financial statements (QuickBooks Desktop skills are NOT a replacement for this requirement)</li><li>Certified QuickBooks Online Advance ProAdvisor (must obtain this certification within the first 90 days of employment)</li><li>Experience complying with complex invoice submission instructions required by many Fortune 500 companies</li><li>Intermediate/Advanced Microsoft Excel skills</li></ul><p><strong>Most or all of the items below describe you . . .</strong></p><ul><li>You’re super detail-oriented.</li><li>You’re upbeat and outgoing. People can hear you smile through the phone. I’m not like that. So, I could really use your help here.</li><li>You’re open-minded, and you accept all humans, e.g., LGBTQ people, Muslims, Trump supporters, immigrants, vegans, and folks who prefer the toilet paper rolled under instead of over, etcetera, etcetera. That’s, of course, assuming the aforementioned individuals aren’t also terrible.</li><li>You constantly look for ways to make things better or more efficient.</li><li>You’re masterful at turning ideas into reality.</li><li>You’re excited to work for an organization owned by an entrepreneur who’s still figuring it out.</li><li>You have exceptional digital organizational skills.</li><li>You care about putting forth high-quality work, e.g., writing in complete sentences, using punctuation, proofreading emails, and double-checking work for accuracy and completeness.</li><li>You’re experienced working in a virtual environment and using modern cloud-based applications.</li><li>You’re able to follow written instructions and offer recommendations for improvement.</li><li>You’re comfortable working in a fast-paced, deadline driven environment.</li><li>You’re willing to undergo a 50-state criminal background <strong>and</strong> credit report check.</li></ul><p><strong>Responsibilities (not limited to):</strong></p><p><strong>Bookkeeping</strong></p><ul><li>Oversee the day-to-day accounting operations and ensure work is completed on a timely basis.</li><li>Ensure all financial transactions are recorded in QBO.</li><li>Organize documents in Dropbox.com or other online cloud storage system.</li><li>Reconcile bank and credit card accounts in QBO.</li><li>Record adjusting journal entries in QBO as needed.</li><li>Prepare weekly and monthly reporting package.</li><li>Document financial processes and procedures.</li><li>Identify inefficiencies in financial practices and recommend improvements.</li><li>Manage the month-end closing process, ensuring its timely completion.</li></ul><p><strong>Accounts Receivable</strong></p><ul><li>Prepare customer invoices using QBO.</li><li>Proactively follow-up on invoices BEFORE they’re due.</li><li>Follow-up on past due invoices on a semi-weekly basis.</li><li>Create and update standard operating procedures of the firm’s accounts receivable process.</li><li>Create and maintain customer records including contact info, payment term info, and specific invoice submission requirements in QBO.</li><li>Comply with customer invoice submission requirements to ensure firm clients are paid on time, e.g., customizing invoices to adhere to purchase order guidelines, registering on customers’ new supplier portals, completing customer-required ACH setup forms, etc.</li><li>Maintain detailed notes of customer communications regarding invoice payment status in AR Collect.</li><li>Record customer payments and credit memos in QBO.</li><li>Assist in month and year-end closing process.</li><li>Attend weekly meetings to go over outstanding invoices and collection efforts.</li></ul><p><strong>Accounts Payable</strong></p><ul><li>Enter vendor bills via Bill.com</li><li>Ensure vendors provide their W-9 prior to issuing their first payment.</li><li>Comply with vendor bill payment policies and procedures and update as necessary.</li><li>Prepare weekly Unpaid Vendor Bills report.</li><li>Create and update standard operating procedures of the firm’s accounts payable process.</li><li>Categorize and tag corporate credit card purchases in Expensify.</li><li>Ensure timely completion of employee expense reports submitted via Expensify.</li><li>Prepare 1099s at year-end.</li><li>Monitor checking account balance to ensure firm clients have the funds they need to pay their bills for at least 30 days.</li></ul><p><strong>Hours:</strong></p><ul><li><strong>10 to 20 hours per week, depending on work volume.</strong></li><li>Required to work and be available for phone calls during normal business hours, i.e., 9 am to 5 pm ET.</li></ul><p><strong>Compensation + Benefits:</strong></p><ul><li>$35 to $45 per hour depending on experience and qualifications</li><li>Up to two weeks of paid vacation</li><li><strong>Option to telecommute</strong></li><li>Paid time while you receive real-world training led by industry experts</li></ul>        </div><div>        <a href='https://fixmycashflow.com/senior-accountant/' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "e4yxHKf_Sf-s0Ek2IzWqxw",
    "url": "https://remote.co/job/financial-budget-analyst/",
    "title": "Financial Budget Analyst",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "GovernmentCIO",
      "sameAs": "https://www.governmentcio.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 25, 2019 5:01:22 PM",
    "validThrough": "Aug 1, 2019 5:01:22 PM",
    "crawled": "Jul 25, 2019 5:08:16 PM",
    "content": "<h3>Financial Budget Analyst at <span>GovernmentCIO</span></h3>\n<div>\n <span><i></i> Remote</span> \n</div>\n<div> \n <ul>\n  <li><strong>Job Locations: US-Remote</strong></li>\n  <li><strong>Job ID:</strong> 2019-2045</li>\n  <li><strong>Category:</strong> Accounting/Finance</li>\n </ul>\n <p><strong>Overview</strong></p>\n <p>GCIO is seeking an experienced Senior Financial Analyst to perform financial analysis, budgeting, forecasting and monthly financial reporting for the Delivery operations of the business.</p>\n <p><strong>Responsibilities</strong></p>\n <p><strong>The Analyst will:</strong></p>\n <ul>\n  <li>Prepares financial forecasting and budgeting for all delivery programs</li>\n  <li>Tracks actual performance to budget and forecast</li>\n  <li>Creates, maintains and updates financial databases and spreadsheets</li>\n  <li>Works with the project managers to analyze and improve margins</li>\n  <li>Analyzes contracts’ projected staff hours, contract totals, revenues, and profit totals</li>\n  <li>Maintains appropriate records and documentation</li>\n  <li>Supports program level requirements</li>\n  <li>Train project managers on how to read and evaluate Project Summary Reports</li>\n  <li>Interface with the projects to support budgeting and training requirements</li>\n  <li>Ensures that programs are charging cost in accordance with FAR</li>\n  <li>Other tasks as assigned</li>\n </ul>\n <p><strong>Qualifications</strong></p>\n <p><strong>Skills Requirements:</strong></p>\n <ul>\n  <li>Finance or a related business discipline, or the equivalent combination of education, professional training, or work experience</li>\n  <li>Minimum of 5-8 years of related finance or business analysis experience in the Government contracting industry</li>\n  <li>Accuracy, detail oriented, organized and efficient</li>\n  <li>Strong communications skills; ability to work at the highest level of confidentiality with a high degree of accuracy and integrity</li>\n  <li>Analytical/problem solving – ability to identify, analyze and resolve problems in a timely manner</li>\n  <li>Ability to prioritize and plan work activities</li>\n  <li>Intermediate-to-Expert level Excel Skills (vlookups, networkdays, sumif, pivot tables)</li>\n  <li>Ability to transform Excel spreadsheets into functional Access databases/forms</li>\n  <li>Ability to acquire public trust level security clearance</li>\n  <li>Understanding of VA/federal budgets preferred</li>\n  <li>Experience interacting with executive level and senior leadership positions, especially communicating complex financial analysis to executive leadership</li>\n  <li>Tools &amp; Software Experience: Expert MS Excel</li>\n  <li><strong>Education Requirements: Bachelor’s in Technical Discipline or substitute 8 additional years experience</strong></li>\n  <li><strong>Years of Experienced Required:</strong>&nbsp;10</li>\n </ul> \n</div>\n<div> \n <a href='https://careers-governmentcio.icims.com/jobs/2045/financial-budget-analyst/job' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "mvUfqM1-R3qK6gTKebt6cw",
    "url": "https://remote.co/job/senior-accountant-consolidation/",
    "title": "Senior Accountant, Consolidation",
    "tags": [
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 3W OR(time,timezon)",
      "DBG:surround``spread W OR(out,across) 3W OR(time W zone,timezon)",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/finacc",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Elastic.co",
      "sameAs": "https://www.elastic.co/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 22, 2019 6:17:11 PM",
    "validThrough": "Jul 29, 2019 6:17:11 PM",
    "crawled": "Jul 22, 2019 6:24:05 PM",
    "content": "<h3>Senior Accountant, Consolidation at <span>Elastic.co</span></h3>\n<div>\n <span><i></i> Remote</span> \n</div>\n<div> \n <p><strong>Location:</strong> <strong>Distributed, AMER</strong></p>\n <p>At Elastic, we have a simple goal: to solve the world’s data problems with products that delight and inspire. As the company behind the popular open source projects Elasticsearch, Kibana, Logstash, and Beats we help people around the world do great things with their data. From stock quotes to Twitter streams, Apache logs to WordPress blogs, our products are extending what’s possible with data, delivering on the promise that good things come from connecting the dots. The Elastic family unites employees across 30+ countries into one coherent team, while the broader community spans across over 100 countries.</p>\n <p>We are seeking a Senior Accountant, Consolidation to join our rapidly growing accounting team in a truly global financial environment. <strong>This role will be distributed in the USA or Canada and we are focused on those currently located in PST or MST time zones.</strong></p>\n <p><strong>What You Will Be Doing:</strong></p>\n <p>You will play an influential role with inter-company loan agreements and transfer pricing as well as developing internal accounting controls and policies as they relate to consolidation for the US. As the first Senior Accountant on the Consolidation team, you will be the foundational member of this team and the primary business partner for tax, equity, and AP teams.</p>\n <p>This Senior Accountant will interact with a broad cross-section of accounting, from treasury, tax, and stock to AP, SEC reporting, and GL accounting, as well as legal and HR. Over time, you will have the flexibility and openness to scale to different opportunities as they arise within the department to broaden your overall skillset.</p>\n <p><strong>In addition, you will:</strong></p>\n <ul>\n  <li>Prepare and participate in month-end close activities to ensure timely close of the company’s financials</li>\n  <li>Prepare and upload cash, intercompany, and equity, as well as accrue expense on a monthly basis</li>\n  <li>Prepare analysis for quarter-end for accounts receivable and accounts payable journal entries</li>\n  <li>Complete quarterly balance sheet fluctuation analysis for the Financial Reporting team</li>\n  <li>Craft and ideate on process improvements</li>\n  <li>Help review/code AP data, as needed</li>\n </ul>\n <p><strong>What You Bring Along:</strong></p>\n <p>You have formal accounting training, public company experience with 5+ inter-companies, and hands-on experience with US GAAP (mandatories).</p>\n <p>When asked what your favorite program is, you’d probably say Excel.</p>\n <p>We’re small and growing, so an “all hands-on deck mentality” is required and a sense of humor appreciated. We all jump in to help when deadlines are tight, regardless of title, and, yes, we strive to have fun together.</p>\n <p><strong>More about you:</strong></p>\n <ul>\n  <li>Understanding of billing and/or transfer pricing (mandatory)</li>\n  <li>CPA preferred, but not required</li>\n  <li>IFRS preferred, but not required</li>\n  <li>Strong English communication skills</li>\n  <li>Problem-solving</li>\n  <li>Meticulous about the details</li>\n  <li>Prioritization skills</li>\n  <li>Process optimization experience</li>\n  <li>Netsuite ideal, but another big ERP totally fine</li>\n  <li>Willing to help with AP and stock teams</li>\n </ul>\n <p><strong>Additional Information:</strong></p>\n <ul>\n  <li>Competitive pay based on the work you do here and not your previous salary</li>\n  <li>Equity</li>\n  <li>Global minimum of 16 weeks parental leave (moms &amp; dads)</li>\n  <li>Generous vacation time and one week of volunteer time off</li>\n  <li>An environment in which you can balance great work with a great life</li>\n  <li>Your age is only a number. It doesn’t matter if you’re just out of college or your children are; we need you for what you can do</li>\n  <li><strong>Distributed-first company with Elasticians in over 30 countries, spread across 18 time zones, and speaking over 30 languages!</strong></li>\n </ul>\n <p>#LI-KE1</p>\n <p>Elastic is an Equal Employment employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status or any other basis protected by federal, state or local law, ordinance or regulation. Elastic also makes reasonable accommodations for disabled employees consistent with applicable law.</p> \n</div>\n<div> \n <a href='https://boards.greenhouse.io/elastic/jobs/1659652' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "a-nDXSyeS3qQYQnqbf7P3g",
    "url": "https://jobmote.com/job/51561/accounts-receivable-resolution-analyst-wfh/",
    "title": "Accounts Receivable Resolution Analyst WFH",
    "tags": [
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Indiana State Job Bank",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 22, 2019 11:55:02 AM",
    "validThrough": "Jul 25, 2019 11:55:02 AM",
    "crawled": "Jul 22, 2019 4:06:25 PM",
    "content": "<div>\n DESCRIPTION SHIFT: Work From HomeSCHEDULE: Full-time ACCOUNTS RECEIVABLE RESOLUTION ANALYST WFH Parallon believes that organizations that continuously learn and improve will thrive. That's why after more than a decade we remain dedicated to helping hospitals and hospital systems operate knowledgeably, intelligently, effectively and efficiently in the rapidly evolving healthcare marketplace, today and in the future. As one of the healthcare industry's leading providers of business and operational services, Parallon is uniquely equipped to provide a broad spectrum of customized revenue cycle services. JOB SUMMARY: The Accounts Receivable Resolutions Analyst (Internal Title: Collections Analyst) is responsible for working reconciliations, processing change requests, working reports, working collection pools as assigned and assisting the Collectors as needed. THIS IS A FULL-TIME WORK FROM HOME POSITION, MONDAY THRU FRIDAY FROM 8:30AM TO 5:00PM. DUTIES (INCLUDED BUT NOT LIMITED TO): Perform Artiva reconciliation and ensure issues are resolved Process changes timely as requested Balance AR daily Work reports as assigned Support Collections work Work with patients and guarantors resolve payer requests and discrepancies to promptly resolve pending claims EDUCATION: * High school diploma or GED required EXPERIENCE: * Minimum 1 year related experience required, preferably in healthcare We offer training support, competitive salary and excellent benefits to include several insurance package options for Medical, Dental and Vision; Paid Time Off for vacation, sick leave and holidays, Employer-paid Short Term Disability, Company matching 401K and more!Parallon is an Equal Opportunity Employer (EOE), minority/ female/ veteran/ disabled, offering a great work environment, challenging career opportunities, and competitive compensation. #ParallonBCOMEmployer's Job# 08648-164###-####7Please visit job URL for more information about this opening and to view EOE statement.\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "R9qQvJ-3RuixG8s0dno0Zw",
    "url": "http://workinstartups.com/job-board/job/82518/cfofinancial-controller-european-and-uk-e-commerce-remote-at-samserra/",
    "title": "CFO/Financial Controller - European and UK E-commerce ( Remote)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Samserra",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 18, 2019 5:51:30 PM",
    "validThrough": "Jul 25, 2019 5:51:30 PM",
    "crawled": "Jul 19, 2019 10:06:33 AM",
    "content": "Hi, \n<br>We are looking for a part time CFO for our fast growing e-commerce Company. The company is UK based but trading direct to consumers all over Europe. As such we are looking for an experience CFO to join our dynamic remote team.\n<br>\n<br>YOUR ROLE\n<br>\n<br>- Budgeting, forecast\n<br>- Cashflow management - Maintain appropriate investment and cash balances across the company\n<br>- Financing and refinancing / Debt restructuring\n<br>- Financial KPI - collection, implementation and ongoing reporting\n<br>- Other KPI &amp; business performance setup - help set up and reporting\n<br>- Working with Data and IT team to implement reporting and data collection\n<br>- Ensure compliance with all applicable taxes , lead the tax prep and submissions process. \n<br>- Mgt. of Legal/Statutory compliance\n<br>- Supplier &amp; customer invoicing control, payment and management\n<br>- Post Brexit set up and help.\n<br>- Restructure and manage our book keeping processes\n<br>\n<br>You will be working and reporting directly with the CEO in order to achieve the business objectives. Ultimately your role will be to ensure positive cashflow and improvement of the bottom and top line through financial control\n<br>\n<br>On top of the typical CFO skills you should have the following specific knowledge and experience too\n<br>\n<br>- Strong knowledge of European Accounting &amp; legislation\n<br>- UK accounting experience a BIG plus\n<br>- Strong knowledge of XERO\n<br>- Strong knowledge of EU VAT and triangulation and the regulations surrounding that. \n<br>- Accrual accounting focus only - no cash basis accounting possible\n<br>- You have done similar roles with e-commerce and product businesses.\n<br>\n<br>At the beginning this role is for a part time person, which we are expecting to be 20-30h per week.\n<br>As we grow this will evolve to a full time role.\n<br>\n<br>I look forward to seeing your application",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "6leXQvWgQ8SuHjfIN3oLiQ",
    "url": "https://problogger.com/jobs/job/managing-editor-finance-division-remote-friendly/",
    "title": "Managing Editor, Finance Division (Remote Friendly)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Fit Small Business",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 18, 2019 2:00:00 AM",
    "validThrough": "Jul 25, 2019 2:00:00 AM",
    "crawled": "Jul 18, 2019 8:32:22 PM",
    "content": "<h3>Managing Editor, Finance Division (Remote Friendly)</h3>\n<div>\n Company: Fit Small Business\n</div>Location: New York, NY\n<br>Job Type: Full-time\n<div> \n <h5>Description</h5> \n <div> \n  <h4><strong>Your role in a nutshell:</strong></h4>\n  <p><span>The Managing Editor for the Finance Division will be an integral part of building the most comprehensive small business finance portals on the internet. You will directly manage a team of 3-5 editors and work with the General Manager of the Finance Division to manage all editorial operations. The Finance ME will also work closely with the Vice President of Content to set and coordinate editorial standards and policy, and manage workflow from assignment to publication. We cover a wide range of topics, from business financing and accounting to real estate investing and insurance. This is a growing team, and the Managing Editor will play a strong role in recruitment and building our Finance division into a best in class editorial operation.</span></p>\n  <h4>Our mission:<span>To deliver the best answers to people's questions.</span></h4>\n  <h4><strong>Company overview:</strong></h4>\n  <p><span>Recently named to the Inc. 500 list of America’s fastest-growing private companies, Fit Small Business has more than 3 million small business owners and managers reading our content each month. We deliver well-researched, authoritative articles so these owners can make informed decisions to grow businesses that fuel the economy. Our founders have built successful businesses before, and FSB is profitable with no outside funding. Part of the team of 150+ people is in our NYC headquarters, near Grand Central. Others are distributed across the U.S., Canada, and the Philippines.</span></p>\n  <h4><strong>Does this sound like you?</strong></h4>\n  <p><span>The best candidates will have strong backgrounds as editors with extensive experience managing teams of editors and writers. You have a passion for identifying and nurturing talent within your editorial team. You have a proven track record of being able to balance both individual and team workflows and processes. Most importantly, our mission of delivering the best questions to people’s answers will resonate with you as it relates to guiding our finance content.</span></p>\n  <p>&nbsp;</p>\n  <h4><strong>Qualifications for success:</strong></h4>\n  <ul>\n   <li><span>At least 5 years of experience managing teams of writers and editors.</span></li>\n   <li><span>Familiarity with creating SEO driven, evergreen content.</span></li>\n   <li><span>Experience recruiting and hiring editorial staff.</span></li>\n   <li><span>Familiarity and comfort with affiliate marketing and performance marketing.</span></li>\n   <li><span>You are high energy, and passionate about helping small businesses.</span></li>\n   <li><span>You are comfortable working in a startup environment, where things change quickly.</span></li>\n   <li><span>You have a strong work ethic.</span></li>\n  </ul>\n  <p>&nbsp;</p>\n  <h4><strong>This position includes:</strong></h4>\n  <ul>\n   <li><span>Directly manage 3-5 editors for performance and output of their writer teams.</span></li>\n   <li><span>Maintain editorial standards and best practices among the division editors and writers.</span></li>\n   <li><span>Maintain team meetings for editors and writers.</span></li>\n   <li><span>Top edit articles produced by writers in Finance division.</span></li>\n   <li><span>Work with General Manager, Editors, SEO Manager, and Business Development Manager to plan out article runways for all writers</span></li>\n   <li><span>Play a central role in hiring new writers to build out the Finance division</span></li>\n   <li><span>Hire and assign freelance writers, and manage their editing&nbsp;</span></li>\n  </ul>\n  <p>&nbsp;</p>\n  <h4><strong>Tools We Use:</strong></h4>\n  <p><span>WordPress, Insightly, G Suite, Slack, Trello, Guru</span></p>\n  <p><span>*It's ok if you have not used these, just be excited to learn them.</span></p>\n  <h4><strong>What we offer you:</strong></h4>\n  <ul>\n   <li><span>Competitive salary dependent on experience</span></li>\n   <li><span>Quality health insurance subsidized by FSB</span></li>\n   <li><span>401K plan with matching (no waiting period)</span></li>\n   <li><span>Short term and long term disability (paid by FSB)</span></li>\n   <li><span>Flexible Spending Accounts and Commuter Benefits</span></li>\n   <li><span>PTO</span></li>\n   <li><span>Flexibility</span></li>\n   <li><span>An open-minded, collaborative workplace, which will both challenge you and celebrate your work</span></li>\n   <li><span>The opportunity to grow</span></li>\n   <li><span>A chance to learn with and from interesting and enthusiastic colleagues</span></li>\n  </ul> \n </div> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "s7BXl7EDQvGh6b0k0I47Hw",
    "url": "https://weworkremotely.com/remote-jobs/summit-cpa-group-senior-accountant",
    "title": "Summit CPA Group: Senior Accountant",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Summit CPA Group",
      "sameAs": "https://www.summitcpa.net/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 15, 2019 5:31:44 AM",
    "validThrough": "Jul 22, 2019 5:31:44 AM",
    "crawled": "Jul 15, 2019 6:06:23 AM",
    "content": "<h3> Senior Accountant </h3>\n<div>\n <div>\n  Our Senior Accountant team members are responsible for 8-10 clients at a time. This includes maintaining their accounting software, month-end closings, financial statement preparation, AP, AR, creating weekly cash flow reports, and tax preparation for their individual and business client bases.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  Our Accountants are client-facing, so having a good personality is a plus :)\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span>Our expectations of our Senior Accountants</span>\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li>At least 2-5 years of public accounting experience a plus</li>\n  <li>Working knowledge of Excel (pivot tables, advanced formulas and macros a plus)</li>\n  <li>QuickBooks, FreshBooks, and Xero experience a plus</li>\n  <li>Business (and personal) tax experience a plus</li>\n  <li>Should understand financial statements (journal entries, month-end closings, etc.)</li>\n  <li>Two mandatory company retreats per year</li>\n  <li>Works well under pressure</li>\n  <li>2080-hour work year (40 hours per week * 52 weeks) can be done in any manner; typically, more time is required when new clients are being onboarded</li>\n  <li>Oversees 1 - 2 Accountants</li>\n </ul>\n <div></div>\n <div>\n  <br>\n </div>\n <div>\n  <span>Benefits</span>\n  <span><br></span>\n </div>\n <ul>\n  <li>Working in a world-class distributed / remote team environment</li>\n  <li>Flexible schedule, can work around family functions</li>\n  <li>Technology stipend to cover home office expenses</li>\n  <li>Education stipend</li>\n  <li>Health insurance, 401(k) match, disability insurance, incentive program, HSA</li>\n  <li>We’ll cover any certification or state and national licenses / dues</li>\n  <li>Reimbursement for CPA review course and up to 4 exam sittings</li>\n </ul>\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "0pT4eDWfQvWv-euPtMXL0w",
    "url": "https://jobmote.com/job/49378/remote-audit-manager/",
    "title": "Remote Audit Manager",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Amarx Search, Inc.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 12, 2019 10:07:31 PM",
    "validThrough": "Jul 15, 2019 10:07:31 PM",
    "crawled": "Jul 13, 2019 3:06:26 AM",
    "content": "<div>\n <p> <strong>Full Time remote position<br></strong> <strong>Pay: per client, contact us<br></strong> <strong>Position ID: 1968</strong></p> \n <p> <strong>An excellent position with an American mid-sized company which assists businesses and individuals with complex tax, audit, business management, wealth transfer and estate tax and planning needs</strong></p> \n <p> <strong>* Remote Audit Manager *</strong></p> \n <p> <strong>Please apply ONLY if you are a CPA and have a bachelor s degree </strong></p> \n <p> <strong>Visa sponsorship is not available for this position</strong></p> \n <p> <strong> We can ONLY consider your application if you have:</strong></p> \n <p> <strong>1: Bachelor s degree<br>2: CPA<br>3: Demonstrated audit experience<br>4: 7+ years relevant work experience<br>5: Team management experience (5+ team members preferred)<br>6: Record of client relationship management<br>7: Excellent spoken and written communications skills</strong></p> \n <p> <strong>We are looking for an experienced Audit Manager looking for a position with excellent growth potential. <br><br>This person will manage multiple and challenging assignments for a broad range of clients. <br><br>Services include audits of financial statements, compilations, reviews, agreed-upon procedures, benefit plan audits and other attest services. <br><br>Oversee the day-to-day operations of multiple audit engagements and monitor accounting issues that might arise in the course of the project.</strong></p> \n <p> <strong>Please send resume as a Microsoft Word attachment to </strong></p> \n <p> <strong>Amarx Search, Inc. amarx.com</strong></p> \n <p> <strong> </strong></p> - provided by Dice\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "FNyjitgXQsOsLokjTy340w",
    "url": "https://remote.co/job/personal-finance-editor/",
    "title": "Personal Finance Editor",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Business Insider",
      "sameAs": "https://www.businessinsider.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 12, 2019 6:38:52 PM",
    "validThrough": "Jul 19, 2019 6:38:52 PM",
    "crawled": "Jul 12, 2019 7:31:23 PM",
    "content": "<h3>Personal Finance Editor at <span>Business Insider</span></h3>\n<div>\n <span><i></i> Remote</span> \n</div>\n<div> \n <p><strong>Editorial | New York, NY | Full Time</strong></p>\n <p><strong>JOB DESCRIPTION</strong></p>\n <p>Personal Finance Insider is hiring an editor to help build Business Insider’s personal finance coverage into a go-to money powerhouse.</p>\n <p><strong>This person should have:</strong></p>\n <ul>\n  <li>A genuine interest in, and good judgment around, personal finance and money</li>\n  <li>Impeccable organizational skills to manage an editorial calendar and balance multiple projects</li>\n  <li>Interest in working on posts monetized through affiliate or other partnerships</li>\n  <li>Strong communication skills and comfort recruiting and working with freelancers</li>\n  <li>Willingness and excitement around building out a new team, trying new types of stories, and figuring out what best serves our readers</li>\n  <li>The ability to work in fast-paced environment that’s always growing and changing</li>\n </ul>\n <p><strong>The ideal candidate will also:</strong></p>\n <ul>\n  <li>Have excellent editing, writing, and researching skills</li>\n  <li>Have excellent communication skills</li>\n  <li>Be efficient, energized, and have great story judgment</li>\n  <li>Have an ability to identify the heart of a story quickly</li>\n  <li>Familiarity with SEO practices</li>\n </ul>\n <p>Personal Finance Insider occasionally highlights financial products and services that can help readers make smarter decisions with their money. When readers take action based on one of our recommendations, PFI gets a small share of the revenue from our commerce partners.</p>\n <p>The PFI Editor will always put our readers first, never compromising our editorial integrity and journalism standards.</p>\n <p>This is a fast-growing area for Business Insider, so it’s a chance to have a real impact on the growth of the team.</p>\n <p><strong>This is a full-time position that can be based in our New York City headquarters, in our San Francisco or LA offices, or remotely.</strong> Business Insider offers competitive compensation packages complete with benefits.</p>\n <p>Created for the digital generation, Business Insider is the largest business news site in the U.S. and one of the fastest-growing news brands in the world. We embrace the themes of positive change and innovation and use fast, fun, and informative storytelling to cover the business, tech, and finance news stories you need to know to work, play and live better.</p> \n</div>\n<div> \n <a href='https://careers.jobscore.com/careers/businessinsider/jobs/personal-finance-insider-editor-djESpiH5Kr6zyRcR_n82lY?ref=rss&amp;sid=68' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "kPfCKwSpRcS4ohrIMYnmwg",
    "url": "https://jobmote.com/job/48840/specialist-cost-segregation/",
    "title": "Specialist, Cost Segregation",
    "tags": [
      "DBG:surround``work 2W wherev 2W you",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Wipfli LLP",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 11, 2019 2:17:38 PM",
    "validThrough": "Jul 14, 2019 2:17:38 PM",
    "crawled": "Jul 11, 2019 6:23:02 PM",
    "content": "<div>\n Overview\n <br>\n <br>Create lasting, positive impact.\n <br>\n <br>By considering Wipfli LLP, you've decided to go beyond the ordinary public accounting and consulting firm. At Wipfli, we create positive impact and lifetime relationships by leading and working with an outward mindset. As a member of our team, you will be inspired to think freely and follow your passion, grow as a professional by developing your skills and commit to serving our clients and communities with honesty and integrity.\n <br>\n <br>Wipfli has a broad national footprint with offices coast to coast - and we're still growing! As an associate, you'll have access to skill development and career opportunities, whether you want to move up or transition into another area of specialty. You'll also have the flexibility and technology to work wherever you are, whether it's at home or in our clients' offices, or switching Wipfli offices if you're looking to move across the country.\n <br>\n <br>Join a company focused on giving back to the greater good - at Wipfli, we're committed to supporting the communities we do business in. To learn more about our volunteer efforts, who we are and what we do, visit wipfli.com.\n <br>\n <br>The Cost Segregation Specialist is responsible for performance of cost segregation and allocation studies for the use of firm clients and non-clients in the preparation of tax returns. Must understand the tax issues which drive the need for cost segregation services. Individual may be called upon to use skill set to help develop solutions for any other tax or accounting function as determined relevant.\n <br>\n <br>Responsibilities\n <br>\n <br>Essential Responsibilities\n <br>\n <br>* Prepare Cost Segregation Analysis and Reports.\n <br>* Prepare Cost Allocation Studies and Reports.\n <br>* Prepare proper documentation and supporting schedule\n <br>* Explain the relationship of the study to tax issues involved.\n <br>\n <br>Additional Responsibilities\n <br>\n <br>* Participates in Continuing Professional Education program which is essential to competence and continued professional growth.\n <br>* Participates in community activities for business networking purposes.\n <br>\n <br>Qualifications\n <br>\n <br>Minimum Education Requirements\n <br>\n <br>Bachelors Degree in construction, engineering or architecture with a business emphasis preferred. Experience in reading construction plans required.\n <br>\n <br>Previous Experience\n <br>\n <br>1-3 years of experience preferred, but not necessary. Past engagement manager with national cost segregation firm preferred.\n <br>\n <br>Specific experience required\n <br>\n <br>Candidate for position would have previous experience in the area of performing cost segregation and allocation studies with either an accounting firm, appraisal company or a boutique firm specializing in the subject. Individual should have a minimum of 1-3 years of experience in the cost segregation area with exposure to various issues and project types.\n <br>\n <br>Abilities:\n <br>\n <br>Ability to plan, prioritize, and organize work effectively\n <br>\n <br>Ability to balance many projects simultaneously\n <br>\n <br>Ability to work independently under pressure and time deadlines\n <br>\n <br>Ability to analyze data, solve problems, and recommend solutions\n <br>\n <br>Ability to use engineering skills to find tax solutions. Interpret construction plans, identify materials and tax implications of cost for the structure.\n <br>\n <br>Ability to interact with clients and their representatives.\n <br>\n <br>Communication\n <br>\n <br>Strong written and verbal communication skills to translate complex building issues and tax implications into terms the clients understand.\n <br>\n <br>Technology:\n <br>\n <br>Proficient in Word, Excel, and Outlook\n <br>\n <br>Specific abilities required include: Use of Microsoft Access and Google Earth.\n <br>\n <br>Work Relationship and Scope\n <br>\n <br>Position will report to Director, Cost Segregation for priority setting/direction and day-to-day activities and support. The cost segregation specialist will have an annual chargeable hour budget of 1,650 hours. The specialist will work closely with clients, partners, managers, staff, and administrative staff to complete responsibilities. Individual will network with prospective and current clients, business organizations, and business and community leaders via telephone, business development opportunities and in-person meetings.\n <br>\n <br>Working Conditions\n <br>\n <br>Work is generally performed in a pleasant office setting. Position will work 42-45 hours per week with increased hours during peak periods of productivity\n <br>\n <br>Light Lifting (less than 10 pounds)\n <br>\n <br>Occasional moderate activity requiring walking and/or bending\n <br>\n <br>Uses personal vehicle to travel on a monthly basis (approximate distance: 300 miles). Must possess a valid driver's license and be properly insured.\n <br>\n <br>Moderate over-night travel required (2-3 times nights month). Travel as required for engagements, projects out of the immediate office area and for Continuing Professional Education. Out of town overnight engagement could vary from two to ten weeks per year.\n <br>\n <br>This position description describes the general nature and level of work performed by associates assigned to this position. \\&quot;Essential responsibilities\\&quot; describe those functions considered essential to the performance of the job. This position description does not state or imply that these are the only responsibilities assigned to the job. Associates may be required to perform other job-related responsibilities as requested by leadership. All requirements are subject to change over time, and to possible modification to reasonably accommodate individuals with a disability.\n <br>\n <br>Wipfli is an equal opportunity/affirmative action employer. All candidates will receive consideration for employment without regards to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identify, citizenship status, veteran status, disability, or any other characteristics protected by federal, state, or local laws.\n <br>\n <br>\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "utVXvIGqTx-bSxZXaYdK6A",
    "url": "https://jobmote.com/job/48836/sr-accountant-work-from-home-flex/",
    "title": "Sr Accountant - work from home flex",
    "tags": [
      "DBG:surround``flexibl 3W work 2W from 2W home",
      "DBG_TECH1:k/t/w:classification/bigdata-ml/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=1, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Robert Half Finance & Accounting",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 60000,
      "maxValue": 90000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 60k - 90k /Year"
    },
    "employmentType": "UNSET",
    "published": "Jul 11, 2019 2:17:38 PM",
    "validThrough": "Jul 14, 2019 2:17:38 PM",
    "crawled": "Jul 11, 2019 6:23:02 PM",
    "content": "<div>\n <b>Ref ID: </b>00720-#######350\n <br>\n <br>\n <b>Classification: </b>Accountant - Sr.\n <br>\n <br>\n <b>Compensation: </b>$60,000.00 to $90,000.00 per year\n <br>\n <br>Senior Accountant - flexibility to work from home. Stamford, CT. Entrepreneurial culture, stable well backed firm, fun pet / animal focused business. Right hand to the Controller - core accounting / reporting functions. 2 plus years of related experience, and the accounting degree are necessary. The desire to work in a positive team environment is a must. :) For immediate consideration email your resume to \n <span>[Click Here to Email Your Resum ]</span>\n <br>2 plus years of related experience, and the accounting degree are necessary. The desire to work in a positive team environment is a must. :) For immediate consideration email your resume to \n <span>[Click Here to Email Your Resum ]</span>\n <br>\n <br>Robert Half Finance &amp; Accounting, the world's leader in specialized financial staffing, provides exciting full-time opportunities in the areas of accounting, bookkeeping, finance, audit, taxation and more. We pioneered the professional staffing industry, and we've been successfully matching professionals with employers since 1948. Our proven proprietary processes, along with our relationships in 325 locations worldwide, allow us to provide you unparalleled access to exciting career opportunities. But don't take our word for it. Our company has appeared on Fortune magazine's list of \\&quot;World's Most Admired Companies\\&quot; since 1998, and 9 out of 10 of our customers would recommend our service to a colleague.\n <br>\n <br>Apply for this job now or contact our nearest office at 888-###-#### for additional information.\n <br>\n <br>All applicants applying for U.S. job openings must be authorized to work in the United States. All applicants applying for Canadian job openings must be authorized to work in Canada.\n <br>\n <br> 2019 Robert Half Finance &amp; Accounting. An Equal Opportunity Employer M/F/Disability/Veterans \n <br>\n <br>By clicking 'Apply Now' you are agreeing to Robert Half \n <span>Terms of Use</span>.\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "FuN85bx7SCSaTU3wT7b1Ew",
    "url": "https://remote.co/job/junior-financial-planner-7/",
    "title": "Junior Financial Planner",
    "tags": [
      "DBG:surround``remot 3W onli",
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=5, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ],
    "hiringOrganization": {
      "name": "Independence University",
      "sameAs": "https://www.independence.edu/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 8, 2019 6:13:08 PM",
    "validThrough": "Jul 15, 2019 6:13:08 PM",
    "crawled": "Jul 8, 2019 6:24:53 PM",
    "content": "<h3>Junior Financial Planner at <span>Independence University</span></h3>\n<div>\n <span><i></i> Remote</span> \n</div>\n<div> \n <p><strong>REMOTE</strong></p>\n <p><strong>Online Remote – Continental U.S. Only</strong></p>\n <p><strong>Full-time</strong></p>\n <p><strong>19-0644</strong></p>\n <p><strong>Independence University</strong></p>\n <p><strong>Company Overview</strong></p>\n <p>The Center for Excellence in Higher Education (CEHE) is a 501(c)(3) non-profit corporation headquartered in Salt Lake City, Utah. CEHE operates degree-granting career colleges throughout the western United States and online. The college brands include Stevens-Henager Colleges in Utah and Idaho; CollegeAmerica in Colorado and Arizona; California College San Diego, and Independence University (online platform). All of the colleges are accredited by ACCSC, a national accrediting body recognized by the U.S. Department of Education. The colleges offer degree programs from the Associate’s level through the Master’s level in a variety of disciplines including Computer Science, Graphic Arts, Business/Accounting, Nursing, and Healthcare. CEHE is an at-will employer.</p>\n <p><strong>Jr. Financial Planner</strong></p>\n <p>This Financial Aid Planner position is responsible for all activities leading up to the financial aid appointment. This planner will meet with prospective students over the phone, to educate them on the purpose and assist in the completion of financial aid applications, along with the coordinating of financial aid appointments. The final decision in proper student financial aid packaging is conducted by the colleges Central Financial Aid Office (CFA). This position requires two late-night shifts (11am-8pm) between Monday and Thursday, as well as a rotating Saturday shift (1/month). The regular day shift is 8am-5pm.</p>\n <p><strong>Essential Functions: </strong></p>\n <ul>\n  <li>Interface with and support Admissions and Education departments</li>\n  <li>Educate prospective students of the various funding options</li>\n  <li>Assist prospective students with Free Application for Federal Student Aid (FAFSA)</li>\n  <li>Coordinate and prepare potential students for Financial Aid Appointments</li>\n  <li>Maintain compliance with federal, state, and corporate rules of financial aid</li>\n  <li>Provide outstanding service and assistance to all current and prospective students</li>\n  <li>Ensure zero error rate in data gathering and entry</li>\n  <li>Expected to achieve departmental metrics and quality goals</li>\n  <li>Must be able to lift 15 lbs.</li>\n  <li>Other duties as assigned</li>\n </ul>\n <p><strong>Qualifications:</strong></p>\n <p><strong>Education</strong>:</p>\n <ul>\n  <li><strong>High School diploma (or equivalent) required. Associate’s degree preferred</strong></li>\n </ul>\n <p><strong>Requirements</strong>:</p>\n <ul>\n  <li><strong>Associate’s Degree preferred</strong></li>\n  <li>Must be extremely detail oriented</li>\n </ul>\n <p><strong>Working from Home Requirements:</strong></p>\n <ul>\n  <li>Dedicated space/office must be free from distractions and background noise (personal calls, visitors, pets, TV, children, etc.)</li>\n  <li>Must adhere to set schedule</li>\n  <li>Continuous/active communication with managers and co-workers</li>\n  <li>Must have the following resources at home:\n   <ul>\n    <li>Dedicated office space that can accommodate dual monitors, computer, and VPN device</li>\n    <li>A hard-wired (from the computer to the internet router/modem) High-speed internet with:\n     <ul>\n      <li>A minimum of 6 Mbps download speed and 1.5 upload speed</li>\n      <li>Latency/Ping must be @ 40-45ms or lower</li>\n     </ul></li>\n    <li>Depending on the availability; Cable, DSL, Fiber are only supported ISP provider services (candidates must provide Internet Service Provider Name and the test results before hire)</li>\n    <li>Satellite, Hot Spot and any other unreliable services are not supported by CEHE; Wireless connection is also not supported</li>\n   </ul></li>\n </ul>\n <p><strong>Measures of Merit:</strong></p>\n <ul>\n  <li>TBD by supervisor within 90 days of hire.</li>\n </ul> \n</div>\n<div> \n <a href='https://cehe.wd5.myworkdayjobs.com/en-US/CEHE_Careers/job/Online-Remote---Continental-US-Only/Jr-Financial-Planner---REMOTE_19-0644' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "8UYm1F-KTkyxvUwV4yMeiA",
    "url": "https://problogger.com/jobs/job/writers-needed-for-finance-website/",
    "title": "Writers needed for finance website",
    "tags": [
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Simpler Inc.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 4, 2019 2:00:00 AM",
    "validThrough": "Jul 11, 2019 2:00:00 AM",
    "crawled": "Jul 4, 2019 11:32:21 PM",
    "content": "<h3>Writers needed for finance website</h3>\n<div>\n Company: Simpler Inc.\n</div>Location: Anywhere\n<br>Job Type: Contract\n<div> \n <h5>Description</h5> \n <div> \n  <p>We're looking for 2 to 3 writers to write simple pieces of content based around finance.</p>\n  <p>Writers will be responsible for at least 8 articles per month. More can be assigned if you are willing and able to write more.</p>\n  <p>Initially, you'll be assigned simple articles 800-1200 words long.</p>\n  <p>Other long-form pieces 2000+ words long will be assigned to writers who are good fits.</p>\n  <p>We pay $50 per regular article and $100 for long-form articles. Receive pay 2 business days after submitting and approving.</p>\n  <p>To apply, please submit 3 samples of your writing. Please only provide published links on the web. Attachments won't be considered.</p>\n  <p>Thank you.</p> \n </div> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "quGzGfdITf2UjN264C9zXQ",
    "url": "https://jobmote.com/job/47051/internal-audit-manager-100-remote-wfh/",
    "title": "Internal Audit Manager (100% Remote - WFH)",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "CyberCoders",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 110000,
      "maxValue": 125000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 110k - 125k /Year"
    },
    "employmentType": "UNSET",
    "published": "Jul 2, 2019 10:07:22 PM",
    "validThrough": "Jul 9, 2019 10:07:22 PM",
    "crawled": "Jul 3, 2019 3:06:25 AM",
    "content": "<div>\n Minimum Required Skills:\n <br>Internal Audit, Audit Manager, Operational, Operational Audit, Compliance, CIA, CPA, Value Add, Data Analytics, Spanish\n <br>\n <br>Title: Internal Audit Manager\n <br>100% REMOTE - Travel 50% of the time Domestically\n <br>Salary: $110K - $125K\n <br>+ Bonus\n <br>Requirements: \n <br>1.) 5+ years in Operational Audit\n <br>2.) Must have experience driving bottom-line savings\n <br>3.) Must have a good understanding of data analytics in regards to Audit\n <br>4.) Audit certification\n <br>\n <br>Top Reasons to Work with Us\n <br>\n <br>Who are we? As a global manufacturing company within the Medical Device space\n <br>Where is this position located? Chicago, IL\n <br>How much travel is included in this role? 50% of the time both (Domestic and International travel is a must)\n <br>Why are we hiring? The organization is growing and we are adding an additional Manager on the team to oversee projects. Acquisitions have occurred and we need a strong Auditor to help with priority projects.\n <br>\n <br>What You Will Be Doing\n <br>\n <br>As the Internal Audit Manager, you will be a contributor to a team of 8 people and will manage/lead projects alongside a fellow Manager.\n <br>You will not have any direct reports but can have about 3-4 Auditors assigned to your projects.\n <br>This is a heavy operational audit role so if you have experience with driving projects that highly affect the bottom-line savings, this role is for you!\n <br>\n <br>Why join the team?\n <br>Since we are a large Corporation with an intimate size Audit team, each team member has an opportunity to make a big impression of the team. This is a role for an individual to progress themselves in the Audit world and while working on different businesses, you will have the constant challenges that will help elevate your career.\n <br>\n <br>How much are you traveling? \n <br>50% of the time.\n <br>Domestic travel is needed - you will travel for the first 6 months off and on to HQ's located in Warsaw, IN.\n <br>There is International travel including EMEA and America's Region\n <br>\n <br>What You Need for this Position\n <br>\n <br>Requirements for this position:\n <br>1.) 5+ years in Operational Audit\n <br>2.) Must have experience driving bottom-line savings\n <br>3.) Must have a good understanding of data analytics in regards to Audit\n <br>4.) Audit certification (CISA or Certifications on ISO, CobiT, ITIL, CISSP, CIA, or CPA are a plus)\n <br>5.) Must have strong project management and / or people management\n <br>\n <br>Bonus:\n <br>1.) Speaks Spanish or Portuguese\n <br>\n <br>What's In It for You\n <br>\n <br>Competitive salary ranging from $110K - $125K\n <br>Total compensation ranging from $125K - $145KSo, if you are a Internal Audit Manager with strong operational audit experience, please apply today!\n <br>\n <br>Applicants must be authorized to work in the U.S.Please apply directly to by clicking 'Click Here to Apply' with your Word resume!\n <br>\n <br>Looking forward to receiving your resume and going over the position in more detail with you.\n <br>\n <br>- Not a fit for this position? Click the link at the bottom of this email to search all of our open positions.\n <br>\n <br>Looking forward to receiving your resume!\n <br>\n <br>CyberCoders\n <br>\n <br>CyberCoders, Inc is proud to be an Equal Opportunity Employer\n <br>\n <br>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br>\n <br>Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n <br>\n <br>Copyright 1999 - 2019 . CyberCoders, Inc. All rights reserved.\n <br> - provided by Dice\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "POXN7giuRJCF2nMAX-HYUA",
    "url": "https://remote.co/job/senior-accountant-9/",
    "title": "Senior Accountant",
    "tags": [
      "DBG:surround``can 2W remot",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Peerfit",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 2, 2019 4:55:14 PM",
    "validThrough": "Jul 9, 2019 4:55:14 PM",
    "crawled": "Jul 2, 2019 5:08:18 PM",
    "content": "<h3>Senior Accountant at <span>Peerfit</span></h3>\n<div>\n <span><i></i> Remote</span> \n</div>\n<div> \n <ul>\n  <li><strong>Accounting/Finance</strong></li>\n  <li><strong>United States</strong></li>\n </ul>\n <p>Interested in working for a team of people completely redefining how fitness and health care work together? At Peerfit, were flipping wellness reimbursements on their head by connecting insurers and employers wellness dollars to popular fitness studios offering CrossFit, yoga, barre, boot camp, cycling, and more. If working with a team of innovative and driven people who are modernizing how people engage with wellness excites you, look no further than Peerfit.</p>\n <p><strong>POSITION SUMMARY:</strong></p>\n <p>As a Senior Accountant, you will be responsible for performing duties that assist the Controller in day-to-day core accounting functions taking ownership of key areas. Core areas include general ledger accounting, account reconciliations and financial statement preparation all in compliance with GAAP; state reporting, filing and compliance for multi-states including sales tax; budgeting/forecast model maintenance and financial analysis; audit and tax return preparation for year-end, payroll backup including compliance oversight and reporting; accounts payable and accounts receivable processing including expense report approvals, unclaimed property reporting and 1099 processing; record organization and retention. The Senior Accountant works closely with other finance team staff as well as other Peerfit team members.</p>\n <p><strong>KEY RESPONSIBILITIES:</strong></p>\n <ul>\n  <li>Responsible for month-end close duties. These duties include but not limited to: bank reconciliations, credit card reconciliations, payroll liability reconciliations, prepaid journal entries and reconciliations, bill.com reconciliations, preparation of financial statements, and other month end close research and reconciliations that may be needed. Understand the journal entries being made and why and review these respective sections for overall reasonableness.</li>\n  <li>Responsible for monthly revenue cycle invoicing and reporting. Ensure that clients are invoiced properly, revenue is recognized appropriately and in the proper period, monthly reports are reconciled to Looker, and any other duties that ensure proper revenue recognition.</li>\n  <li>Responsible for assisting Controller with budget process. These duties include but are not limited to: preparing and maintaining budget templates, gathering data through working with others, analyzing data to ensure reasonable, reconciling department roll-ups and loading approved budgets into accounting software.</li>\n  <li>Responsible for maintaining the equity accounting reporting. This includes and not limited to maintaining the awarded options reconciliation and vesting schedules as well as any other reconciliation and reports to provide proper equity accounting.</li>\n  <li>Responsible for expense report approvals and ensuring each expense has appropriate detail support which includes meeting IRS requirements, internal approvals, GL coding, and correct posting dates for accurate recording and integration into accounting software.</li>\n  <li>Responsible for understanding the payroll process and become the backup for such function in the case the payroll processor has scheduled PTO or emergencies. Ensure payroll entries and corresponding benefits are recorded accurately and timely. Reconcile payroll liability accounts and perform monthly accruals as necessary. Stay abreast of payroll compliance issues and concerns and alert management of any issues.</li>\n  <li>Responsible for ensuring bill.com payments are being processed timely and accurately. Review outstanding bills. Reconcile sync error report and reach out to appropriate team on how to resolve. Monitor expiring/expiring checks and work with appropriate team to resolve and document filing unclaimed property reports as necessary.</li>\n  <li>Responsible for daily bank activity review, matching of activity within QuickBooks, and journal entries as needed.</li>\n  <li>Responsible for preparing state compliance filings for payroll taxes, state taxes, sales tax and unclaimed property.</li>\n  <li>Responsible for year-end audit and tax preparation work, ensuring all financial information reconciles by account and state. Work closely with audit firm and Controller on providing timely and accurate information. Ensure records are maintained in an efficient manner to provide tax firm with organized and accurate financial information.</li>\n  <li>Responsible for year end 1099 reporting and documentation.</li>\n  <li>Responsible for ensuring accounting compliance and controls in accordance with GAAP, security/ privacy and HIPAA.</li>\n  <li>Organize permanent records in logical folders/ subfolders on Google Drive, ensuring all required documentation is saved timely with appropriate naming convention.</li>\n  <li>Provide positive support and training to junior accountant and administrative personnel that may or may not have accounting backgrounds.</li>\n  <li>Other duties as assigned.</li>\n </ul>\n <p><strong>EXPERIENCE/QUALIFICATIONS:</strong></p>\n <ul>\n  <li><strong>Bachelors in Accounting degree required</strong></li>\n  <li>Minimum 5-year experience in a corporate accounting role required</li>\n  <li>Sales Tax Experience – Strongly preferred</li>\n  <li>CPA strongly preferred</li>\n </ul>\n <p><strong>WHO WE NEED: (Intangibles)</strong></p>\n <ul>\n  <li>Passionate about health and fitness</li>\n  <li>Desires to have a role in the growth of a startup</li>\n  <li>Stays motivated and knows how to be persistent</li>\n  <li>Is self-directed</li>\n  <li>Can work remotely and make decisions autonomously at a high level</li>\n  <li>Flexibility to handle changing responsibilities</li>\n </ul>\n <p><strong>WHAT YOU GET:</strong></p>\n <ul>\n  <li>The opportunity to help expand the impact of Peerfit across the United Statesand, someday, the world!</li>\n  <li>The chance to work in a relaxed, yet goal-driven start-up culture with a passion for fitness</li>\n  <li>Peerfit credits to attend fitness classes.</li>\n  <li><strong>Chance to work remotely with flexible scheduling</strong></li>\n  <li>Health Insurance &amp; other benefits</li>\n </ul>\n <p>Peerfit is an Equal Opportunity Employer</p> \n</div>\n<div> \n <a href='https://hire.withgoogle.com/public/jobs/peerfitcom/view/P_AAAAAADAAEXAcdCDPH0R1r' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "xo0fz1STR6a-WGXJ-Isepg",
    "url": "https://jobmote.com/job/46092/remote-role-for-it-project-analyst-with-financial-management/",
    "title": "REMOTE ROLE for IT Project Analyst with Financial management",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "AIC (part of ACS Group)",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 1, 2019 10:07:13 PM",
    "validThrough": "Jul 8, 2019 10:07:13 PM",
    "crawled": "Jul 2, 2019 3:06:25 AM",
    "content": "<div>\n <b>Position: Sr. IT Project Analyst</b>\n <br>\n <b>Location: REMOTE ROLE</b>\n <br>\n <b>Duration: 6+ months contract</b>\n <br>\n <br>\n <b>Essential Functions:</b>\n <ul>\n  <li>Prepare cost projections and financial accrual information</li>\n  <li>Prepare, analyze and package budget documentation (investment/operational)</li>\n  <li>Prepare Investment project funding request recommendations for project stage gate funding</li>\n  <li>Develop planning and reporting processes, with input from Portfolio Manager</li>\n  <li>Coordinate management process meetings and prepare presentations.</li>\n  <li>Prepare and edit multiple project status reports.</li>\n  <li>Provide guidance for other Project Analysts.</li>\n  <li>Provide variance analysis information and written narrative for both investment and operational budgets</li>\n  <li>Provide presentations regarding budget for executive level consumption</li>\n  <li>Prepare financial information for Portfolio Status reports for executive level consumption</li>\n  <li>Manage and track non-labor expenses and develop year end accrual information</li>\n </ul>\n <b>Required Work Experience:</b>\n <br> 3 or years of Formal budget and Financial management experience, preferably in an IT PMO or Project Management Organization or equivalent combination of transferable experience and education.\n <br>\n <br>\n <b>Required Education:</b>\n <br> Bachelor's degree or equivalent work experience in Finance or IT related field\n <br>\n <br>Position: Sr. IT Project Analyst\n <br>\n <br>Location: REMOTE ROLE\n <br>\n <br>Duration: 6+ months contract\n <br>\n <br>Required Work Experience:\n <br>\n <br>3 or years of Formal budget and Financial management experience, preferably in an IT PMO or Project Management Organization or equivalent combination of transferable experience and education.\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
