{
 "items": [
  {
    "id": "jtL6bfE_QfOxqU7lA6xbMw",
    "url": "http://workinstartups.com/job-board/job/70903/lead-automation-developer-in-test-at-altus-group/",
    "title": "Lead Automation Developer in Test",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:c#/c/4",
      "DBG_TECH1:k/t/w:c#/dotnet/10",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=18, c=4, mobile=1, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 12, 2018 7:18:21 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Who we are<br /><br />Altus Group is a leading provider of software, data solutions and independent advisory services to the global commercial real estate industry. Our businesses, Altus Analytics and Altus Expert Services, empower clients to analyse, gain market insight and recognise value on their real estate investments. Headquartered in Canada, we have approximately 2,300 employees around the world, with operations in North America, Europe and Asia Pacific.<br /><br />Altus Analytics, the software and data solutions division of Altus Group, is driving an evolution in the commercial real estate industry by empowering clients and partners with industry standard software solutions, data products and technology enabled services.<br /><br />The opportunity<br /><br />We are looking for a Lead Automation Developer in Test to join our Core Services team and work across three significant global products. We need a hands-on Lead Developer in Test who understands how to test web services and has experience creating both UI and API test frameworks with Selenium webdriver and C#. Someone who can share their knowledge, introduce best practices, create and coordinate automation in testing. We need a Lead Automation Developer in Test who realises the full potential of automation testing and strives to improve the framework through new insights or existing flaws. We want a champion of Behaviour-Driven Development (BDD) and a forward thinker. Someone who knows the value of automation in Agile software development and the importance of QA to engineer valuable tests. A Lead Automation Developer in Test who can liaise with all sides of the business to get the best results. This is an opportunity to drive and extend Automation for our new platform; to lead the work of remote automation engineers in India; and to build out your role and the team.<br /><br />Who you are<br /><br />You are a hands-on team leader and a thought leader; a Developer and an Automation test specialist. You are looking for an opportunity to join a rapidly growing organization. You may be working as a consultant for a large corporation as part of a team focused on web services implementation. You know how to build relationships and frameworks; how to collaborate across teams and how to create testing in different environments. You have end-to-end project work experience where you worked building and testing Front End Automation frameworks and API Web Services. You have experience determining when and how testing needs to occur; organizing testing; and converting manual to automation.<br /><br />What’s in it for you<br /><br />- Influence. You want to join a rapidly scaling PropTech leader where you can influence and drive the Automation testing of multiple global products. You want to have your opinion valued and have a say in the tools and the processes.<br />- Knowledge and growth. We are passionate about technology and as the industry leaders in Prop Tech, we know the future is in Automation and the cloud. As we grow, you will have an opportunity to build out an Automation Test team and to work on additional products.<br />- Exposure. This is an opportunity to be part of rolling out a unique platform and many products that will support and positively impact users in PropTech around the world.<br /><br />Here’s what our Lead Automation Developer in Test will do:<br /><br />- Provide supervision, guidance and day to day oversight to the offshore QA Automation team.<br />- Automate Functional UI and API tests.<br />- Performance, Scalability and Load tests.<br />- Manage the nightly automated test build on Jenkins.<br />- Coordinate the automation tasks in Jira within the team, including code management using Git.<br />- Work with other members of the QA Team to develop automation across all areas of the system including financial reports, database, UI and Excel integration.<br />- Provide support and training in automation.<br />- Establish best practices for automation, maintain high code quality and drive processes to enable smooth and efficient automation.<br />- Actively participate in team meetings; set and meet sprint deliverables.<br />- Work alongside the development team and product management team to obtain clarification on requirements and functionality and resolve all issues as efficiently as possible.<br />- Conduct research, suggest solutions, and generally do whatever it takes.<br /><br />Position Requirements: <br /><br />How do we know that’s you? You are:<br /><br />- A university graduate. You have a Bachelor’s degree in Computer Science.<br />- An experienced Developer. You have expertise in SQL, .NET, either  C# or Java and building software automation using Selenium WebDriver. You have worked on designing and implementing automation frameworks from end-to-end on multiple complex projects. You have experience testing web services and applications with Gherkin format; creating and testing API frameworks; and testing Front End with NJOY. You have deep knowledge of cloud technology.<br />- An innovative problem-solver. You think creatively in testing commercial grade software. You have exposure to multiple products and tools and you enjoy researching new methods. You have a range of experience implementing and maintaining an automation testing framework and you are able to offer guidance and advice based on deep knowledge of automation testing techniques and tools.<br />- A leader. You are results-driven, with initiative and highly capable of meeting deadlines. You can motivate and support the work of local and offshore teams. You thrive in a fast-paced environment. Experience leading remote teams is an asset.<br />- A strong communicator. You have excellent interpersonal and communication skills. You can build positive relationships with stakeholders, end users and members of a project team.<br /><br />Altus Analytics is:<br /><br />- Fast. We are responsive and fast, working in a startup-like environment, developing new solutions and features that meet the demands of our users. With the solid financial stability of our bigger parent-group, we can offer the best of both worlds - cool tech, great benefits, challenges and rewards.<br />- First. We continuously innovate to stay ahead of our competitors. We set the standard for the CRE industry.<br />- Fun. From social Fridays to summer sailing; from holiday parties to mid-winter hackathons, we know how to take a step back and relax with co-workers.<br />- Future-focused. As an organisation, we are focused on growing our reach and our product offering. For anyone joining us, this means the chance to work on critical projects that will shape the success of our clients and grow your own career moving up to the next level, choosing to specialise or exploring different product teams.<br />- We thank you in advance for taking the time to learn more about what makes Altus a great place to grow your career and do some of your best work. Apply now, refer a friend or stay on top of what’s new by following us on LinkedIn.<br /><br /><br />Altus Group is committed to fostering an inclusive and accessible environment where employees feel valued and respected, and where every employee has the opportunity to realize their potential. We are committed to providing reasonable accommodations, if required, and will work with you to meet your needs."
  },
  {
    "id": "RxwR5xthRkK1gnEUqJh1CQ",
    "url": "https://stackoverflow.com/jobs/196813/healthcare-integrations-specialist-medical-management-systems?a=140j7WDFK276",
    "title": "Healthcare Integrations Specialist at Medical Management Systems (London, UK) ",
    "tags": [
      "DBG:surround``OR(no,no W central) W offic",
      "DBG_TECH1:k/t/w:c#/c/4",
      "DBG_TECH1:k/t/w:c#/dotnet/10",
      "DBG_TECH1:k/t/w:distributed-database/bigdata-ml/8",
      "DBG_TECH1:k/t/w:javascript/frontend/3",
      "DBG_TECH1:k/t/w:javascript/nodejs/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=10, c=4, mobile=0, go=0, nodejs=3, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=3}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "GBP",
      "minValue": 45000,
      "maxValue": 65000,
      "info": "",
      "unit": "YEAR",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 12, 2018 6:30:02 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<h2><span>Healthcare Integrations Specialist</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Healthcare, Medical, Medical Software</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>11-50 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Medical Management Systems | London, UK<br></div>                        <h3>Remote details</h3>                        <div>                            <div>                                    <div>                                        <span>Employer's note:</span>                                        <span>Remote working is supported after an initial trial period.  Staff will be expected to spend some time in the office during the month</span>                                    </div>                                                                                                                                                            </div>                        </div>                    <h3>Technologies</h3><div></div><div>javascript</div><div>c#</div><div>integration</div><div>mirth</div><div>hl7</div>                <h3>Job description</h3>                <div><p>We are looking for a motivated individual who has experience of integrating healthcare systems using the various messaging formats out there. The following requirements are relatively flexible if you have significant integrations experience in other fields:</p><p>Very comfortable with structured data formats including:</p><p>* XML<br>* JSON<br>* HL7</p><p>DICOM familiarity:</p><p>* DICOM Modality Worklist (Query / Retrieve)<br>* DICOM Archive / Storage Servers</p><p>HL7 Standards and integrations<br>TCP communication / Networking familiarity (including HTTP/HTTPS protocols)<br>Basic understanding of javascript and C# programming<br>Background working with both SOAP and REST APIs<br>Javascript or other scripting experience highly desirable</p><p>Bonus:<br>Ever worked with Mirth Connect or Cloverleaf (cross platform HL7 interface and routing engines)</p><p>We develop a very comprehensive healthcare web-application that runs all aspects of a medical practice (from GP practices up to large hospitals groups). Our application includes:</p><p>Patient medical record system<br>Comprehensive consultation suite<br>Document management<br>Scheduling<br>Accounting<br>Email<br>Social network<br>Task management<br>Referral management<br>Reporting and query system for analytics<br>Clinical text analysis using NLP<br>Collaboration system<br>Practice networking<br>Patient portal<br>Occupational health portal<br>PACS system (MRI/X-ray/Ultrasound)<br>And much more...</p><p>We have a very relaxed working environment that is more akin to a start-up than a company that's been running for 12 years. We have a team of 10 developers who are very capable and committed . There are no office politics or any of that nonsense, it's a very collaborative environment. We try to keep quite a flat structure where we expect developers to take responsibility for dealing with everything in their purview (with the CTO there as adviser if needed). This has allowed us to keep the team small and efficient.</p><p>We need creatively minded individuals who can solve unique problems; not just with code and integration problems, but in improving healthcare too. Healthcare professionals are often not very tech-savvy, and are therefore either scared or incapable of communicating with tech-people. So I need individuals that can hear a real world problem and think creatively and with empathy for the end user.</p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/196813?reset=False&amp;ra=140j7WDFK276&amp;oqs=a%3D140j7WDFK276' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About Medical Management Systems</h3>            <div><p><em><strong>A collaborative and relaxed but professional and talented team</strong></em></p><p>We have a very relaxed working environment that is more akin to a start-up than a company that's been running for 12 years. We have a team of 10 developers (including me) and 2 QA who are very capable and committed - we are looking to get to 1 QA for every 2 devs, so we need to scale up our QA team.</p><p>There are no office politics or any of that nonsense, it's a very collaborative environment. I try to keep quite a&nbsp;<em>flat</em>&nbsp;structure where I expect my developers and QA team to take responsibility for dealing with everything in their purview (with me there as adviser if needed). This has allowed me to keep the team small and efficient - which if you see the scale of our solution is an incredible level of features to developers.</p><p>We have also developed interesting in-house tech of our own (distributed databases for document storage, natural language processing for clinical text parsing, UI frameworks, distributed config systems with PAXOS, language-ext, and echo-process, to name a few). We run on our own machines in high-security data-centres rather than on AWS/Azure, and so we have also developed our own in-house solutions for deployment, etc.</p><p>The people I need are 'self starters' (hate that term, but you know what I mean) and are happy to get their hands dirty as well as look to create innovative solutions to the problems they encounter. I need creatively minded individuals who can solve unique problems; not just with QA, but in improving healthcare too. Healthcare professionals are often not very tech-savvy, and are therefore either scared or incapable of communicating with tech-people. So I need&nbsp;QA than can hear a real world problem and think creatively.</p><p>Paul Louth CTO</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Employee profit share</span>                            </li>                            <li>                                <span></span>                                <span>Pension</span>                            </li>                            <li>                                <span></span>                                <span>Gym membership</span>                            </li>                    </ul>                "
  },
  {
    "id": "OiruN1_NRS2of2qERszD8w",
    "url": "https://stackoverflow.com/jobs/180729/integration-engineer-articulate-inc?a=YBSiTzSOFxK",
    "title": "Integration Engineer at Articulate Inc.  ",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 7, 2018 4:00:11 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Computer Software, eLearning</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <h2>Technologies</h2><div>javascript</div><div>e-commerce</div><div>salesforce</div><div>automation</div><div>database</div>                <h2>Job description</h2>                <div><p>We’re looking for an experienced engineer in the Sales and Marketing systems space to build solutions that will power the business at Articulate. As an integration engineer, you will be responsible for integrating the systems supporting our Marketing, Sales and Support teams at each step of the customer lifecycle. You’ll work with the business to gain a deep understanding of requirements, translate those requirements into technical specifications and implement the solutions.</p><p><br><strong>Your ideal skills and experience:</strong></p><ul><li>3-5 years experience implementing end-to-end systems integrations</li><li>Proven ability to work in a cross-functional, fast-paced environment, and meet complex operational goals</li><li>Experience with E-commerce and billing platforms</li><li>Experience with Salesforce integrations and development</li><li>Experience with marketing automation tooling preferred</li><li>Strong collaborator with balanced ego</li><li>JavaScript, AWS, SQL</li><li>Very proactive and responsible&nbsp;</li></ul>                </div>            <div>        <a href='https://articulate.applytojob.com/apply/iSRtu51VJ1' rel='nofollow'>                        Apply now        </a></div>            <h2>About Articulate Inc.</h2>            <div><p>Articulate is a highly successful, fully remote software company that’s changing the way the world learns. Our award-winning e-learning tools are used by 78,000+ organizations across the globe to create engaging online and mobile courses. Our customers include 93 of the Fortune 100 and 19 of the top 20 U.S. universities. And our online community of 550,000+ members is the largest, fastest-growing community in the industry.</p><p>We empower employees to thrive by fostering a culture of autonomy, productivity, and respect. We’re all free to exercise our crafts the best way we know how to reach our goals as individuals and teams. Each and every one of us is focused on producing results that directly impact the company’s success. And we all strive to do what’s right by people, both internally and externally, instead of taking the shortest route to the highest profits.</p><p>We honor people’s humanity in all of our disparate experiences and social locations, accepting each person as an individual with a story worth listening to and honoring. We believe that honoring everyone’s humanity means being committed to equity and justice. We welcome different voices and viewpoints and do not discriminate on the basis of race, religion, color, national origin, ancestry, physical and/or mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, transgender status, age, sexual orientation, and military or veteran status, or any other basis protected by law. We are an equal opportunity employer and invite applicants to voluntarily disclose their race and gender on our application form to help us create a diverse company. This voluntarily disclosed information will not be shared with any hiring manager and will be kept in confidence by the Articulate human resources department and executives who are not hiring for this position.&nbsp;<a href='https://articulate.com/company/culture' rel='nofollow'>Learn more about our culture</a>.</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Work from anywhere</span>                            </li>                            <li>                                <span></span>                                <span>Health care</span>                            </li>                            <li>                                <span></span>                                <span>Flexible vacation</span>                            </li>                            <li>                                <span></span>                                <span>401k matching</span>                            </li>                            <li>                                <span></span>                                <span>Wellness Benefit</span>                            </li>                            <li>                                <span></span>                                <span>Supplemental insurance</span>                            </li>                    </ul>                "
  },
  {
    "id": "L0lXk-ooTMGwqT_1C267_g",
    "url": "https://angel.co/wildtrails-of-india/jobs/113682-hotel-channel-manager-integration",
    "title": "Hotel Channel Manager Integration",
    "tags": [
      "Backend Developer",
      "Bengaluru",
      "Contract",
      "DBG:surround``remot W OR(contractor,assist,ok)",
      "DBG_TECH1:k/t/w:android/java/2",
      "DBG_TECH1:k/t/w:android/mobile/4",
      "DBG_TECH1:k/t/w:express/nodejs/8",
      "DBG_TECH1:k/t/w:ios/apple/4",
      "DBG_TECH1:k/t/w:ios/mobile/4",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=8, go=0, nodejs=8, bigdata-ml=0, ruby=0, apple=4, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/mobile",
      "TECH1/nodejs",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "INR",
      "minValue": 5000000,
      "maxValue": 50000,
      "info": "No Equity",
      "unit": "YEAR",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 7, 2018 3:31:29 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "Hotel Channel Manager Integration Job at WildTrails of India - AngelList<div><div><div><div><div><div><a title=&quot;WildTrails of India&quot; href='https://angel.co/wildtrails-of-india/jobs' rel='nofollow'></a></div><div></div><ul><li><span>WildTrails of India</span></li><li><span>Product</span></li><li><span>Jobs</span></li><li><span>Team</span></li></ul><div><div><div><div><div><a rel='nofollow'><span></span>Applied</a></div></div><div></div><div><span>Apply Now</span><div><div></div><div></div><div><div><div><div>Add a message to WildTrails of India</div>Apply<div></div></div></div></div></div></div><div></div></div></div><div><div><span>Share</span></div></div></div></div></div></div></div><div><div><div></div></div><div><div><div><a title=&quot;WildTrails of India&quot; href='https://angel.co/wildtrails-of-india' rel='nofollow'></a></div><div><h2>Hotel Channel Manager Integration at WildTrails of India</h2><div>Bengaluru, Remote · Contract</div><div><div><div><div><div><p>We are the only one who is solving the wrangle of Indian Wildlife tourism giving complete info about sanctuaries, safaris, resorts attached to it, sightings, probability of sighting of given animals/ birds based on sanctuaries, time of the year etc and all relevant info either you can find nowhere or all distributed over many many places.</p></div></div></div></div></div><div><div><div><div><div><a rel='nofollow'><span></span>Applied</a></div></div><div></div><div><span>Apply to WildTrails of India</span><div><div></div><div></div><div><div><div><div>Add a message to WildTrails of India</div>Apply<div></div></div></div></div></div></div><div></div></div></div></div></div></div><div></div></div></div><div><div><div><h3>Job Description</h3></div><div><div><p>I need help in a meeting with a Hotel channel manager integration  expert to understand w.r.t OTA and/or help me with actual integration of my app with the Channel Managers (Axis room, busy room, etc)</p></div></div><div><div>Compensation</div><div>₹5000K–₹50K<br>No Equity</div></div><div><div><div><div><div><a rel='nofollow'><span></span>Applied</a></div></div><div></div><div><span>Apply Now</span><div><div></div><div></div><div><div><div><div>Add a message to WildTrails of India</div>Apply<div></div></div></div></div></div></div><div></div></div></div></div></div></div><div><div><div><div><h3>What We're Building</h3></div><div><div><p>Its an App - provides complete info on all Indian Wildlife Sanctuaries, Safari details, sighting details, attached resorts and their details, all wildlife activity details, animals &amp; birds present details, all camera rental &amp; jungle car rental details and lot more.</p></div></div><div><div><div><div><div></div><div>Hiring in <span>Bengaluru</span>, Remote OK</div><div></div></div><div><div></div><div>1-10 Employees</div><div></div></div><div><div></div><span>Mobile</span>, <span>Mobile Commerce</span>, <span>Travel &amp; Tourism</span></div><div><div></div><a href='http://WildTrails.In' rel='nofollow'>WildTrails.In</a></div></div></div></div></div></div></div><div><div><div><div><div><div><a href='https://angel.co/projects/652135-home-wildtrails-india-come-experience-indian-wildlife-like-never-before?src=startup_profile' rel='nofollow'></a></div><div><div><a title=&quot;WildTrails of India&quot; href='https://angel.co/wildtrails-of-india' rel='nofollow'></a></div><div><div><a href='https://angel.co/projects/652135-home-wildtrails-india-come-experience-indian-wildlife-like-never-before?src=startup_profile' rel='nofollow'>Home - WildTrails India - Come Experience Indian Wildlife Like Never Before</a></div>One stop Destination of all Wildlife related </div><div></div></div></div></div></div><div><div><div><div></div><div>Add testimonials, product launches, and photos that highlight your company</div>Add Highlight</div></div></div><div></div></div></div><div><div><div><h3>Other Jobs at WildTrails of India</h3><ul><li><div>Design Jobs</div><div><div><div><div><a href='https://angel.co/wildtrails-of-india/jobs/200964-looking-for-a-app-ui-designer-but-should-be-a-wildlife-enthusiast' rel='nofollow'>Looking for a App UI Designer but should be a Wildlife Enthusiast</a><div>Bengaluru·Contract<span></span><span>·₹10K – ₹50K · No Equity</span></div></div><div><div><div><div><div><a rel='nofollow'><span></span>Applied</a></div></div><div></div><div><span>Apply</span><div><div></div><div></div><div><div><div><div>Add a message to WildTrails of India</div>Apply<div></div></div></div></div></div></div><div></div></div></div></div></div></div></div><div></div></li><li><div>Software Engineering Jobs</div><div><div><div><div><a href='https://angel.co/wildtrails-of-india/jobs/92963-backend-programmer-for-our-mobile-app' rel='nofollow'>Backend Programmer for our mobile App</a><div>Bengaluru·Cofounder<span></span><span>·₹500K – ₹1000K · 1.0% – 10.0%</span></div></div><div><div><div><div><div><a rel='nofollow'><span></span>Applied</a></div></div><div></div><div><span>Apply</span><div><div></div><div></div><div><div><div><div>Add a message to WildTrails of India</div>Apply<div></div></div></div></div></div></div><div></div></div></div></div></div></div><div><div><div><a href='https://angel.co/wildtrails-of-india/jobs/92969-backend-programmer-including-full-stack' rel='nofollow'>Backend programmer including Full Stack</a><div>Bengaluru·Full Time<span></span><span>·₹0K – ₹400K · 1.0% – 1.0%</span></div></div><div><div><div><div><div><a rel='nofollow'><span></span>Applied</a></div></div><div></div><div><span>Apply</span><div><div></div><div></div><div><div><div><div>Add a message to WildTrails of India</div>Apply<div></div></div></div></div></div></div><div></div></div></div></div></div></div><div><div><div><a href='https://angel.co/wildtrails-of-india/jobs/96032-looking-for-a-1-to-2-yr-experienced-engineer-express-js-monogo-db-python' rel='nofollow'>Looking for a 1 to 2 yr experienced engineer Express.Js, Monogo DB &amp; Python</a><div>Bengaluru·Full Time<span></span><span>·₹200K – ₹400K · 0.25% – 1.0%</span></div></div><div><div><div><div><div><a rel='nofollow'><span></span>Applied</a></div></div><div></div><div><span>Apply</span><div><div></div><div></div><div><div><div><div>Add a message to WildTrails of India</div>Apply<div></div></div></div></div></div></div><div></div></div></div></div></div></div><div><div><div><a href='https://angel.co/wildtrails-of-india/jobs/104587-ios-and-android-app-developer' rel='nofollow'>ios and android app developer</a><div>Bengaluru·Contract<span></span><span>·₹10K – ₹20K · No Equity</span></div></div><div><div><div><div><div><a rel='nofollow'><span></span>Applied</a></div></div><div></div><div><span>Apply</span><div><div></div><div></div><div><div><div><div>Add a message to WildTrails of India</div>Apply<div></div></div></div></div></div></div><div></div></div></div></div></div></div><div><div><div><a href='https://angel.co/wildtrails-of-india/jobs/104591-looking-for-an-ios-android-freelancer' rel='nofollow'>Looking for an iOS &amp; Android Freelancer</a><div>Bengaluru·Contract<span></span><span>·₹10K – ₹20K · No Equity</span></div></div><div><div><div><div><div><a rel='nofollow'><span></span>Applied</a></div></div><div></div><div><span>Apply</span><div><div></div><div></div><div><div><div><div>Add a message to WildTrails of India</div>Apply<div></div></div></div></div></div></div><div></div></div></div></div></div></div><div><div><div><a href='https://angel.co/wildtrails-of-india/jobs/109934-need-a-web-designer-freelancer-to-modify-certain-aspects-of-our-web' rel='nofollow'>Need a web designer freelancer to modify certain aspects of our web</a><div>Bengaluru·Contract<span></span><span>·₹25K – ₹100K · No Equity</span></div></div><div><div><div><div><div><a rel='nofollow'><span></span>Applied</a></div></div><div></div><div><span>Apply</span><div><div></div><div></div><div><div><div><div>Add a message to WildTrails of India</div>Apply<div></div></div></div></div></div></div><div></div></div></div></div></div></div><div><div><div><a href='https://angel.co/wildtrails-of-india/jobs/218145-to-read-data-from-a-website-in-pyhton3' rel='nofollow'>to read data from a website [in Pyhton3]</a><div>Bengaluru·Contract<span></span><span>·₹1K – ₹10K · No Equity</span></div></div><div><div><div><div><div><a rel='nofollow'><span></span>Applied</a></div></div><div></div><div><span>Apply</span><div><div></div><div></div><div><div><div><div>Add a message to WildTrails of India</div>Apply<div></div></div></div></div></div></div><div></div></div></div></div></div></div></div><div></div></li></ul></div></div></div><div><div><div><h3>WildTrails of India Team</h3><div><div><div><div><div><a href='https://angel.co/manjunath-m-gowda-1' rel='nofollow'></a></div><div><div><a href='https://angel.co/manjunath-m-gowda-1' rel='nofollow'>Manjunath M Gowda</a><span>,</span></div><div>CEO &amp; Founder <a href='https://angel.co/wildtrails-of-india' title=&quot;WildTrails of India&quot; rel='nofollow'><span>@</span><span>WildTrails of India</span></a>. Founder <a href='https://angel.co/i7-networks' title=&quot;i7 Networks&quot; rel='nofollow'><span>@</span><span>i7 Networks</span></a>, <a href='https://angel.co/s7-software' title=&quot;S7 Software&quot; rel='nofollow'><span>@</span><span>S7 Software</span></a> • <a href='https://angel.co/s7-software' title=&quot;S7 Software&quot; rel='nofollow'><span>@</span><span>S7 Software</span></a> acquired by <a href='https://angel.co/bluecoat' title=&quot;Bluecoat&quot; rel='nofollow'><span>@</span><span>Bluecoat</span></a>. MS Oregon State, BE UVCE. Strong in biz &amp; marketing</div></div></div></div></div></div><div></div></div></div></div><div><div><div><div><div>WildTrails of India is one of 25,533 startups hiring on AngelList</div><div></div></div><div><div><span>Browse All Startup Jobs</span><a href='https://angel.co/recruiting/signup?src=job-showcase' rel='nofollow'>Post a Job</a></div></div><div><span>Help</span>·<span>Terms</span>·<span>Jobs by location</span><span>Problem?<span>Report this company</span></span></div></div></div></div></div><div></div>"
  },
  {
    "id": "lKwZV50AQuyRUMBq8hcVFw",
    "url": "https://remoteok.io/jobs/67912",
    "title": "Integration Developer (WooCommerce)",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k/t/w:devise/ruby/8",
      "DBG_TECH1:k/t/w:woocommerce/php/48",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=8, apple=0, java=0, gamedev=0, php=48, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/integration",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 6, 2018 8:04:53 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<td><span><h2>Integration Developer (woocommerce)</h2></span><br><span><h3>Taxjar</h3></span> <span>verified</span></td><div><div>TaxJar is the leading technology solution for busy eCommerce sellers to manage sales tax and is trusted by more than 10,000 businesses. Our mission is is to make eCommerce easier for everyone.<br><br>OUR CORE VALUES<br><br>* We do the right thing for our customers.<br>* We're a team, built on trust.<br>* We're proud to be remote.<br>* We're in control of our own destiny.<br><br>TaxJar’s remote-only team of 40 people is growing quickly. We have an immediate opening for a WooCommerce Developer to help build, maintain, and support our popular sales tax plugin used by thousands of WooCommerce merchants.<br><br>We want you to join our growing platform integrations team to help build out the next generation of our WooCommerce plugin. The platform integrations team at TaxJar works directly with merchants, agencies, and partners to solve their business problems and devise clever solutions to accommodate the ever-increasing complexity of sales tax. Most of our integrations are built completely in-house to provide the best possible customer experience and unparalleled support. We bring new TaxJar features and improvements directly to eCommerce platforms such as WooCommerce via our API. As our ecosystem rapidly expands, you’ll have the opportunity to learn about many eCommerce platforms and create new integrations from scratch.<br><br>*This is a full-time remote position available to folks located in the US.<p>See more jobs at <span>Taxjar</span></p><p>Visit <a href='http://www.taxjar.com' rel='nofollow'>Taxjar</a>'s website</p></div></div>"
  },
  {
    "id": "1k8niSjRQFWqKPLpXU4Rgw",
    "url": "https://remoteok.io/jobs/67893",
    "title": "Cordova Meteor Developer Integrate App Payments",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:meteor/nodejs/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=16, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 4, 2018 7:32:17 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<td><span><h2>Cordova Meteor Developer Integrate App Payments</h2></span><br><span><h3>Scryent</h3></span> <span>verified</span></td><div><div><p><strong>Location:</strong> Remote</p><p>See more jobs at <span>Scryent</span></p></div></div>"
  },
  {
    "id": "G-f_multREmxNTuG36mQCg",
    "url": "https://stackoverflow.com/jobs/168467/senior-data-integration-engineer-dba-compucorp-ltd?a=UuUDYlqfG9y",
    "title": "Senior Data Integration Engineer (DBA) at Compucorp Ltd. (London, UK) ",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:lamp/php/13",
      "DBG_TECH1:k/t/w:php/php/10",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=2, gamedev=0, php=23, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/integration",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "GBP",
      "minValue": 25000,
      "maxValue": 35000,
      "info": "",
      "unit": "YEAR",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 3, 2018 12:29:53 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                                    <div>                        <div></div>                        <div>                            <h3>High response rate</h3>                            <div>This company responds to the majority of applications it receives.</div>                        </div>                    </div>                                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior, Lead</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>System Administrator</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>CRM, Information Technology, Non-Profit</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>11-50 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>pentaho</a><a rel='nofollow'>database</a><a rel='nofollow'>sql</a><a rel='nofollow'>mysql</a><a rel='nofollow'>api</a><a rel='nofollow'>sysadmin</a>                    </div>                                            <h2>Job description</h2>                <div><p>Are you a data nerd? If so we want you!</p><p>We like to build stuff… sometimes complicated stuff… for Non Profits, Charities and Art Galleries. We’re on the lookout for a confident and ambitious&nbsp;Data integration specialist&nbsp;to join our fast growing startup to help us build and automate complex data integrations for our clients and platforms.</p><p>We do things a little differently, basing all our solutions on open source products, offer a great work-life balance with flexible working hours and a real team mentality.</p><p>Our work covers web design, app development and branding for Charities and non-profit organisations across the country. Our clients include Charities such as Wikimedia and Farm Africa, art galleries such as the Photographers Gallery and Craft Central but also companies, trade associations and government bodies.</p><p>The role will comprise of 2 main elements. Most of our projects will involve a degree of data integration or migration and so we are looking to have a dedicated DBA to work on these elements of the projects. We want to develop an automated and scalable architecture that can be used in a flexible way across large client projects.</p><p>The other element of the role will be to be part of the infrastructure team in a devops/sysadmin capacity. You would also become a key architect in helping us to develop a robust SAS platform for a major SaaS product we are developing for Non Profit Organisations around the world.</p><p>The ideal candidate will have:</p><ul><li>Excellent SQL skills&nbsp;&nbsp;</li><li>Experience of using ETL (Extract Transform and Load) tools such as Pentaho or equivalent&nbsp;</li><li>Confidence in a Linux &amp; PHP (LAMP/LEMP) Environment</li><li>Experience of other programming languages such as Python, PHP or Java (or a willingness to learn).</li><li>Previous experience with CI/DevOps tools platforms (i.e. Jenkins, Chef, Puppet, Ansible).</li><li>Is&nbsp;meticulous and loves documentation!</li><li>Is a&nbsp;real team player who likes to muck in and get the job done!</li></ul><p>What were looking for is someone who can grasp concepts quickly, has great attention to detail, and most importantly loves a tech challenge. In short, we’re a young team of self confessed geeks who love tinkering and tweaking until something is just right and are looking for someone who thinks and acts like us.</p><p>If you live and breath SQL and know your left joins from your inner joins&nbsp;then we would love to hear from you.</p><p><strong>Location</strong></p><p>At Compucorp we are a distributed team and we welcome people to join us from all around the world, however as a UK based Company some overlap with UK hours will be required. By default you should assume that your working hours would be +/- 3h max from GMT start times of 9.00AM&nbsp;UK start time. There is some flexibility in this but please be aware that staff members starting outside of these hours are rare and as such if you would expect these hours to be an issue for you then we would not suggest that you apply.&nbsp;</p><p>For the&nbsp;Data Engineer role, due to EU data protection requirements, the team member must be from either an EEA country or a country that the EU considers to have adequate level of data protection. The list can be found at the link below:</p><p><a href='https://ico.org.uk/for-organisations/guide-to-data-protection/principle-8-international#eea-countries' rel='nofollow'>https://ico.org.uk/for-organisations/guide-to-data-protection/principle-...</a></p>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://www.compucorp.co.uk/content/application-form-data-integration-engineer' rel='nofollow'>                        Apply now        </a></div>                                    </div>                        </div>        </div>            <h2>About Compucorp Ltd.</h2>            <div><p>We&nbsp;like&nbsp;to&nbsp;build&nbsp;stuff,&nbsp;sometimes&nbsp;complicated&nbsp;stuff,&nbsp;for&nbsp;people&nbsp;who&nbsp;like&nbsp;to&nbsp;make&nbsp;a&nbsp;difference. We&nbsp;do&nbsp;things&nbsp;a&nbsp;little&nbsp;differently,&nbsp;basing&nbsp;all&nbsp;our&nbsp;solutions&nbsp;on&nbsp;open&nbsp;source&nbsp;products,&nbsp;having&nbsp;flexible&nbsp;working hours&nbsp;and&nbsp;a&nbsp;real&nbsp;team&nbsp;mentality. We're&nbsp;passionate&nbsp;about&nbsp;the&nbsp;platforms&nbsp;we&nbsp;work&nbsp;with&nbsp;and&nbsp;the&nbsp;communities&nbsp;which&nbsp;we&nbsp;are&nbsp;part&nbsp;of. Our&nbsp;work&nbsp;covers&nbsp;web&nbsp;design,&nbsp;app&nbsp;development&nbsp;and&nbsp;branding&nbsp;for Art Galleries, Charities&nbsp;and NGO&nbsp;organisations&nbsp;across&nbsp;the&nbsp;country.&nbsp;</p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Flexible working hours</span>                            </li>                            <li>                                <span></span>                                <span>UK Visa Sponsorship</span>                            </li>                            <li>                                <span></span>                                <span>Remote working</span>                            </li>                            <li>                                <span></span>                                <span>Flexible holidays</span>                            </li>                            <li>                                <span></span>                                <span>Training and development</span>                            </li>                            <li>                                <span></span>                                <span>Contribute to Open Source projects</span>                            </li>                    </ul>                "
  },
  {
    "id": "sp3qKI9lTJCDxXxkVIau4g",
    "url": "https://weworkremotely.com/remote-jobs/namaste-technologies-release-engineer",
    "title": "Namaste Technologies: Release Engineer",
    "tags": [
      "DBG:surround``OR(abl,will,challeng,flexibl,experi,get,prefer) 2W 2N(work,remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(europ, european, europeanunion)",
      "DBG_TECH1:k/t/w:bash/other/1",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=1, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/integration",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 30, 2018 12:19:49 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>  <div>    <h2>Release Engineer</h2>      <h4>Posted Jun 29</h4>    <h3>      <span>Namaste Technologies</span><br>      <span>Headquarters: Dublin, Ireland</span><br>        <a href='https://www.namastetechnologies.com/careers/#release-engineer' rel='nofollow'>https://www.namastetechnologies.com/careers/#release-engineer</a>      <br>      <a rel='nofollow'>View all Namaste Technologies jobs →</a>    </h3>  </div>    </div>  <div>    <div><span>At this time we are only considering candidates located in the European Economic Area (EEA). If you are not currently residing in the EU please check back in the future for other opportunities.</span></div><div><br></div><div>Namaste is looking for a Release Engineer to join our team. The right person will be extremely organized, have an unparalleled eye for detail, and be confident in their skills to work independently (as well as part of a team). An understanding of the development process is a must. Experience supporting the servers and other infrastructure that production code runs on is a must. Beyond working in ops, infrastructure, and the software development process you should enjoy working in an evolving industry.</div><div><br></div><div><span>Most important:</span></div><div><br></div><ul><li>2-3 years supporting systems running on AWS services using technologies such as EC2, Cloudfront, S3, Route53, CodeBuild, and CodeDeploy.<br></li><li>2-3 years of working on a development team, in any capacity.<br></li><li>Creating and maintaining CI/CD pipelines.<br></li><li>Familiar with managing Docker containers.<br></li><li>Understanding of code Version Control Systems (like Git) and deployment processes.<br></li><li>In-depth understanding of eCommerce and common website and application features, along with confidence in your understanding of best practices.<br></li><li>Experience with Linux and Bash code.<br></li><li>Mastery of the English language, both written and spoken, and ability to communicate your ideas clearly and concisely.<br></li><li>Strong desire to constantly be learning and improving both yourself and the products our development team produces (be prepared to spend a great deal of time doing research on standards and best practices).<br></li><li>Willingness to go the extra mile to prevent a delay shipping new code to production.<br></li><li>Extremely tech-savvy, with a firm grasp on how to best communicate feedback to developers for a variety of situations.<br></li><li>A general passion for engineering and technology.<br><br></li></ul><div><span>Nice to have:</span></div><div><br></div><ul><li>Past application orchestration experience and a proven track record of automating processes within Chef, Ansible, or Puppet.<br></li><li>A background working as a SysAdmin or in another DevOps role.<br></li><li>Experience with working remotely, as there will likely be some remote work.<br></li><li>Past Agile team experience with daily Scrums.<br></li><li>Experience with managing big data infrastructure.<br></li><li>Experience using workflow platforms to provide feedback to development teams, such as Trello, JIRA, etc.<br><br></li></ul><div><span>Personal Traits:</span></div><div><br></div><ul><li>Independent<br></li><li>Fluent in English, written and spoken<br></li><li>Proven track record of always learning and growing<br></li><li>Always working to or willing to improve your work<br></li><li>Proactive attitude<br><br></li></ul><div><span>Benefits:</span></div><div><br></div><ul><li>Get the chance to work in an exciting industry<br></li><li>Stock Options<br><br></li></ul><div>We believe in building a team where developers can have access to an environment of growth and incredible opportunities. Our culture is based around the proactive, selfless values that make up every Namaste tribe member.<br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send a resume to <a href='mailto:marc@namastetechnologies.com' rel='nofollow'>marc@namastetechnologies.com</a> or apply via our website at <a href='http://www.namastetechnologies.com/careers' rel='nofollow'>www.namastetechnologies.com/careers</a></p>  </div>"
  },
  {
    "id": "BPrR3k-aR7GquzHNOZe1Xg",
    "url": "https://stackoverflow.com/jobs/195386/javascript-backend-developer-nodejs-remote-purepoint?a=13wDuWJxrsyY",
    "title": "Javascript backend developer Node.js - Remote - Smart home voice integrations at Purepoint  ",
    "tags": [
      "DBG:surround``2N( OR(employe,develop,engin,team,workmat), spread, OR(out,across) )",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG_TECH1:k/t/w:javascript/frontend/5",
      "DBG_TECH1:k/t/w:javascript/nodejs/5",
      "DBG_TECH1:k/t/w:node.js/nodejs/39",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=44, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/integration",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 73000,
      "maxValue": 100000,
      "info": "",
      "unit": "YEAR",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 28, 2018 12:25:04 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "                                    About this job                                                                                                                            <span>Job type: </span>                                        <span>Contract</span>                                                                                                                <span>Experience level: </span>                                        <span>Senior, Lead</span>                                                                                                                <span>Role: </span>                                        <span>Backend Developer</span>                                                                                                                                                                        <span>Industry: </span>                                        <span>Enterprise Web Solutions, Mobile Application, Software Development</span>                                                                                                                <span>Company size: </span>                                        <span>11-50 people</span>                                                                                                                <span>Company type: </span>                                        <span>Private</span>                                                                                                                                        Technologies                                            <a rel='nofollow'>node.js</a><a rel='nofollow'>javascript</a><a rel='nofollow'>alexa</a><a rel='nofollow'>alexa-voice-service</a><a rel='nofollow'>google-home</a>                                                                Job description                <p>We are looking for a&nbsp;<strong><u>Javascript Engineer to assist with our Node.js projects</u></strong>. We specialise in building bespoke software for global businesses. We are remote-first by design and have a team of highly-skilled and multi-disciplined engineers. We are proponents of Agile methodologies and our primary focus is to deliver exceptional value to our customers.</p><p>Currently, we are building applications across retail, energy, and IoT sectors. Our applications make life simpler; whether its processing millions of transactions or automating the smart home.</p><p>We are looking for a talented Engineer with a&nbsp;<strong><u>very strong Javascript background</u></strong>&nbsp;to join our Node.js team. You should be used to working with&nbsp;<strong>Node, AWS (Lambda, API Gateway, CloudFormation)</strong>,&nbsp;<strong>Serverless</strong>.&nbsp;<strong>Voice platform&nbsp;experience (Google Home, Alexa, Cortana etc) would give you a real competitive edge in this role too.&nbsp;</strong>This is a backend driven role, and you will be tackling difficult integration and architecture challenges.</p><p>This role is a full time,&nbsp;contract position and you can work from wherever you want. Our remote-first team are spread across 14 different countries. Our HQ is based in London, UK and you are welcome to drop by to say hello!</p><p><strong>Skills &amp; Qualifications</strong></p><ul><li>MUST: Very strong Javascript background (Node, ES6)</li><li>MUST: Experience performing in a team and working harmoniously with others</li><li>MUST: Native level written and spoken English</li><li>MUST: Experience with complex backend systems design</li><li>SHOULD HAVE: Experience integrating with voice systems (Google Home, Alexa etc)</li><li>SHOULD HAVE: Experience working with different languages and technologies</li><li>SHOULD HAVE: Ability to navigate, understand, and reuse large existing codebases</li><li>SHOULD HAVE: A basic understanding of UI/UX design principles</li><li>SHOULD HAVE: Functional programming experience</li><li>SHOULD HAVE: Experience working with complex server-side design</li></ul><p><strong>Responsibilities</strong></p><p>This role is perfect for a candidate that not only enjoys development, but also wants to have input on the best approach and implementation method. On a typical day you will:</p><ul><li>Take part&nbsp;in morning stand-up with the team via video</li><li>Work from a pull-based backlog of tickets writing server-side application logic to connect smart home devices and allow users to make voice command requests</li><li>Implement integrations between hardware and other third party voice input units such as Amazon Echo and Google Home</li><li>Write efficient and testable code</li><li>Review PRs created by your fellow team members</li></ul>                                                                                                                                        <a href='http://careers.purepoint.io/apply/0uS5h303gX/Javascript-Engineer-Nodejs-AlexaGoogle-Home' rel='nofollow'>                        Apply now        </a>                                                                                About Purepoint            <p><strong>What we look for</strong></p><p>An ideal candidate is autonomous, proactive, and has experience working in a variety of different languages. We admire developers who take initiative, make their own decisions and implement them clearly.</p><p>Delivering exceptional value to our clients is imperative. The ideal candidate is the perfect brand ambassador; a brilliant technical mind with the accompanying interpersonal skills necessary to function in a team environment.</p><p>As a Purepoint developer you will work in a small and close-knit group. Our mindset is focused on constant iteration and improvement.</p><p><strong>Tools</strong></p><p>We will give you all of the tools necessary to excel at your role. We use Jira, Trello, Slack, Github and Zoom (video conferencing) in our day-to-day business.</p><p>Our managerial structure is very flat. We put customer experience and satisfaction first and really believe in delivering a service that is cutting edge.</p>                                        Benefits                    <ul>                            <li>                                <span></span>                                <span>Remote</span>                            </li>                            <li>                                <span></span>                                <span>Unlimited Holiday Days</span>                            </li>                            <li>                                <span></span>                                <span>Competitive Pay</span>                            </li>                            <li>                                <span></span>                                <span>Personal Development</span>                            </li>                            <li>                                <span></span>                                <span>Open Source Funding</span>                            </li>                            <li>                                <span></span>                                <span>Free Lunch Fridays</span>                            </li>                            <li>                                <span></span>                                <span>Central London HQ</span>                            </li>                            <li>                                <span></span>                                <span>Open Workspace Available</span>                            </li>                    </ul>                "
  },
  {
    "id": "JUyy3ONnQrSVKwfe_fzSfg",
    "url": "https://weworkremotely.com/remote-jobs/taxjar-integration-developer-woocommerce",
    "title": "TaxJar: Integration Developer (WooCommerce)",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``headquart 3N remot",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:devise/ruby/8",
      "DBG_TECH1:k/t/w:php/php/10",
      "DBG_TECH1:k/t/w:phpunit/php/8",
      "DBG_TECH1:k/t/w:woocommerce/php/88",
      "DBG_TECH1:k/t/w:wordpress/php/10",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=8, apple=0, java=0, gamedev=0, php=116, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/integration",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 20, 2018 1:21:50 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>  <div>    <h2>Integration Developer (WooCommerce)</h2>      <h4>Posted Jun 19</h4>    <h3>      <span>TaxJar</span><br>      <span>Headquarters: Remote, USA</span><br>        <a href='http://www.taxjar.com' rel='nofollow'>www.taxjar.com</a>      <br>      <a rel='nofollow'>View all TaxJar jobs →</a>    </h3>  </div>    </div>  <div>    <div>TaxJar is the leading technology solution for busy eCommerce sellers to manage sales tax and is trusted by more than 10,000 businesses. Our mission is is to make eCommerce easier for everyone.<span>&nbsp;</span><br></div><div></div><div></div><div><span><br></span></div><div></div><div>OUR CORE VALUES<br></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div></div><ul><li>We do the right thing for our customers.</li><li>We're a team, built on trust.</li><li>We're proud to be remote.</li><li>We're in control of our own destiny.</li></ul><div><br></div><div>TaxJar’s remote-only team of 40 people is growing quickly. We have an immediate opening for a WooCommerce Developer to help build, maintain, and support our popular sales tax plugin used by thousands of WooCommerce merchants.<br></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div></div><div>We want you to join our growing platform integrations team to help build out the next generation of our WooCommerce plugin. The platform integrations team at TaxJar works directly with merchants, agencies, and partners to solve their business problems and devise clever solutions to accommodate the ever-increasing complexity of sales tax. Most of our integrations are built completely in-house to provide the best possible customer experience and unparalleled support. We bring new TaxJar features and improvements directly to eCommerce platforms such as WooCommerce via our API. As our ecosystem rapidly expands, you’ll have the opportunity to learn about many eCommerce platforms and create new integrations from scratch.<br></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div></div><div><span>*This is a full-time remote position available to folks located in the US.</span></div><div><span><br></span></div><div>AS AN INTEGRATION DEVELOPER AT TAXJAR (SPECIALIZING IN WOOCOMMERCE) YOU WILL<br></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><br></div><ul><li>Build out exciting new features in&nbsp;<a href='https://workable.com/nr?l=https%3A%2F%2Fgithub.com%2Ftaxjar%2Ftaxjar-woocommerce-plugin' rel='nofollow'>our WooCommerce sales tax plugin</a></li><li>Become a lead maintainer of our repo on GitHub and solve customer issues</li><li>Write strong, well-tested, scalable PHP code daily</li><li>Improve onboarding and UX for Woo merchants</li><li>Improve plugin performance for high volume stores</li><li>Be challenged to solve new problems</li><li>Review and test your teammates pull requests</li><li>Contribute to and maintain our existing WooCommerce tests</li><li>Learn new eCommerce platforms and assist with development</li><li>Help maintain our PHP sales tax API client with new features</li><li>Assist the customer success team with highly technical issues</li><li>Spend time working the customer success inbox. Our employees, even the CEO, spend time doing this - we’re all in it together.</li></ul><div><br></div><div>REQUIREMENTS</div><div><br></div><ul><li>Extensive experience with WooCommerce &amp; WordPress development</li><li>Ability to write clear and accurate tests using PHPUnit</li><li>Write code that is maintainable, readable, and follows WP standards / best practices</li><li>Well-versed in using WooCommerce &amp; WordPress</li><li>Be accountable for the code you deliver to production</li><li>Manage development tasks from assignment through to production</li><li>Agile, humble, trustworthy, and a team player</li><li>Rapid learner who thrives in a fast-paced and demanding environment</li><li>Passion for building simple and intuitive solutions for complex problems in eCommerce</li><li>Excel at communicating with the team remotely (chat, video, email, etc)</li></ul><div><br></div><div>YOU'LL BE A GREAT FIT FOR OUR TEAM IF YOU<br></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><strong><br></strong></div><ul><li>Only want to work remotely</li><li>Are a PRO at communicating and collaboration</li><li>Highly value working with people you like and respect</li><li>Are accountable</li><li>Are confident in your skills and a solid team player (We’re peers here, no egos please) but also comfortable working asynchronously</li><li>Hungry to play an impactful role and not afraid to fail</li></ul><div><br></div><div><a href='https://workable.com/nr?l=https%3A%2F%2Flife.taxjar.com%2F' rel='nofollow'>We’re a happy team</a><span>&nbsp;and we all really love what we do. We've created a space where high-achievers can succeed, but are also safe to fail. We're profitable and focused on growing TaxJar sustainably. We're always learning how to make TaxJar the best place to work for all of us, and not just another tech startup. We’re always looking for an amazing new teammates to come share in the excitement of solving real-world problems with technology.</span><br></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div>BENEFITS</div><div><br></div><ul><li>Excellent health, vision and dental benefits</li><li>Flexible vacation policy (we’ll actually pay you $500 a year to take time off!)</li><li>$1,000 in professional development credit</li><li>Home office stipend</li><li>Equity in a profitable company&nbsp;</li><li>2x year all-company in person retreats (fully paid for by us of course)</li><li>Brand new Macbook computer&nbsp;</li><li>Mandatory Birthday holiday!</li><li>12 week paid maternity/ 6 week paid paternity leave</li><li>Monthly perks reimbursement for things like Netflix, Amazon Prime, your gym membership, home internet and more.</li></ul><div><span><br></span></div><div>We offer all of our employees amazing benefits. Visit&nbsp;<a href='https://workable.com/nr?l=https%3A%2F%2Fwww.taxjar.com%2Fjobs' rel='nofollow'>www.TaxJar.com/jobs</a>&nbsp;for a full list of our benefits and to learn more about how we work and what we stand for.<br></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div><strong>If you're not the perfect fit for this position, but you know someone who is, we'll pay you $1,000 if you refer us to the person we hire.</strong></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://taxjar.workable.com/jobs/748990/candidates/new' rel='nofollow'>https://taxjar.workable.com/jobs/748990/candidates/new</a> Please treat this as your first interview. We receive lots of resumes, so here's your chance to stand out from the crowd.</p>  </div>"
  },
  {
    "id": "YaqTf38kTIifLj7LsiJVOQ",
    "url": "http://www.indeed.com/viewjob?t=Integration+Developer&c=TUATARA+SP.+Z+O.O.&l=Junior,+WV&jk=8802abba2e80ec22&rtk=1ch1i5g3tadufegj&from=rss",
    "title": "JUNIOR INTEGRATION DEVELOPER - TUATARA SP. Z O.O. - Junior, WV",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=2, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/50",
      "TECH1/java",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 7, 2018 8:07:33 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div><b>JUNIOR INTEGRATION DEVELOPER</b><br><span>TUATARA SP. Z O.O.</span>     -<span>Junior, WV</span>    </div><span><div><div><div><div><div><div><div><p><b>ARE YOU:</b></p></div></div></div></div></div></div><div><div><div><div><div><div><ul><li>enthusiastic about translating business needs into solutions that are on the cutting edge of technology and pragmatic at the same time</li><li>passionate about solving problems of the digital natives</li><li>eager to learn and work with the most innovative technologies?</li></ul><p>If you answered YES to any of those, we are looking forward to meeting you.</p><p>By the way, we do a lot of projects in the Middle East. Sounds interesting?</p><p>TUATARA combines the energy and elasticity of a startup with professionalism of a big company that attracts the best talents.</p><p>What we offer:</p><ul><li>regular employment with flexible working conditions and good salary, private medical care</li><li>modern office in the center of Warsaw with good equipment</li><li>welcoming organizational culture, team of people focused on cooperation and development</li><li>remote work possibility</li></ul><p>We are like no other. Apply and see for yourself.</p></div></div></div></div></div></div></div><br><div><h2><b>Your Role:</b></h2><p>You will be a member of a development team that implements projects in the areas of Integration and Business Process Management. You will work in: Java, JavaScript, ESQL, XSLT, SOAP / REST, WebServices and with IBM tools: IBM Integration Bus, IBM API Connect and IBM ODM, in particular.</p><p>Your <b>required</b> experience and skills:</p><ul><li>knowledge of JavaScript, SQL, SOAP and REST</li><li>knowledge of Java basics</li><li> knowledge of XSLT I XPATH</li><li>very good communication and interpersonal skills as well as predispositions for teamwork</li><li>responsibility, initiative, results and goal orientation</li><li>flexibility, willingness to develop and work in a technologically diverse environment</li></ul><p>What we offer:</p><ul><li>welcoming organizational culture, team of people focused on cooperation and development</li><li>the opportunity to gain experience in large IT projects and access to the latest technologies</li><li>permanent cooperation, professional development opportunities and participation in various projects, also abroad</li><li>modern, well equipped office in the center of Warsaw</li><li>good salary and attractive benefits, including free private medical care and sports packages</li></ul><p>If you are interested, please send your application to: praca@tuatara.pl</p></div></span>"
  },
  {
    "id": "kUtk7RrIQmmtL-d6Gm5VkA",
    "url": "http://www.indeed.com/viewjob?t=Integration+Developer&c=TUATARA+SP.+Z+O.O.&l=Junior,+WV&jk=8802abba2e80ec22&from=rss",
    "title": "JUNIOR INTEGRATION DEVELOPER - TUATARA SP. Z O.O. - Junior, WV",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=2, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/50",
      "TECH1/java",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 7, 2018 8:07:33 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div><b>JUNIOR INTEGRATION DEVELOPER</b><br><span>TUATARA SP. Z O.O.</span>     -<span>Junior, WV</span>    </div><span><div><div><div><div><div><div><div><p><b>ARE YOU:</b></p></div></div></div></div></div></div><div><div><div><div><div><div><ul><li>enthusiastic about translating business needs into solutions that are on the cutting edge of technology and pragmatic at the same time</li><li>passionate about solving problems of the digital natives</li><li>eager to learn and work with the most innovative technologies?</li></ul><p>If you answered YES to any of those, we are looking forward to meeting you.</p><p>By the way, we do a lot of projects in the Middle East. Sounds interesting?</p><p>TUATARA combines the energy and elasticity of a startup with professionalism of a big company that attracts the best talents.</p><p>What we offer:</p><ul><li>regular employment with flexible working conditions and good salary, private medical care</li><li>modern office in the center of Warsaw with good equipment</li><li>welcoming organizational culture, team of people focused on cooperation and development</li><li>remote work possibility</li></ul><p>We are like no other. Apply and see for yourself.</p></div></div></div></div></div></div></div><br><div><h2><b>Your Role:</b></h2><p>You will be a member of a development team that implements projects in the areas of Integration and Business Process Management. You will work in: Java, JavaScript, ESQL, XSLT, SOAP / REST, WebServices and with IBM tools: IBM Integration Bus, IBM API Connect and IBM ODM, in particular.</p><p>Your <b>required</b> experience and skills:</p><ul><li>knowledge of JavaScript, SQL, SOAP and REST</li><li>knowledge of Java basics</li><li> knowledge of XSLT I XPATH</li><li>very good communication and interpersonal skills as well as predispositions for teamwork</li><li>responsibility, initiative, results and goal orientation</li><li>flexibility, willingness to develop and work in a technologically diverse environment</li></ul><p>What we offer:</p><ul><li>welcoming organizational culture, team of people focused on cooperation and development</li><li>the opportunity to gain experience in large IT projects and access to the latest technologies</li><li>permanent cooperation, professional development opportunities and participation in various projects, also abroad</li><li>modern, well equipped office in the center of Warsaw</li><li>good salary and attractive benefits, including free private medical care and sports packages</li></ul><p>If you are interested, please send your application to: praca@tuatara.pl</p></div></span>"
  },
  {
    "id": "HT0mpZ-WQeCvyySbVRzWTQ",
    "url": "http://www.indeed.com/viewjob?t=Integration+Developer&jk=8802abba2e80ec22&",
    "title": "JUNIOR INTEGRATION DEVELOPER - TUATARA SP. Z O.O. - Junior, WV",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:java/java/4",
      "DBG_TECH1:k/t/w:java/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=2, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=4, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/50",
      "TECH1/java",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 7, 2018 8:07:33 AM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<h3>JUNIOR INTEGRATION DEVELOPER</h3><div>Company: TUATARA SP. Z O.O.<br></div><div>Location: Junior, WV<br></div><span><div><div><div><div><div><div><div><p><b>ARE YOU:</b></p></div></div></div></div></div></div><div><div><div><div><div><div><ul><li>enthusiastic about translating business needs into solutions that are on the cutting edge of technology and pragmatic at the same time</li><li>passionate about solving problems of the digital natives</li><li>eager to learn and work with the most innovative technologies?</li></ul><p>If you answered YES to any of those, we are looking forward to meeting you.</p><p>By the way, we do a lot of projects in the Middle East. Sounds interesting?</p><p>TUATARA combines the energy and elasticity of a startup with professionalism of a big company that attracts the best talents.</p><p>What we offer:</p><ul><li>regular employment with flexible working conditions and good salary, private medical care</li><li>modern office in the center of Warsaw with good equipment</li><li>welcoming organizational culture, team of people focused on cooperation and development</li><li>remote work possibility</li></ul><p>We are like no other. Apply and see for yourself.</p></div></div></div></div></div></div></div><br><div><h2><b>Your Role:</b></h2><p>You will be a member of a development team that implements projects in the areas of Integration and Business Process Management. You will work in: Java, JavaScript, ESQL, XSLT, SOAP / REST, WebServices and with IBM tools: IBM Integration Bus, IBM API Connect and IBM ODM, in particular.</p><p>Your <b>required</b> experience and skills:</p><ul><li>knowledge of JavaScript, SQL, SOAP and REST</li><li>knowledge of Java basics</li><li> knowledge of XSLT I XPATH</li><li>very good communication and interpersonal skills as well as predispositions for teamwork</li><li>responsibility, initiative, results and goal orientation</li><li>flexibility, willingness to develop and work in a technologically diverse environment</li></ul><p>What we offer:</p><ul><li>welcoming organizational culture, team of people focused on cooperation and development</li><li>the opportunity to gain experience in large IT projects and access to the latest technologies</li><li>permanent cooperation, professional development opportunities and participation in various projects, also abroad</li><li>modern, well equipped office in the center of Warsaw</li><li>good salary and attractive benefits, including free private medical care and sports packages</li></ul><p>If you are interested, please send your application to: praca@tuatara.pl</p></div></span>"
  },
  {
    "id": "p3UpohrmRXyj-dVE8mEmgw",
    "url": "https://news.ycombinator.com/item?id=17206511",
    "title": "Open-Xchange | Release and Integration Engineer USA (Engineering Services) | REMOTE (East Coast USA preferred) | Full-Time",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 1, 2018 6:52:05 PM",
    "validThrough": "Jan 1, 1970 3:00:00 AM",
    "content": "<div>                  <span>Open-Xchange | Release and Integration Engineer USA (Engineering Services) | REMOTE (East Coast USA preferred) | Full-Time<p>Looking for somebody to join the growing US Engineering Services team to coordinate releases and integration. Docker, Vagrant, Chef skills required, as well as scripting and general web development knowledge.</p><p>Open-Xchange is the largest email provider to hosting companies and telecoms with a global reach. We own the Dovecot IMAP server, OX App Suite web frontend and middleware, and PowerDNS. This job entails release management and integration for custom development as requested by customers; some customer interaction is necessary with minimal travel. Trips to Germany a couple times a year for team meetings, as the HQ is located there. Reporting to a US-based manager, flexible schedule, 100% remote, with benefits and annual bonus. Help support OX's mission to make a borderless internet which is open, safe, and free.</p><p>Full job description: <a href='https://www.open-xchange.com/about-ox/career/jobs/release-and-integration-engineer-usa-engineering-services-mfnbsp/' rel='nofollow'>https://www.open-xchange.com/about-ox/career/jobs/release-an...</a></p><p>Please send resume to recruiting@open-xchange.com and include job code &quot;ES01&quot; in the subject line.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>"
  }
]
}
