{
 "items": [
  {
    "id": "I1uy1pBzSOSkUDlEt2C0Gg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/200965-solutions-architect-sales-engineer-consensys-enterprise",
    "title": "Solutions Architect / Sales Engineer - ConsenSys Enterprise",
    "content": "<div><h2>Solutions Architect / Sales Engineer - ConsenSys Enterprise at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$120K–$200K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Apply Here: <a href='https://consensys.net/open-positions/?bzid=5e75cb05b559' rel='nofollow'>https://consensys.net/open-positions/?bzid=5e75cb05b559</a></p><p>The Role</p><p>We are currently seeking Solution Architects / Sales Engineers to join our Enterprise team. In this position you will be the technical representative for ConsenSys' products and services, working closely with our Business Development Managers and Delivery Leads in our Enterprise organizartion.</p><p>This is a hands-on technologist role -- you are not just doing slideware, you’re crafting enterprise blockchain solutions for large organizations. Experience seeing the entire lifecycle from conception to design to technology evaluation to pilot program to implementation to maintenance and support is crucial.</p><p>Solutions Architects / Sales Engineers do not act as typical consultants - they function as blockchain technical leads &amp; architects during the sales process in conjunction with a sales lead, at our client locations for short term engagements and do everything from developing initial prototype applications to running training and remaining engaged through delivery.</p><p>Database, distributed systems, full stack development, security &amp; cryptography, and previous blockchain (especially Ethereum) experience are all huge pluses. We're looking for customer-facing hands-on technologists with a track record of success to join us in locations throughout North America, Europe, and Asia Pacific.</p><p>Our Solutions Architects / Sales Engineers are responsible for securing the client's technical endorsement through complex sales processes including: requirements gathering, solution architecture, product and competitive positioning, partner enablement, proposal generation and drafting appropriately scoped statements of work. You could be onstage at a conference one day, working on a client proposal the next, and delivering partner training the following week, all while collaborating with our product teams on feature roadmaps, token launches or marketing roadshows.</p><p>A great candidate for this position will be confident whether espousing the business benefits of blockchain technology to executives or diving into code with developers. This person will have a minimum of 3 - 5 years of experience working with with technologists and executives through enterprise software sales cycles, notably with experience in emerging technology ecosystems. If you worked in a pre-sales technical or consulting role at a leading big data, machine learning, or PaaS company for the past few years, you may well have the type of background we are looking for. A similar background at a leading systems integrator or in solutions delivery is also relevant. You need to be comfortable being held accountable to client-based outcomes and in particular vendor/technology selection.</p><p>From a tactical standpoint, you are highly effective at leading discovery meetings, designing and presenting bespoke sales proposals, staying current on blockchain technology developments, and building and delivering product / technology demos. You must take a hands on approach to technology, collaborating with our internal development teams and clients alike. Last but not least, we expect the solution architects / sales engineers to complete a successful project handover to the delivery team assigned to the project and maintain the client relationship through the delivery phase.</p><p>If you are ready to take the leap in joining a fast growing company in a business development capacity, we encourage you to apply today!</p><p>Ability to travel 30-50+% required. Varies by location and team.</p><p>Responsibilities:</p><p>You would be working with customers, partners, and prospects to understand and propose solutions using ConsenSys technologies<br>Lead technical sales process for numerous customers day to day, from introductory meetings (net new sales) through post-sales (customer satisfaction, upselling, and subscription renewals)<br>Map your customer requirements to current and future offerings<br>Educate your prospects on the business value of blockchain in general, Ethereum and ConsenSys' offerings<br>Drive progress towards successful sales, in concert with Business Development Managers and Delivery Leads<br>You should focus on customer success<br>Continuously learn and update your skills in quickly evolving technologies<br>Qualifications:</p><p>Ability to switch context quickly throughout the day with numerous contending demands<br>Minimum 3 years experience and success working in a customer-facing role<br>Hands-on, technical, problem solver<br>Development experience with OO programming and full stack development<br>Unix/Linux expertise required<br>Comfortable partenering with customers and public speaking<br>Demonstrated experience gathering and understanding customer business requirements<br>Experience with full stack development and modern development tools<br>Knowledge of distributed systems<br>Experience with many of the following:</p></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:40:39 PM",
    "tags": [
      "Brooklyn",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Software Engineer",
      "TECH1/bigdata-ml",
      "TITLE1/solution",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "esy2Nc2bSuy_hm79dhEYxA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16285404",
    "title": "Endjin | UK | Azure | https://endjin.com",
    "content": "<div>                  <span>Endjin | UK | Azure | <a href='https://endjin.com' rel='nofollow'>https://endjin.com</a><p>Do you think you would like to come and explore what is happening in data, analytics and business transformation with us in 2018?</p><p>Are you the kind of person that just can't leave a question unanswered? Do you really want to know how things work, and share that knowledge with your team and the wider community? Do you understand how people and technology can come together to craft something special, each reshaping the other?</p><p>Endjin are hiring developers at all levels, from apprentices to seniors, to work on exciting projects with clients from all over the world, in verticals from retail to financial services, utilities and media.</p><p>We build modern data platforms in the cloud, and use them to help businesses adopt machine learning, data science, and automation.</p><p>We work with fascinating new technologies like Service Fabric, Reactor, Cosmos DB, and Data Lake to develop novel software architecture at the boundaries of hyperscale computing, for our clients, our own internal IP, and partners like Microsoft.</p><p>We increase our value by using our products, blueprints and library of intellectual property, sharing the benefit with our clients and partners.</p><p>We value life-long learning and an eye for quality. We will help you to find the best learning techniques, tools, and team-working, so that you can achieve your potential, and deliver the best value to our clients; while balancing your personal goals and home life.</p><p>Our employees have a mutual respect, regardless of where they are in their career. Ideas are developed by the whole team, from interns to seniors.</p><p>Equally, our clients pass the &quot;nice to work for&quot; test (and usually do so with flying colours). As part of that, we try to understand the ethical implications of the work we undertake. We seek to do the best we can for each other, for our profession, clients, and for the world at large.With no external investors, endjin has been built as a sustainable, lifelong business: we are a company to retire out of, not exit at the expense of the employees.</p><p>You can work remotely from anywhere in the UK, and we hold meet-ups in London on a regular basis. You design your ideal working environment, and we will make it happen together.</p><p>Apart from a real passion for learning, you probably dream in data - how it can be represented, handled, secured and manipulated. A bit of maths improves your day. You know a couple of programming languages pretty well (we do a lot of C# and Typescript, but you may know R, or Python too). You love working with other people, but value the opportunity to spend time in your own head, thinking things through.</p><p>You can learn more about our projects at <a href='https://endjin.com' rel='nofollow'>https://endjin.com</a>, see a video about our career development pathways <a href='https://vimeo.com/200191869' rel='nofollow'>https://vimeo.com/200191869</a> or read our blog <a href='https://blogs.endjin.com' rel='nofollow'>https://blogs.endjin.com</a></p><p>Contact us on hello-at-endjin-dot-com if you think this looks like a good opportunity for you.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 10:12:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/python",
      "TITLE1/solution",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "python"
    ]
  },
  {
    "id": "uEQs3_P1SUeUWhicUK7tpA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16284013",
    "title": "Ciena | IT Cloud Architect | ONSITE (Baltimore, MD) or REMOTE, USA | Full-Time",
    "content": "<div>                  <span>Ciena | IT Cloud Architect | ONSITE (Baltimore, MD) or REMOTE, USA | Full-Time<p>IT Infrastructure Enterprise Cloud Architect</p><p>Diverse existing and new business system workloads needs to move to AWS, Azure (or Oracle?!?!) clouds.Large migration project. Hands on cloud and automation experience required, as well as ability to drive discussions and vision at executive level.Candidate would be able to get to Hanover, MD office easily.  Either local or remote.</p><p>Ciena is a major network gear and software vendor, probably this message went over our gear to reach you.  In addition to using cloud providers, they are our customers.</p><p><a href='https://ciena.wd5.myworkdayjobs.com/en-US/Careers/job/US-MD-Hanover-7031/Cloud-Infrastructure-Architect_R006901-1' rel='nofollow'>https://ciena.wd5.myworkdayjobs.com/en-US/Careers/job/US-MD-...</a></p><p>Copy me as well please pwarner@&lt;company-name&gt;.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 8:00:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "mCnAmIFCSgOJjz9uBbQHPw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/429-cloud-solution-engineer",
    "title": "Cloud Solution Engineer",
    "content": "Cloud Solution Engineer - Jobmote<div><div><h2>Cloud Solution Engineer</h2><h5>Dito</h5></div></div><div><div><div><div><div><p>Dito is looking for a Cloud Solutions Engineer to join our team! &nbsp;&nbsp;The position is remote so you will get to enjoy the luxuries and flexibility of working from home.</p><p>As a Cloud Solutions Engineer, the key responsibility will be to drive enterprise infrastructure, applications and analytics to public clouds while supporting the Sales team to develop and earn new business with prospects and existing customers. &nbsp;The position may be remote but our teams work together closely with you playing a crucial role in addressing “buying” questions that will involve the design and implementations of public and hybrid cloud application architecture, as well as cloud-hosted business intelligence. &nbsp;</p><p>You will get to leverage your creative juices and technical abilities around infrastructure, system and application design using web, mobile, cloud, and open source technologies. Experience across various enterprise solutions/ technology stacks (IaaS/PaaS/SaaS) and ability to provide guidance to diverse stakeholders and external vendors will be the foundation of yours and our success! &nbsp;</p><p>A few details about your day to day objectives;</p><ul><li>Lead change across large platforms / functional areas / organizations to public clouds.</li><li>Conduct architectural and engineering review of proposed IT investments/solutions to determine the strategic alignment and technical soundness.</li><li>Demonstrate thought leadership in cloud computing across multiple channels and become a trusted advisor to decision makers.</li><li>Identify, develop and document repeatable design and implementation methodology </li><li>Partner with project teams, vendors, support organizations, functional architects, systems specialists and other technical resources in this hands-on role driving cloud migration/adoption from inception to production implementation.</li><li>Collaborate with the product, data, and infrastructure architects and be responsible for the defining-designing-delivering the technical architectures, patterns, technical quality, risks, fitness for purpose and operability of technical architecture solutions.</li><li>Provide technical recommendations to senior executives to assist the decisions on proposed IT investments/solutions and assume responsibility for technical presentations demonstrating a good understanding of application, data, infrastructure, architecture expertise and application systems design. </li><li>Lead application workload and data migration, design and build interfaces between applications and other providers, as well as ownership of overall migration effort, workloads, backup and DR services &nbsp;</li><li>Able to analyze, design, and implement cloud migration strategies without impacting business continuity </li><li>Project scoping skills; methods, knowledge and experience of application processes, development, implementation and deployment to achieve project objectives. </li></ul></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Jan 26, 2018 7:28:29 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "ZNzNM3U9RuameTG6Mj_3GA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/64017",
    "title": "Solutions Architect - Ruby/Python/React",
    "content": "Remote Solutions Architect - Ruby/Python/React at Analytics Fire     <div><a rel='nofollow'><i></i></a></div><div><a rel='nofollow'>JSON</a></div><div>SourceWe Work Remotely✖ remove✚ add filter</div><i></i><div><div></div><div><h2><a rel='nofollow'><span>Remote</span></a><a rel='nofollow'><span>OK</span></a></h2></div><div></div><div></div><div><h2>let's find you <em>a job</em><br>you can do <em>anywhere</em></h2></div><div></div></div><div><div><h2><a rel='nofollow'><span>Remote</span></a><a rel='nofollow'><span>OK</span></a></h2></div><div></div></div><div><div><div><a rel='nofollow'><p><i></i><span>Remote </span> Jobs</p></a><a rel='nofollow'><p><i></i>Software Development</p></a><a rel='nofollow'><p><i></i>Customer Support</p></a><a rel='nofollow'><p><i></i>Marketing</p></a><a rel='nofollow'><p><i></i>Design &amp; UX</p></a><a rel='nofollow'><p><i></i>Non-tech</p></a><a rel='nofollow'><p><i></i>Highest Paid Remote Jobs</p></a><a rel='nofollow'><p><i></i>Remote Companies</p></a><a rel='nofollow'><p><i></i>Remote Work Statistics</p></a></div></div><div></div><div><div><div><p><i></i>&nbsp;    Jobs</p></div><div><p><i></i>&nbsp;    People</p></div></div></div><div><div><p>Are you hiring for a remote JavaScript position?</p><a rel='nofollow'>Post a Job</a>&nbsp;in this section</div><table></table></div></div><a href='https://nomadlist.com' rel='nofollow'><div></div></a><div><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i></div><div></div><div><div><a href='http://dribbble.com' rel='nofollow'><div><i></i></div></a><a href='http://behance.com' rel='nofollow'><div><i></i></div></a><a href='http://github.com' rel='nofollow'><div><i></i></div></a><a href='http://stackoverflow.com' rel='nofollow'><div><i></i></div></a><a href='http://weworkmeteor.com' rel='nofollow'><div><i></i></div></a><a href='http://weworkremotely.com' rel='nofollow'><div><i></i></div></a><a href='http://wfh.io' rel='nofollow'><div><i></i></div></a><a href='http://authenticjobs.com' rel='nofollow'><div><i></i></div></a></div></div><div><a href='https://twitter.com/remote_ok' rel='nofollow'>Follow @remote_ok</a></div><div><div><a title=&quot;Product Hunt&quot; href='http://www.producthunt.com/posts/remote-ok' rel='nofollow'></a><a title=&quot;Hacker News&quot; href='https://news.ycombinator.com/item?id=9089778' rel='nofollow'></a><a title=&quot;Reddit&quot; href='http://www.reddit.com/r/digitalnomad/comments/2wral0/remote_ok_a_daily_aggregator_of_all_remote_jobs/' rel='nofollow'></a><a title=&quot;The Next Web&quot; href='https://www.facebook.com/thenextweb/posts/10153107210758523' rel='nofollow'></a><a title=&quot;Pinboard&quot; href='https://twitter.com/PinPopular/status/570004194632929281' rel='nofollow'></a><a title=&quot;Forbes&quot; href='http://www.forbes.com/sites/kaviguppta/2015/02/25/digital-nomads-are-redefining-what-it-means-to-be-productive/' rel='nofollow'></a><a title=&quot;Fast Company&quot; href='http://fastcompany.com/3043519/work-from-anywhere-startups-for-global-digital-nomads' rel='nofollow'></a><a title=&quot;Lifehacker&quot; href='http://lifehacker.ru/2015/02/26/traveling-freelancer/' rel='nofollow'></a><a title=&quot;Pinterest&quot; href='https://www.pinterest.com/pin/165999936241585050/' rel='nofollow'></a><a title=&quot;CareerDean&quot; href='https://www.careerdean.com/q/field-cross-paths-traveling' rel='nofollow'></a></div></div><div></div><a rel='nofollow'><i></i></a><div></div><div></div><div><span>Need help?</span><i></i><span>Need help? Have feedback?</span><span>Thanks for the message! We will get back to you soon.</span><div>Send</div></div><div></div>",
    "urlFetchPending": false,
    "published": "Jan 1, 2018 9:19:38 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "Bu8Jb_FGTuezU7fm5MBo-g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30154?r=rss2",
    "title": "Analytics Fire: Solutions Architect - Ruby/Python/React",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><h2><span>Job Description</span></h2><p><span>Analytics Fire builds custom software for the solar power industry. We’re looking for a collaborative but hands-on Solutions Architect to help us scale our execution to support additional new high-tech sectors.</span></p><p>&nbsp;</p><p><span>Analytics Fire is a deeply technical engineering organization. Most of us are software engineers and spend the majority of our time on heads down engineering activities like coding. Our goal in creating this position is to expand our small client-facing team with a unique person that has both the personality and the technical skill set to collaborate directly with clients and senior members of the technical team in order to help steer technical decision making and requirements gathering, especially early in the project lifecycle.</span></p><p>&nbsp;</p><p><span>This position is similar to that of a technical Program Manager, but you will be much more involved in the technical details and hurdles around software architecture than a traditional Project Manager would be. Our ideal candidate is a current or former full stack Software Engineer that is willing to be trained in formal Program Management processes (or has already been trained in formal Program Management processes).</span></p><p>&nbsp;</p><p><span>As a small company, Analytics Fire is able to tailor roles around the strengths of our individual team members. We will tailor this role to your specific technical background. However, it is a hard requirement that you are able to support the following 3 types of responsibilities:</span><strong></strong></p><p>&nbsp;</p><ul><li><p><span>(a) Represent Analytics Fire software engineering teams in client-facing interactions (and sometimes interactions with potential clients)</span></p></li><li><p><span>(b) Technical writing responsibilities such as documenting requirements, project plans, system architecture, etc.</span></p></li><li><p><span>(c) Making meaningful contributions to the execution of complex software projects.</span></p></li></ul><p>&nbsp;</p><p><span>For reference, here is a list of technologies and tools we are currently actively using on a day-to-day basis:</span><strong></strong></p><p>&nbsp;</p><ul><li><p><span>Front-end: JavaScript / React / Angular</span></p></li><li><p><span>Back-end: Ruby / Python / Node.js</span></p></li><li><p><span>Embedded (IoT): C, Embedded Linux, MQTT</span></p></li><li><p><span>Embedded (robotics): C/C++, ROS</span></p></li><li><p><span>Modern software techniques: RESTful APIs, SOA, PaaS, etc</span></p></li><li><p><span>Agile collaboration and devops tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc</span></p></li><li><p><span>Other technologies we are currently building with: AWS / Salesforce platform / iOS / ARKit</span></p></li></ul><p>&nbsp;</p><p><span>Your primary responsibility will be to assist in guiding new projects through sales, planning, development, and deployment. This will be accomplished through a combination of client interactions, technical writing, and participation in formal sales, program management, and engineering related processes. Your contributions will naturally be slightly front-loaded towards the sales and planning phases, however you will remain deeply connected to each project through the entire lifecycle in order to ensure conceptual integrity is maintained from design to final implementation.</span><strong></strong></p><p>&nbsp;</p><p><span>This is a remote position but is only open to candidates living in the US or Canada. We’re flexible about location and hours. We’re a really great match for candidate who wants to work hard on interesting projects, while also having flexibility around time and geography.</span><strong></strong></p><h2><span>Skills &amp; Requirements</span></h2><p><span>“Must have” requirements:</span><strong></strong></p><p>&nbsp;</p><ul><li><p><span>5+ years relevant hands-on experience as a full stack Software Engineer, DevOps engineer, or Site Reliability Engineer, ideally within a commercial startup environment.</span></p></li><li><p><span>Fluency around current modern best practices around software development and DevOps.</span></p></li><li><p><span>Soft skills necessary to navigate and negotiate with multiple teams, both internal and external to Analytics Fire.</span></p></li><li><p><span>Ability and willingness to familiarize yourself with our technical stack.</span></p></li><li><p><span>Superior organization and detail orientation.</span></p></li><li><p><span>Excellent written and verbal communication skills.</span></p></li><li><p><span>Willingness to design, document, and evangelize new engineering processes to meet evolving organizational requirements.</span></p></li></ul><p>&nbsp;</p><p><span>“Nice to have” requirements:</span><strong></strong></p><p>&nbsp;</p><ul><li><p><span>Former work experience or training as a technical Program Management.</span></p></li><li><p><span>Technical experience with Ruby, Python, or Node.js.</span></p></li></ul><h2><span>About Analytics Fire</span></h2><p><span>Analytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups. </span></p><p>&nbsp;</p><p><span>“We founded Analytics Fire to create the engineering department that we always dreamed of working for. To us that means being able to spend our time working on interesting technical problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”</span></p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Dec 27, 2017 9:44:21 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/embedded",
      "TECH1/nodejs",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "c",
      "embedded",
      "nodejs"
    ]
  },
  {
    "id": "OxyG7yUaSxWxGh_ulwjbjA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/162942/solutions-architect-french-native-speaker-platformsh?a=SE22LLorCAE",
    "title": "Solutions Architect (French native speaker) at Platform.sh () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Continuous Delivery, PaaS</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Company presentation :</strong></p><p>Platform.sh is a groundbreaking hosting and development tool for web applications. We’re a European VC-Backed startup with a host of blue-chip Enterprise clients and a string of awards and grants (including €2m from the EU Horizon 2020 program). To reinforce our technical prowess, we are looking to grow our Customer Solutions team with an engineer that also enjoys customer relations. If you’re looking for an exciting, high-growth opportunity with an award-winning, cutting-edge company, this could be just the job for you.</p><p>Our customers run thousands of web applications in over 100 countries consuming 10s of thousands of CPUs on multiple public clouds. We were shipping containers before Docker, our sales team can explain the CAP Theorem, and our marketing director programs Haskell.</p><p>We can clone whole running systems, including the data, services, and networking in a matter seconds. The main API to operate and orchestrate our clusters of LXC containers is Git. We're hardcore technologists with equally hardcore customers.</p><p>We're looking for strong technologists who are good at providing valuable services directly to customers.</p><p>Our customers run thousands of web applications in over 100 countries consuming 10s of thousands of CPUs on multiple public clouds. We were shipping containers before Docker, our sales team can explain the CAP Theorem, and our marketing director programs Haskell.</p><p>We can clone whole running systems, including the data, services, and networking in a matter seconds. The main API to operate and orchestrate our clusters of LXC containers is Git. We're hardcore technologists with equally hardcore customers.</p><p>We're looking for strong technologists who are good at providing valuable services directly to customers.</p><p><strong>Mission :</strong></p><p>Our customers need on-boarding and training before they can master the Platform.sh fun. Can you deliver breathtaking and exhilarating tech demos, and explain the intricacies of command line tools? We run OEM PaaS services for famous brands like Magento Enterprise Cloud Edition and Sensio Cloud - can you help us build and run these vibrant software products?</p><p>Please kindly note this position is for a French native speaker, as a strong focus on our French speaking customers is expected.</p><p>Directly reporting to our Director of Customer Solutions and in close interaction with our Sales, Support, Engineering and Infrastructure teams, you will be responsible for selling and proactively ensuring a stable and secure product experience:</p><ul><li>tailoring product to meet prospects requirements</li><li>working closely with sales teams for product demos and answering technical questions</li><li>on-boarding and training new customers</li><li>demonstrating customer business knowledge in the light of our product utilization</li><li>analyzing customers’ technical needs to suggest consulting services and meet their requirements</li><li>supporting our large accounts in their daily use of our product</li><li>liaising with engineering teams when necessary for product improvement</li><li>getting up to speed regularly with our new product features</li></ul><p>You will give our customers their very first impression of our product, leading the path to high satisfaction in their product experience.<br><br></p><p><strong>The ideal candidate must have :</strong></p><ul><li>Proven successful experience in handling technical customer relations in the web industry</li><li>Demonstrated the ability to successfully matching customer expectations with product capacity</li><li>Extensive knowledge of web application architecture and services (DNS, CDN, web servers, databases, cache layers, etc.) and distributed systems.</li><li>Extensive knowledge of web development workflows and existing tools (git, CI tools)</li><li>Knowledge of common web applications and frameworks: Magento Ecommerce, Symfony, Drupal, eZ Platform, or Typo3 (a lot of our customers run those)</li><li>Knowledge of cloud services (AWS, Azure)</li><li>Dynamism with a cool head</li><li>Excellent communication skills with English proficiency as a French native speaker - location does not matter as this is a remote position</li></ul><p><strong>Nice to have :</strong></p><ul><li>Mad Linux (Debian) skillz</li><li>Public speaking experience</li></ul>                    </div>                            <h2>                About Platform.sh            </h2>            <div><p>We’re a venture capital funded, award-winning team of hard-core hackers who want to revolutionize the way that developers and agencies build and deploy web applications. We’re mostly distributed, but we meet up daily in cyberspace, and occasionally in Paris, France. &nbsp;We value enthusiasm, team spirit, and a constant desire to expand personal knowledge and contribute to the community. We provide a multi-cultural, casual and balanced work environment. We recently helped launch&nbsp;Magento Enterprise Cloud Edition and the Sensio Cloud on Platform.sh technology.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from home, wherever you are                            </div>                            <div>                                 Safe and friendly working environment                            </div>                            <div>                                 Stock options for everyone                            </div>                            <div>                                 Rest and recovery are essential to health and happiness; we get that                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 19, 2017 12:17:17 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "h61oo3z-RuebN4YLgTrK6w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156372/php-engineer-asset-management-technology-firm-lenox-park-solutions-llc?a=QrqgZKR6c4U",
    "title": "PHP Engineer - Asset Management Technology Firm at Lenox Park Solutions LLC (Austin, TX) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Financial Technology, Investment Banking, Software Development / Engineering</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Lenox Park Solutions is seeking a PHP Engineer with substantial experience developing custom, institutional software. As our full-time engineer, your focus would be working closely with our Development &amp; Marketing staff to advance the functionality and scalability of Roundtables, our proprietary investment ecosystem revitalizing the Asset Management industry. Initial day-to-day will include all aspects of managing the technical requirements of this product. The ideal candidate will also grow into a more senior leadership role in managing other outsourced development projects, and will have technical expertise beyond PHP that will inform an expanded product suite. And as our team is comprised primarily of financial professionals, the candidate will have ample room to guide our strategic development and technical efforts. At LPS, we focus on accountability, proactive-ness, and creative thinking. Staff members retain the option to work remotely, as we are a goals-oriented team.</p><p><strong>Requirements:&nbsp;</strong></p><ul><li>Professional IT/Engineering experience on&nbsp;PHP/Laravel with demonstrated development and design experience, particularly experience in collaborative networks, databases, or asset management software&nbsp;</li><li>Outstanding communication skills, both verbal and written experience with technical and non-technical audiences;&nbsp;</li><li>Ability to assess ongoing processes critically and recommend creative, thoughtful operational improvements;&nbsp;</li></ul><p><strong>Preferred Skills:&nbsp;</strong></p><ul><li>Understanding of Asset Management industry;&nbsp;</li><li>Business-oriented, highly analytical mind with a knack for accounting for both complex business and technical considerations simultaneously</li></ul>                    </div>                            <h2>                About Lenox Park Solutions LLC            </h2>            <div><p>Lenox Park Solutions LLC (LPS) is a FinTech firm focused on Asset Managers and Financial Institutions. Our mission is to enable the democratization of access to Institutional capital by using technology to match best-in-class Asset Allocators with the most talented Asset Managers. Our solutions will challenge entrenched traditional notions of who should be able to manage money, upending the staid model where pedigree and privilege drive capital allocation. Leveraging deep experience in investment banking and asset management, LPS licenses CRM solutions that emphasize networking and collaboration to manage Fundraising, Deal Pipeline, Business Development and Operations. LPS maintains offices in New York, NY and Austin, TX.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote Office                            </div>                            <div>                                 Experienced Investment Professionals                            </div>                            <div>                                 Austin and New York Offices                            </div>                            <div>                                 Lean, Entrepreneurial Team                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "ECwXx_QlQLy8lVPXPx2JqA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/unbxd/jobs/16116-architecting-success-for-customers-solutions-engineer",
    "title": "Architecting Success For Customers: Solutions Engineer",
    "content": "<div><h2>Architecting Success For Customers: Solutions Engineer at Unbxd</h2><div>Bengaluru, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Python, PHP, Java, Javascript, SQL, Amazon Web Services</div><div>Compensation</div><div>₹600K–₹1500K<br>0.0%–0.25%</div></div><h3>Job Description</h3><div><p>Strong programming skills in PHP<br>Experience in building on NodeJS, J2EE/Java or Golang would be a plus. <br>Understanding of REST, MVC architecture and web applications.<br>Experience of using any e-commerce platform is a plus.<br>Working knowledge of javascript.<br>Ability to take a complex problem and break it down into workable chunks of tasks.<br>Experience in working with large scale distributed systems.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 10:21:07 PM",
    "tags": [
      "Amazon Web Services",
      "Bengaluru",
      "Full Time",
      "Java",
      "Javascript",
      "PHP",
      "Python",
      "REMOTE1/100",
      "Remote OK",
      "SQL",
      "Software Engineer",
      "TECH1/java",
      "TECH1/nodejs",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "java",
      "nodejs"
    ]
  }
]
}
