{
 "items": [
  {
    "id": "_ERKQV7pS9K-SspxDGtahA",
    "url": "https://jobspresso.co/job/associate-director-talent-acquisition/",
    "title": "Associate Director, Talent Acquisition",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Wayfair",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 25, 2018 2:38:45 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Associate Director, Talent Acquisition</h2><div>Various<br></div><div>Anywhere in US<br></div><div>Company: Wayfair<br></div><div>Full Time<br></div><h3>Overview</h3><p>Wayfair is seeking a highly motivated, Associate Director for Customer Service &amp; Sales Talent Acquisition.&nbsp; We are experiencing rapid and dynamic growth across a variety of areas. As our employee base and geographic area expands, we are focused on ensuring that we have the right leadership, teams and infrastructure in place to support this larger, more complex organization. Our Talent teams help support and shape growth across large functional areas. Our people are the biggest factor in our success and the key driver of our revenue growth; the Talent teams have a unique opportunity to help drive this growth through exceptional talent acquisition programs and strategy.</p><p>Your team will be responsible for hiring Customer Service and Sales Consultants across North America.&nbsp; &nbsp;In addition to driving a culture of continual improvement and development, the Associate Director will inspire a large team to lead Talent Acquisition projects and initiatives that allow us to go from good to great, and deliver flawless execution to the business.</p><p></p><strong>The Way You’ll Work</strong><ul></ul><li>Partner with Site Directors and Senior Leadership to understand hiring needs in 6+ locations across the US</li><li>Enable a large Talent Acquisition team by managing, mentoring, coaching and developing performance.</li><li>Work closely to improve performance and reduce turnover with improved hiring techniques and candidate selection tools.</li><li>Deliver a best-in-the-world hiring experience to the following stakeholders:</li><ul></ul><li>Candidates</li><li>Hiring Managers</li><li>Business Stakeholders</li><li>Recruiters</li><li>Contribute to and lead various Talent Acquisition strategies and best practices that contribute to the overall achievement of our vision and enable global scale, long-term success.</li><p></p><strong>The Way You’ll Win:</strong><ul></ul><li>Establish credibility based on your knowledge of Wayfair and your subject matter expertise.</li><li>Leverage data to make decisions, respond to changing business demands, and scale our talent acquisition program.</li><li>Drive a culture within your team that inspires recruiters to strive to become business partners who influence stakeholders and drive outcomes.</li><li>Coach and develop your team through day-to-day needs as well as long term developmental areas.</li><p></p><strong>Who You Are:</strong><ul></ul><li>A&nbsp;&nbsp;with 10+ years of demonstrated success in environments that require significant influencing and partnership to accomplish talent acquisition and</li><strong>champion</strong><li>A&nbsp;&nbsp;with 5+ years’ experience managing multi-level teams, managing teams of recruiters in various off site locations</li><strong>leader</strong><li>An&nbsp;&nbsp;with experience implementing a wide range of creative and thoughtful talent acquisition strategies and programs.</li><strong>innovator</strong><li>An&nbsp;with a proven ability to develop strong internal client relationships, leveraging strong consultative skills.</li><strong>influencer&nbsp;</strong><li>An&nbsp;&nbsp;with a data-centric approach to identifying areas of opportunity and quantitative skills to manage business outcomes.</li><strong>analyst</strong><li>An excellent&nbsp;&nbsp;with an innate ability to motivate and inspire people with your words.</li><strong>communicator</strong><p></p><strong>&nbsp;About Wayfair Inc.</strong><p>Wayfair believes everyone should live in a home they love. Through technology and innovation, Wayfair makes it possible for shoppers to quickly and easily find exactly what they want from a selection of more than 10 million items across home furnishings, décor, home improvement, housewares and more. Committed to delighting its customers every step of the way, Wayfair is reinventing the way people shop for their homes – from product discovery to final delivery.</p><p>The&nbsp;Wayfair&nbsp;family of sites includes:</p><ul></ul><li>, an online destination for all things home</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.wayfair.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=Wayfair&amp;index=6&amp;md5=7ff2d781b9a5f7830b6b03f9b6e23578' rel='nofollow'>Wayfair</a><li>, where beautiful furniture and finds meet irresistible savings</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.jossandmain.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=Joss+%26+Main&amp;index=7&amp;md5=858573d4005bcbf2bcf1753109b4f731' rel='nofollow'>Joss &amp; Main</a><li>, unbelievable prices on everything modern</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.allmodern.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=AllModern&amp;index=8&amp;md5=1623432ea9e10ed33771fef0c7f7ac86' rel='nofollow'>AllModern</a><li>, a collection of classic furnishings and timeless home décor</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.birchlane.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=Birch+Lane&amp;index=9&amp;md5=fae47b06ccc3dd67bd45be7e171d6438' rel='nofollow'>Birch Lane</a><li>, unparalleled access to the finest home décor and furnishings</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.perigold.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=Perigold&amp;index=10&amp;md5=423afe98da4795b56959330d82bbf2c6' rel='nofollow'>Perigold</a><p>Wayfair generated $5.2 billion in net revenue for the twelve months ended March 31, 2018. Headquartered in Boston, Massachusetts with operations throughout North America and Europe, the company employs more than 8,700 people.</p><div> <div><div><p>To apply for this job please visit the following URL: <a href='http://jobs.jobvite.com/wayfair/job/otUI7fwW' rel='nofollow'>http://jobs.jobvite.com/wayfair/job/otUI7fwW →</a></p></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "W-p0u1_xR5airPKzqGthKQ",
    "url": "https://angel.co/consensys/jobs/231931-human-resources-and-recruiting-coordinator",
    "title": "Human Resources and Recruiting Coordinator",
    "tags": [
      "Brooklyn",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "H.R.",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "ConsenSys",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=585912&listings[0][]=58885"
    },
    "salary": {
      "currency": "$",
      "minValue": 50000,
      "maxValue": 55000,
      "info": "0.01% – 0.01%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 14, 2018 6:49:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Human Resources and Recruiting Coordinator at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$50K–$55K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Apply Here: </p><p>ConsenSys is a venture production studio focused on building and scaling tools and enterprise software products powered by Ethereum. Our mission is to use these solutions to power the emerging economic, social, and political operating systems of the planet.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, the music industry, security and infrastructure, and more. To accomplish this, we’ve built out a flat organizational structure which we call the ConsenSys Mesh; a network of individuals &amp; teams working autonomously and towards the same goal. The MeshOps team is responsible for designing and implementing “Meshocracy”, our own operational &amp; company structure loosely based on the principles of holacracy. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p>The Role</p><p>The Human Resources and Recruiting Coordinator is an integral member of our team!  We need help telling our story around the world!  In this role you will develop a solid foundation of knowledge and experience as part of a greater global team serving countless internal customers and projects on 6 continents. You will have the opportunity to build candidate relationships, and partner with recruiters, human resources and hiring managers. The ideal candidate seeks career growth within Recruiting and/or Human Resources and will provide support in many different areas.  This is truly a choose your own destiny situation, and a chance for ownership.  This role will grow and evolve as ConsenSys grows and incolves</p><p>Build excellent relationships across our organization<br>Create welcome packages and kits for new hires<br>Coordinate interview activities on-campus and in-house including, but not limited to, scheduling and calendar invites; interview confirmation emails; reserving interview rooms and telephone/video conference (when necessary); and candidate debrief calls/meetings<br>Schedule and coordinate logistics for all campus recruiting events, e.g. RSVPs, payment/check requests, calendar invites, etc.<br>Manage inventory for all recruiting swag and ensure all swag is readily available.<br>Coordinate offer letter process and as well as onboarding set-up<br>Provide support on special projects and initiatives<br>Assist with the internship program and internal events<br>Assist with wellness endeavors<br>Required Skills:</p><p>Meticulous attention to detail and strong organizational skills with proven ability to prioritize and complete projects within deadlines<br>Self-starter who loves taking initiative<br>Creative problem solver<br>Discreet and able to manage sensitive information<br>Flexibility, high energy and a positive attitude<br>Prior experience in a Recruiting or Human Resources department is preferred<br>Familiarity with applicant tracking systems, HR systems and social media is preferred<br>Ability to focus on the details, but also understand the bigger picture<br>Bonus Points:</p><p>Interest in new technology, Blockchain, and/or Ethereum<br>Humble, kind, and doesn't take themselves too seriously</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "j_SbjA4sTgSzVrODjcmcUw",
    "url": "http://www.indeed.co.uk/viewjob?t=Unity+Developer+Remote+Working&jk=623ec00a9d3ade90&",
    "title": "Unity Developer 80% REMOTE WORKING - IT Talent - Cardiff",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:unity3d/gamedev/8",
      "DBG_TECH1:k/t/w:unity3d/mobile/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=5, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "£",
      "minValue": 200,
      "maxValue": 250,
      "info": "Contract",
      "unit": "DAY",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 13, 2018 6:47:47 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "YL40TZbMTyaLE38LwomUyg",
    "url": "https://news.ycombinator.com/item?id=17663098",
    "title": "SEEKING FREELANCER Worldwide, REMOTE, near-total flexibility on hours. $70-100/hr. Expert Interviewer at Karat  ...",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``seek 2W freelancerescap 4W remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 70,
      "maxValue": 100,
      "info": "",
      "unit": "HOUR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2018 5:04:03 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<span>SEEKING FREELANCER<p>Worldwide, REMOTE, near-total flexibility on hours. $70-100/hr. Expert Interviewer at Karat (<a href='https://karat.io' rel='nofollow'>https://karat.io</a>)</p><p>Work from anywhere in the world that has a solid internet connection. Work as much or as little as you want. Work any day, any time of day, any number of hours -- you can do 0 one week, 50 the next week, and back to 0 the next week. Only requirement there is that we want you to roughly average at least 10 hours a week, or else the training/time investment doesn't make as much sense from your end or ours.</p><p>I know the above might sound a little strange, so a bit about the company for context: Karat is a Seattle-based startup that does software engineering interviews on behalf of other companies -- primarily first-round phone screens. Quickly-growing companies can spend a significant fraction of their engineers' time interviewing; we help take the load off. We've done a lot to make the interview experience better for all stakeholders that I could write whole essays about, but suffice it to say that candidates love working with us, clients love working with us, and we're well-funded and growing quickly as a result.</p><p>Because of this quickly-growing demand, we're looking to hire more Expert Interviewers. The ideal candidate is a software engineer with strong written and verbal English skills with at least a few years of professional experience. Interviewing experience would be great, but we spend 25 hours (paid) training you before you even start, so if you're strong technically and love working with people we can usually make it work :) Interviews are conducted over video chat, using a collaborative code editor.</p><p>Some of our interviewers are freelancers who use our scheduling model to backfill hours; others are full timers at top tech companies looking to make some extra cash; others have quit their jobs to work with us full time; some are digital nomads; one of our interviewers is road tripping around North America for a year and a half, doing anywhere from zero to 40 interviews each week depending on where he is and what the weather's like.</p><p>The application form is here: <a href='https://jobs.lever.co/karat/d44ab283-c7c0-4bbd-b8c3-4dc0ced64c86?lever-origin=applied&amp;lever-source=HNWHFL' rel='nofollow'>https://jobs.lever.co/karat/d44ab283-c7c0-4bbd-b8c3-4dc0ced6...</a></p><p>I know it's a pretty unique job, so if you have any questions reply here or email me at josh@karat.io and I'm happy to talk through any of it.<span>              </span></p><div>        <p>                        </p></div></span>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
