{
 "items": [
  {
    "id": "JSDscIGNT_u9KWqK_xNOdw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168232/content-technology-account-director-a?a=Uq1GW0Vqzde",
    "title": "Content Technology Account Director at [A]  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>IT Consulting</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>[A] is looking for an account lead with a strong base of exposure to content technologies, to join our team in the role of a Content Technology Account Director.&nbsp;&nbsp;</p><p>As a Content Technology Account Director, you will be involved with building and maintaining relationships, consulting on business challenges, writing and presenting proposals, closing deals, and ensuring the growth and development of our strategic delivery team. &nbsp;To succeed in this role, you will need a thorough understanding of the obstacles and challenges our clients face at the intersection of business, content, and technology. Your value lies not only in your consultative sales experience but also in your strong technical aptitude and understanding of content technology solutions. &nbsp;Familiarity with CMS, CCMS, CEM, DAM, CDP, CSP, PIM, CRM, and other such related enterprise systems across techcomms and marcomms will provide the best foundation for rapid success in the role.</p><p>This is a remote role that can be done from anywhere in North America.</p><p><strong>What you’ll be doing:</strong></p><ul><li>Drive new business within current accounts.</li><li>Generate new business and continually advance the sales pipeline.</li><li>Work with a heavy lead flow, in collaboration with other stakeholders, to qualify new opportunities.</li><li>Assist with pipeline dynamics.</li><li>Consult with clients at a detailed level about their content-related technical challenges.</li><li>Serve as a subject matter expert on content technology solutions.</li><li>Partner with internal subject matter experts, when necessary, to work through solutions.</li><li>Architect, present and implement proposals, statements of work, and strategic account plans.</li><li>Provide clean account transition to delivery and remain involved while delivery onboards and until all production rhythms are running at full steam.</li><li>Manage trimester account reviews, and account planning rhythms.</li><li>Cross-train, and potentially lead, other account Content Technology Account Directors as [A] grows.</li></ul><p><strong>You may be a good match for this role if you have...</strong></p><ul><li>6+ years experience selling in an enterprise environment</li><li>Experience with and deep exposure to content technology</li><li>Exposure to technical communications and marketing communications groups</li><li>Technical expertise with CMS and CEM platforms like:<ul><li>Sitecore</li><li>Kentico</li><li>Adobe AEM</li><li>Episerver</li><li>Liferay</li><li>Drupal / Acquia / Wordpress</li></ul></li><li>Exposure to DAM and CSPs like:<ul><li>Nuxeo</li><li>Alfresco</li><li>OpenText</li><li>Widen</li></ul></li><li>Proven ability to meet and exceed revenue targets</li><li>Experience managing and growing a sales pipeline</li><li>Experience in consultative/solution selling environments</li><li>Experience selling at the executive level</li><li>A considerable amount of self-motivation</li><li>Passion for excellence in customer service</li><li>Excellent written and verbal communication skills in English</li><li>Bachelor’s degree or equivalent experience</li><li>A strong cultural fit with [A]’s values.</li></ul><p><strong>Cultural Fit at [A]</strong></p><ul><li>You love learning, you love teaching.</li><li>You are constantly growing your own knowledge, and helping to grow the knowledge of others.</li><li>You enjoy wearing multiple hats and roles, and titles are not important to you.</li><li>You do top-quality work, manage quality, and make everything you touch better.</li><li>You are comfortable working under strict confidentiality agreements and often behind-the-scenes.</li><li>You are self-organized and manage time and resources well.</li><li>You are able to not only work alone, but also communicate within a team by sending updates, tracking time, and other forms of communication while you work.</li></ul><p>Learn more about [A] at&nbsp;<a href='http://www.simplea.com/' rel='nofollow'>simplea.com</a>.</p><p>If this sounds like you, then write up a cover letter letting [A] know why you want to work at [A], what you do best, and what inspires you. &nbsp;A great cover letter will say much more than the resume (though we'd like to see that too).</p>                    </div>                            <h2>                About [A]            </h2>            <div><p><strong>What is [A]?</strong></p><p>[A] is the Content Intelligence Service, and we work with clients to create a Content Intelligence System. The Content Intelligence System is a holistic set of people, processes, and tools that maximize content-ROI by ensuring content is coherent, self-aware, and quantum. &nbsp;By creating a Content Intelligence System, we increase the effectiveness and ROI of the content assets while reducing overall costs. &nbsp;[A] works holistically to build all aspects of a content intelligence system in partnership with clients and agencies. This includes not just the technology architecture and implementation, but enabling companies with the organizational muscles to drive content intelligence.</p><p><strong><br>[A] Team Benefits:</strong></p><p>Being an [A]gent comes with its benefits. Work from anywhere. Advance your career on the&nbsp;leading edge&nbsp;of the content and technology sciences. Earn a competitive salary&nbsp;and for longtime [A]gents, participation in a profit-sharing plan. But many [A]gents find the best part of working as an [A]gent are the other [A]gents you work with and the culture at [A].</p><p>We take care of each other and we honor each other's work and contributions to the team. We work to make ourselves better and our [A] team better. We make efforts to adapt new technologies and methodologies that can help us optimize our time, and we expect you to collaborate on these efforts if you’re an expert on any of those fields. We communicate and reach out to other [A] players. &nbsp;We love learning. We love teaching. We write. We code. We support each other. For the right people, working at [A] feels like coming home.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote Workforce                            </div>                            <div>                                 Competitive salary                            </div>                            <div>                                 Shared company performance incentives                            </div>                            <div>                                 Individual training budget                            </div>                            <div>                                 A well-documented career path                            </div>                            <div>                                 Flexible hours &amp; personal independence                            </div>                            <div>                                 Other benefits based on location.                            </div>                            <div>                                 401K                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 18, 2018 11:18:35 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "5RdOeXP7Ro-D7_ABSktfnA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-copywriting",
    "url": "https://weworkremotely.com/remote-jobs/semaphore-ci-technical-writer",
    "title": "Semaphore CI: Technical Writer",
    "content": "<div>  <div>    <h2>Technical Writer</h2>      <h4>Posted Feb  7</h4>    <h3>      <span>Semaphore CI</span><br>      <span>Headquarters: Remote</span><br>        <a href='https://renderedtext.workable.com/jobs/659367/candidates/new' rel='nofollow'>https://renderedtext.workable.com/jobs/659367/candidates/new</a>    </h3>  </div>    </div>  <div>    <div></div><div><strong>Semaphore</strong>&nbsp;is seeking a talented Technical Writer to own the creation and publication of customer-facing product guides and documentation, and contribute to our technical blog.</div><div><br></div><div>You'll write for developers and DevOps engineers, and your work will play a vital role in getting customers up and running quickly. Ideally you have both a technical background that enables you to develop examples and a demonstrated ability to deliver high-quality technical documentation that helps customers.</div><div><br></div><div>This is a remote position and you should thrive in asynchronous communication. We expect you to be able to develop working relationships with coworkers from around the globe.</div><div><br></div><div>You'll collaborate with many teams and continuously use customer feedback to improve Semaphore content.</div><div><br></div><div><strong><br></strong></div><div>About Semaphore</div><div><br></div><div><a href='http://semaphoreci.com/?utm_source=wwr&amp;utm_medium=link&amp;utm_campaign=techwriterjob&amp;utm_term=30days&amp;utm_content=jobad' rel='nofollow'>SemaphoreCI.com</a>&nbsp;is a leader in hosted continuous integration and deployment, with over 30,000 developers relying on Semaphore to test and deploy their code. Our mission is to help teams ship their software faster and with more confidence by providing a fast, robust and scalable platform for software delivery.<br></div><div><span><br></span></div><div><span>We work in small, highly effective teams, and every person is vital to the success of the company.</span></div><div><br></div><div>Our team is made of smart, creative people who love their craft. We believe that a great place to work is where we're surrounded by self-managed people who consistently do good work and positively inspire us.</div><div><br></div><div>We work in a fast-changing environment of a new market, and there are many ways you can make a great impact. You will not be just reaching developers worldwide through great technical content, but have a voice in shaping the company culture too.</div><div><br></div><div><strong><br></strong></div><div>Responsibilities</div><div><br></div><ul><li>Have an in-depth understanding of the product and what customers need to succeed with Semaphore.</li><li>Work with Marketing team to plan, create and promote new technical blog posts and tutorials related to beginner and advanced CI/CD topics.</li><li>Work with Engineering teams to ensure features are well documented.</li><li>Work with Customer Success team to prioritize and fill gaps in existing documentation.</li><li>Engage with online developer community and use what you learn to guide your work.</li><li>Review content written by others.</li></ul><div><h3>REQUIREMENTS</h3></div><ul><li>Demonstrated ability to create and manage excellent technical content</li><li>Be passionate about helping developers solve real problems</li><li>Ability to quickly grasp complex technical concepts</li><li>Great teaching skills that translate into amazing written work</li><li>Working knowledge of open-source programming languages and Docker</li><li>Be highly organized and self-managed, have excellent work ethic and attention to detail</li><li>Have the ability to work effectively remotely with a team</li><li>Residing in time zone CET +/- 4hrs</li></ul><div><h3>BENEFITS</h3></div><ul><li>The impact of working on a product that's competing on a global market</li><li>Join a small team of around 20 full-time people who love what they do</li><li>A healthy 40-hour work week, friendly and supportive work environment</li><li>Competitive salary</li><li>Company retreats</li><li>Space to learn continuously and choose the tools and equipment for your job</li><li>Paid trips to conferences and books of your choice</li><li>Paid membership at a fitness club of your choice</li></ul><div>Semaphore is an equal opportunity employer. Consistent with our mission of serving a diverse and global audience, we value a diverse workforce and inclusive culture which reflects that. We encourage applications from all qualified individuals without regard to race, color, religion, gender, sexual orientation, gender identity or expression, age, national origin, marital status, disability, and veteran status.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply here:<a href='https://renderedtext.workable.com/jobs/659367/candidates/new' rel='nofollow'>https://renderedtext.workable.com/jobs/659367/candidates/new</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 5:21:31 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "oOp6dkAJSkSZdFZ3OO3BhQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/65965/digital-content-producer-at-granttree/",
    "title": "Digital Content Producer",
    "content": "DESCRIPTION<br /><br />You’re a Digital content producer who has an enticing way with words and a strong appetite for technology; and you’re looking for a new job. But, not any job. You want a job that empowers you to unleash your creativity, where you are seen as an individual and supported by an equally passionate team.<br /><br />A role at GrantTree might be exactly what you’ve been looking for.<br /><br />GrantTree was founded 7 years ago and employs 33 people. In our self-managing culture everyone has the freedom, power and trust to do great work. We call this open culture. It’s been successful for us so far, but we also know it's not for everyone (we suggest you check out our GlassDoor reviews). This is the ideal environment for creative, independent people who are open to developing through challenging work.<br /><br />GrantTree’s Marketing team is…<br /><br />Strategic<br />Creative<br />High-performing<br /><br />We've just started to expand our Marketing team and now we’re searching for an additional team member to add richness to our channels through writing content, video production and graphic design.<br /><br />Could you be this missing person?<br /><br />REQUIREMENTS<br /><br />- You are a professional copywriter at core, with experience of independently crafting blog content (within the finance space is a plus).<br /><br />- You must be passionate and knowledgeable about software, apps and tech. You know how to use the relevant tools to produce supporting quality media assets quickly, an illustration, an infographic or a short animated video of your creation.<br /><br />- You're confident at reviewing existing content and making executive decisions on how to make it better.<br /><br />- You are strategic with a sound understanding of your audience and how to best engage them with the right tone of voice.<br /><br />- You have the ability to build a content strategy and execute it, with an acute attention to detail and performance.<br /><br />- You enjoy developing editorial guidelines to ensure consistently good writing.<br /><br />We anticipate that the focus of this role will be around 65% writing and 35% media production. We don't need you to be a full-fledged graphic designer or a videographer, but we expect you to be one of those content producers who use graphic design and video tools to support their content. A deep understanding of how to engage the audience and support core messages is key.<br /><br />We are looking for someone who will thrive from coordinating their own workload and having free reign to develop content using their expertise. You will also work with the marketing team who can help support you with Strategy, Social Media, SEO and PPC.<br /><br />In addition to all this, our environment offers the freedom to seriously grow, professionally and personally, helping you gain well-rounded skills to be phenomenal at this role.<br /><br />BENEFITS<br /><br />We believe that people should be rewarded fairly for the work they do. At GrantTree there is no secrecy over salaries and the way we work them out. For this role, this is likely to lie between £25k and £35k depending on experience. We also provide access to health insurance, cycle to work, and an annual discretionary bonus.<br /><br />Aside from money, we offer a place where you can be yourself. We want you to develop your skills and fulfil your potential. We have a flexible approach to working, and some of our staff work remotely most of the time. Our office near Old Street is bright and airy, with a fab roof terrace. You can take up to 6 weeks as holiday each year.<br /><br />Equal Opportunities<br /><br />Teams are stronger when they have a diverse range of people. Applications are accepted from everyone, regardless of the categories they put themselves in. We also encourage talented ‘square pegs’, who don’t neatly fit into the person specification, to apply.<br />",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 9:50:30 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/gamedev",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "gamedev"
    ]
  },
  {
    "id": "2SmykS6sSHerTqB8nrk0PQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/65936/content-writer-at-my-fashion-sales/",
    "title": "Content Writer",
    "content": "<br />·       Exciting opportunity to join a new exciting fashion start-up that is shaking up the industry. Amazing opportunity to get recognition, grow with the company and create a name to start a blogging career<br />·       This role is home based. All we require is you to work an hour a day at your convenience.<br />·       Perfect for some someone who is interested in fashion, maybe a student, or wants to get involved in the start-up industry and also the fashion industry.<br /> <br />What you'll be doing: <br /> <br />·       You will be responsible for creating remarkable and engaging stories/blogs and fashion advice on content available on our platform.<br />·       The purpose of this role is to expand our digital footprints, and increase awareness, subscribers and leads. <br />·       You’ll work works closely with the Founders of the business and will encourage self-development.<br /> <br />Experience required:<br />Our barriers are not very high as we are giving you experience to be able to grow and develop your role. All we require is;<br />•    Strong Interest in Fashion<br />•    Awesome use of English Language and outstanding writing skills<br />•    Creativity<br />•    Passion to learn and develop<br />•       Great attention to detail<br />•       Dynamic, flexible and work attitude focused on quality<br />•    Meticulous and organised<br />•     Internet savvy<br />•     Ability to troubleshoot independently<br />•     Switched on<br />•    Self-motivated<br /><br />Young company with extraordinary growth potential. As such, there may be an opportunity to be involved in various activities and attend networking events.<br /><br />If this sounds like you, please send us your CV! <br /><br />Please note that only successful candidates will be contacted and enquiries will unfortunately be ignored due to the high level of applications.<br />",
    "urlFetchPending": false,
    "published": "Feb 6, 2018 1:41:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "Hauzo8f8SC6UdtxbgQHM1A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/166431/junior-innovation-developer-roth-technical-specialties?a=TOzUVPtm9IQ",
    "title": "Junior Innovation Developer at Roth Technical Specialties Inc.",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Mobile Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, Transportation</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Looking for an energetic, creative, fun loving super nerd. Must love looking for and trying out new technologies and be confident and creative enough to present new ideas. Should be able to work with minimal instruction yet still work well within a team.</p><p>Needs the following skills.</p><p>* 1+ years&nbsp;native mobile development (iOS Swift 3 to 4 preferred, Android a bonus)</p><p>* 2+ years as a full stack web developer with Node.js, at least one Single Page Application framework (Angular, React, etc.), popular Javascript libraries (jQuery, backbone, underscore, etc.), HTML5, CSS3, relational and or nosql databases.</p><p>* 2+ years with Amazon AWS</p><p>1099 corp to corp</p><p>100% work remotely from home (with periodic travel to Dallas TX)</p><p>Must be able to provide own equipment and pass a background check</p><p>USA candidates only please</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 100% Remote                            </div>                            <div>                                 Competitive rates                            </div>                            <div>                                 Leading edge technology                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "UNo85fsORma5p4RNU-UtMw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/remote-jobs/the-art-of-applying-full-time-instructor-coach-grad-school-admissions-bootcamp",
    "title": "The Art of Applying: Coach & Editor for Grad School Admissions Bootcamp",
    "content": "<div>  <div>    <h2>Coach &amp; Editor for Grad School Admissions Bootcamp</h2>      <h4>Posted Feb  3</h4>    <h3>      <span>The Art of Applying</span><br>      <span>Headquarters: New York, NY (formerly Austin, TX)</span><br>        <a href='http://theartofapplying.com/teach' rel='nofollow'>http://theartofapplying.com/teach</a>    </h3>  </div>    </div>  <div>    <div><h2>Write, Teach, Edit, Encourage, and Coach Grad School Applicants to Success</h2></div><div><strong><br></strong></div><div><strong>Position:</strong>&nbsp;Full-Time Instructor &amp; Coach for The Art of Applying's Application Accelerator program (full-time remote employment)<br></div><div></div><div></div><div></div><div></div><div><strong><br></strong></div><div><strong>Compensation:</strong>&nbsp;$50,000-$70,000 + bonuses for achieving outstanding client results&nbsp;</div><div><br></div><div>Note: Compensation is comprised of $36,000 base pay + variable pay based on number of clients you work directly with as their primary instructor. Bonuses for achieving outstanding client results are in addition to figures listed above.</div><div><br></div><div>The $50,000 figure is the approximate pay for working with 5 new clients per month; the $70,000 figure is the approximate pay for working with 10 new clients per month. Because graduate admissions is very seasonal, the workload varies throughout the year with 5 being on the low side of new clients per month.</div><div><br></div><div><b>Vacation:&nbsp;</b>10 paid vacation days&nbsp;</div><div><strong><br></strong></div><div><strong>Work hours:</strong>&nbsp;Monday - Friday 10 am - 7 pm Eastern with a one-hour unpaid lunch (there is room for some flexibility with the hours, but these are primarily the required hours)</div><div><strong><br></strong></div><div><strong>Location:</strong>&nbsp;Remote (must be located in the United States or Canada)<br></div><div></div><div></div><div></div><div></div><div><strong><br></strong></div><div><strong>Deadline to apply: </strong><span>Thursday, February 8,</span>&nbsp;2018 at 11:00 pm Eastern</div><div><br></div><div><strong>Start Date: </strong><span>Thursday, March 1, 2018 at the very latest</span></div><div><br></div><div>The Art of Applying is a fast-growing education company founded by a woman Harvard MBA &amp; MPA graduate that helps people from all over the world get admitted to their dream graduate schools with funding to pay for it.</div><div><br></div><div>We’re looking for an&nbsp;<strong>enthusiastic, reliable, encouraging, outgoing graduate degree holder&nbsp;</strong>with&nbsp;<strong>excellent communication skills, outstanding essay and resume editing skills, and a love for storytelling, teaching and learning</strong>&nbsp;to<strong>&nbsp;join our 100% remote team (yes, you’d get to work from home!)</strong>&nbsp;as the first&nbsp;<b>Full-Time Faculty Member </b>for our Application Accelerator, a bootcamp for high-achieving high-potential applicants to Ivy League MBA, MPP, JD, M.Ed., MSW, Engineering, Data Science, and Design programs.</div><div><br></div><div>As the full-time instructor, you will serve as the <b>primary coach and point person for a caseload of 5-10 new clients per month </b>who are applying to their dream schools and scholarships. You will <b>teach and reinforce the tested system and curriculum</b> our founder has created, review submitted homework of your clients, hold online office hours, edit your clients' materials, and support your clients to success in getting into their dream schools with substantial scholarship funding.</div><div><br></div><div>Right now, our goal is to hire two outstanding full-time instructors and to add more instructors as needed.</div><div><br></div><div>How would you like to be with a company that helps people get into their dream graduate schools with funding that is at the&nbsp;<strong>very beginning of a significant growth phase</strong>?</div><div><br></div><div>A company that is willing and able to <b>thoroughly train you, give you the curriculum to teach,&nbsp;</b>and&nbsp;<strong>show you everything you need to know to succeed</strong>?</div><div><br></div><div>A company that is&nbsp;<strong>more concerned about your passion and potential</strong>&nbsp;than about your job history or your experience?</div><div><br></div><div>A company that has<strong>&nbsp;twice-yearly all expenses paid company retreats</strong>? Our last retreat was in Austin, Texas and included beating a difficult Escape Game, a dessert reception with some of our clients, touring the city, one-hour massages, and eating the world’s best BBQ. Yeehaw!</div><div><br></div><div>With hard work and a willingness to learn, you will have the opportunity to&nbsp;<strong>build your skills</strong>,&nbsp;<strong>contribute to an amazing mission</strong>,&nbsp;<strong>have fun with like-minded people</strong>, and do it all while working from home.<br></div><div></div><div></div><div></div><div></div><div><strong><br></strong></div><div><strong></strong></div><div><strong>Requirements:</strong><br></div><div></div><div></div><div></div><div></div><div><strong><br></strong></div><ul><li>Masters degree or PhD—the more prestigious the school the better</li><li>experience teaching, coaching, and/or tutoring in a 1-on-1 and group environment</li><li>excellent communication skills</li><li>outstanding editing skills</li><li>strong writing skills</li><li>engaging, encouraging teaching style</li><li>ability to keep client information strictly confidential</li><li>comfortable with technology; willing to learn how to use Zoom, Basecamp, Helpscout, Gmail, Google Sheets, and Google Docs</li><li>available to work 40 hours per week</li></ul><div><strong><br></strong></div><div><strong>Primary job duties:</strong><br></div><div></div><div></div><div></div><div></div><div><strong><br></strong></div><ul><li>meet weekly with CEO to update her on client progress</li><li>hold weekly office hours for 2-3 consecutive hours for clients to live edit client materials and have clients come and ask you questions about their application process</li><li>hold monthly office hours for 2-3 consecutive hours for clients who have graduated from the bootcamp but still have lingering questions or concerns</li><li>edit approximately 20k - 50k words of multiple drafts of essays, resumes, and other application content for each client you work with (editing happens over multiple months and is intense around MBA deadlines in August, November, and December).</li><li>conduct 1-on-1 coaching calls with clients and keep notes on coaching calls</li><li>conduct mock interviews with clients to help them prepare for admissions interviews</li><li>answer client questions about their application process via the client portal system</li><li>propose ideas to CEO on how to improve the experience for our clients</li><li>propose, create, and teach additional modules for the bootcamp curriculum</li><li>write blog posts about graduate admissions and highlighting client success stories</li></ul><div><br></div><div><b>Who we aren’t looking for:</b><br></div><div></div><div></div><div></div><div></div><ul><li>people afraid of technology or who are proud to be “not computer savvy”</li><li>people interested in a remote role so they can travel several months out of the year</li><li>people who want to start their own business or build their own brand</li><li>people looking to make quick cash on the side. We're building a long-term team as we scale, and want people who are interested in building a career here.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='http://theartofapplying.com/teach' rel='nofollow'>http://theartofapplying.com/teach</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 11:21:18 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/writer",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "uykSYTfMRqCI0c-wZfK4-g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/320986-technical-trainer-consensys-academy",
    "title": "Technical Trainer (ConsenSys Academy)",
    "content": "<div><h2>Technical Trainer (ConsenSys Academy) at ConsenSys</h2><div>United States, Canada, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Content Development, Educational Technology, Technical Training, Course Development</div><div>Compensation</div><div>$120K–$140K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ConsenSys Academy is the education and training arm of ConsenSys, the first of its kind in the blockchain industry. Academy is focused on developing the global ethereum talent base, both technical and non-technical, by creating and delivering packaged content across a variety of channels, including published, online, virtual and in-person. Our audiences include business users, technology developers, legal/compliance/regulatory personnel, professors/teachers, and the general public. We would also like to enable and expand the overall blockchain community by training and certifying other trainers across a variety of communities. We’re looking to build a global, cross-functional interdisciplinary team of “master trainers”: experts and leaders to serve as in-person and virtual instructors to customers, partners and other members of the ConsenSys organization.</p><p>Training courses and programs will cover Blockchain and Ethereum technology, applications and use cases, plus material on ConsenSys products. Training delivery may be conducted in a variety of places including traditional training spaces, remote office locations, client office locations, plus industry conferences and events, so travel (~30-50%) will be required as a normal part of all training roles.</p><p>The successful candidate will have either significant experience delivering highly technical training content to a variety of audiences, or the interest in doing so combined with established technical abilities in ethereum, blockchain, or an adjacent space such as big data or enterprise software. You must have a high energy, service-oriented, friendly, professional disposition. </p><p>The ideal candidate will be an excellent speaker and be able to evangelize the use for Blockchain by representing ConsenSys as a speaker at key industry events, conferences, guest lectures, and so on. You’re a quick technical study, you love learning for learning’s sake, and you always build your expertise as you go. When you’re not actively teaching courses in person and participating in community activities, you’ll be contributing to our online offering as mentors, actively working on internal enablement within ConsenSys, and helping us to improve our education processes.</p><p>You may be asked to interact with our sales/business development teams to help determine a customer’s training needs. This may require your involvement in the sales process to assist with identifying the client’s true training needs and helping to determine a plan to meet them. You might also help manage the overall global training schedule, which may include providing back-up capacity to your training colleagues in other offices or regions.</p><p>You will be responsible for partnering with Academy content specialists to develop or update training materials, and ensure that you understand the newest content. This may include collecting and providing feedback on what is/is not working in how the content is structured or explained in the courses or programs.</p><p>Your Qualifications:<br>-Bachelor’s degree required, preferably in computer science or related field<br>Either:<br>       -3-5+ years of technical software training experience working with a <br>       variety of audiences<br>       -Demonstrably strong presentation/demonstration skills via other <br>        customer-facing technical roles such as software developer, supporter, <br>        sales engineer, consultant, or similar.<br>-Must have excellent verbal and written skills being able to communicate effectively on both a technical and business level to a diverse, mostly remote team<br>-Entrepreneurial spirit with track record for successfully delivering measurable results in fast-moving environments<br>-Ability to understand complex technical concepts and explain them to non-technical trainees<br>-References who can vouch for your capability to maintain credibility with senior technical staff and executives alike<br>-Flexibility to adapt to changing markets, customers and our non-conventional organization. You’ll be fostering your expertise so you can teach “off book”.<br>-Strong customer facing attitude, attention to detail, and quality of customer service / delivery<br>-Can perform day-to-day work, and new and/or complex assignments with minimal supervision<br>-Passion and enthusiasm for Blockchain and the greater movement it is a part of. Preexisting technical expertise in ethereum a plus.<br>-Great chemistry with our team and culture</p><p>Preferred, but Optional<br>-Prior experience training on Cloud, Big Data, Enterprise Software or similar<br>-Experience working with Ethereum, Blockchain technology, decentralized systems<br>-Proficiency in using Streak, Slack, GoogleDocs, Salesforce and other industry-standard tools<br>-Multi-lingual</p><p>Learn more about us here:<br><a href='https://consensys.net/press/' rel='nofollow'>https://consensys.net/press/</a><br><a href='https://consensys.net' rel='nofollow'>https://consensys.net</a></p></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:40:39 PM",
    "tags": [
      "Account Manager",
      "Canada",
      "Content Development",
      "Course Development",
      "Educational Technology",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/embedded",
      "TITLE1/writer",
      "TZ/unknown",
      "Technical Training",
      "United States"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "ulDJtpOVSu2ApUVUygNQ-w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/remote-jobs/animalz-content-promotion-specialist",
    "title": "Animalz: Content Promotion Specialist",
    "content": "<div>  <div>    <h2>Content Promotion Specialist</h2>      <h4>Posted Feb  2</h4>    <h3>      <span>Animalz</span><br>      <span>Headquarters: New York City</span><br>        <a href='https://www.animalz.co/jobs/' rel='nofollow'>https://www.animalz.co/jobs/</a>    </h3>  </div></div>  <div>    <div>Animalz is a content marketing agency that strives to create the best content on the web. We work with tech companies—particularly B2B SaaS businesses—to make great content that their audience loves. <br></div><div><br></div><div>We're looking for a Content Promotion Specialist to help increase the distribution of the content we create. The Content Promoter will:<br></div><div></div><ul><li>Craft and pitch articles to a variety of tech and SaaS publications.</li><li>Help us develop, launch, and run products related to promotion.</li></ul><div>The right candidate:<br></div><div></div><ul><li>Has experience writing and receiving pitches. You know what makes a good pitch.</li><li>Enjoys networking and establishing new relationships. You are a people person.</li><li>Can execute based on a vision without waiting for instructions. You understand the value of content promotion.</li></ul><div>Our team is remote with a home base in NYC.</div><div><br></div><div>We are an equal opportunity employer and value diversity at our company.<br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>To apply, please send an email with [content promoter] in the subject to <a href='mailto:workwithus@animalz.co' rel='nofollow'>workwithus@animalz.co</a>. In your email, please include: &lt;&lt;&gt;&gt; Your résumé/CV &lt;&lt;&gt;&gt; 3 examples of your promotion at work (articles you've placed, links you've earned, social posts you've amplified, etc.), and &lt;&lt;&gt;&gt;  3 writing samples (URLs, not documents)</p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 3:57:07 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "z-lonehXR_SkJveD-EcdIQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/remote-jobs/legalcom-editor-of-content",
    "title": "Legalcom: Editor of Content",
    "content": "<div>  <div>    <h2>Editor of Content</h2>      <h4>Posted Jan 30</h4>    <h3>      <span>Legalcom</span><br>      <span>Headquarters: EU/US</span><br>        <a href='https://legalcom.group' rel='nofollow'>https://legalcom.group</a>    </h3>  </div>    </div>  <div>    <div>We’re looking for a reliable, talented editor who loves creating high-quality content.<br></div><div></div><div></div><div><span><br></span></div><div><span>We work with a remote team of freelance writers in dozens of countries all over the world and we are looking for an editor to review, edit and manage our content:</span></div><div><span><br></span></div><ul><li>Review and edit articles written by our freelance writers. Work with writers to achieve high-quality articles.<br></li><li>Propose topic ideas<br></li><li>Manage the editorial calendar<br></li><li>And so on</li></ul><div><br></div><div><strong>About The Work</strong><br></div><div></div><div></div><div><br></div><div>The work entails:<br></div><div></div><div></div><div><br></div><ul><li>Manage freelancers writers, starting from replying to their job applications to bringing them on board.<br></li><li>Propose article topics for writers to write about based on collaboration with SEO manager.<br></li><li>Write blog posts and marketing copy to promote our products and services<br></li><li>Proofread, re-structure and edit articles by content writers<br></li><li>Update our website and social media pages with new content<br></li><li>Craft and send our monthly newsletter<br></li><li>Interview industry professionals and use online sources to research topics<br></li><li>Improve illustration in collaboration with marketing and design teams<br></li><li>Optimize published pieces using SEO guidelines<br></li><li>Manage the editorial calendar and ensure timely publication<br></li><li>Generate new ideas around industry-related topics<span>&nbsp;</span></li></ul><div><br></div><div><strong>Job Requirements</strong><br></div><div></div><div></div><div><strong><br></strong></div><ul><li>Native English speaker with strong writing skills. We can make an exception on this if you have an English Proficiency qualification.<br></li><li>Exceptional online research skills<br></li><li>Well organized &amp; rock steady reliable<br></li><li>SEO knowledge<br><br></li></ul><div>It’s a major plus if you have any of the following skills:<br></div><div></div><div></div><div><br></div><ul><li>Legal degree or paralegal experience<br></li><li>Some degree of technical proficiency: working knowledge of HTML and WordPress.</li></ul><div><br></div><div><strong>How Do We Work?</strong><br></div><div></div><div></div><div><span><br></span></div><div><span>We work remotely. We generally don’t need to sync time zones. The tools we use to collaborate are:</span></div><div><span><br></span></div><ul><li>Gmail<br></li><li>Google Suite<br></li><li>Basecamp<br></li></ul><div><span><br></span></div><div><strong>How to Apply</strong></div><div><br></div><div>Please send an email to office@legalcom.group with:</div><div><br></div><div>- A 4-5 sentence introduction explaining why you think you would be a good fit.</div><div>- 3 URLs showcasing your work related to internet laws or technology.</div><div>- Your desired monthly pay or hourly rate. We’ll work on a 2-weeks to a 1-month trial period at first.</div><div><br></div><div>Please format your subject line as follows: Your Name | Editor of Content | WeWorkRemotely (example: John Doe | Editor of Content | WeWorkRemotely)</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please see above &quot;How to Apply&quot;.</p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 30, 2018 11:23:12 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "9-y8wFqNRyKZPuAXI3xi_g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workingnomads.co",
    "url": "https://www.workingnomads.co/jobs/editor-of-content-legalcom",
    "title": "Editor of Content",
    "content": "<p>We’re looking for a reliable, talented editor who loves creating high-quality content.</p><p>We work with a remote team of freelance writers in dozens of countries all over the world and we are looking for an editor to review, edit and manage our content:</p><ul><li><p>Review and edit articles written by our freelance writers. Work with writers to achieve high-quality articles.</p></li><li><p>Propose topic ideas</p></li><li><p>Manage the editorial calendar</p></li><li><p>And so on</p></li></ul><p>&nbsp;</p><p><strong>About The Work</strong></p><p>The work entails:</p><ul><li><p>Manage freelancers writers, starting from replying to their job applications to bringing them on board.</p></li><li><p>Propose article topics for writers to write about based on collaboration with SEO manager.</p></li><li><p>Write blog posts and marketing copy to promote our products and services</p></li><li><p>Proofread, re-structure and edit articles by content writers</p></li><li><p>Update our website and social media pages with new content</p></li><li><p>Craft and send our monthly newsletter</p></li><li><p>Interview industry professionals and use online sources to research topics</p></li><li><p>Improve illustration in collaboration with marketing and design teams</p></li><li><p>Optimize published pieces using SEO guidelines</p></li><li><p>Manage the editorial calendar and ensure timely publication</p></li><li><p>Generate new ideas around industry-related topics</p></li></ul><p>&nbsp;</p><p><strong>Job Requirements</strong></p><ul><li><p>Native English speaker with strong writing skills. We can make an exception on this if you have an English Proficiency qualification.</p></li><li><p>Exceptional online research skills</p></li><li><p>Well organized &amp; rock steady reliable</p></li><li><p>SEO knowledge</p></li></ul><p>It’s a major plus if you have any of the following skills:</p><ul><li><p>Legal degree or paralegal experience</p></li><li><p>Some degree of technical proficiency: working knowledge of HTML and WordPress.</p></li></ul><p>&nbsp;</p><p><strong>How Do We Work?</strong></p><p>We work remotely. We generally don’t need to sync time zones. The tools we use to collaborate are:</p><ul><li><p>Gmail</p></li><li><p>Google Suite</p></li><li><p>Basecamp</p></li></ul>",
    "urlFetchPending": false,
    "published": "Jan 30, 2018 12:54:33 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "uarI26g-QkmAJcYTZhFbMQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "smashingmagazine.com",
    "url": "https://www.smashingmagazine.com/2018/01/work-life-balance-tips-community/",
    "title": "Work-Life Balance: Tips From The Community",
    "content": "        Work-Life Balance: Tips From The Community — Smashing Magazine                                                                                  <div></div>  <a rel='nofollow'>Skip to main content</a>  <a rel='nofollow'>Start reading the article</a>  <a rel='nofollow'>Jump to list of all articles</a>        <div>                <div>            <div>    <a title=&quot;← Back to the homepage&quot; rel='nofollow'>                                            </a></div>            <div>                  <a rel='nofollow'>        Search        Topics            </a>              <div>                    <ul>                                                                                                  <li>                    <a rel='nofollow'>                                                    <span>                                                            </span>                                                          <h3>                                <span>Articles <span>.</span></span>                              </h3>                              <p>Design &amp; development</p>                                                                        </a>                </li>                <li>                    <a rel='nofollow'>                                                    <span>                                                            </span>                                                          <h3>                                <span>Books <span>.</span></span>                              </h3>                              <p>Physical &amp; digital books</p>                                                                        </a>                </li>                <li>                    <a rel='nofollow'>                                                    <span>                                                            </span>                                                          <h3>                                <span>Events <span>.</span></span>                              </h3>                              <p>Conferences &amp; workshops</p>                                                                        </a>                </li>                <li>                    <a rel='nofollow'>                                                    <span>                                                            </span>                                                          <h3>                                <span>Jobs <span>.</span></span>                              </h3>                              <p>Find work &amp; employees</p>                                                                        </a>                </li>                <li>                    <a rel='nofollow'>                                                    <span>                                                            </span>                                                          <h3>                                <span>Membership <span>.</span></span>                              </h3>                              <p>Webinars &amp; early-birds</p>                                                                        </a>                </li>                <li>                    <a rel='nofollow'>                        Browse All Topics                    </a>                </li>            </ul>        </div>            </div>            <div>    <div>                    <div>                                    <a rel='nofollow'>                                    Clear Search                                                </a>        </div>                <div>        <a href='https://www.algolia.com/' rel='nofollow'>                    </a>    </div></div>    <div></div>    <div>    <h5>Browse All Topics</h5>    <ul>              <li>            <a rel='nofollow'>Accessibility</a>        </li>              <li>            <a rel='nofollow'>Android</a>        </li>              <li>            <a rel='nofollow'>Animation</a>        </li>              <li>            <a rel='nofollow'>Apps</a>        </li>              <li>            <a rel='nofollow'>CSS</a>        </li>              <li>            <a rel='nofollow'>Design</a>        </li>              <li>            <a rel='nofollow'>Design Patterns</a>        </li>              <li>            <a rel='nofollow'>Design Systems</a>        </li>              <li>            <a rel='nofollow'>E-Commerce</a>        </li>              <li>            <a rel='nofollow'>Freebies</a>        </li>              <li>            <a rel='nofollow'>Graphics</a>        </li>              <li>            <a rel='nofollow'>HTML</a>        </li>              <li>            <a rel='nofollow'>Illustrator</a>        </li>              <li>            <a rel='nofollow'>Inspiration</a>        </li>              <li>            <a rel='nofollow'>iOS</a>        </li>              <li>            <a rel='nofollow'>JavaScript</a>        </li>              <li>            <a rel='nofollow'>Mobile</a>        </li>              <li>            <a rel='nofollow'>Pattern Libraries</a>        </li>              <li>            <a rel='nofollow'>Performance</a>        </li>              <li>            <a rel='nofollow'>Photoshop</a>        </li>              <li>            <a rel='nofollow'>Plugins</a>        </li>              <li>            <a rel='nofollow'>React</a>        </li>              <li>            <a rel='nofollow'>Responsive Web Design</a>        </li>              <li>            <a rel='nofollow'>Service Workers</a>        </li>              <li>            <a rel='nofollow'>Sketch</a>        </li>              <li>            <a rel='nofollow'>Typography</a>        </li>              <li>            <a rel='nofollow'>UI</a>        </li>              <li>            <a rel='nofollow'>Usability</a>        </li>              <li>            <a rel='nofollow'>User Experience</a>        </li>              <li>            <a rel='nofollow'>Wallpapers</a>        </li>              <li>            <a rel='nofollow'>Web Design</a>        </li>              <li>            <a rel='nofollow'>WordPress</a>        </li>              <li>            <a rel='nofollow'>Workflow</a>        </li>          </ul></div>                                                    <div>                <div>                                  </div>              </div>                        <span>Seriously, red? <span>Switch contrast</span></span>          </div>          </div>                                                            <div>                <div>                                  </div>              </div>                        <span>Seriously, red? <span>Switch contrast</span></span>              </div>          <div>        <div>            <div>                    <a rel='nofollow'>        <div>            <div>                <div></div>            </div>        </div>    </a>            <h4>About The Author</h4>        <p>            Ricky Onsman has been a freelance web designer, developer, writer and editor for over 20 years. A former Managing Editor at <a href='https://www.sitepoint.com/' rel='nofollow'>SitePoint</a> and <a rel='nofollow'>Web Directions</a>, he …            <a rel='nofollow'>More about <span>Ricky</span>…</a>        </p>                                        <ul>                        <li>                                                            <span>January</span>              23, 2018                                                </li>                        <li>                            <span><a rel='nofollow'>                                <span>Leave a comment</span>                            </a></span>                        </li>                    </ul>                    <h2>Work-Life Balance: Tips From The Community</h2>                    <ul>                                      <li>                              <a rel='nofollow'>Productivity</a>                <span>                                    <span>(</span>                                    24                                    <span> articles )</span>                                </span>                          </li>                                      <li>                              <a rel='nofollow'>Quick Tips</a>                <span>                                    <span>(</span>                                    21                                    <span> articles )</span>                                </span>                          </li>                                </ul>                    <div></div>                            </div>            <div>                                <div> <div>  <ul>    <li>        Summary    </li>    <li>        Table of Contents    </li>      </ul></div>    <div>        <h6>Quick Summary</h6>        <p>                                            How do you get the most out of both your career and your personal life? We asked the community to share their tips and advice on achieving a healthy work-life balance, and this is what they had to say.                            </p>    </div>    <div>        <h6>Table of Contents</h6>        <div></div>    </div></div>        <div>  <div>    <div>      <a rel='nofollow'></a>    </div>      <div>      <h3>Members support Smashing</h3>    </div>  </div>  <p><em>Wonderful</em>, friendly people who keep this lil' site alive — and <strong>get smarter</strong> every&nbsp;day.</p>  <a rel='nofollow'>Are you smashing, too?&nbsp;→</a></div>                   </div>            <div>                <div>    </div>                <p>In order to encourage web professionals to consider some of the key points of their working lives in this still nascent industry, we asked folks on <a href='https://twitter.com/smashingmag/status/943058872473935872' rel='nofollow'>Twitter</a> and <a href='https://www.facebook.com/smashmag/posts/10156027292532490' rel='nofollow'>Facebook</a> to share their best work-life balance tips that worked really well for them. We received lots of responses: most very sensible, many very insightful, some quite unexpected and a few deliberately tongue-in-cheek.</p><p>The most important thing to note when thinking about work-life balance is that it is different for everyone. While there may a perfect solution for an individual in any given time, place and work situation, it is almost certain to be different for another individual – by a degree that can be tiny or enormous.</p><p>What we’re looking for, then, is not a single way of approaching work-life balance but suggestions from the community as to what works for them. You may well pick up a tip or two that positively affect your own work-life balance, and <strong>your suggestion might help someone else out</strong>.</p><div><h5>Productivity Tips And Tricks</h5><p>How's your year going so far? Are you as productive as you were hoping to be? Folks from the community also shared their best productivity tips — perhaps there's one you'd like to try to help yourself keep your New Year's Resolution? <a href='https://www.smashingmagazine.com/2017/12/community-productivity-tips-tricks/' rel='nofollow'>Read a related article →</a></p></div><p>There are overall themes and lines of thinking that emerge in our community responses, and we’ll organize them into groups for this article.  I’ll also add some thoughts of my own to these, as I live and work in a situation that allows me to often do what is least recommended – but it works brilliantly for me.</p><p>Let’s work our way from the simplest and easiest to implement to the more complex and potentially challenging suggestions.</p><h4>Control Your Devices</h4><p>A large group of folks focused on managing devices and hardware. This makes a lot of sense. In some ways, we are fortunate to work in an industry where we not only have some truly remarkable hardware and software at our disposal – digital tools of immense power – but we can to some extent control these tools to behave in ways we’d like them to. For some, the key to a good balance between work and life lies in exercising that control.</p>      <div>      <div>        <p>          Is your pattern library up to date today? <em>Alla Kholmatova</em> has just finished a fully fledged book on <strong>Design Systems</strong> and how to get them right. With common traps, gotchas and the lessons she learned. Hardcover, eBook. <em>Just sayin'.</em>        </p>        <a rel='nofollow'>                      Table of Contents&nbsp;→                  </a>      </div>      <div>        <a rel='nofollow'>        <div>                  </div>      </a>      </div>    </div>      <div><p>That included simply turning them off, either partially or completely, or configuring them to be less intrusive.</p><p>Let’s see what the community had to say:</p><table>    <thead>    <tr>        <th>Tip</th>        <th></th>    </tr></thead><tbody>    <tr>        <td>“Phone on flight mode in the evenings/night.”</td>        <td><a href='https://twitter.com/@codepo8' rel='nofollow'>Chris Heilmann</a></td>    </tr>    <tr>        <td>“I keep my phone on ‘do not disturb’ nearly all of the time (unless I’m expecting an important call)”</td>        <td><a href='https://twitter.com/@danatello' rel='nofollow'>Dan Claydon</a></td>    </tr>    <tr>        <td>“No email notifications on phone”</td>        <td><a href='https://twitter.com/@joelambert' rel='nofollow'>Joe Lambert</a></td>    </tr>    <tr>        <td>“My primary phone is on DnD all the time. I have a separate number for family if they have to reach out to me. No one else except family members will ever get that number.”</td>        <td><a href='https://twitter.com/@jaymanpandya' rel='nofollow'>Jayman Pandya</a></td>    </tr>    <tr>        <td>“I don't autosync business email on my phone - it has to be a manual sync.”</td>        <td><a href='https://twitter.com/@choult' rel='nofollow'>(((Chris Hoult)))</a></td>    </tr>    <tr>        <td>“DND mode on a separate phone I reserve for work.”</td>        <td><a href='https://twitter.com/@kryshiggins' rel='nofollow'>Krystal Higgins</a></td>    </tr>    <tr>        <td>“When on holiday my auto-reply says that all emails sent during my holiday will not be read and advises to send the email after. It already has saved me countless of hours reading and replying to email. I can access Skype on my phone (the messaging app of choice at my company), but it doesn't send push notifications or doesn't show a badge. When it's really, really urgent, call me.”</td>        <td><a href='https://twitter.com/@PaulvdDool' rel='nofollow'>Paul van den Dool</a></td>    </tr>    <tr>        <td>“No slack on my phone, if it's urgent people can text or call me.”</td>        <td><a href='https://twitter.com/@JulianNorton' rel='nofollow'>Julian Norton</a></td>    </tr>    <tr>        <td>“I keep my cell number private, and I don't have my business email account on my phone. Also, I just sent an email to my main clients telling them I'll be out of the country and unavailable over the holidays.”</td>        <td><a href='https://twitter.com/@colmdelaney1' rel='nofollow'>Colm Delaney</a></td>    </tr>    <tr>        <td>“Attention and time are finite resources - how you invest them determines your returns in life. Turn off notifications /manual sync /use flight-mode - unless something critical is expected. Separate phones for work and private. Be present. Life fully now.”</td>        <td><a href='https://twitter.com/@bseymour' rel='nofollow'>Ben Seymour</a></td>   </tr></tbody></table><p>A variation on the theme of devices was to remove work software from non-work devices.</p><table>    <thead>    <tr>        <th>Tip</th>        <th></th>    </tr></thead><tbody>    <tr>        <td>“Maintaining regular work hours. No work-related apps on my personal phone. (Yes, that includes work email.)”</td>        <td><a href='https://twitter.com/@tameverts' rel='nofollow'>Tammy Everts</a></td>    </tr>    <tr>        <td>“No work related communication tools (mails, messengers etc. pp.) on private devices. Dress up (as if going into the office) when working remote.”</td>        <td><a href='https://twitter.com/@SharafChris' rel='nofollow'>Christian Sharaf</a></td>    </tr>    <tr>        <td>“I don't sync business emails on my personal phones. I keep slack on it though for emergencies.”</td>        <td><a href='https://twitter.com/@pabuisson' rel='nofollow'>PierreAdrien Buisson</a></td>    </tr>    <tr>        <td>“Right now: no social media / messengers during work; airplane mode during work; no work email / IMs etc. on personal devices. Soon: separate computers for work and after work”</td>        <td><a href='https://twitter.com/@dotmariusz' rel='nofollow'>Mariusz</a></td>    </tr></tbody></table><p>A third variation on managing devices was to physically separate yourself from work devices.</p><table>    <thead>    <tr>        <th>Tip</th>        <th></th>    </tr></thead><tbody>    <tr>        <td>“Computers, smartphones, tablets, laptops in a different room than my bedroom.”</td>        <td><a href='https://twitter.com/@redcrew' rel='nofollow'>Deborah Edwards-Onoro</a></td>    </tr>    <tr>        <td>“I also leave my work laptop in the office - if I need to work out of hours, I have to come in (I'm 10 minutes' drive away).”</td>        <td><a href='https://twitter.com/@choult' rel='nofollow'>(((Chris Hoult)))</a></td>    </tr>    <tr>        <td>“An entire day away from my PC”</td>        <td><a href='https://twitter.com/@almeida_tercero' rel='nofollow'>almeida tercero</a></td>    </tr>    <tr>        <td>“And this one is a luxury: for my home office, I built a separate studio, so I have to walk to the back of my garden to access my work computer.”</td>        <td><a href='https://twitter.com/@tameverts' rel='nofollow'>Tammy Everts</a></td>    </tr>    <tr>        <td>“Get a dedicated office outside the house/join a coworking space had the most profound effect for me by far.”</td>        <td><a href='https://twitter.com/@greg_blass' rel='nofollow'>Greg Blass</a></td>    </tr></tbody></table><p><strong>My Take</strong>: Part of my work is to provide comprehensive web services to a small portfolio of clients who pay me an annual fee to design, build, host, expand, refine and generally manage their web presence. If a client website is down, I need to fix it — pronto. If a client has a question or a task for me, I want to know what that task is ASAP. For that reason, I tend to keep my devices on – although typically silent – while I’m awake and my software configured to alert me to any notifications.</p>  <div></div><p>The thing is, in my situation, notifications simply allow me to decide whether to complete a task and when. If I get a text message or an email while I’m watching TV with the kids, I’ll look at it and decide whether I need to respond immediately. Ninety-nine times out of 100, it can wait. But I want to know, in case that one time in a hundred is critical and requires immediate action. Note that my clients pay a premium for this service and it’s easy for me to do.</p><h4>Commit To Non-Work Activities</h4><p>A different group of tips (although, as you will have noticed, there’s quite a bit of overlap between these groups) focused on making specific time for non-work activities.</p><p>The key here seems to be to make a commitment. We all have things we like to do that help us wind down, but we often let the time for that slide by while we’re busy getting work done: staying longer at the office, completing work tasks at home, and working over the weekend.</p><p>The activities themselves are varied and obviously should reflect your personal interests. Community suggestions included games, hobbies, physical exercise, meditation, children, pets and more. The main point is that they are not, by any definition, work.</p><table>    <thead>    <tr>        <th>Tip</th>        <th></th>    </tr></thead><tbody>    <tr>        <td>“I am bad at this, but I have (mostly) managed to reserve Thursday night as games night for Dungeons and Dragons/board games. The lack of computers has been good for me. Also I put my phone in DnD mode after 7pm, I'm allowed to look at it but I don't get pinged.”</td>        <td><a href='https://twitter.com/@Mandy_Kerr' rel='nofollow'>Mandy Michael</a></td>    </tr>    <tr>        <td>“I've just invested in Settlers of Catan and a bunch of expansions. I don't get time for board games and I want that to change.”</td>        <td><a href='https://twitter.com/@betterbomb' rel='nofollow'>John Lombardo</a></td>    </tr>    <tr>        <td>“Physical workouts ~4 times a week + get yourself a dog </td>        <td><a href='https://twitter.com/@verpixelt' rel='nofollow'>Kevin Lorenz</a></td>    </tr>    <tr>        <td>“Exercise before or after work. (Sweat it out)”</td>        <td><a href='https://twitter.com/@Sal_Sadona' rel='nofollow'>Salvador Sadona</a></td>    </tr>    <tr>        <td>“Consistent, hard workouts before work to start the day positive, all phone notifications off, and time tracking + actually calling it quits when you hit your hours for the day/week.”</td>        <td><a href='https://twitter.com/@ShutterClubDC' rel='nofollow'>Shutter Club Creative</a></td>    </tr>    <tr>        <td>“Schedule breaks in your calendar and clear your head with a walk. ☀️”</td>        <td><a href='https://twitter.com/@Ka_TriN_F' rel='nofollow'>Katrin Freihofner</a></td>    </tr>    <tr>        <td>“Surfing”</td>        <td><a href='https://twitter.com/@rgbjoy' rel='nofollow'>Tom Fletcher</a></td>    </tr>    <tr>        <td>“Meditate meditate meditate”</td>        <td><a href='https://www.facebook.com/nils.huber' rel='nofollow'>Nils Huber</a></td>    </tr>    <tr>        <td>“Meditation. And choosing the fucks to give wisely.”</td>        <td><a href='https://twitter.com/@rktic' rel='nofollow'>Ronny Pries</a></td>    </tr>    <tr>        <td>“Kids &amp; Hobbies.”</td>        <td><a href='https://twitter.com/@trilodge' rel='nofollow'>Fabian Tempel</a></td>    </tr>    <tr>        <td>“Kids”</td>        <td><a href='https://twitter.com/@maddesigns' rel='nofollow'>Sven Wolfermann</a></td>    </tr>    <tr>        <td>“My dog really helped me. Every day he needs walked, so that means I get outside &amp; get walked, too. He also needs fun on the weekends, so I also get fun on the weekends. When I take care of him, I'm also caring for myself. Mutually beneficial. ”</td>        <td><a href='https://twitter.com/@endesignonline' rel='nofollow'>Erin Weigel</a></td>    </tr></tbody></table><p><strong>My Take</strong>: This is something I agree with and generally find easy to implement. Having two teenage children helps, requiring varying levels of direct and indirect participation in a range of sporting and cultural events, but I also play some sport myself and have a couple of other structured, social leisure activities, as well as random family board games, movie nights and outings. I also have a dog, a Border Collie, and I completely agree with Erin Weigel.</p><h4>Manage Your Time</h4><p>Allowing, again, for overlaps, there was a distinct group of tips that focused on how we divide and use our time, on an hourly, daily, weekly or longer basis. They acknowledge that the clock doesn’t have to rule our lives but can be a good tool for achieving balance.</p><table>    <thead>    <tr>        <th>Tip</th>        <th></th>    </tr></thead><tbody>    <tr>        <td>“Don't do any work stuff before you get to the office. Wake up and invest time on you/your family/partner /etc. Your brain is fresh and full of energy. Use it for something else. Work can wait.”</td>        <td><a href='https://twitter.com/@diegolamanno' rel='nofollow'>Diego La Manno</a></td>    </tr>    <tr>        <td>“Regular breaks, chat to people to stimulate ideas/creativity, little nap in the afternoon if you can, a nice long walk during lunch, most importantly don’t touch the laptop at home after work unless for booking flights :)”</td>        <td><a href='https://twitter.com/@AsWeb85' rel='nofollow'>Alessandro Santese</a></td>    </tr>    <tr>        <td>“Work from home, 9am - 3pm, Tues-Thurs, lunch break 12-1pm, the rest go without laptop and phone as much as possible, if too rocky a transition then meditate when transitioning from work to home. Hug family members when you first see them after work. Forget work and Enjoy.”</td>        <td><a href='https://twitter.com/@Great2BN8' rel='nofollow'>Great2BNate</a></td>    </tr>    <tr>        <td>“Spend a lot of time with partner, family, friends or whoever reminds you that there’s more to life than just work. Side projects, learning things, looking at screens or books, that’s all work.”</td>        <td><a href='https://twitter.com/@simonminter' rel='nofollow'>Simon Minter</a></td>    </tr>    <tr>        <td>“Work harder in the beginning of the week to get your stuff done. Coast to the weekend instead of being stressed Thurs and Fri.”</td>        <td><a href='https://twitter.com/@phiberoptik' rel='nofollow'>ʞıʇdoɹǝqıɥd</a></td>    </tr>    <tr>        <td>“Half an hour at the beach is more than just half an hour away from your desk. It's as good as an hour's break ️ And you can multitask and get a nap in while you're there”</td>        <td><a href='https://twitter.com/@amykate_94' rel='nofollow'>Amy</a></td>    </tr>    <tr>        <td>“First put the things you love to do to your calendar and only after that plan your work week.”</td>        <td><a href='https://twitter.com/@kaririihela' rel='nofollow'>Kari Riihelä</a></td>    </tr>    <tr>        <td>“Never, ever, take work home. Ever.”</td>        <td><a href='https://twitter.com/@S13SFC' rel='nofollow'>David Walker</a></td>    </tr>    <tr>        <td>“Forget about work once you step out of the office.“</td>        <td><a href='https://twitter.com/@greyhuudie' rel='nofollow'>grei</a></td>    </tr>    <tr>        <td>“Strictly no overtime and no regular travel at work.”</td>        <td><a href='https://twitter.com/@niorad' rel='nofollow'>Antonio Radovčić</a></td>    </tr>    <tr>        <td>“No work at all outside of Monday-Friday 9-5, sounds simple but I’m lucky to have a job where that’s possible and encouraged.”</td>        <td><a href='https://twitter.com/@edinbeth' rel='nofollow'>Beth Fraser</a></td>    </tr>    <tr>        <td>“Always work 9-5 no matter if you’re working in the office or from home, self employed or remote working.”</td>        <td><a href='https://twitter.com/@RobindeJongh' rel='nofollow'>Robin de Jongh</a></td>    </tr>    <tr>        <td>“If you work for yourself, as I did for years, it’s really hard. It really comes down to being honest about how much time a job will truly require when you bid for the job. In-house, it’s all about communicating required tasks to your boss and teammates, they can help enforce priority”</td>        <td><a href='https://twitter.com/@mikerapp' rel='nofollow'>Mike Rapp</a></td>    </tr>    <tr>        <td>“Become freelance and restrict yourself to only working 200 days a year. If you’re ahead of target then there is no need to worry about the cost of a day off.”</td>        <td><a href='https://twitter.com/@davidjbradshaw' rel='nofollow'>David J. Bradshaw</a></td>    </tr></tbody></table><p><strong>My Take</strong>: This is where my experience defies all or most of the tips and suggestions offered. I work from home as a freelancer, a web designer, developer, writer. My wife is a writer and editor who also works from home. We have two high school teenagers at home, and we live 100 miles or so south of the big city of Sydney, Australia. My day is a jigsaw puzzle of work tasks and home tasks, following no real schedule other than doing what needs to be done, whether it’s a client job or a household chore, each often to a non-negotiable timetable. I juggle work tasks and home tasks interchangeably. Frankly, they are just all tasks to me. Some, I get paid for. Some keep my family housed, fed, clothed, educated and entertained. It all has to be done, and it all gets done.</p><p>I must acknowledge that I have specific advantages. Having done this for over 20 years, I have put together a reliable, secure home office with all the tools I need to work. I live in a house big enough to accommodate two people working without tripping over each other. 90% of my work is done remotely (the exception being face-to-face meetings with clients), and I deliberately seek out and take such work. I’m also fortunate that I genuinely and absolutely love what I do, and how I get to do it. I doubt that I will or even could hold down a regular job again.</p><p>I do also believe that my situation is becoming increasingly common and increasingly viable for many people. A lot of those people may well find setting clear divisions between home and work tasks is beneficial, or even necessary. Others may find an approach similar to the one I use is more effective. It all depends.</p><h4>Change Your Thinking</h4><p>Some people offered suggestions aimed at changing the way we think about work and lowering its priority in our lives. We’re getting into the bigger picture here and, perhaps as a consequence, some of these tips will only work for some people – but they might all help you to reflect on your own situation.</p><table>    <thead>    <tr>        <th>Tip</th>        <th></th>    </tr></thead><tbody>    <tr>        <td>“Start by calling it life-work balance to emphasise where your priority is.”</td>        <td><a href='https://twitter.com/@davidjbradshaw' rel='nofollow'>David J. Bradshaw</a></td>    </tr>    <tr>        <td>“Work-life is wrong as work is a big part in our life, those are not equal.”</td>        <td><a href='https://twitter.com/@georg_ringer' rel='nofollow'>Georg Ringer</a></td>    </tr>    <tr>        <td>“I find that keeping myself sane at work keeps me sane in life. To do so, I have to take time at work to step back and evaluate. Admit when I’m overwhelmed and slowly create a plan. Don’t fear a moment’s non-productivity. Be a great human, not a mediocre machine.”</td>        <td><a href='https://twitter.com/@JKatzwinkel' rel='nofollow'>Jason Katzwinkel</a></td>    </tr>    <tr>        <td>“Do as your wife says. Happy wife, happy me :D”</td>        <td><a href='https://twitter.com/@deveti' rel='nofollow'>Matic Krajnc</a></td>    </tr>    <tr>        <td>“Constantly remind yourself that there is MORE to life than your job. Learn to prioritize, by planning your schedule. Never forget to set long term goals (build up relationships, improve self, etc) so you don’t spend time on wrong thigs ”</td>        <td><a href='https://twitter.com/@ajmatillano' rel='nofollow'>anna jane matillano</a></td>    </tr>    <tr>        <td>“Swap from automobile to bicycle will change ur life, not spending more than u need and giving the rest, learn how to play an instrument, sing! Be kind and talk with people!”</td>        <td><a href='https://twitter.com/@JuanPabloSarmi' rel='nofollow'>Juan Sarmiento</a></td>    </tr>    <tr>        <td>“Offline Saturday, no more than 10-11 hours of code per day. So you can sustain longer before burnout  Oh and B vitamins”</td>        <td><a href='https://twitter.com/@valorkin' rel='nofollow'>Dmitriy Shekhovtsov</a></td>    </tr>    <tr>        <td>“Work when you're motivated.”</td>        <td><a href='https://twitter.com/@DaveThackeray' rel='nofollow'>Thack</a></td>    </tr>    <tr>        <td>“Retirement ... lol”</td>        <td><a href='https://twitter.com/@issyrphotos' rel='nofollow'>issyr photography</a></td>    </tr>    <tr>        <td>“Code early. Done by 3pm. Long walk. Watch sunset.  Not a care in the world.  Turned 70 this year.”</td>        <td><a href='https://twitter.com/@RonRichardson' rel='nofollow'>Ron Richardson</a></td>    </tr>    <tr>        <td>“I treat work as a side job and life as my real job”</td>        <td><a href='https://twitter.com/@jsonbhtml' rel='nofollow'>jsonb</a></td>    </tr></tbody></table><p><strong>My Take</strong>: Once I put myself in a position of pitching for work and undertaking several projects at once, it became necessary to think about “work” in a different way. I developed strategies and techniques that inevitably affected my work-life balance. I’m now very comfortable living a life defined not by what is work and what isn’t, but simply by what needs to be done at any given time.</p><h4>Over To You</h4><p>Quite a few people gave us lists that included several of the individual points made by others (you can read more of these posts on <a href='https://twitter.com/smashingmag/status/943058872473935872' rel='nofollow'>Twitter</a> and SmashingMag’s <a href='https://www.facebook.com/smashmag/posts/10156027292532490' rel='nofollow'>Facebook</a> page). We’d be delighted should you care to contribute the strategies you use to find a reasonable work-life balance.</p><p>You are also very welcome to add your tips in the comments below. We’d love to hear from you!</p><div>    <span>(vf, ra, il)</span></div>  <div></div></div>            </div>        </div>                 <div>            <div>                                                </div>        </div>                    <div></div>                </div>     <div>        <div>            <div>    <h5>Browse All Smashing Magazine Topics</h5>    <ul>              <li>            <a rel='nofollow'>Accessibility</a>        </li>              <li>            <a rel='nofollow'>Android</a>        </li>              <li>            <a rel='nofollow'>Animation</a>        </li>              <li>            <a rel='nofollow'>Apps</a>        </li>              <li>            <a rel='nofollow'>CSS</a>        </li>              <li>            <a rel='nofollow'>Design</a>        </li>              <li>            <a rel='nofollow'>Design Patterns</a>        </li>              <li>            <a rel='nofollow'>Design Systems</a>        </li>              <li>            <a rel='nofollow'>E-Commerce</a>        </li>              <li>            <a rel='nofollow'>Freebies</a>        </li>              <li>            <a rel='nofollow'>Graphics</a>        </li>              <li>            <a rel='nofollow'>HTML</a>        </li>              <li>            <a rel='nofollow'>Illustrator</a>        </li>              <li>            <a rel='nofollow'>Inspiration</a>        </li>              <li>            <a rel='nofollow'>iOS</a>        </li>              <li>            <a rel='nofollow'>JavaScript</a>        </li>              <li>            <a rel='nofollow'>Mobile</a>        </li>              <li>            <a rel='nofollow'>Pattern Libraries</a>        </li>              <li>            <a rel='nofollow'>Performance</a>        </li>              <li>            <a rel='nofollow'>Photoshop</a>        </li>              <li>            <a rel='nofollow'>Plugins</a>        </li>              <li>            <a rel='nofollow'>React</a>        </li>              <li>            <a rel='nofollow'>Responsive Web Design</a>        </li>              <li>            <a rel='nofollow'>Service Workers</a>        </li>              <li>            <a rel='nofollow'>Sketch</a>        </li>              <li>            <a rel='nofollow'>Typography</a>        </li>              <li>            <a rel='nofollow'>UI</a>        </li>              <li>            <a rel='nofollow'>Usability</a>        </li>              <li>            <a rel='nofollow'>User Experience</a>        </li>              <li>            <a rel='nofollow'>Wallpapers</a>        </li>              <li>            <a rel='nofollow'>Web Design</a>        </li>              <li>            <a rel='nofollow'>WordPress</a>        </li>              <li>            <a rel='nofollow'>Workflow</a>        </li>          </ul></div>        </div>        <div>            <div>                <p>With a commitment to quality content for the design community.</p>                <p>Founded by Vitaly Friedman and Sven Lennartz. <span>2006–2018</span>.</p>                <p>Smashing is proudly running on <a href='http://www.netlify.com/?utm_source=smashing&amp;utm_medium=link&amp;utm_campaign=footer' rel='nofollow'>Netlify</a>.</p>                <p>Fonts by <a href='http://latinotype.com/' rel='nofollow'>Latinotype</a>.</p>            </div>            <ul>                <li>✎ <a rel='nofollow'>Write for us</a></li>                <li><a rel='nofollow'>Contact us</a></li>                <li><a rel='nofollow'>About us (Impressum)</a></li>                <li><a rel='nofollow'>Privacy policy</a></li>                <li><a rel='nofollow'>Membership login</a></li>                <li><a href='mailto:markus.seyfferth@smashingmagazine.com?subject=Let’s talk about advertising' rel='nofollow'>Advertise</a></li>            </ul>        </div>    </div>    <div>    <a title=&quot;Back to top&quot; rel='nofollow'>                    Back to top                                    </a></div>    <div></div>  <div></div>                  ",
    "urlFetchPending": false,
    "published": "Jan 23, 2018 12:30:24 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "yyTFiVrTQg6z_rJBj0VcSg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workingnomads.co",
    "url": "https://www.workingnomads.co/jobs/freelance-writers-simplify-legalese-legalcom-group",
    "title": "Freelance Writers, Simplify Legalese",
    "content": "<p>We’re looking for reliable, talented freelance writers who love writing about a wide range of topics, including legal topics.</p><p>Most of our work is on legal topics. All topics related to legal are entry-level and not at an academic level.</p><p>You’ll be writing about everything from why a certain legal contract is required for a business to writing a checklist article of best tools to use for an e-commerce store to increase sales.</p><p>&nbsp;</p><p><strong>About The Work</strong></p><p>Our articles are often 1000+ words, generally around 2,000 words. Some articles are beyond 10,000 words.</p><p>We understand the value of quality content. We’re not looking for plain text articles, but well-researched articles to educate our customers: articles with images, links, quotes from research papers, expert’s quotes etc.</p><p>We’re not looking to game search engines, but rather educate our customers about the legal contracts they’re searching for. We aim to be a teacher to our customers.</p><p>We are looking for writers available of a minimum of one day/week. We have as much work as you can handle. We don’t micro-manage.</p><p>We are very clear on what we want for every article. We provide topics with a proposed structure including due dates and the minimum required length. There is sometimes communication back and forth during the revision session. But for the most part: you write the article, turn it in, we review and ask for edits if necessary and then publish it.</p><p>Writers get paid every other week, in US dollars by PayPal.</p><p>Depending on where we’ll publish your work, and for as much as can, we’ll show your bio byline to give you author credits.</p><p>&nbsp;</p><p><strong>Job Requirements</strong></p><ul><li><p>Native English speaker with strong writing skills. We can make an exception on this if you have an English Proficiency qualification.</p></li><li><p>Exceptional online research skills</p></li><li><p>Well organized and reliable</p></li><li><p>Some degree of technical proficiency</p></li><li><p>Basic WordPress skills</p></li><li><p>Basic HTML skills</p></li></ul><p>It’s a major plus if you have any of the following:</p><ul><li><p>Legal degree or paralegal experience</p></li></ul><p>&nbsp;</p><p><strong>How Do We Work?</strong></p><p>We work remotely. We generally don’t need to sync time zones. And we work mainly in Google Docs, over chat and email.</p><p>&nbsp;</p><p><strong>How To Apply?</strong></p><p>Please send an email to office@legalcom.group with:</p><ul><li><p>A 4-5 sentence introduction explaining why you think you would be a good fit</p></li><li><p>3 URLs showcasing your work related to internet laws or technology</p></li></ul><p>Please format your subject line as follows: Your Name | Freelance Writer (example: John Doe | Freelance Writer).</p><p>We look forward to hearing from you!</p>",
    "urlFetchPending": false,
    "published": "Jan 11, 2018 10:08:34 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "cCeSIIgTT9mLbk9szmFzeA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/remote-jobs/aha-senior-writer",
    "title": "Aha!: Senior Writer",
    "content": "<div>  <div>    <h2>Senior Writer</h2>      <h4>Posted Jan 11</h4>    <h3>      <span>Aha!</span><br>      <span>Headquarters: United States</span><br>        <a href='https://www.aha.io/company/careers/current-openings/technical_support_writer_us' rel='nofollow'>https://www.aha.io/company/careers/current-openings/technical_support_writer_us</a>    </h3>  </div>    </div>  <div>    <div>Do you love writing about how people innovate and build winning products? Does double-spacing make your eye twitch? We are looking for a self-starter with proven editorial and technical chops. Someone who can bring both big-picture pitches and eagle-eyed attention to detail — with a product management angle. If this is you, we want to hear from you!</div><div><br></div><div>As a Senior Writer at Aha!, you will have an excellent opportunity to join a breakthrough and profitable company that is growing fast. Aha! was founded by a proven team of Silicon Valley veterans whose last two businesses were acquired by well-known public companies. More than 150,000 users trust Aha! to link their brilliant strategy to their team's work and create visual roadmaps.</div><div><br></div><div><h5>We are looking for someone who:</h5><h5></h5></div><ul><li>Has experience in a B2B SaaS or technology company</li><li>Has deep experience in and knowledge of product management</li><li>Writes exceptionally well (and has the clips to prove it)</li><li>Has proven research skills</li><li>Dreams about the best way to tell a story</li><li>Has a deep interest in a diverse mix of content topics, including but not limited to: product management, software development, innovation, and startups</li><li>Is bold, likes to interact with customers, and takes on increasing levels of responsibility</li></ul><div><span><br></span></div><ul></ul><div><h5>We are committed to being great, and we want someone who:</h5></div><ul><li>Can work at a fast-paced company where the feedback cycle is measured in hours rather than weeks</li><li>Has a &quot;can do&quot; attitude and a background of delivering superb work again and again</li><li>Is seeking a career-defining opportunity and a proven, results-oriented team which has sold multiple software companies</li></ul><div><span><br></span></div><div><i>We are building a distributed team, and you can work from anywhere in the United States for this role. We offer generous salary, equity, benefits, and a profit-sharing program.</i></div><div><br></div><div><b>For immediate consideration, please follow these&nbsp;<a title=&quot;Read this first&quot; href='https://blog.aha.io/the-best-cover-letters-that-ceos-love-to-read/' rel='nofollow'>helpful guidelines</a>&nbsp;and contact us at&nbsp;<a href='mailto:Marketing-jobs@aha.io' rel='nofollow'>Marketing-jobs@aha.io</a>. If you have the right background, we will quickly follow up with you. We are not working with recruiters or third-party agencies.</b></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please send resume and cover letter to: <a href='mailto:Marketing-jobs@aha.io' rel='nofollow'>Marketing-jobs@aha.io</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 10, 2018 10:41:44 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "hIsAxCcCQHO_Alcrk-BB_w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/onychek/jobs/143160-fashion-copywriter",
    "title": "Fashion Copywriter",
    "content": "<div><h2>Fashion Copywriter at ONYCHEK</h2><div>New York City, Remote · Internship</div><div></div></div><div><div>Skills</div><div>Content Management, Ecommerce, Online Marketing and Copywriting, Content Marketing, Copy Writing and Editing, Fashion Journalism, Experience Luxury Beauty/Fashion Industry, Product Description</div><div>Compensation</div><div>$8K–$10K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Are you interested in working for a fashion startup? Are you interested in an opportunity for you to make a great impact from Day 1 of the company launching? We are looking for a paid fashion copywriter intern, who is interested in the infusion of African luxury fashion and amazing content.</p><p>Our team is very keen in identifying topics and stories that appeal to our audience. We create and distribute content that  helps establish ONYCHEK Blog, THEINSIGHT, as a trusted source of African luxury fashion information, inspiration, and commerce. A successful candidate would enjoy writing marketing content for fashion topics such as culture, styling tips, fabrics, &quot;how to&quot; and history.</p><p>This internship position will work directly with the CEO and content creator lead in coordinating content production.</p><p>About ONYCHEK</p><p>ONYCHEK.com is a New York based African Luxury Fashion ecommerce startup. We are making African Luxury Fashion easily accessible to the world.</p><p>Responsibilities </p><p>Write content for the ONYCHEK blog, product descriptions, and our social media handles<br>Research, write, and/or edit many other types of content, which could include: emails, articles, social media posts, editorials, presentations, emails, and web copy<br>Work with team members to brainstorm, develop, create, and promote content that appeals to our global audience<br>Help manage and maintain all the behind-the-scenes systems and processes that keep us running well: editorial calendars, content inventories, analytics, etc.</p><p>Requirements<br>Ability to turn ideas into compelling concepts/copy<br>Ability to flexibly adapt your writing style to our audience <br>Strong editing and proofreading skills<br>Experience working in customer service is a plus<br>Experience with Photoshop, Google Analytics, HTML, video editing, social media marketing is a major plus</p><p>Characteristics<br>Passion for the written word, creativity, and content marketing<br>Demonstrated aptitude for storytelling<br>Entrepreneurial, team player<br>Excitement for all aspects of content development - idea generation, research, writing, gathering input and buy in, editing, collaborating with web designer/developer. For watching your work make impact<br>A healthy respect for deadlines, and the drive to see projects through to completion<br>Motivated to learn new skills and disciplines<br>Self motivated/ self starter<br>Willing to try new things<br>HTML and CSS experience will be helpful</p><p>What You Will Learn:<br>The ability to move fast in decision making<br>Growing a fashion startup<br>Wearing different hats at the same time<br>Quick reiteration</p><p>Details:<br>Candidate should be willing to work between 10-20 hours a week and can be remote.</p><p>Please send resume to <a href='mailto:team@onychek.com' rel='nofollow'>team@onychek.com</a></p></div>",
    "urlFetchPending": false,
    "published": "Dec 27, 2017 6:27:27 PM",
    "tags": [
      "Content Creator",
      "Content Management",
      "Content Marketing",
      "Copy Writing and Editing",
      "Ecommerce",
      "Experience Luxury Beauty/Fashion Industry",
      "Fashion Journalism",
      "Internship",
      "New York City",
      "Online Marketing and Copywriting",
      "Product Description",
      "REMOTE1/50",
      "Remote OK",
      "TECH1/frontend",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "jSRYWn2nRgOFU_9mziQsGg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/flipt-1/jobs/140851-content-creator",
    "title": "Content Creator",
    "content": "<div><h2>Content Creator at FLIPT</h2><div>Seattle, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$36K–$50K<br>0.0%–0.01%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Online Marketing, Content Creation, Email Marketing, Social Marketing, Act-On, Facebook, Google, Landing Pages, Real Estate tech</p></div>",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 12:15:54 AM",
    "tags": [
      "Content Creator",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Seattle",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "B9urFWEyQHiZ7eyfLQvKzw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8423-blog-editor-and-copywriter",
    "title": "Blog Editor and Copywriter",
    "content": "Blog Editor and Copywriter - Jobmote<div><div><h2>Blog Editor and Copywriter</h2><h5>Hubstaff</h5></div></div><div><div><div><div><div><p>Full Time </p><p>North American based candidates only please</p><p>As the Blog Editor and Copywriter, you’ll help determine blogstrategy while writing compelling, fun, and conversion oriented content.You’ll help shape the new voice and tone of the brand and be the go-toperson for all headlines and website copy. You’ll also write and editemails, product copy, guides, and any other words our customers see!</p><p>The Role: </p><p>Partner with marketing team to define the blog strategy, themes andstories necessary to increase traffic, readership and conversion. </p><p>Own the content calendar and ensure the story being told is clear, purposeful, and compelling. </p><p>Define and manage standards for the Blog channel, ensure that content(visuals and copy) meets editorial standards. Comfortable stepping in orpushing back when content does not meet the level of quality expected. </p><p>Capture key strategic insights from usage data and use it to fine tune blog strategy. </p><p>Write high converting headlines, copy, emails, and other content marketing collateral.</p><p>Your background: </p><p>5+ years of experience as an editor and/or copywriter. </p><p>You’ve successfully managed and grown blogs before, bonus points for SAAS experience. </p><p>A skilled writer with a proven track record of writing content for both small business and enterprise audiences. </p><p>You’re a content marketing pro. </p><p>Ability to clearly articulate a strategy, both written and verbal, with awide variety of stakeholders at all levels of the organization. </p><p>You’re a great storyteller, a sense of fun and personality shines through in your writing </p><p>Strong collaborator. </p><p>Ability to effectively prioritize tasks and manage time within a fast-paced environment.</p><p>This is us: </p><p>Hubstaff is a thriving startup with a fully distributed team. We are akind and transparent team with a bright future. You’ll work hard andface exciting challenges but our work comes with great advantages andfulfillment. Our wonderful team members can expect... </p><p>Competitive pay </p><p>Flexible schedule, work anywhere </p><p>Long term meaningful work </p><p>Annual Retreat </p><p>Opportunities for growth </p><p>We celebrate and value everyone’s individualities. We believe diversethought and perspective leads to collaboration, product innovation, and asuccessful business.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 8, 2017 1:00:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "_mVmhXljRpyDiNR9ZV_czQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-copywriting",
    "url": "https://weworkremotely.com/jobs/5913-blog-editor-and-copywriter",
    "title": "Hubstaff: Blog Editor and Copywriter",
    "content": "<div>  <div>    <h2>Blog Editor and Copywriter</h2>      <h4>Posted Dec  7</h4>    <h3>      <span>Hubstaff</span><br>      <span>Headquarters: Remote</span><br>        <a href='https://hubstaff.com/' rel='nofollow'>https://hubstaff.com/</a>    </h3>  </div>    </div>  <div>    <div>Full Time<br></div><div>North American based candidates only please</div><div><br></div><div></div><div>As the Blog Editor and Copywriter, you’ll help determine blog strategy while writing compelling, fun, and conversion oriented content. You’ll help shape the new voice and tone of the brand and be the go-to person for all headlines and website copy. You’ll also write and edit emails, product copy, guides, and any other words our customers see!</div><div><br></div><div></div><div>The Role:<br></div><div>Partner with marketing team to define the blog strategy, themes and stories necessary to increase traffic, readership and conversion.<br></div><div>Own the content calendar and ensure the story being told is clear, purposeful, and compelling.<br></div><div>Define and manage standards for the Blog channel, ensure that content (visuals and copy) meets editorial standards. Comfortable stepping in or pushing back when content does not meet the level of quality expected.<br></div><div>Capture key strategic insights from usage data and use it to fine tune blog strategy.<br></div><div>Write high converting headlines, copy, emails, and other content marketing collateral.</div><div><br></div><div></div><div>Your background:<br></div><div>5+ years of experience as an editor and/or copywriter.<br></div><div>You’ve successfully managed and grown blogs before, bonus points for SAAS experience.<br></div><div>A skilled writer with a proven track record of writing content for both small business and enterprise audiences.<br></div><div>You’re a content marketing pro.<br></div><div>Ability to clearly articulate a strategy, both written and verbal, with a wide variety of stakeholders at all levels of the organization.<br></div><div>You’re a great storyteller, a sense of fun and personality shines through in your writing<br></div><div>Strong collaborator.<br></div><div>Ability to effectively prioritize tasks and manage time within a fast-paced environment.</div><div><br></div><div></div><div>This is us:<br></div><div>Hubstaff is a thriving startup with a fully distributed team. We are a kind and transparent team with a bright future.  You’ll work hard and face exciting challenges but our work comes with great advantages and fulfillment. Our wonderful team members can expect...<br></div><div>Competitive pay<br></div><div>Flexible schedule, work anywhere<br></div><div>Long term meaningful work<br></div><div>Annual Retreat<br></div><div>Opportunities for growth<br></div><div>We celebrate and value everyone’s individualities. We believe diverse thought and perspective leads to collaboration, product innovation, and a successful business.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://talent.hubstaff.com/jobs/blog-editor-and-copywriter' rel='nofollow'>https://talent.hubstaff.com/jobs/blog-editor-and-copywriter</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 8, 2017 12:25:50 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "39dHbectSiWq_jDlInAPfg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63563",
    "title": "Blog Editor and Copywriter",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div>Full Time<br></div><div>North American based candidates only please</div><div><br></div><div></div><div>As the Blog Editor and Copywriter, you’ll help determine blog strategy while writing compelling, fun, and conversion oriented content. You’ll help shape the new voice and tone of the brand and be the go-to person for all headlines and website copy. You’ll also write and edit emails, product copy, guides, and any other words our customers see!</div><div><br></div><div></div><div>The Role:<br></div><div>Partner with marketing team to define the blog strategy, themes and stories necessary to increase traffic, readership and conversion.<br></div><div>Own the content calendar and ensure the story being told is clear, purposeful, and compelling.<br></div><div>Define and manage standards for the Blog channel, ensure that content (visuals and copy) meets editorial standards. Comfortable stepping in or pushing back when content does not meet the level of quality expected.<br></div><div>Capture key strategic insights from usage data and use it to fine tune blog strategy.<br></div><div>Write high converting headlines, copy, emails, and other content marketing collateral.</div><div><br></div><div></div><div>Your background:<br></div><div>5+ years of experience as an editor and/or copywriter.<br></div><div>You’ve successfully managed and grown blogs before, bonus points for SAAS experience.<br></div><div>A skilled writer with a proven track record of writing content for both small business and enterprise audiences.<br></div><div>You’re a content marketing pro.<br></div><div>Ability to clearly articulate a strategy, both written and verbal, with a wide variety of stakeholders at all levels of the organization.<br></div><div>You’re a great storyteller, a sense of fun and personality shines through in your writing<br></div><div>Strong collaborator.<br></div><div>Ability to effectively prioritize tasks and manage time within a fast-paced environment.</div><div><br></div><div></div><div>This is us:<br></div><div>Hubstaff is a thriving startup with a fully distributed team. We are a kind and transparent team with a bright future. You’ll work hard and face exciting challenges but our work comes with great advantages and fulfillment. Our wonderful team members can expect...<br></div><div>Competitive pay<br></div><div>Flexible schedule, work anywhere<br></div><div>Long term meaningful work<br></div><div>Annual Retreat<br></div><div>Opportunities for growth<br></div><div>We celebrate and value everyone’s individualities. We believe diverse thought and perspective leads to collaboration, product innovation, and a successful business.</div><div><br></div><p><strong>To apply:</strong> <a href='https://talent.hubstaff.com/jobs/blog-editor-and-copywriter' rel='nofollow'>https://talent.hubstaff.com/jobs/blog-editor-and-copywriter</a></p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 8, 2017 12:25:50 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "4aJ_Qg_nTMKrvhJ2NG8Iww",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/129541-restaurant-scout-content-editor",
    "title": "Restaurant Scout / Content Editor",
    "content": "<div><h2>Restaurant Scout / Content Editor at Forkable</h2><div>Chicago, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The restaurant scout finds great new restaurants for Forkable and helps us input them into our system. Sometimes you'll need to try the food out to make sure it's up to snuff.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Chicago",
      "Full Time",
      "Office Manager",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "m1taLOT1S3iyFU92y_iHQA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/129540-restaurant-scout-content-editor",
    "title": "Restaurant Scout / Content Editor",
    "content": "<div><h2>Restaurant Scout / Content Editor at Forkable</h2><div>New York City, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The restaurant scout finds great new restaurants for Forkable and helps us input them into our system. Sometimes you'll need to try the food out to make sure it's up to snuff.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Full Time",
      "New York City",
      "Office Manager",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "IP7NpsnmQPe7YMXLPEUWSQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-copywriting",
    "url": "https://weworkremotely.com/jobs/5901-freelance-writer-literature-guides",
    "title": "LitCharts: Freelance Writer - Literature Guides",
    "content": "<div>  <div>    <h2>Freelance Writer - Literature Guides</h2>      <h4>Posted Dec  6</h4>    <h3>      <span>LitCharts</span><br>      <span>Headquarters: New York</span><br>        <a href='https://www.litcharts.com/' rel='nofollow'>https://www.litcharts.com/</a>    </h3>  </div>    </div>  <div>    <div><span>LitCharts writersare an exclusive group of<span>&nbsp;excellentwriters with a deep understanding of literature and how to teach it to others.LitCharts writers have gone on to become </span>best-selling nonfiction writers,<span>&nbsp;</span>2017 national book award finalists,<span>&nbsp;</span>New York Times journalists,<span>&nbsp;</span>Harvard literature PhD candidates,<span>&nbsp;</span>and more. Now you can apply to jointhem!</span></div><div><span><br></span></div><div><span>We're hiringwriters to help expand our collection of over 500 literature guides. Writerscan work from anywhere and compensation varies based on the length anddifficulty of the work. Pace and schedule are flexible, though our idealcandidates will have at least 10 hours per week to spend writing LitCharts.</span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Interested writers should email a resume and two writing samples to <a href='mailto:writing@litcharts.com' rel='nofollow'>writing@litcharts.com</a>. Writing samples should be academic papers that show an ability to analyze literature with insight and clarity. Each sample should be at least five pages long.</p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 8:02:51 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "TLqfI6iBRGGcBM9nrOtjBw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-copywriting",
    "url": "https://weworkremotely.com/remote-jobs/litcharts-freelance-writer-literature-guides",
    "title": "LitCharts: Freelance Writer - Literature Guides",
    "content": "<div>  <div>    <h2>Freelance Writer - Literature Guides</h2>      <h4>Posted Jan  7</h4>    <h3>      <span>LitCharts</span><br>      <span>Headquarters: New York</span><br>        <a href='https://www.litcharts.com/' rel='nofollow'>https://www.litcharts.com/</a>    </h3>  </div>    </div>  <div>    <div><span>LitCharts writersare an exclusive group of<span>&nbsp;excellentwriters with a deep understanding of literature and how to teach it to others.LitCharts writers have gone on to become </span>best-selling nonfiction writers,<span>&nbsp;</span>2017 national book award finalists,<span>&nbsp;</span>New York Times journalists,<span>&nbsp;</span>Harvard literature PhD candidates,<span>&nbsp;</span>and more. Now you can apply to jointhem!</span></div><div><span><br></span></div><div><span>We're hiringwriters to help expand our collection of over 500 literature guides. Writerscan work from anywhere and compensation varies based on the length anddifficulty of the work. Pace and schedule are flexible, though our idealcandidates will have at least 10 hours per week to spend writing LitCharts.</span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Interested writers should email a resume and two writing samples to <a href='mailto:writing@litcharts.com' rel='nofollow'>writing@litcharts.com</a>. Writing samples should be academic papers that show an ability to analyze literature with insight and clarity. Each sample should be at least five pages long.</p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 8:02:51 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "jeFjXVMORbWlM2KZDSv7QQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/jobs/5897-english-content-writer-remote",
    "title": "SiteGround: English Content Writer - Remote",
    "content": "<div>  <div>    <h2>English Content Writer - Remote</h2>      <h4>Posted Dec  6</h4>    <h3>      <span>SiteGround</span><br>      <span>Headquarters: Sofia, Bulgaria </span><br>        <a href='https://www.siteground.com/careers' rel='nofollow'>https://www.siteground.com/careers</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span><b>About You</b></span></div><div><br></div><div><span>You love the written word, it’s an artform to you that allows you to explain how technical products solve people's problems. You’re the person who corrects others’ grammar and spelling, because grammar and spelling are really important (people who don’t think that need their head read). </span><span><b>You’re sensitive about the Oxford comma?</b></span></div><div>&nbsp;<br></div><div></div><div><span>You’ve also got some experience with websites, which could be as simple as setting up your own WordPress blog or as advanced as doing some PHP development in your own time.</span></div><div><br></div><div><span>You want to work remotely and you’re looking for the perfect job that doesn’t restrict you to one place. </span></div><div><br></div><div><span>If you’ve been nodding your head to all of the above, read on.</span></div><div><br></div><div><span><b>About Us</b></span></div><div><br></div><div><span>We’re a team of technical, service and marketing experts who believe in helping customers leverage technology to get better results for their business. Our main service is web hosting, and we’re really good at it. So good, in fact, we’re one of the only 3 web hosts worldwide recommended by WordPress.org.</span></div><div><br></div><div><span></span><span>SiteGround was founded in Bulgaria in 2004 and sell to clients all over the world. Today we have 5 offices between Bulgaria and Spain, five data centers on 3 continents and host over 800 0000 domains. Due to our continuous growth we are are looking for writers and content experts to build our content team.</span></div><div><br></div><div><span><b>The Role</b></span></div><div><br></div><div><span>Working for the brand manager, you’ll be helping craft content for different market segments, speaking their language and clearly communicating what they need to know to help them run their online business or hobby better.</span></div><div><br></div><div><span>You’ll be writing articles, producing ebooks, and refining social media posts on a daily basis.</span></div><div><br></div><div><span><b>Requirements</b></span><br></div><div></div><div><span><b><br></b></span></div><div><span>The most important thing is you share our values of Craftsmanship, Quality, Passion, and a sense of Fun. You’ll have to demonstrate each of these in your application.</span></div><div><br></div><div><span>You have 2+ years of experience writing content, and have the examples to prove it along with stats to show reach and engagement with the target audience.</span><br></div><div></div><div><span><br></span></div><div><span><b>Benefits</b></span></div><div><br></div><ul><li><span>Work anywhere in the world, as long as you have 4 hours overlap with Eastern Europe office hours (GMT+3);</span><br></li><li><span>Permanent contract;</span><br></li><li><span>Young and friendly team of professionals;</span><br></li><li><span>Informal and fun working culture;</span><br></li><li><span>Macbook workstation;</span><br></li><li><span>Annual Remote Team Building.</span></li></ul><div><span><br></span></div><div><span>If you are interested, please send to </span><span><b>jobs@siteground.com</b></span><span> </span><span>your </span><span><b>CV and a piece of content explaining why you are the ideal person. </b></span><span>We get lots of applications for these types of roles, so make sure you stand out.</span><br></div><div></div><div><span><br></span></div><div><b>Please note:</b> Due to the volume of applications only shortlisted candidates will be contacted for further steps.<br></div><div></div>  </div>  <div>    <h4>Apply for this position</h4>    <p> Send to <a href='mailto:jobs@siteground.com' rel='nofollow'>jobs@siteground.com</a> your CV and a piece of content explaining why you are the ideal person.</p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 4:16:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "CNeeA-dgRwykeMoufb8H7g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63493",
    "title": "English Content Writer - Remote",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div><span></span></div><div><span><b>About You</b></span></div><div><br></div><div><span>You love the written word, it’s an artform to you that allows you to explain how technical products solve people's problems. You’re the person who corrects others’ grammar and spelling, because grammar and spelling are really important (people who don’t think that need their head read). </span><span><b>You’re sensitive about the Oxford comma?</b></span></div><div>&nbsp;<br></div><div></div><div><span>You’ve also got some experience with websites, which could be as simple as setting up your own WordPress blog or as advanced as doing some PHP development in your own time.</span></div><div><br></div><div><span>You want to work remotely and you’re looking for the perfect job that doesn’t restrict you to one place. </span></div><div><br></div><div><span>If you’ve been nodding your head to all of the above, read on.</span></div><div><br></div><div><span><b>About Us</b></span></div><div><br></div><div><span>We’re a team of technical, service and marketing experts who believe in helping customers leverage technology to get better results for their business. Our main service is web hosting, and we’re really good at it. So good, in fact, we’re one of the only 3 web hosts worldwide recommended by WordPress.org.</span></div><div><br></div><div><span></span><span>SiteGround was founded in Bulgaria in 2004 and sell to clients all over the world. Today we have 5 offices between Bulgaria and Spain, five data centers on 3 continents and host over 800 0000 domains. Due to our continuous growth we are are looking for writers and content experts to build our content team.</span></div><div><br></div><div><span><b>The Role</b></span></div><div><br></div><div><span>Working for the brand manager, you’ll be helping craft content for different market segments, speaking their language and clearly communicating what they need to know to help them run their online business or hobby better.</span></div><div><br></div><div><span>You’ll be writing articles, producing ebooks, and refining social media posts on a daily basis.</span></div><div><br></div><div><span><b>Requirements</b></span><br></div><div></div><div><span><b><br></b></span></div><div><span>The most important thing is you share our values of Craftsmanship, Quality, Passion, and a sense of Fun. You’ll have to demonstrate each of these in your application.</span></div><div><br></div><div><span>You have 2+ years of experience writing content, and have the examples to prove it along with stats to show reach and engagement with the target audience.</span><br></div><div></div><div><span><br></span></div><div><span><b>Benefits</b></span></div><div><br></div><ul><li><span>Work anywhere in the world, as long as you have 4 hours overlap with Eastern Europe office hours (GMT+3);</span><br></li><li><span>Permanent contract;</span><br></li><li><span>Young and friendly team of professionals;</span><br></li><li><span>Informal and fun working culture;</span><br></li><li><span>Macbook workstation;</span><br></li><li><span>Annual Remote Team Building.</span></li></ul><div><span><br></span></div><div><span>If you are interested, please send to </span><span><b>jobs@siteground.com</b></span><span> </span><span>your </span><span><b>CV and a piece of content explaining why you are the ideal person. </b></span><span>We get lots of applications for these types of roles, so make sure you stand out.</span><br></div><div></div><div><span><br></span></div><div><b>Please note:</b> Due to the volume of applications only shortlisted candidates will be contacted for further steps.<br></div><div></div><p><strong>To apply:</strong> Send to <a href='mailto:jobs@siteground.com' rel='nofollow'>jobs@siteground.com</a> your CV and a piece of content explaining why you are the ideal person.</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 4:16:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "He-wJJanRwyHUfH1W7IA-Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63489",
    "title": "English Content Writer - Remote",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>About You<br><br>You love the written word, it’s an artform to you that allows you to explain how technical products solve people's problems. You’re the person who corrects others’ grammar and spelling, because grammar and spelling are really important (people who don’t think that need their head read). You’re sensitive about the Oxford comma?<br><br>You’ve also got some experience with websites, which could be as simple as setting up your own WordPress blog or as advanced as doing some PHP development in your own time.<br><br>You want to work remotely and you’re looking for the perfect job that doesn’t restrict you to one place. <br><br>If you’ve been nodding your head to all of the above, read on.<br><br>About Us<br><br>We’re a team of technical, service and marketing experts who believe in helping customers leverage technology to get better results for their business. Our main service is web hosting, and we’re really good at it. So good, in fact, we’re one of the only 3 web hosts worldwide recommended by WordPress.org.<br><br>SiteGround was founded in Bulgaria in 2004 and sell to clients all over the world. Today we have 5 offices between Bulgaria and Spain, five data centers on 3 continents and host over 800 0000 domains. Due to our continuous growth we are are looking for writers and content experts to build our content team.<br><br>The Role<br><br>Working for the brand manager, you’ll be helping craft content for different market segments, speaking their language and clearly communicating what they need to know to help them run their online business or hobby better.<br><br>You’ll be writing articles, producing ebooks, and refining social media posts on a daily basis.<br><br>Requirements<br><br>The most important thing is you share our values of Craftsmanship, Quality, Passion, and a sense of Fun. You’ll have to demonstrate each of these in your application.<br><br>You have 2+ years of experience writing content, and have the examples to prove it along with stats to show reach and engagement with the target audience.<br><br>Benefits<br><br>Work anywhere in the world, as long as you have 4 hours overlap with Eastern Europe office hours (GMT+3);<br>Permanent contract;<br>Young and friendly team of professionals;<br>Informal and fun working culture;<br>Macbook workstation;<br>Annual Remote Team Building.<br><br>If you are interested, please send to jobs@siteground.com your CV and a piece of content explaining why you are the ideal person. We get lots of applications for these types of roles, so make sure you stand out.<br><br>Please note: Due to the volume of applications only shortlisted candidates will be contacted for further steps.<br></p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 3:56:27 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "php"
    ]
  }
]
}
