{
 "items": [
  {
    "id": "4_sVpwTJSzqjUFErnXphaw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/9928-demandware-salesforce-commerce-cloud-solution-architect-remote",
    "title": "Demandware / Salesforce Commerce Cloud Solution Architect (Remote)",
    "content": "Demandware / Salesforce Commerce Cloud Solution Architect (Remote) - Jobmote<div><div><h2>Demandware / Salesforce Commerce Cloud Solution Architect (Remote)</h2><h5>ConSol Partners</h5></div></div><div><div><div><div></div></div><div><div><div><p>Demandware / Salesforce Commerce Cloud Solution Architect - (Remote anywhere USA) - up to $200K total package - rapidly growing eCommerce specific agency</p><p><strong>T</strong>** HE **** COMPANY**</p><p>One of the USA's fastest growing digital agencies specific to the eCommerce sector. They work with some of the world's biggest and most well-known retailers and brands. Their global projects allow an individual to work on large scale platforms and implementations alongside some of the leading SFCC professionals in the country.</p><p><strong>THE ROLE</strong></p><ul><li>The role will offer the opportunity to work on a SFCC platform on multiple client projects in a fast paced exciting environment</li><li>Working as a hands on technical expert working with development teams, client requirements and high level roadmaps</li><li>Joining a growing team at an early stage offering solid career progression</li><li>Working on multiple client projects and implementations</li></ul><p><strong>THE INDIVIDUAL</strong></p><ul><li>2+ years' experience in SFCC / Demandware platform</li><li>1-2 years' experience at an architect level (someone with a sold technical background on SFCC stepping up into an Architect role could also be a great fit)</li><li>Software development background (5+ years) ideally around SFCC / Java or related technologies</li><li>SFCC / Demandware implementation experience highly desirable</li><li>Strong experience and understanding of HTML/CSS, Javascript, JQuery, XML, Java</li><li>Ideally worked in an Agile environment</li></ul><p><strong>SALARY:</strong> up to$200K total package</p><p><strong>LOCATION:</strong> Remote (anywhere in the USA)</p><p><strong>CONSOL PARTNERS</strong></p><p>ConSol Partners provide permanent and contract staffing solutions to FTSE &amp; Fortune 500 companies, global brands and start-ups in the technology domains of Communications , Cloud and Digital . Founded in 2008, ConSol Partners have quickly established themselves as one of the world's leading technology recruitment brands.</p><p>With headquarters in the City of London and international offices in Los Angeles' &quot;Silicon Beach&quot; and central Boston. Our niche recruitment offering, coupled with an in-depth expert knowledge of our core markets, enables us to offer a true global recruitment solution and we have made placements in over 55 countries.</p><ul><li>provided by Dice Demandware / Salesforce Commerce Cloud Solution Architect (Remote) up to $200k package - top eCommerce specific agency </li></ul></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "May 9, 2018 11:22:51 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "wYdg0wdwQyezj44VNkE2Ww",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/9927-cybersecurity-senior-solutions-architect-remote",
    "title": "Cybersecurity senior Solutions Architect - Remote",
    "content": "Cybersecurity senior Solutions Architect - Remote - Jobmote<div><div><h2>Cybersecurity senior Solutions Architect - Remote</h2><h5>Slait Consulting</h5></div></div><div><div><div><div></div></div><div><div><div><p>SLAIT Consulting is currently seeking a Cybersecurity Senior Solutions Architect for our client in Dallas, TX and Richmond, VA.</p><p>This is a remote position with some travel required (10%).</p><p>SUMMARY:</p><p>The Cyber Security Solutions Architect is responsible for working with both BDS Business Development &amp; account/pursuit sales leadership to define security specific solution strategy.</p><p>JOB DUTIES /RESPONSIBILITIES:</p><ul><li><p>Responsible for leading the development of technical solutions in the area of cyber security services and offerings.</p></li><li><p>Ensure the soundness of an integrated security solution and proper BDS Delivery assurance signoff of any/all proposals.</p></li><li><p>Primary point contact responsible to ensure governance processes (Ex - Rainbow &amp; BDS Governance) are followed and managed pro-actively through the lifecycle of the pursuit/engagement.</p></li><li><p>Engages with the client, identifies cyber security needs/requirements, engages with SMEs and bid team to work on cyber security proposal and collect HL designs, and validates security solution to be proposed.</p></li><li><p>Works with engineers and SMEs in the development of the technical solution or offering, in translating the business needs into technical requirements, and is a key contributor in the value proposition.</p></li><li><p>Supports Bid &amp; Proposal solution development including technical design and development of complex proposals for Cyber Security solutions (managed services, System Integration and Consulting).</p></li><li><p>Run workshops and conduct security assessments to help the client understand their security and privacy issues, risks, exposure and vulnerabilities including architecting secure solutions to address specific security and privacy requirements.</p></li><li><p>Create high quality documentation such as Presentations, Risk Assessments, Reports and completing metrics and spreadsheets</p></li><li><p>Develop and deliver quality client presentations (both virtually and in person)</p></li><li><p>Evaluates and recommends future technologies and methodologies that will enhance our cyber security services and offerings.</p></li></ul><p>QUALIFICATIONS:</p><ul><li><p>Minimum 5 years of Solution Architect experience.</p></li><li><p>Full lifecycle project experience as Security Consultant including design and implementation.</p></li><li><p>Client facing experience at a range of levels.</p></li><li><p>Several years of experience in IT security, compliance, and risk management including privacy and controls.</p></li><li><p>Implementation experience with enterprise security packages identity management and federation systems.</p></li><li><p>Familiarity with industry compliance and security standards including PCI DSS, ISO 27001, HIPAA, and NIST experience advising customers on architectures meeting industry standards such as SAS70, SOC1, and FISMA.</p></li><li><p>Preferred Certifications: QSA, CISSP, CISA, CISM, CRISC</p></li></ul><p>Why SLAIT?</p><p>We have been growing since 1990 with offices in Virginia and Raleigh, NC. For over twenty-eight years, we have delivered customized, creative IT solutions for customers in the commercial, and state and local government sectors.</p><ul><li>Staff Augmentation * Managed Services * Security Solutions * IT Consulting</li></ul><p>Thank you for your consideration, please submit your resume today! Visit us at</p><ul><li>* Must be able to work for any employer in the United States. No Visa sponsorship.* * </li></ul><p>SLAIT Consulting is an Equal Opportunity Employer</p><ul><li>provided by Dice IT security, risk management, compliance </li></ul></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "May 9, 2018 11:22:50 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "w34kDpgyQKyziFkT94h2Yg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/8544-microsoft-data-analytics-solution-architect-remote",
    "title": "Microsoft Data/Analytics Solution Architect (Remote)",
    "content": "Microsoft Data/Analytics Solution Architect (Remote) - Jobmote<div><div><h2>Microsoft Data/Analytics Solution Architect (Remote)</h2><h5>BlueGranite</h5></div></div><div><div><div><div></div></div><div><div><div><p>BlueGranite's Solution Architect position is a senior role for individuals with at least twelve years of professional, hands-on experience designing and building business intelligence or data warehouse solutions on the Microsoft platform.</p><p>BlueGranite's Solution Architects are expert industry leaders with SQL Server, Power BI, and Azure platforms. They are part of BlueGranite's premier consulting team, leading small-team engagements to design, implement, and support analytics solutions. They demonstrate strong technical leadership skills across components of SQL Server, Power BI and Azure platforms and are able to mentor others with these technologies. Solution Architects may support pre-sales client discussions, project scoping and estimating tasks, and writing statements of work together with our account leadership team.</p><p>This full-time, work-from-home consultant position is for individuals who enjoy leading project teams while continuing to work hands-on, building data and analytics solutions using the Microsoft platform.</p><p>At a minimum, we're looking for:</p><ul><li>At least twelve years of hands-on, professional experience with Microsoft data/analytics platforms</li><li>Knowledge of data warehouse concepts and dimensional modeling techniques</li><li>Experience developing reports or dashboards</li><li>Strong aptitude with T-SQL statements and DAX functions</li><li>Self-starter, quick learner, with a positive, collaborative, and team-based attitude</li><li>Excellent communication skills, with interests in presenting and blogging</li><li>Degree in information technology, computer science, business, or engineering</li><li>Ability to travel across the U.S., with an average of 25% travel to client locations per year</li><li>Ability to work from home when not on-site at client locations</li><li>Authorization to work in the U.S., without the requirement for an employment visa<br></li></ul><p>In addition, these score you extra points:</p><ul><li>Microsoft or other industry certifications for BI, DW, or analytics</li><li>Microsoft Azure, Power BI, or big data knowledge/experience</li><li>Interest in advanced analytics, machine learning, and languages including R and Python</li><li>Demonstration of thought leadership, community volunteering, recognition or awards</li><li>Master's degree in technology or business<br></li></ul><p>Your primary responsibilities would include:</p><ul><li>Lead discovery, planning, and architecture design of data and analytics solutions using Microsoft SQL, Power BI, and Azure platforms</li><li>Lead the development of informative and interactive data visualizations/models with SSRS or Power BI</li><li>Work hands-on with data and analytics components of SQL Server (such as SSIS, SSAS, SSRS, MDS/DQS, or ML Services)<br></li><li>Leverage Azure Data Services and Power BI to deliver cloud solutions</li><li>Write relational, tabular and multidimensional database queries, flows and movements</li><li>Obtain and maintain technical certifications in these core areas of expertise</li><li>Add value to each project through effective leadership and team collaboration</li></ul><p>BlueGranite is the driving force of data innovation for our customers. We are trusted advisors who use our aptitude and experience to deliver value to our clients. We invest in our team to become better at who we are and what we do. Our core strategy is to lead with offers for data, insights, and analytics that deliver business value on the Microsoft platform.</p><p>This position is predominantly remote, work from home, with an average of 25% overnight travel per year. BlueGranite employees are located in Michigan, Illinois, Indiana, Ohio, Colorado, Texas, Minnesota, Georgia, South Carolina, North Carolina, New York, New Hampshire, Florida, or Massachusetts only.</p><p>The above statements are intended to describe the general nature and level of work being performed by individuals assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as needed.</p><p></p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "May 1, 2018 10:22:51 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "iQwq876FSQ2U4k2F0M_p2g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/174404/cloud-solutions-architect-dito?a=Wumnr9e23NC",
    "title": "Cloud Solutions Architect at Dito (Mountain View, CA) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Information Technology, Technology Consulting</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Dito is looking for a Cloud Solutions Architect to join our team! &nbsp; The position is remote so you will get to enjoy the luxuries and flexibility of working from home.&nbsp; As a Cloud Solutions Architect, the key responsibility will be to drive enterprise infrastructure, applications and analytics to public clouds while supporting the Sales team to develop and earn new business with prospects and existing customers.&nbsp; The position may be remote but our teams work together closely with you playing a crucial role in addressing “buying” questions that will involve the design and implementations of public and hybrid cloud application architecture, as well as cloud-hosted business intelligence. &nbsp; You will get to leverage your creative juices and technical abilities around infrastructure, system and application design using web, mobile, cloud, and open source technologies. Experience across various enterprise solutions/ technology stacks (IaaS/PaaS/SaaS) and ability to provide guidance to diverse stakeholders and external vendors will be the foundation of yours and our success! &nbsp; A few details about your day to day objectives;&nbsp;</p><ul><li>Lead change across large platforms / functional areas / organizations to public clouds.</li><li>Conduct architectural and engineering review of proposed IT investments/solutions to determine the strategic alignment and technical soundness.</li><li>Demonstrate thought leadership in cloud computing across multiple channels and become a trusted advisor to decision makers.</li><li>Identify, develop and document repeatable design and implementation methodology&nbsp;</li><li>Partner with project teams, vendors, support organizations, functional architects, systems specialists and other technical resources in this hands-on role driving cloud migration/adoption from inception to production implementation.</li><li>Collaborate with the product, data, and infrastructure architects and be responsible for the defining-designing-delivering the technical architectures, patterns, technical quality, risks, fitness for purpose and operability of technical architecture solutions.</li><li>Provide technical recommendations to senior executives to assist the decisions on proposed IT investments/solutions and assume responsibility for technical presentations demonstrating a good understanding of application, data, infrastructure, architecture expertise and application systems design.&nbsp;</li><li>Lead application workload and data migration, design and build interfaces between applications and other providers, as well as ownership of overall migration effort, workloads, backup and DR services &nbsp;</li><li>Able to analyze, design, and implement cloud migration strategies without impacting business continuity&nbsp;</li><li>Project scoping skills; methods, knowledge and experience of application processes, development, implementation and deployment to achieve project objectives.&nbsp;</li></ul><p>Skills: Languages: Python, Go, Ruby, Java, PHP, HTML, CSS, JavaScript, SQL<br><br> Frameworks: LAMP, J2EE, .NET, Ruby on Rails, Backbone JS, Angular JS, React, Wordpress<br><br> Cloud and Automation: Google Cloud (App Engine, Container Engine, Compute Engine, Kubernetes, Cloud Functions, BigQuery, Dataflow, Dataproc, Datalab, Dataprep, Pub/Sub, Data Studio, TensorFlow, Cloud Deployment Manager, Google Cloud Storage, Google Cloud SQL, Google Cloud Bigtable, and Google Cloud Datastore), Chef, Puppet, Docker, Kubernetes, HAProxy, , Amazon Web Services (EC2, S3, RDS, CloudFormation, IAM, Route 53, VPC, SNS, SES, SQS) Google Cloud Storage, Google Cloud SQL, Google Cloud Bigtable, and Google Cloud Datastore Big Data: Google BigQuery, Cloudera, Hive, AWS Redshift&nbsp; <br>CI / CD / Build: Jenkins, Rundeck, CodeShip.io, Nexus<br><br>Monitoring and Logging: StackDriver, Syslog, Splunk, Nagios, New Relic, Cloudwatch<br><br>Version Control: Git, Subversion, SVN<br><br>OS: RedHat, CentOS, Ubuntu, Windows 2012 Servers<br><br>Application Servers: Tomcat, Nginx, Apache</p>                    </div>                            <h2>                About Dito            </h2>            <div><p>Since 2008 we've been helping organizations change the way they do business by leveraging cloud technologies, and more specifically Google Cloud enterprise solutions (Google Cloud Platform, G Suite Business, Chrome Enterprise, and Google Maps).</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote workforce                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 24, 2018 10:44:01 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/java",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "java",
      "php"
    ]
  },
  {
    "id": "GBoPLaBuRJ-b-UbYKYMkGA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/174120/solution-architect-us-residents-only-remote-staywell?a=WosfW6lTAiY",
    "title": "Solution Architect (U.S. residents only - Remote position) at StayWell  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Digital Health, Health &amp; Fitness</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>501-1k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We are seeking a Solution Architect to play a critical role across our product lines as well as being a thought leader within the technology organization. This role includes definition, architecture and implementation of foundational solutions in support of StayWell product lines. You will be challenged to turn solutions around quickly but thoughtfully, balancing speed to delivery with security, quality, longevity and scalability.<br><br>The Solution Architect will also be integral in helping to cultivate an environment of innovation through architectural guidance, technology direction and evangelism of best practices to ensure the team is equipped to deliver industry leading solutions for our customers and patients.&nbsp; Working within a diverse technology stack the Solution Architect will be instrumental in the modernization and optimization of highly impactful products which help people improve their health and wellness.<br><br><strong>Essential Duties and Responsibilities include the following (other duties may be assigned):</strong></p><ul><li>Design solutions that add value and efficiency across systems. Evaluate and undertake impact analyses on major design options and assess associated risks.</li><li>Define, maintain, and manage architecture models, frameworks and artifacts (e.g. current and future state application architecture diagrams, data models, etc.).</li><li>Collaborate closely with management in assessing business strategy and priorities, and tuning solutions to business goals.</li><li>Collaborate closely with technology system and team leads in determining optimal solutions to product goals, and aligning system/architecture roadmaps to product plans.</li><li>Support development of cross-functional business processes; identify alternative solutions, assess feasibility, and recommend new approaches via technology enablement. Evaluate the system factors which must be addressed in change management.</li><li>Develop and manage expectations for communication channels and/or stakeholder groups. Initiate communications between key contributors and stakeholders, acting as a single point of contact for cross-functional solution architecture. Facilitate open communication and discussion between stakeholders.</li><li>Stay informed on technology trends and product roadmaps to make strategic solution architecture recommendations.</li></ul><p><br><strong>Qualified candidates will have experience in the following:</strong></p><ul><li>Direct experience with product development in an enterprise setting, leveraging modern technology stacks and cloud-based systems such as AWS.</li><ul><li>Significant&nbsp;experience with Node.js highly preferred</li><li>Experience React and React Native preferred</li></ul><li>Strong knowledge of various integration approaches such as microservices, messaging, queuing, API patterns, etc.</li><li>Experience leading / managing an enterprise development work stream involving several systems, teams and user profiles.</li><li>Strong understanding of agile methodologies (Scaled Agile Framework preferred)</li><li>Ability to interact at all levels of the client organization</li><li>Strong problem solving and troubleshooting skills with the ability to exercise mature judgment</li></ul><p><br><strong>Education and/or Experience</strong>:<br>Bachelor's degree (B. S.) in Computer related subject area or related business field and eight (8) or more year’s experience in Information Technology and solution delivery, or equivalent combination of education and experience in similar fields is required. Experience working with SAAS based solution delivery organization (preferred).</p>                    </div>                            <h2>                About StayWell            </h2>            <div><p>At StayWell, we believe in the transformational power of health. Through the science of behavior change, education and inspiration, we have taken the guess work out of healthy living. And we do this by empowering people to take active roles in their own health – whether they’re patients, employees, or individuals just trying to stay well. We help inspire people to become healthier, happier employees at work. We help them have a more balanced and rewarding life at home. And we provide information that helps make patients smarter. In fact, everything we do maximizes the likelihood of the best possible outcomes. Which has a positive impact on families, businesses and communities. Because there is no mission more important than improving human health.</p><p>StayWell has a 40-year history of unparalleled expertise in improving health – whether at the point of care, in the workplace, or at home. But we know that every day the way people consume information is changing. We are continually working to integrate our proven, evidence-based solutions into forward-thinking, tech-driven delivery mechanisms, ensuring that we provide people with the right information, at the right time, and in the right way to maximize our impact on health outcomes. Our organization places great weight on technical innovation, and we’re looking for awesome tech talent to catalyze our momentum.</p><p>Our team is nearly 100% remote. We create several different product lines related to our health and wellness business and patient education content. Our history, our access to member and patient data, and the relationships we have established put us in a very unique position of truly being able to make a difference as it relates to improving our healthcare system.&nbsp;&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive Salary                            </div>                            <div>                                 Fitness Center and Fitness Reimbursement                            </div>                            <div>                                 Medical plans, dental and vision coverage                            </div>                            <div>                                 Work from home options                            </div>                            <div>                                 Health Savings Account, Flex Savings Account                            </div>                            <div>                                 401K Retirement Savings Plan                            </div>                            <div>                                 Tuition assistance, paid time for volunteerism                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 24, 2018 10:44:01 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "4pIorMe6TiqQaUhA1pqKUw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/173042/cloud-solutions-developer-go-dito?a=W22xKm51A7S",
    "title": "Cloud Solutions Developer (Go) at Dito  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Information Technology, Technology Consulting</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Who are We?</strong></p><p>Dito is a closely-knit team comprised of brilliant minds with a singular focus; to enable companies of all sizes to make the most of their technology by leveraging Google Cloud technology. &nbsp;We are a distributed team and have the distinguished honor of being one of very few service providers considered a Google Cloud Premier Partner.</p><p><em>***This position is remote however you are required to be located in Standard Eastern Timezone***</em></p><p><strong>What Will You Do?</strong></p><p>From Gaming to Healthcare to the Finance industry, helping our customers architect and developing solutions and applications will be your primary focus. &nbsp;Understanding and potentially being able to use different tools in the appropriate situation, such as <strong>Go, jQuery, Python,</strong> AngularJS, React, Backbone, Mustache, and Node.js will be important - as is the ability to solve problems with a variety of tools. You have built applications on Google App Engine and/or Container Engine or other cloud platform, and are comfortable modeling data with Google’s Datastore.</p><p><strong>Who are You?</strong></p><p>You spend hours learning web/mobile development frameworks, and are never satisfied with a solution being ‘good enough’. &nbsp;Keeping up with the most cutting edge technology the world has to offer - you know that the Google Cloud Platform is poised to be the most advanced system in the world.</p><p>You’ve already built some apps that integrate with their REST APIs, and consider yourself skilled in Apps Script, App Engine, Compute Engine, Container Engine, DataStore, CloudSQL, Cloud Storage, Big Query and are eager to expand your knowledge of the Maps APIs and Machine Learning. &nbsp;You’ve got a few go to frameworks like Angular.js and jQuery, and have experience developing applications in Python, GO, PHP, Java, Angular.js and other JavaScript libraries.</p><p><strong>The Technical Stuff</strong></p><p><strong>Responsibilities:</strong></p><ul><li>Develop professional, highly scalable and interactive web and mobile applications as custom solutions for clients</li><li>Full lifecycle application development</li><li>Designing, coding and debugging applications in various software languages.</li><li>Software analysis, code analysis, requirements analysis, software review, identification of code metrics, system risk analysis, software reliability analysis using the Agile Scrum development process</li><li>Performance unit-based software testing and quality assurance while building out the application</li><li>Performance tuning, improvement, balancing, usability, automation</li><li>Support, maintain and document software functionality</li><li>Integrate software with existing systems</li><li>Evaluate and identify new technologies for implementation</li><li>Work closely with Project Manager on client discovery, project estimating and project progression, testing, deployment, and iterations</li><li>Maintain standards compliance</li></ul><p><strong>Preferred Qualifications:</strong></p><ul><li>BS in Computer Science or equivalent experience</li><li>Proficiency in Go, Javascript (JQuery, AngularJS, React), HTML5, CSS, REST and JSON</li><li>Experience with the following: Python, PHP, Java, Javascript, Go, Django, Flask, XML, SOAP</li><li>Database design (Multi-tenant App Engine and/or Container engine design experience preferred)</li><li>Experience with the following is preferred: &nbsp;Google App Engine (GAE), Google Maps Engine, Google Web Toolkit (GWT), MySQL, NoSQL (MongoDB), CartoDB</li><li>Work in an Agile Scrum development methodology</li><li>Experience with Atlassian Jira a plus</li><li>Multi-threaded web/mobile application programming</li><li>Great Analytical &amp; Troubleshooting Skills</li><li>Great Communication &amp; Customer Service Skills</li><li>Solutions Oriented Critical Thinking Skills</li></ul>                    </div>                            <h2>                About Dito            </h2>            <div><p>Dito is a full-service cloud advisory and services firm providing sales, development, change management, and ongoing customer success services to organizations interested in moving to &amp; operating in the cloud.</p><p>Since 2008 we've been helping organizations change the way they do business by leveraging cloud technologies, and more specifically to Google Cloud enterprise solutions (Google Cloud Platform, G Suite Business, Chrome Enterprise, and Google Maps) and other complimentary cloud service solutions.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote workforce                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 15, 2018 2:07:51 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "Zw1NCh81RZevDJGfWl5zEw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/172410/php-plus-laravel-engineer-at-high-growth-fintech-lenox-park-solutions-llc?a=VOTNmFSPHQk",
    "title": "PHP + Laravel Engineer at High-Growth FinTech Company at Lenox Park Solutions LLC (Austin, TX) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Financial Technology, Investment Banking, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Lenox Park Solutions is seeking a PHP Engineer with 2-5 years of commercial experience. As a PHP Engineer, you would work closely with our Development team to code and test functionality which will directly increase the scalability of Roundtables, our flagship product which will disrupt and revitalize the Asset Management industry. The junior developer will work directly with an experienced Senior PHP Engineer in helping to execute platform development, and will have the opportunity to grow within the organization as LPS expands it technical team. At LPS, we focus on accountability, proactive-ness, and creative thinking. Staff members retain the option to work remotely, as we are a goals-oriented team.</p><ul><li><strong>Requirements</strong>:</li><ul><li>Professional experience on PHP, specifically with Laravel, VueJS/ReactJS, and Git, and preferably with Laravel Queues, Websockets, Amazon Web Services, and Linux (Ubuntu);</li><li>Outstanding communication skills, both verbal and written experience with technical and non-technical audiences;</li><li>Ability to assess ongoing processes critically and recommend creative, thoughtful operational improvements;</li></ul><li><strong>Preferred Skills</strong>:</li><ul><li>Understanding of Asset Management industry;</li><li>Business-oriented, highly analytical mind with a knack for accounting for both complex business and technical considerations simultaneously</li></ul></ul>                    </div>                            <h2>                About Lenox Park Solutions LLC            </h2>            <div><p>Lenox Park Solutions LLC (LPS) is a FinTech firm focused on Asset Managers and Financial Institutions. Our mission is to enable the democratization of access to Institutional capital by using technology to match best-in-class Asset Allocators with the most talented Asset Managers. Our solutions will challenge entrenched traditional notions of who should be able to manage money, upending the staid model where pedigree and privilege drive capital allocation. Leveraging deep experience in investment banking and asset management, LPS licenses CRM solutions that emphasize networking and collaboration to manage Fundraising, Deal Pipeline, Business Development and Operations. LPS maintains offices in New York, NY and Austin, TX.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote Office                            </div>                            <div>                                 Experienced Investment Professionals                            </div>                            <div>                                 Austin and New York Offices                            </div>                            <div>                                 Lean, Entrepreneurial Team                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 15, 2018 2:07:51 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "uNwPYTmARFm84rj_ZaWzXg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/4977-servicenow-itsm-solution-architect-remote-or-local",
    "title": "ServiceNow ITSM Solution Architect (Remote or Local)",
    "content": "ServiceNow ITSM Solution Architect (Remote or Local) - Jobmote<div><div><h2>ServiceNow ITSM Solution Architect (Remote or Local)</h2><h5>Evanios</h5></div></div><div><div><div><div></div></div><div><div><div><p>Job Description</p><ul><li>This position may be located at our Orlando, FL headquarters, or remote. Resume and cover letter are required.</li></ul><p>Looking to ramp up your career with a fast-growing company? Check out Evanios!</p><p>We build software that utilizes preconfigured logic, machine learning algorithms, and ITSM contextual data to automatically reduce alert noise, prioritize events, identify root cause and predict outages before they occur. Used primarily by Fortune 1000 customers, our flagship SaaS application enhances ServiceNow™, a dominant platform for enterprise companies.</p><p>Since we focus on producing exceptional results, our clients often ask us to work in adjacent spaces (e.g. ServiceNow CMDB, Orchestration, Incident, Problem, Change Management, etc.). Based on growing demand for these services, we're looking for the right people to join our team.</p><p><strong>Your Role</strong></p><p>As a ServiceNow ITSM Solution Architect, you will be highly visible to our customers and prospects. You will collaborate with sales and professional services team members, and you will be responsible for all aspects of project and solution delivery including scoping, project planning, ensuring client satisfaction, workshop hosting, and achievement of required business outcomes and deliverables.</p><p>You will also share your knowledge and insights by mentoring other ITSM consultants while informing and educating our audience on the proper ITSM best practices. Besides technical leadership, you will also be performing implementation work in addition to other activities. You should be able to mockup diagram concepts, create presentations, write and speak effectively.</p><p>This role requires a high level of attention to detail. To meet our initial qualification criteria you are required to provide a cover letter that points out how you meet all of the required skills and experience listed below. Use this as an opportunity to show us how well you will fit with our culture, and that you have the skills necessary to thrive as a member of our team.</p><p><strong>Additionally, you will…</strong></p><ul><li></li></ul><p>Be a go-to authority for internal team members. We're a highly cross-functional organization, so you'll be working closely with project management, junior and senior consultants, and management.</p><ul><li></li></ul><p>Establish customer requirements and drive continuous improvement of user experience, implementation methodology, and service offerings based on client experiences while guiding team members and performing implementation tasks when needed.</p><ul><li></li></ul><p>Define future processes through workshop delivery and data collection.</p><ul><li></li></ul><p>Provide details about dependencies, key integration points, and building of the roadmap for the ITSM solution while extending the solution across multiple Lines of Business and various groups within the client organization.</p><ul><li></li></ul><p>Provide a clear business vision, and best practice recommendations around implementation choices, system design, integrations, and system enhancements.</p><ul><li></li></ul><p>Align Business and Technology Strategies and own strategic responsibility for client ITSM and Service Automation systems</p><ul><li></li></ul><p>Assist Sales and Services with scoping and estimating customer requirements and associated work effort to achieve customers technical and business goals.</p><p><strong>Required Skills &amp; Experience:</strong></p><ul><li></li></ul><p>Minimum 10 years of ITSM experience with tools such as ServiceNow, BMC Remedy, HP ServiceManager, Cherwell.</p><ul><li></li></ul><p>Minimum 5 years of proven experience as an ITSM Solution Architect and Team Lead for enterprise customers.</p><ul><li></li></ul><p>ServiceNow Implementer Certification, or proven experience.</p><ul><li></li></ul><p>ServiceNow Administrator and/or Developer Certifications, or proven experience.</p><ul><li></li></ul><p>Proven experience scoping, estimating, workshop delivery, and implementing all of the following SN Modules: Incident Management, Problem Management, Change Management, Knowledge Management, Request Management, and Configuration Management (CMDB).</p><p><strong>Additional Skills &amp; Experience:</strong></p><ul><li></li></ul><p>Knowledgeable of the following SN Modules: Asset Management, Service Portal, Service Mapping, Cloud Management, and Discovery.</p><ul><li></li></ul><p>Administrative experience building interfaces and integrations from ITSM tools to other applications and data sources. API Integration Tools and REST API.</p><ul><li></li></ul><p>Development Methodologies: Knowledge of Waterfall, RUP, and Agile development. Experience guiding customers through development methodologies and best practice. Experience with ServiceNow Agile/SDLC or similar tools is a plus.</p><ul><li></li></ul><p>ITIL Foundations V3 Certification; ITIL Intermediate or higher certification a plus</p><ul><li></li></ul><p>Exceptional documentation skills. Ability to build professional customer facing documentation such as Requirements and Design Documents as well as PowerPoint slide decks for technology and process workshops.</p><ul><li></li></ul><p>Exceptional presentation skills. Proven experience leading customer facing meetings to a wide-ranging audience, i.e. Technical to Executive Level</p><p>Evanios offers a competitive salary, generous vacation, medical, dental, and vision benefits, 401k, paid life insurance, career growth opportunity, and a great work environment. This role may include occasional travel.</p><p>Please note: Your resume and cover letter are both required for consideration. Applications without either component will be disregarded.</p><p>Company DescriptionLed by a team of seasoned veterans in the IT Operations Management space, we have infused our direct experience, respected methodology standards, and advanced machine learning into a best-in-class product that drastically reduces unnecessary alerts and low-level manual decision making from complex IT environments. Our innovative software solutions are trusted by some of the most prestigious Fortune 500 companies. </p><p>Evanios sets a new standard for best in class, creates innovative solutions that provide quick time to value and pushes the industry to evolve. We deliver the impossible while maintaining an environment where our team members thrive professionally and personally.</p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "Apr 14, 2018 10:21:44 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "m59n58qXSCOfod6Rw9_kYA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/4963-azure-technical-specialist-remote-virtual-role",
    "title": "Azure Technical Specialist - Remote/Virtual Role",
    "content": "Azure Technical Specialist - Remote/Virtual Role - Jobmote<div><div><h2>Azure Technical Specialist - Remote/Virtual Role</h2><h5>Global IT Family</h5></div></div><div><div><div><div></div></div><div><div><div><p><strong>Job Title: Azure Technical Specialist</strong></p><p><strong>Location: Virtual Role - Can be located anywhere in the US.</strong></p><p><strong>Duration: 12 months contract</strong></p><p><strong>Job Details:</strong></p><p>This resource is remote so they can sit anywhere in the US.</p><p>Candidates must be able to engage with the customer, understand what they are running and help them transition to the Cloud, understand what the cost/impact is going to be, provide industry best practices and knowledge.</p><p><strong>Required:</strong></p><p>Strong technical experience is a must - looking for the candidate to fit more into a solution role because they have to engage with the customer. Manager looking to make this hire very quickly!!</p><p><strong>Responsibilities:</strong></p><ul><li>The Azure Technical Specialist is a technical customer facing role that will be responsible for the end to end customer data platform design, architecture, and deployment.</li><li>The ideal candidate will have experience in a customer facing roles and have led successful technical and economic value discussions with senior customer executives, driving decisions and implementation.</li><li>Supporting customers across all lines of business, the ATS will balance both sales and delivery priorities.</li><li>The ATS will help customers establish objectives and requirements for a successful cloud migration.</li><li>The ATS will also be responsible for helping develop and deliver a level of technical support to existing SLMS cloud customers.<ul><li>provided by Dice Azure, Cloud support, Cloud design, cloud Architecture, Cloud technical support </li></ul></li></ul></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "Apr 14, 2018 10:21:36 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "ShD-cxQ9QZev4NUX7UxtdA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/67972/solutions-architect-at-winnow-solutions/",
    "title": "Solutions Architect",
    "content": "DESCRIPTION<br />Winnow are now hiring to expand their software development team. We're a mission led, product-focused high-growth tech scale-up that's going global and breaking new ground in tech. We get a kick out of helping our blue-chip customers and the world prevent food waste through great products and services. Our team have the kind of culture, alignment, energy, and passion you read articles about. If that sounds like something you want to be a part of, today is the day to get in touch.<br /><br />Us:<br /><br />Passionate about technology and innovation<br />Agile throughout the organisation<br />Moving fast to test-driven development and continuous delivery<br />Product stack spans from mobile apps to Linux-powered hardware in the field and everything powered by our software written in various computer languages (Java, Python, Node.js and others) using a number AWS services and Pentaho/Kettle for analytics/reporting<br /><br /><br />REQUIREMENTS<br />You:<br /><br />Have a solid understanding of programming (not just using existing frameworks and plugins but understanding what they do, how they work and if needed build/extend them)<br />Can program using at least two programming languages and eager to learn more if needed to complete a project that requires a different specialisation and help your colleagues<br />Are passionate about TDD, thinking how to test and are not trying to ‘escape’ writing Unit or Integration tests. Each developer in Winnow is responsible and accountable for their delivered work.<br />Able to estimate effort to deliver initiatives and do your best to deliver on your commitment<br />Keen on continuous improvement, design, implement, release, learn and improve on every iteration<br />Want to prototype solutions using new cutting-edge technologies and present them to the team or to the world<br />Ready to engage in our mission to reduce food waste<br />Comfortable in a fast-moving small company environment<br />A good communicator with both technical and non-technical people and can work with remote team members<br /><br />BENEFITS<br />Competitive base salary<br />Life insurance (3 times base salary)<br />Employee assistance programme<br />Company part-funded health insurance<br />Matching pension scheme<br />Cycle to work scheme<br />25 days of paid vacation time in addition to national holidays<br />You will love what you do – waking up every day solving one of the biggest social problems of our generation<br />Committed team members with broad experience who share a common passion to build a world class business<br />Great office space in central London with free happy hours and a great working environment",
    "urlFetchPending": false,
    "published": "Apr 13, 2018 12:29:30 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "YmDNDjk2RoG7PL7Tmxywuw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/67932/customer-solution-engineer-at-safetyculture/",
    "title": "Customer Solution Engineer",
    "content": "The Role<br /><br />You’re the technical glue that enable customers to automate their workflow or to help them diagnose and fix issues. Problem solving is a hobby you can’t live without and you love a challenging bug hunt!<br /><br />With the engineering team you will develop and apply internal software tools to automate tasks within the SafetyCulture team. Our customers can always rely on you to demonstrate integrations and provide technical support during and after deployment.<br /><br />Simple data types are no surprise to you and you’re not phased by data formats, especially JSON, CSV, XML.<br /><br />The Soul<br /><br />You live and breathe solutions but you don’t keep your best ideas to yourself. You’re an effective communicator and team worker and contribute your insights from your interaction with customers to help refine technical requirements.<br /><br />You are passionate about tech and you’re a product advocate who is passionate about putting safety and quality in the hands of every worker. The customer is always top of mind and you will be influential in creating user-facing setup and usage guides.<br /><br />Languages? That would be great! Some software development such as Javascript and/or Python preferred but not limited to would be amazing.<br /><br />The Responsibilities<br /><br />- Take customer requirements via identified channels<br />- Work closely with our customer success team to assist customers in getting setup with existing integration solutions<br />- Assessing/scoping of needed API and Integration improvements/solutions<br />- Work with core API development team to prioritise any needed API improvements<br />- Build upon API improvements to develop new integration solutions for customer needs or to improve existing integration solutions<br /><br />Desired Skills<br /><br />- JIRA/Confluence or similar experience<br />- Using 'DevTools' in a web browser to diagnose issues<br />- Data syncing concepts (e.g. push vs pull model)<br />- General understanding of web services and REST API/CRUD fundamentals<br />- REST API client development<br />- Technical writing<br />- Experience using and/or integrating with any of the following<br />- Sharepoint, SalesForce, PowerBI, Tableau, Google Sheets, Zapier, Microsoft Flow<br /><br />Why SafetyCulture<br /><br />- We’re operating at a scale few other companies are, and you’ll be doing challenging work that impacts millions every day and helps to move the world forward.<br />- We have money in the bank and plentiful investors knocking on our doors<br />- We have HUGE ambitions. We aren’t scared to aim for tens of millions of users by 2025<br />- We operate within a largely untapped market with endless possibilities and we are a part of a new, exciting wave of SaaS companies that focus on frontline workers<br />- We know a thing or two about making our employees happy, and we go the extra mile connecting our people to our mission. The experience trips are an example of how we're pushing the boundaries of company culture and employee engagement<br /><br />Location<br /><br />There is always something to explore in Manchester! Between the booming restaurant scene, interesting museums and galleries, and theatre and arts, Manchester is thriving. Not to mention, they can pour a good pint. Our office is located within a new collaborative workspace with plenty of tech startups in the mix.",
    "urlFetchPending": false,
    "published": "Apr 12, 2018 11:44:23 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/python",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go",
      "python"
    ]
  },
  {
    "id": "y_EDPrF3RyaFl5Y9f0w9gw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16743161",
    "title": "Cake Solutions - A BAMTECH Media Company | Manchester (Visa, Onsite)| London (Visa, onsite) | New York (Remote avail)",
    "content": "<div>                  <span>Cake Solutions - A BAMTECH Media Company | Manchester (Visa, Onsite)| London (Visa, onsite) | New York (Remote avail)<p>Senior Scala Developers | (Senior) DevOps | SRE Lead</p><p>Until last year (2017) Cake had operated as a Scala Consultancy, helping businesses globally build Reactive, Distributed and Resilient Systems using our hybrid Agile method of small cross functional teams. We're big advocates of the tech community, and have been blogging, hosting meetups and presenting/sponsoring conferences for 5 years.</p><p>We were acquired last year by BAMTECH Media, and are now building the next-gen DTC media streaming platforms for partners like ESPN+, Disney, Riot Games, and EuroSport, as well as migrating existing partners (MLB, NHL, MLS, WWE, HBO) to our new multi-tenant platform.</p><p>Most of our current roles are at the Senior level (Scala, DevOps, SRE) so we would like engineers who have experience with functional programming (futures, category theory), DevOps who have experience with micro-service architecture (Docker, Jenkins, AWS). <a href='https://www.cakesolutions.net/careers' rel='nofollow'>https://www.cakesolutions.net/careers</a></p><p>Any questions to me samf@cakesolutions.net<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 1:00:06 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "gmOzFnLARL65jytaqkib5A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16739231",
    "title": "Opus One Solutions | Toronto, ON or US (Remote Only) | Full-Time | https://www.opusonesolutions.com/careers/ At Opus One Solutions, we help power utilities ...",
    "content": "<div>                  <span>Opus One Solutions | Toronto, ON or US (Remote Only) | Full-Time | <a href='https://www.opusonesolutions.com/careers/' rel='nofollow'>https://www.opusonesolutions.com/careers/</a><p>At Opus One Solutions, we help power utilities modernize and gain visibility on the power grid through our suite of products, GridOS. If you're interested in technology with a purpose and are passionate about sustainability and green energy, check us out!</p><p>We're hiring across our R&amp;D at all levels - our open jobs are posted here:</p><p><a href='https://www.opusonesolutions.com/careers/' rel='nofollow'>https://www.opusonesolutions.com/careers/</a></p><p>Reach out to me at - <a href='https://www.linkedin.com/in/jarettmacleod/' rel='nofollow'>https://www.linkedin.com/in/jarettmacleod/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 12:02:06 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "xZboLJaiRkKwJsIuZlSh_w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/169521/solutions-architect-nlp-and-machine-learning-critical-mix?a=UQPpTuM9Aly",
    "title": "Solutions Architect - NLP and Machine Learning at Critical Mix (Perrysburg, OH) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Manager</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Integrated Marketing Solutions</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>&nbsp;&nbsp; Critical Mix is looking for a&nbsp;<strong>Solutions Architect</strong>&nbsp;to work with our teams across the United States and is passionate on simplifying the complex with digital innovation.&nbsp; Success in this position will require some unique knowledge in the areas of natural language processing services such as Watson and Lex as well as expertise in machine learning technologies. Of course, none of this really functions without an exceptional and intuitive BOT interface for the end user.</p><p><strong>Responsibilities:</strong></p><ul><li>Take technical lead on the team in the ML/NLP domain and keep up with latest industry solutions.</li><li>Design, develop, validate and deploy proposed ML/NLP solutions both internal and client facing.</li><li>Innovate and&nbsp;build new features for our products including chatbots and virtual assistants.</li><li>Coaching and mentoring a team of diverse and talented software engineers.</li><li>Interfacing with senior management and stakeholders to define requirements and take the lead on operational and technical projects in a fast-paced environment.</li></ul><p><strong>Requirements</strong></p><ul><li>Advanced degree Computer Science, Statistics, Mathematics, or related area&nbsp;</li><li>3+ Years of experience building software products as an Architect</li><li>1+ years ML/NLP domain experience.</li><li>Experience with Python or Go programming languages</li><li>Knowledge of JavaScript frameworks like ReactJS, React Native, AngularJS</li><li>Experience with Microservices and Resftul API’s</li><li>Familiarity with a major machine learning/deep learning frameworks a plus (Keras, Tensorflow, Torch, Spark-ML)</li></ul>                    </div>                            <h2>                About Critical Mix            </h2>            <div><p>Critical Mix provides easy access to highly-targeted global survey respondents, survey programming and data visualization services for market research and consulting firms. Driven by a passion for simplifying data collection, the team at Critical Mix is personally invested in giving clients the ultimate customer service experience.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Health benefits                            </div>                            <div>                                 Flexible schedule                            </div>                            <div>                                 Great work/life integration                            </div>                            <div>                                 Empowerment                            </div>                            <div>                                 Unlimited vacation policy                            </div>                            <div>                                 Competitive compensation                            </div>                            <div>                                 Remote location                            </div>                            <div>                                 Gym memberships                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "frontend"
    ]
  },
  {
    "id": "ZOUw2wAvRWKZIT3NOqFFEg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/169986/cloud-solutions-developer-dito?a=V0uSkx4VXjy",
    "title": "Cloud Solutions Developer at Dito  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Information Technology, Technology Consulting</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Who are We?</strong></p><p>Dito is a closely-knit team comprised of brilliant minds with a singular focus; to enable companies of all sizes to make the most of their technology by leveraging Google Cloud Platform, G Suite, Google Maps, AWS and Azure.&nbsp; We are a distributed team and have the distinguished honor of being one of very few service providers considered a Google Premier Partner, and have&nbsp;Specialization in Data Analytics. Our family is growing, and we are looking for a Cloud Solutions Developer to join our team.</p><p><strong>What Will You Do?</strong></p><p>You will be working on the development of web and mobile applications in the Cloud and in environments of the customer’s choice. We need an individual who takes a specific interest in building upon the latest various Cloud Platform products, primarily Google Cloud Platform (GCP) and other 3rd-party systems to create robust and complete solutions for our customers.</p><p>Software development projects will range from Google App Scripts to full, web/mobile applications. Understanding and potentially being able to use different tools in the appropriate situation, such as AngularJS, Python, Go, React, Backbone, Mustache, jQuery,&nbsp; and Node.js will be important - as is the ability to solve problems with a variety of tools. You have built applications on Google App Engine and/or Container Engine or other cloud platform, and are comfortable modeling data with Google’s Datastore, specifically NDB.<br><br></p><p><strong>The Technical Stuff</strong></p><p><strong>Responsibilities:</strong></p><ul><li>Develop professional, highly scalable and interactive web and mobile applications as custom solutions for clients</li></ul><ul><li>Full lifecycle application development</li></ul><ul><li>Designing, coding and debugging applications in various software languages.</li></ul><ul><li>Software analysis, code analysis, requirements analysis, software review, identification of code metrics, system risk analysis, software reliability analysis using the Agile Scrum development process</li></ul><ul><li>Performance unit-based software testing and quality assurance while building out the application</li></ul><ul><li>Performance tuning, improvement, balancing, usability, automation</li></ul><ul><li>Support, maintain and document software functionality</li></ul><ul><li>Integrate software with existing systems</li></ul><ul><li>Evaluate and identify new technologies for implementation</li></ul><ul><li>Work closely with Project Manager on client discovery, project estimating and project progression, testing, deployment, and iterations</li></ul><ul><li>Maintain standards compliance</li></ul><p><strong>Preferred Qualifications:</strong></p><ul><li>BS in Computer Science or equivalent experience</li></ul><ul><li>Proficiency in Javascript (AngularJS, React JQuery), HTML5, CSS, REST and JSON</li></ul><ul><li>Experience with the following: Python, PHP, Java, Javascript, Go, Django, Flask, XML, SOAP</li></ul><ul><li>Database design (Multi-tenant App Engine and/or Container engine design experience preferred)</li></ul><ul><li>Experience with the following is preferred: Kubernetes, Google App Engine (GAE), Google Maps Engine, Google Web Toolkit (GWT), MySQL, NoSQL (MongoDB), CartoDB</li></ul><ul><li>Work in an Agile Scrum development methodology</li></ul><ul><li>Experience with Atlassian Jira a plus</li></ul><ul><li>Multi-threaded web/mobile application programming</li></ul><ul><li>Great Analytical &amp; Troubleshooting Skills</li></ul><ul><li>Great Communication &amp; Customer Service Skills</li></ul><ul><li>Solutions Oriented Critical Thinking Skills</li></ul>                    </div>                            <h2>                About Dito            </h2>            <div><p>Dito is a full-service cloud advisory and services firm providing sales, development, change management and ongoing customer success services to organizations interested in moving to &amp; operating in the cloud. From on-site transformation labs to security assessments and innovation workshops, we take great pride in fulfilling our role as your cloud advisor and system integrator. Our customers’ success and satisfaction stands above all else. We’ll make going Google the easiest deployment you’ve done, and staying the easiest IT decision you’ll make.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote workforce                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "Z7wB56K7Ro-ekLpAMJ8Iew",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/169446/solutions-architect-citrusbyte?a=UPgJj8p7MDS",
    "title": "Solutions Architect at Citrusbyte  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development, Web Design</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Citrusbyte&nbsp;is a software consultancy that believes in using simple tools to solve problems. We build custom systems for both startups and enterprises - You can see our&nbsp;portfolio&nbsp;for more information about our clients.</p><p>We have offices in Los Angeles and New York, but we work remotely with people from all around the world.</p><p>Our engineers have experience in a consultative environment, excellent communication skills and a desire to work with talented teams building innovative products. We work closely with our clients, sharing our experience and processes to help them define and create their products.</p><p>Most of our projects are written in&nbsp;Ruby, so experience in this language is required, but we are looking for experienced polyglot engineers who have a hunger for learning new languages and tools. At Citrusbyte, learning is part of the job, and you should always be able to answer the question: &quot;what have I learned this week?&quot;</p><p>We believe that less is more and we vehemently value simplicity. This is reflected in the tools we choose to work with. For this reason we tend to avoid using big frameworks like Ruby on Rails and instead lean towards smaller tools like Sinatra, Roda or Cuba.</p><p>We have also done projects in Elixir, Node.js, Go, Python, Lua, etc. And strive to learn new tools and languages everyday. We believe in always choosing the right tool for the job and we are very open minded about trying different technologies.</p><p>As a Solutions Architect, you will have a consultative role, directly supporting our clients and our teams so we can achieve our mission. These are some of the things you'll be responsible for:</p><p><strong>Responsibilities</strong></p><p><br><strong>Sales</strong></p><ul><li>Assisting the sales team with uncovering and understanding technical requirements from our clients.</li><li>Producing estimates and risk assessments for prospective projects.</li><li>Preparing and delivering technical presentations to support sales.</li><li>Creating artifacts to support the sales process such as prototypes, diagrams, etc.</li></ul><p><strong>Project Kick-start and Discovery</strong></p><ul><li>Becoming a domain expert for the problems Citrusbyte needs to solve.</li><li>Researching and documenting the client’s existing infrastructure, systems, technologies, teams and in general all the information the engineering team will need to start the project implementation phase successfully.</li><li>Validating integration points into client’s systems, and validating technical hypotheses, through prototyping, tech spikes, and technical feasibility efforts.</li><li>Collaborating with the rest of the team on defining a mission and strategy for the project as well as starting to delineate what the product will be.</li><li>Day-to-day point of contact for all things technical with client stakeholders and client team.</li><li>Guide the client through complex technology selection and platforming decisions to support a successful implementation phase.</li><li>Continually educating client and client stakeholders about the benefits of Citrusbyte’s approach and process to software and solutions development.</li><li>Develop strong and durable relationships with key client stakeholders and client technical/IT organization.</li><li>Contributing to planning a resourcing strategy for the project, taking into consideration the required skill sets, team size, etc.</li></ul><p><strong>Project Implementation</strong></p><ul><li>Lead the relationship with the client from the engineering side. Able to receive feedback about our engineering team directly and mediate if necessary when there are any conflicts.</li><li>On-boarding and guiding the team throughout the client’s ecosystem (accounts, VPN, who to talk about a particular topic, etc).</li><li>Contributing to design engineering solutions for our client. Stepping back and thinking about what we’re building with a focus on usability, simplicity and quality.</li><li>Helping define the project technology stack and identifying the risks of the project execution plan.</li><li>Ensuring that projects live up to Citrusbyte engineering quality standards.</li><li>Ensuring that multiple projects across a single account adhere to consistent best practices, processes and technology stacks.</li><li>Augmenting the engineering team to solve challenging and complex problems.</li><li>Mentoring and coaching the team to consult with the client, so everyone becomes a trusted advisor and is empowered to take on a consultative role.</li><li>Maintain strong and durable relationships with key client stakeholders and client technical/IT organization.</li></ul><p><strong>Project&nbsp;Hand-off</strong></p><ul><li>Gathering requirements from the client&nbsp;and any necessary stakeholders for&nbsp;handing over the project.</li><li>Collaborating with the team to create a successful project hand-off plan.</li></ul><p><strong>Project Support &amp; Maintenance</strong></p><ul><li>Collaborating on defining a resourcing strategy for any support or maintenance commitments after the implementation phase is complete.</li><li>Ensuring that our team has an effective plan for supporting the project as it grows.</li></ul><p><strong>Job Requirements</strong></p><ul><li>Over 10 years of experience in software engineering.</li><li>Over 5 years of experience directly consulting with clients.</li><li>Proficient and experienced with at least 3 programming languages.</li><li>Demonstrates continuous learning and being up to date with modern technologies.</li><li>Demonstrates a strong preference for simplicity in all aspects of software development.</li><li>Excellent spoken and written english level.</li><li>Lives within UTC-8 and UTC-3.</li></ul>                    </div>                            <h2>                About Citrusbyte            </h2>            <div><p><a href='https://citrusbyte.com/' rel='nofollow'>Citrusbyte</a>&nbsp;is a software consultancy focused on using modern tools to solve complex problems for global businesses. We are a pioneer in remote workplaces with a diverse team of communicative, experts spread across 20+ countries.</p><p>We strongly advocate minimalism and this is represented in the tools we choose to work with. Every team gets to decide on their own stack depending on the requirements of the project.</p><p>Our main offices are in Los Angeles and New York, but we work remotely with people from all around the world.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Open Vacation Policy                            </div>                            <div>                                 Hardware                            </div>                            <div>                                 Health, Vision, Dental Benefits                            </div>                            <div>                                 Fitness Reimbursement Program                            </div>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Paternity &amp; Maternity Leave                            </div>                            <div>                                 Education Allowance                            </div>                            <div>                                 Conference Assistance                            </div>                            <div>                                 Annual Company Retreat                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/ruby",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "ruby"
    ]
  },
  {
    "id": "98yVgLSqSJCpznob_e6scg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16512361",
    "title": "Kloudless | Solutions Engineer | San Francisco area (Berkeley); Taipei, TW; REMOTE | Full-time | $120-140k + equity (SF) | Series A stage",
    "content": "<div>                  <span>Kloudless | Solutions Engineer | San Francisco area (Berkeley); Taipei, TW; REMOTE | Full-time | $120-140k + equity (SF) | Series A stage<p>Kloudless’s unified APIs enable engineering teams to quickly integrate their applications with other software services: <a href='https://kloudless.com' rel='nofollow'>https://kloudless.com</a>.</p><p>We’re looking for an experienced Solutions Engineer to serve as a technical resource during all stages of business development and lead advanced technical support for our customers.</p><p>Ideal candidates have strong DevOps experience with Linux systems, experience in a customer-facing role, familiarity with web application development and REST APIs, and are eager to join an early-stage company.</p><p>Apply here: <a href='https://developers.kloudless.com/careers?gh_jid=4004123002' rel='nofollow'>https://developers.kloudless.com/careers?gh_jid=4004123002</a></p><p>Kloudless is backed by some of Silicon Valley’s top investors including David Sacks (co-founder of PayPal and Yammer) and Tim Draper (investor in Box, Tesla, SpaceX).</p><p>We offer competitive salaries and benefits, including insurance plans, flexible paid time off, telecommuting, and snacks. Our team-wide activities include outings, lunches and dinners.</p><p>- Vinod, Co-Founder &amp; CTO<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 4, 2018 1:33:07 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "EGritTXoSHC1y3sjxwMQUQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168868/solutions-architect-americas-auth0?a=UDfB1Nh77Pi",
    "title": "Solutions Architect - Americas at Auth0 (Bellevue, WA) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, IT Security, Software Development / Engineering</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div>Auth0 provides an enterprise-grade platform that secures billions of log-ins every year. The company makes it easy to implement even the most complex identity solutions for their web, mobile, IoT and internal applications, as well as sophisticated identity management for employees, customers and partners. Auth0 has raised over $54 million from Meritech Capital, NTT DoCoMo, Trinity Ventures, Bessemer Venture Partners, K9 Ventures, Silicon Valley Bank, Founders Co-Op, Portland Seed Fund and NXTP Labs.Thousands of enterprises and millions of users worldwide depend on Auth0 for authentication and authorization of their most mission-critical apps, APIs and IoT devices. &nbsp;&nbsp;Auth0’s top priorities are availability and security.This role could be located anywhere in the the Americas - Bellevue WA is preferredSolutions Architects&nbsp;are responsible for implementation and best practice coaching for our biggest customers. They help translate business and security requirements into technical requirements and implementing it. The role requires both broad and deep technology and identity management knowledge, with the ability to architect solutions by mapping customer business and security problems to Auth0 solutions. They will also communicate with sales, support, and product teams to ensure flawless execution of the support and implementation process.<p><strong>Responsibilities:</strong></p><ul><ul><li>Assisting customers in architecting, planning, developing/implementing and applying governance for integrating Auth0 in customers solutions as appropriate.</li><li>Apply advanced analysis skills and experience in principals of solutions design to define appropriate customer solution, scope the effort and provide technical leadership.</li><li>Conduct quality &amp; product usage checks to ensure customer &amp; product satisfaction expectations are being achieved for customers and that a high level of service is being delivered.</li><li>Develop and maintain project plans, issues logs, and status reports.</li><li>Track customer satisfaction metrics; identify opportunities to improve metrics and team efficiency based on results of reporting and analytics.</li></ul></ul><p><strong>Requirements:</strong></p><ul><ul><li>The Solutions Architect must have proven experience managing projects through the entire project lifecycle. This includes managing multi-phase/multi-dimensional/multi-resource projects to a conclusion while maintaining high customer satisfaction. The role requires an individual who is resourceful, confident under pressure and has demonstrated skill in both crisis management and expectation management.</li><li>Comprehensive experience with security solution architecture from an application perspective and demonstrable success of aligning technical teams with business, and managing the delivery of associated technical services, solutions, architectures, and technologies. Technical knowledge of authentication and authorization protocols, threat modeling and application security.</li><li>Familiarity with the whole development lifecycle including modern development tools, languages and frameworks, continuous integration/deployments tools and monitoring, performance, and optimization practices.</li><li>In depth knowledge and experience with at least one development language/technology. Experience with Node.js and front-end development frameworks is a plus.</li><li>Excellent written and verbal communication skills. Ability to set expectations and communicate goals and objectives with customers and teammates. Ability to communicate, influence, build and maintain strong working relationships with stakeholders at all levels in order to achieve successful outcomes for the business. This will include explaining technical concepts to nontechnical stakeholders if required. Ability to successfully communicate and coordinate with departments across the organization, including Sales, QA, Product Management, etc. Ability to understand and escalate issues efficiently and appropriately.</li><li>Ability to delegate responsibilities, assign special tasks and projects, identify new opportunities for process improvement. Must have a passion for the customer which is demonstrated through professionalism and striving for excellence in all aspects of the customer experience.</li><li>Serve as a coach, mentor, knowledge resource, and escalation point for customers and support representatives</li><li>Multitasking and Time Management Skills</li><li>Experience in Pre-sales and Delivery Consulting is a plus</li></ul></ul>Auth0 values diversity and inclusion and is an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Auth0 participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.                    </div>                            <h2>                About Auth0            </h2>            <div><p>Auth0 provides an enterprise-grade platform that secures billions of log-ins every year. The company makes it easy to implement even the most complex identity solutions for their web, mobile, IoT and internal applications, as well as sophisticated identity management for employees, customers and partners. Auth0 has raised over $54 million from Meritech Capital, NTT DoCoMo, Trinity Ventures, Bessemer Venture Partners, K9 Ventures, Silicon Valley Bank, Founders Co-Op, Portland Seed Fund and NXTP Labs.</p><p>Thousands of enterprises and millions of users worldwide depend on Auth0 for authentication and authorization of their most mission-critical apps, APIs and IoT devices. Auth0’s top priorities are availability and security.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Competitive Equity                            </div>                            <div>                                 Free Nespresso                            </div>                            <div>                                 Top-of-the-Line Macbooks and other great tools                            </div>                            <div>                                 Embrace Distributed Work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 9:31:15 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "nodejs"
    ]
  }
]
}
