{
 "items": [
  {
    "id": "JecfIMHYQWGbOuMqUds7sw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/172165/business-intelligence-developer-consultant-iridium-technology?a=VJNX360gT4I",
    "title": "Business Intelligence Developer / Consultant (Living in Reno only) at Iridium Technology (Reno, NV) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Business Intelligence, Legal, Legal Technology</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We currently have a development team in&nbsp;Reno and we are looking to expand.&nbsp; The &quot;remote&quot; aspect is that we currently have employees working from home offices and meeting up in work-spaces in&nbsp;Reno several times per week.&nbsp;<strong> This position is only open to&nbsp;Americans&nbsp;living in Reno.</strong></p><p><strong>T-SQL is one of our core technologies, and is a required skill. If you are not solid on T-SQL, please do not apply.&nbsp; Our programming test for all applicants is based on T-SQL through SSMS.</strong></p><p>The position of BI Consultant/Developer requires candidates with very strong development skills. This is a client-facing role, so excellent communication skills are also a must. We are looking for applicants who are entrepreneurial, incredibly bright, organized, focused, creative problem solvers, able to work independently, extremely hard-working, and who embrace the home office-based lifestyle.</p><p><strong>Salary</strong></p><p>Salary is set depending on your experience. If you can pass our application process we will be able to agree on a salary that works for you.&nbsp;</p><p><strong>Job Responsibilities</strong></p><p>The role encompasses a combination of consulting and development duties, including:&nbsp;</p><ul><li>Client-facing resource: work directly with&nbsp;our&nbsp;law firm clients to implement and support Iridium BI products&nbsp;</li><li>Report/dashboard design and development&nbsp;</li><li>Manage client product implementations and projects to successful outcomes&nbsp;</li><li>Requirements gathering, both for development projects and consulting/implementation projects&nbsp;</li><li>Design, code, deploy, and test client-specific customizations and enhancements&nbsp;</li><li>Design, code, deploy, and test Iridium BI product features and enhancements&nbsp;</li><li>Development of software tools for internal use&nbsp;</li><li>Technical investigations&nbsp;</li><li>Client support/training&nbsp;&nbsp;</li></ul><p><strong>Required Skills</strong></p><ul><li>Bachelor's degree in Computer Science, Information Technology, or similar&nbsp;</li><li>Strong development skills and experience.&nbsp;Our technologies are SQL Server (relational database, T-SQL, SSAS, SSRS), HTML5, Angular JS, C# and others. While we prefer experience with these technologies, we will consider developers that are familiar with other technologies - our thinking is that hard-core coders can learn any technology stack.&nbsp;</li><li>Excellent written/oral communications skills&nbsp;</li><li>We develop software for law firms. Experience in Legal IT (ADERANT, Elite Enterprise, Elite 3E) is a big plus, but is not required&nbsp;</li></ul>                    </div>                            <h2>                About Iridium Technology            </h2>            <div><p><strong>Does this get you excited?</strong>&nbsp;<br> Living in Reno, getting a great salary, flexible hours, and our unlimited vacation policy.&nbsp; And more importantly, no commute and no parking problems, because a lot of your time will be spent working out of your home office!&nbsp; Note that you will be expected to meet up with your team multiple times per week, and at some point this year we will probably get an office in downtown Toronto.</p><p><br> <em>Note that if you don't want to work from a home office, we will cover the cost of membership in a co-working environment.</em></p><p><strong>Work Environment</strong></p><p>Iridium provides a great environment for developers to learn new technologies and show off their skills.&nbsp; First of all, this is a company that is run by developers. 25 out of our 30 employees have degrees in Computer Science or IT.&nbsp; We love to code, design architectures, streamline processes, and are relentlessly striving for constant improvement.&nbsp; We have modern/relevant technology stack, and we are moving aggressively into implementing the Microsoft Azure BI/AI capabilities.&nbsp; Each developer is assigned to a team with 4-5 members, and collaborative programming and collaborative problem-solving are highly encouraged. You will constantly be challenged to learn new technologies and extend your knowledge of Iridium’s products. &nbsp;We offer a very agile and empowered environment – if you have a great idea, speak up and present it to the team. If the team loves your idea, then we will look for you to implement it.&nbsp;</p><p>Iridium is an 8-year old company that thinks it is still a startup.&nbsp; What is nice is that we have the startup attitude, but also offer stable and long-term employment with a company that has positive cash flow and is not concerned about running out of money.&nbsp; We offer the start-up mindset, but without the fear that we will close our doors next month.&nbsp;</p><p>If you are looking for a relaxing job where you can work 8-5 Monday through Friday, then this is not the job for you. The Iridium work experience is fast-paced and high intensity. You will be a member of a team of extremely talented and highly skilled technical employees. We all bring our “whatever it takes attitude” to solving both technical and client issues. You will be empowered to showcase your technical skills and grit on a daily basis. You will be given massive responsibility and be expected to independently manage yourself. We can promise overtime, late nights, and even some weekend work. But we can also promise a great sense of achievement, and a supportive team environment that makes it all worthwhile. Are you a hard-charger? If so, you will fit right in and you will love working here.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Great salary                            </div>                            <div>                                 Work from your home office                            </div>                            <div>                                 UNLIMITED vacation policy                            </div>                            <div>                                 Flexible hours                            </div>                            <div>                                 Will invest into your development                            </div>                            <div>                                 New laptop                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 15, 2018 2:07:51 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "pcxMw3HKQEOcG89MuQieuQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/the-art-of-applying-persuade-young-professionals-to-pursue-their-educational-dreams",
    "title": "The Art of Applying: Persuade young professionals to pursue their educational dreams!",
    "content": "<div>  <div>    <h2>Persuade young professionals to pursue their educational dreams!</h2>      <h4>Posted Apr 14</h4>    <h3>      <span>The Art of Applying</span><br>      <span>Headquarters: New York, NY / Toronto, Ontario</span><br>        <a href='http://theartofapplying.com/sales' rel='nofollow'>http://theartofapplying.com/sales</a>      <br>      <a rel='nofollow'>View all The Art of Applying jobs →</a>    </h3>  </div></div>  <div>    <div><span>HIRING: Breakthrough Coach for The Art of Applying <br></span></div><div>(consultative sales with no cold calling)</div><div><br></div><div><span>The Art of Applying changes peoples' lives all over the world by helping them get into the best graduate schools in the world and get money to pay for it! Despite our love for the Ivy League, there are no fancy degrees required for the job we're hiring for right now.</span></div><div><br></div><div><span>Joining The Art of Applying team as a Breakthrough Coach is an invitation to break out of boredom,&nbsp;overcome&nbsp;under-earning and reach your potential.</span></div><div><br></div><div><span>Within four months on the job, you can expect to earn $5000+ per month&nbsp;while working from home on a high-energy team helping amazing clients.</span></div><div><br></div><div><span>HOW TO APPLY: Fill out the application at this link:&nbsp;</span><a href='http://theartofapplying.com/sales' rel='nofollow'>http://theartofapplying.com/sales</a></div><div><br></div><div><span>DEADLINE: ASAP. Training begins on Monday, April 23. High-quality applications received after April 23 will be put on a waiting list.</span></div><div><br></div><div><span>ABOUT OUR TEAM: Dylan is our Lead Breakthrough Coach. Just a year ago, Dylan was a small town reporter with no background in sales, and now he earns $5000-$10,000 per month working from home and helping make people's dreams come true. When you join the team, Dylan will train you intensively and be there for you every day to answer your questions as you learn how to excel in your role. And don't worry that you're bothering him; Dylan gets paid to help you succeed, and the better you do at your job, the more money he gets paid!</span></div><div><br></div><div><span>Tyler and Kiara will be listening to the recordings of every single one of your calls and giving you feedback, helping you get better and better at being persuasive and effective on your calls. Their feedback is candid but kind, so you'll never be left in the dark wondering how you're doing or how to get better.</span></div><div><br></div><div><span>Once you get someone enrolled in the program, Kyle, Kiara, or Tyler will have an onboarding call with your client, so that the person you just signed up knows how to find her way around her client portal and make the most of her time with us in the program.</span></div><div><br></div><div><span>ABOUT OUR FOUNDER &amp; CEO</span></div><div><br></div><div><span>Hey there! I'm Kaneisha Grayson, and I'm the founder and CEO of The Art of Applying. My team and I help people from around the world apply to the world's top graduate schools to study business, public policy, law, urban planning, public health, education, and design.</span></div><div><br></div><div><span>Our signature program is called Application Accelerator®. It's a one-of-a-kind bootcamp that helps high-potential high-achieving students and professionals get their applications done in less time with less stress without doing it all alone.</span></div><div><br></div><div><span>As one of my Breakthrough Coaches, your job would be to listen to the potential client's story,&nbsp;ask them lots of questions to understand their strengths, weaknesses, and worries (we'll give you the questions to ask), and then address their doubts and fears one by one about joining the Application Accelerator®.</span></div><div><br></div><div><span>To be clear, you don't need a fancy college or graduate degree, because&nbsp;you would not be the person advising the client on how to apply to graduate school; you would serve as the gatekeeper for our amazing program who helps people cross the bridge of fear from confusion to clarity.</span></div><div><br></div><div><span>I'm looking to hire three people who are&nbsp;passionate, persuasive, energetic, optimistic, committed, and resilient&nbsp;to speak to these eager and excited prospective clients and help me decide if the client is a great fit for our program as well as help&nbsp;the right people commit to working with us on their grad school applications.</span></div><div><br></div><div><span>IF YOU WANT TO...</span></div><div><br></div><div><span>* make great money while making a difference and&nbsp;crafting a fulfilling career&nbsp;on your own terms</span><br></div><div></div><div></div><div></div><div><span>* work from home.&nbsp;We're a remote team but we meet several mornings per week at 9 am Eastern Time. We work primarily from 9 am - 6 pm Eastern Time. You MUST be located in Canada or U.S. (Toronto area preferred).</span><br></div><div></div><div></div><div></div><div><span>* have in-depth conversations with 5 people every day who are excited to talk to you. The calls are about an hour long and are primarily held between 9 am - 6 pm Eastern Time.</span><br></div><div></div><div></div><div></div><div><span>* do absolutely NO cold calling. The people you'll be speaking with WANT to speak to you.</span><br></div><div></div><div></div><div></div><div><span>* feel proud of&nbsp;the&nbsp;work you do and the way you are helping change lives</span><br></div><div></div><div></div><div></div><div><span>* work on a fun, collaborative, diverse team</span><br></div><div></div><div></div><div></div><div><span>* receive guidance and mentorship from a successful Harvard Business School &amp; Harvard Kennedy School-educated entrepreneur who will deeply care about your success</span><br></div><div></div><div></div><div></div><div><span>* work with coworkers who you learn from and love to hang out with virtually and on all-expenses paid team retreats</span></div><div><br></div><div><span>...Then this position might be for you.</span></div><div><br></div><div><span>HOW TO APPLY: Fill out the application at this link:&nbsp;</span><a href='http://theartofapplying.com/sales' rel='nofollow'>http://theartofapplying.com/sales</a></div><div><br></div><div><span>Training begins on Monday, April 23. Applications received after training begins will be put on a waiting list. We are always interested in hardworking, super-committed, enthusiastic people!</span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Complete the application here: <a href='http://theartofapplying.com/sales' rel='nofollow'>http://theartofapplying.com/sales</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 14, 2018 7:15:27 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "KG1xmNteSAWQXG6FZpVA8g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/67931/ea-to-ceo-at-founder-coaching/",
    "title": "EA to CEO",
    "content": "Dave Bailey, one of the UK’s leading CEO Coaches, is looking for an Executive Assistant to support him and his growing businesses.<br /><br />*Who you'll help:*<br /><br />The best CEOs know their professional development isn't optional. It's life-or-death for their business. Dave supports the top-1% of VC-backed startup founders on their journey to becoming a great CEOs. Drawing on 10+ years as a serial founder and mentor to hundreds of startups, Dave pushes clients to self-reflect, challenge themselves, and act courageously.<br /><br />*What you'll do:*<br /><br />* Manage Dave's calendar<br />* Help onboard new clients<br />* Manage accounts receivable in Xero<br />* Manage social media using SmartQueue<br />* Publish blogs using Wix, Medium and LinkedIn<br />* Organise Dave’s travel plans<br />* Conduct small research projects<br />* Make restaurant reservations<br />* Discuss Dave’s to-do list<br /><br />*Why you’ll win:*<br /><br />* Structured - you take an unstructured problem and organise it into smaller chunks<br />* Judgement - you listen, ask questions and take considered decisions<br />* Tech-savvy - you are very comfortable picking up new interfaces on-the-fly<br />* Detail-oriented - you pay attention to the small details<br />* Near to Paddington - you are available for weekly face-to-face sessions<br /><br />*What you'll get:*<br /><br />* A competitive monthly rate<br />* Flexible work hours - approx 60% remote<br />* Personal coaching from Dave",
    "urlFetchPending": false,
    "published": "Apr 12, 2018 11:42:12 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Cpe40R1ZSRutZ_c0faPb2Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/remote-jobs/dadaabc-online-english-esl-tutor",
    "title": "DaDaABC: Online English (ESL) Tutor",
    "content": "<div>  <div>    <h2>Online English (ESL) Tutor</h2>      <h4>Posted Apr 11</h4>    <h3>      <span>DaDaABC</span><br>      <span>Headquarters: Shanghai</span><br><br>      <a rel='nofollow'>View all DaDaABC jobs →</a>    </h3>  </div>    </div>  <div>    <div>If you are a fun and energetic person, If you love children and teaching, if you are looking forward to start your teaching career in China from your home, come teach with DaDaABC!</div><div><br></div><div><b>Who We Are</b></div><div>DaDaABC is an online one-on-one English education platform for children between 4 to 16 years old. We are recruiting part-time English teachers all year round, who can give fun and interactive English classes to our students via video-conference.&nbsp;</div><div><br></div><div>– DaDaABC is the first online English education company in mainland China to cooperate with the American TESOL Institute.</div><div>– In order to present world class curriculum to our students, we partner with Pearson Test of English Academic, Highlights, and National Geographic Learning.</div><div>– DaDaABC has raised the equivalent of $100 million USD in C-round financing from Tiger Global Fund and TAL Education Group.&nbsp;</div><div><br></div><div><b>What we offer</b></div><div>– Up to $25/h</div><div>– Incentives/Bonuses</div><div>– Contract: 6 or 12 month</div><div>– Paid contracted non-teaching hours</div><div>– Working hrs/week Min : 4, Max : 20</div><div><br></div><div><b>Why Choose DaDaABC</b></div><div>The difference between DaDaABC and other online English teaching company is that at DaDaABC, teachers can have their regular students, and they don’t have to teach different students in each class. Therefore, our teachers and their students can bond and build strong friendships.&nbsp;</div><div><br></div><div>Each teacher has the opportunity to come to China and join our students-teacher meetings. It is also possible for them to stay in Shanghai and become our full-time staff. They could also become a trainer, and join our recruitment team.</div><div><br></div><div><b>Job Requirement:</b></div><div>– Speak English at an idiomatic level (accent free)；</div><div>– Have teaching experience for kids (not necessary);</div><div>– TESOL/TEFL certification are preferred, or willingness to obtain certification;</div><div>– Stable and strong internet connection;</div><div>– Have a Headset;</div><div>– Willingness to commit to a regular weekly working schedule. And should be committing to teach at least 4 hours in the following timetable:</div><div><br></div><div>Monday to Friday：6:00pm-9:10pm (GMT+8 China Standard time)</div><div>Saturday &amp; Sunday: 10:00am-12:06pm; 2:00pm-4:06pm; 6:00pm-9:10pm (GMT+8 China <span>                        </span> Standard time)</div><div><br></div><div><b>Required documents:</b></div><div>– CV (Name/Gender/Nationality) with a front photo (ID photo preferred)</div><div>– Copies of certifications</div><div>– Copy of Passport or other ID.</div><div>– Your contact details, such as Phone number, email and other instant contact information as Wechat &amp; Skype.</div><div><br></div><div><b>The benefits for joining us:</b></div><div>– Enjoy the freedom to teach wherever you have a good Internet connection.</div><div>– We provide the teaching material on our online interactive educational system.</div><div>– Stable income per month: We will sign fixed time labor contract with teachers.</div><div>– Attractive payment. You will get payment in your contract hours even though you don’t have classes.</div><div>– Work in a friendly, cooperation, and harmonious working atmosphere.</div><div>– Have opportunity to join a rising rapidly company</div><div><br></div><div><b>APPLY NOW:&nbsp;https://www.dadaabc.com/go/2975</b></div><div><b><br></b></div><div>Ideal working experience for this role would include being an Educator, Teacher, ESL Teacher, English teacher, Trainer, Elementary School Teacher, Kindergarten Teacher, teacher assistant. Or holding a bachelor degree from any subject including but not limited to Early Childhood Education, Child Development, Elementary Education, Secondary Education, Advising, etc.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>APPLY NOW: <a href='https://www.dadaabc.com/go/2975' rel='nofollow'>https://www.dadaabc.com/go/2975</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 11, 2018 12:21:03 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/go",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "go"
    ]
  },
  {
    "id": "i11zefGoSZmB1zFEKefGFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16789298",
    "title": "SEEKING FREELANCER | Canada | Remote ONLY | 25-60k USD | 6-18+ Months Duration",
    "content": "<div>                  <span>SEEKING FREELANCER | Canada | Remote ONLY | 25-60k USD | 6-18+ Months Duration<p>Game developers report in!</p><p>We are working with a properity engine for an unannounced game project. Team size is approximately 25. Project is at a fairly advanced stage.</p><p>We mostly are known for running the Hypixel Server network - the largest independant game server in the world. However we are venturing beyond Minecraft with our new game project.</p><p>Gameplay ProgrammerAI Developer</p><p>More info on our hiring process available on our /jobs page.</p><p>Experience with remote collaberation desirable (Slack / Asana / Many Google Docs) experience either in Voxel Games, Minecraft Servers are ++'s. Hours are entirely your responsibility to set - however most of the team works in the Eastern USA / Europe time zone.Demonstratable examples of game dev work mandatory. (Either via tech demos or previously released projects)C# and Java preferred</p><p>Project is self funded with no outside investors or publishers.</p><p>Please apply via the form on our website or to me directly: Noxy+HackerNews(AT)hypixel.net with CV/Resume attached as PDF</p><p>No Agencies or Recruiters please.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 9, 2018 4:00:04 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone",
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "A2S2PGgtSPSv2wCx5BrxXA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16754030",
    "title": "Eyra | Chiasso, Switzerland | Full-time | INTERNS, ONSITE or REMOTE | 40-50k CHF | https://eyra.io",
    "content": "<div>                  <span>Eyra | Chiasso, Switzerland | Full-time | INTERNS, ONSITE or REMOTE | 40-50k CHF | <a href='https://eyra.io' rel='nofollow'>https://eyra.io</a><p>VC backed startup building a computer vision &amp; AI powered personal assistant for the blind (<a href='http://horus.tech' rel='nofollow'>http://horus.tech</a>)</p><p>We are entering the market soon (already have good traction) and we are starting to define how our next product is going to be.</p><p>Current stack &amp; tools: C++, CUDA, Python, PHP, Docker, Openembedded</p><p>Multiple positions: C++ dev | Full stack | Computer Vision (soon) | AI engineer (soon)</p><p>See available positions here: <a href='http://bit.ly/eyra-jobs' rel='nofollow'>http://bit.ly/eyra-jobs</a></p><p>Values: We like challenges, and as such we value resourceful people who strive to learn every day and who like to see their work have a tangible impact on the lives of people. We also like people who want to play an active role in defining the technical solutions we will adopt in our future challenges.</p><p>Benefits: Work from home for the onsite employees, coffee &amp; energy drinks, good paid vacation options, paid conference attendance.</p><p>For more info or questions, write to luca@eyra.io<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 3:26:08 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "fothTh9vSyKERcz4HCpPOg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/3660-acumatica-erp-functional-consultant-remote-prefer-tx-ok-la-ar",
    "title": "Acumatica ERP Functional Consultant - remote (prefer TX, OK, LA, AR)",
    "content": "Acumatica ERP Functional Consultant - remote (prefer TX, OK, LA, AR) - Jobmote<div><div><h2>Acumatica ERP Functional Consultant - remote (prefer TX, OK, LA, AR)</h2><h5>Insight Recruitment, LLC</h5></div></div><div><div><div><div></div></div><div><div><div><p>Job Description</p><p>Would you like to work in an uplifting environment with a talented team of authentic people? We are a well-established company that truly invests in their employees and provides an environment where you can share your ideas, be heard, and be respected.</p><p>If you are a well-rounded ERP Consultant with Acumatica experience and would like a remote position where you can be part of something great, we have a superb opportunity for you! We are an Acumatica Partner with a flourishing regional Acumatica business and we are looking to add an ERP Consultant to our technically strong team in order to facilitate our growth.</p><p>Our ideal candidate has 2+ years of experience with Acumatica and a broad background with finance, and projects-manufacturing would be nice to have also. Certifications are a plus. This candidate should be self-motivated and disciplined and enjoy working directly with clients. Travel for this role is low, around 30%, but could occasionally be up to 50%.</p><p>We offer a competitive salary and an excellent benefits package and commissions. Salary $85-$115K +commissions and benefits.</p><p><strong>Responsibilities:</strong></p><p>· Successful implementation of practical business solutions using industry best practices</p><p>· Facilitate the implementation and support of Acumatica</p><p>· Design, configuration and testing of core Acumatica finance, projects, manufacturing, and other modules</p><p>· Work with customers to understand their business requirements and conduct fit/gap analysis</p><p>· Convert requirements to functional specs and functional design documents</p><p>· Communicate effectively in all mediums and to all levels within the organization</p><p><strong>Requirements:</strong></p><p>· Minimum of 2 years Acumatica implementation experience</p><p>· Prefer someone in the Texas, Oklahoma, Louisiana, or Arkansas area but you'd be working remotely.</p><p>· Experience with a broad Acumatica toolset, well rounded.</p><p>· Working knowledge of industry specific best practices.</p><p>· Excellent communication, planning and organization skills.</p><p>· Excellent work ethic</p><p>· Strong customer relationship skills.</p><p>· Ability to establish priorities and work independently.</p><p>· Ability to travel up to 50% domestically.</p><p>Company DescriptionAt Insight Recruitment we specialize in the placement of Information Technology (IT), Biotechnology &amp; Life Science, and Executive professionals in all varieties of industries &amp; disciplines. </p><p>Offering a boutique style service, we have grown organically over the years through word of mouth referrals and have become the Agency of Choice for companies who need the right talent to join their firm. </p><p>Our Services Include: Direct hire, Contract or Contract-to-hire. </p><p>We have served a wide variety of firms in the Midwest and nationwide since 1998 and as a result we have come to truly know our client's culture, their business demands and subsequently their hiring needs. Everything is evolving in today's marketplace and the most innovative professionals are driving this market. The success of your company relies on how you can attract, engage and hire these people: this is where we can help. </p><p>A Dynamic Approach </p><p>&quot;Over 85% of our business comes from referrals; that's a powerful testament to the quality of service we deliver. Companies want to be truly heard and understood when they are working with an agency to help them find and secure the best talent available. Many come to us because they're tired of the larger nationwide chains only providing mediocre candidates, and they want better results. </p><p>And that is what every company receives with us: better results.&quot; </p><ul><li>Kinga Wilson, Search Consultant and Owner of Insight Recruitment</li></ul></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 9:22:37 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Gjg8tLXRTOeOwCfd2BC-sg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16751225",
    "title": "Crowdstrike | Irvine, Sunnyvale, Seattle, DC, Other Cities, Remote | Fulltime | ONSITE or REMOTE | http://www.crowdstrike.com/ CrowdStrike Stops ...",
    "content": "<div>                  <span>Crowdstrike | Irvine, Sunnyvale, Seattle, DC, Other Cities, Remote | Fulltime | ONSITE or REMOTE | <a href='http://www.crowdstrike.com/' rel='nofollow'>http://www.crowdstrike.com/</a>CrowdStrike Stops Breaches. We're a rapidly growing company that raised $100M from awesome investors like Accel, CapitalG, Warburg Pincus, March Capital, and Telstra.<p>We're growing our team of software and devops engineers to help scale our automation of our software and systems. Give us a shout if you're interested in the following areas, with other information listed at :<a href='http://www.crowdstrike.com/careers/' rel='nofollow'>http://www.crowdstrike.com/careers/</a></p><p>My team is hiring folks to help with Network Engineering, Linux Automation (Thanks Linus!!), and Virtualization.</p><p>We have a real devops approach - very egalitarian and enabling of engineers.</p><p>There's tremendous mutual respect and as a result, we get a lot of leading edge stuff done very efficiently.</p><p>Come join us! Contact us at <a href='http://www.crowdstrike.com/careers/' rel='nofollow'>http://www.crowdstrike.com/careers/</a>. You're welcome to ping me at alan dot hannan at crowd strike dot com for any questions. I manage a team here and enjoy my job and coworkers.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 5:00:09 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "5cZJAPAOR66XGJcRfpguNw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/blys/jobs/131837-mobile-massage-therapists",
    "title": "Mobile Massage Therapists",
    "content": "<div><h2>Mobile Massage Therapists at Blys</h2><div>Australia, Remote · Contract</div><div></div></div><div><div>Skills</div><div>Massage Therapy, Certified Massage Therapist</div><div>Compensation</div><div>$10K–$50K<br>No Equity</div></div><h3>Job Description</h3><div><p>+ Earn up to $75/hour <br>+ Be your own boss - work when you want <br>+ Minimum travel - get jobs in your local area</p><p>Blys is a pioneering new, on-demand mobile massage service - seamlessly connecting qualified therapists with clients looking for professional massage in the comfort of their home.</p><p>We are looking to expand our network of elite therapists across Australia - to help us deliver the best mobile massage experience in Australia.</p><p>This is a great opportunity for qualifying students or fully qualified practitioners who are looking to earn extra money and work with flexible hours.</p><p>-----------------</p><p>What Blys offers you:</p><p>- More money. Fill the gaps in your calendar with extra hours from Blys customers. Earn up to 75% of massage fees and get paid instantly after a massage.</p><p>- Boss title. You set your own schedule and decide when you'll accept jobs - no obligations.</p><p>- No creeps. We collect personal details of all Blys customers + verify customers’ credit card before we confirm a booking so you can feel safe and confident when taking appointments.</p><p>- A better you. We collect feedback from our customers and share them with you - to help you improve your service over time.</p><p>- Chance to kickstart your career. If you’re an up-and-coming massage therapist with qualifications and seeking hands-on experience, Blys is the perfect platform for you.</p><p>-----------------</p><p>What we are looking for:</p><p>- Cert IV in Massage Therapy (minimum), or Diploma of Remedial (preferred). Membership of industry associations (e.g. AMT) is a bonus.</p><p>- Your own ABN and insurance</p><p>- Your own equipment - massage table, sheets, oil or lotion, music and transportation from/to customers</p><p>- Skills, knowledge and most importantly passion about therapeutic massage.</p><p>- Excellent customer service and communication skills</p><p>- Flexibility and willingness to work various hours, including evenings and weekends</p><p>-----------------</p><p>Apply today via:</p><p><a href='http://www.getblys.com.au/apply' rel='nofollow'>www.getblys.com.au/apply</a></p></div>",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 1:25:54 AM",
    "tags": [
      "Australia",
      "Certified Massage Therapist",
      "Contract",
      "Massage Therapy",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "PJUUDKZqSYaF_GOy2s4v-Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16748028",
    "title": "HashiCorp | Security & Risk Analyst | Remote (US) | Full Time",
    "content": "<div>                  <span>HashiCorp | Security &amp; Risk Analyst | Remote (US) | Full Time<p>Join our growing Security Team at HashiCorp as a Security &amp; Risk Analyst.  We're looking for an ambitious, high-caliber practitioner to support our compliance goals and help scale our internal security processes.  Our Security Team has a huge impact on how we operate every day.  Want to learn more?  Let's talk!</p><p>Apply here: <a href='https://grnh.se/g4fa0inw1' rel='nofollow'>https://grnh.se/g4fa0inw1</a></p><p>About Us - HashiCorp is a company based in San Francisco that solves development, operations, and security challenges in infrastructure so organizations can focus on business-critical tasks.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 10:08:07 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "XJed8_blTqOOoZwfZ_c0QA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16746697",
    "title": "Patent Research Foundation | Front and backend | Full time | Seattle | ONSITE | www.patrf.org",
    "content": "<div>                  <span>Patent Research Foundation | Front and backend | Full time | Seattle | ONSITE | www.patrf.org<p>We are a patent analytics startup in Bellevue, WA with a great culture and a great team. We have veterans of legal, data science, and scientific computing backgrounds. Our goal is to bring rigor to patent anaylitics.</p><p>We're recently funded and looking for senior front and backend engineers. Remote work is ok, but ideally we'd see you in our Bellevue offices relatively frequently.</p><p>The front-end person will help us build our web frontend platform.</p><p>The back-end person will work on our analytics platform, both on building features and helping with research.</p><p>See our website at <a href='http://www.patrf.org' rel='nofollow'>http://www.patrf.org</a> or apply at <a href='http://prf.applytojob.com/apply' rel='nofollow'>http://prf.applytojob.com/apply</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 8:03:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "LOgdZFo0TPyjZ20XpjanRw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16745374",
    "title": "HealthPrize | Software Dev | NYC / Norwalk, CT | REMOTE Full-time | https://www.healthprize.com/",
    "content": "<div>                  <span>HealthPrize | Software Dev | NYC / Norwalk, CT | REMOTE Full-time | <a href='https://www.healthprize.com/' rel='nofollow'>https://www.healthprize.com/</a><p>At HealthPrize, we are changing the way people think about their medication and their health! Our growth is being fueled by work with leading brands in life sciences such as Abbott, Walgreens, and Gilead. Join the close-knit engineering team that designs &amp; develops our industry leading patient engagement platform and work with us to measurably improve the state of healthcare globally.</p><p>Systems Hypewords: AWS (multi-region deployments), Terraform, ECS, Docker, Aurora, HIPAA/PCI Compliance</p><p>Backend Hypewords: Java/Kotlin, Amazon Aurora, Redis, Spring-Boot, Docker, Swagger, API Gateway</p><p>Lead Site Reliability Engineer: <a href='https://healthprize.com/careers-page/#op-208838-lead-systems...' rel='nofollow'>https://healthprize.com/careers-page/#op-208838-lead-systems...</a>.</p><p>Senior Platform Engineer: <a href='https://healthprize.com/careers-page/#op-205414-senior-platf...' rel='nofollow'>https://healthprize.com/careers-page/#op-205414-senior-platf...</a>.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 6:13:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "java"
    ]
  },
  {
    "id": "OtnWZA69R0-YQy55esi33w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16743261",
    "title": "engageSPARK | Cebu, Philippines | ONSITE, REMOTE, FULLTIME, VISA, Code4Good https://www.engageSPARK.com",
    "content": "<div>                  <span>engageSPARK | Cebu, Philippines | ONSITE, REMOTE, FULLTIME, VISA, Code4Good <a href='https://www.engageSPARK.com' rel='nofollow'>https://www.engageSPARK.com</a><p>engageSPARK, a social enterprise, is the world's EASIEST Platform that empowers professionals (marketing, sales, hr, operations, project managers, etc) at NGOs &amp; Businesses to easily &amp; quickly build interactive Automated Phone Calls (IVR) and 2-Way SMS campaigns in any country. We're especially focused on emerging markets, where 66% have no Internet and another 15% who have smartphones can't afford data plans regularly. Interactive automated phone calls are the most cost effective and scalable way to engage anyone anywhere with any mobile phone. People opt in by sending an SMS, doing a Missed Call, sending a FB message or others, which trigger an automated call back to them.</p><p>Customers such as Google, Facebook, Intel, UNICEF, Noora Health (YC W14) Asian Development Bank, International Rescue Committee, Innovations for Poverty Action, MedAir, Mercy Corps, and US Institute for Peace use the engageSPARK platform to interact with people for a variety of use cases, including social change in the areas of Agriculture, Health, Finance, Elections, and Disaster Planning &amp; Response, as well as for sales, marketing, customer feedback, and operations.</p><p>We've recently raised funding by 500 Startups and other investors. Forbes says we're &quot;A Leading Startup&quot; and a &quot;Notable Social Enterprise&quot;. Since launch two years ago, engageSPARK has become the global leader in our space - we've already been used in 125+ countries.</p><p>Adventure Fellowship (1 year): <a href='https://goo.gl/YA8ENR' rel='nofollow'>https://goo.gl/YA8ENR</a>  | You're passionate and interested to work with us? Great, let's talk!</p><p>Our stack: Go (GoLang) Microservices, Python/Django, JavaScript, Docker, Redis, Thrift, PostgreSQL, CouchDB, AWS, Android, Java</p><p>Located in tropical Cebu Island, Cebu City is the second largest city in the Philippines. It’s a safe place to live with a variety of malls, restaurants, shops, beaches, and activities such as scuba diving, running, hiking, rock climbing, and snorkeling. It has a busy international airport with cheap flights to domestic and regional destinations. Check out Google Images: <a href='https://www.google.com/search?safe=off&amp;site=imghp&amp;tbm=isch&amp;source=hp&amp;biw=1104&amp;bih=639&amp;q=cebu+philippines&amp;oq=cebu&amp;sout=0&amp;sa=X' rel='nofollow'>https://www.google.com/search?safe=off&amp;site=imghp&amp;tbm=isch&amp;s...</a></p><p>Email us at Jobs at engageSPARK.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 2:00:07 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/python",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "go",
      "python"
    ]
  },
  {
    "id": "0dOGG0xnTEOASD5EWSnNRg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16742489",
    "title": "Education First, EF Class | London, UK | FULL-TIME | ONSITE or REMOTE | Backend Developer, Devops",
    "content": "<div>                  <span>Education First, EF Class | London, UK | FULL-TIME | ONSITE or REMOTE | Backend Developer, Devops<p>We're a small startup-like team in a big company, building an iOS/Web app to teach English in public schools. Our app has been live for a couple of years now and we're expanding across Europe.</p><p>Our backend stack is AWS-based with lots of python and some golang. We're in the process of moving from EC2 pet servers to docker containers, we're experimenting with moving some functionality to AWS Lambda and planning to try out AppSync next.</p><p>We're looking to expand our technical team with Backend Developers and Devops.</p><p>Here are some job ads and feel free to reach out to me with any questions:<a href='https://careers.ef.com/job/oVpT6fw3/' rel='nofollow'>https://careers.ef.com/job/oVpT6fw3/</a><a href='https://careers.ef.com/job/odt86fwE/' rel='nofollow'>https://careers.ef.com/job/odt86fwE/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 11:00:06 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "nkbH2O-fQOeCDfMf194PRQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16741699",
    "title": "FØCAL | Cambridge/Boston | ONSITE, REMOTE-possible | f0cal.com",
    "content": "<div>                  <span>FØCAL | Cambridge/Boston | ONSITE, REMOTE-possible | f0cal.com<p>---FØCAL---</p><p>Build once. Build everywhere. -- computer-aided design for computer vision.</p><p>Next-generation HPC image processing backplane.</p><p>We have an innovative team and are looking for outstanding contributors in a lot of areas</p><p>- Product manager</p><p>- Developers (web services)</p><p>- Developers (image processing)</p><p>- Developers (compilers)</p><p>Feel free to reach out - email in profile<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 7:00:07 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "8KL4QscdTNeLcBUOQDSZTw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16740791",
    "title": "L4 Research | Cryptoeconomics Researcher | Anywhere | REMOTE | Full-time",
    "content": "<div>                  <span>L4 Research | Cryptoeconomics Researcher | Anywhere | REMOTE | Full-time<p>We're doing research on bleeding-edge protocols that will define the future of the internet. Primarily we are focused on state channels research, but we also want to build a team of deeply motivated researchers to study and contribute to the greater understanding of things like proof of stake, Plasma, zk-SNARKs, and more that you might find on <a href='https://ethresear.ch' rel='nofollow'>https://ethresear.ch</a>.</p><p>We immediately aim to turn our research into practical working implementations and open source frameworks that benefit the entire industry.</p><p>Check out <a href='https://l4.ventures/jobs' rel='nofollow'>https://l4.ventures/jobs</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 4:00:07 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "350iHUPLSFS9vdOQ6gnTcA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16739415",
    "title": "Songspace | Full Time | Remote OK https://songspace.com Songspace is looking to hire developers to join our team to continue to make ...",
    "content": "<div>                  <span>Songspace | Full Time | Remote OK <a href='https://songspace.com' rel='nofollow'>https://songspace.com</a>Songspace is looking to hire developers to join our team to continue to make the music industry better. You will be joining our team of 3 remote developers to implement cutting edge collaboration features in the music industry. While the position is remote friendly, the main office is located in Nashville, TN, USA.<p>We are currently hiring for:</p><p>- Senior Ember.JS Engineer</p><p>- Senior React Native Engineer</p><p>- Data Developer/Architect</p><p>To apply visit <a href='https://songspace.workable.com/' rel='nofollow'>https://songspace.workable.com/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 12:18:06 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "KI8XShJJSK2DExHBQ2PubQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16739157",
    "title": "Infinite Food | Mechanical Design Engineers / Mechanical Engineers | Shenzhen, China | $neg + equity available | Full-time or REMOTE ...",
    "content": "<div>                  <span> Infinite Food | Mechanical Design Engineers / Mechanical Engineers | Shenzhen, China | $neg + equity available | Full-time or REMOTE | <a href='http://8-food.com/' rel='nofollow'>http://8-food.com/</a><p>Early stage Shenzhen-based, Hong Kong registered company with two years of IP seeking talented Mechanical Design Engineers with fluency in Solidworks. Working language is English, Mandarin or regional languages well regarded. Broad range of interesting work focusing on automation and industrial products, rapid prototyping and iteration with supporting electrical, software, logistics and machine learning engineers. Experience with CFD (heat, fluid and airflow modeling), electrical and food safety regulation in any market, production in thermoform, injection molding, blow molding, extrusion well regarded. Private office in Shenzhen (Houhai, near HK/Shenzhen Wan border crossing). Physical presence encouraged but not a daily requirement.</p><p>Mandarin speakers well regarded, but Chinese knowledge is not required. Clear written technical communication in English is mandatory. Skills and experience first, qualifications a distant second. We respect execution.</p><p>Email in profile, please include 'Candidate: Mechanical Engineer' in subject. No recruiters.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 11:53:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "Fbc7McEiRNeZiIHFDW7LFA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16739010",
    "title": "Doctor On Demand | Multiple Engineering and Business Positions | SF, MN, DC | Full-time | REMOTE, INTERNS",
    "content": "<div>                  <span>Doctor On Demand | Multiple Engineering and Business Positions | SF, MN, DC | Full-time | REMOTE, INTERNS<p>Doctor On Demand’s mission is to improve the world’s health through compassionate care and innovation.  We enable anyone to see a Physician, Psychologist or Psychiatrist using their smartphone or computer anytime, anywhere. Four years after launch, we are now one of the leading telemedicine providers in the country and are growing our engineering team.  We have hubs in San Francisco, Minnesota and DC but also have a strong remote work culture with some of our best engineers working remotely full-time from across the US.</p><p>Stack: Python, Django, PostgreSQL, Redis, Celery / RabbitMQ, Angular, Kubernetes (and more)</p><p>More info: <a href='https://doctorondemand.com/about-us/careers' rel='nofollow'>https://doctorondemand.com/about-us/careers</a></p><p>Full-time applications: <a href='https://www.doctorondemand.com/jobs' rel='nofollow'>https://www.doctorondemand.com/jobs</a> (use Other -&gt; Hacker News as the source)</p><p>Internship applications: Fill out this form (<a href='https://goo.gl/forms/HGeKs5RVfMnQHooC2' rel='nofollow'>https://goo.gl/forms/HGeKs5RVfMnQHooC2</a>) and submit your resume to eng-interns@doctorondemand.com.</p><p>Full-time Questions? hn@doctorondemand.com</p><p>Internship Questions? eng-interns@doctorondemand.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 11:34:07 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/python",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend",
      "python"
    ]
  },
  {
    "id": "kT64XUBGScuy_iDTlNe0kQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16738369",
    "title": "KEA | Bay Area | NLP, Telephony, Signal Processing | Full-time & interns, remote + onsite (preferred) | Python / Haskell | 4+ years of experience",
    "content": "<div>                  <span>KEA | Bay Area | NLP, Telephony, Signal Processing | Full-time &amp; interns, remote + onsite (preferred) | Python / Haskell | 4+ years of experience<p>KEA is a voice recognition platform that processes and places orders automatically for merchants when customers call in. We seamlessly transforms incoming speech into tickets fed directly into businesses’ POS systems.We are looking for Haskell / Python 3 folks for building speech recognition phone systems for businesses. Email us at emily@kea.ai</p><p>Equity options / market salary / accommodation</p><p><a href='https://kea.ai' rel='nofollow'>https://kea.ai</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 10:35:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "iS8rgOHkQWWUVeN1o0qx_w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16738015",
    "title": "CleanBrowsing | Remote | Contract, Maybe full time CleanBrowsing is building a safe, fast & easy to use DNS-based parental control ...",
    "content": "<div>                  <span>CleanBrowsing | Remote | Contract, Maybe full time<p>CleanBrowsing is building a safe, fast &amp; easy to use DNS-based parental control solution for families, parents and schools. We already offer a free Anycast DNS available on our site: <a href='https://cleanbrowsing.org' rel='nofollow'>https://cleanbrowsing.org</a> and we are expanding it.</p><p>Looking to fill a few positions:</p><p></p><pre><code>  * PHP Frontend developer  * Frontend designer (HTML, CSS - PHP a plus)  * C developer</code></pre>We don't have a career page up yet, but if interested, email us at cleanbrowsing@noc.org so we can chat.<span>              </span><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 10:03:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "6XWrDhyLTf2JF9jFh1UF3w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16737788",
    "title": "BRAINSCALE | Cloud Application Developer | FULL-TIME | BANGALORE, IN | www.brainscale.com",
    "content": "<div>                  <span>BRAINSCALE | Cloud Application Developer | FULL-TIME | BANGALORE, IN | www.brainscale.com<p>A Microsoft Gold partner, BrainScale is competent in providing the following services.</p><p></p><pre><code>  -Azure enterprise architecture.  -Workload migration from on-premises data centers in Azure.  -DR as a Service.  -SaaS application development / application re-writes using Azure PaaS.</code></pre>We work with several Fortune-500 customers in the above areas.We are looking to hire a solid Cloud Application Developer who can help in new application development / application migration using Microsoft Azure PaaS services.<p>Qualifications:</p><p></p><pre><code>  -Requires at least 4 years C# programming experience.  -Requires minimum of 2 years of experience in Cloud application development using Microsoft Azure PaaS/IaaS services.  -Knowledge of Design Patterns. Ability to think design for a given problem.  -UI/UX experience preferred but not a requirement.  -Prior experience in application performance tuning will be added advantage.</code></pre>Desired Soft Skills:<p></p><pre><code>  -Ability to handle a variety of projects simultaneously.  -Must be self-starter and a team player.  -Ability to work effectively with other teams.  -Experience working with globally distributed team is preferred.  -Excellent customer service attitude, communication skills (written and verbal), and interpersonal skills.</code></pre>Please send your resumes / LinkedIn profiles to jobs@brainscale.com<span>              </span><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 9:45:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "EQa1hVwIRs62cfTLbUajzQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16737533",
    "title": "GitHub | San Francisco, CA (HQ); Boulder, CO; Amsterdam; Tokyo; Remote (65%) | Onsite and Remote-OK | https://github.com GitHub ...",
    "content": "<div>                  <span>GitHub | San Francisco, CA (HQ); Boulder, CO; Amsterdam; Tokyo; Remote (65%) | Onsite and Remote-OK | <a href='https://github.com' rel='nofollow'>https://github.com</a><p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over 27 million people use GitHub to build amazing things together across 67 million repositories. With the collaborative features of GitHub.com and GitHub Business, it has never been easier for individuals and teams to write faster, better code.</p><p>To learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: <a href='https://www.keyvalues.com/github' rel='nofollow'>https://www.keyvalues.com/github</a></p><p>Open positions include: Application Engineer, Community and SafetyGit Ecosystem EngineerSenior Engineer, Developer ExperienceSenior Integrations EngineerPartner Engineering ManagerQuality EngineerSenior Engineering Leader - Machine Learning</p><p>All roles are remote-friendly!</p><p>If you are interested in any of these positions, please feel free to contact kirstenwright@github.com to learn more or apply online at www.github.com/about/careers.</p><p>Tech Stack: GitHub is a Rails 4 application that is composed of a large monolith and a constellation of services written in Ruby, Go, and a handful of other languages.  The app and its services are exposed both internally and externally via a GraphQL API.  We primarily rely on MySQL for persistent storage, Redis for temporary storage, and, as you might expect, a lot of git repositories.  We rely on Kubernetes for container orchestration.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 9:25:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/ruby",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "ruby"
    ]
  },
  {
    "id": "Pl73aA66RkC2nnwk7mOizA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16736783",
    "title": "Take a stab at our little challenge and ensure your CV gets reviewed by our team: https://challenge.curbside.com Curbside ...",
    "content": "<div>                  <span>Take a stab at our little challenge and ensure your CV gets reviewed by our team: <a href='https://challenge.curbside.com' rel='nofollow'>https://challenge.curbside.com</a>Curbside is enabling a new way to shop, built for the era of instant mobile commerce. The Curbside app makes it easy to find, buy and pickup products at nearby stores. Curbside searches realtime local inventory across retailers and uses location-based technologies to alert stores when a customer is arriving for a pickup. Curbside helps consumers quickly get what they need and helps retailers better serve their increasingly mobile centric customers. The Curbside Merchant Console enables alerts to staff as customers arrive to pick up orders and also manages online order workflow.<p>Curbside’s investors include Sutter Hill Ventures, Index Ventures, Jerry Yang’s AME Cloud Ventures, Qualcomm Ventures, Eric Schmidt’s Innovation Endeavors, O’Reilly AlphaTech Ventures, Gil Elbaz &amp; David Waxman’s TenOneTen and Chicago Ventures.</p><p>Tech Stack: Clojure, Python, Javascript, iOS, Android, Elasticsearch</p><p>Problem space: mobile commerce, big data, search, machine learning, reverse engineering, distributed systems, location services, user experience.</p><p><a href='https://curbside.com/jobs' rel='nofollow'>https://curbside.com/jobs</a> • Palo Alto, Ca. • Relocation Available • Sorry at this time we cannot sponsor NEW H-1B’s, but we can transfer existing visa’s and sponsor new E3’s, TN’s, and O-1’s.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 8:30:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "cKPI58tETjWJ4lyWPdBsuw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16736118",
    "title": "Rainforest | San Francisco (HQ) and Remote | Onsite or Remote | https://www.rainforestqa.com",
    "content": "<div>                  <span>Rainforest | San Francisco (HQ) and Remote | Onsite or Remote | <a href='https://www.rainforestqa.com' rel='nofollow'>https://www.rainforestqa.com</a><p>Rainforest combines a massive crowd of human testers with algorithmic management and VMs to execute web and mobile regression testing for continuous deployment. The best dev teams from companies like Intuit, Consumer Affairs, Oracle, and IBM use Rainforest’s platform and API to execute and scale their QA activities more effectively.</p><p>To learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: <a href='https://www.keyvalues.com/rainforest' rel='nofollow'>https://www.keyvalues.com/rainforest</a></p><p>Here are our open roles:</p><p>- Data Science Generalist: <a href='https://jobs.lever.co/rainforest/e7eab367-cae8-4e7b-8642-e7b66c4c00bb?ref=keyvalues' rel='nofollow'>https://jobs.lever.co/rainforest/e7eab367-cae8-4e7b-8642-e7b...</a></p><p>- Engineering Operations Manager: <a href='https://jobs.lever.co/rainforest/4a4e200d-42d5-4f23-a1d5-83250530f7ce?ref=keyvalues' rel='nofollow'>https://jobs.lever.co/rainforest/4a4e200d-42d5-4f23-a1d5-832...</a></p><p>- Senior Operations Engineer: <a href='https://jobs.lever.co/rainforest/d50cd6e9-7432-491b-83d8-51e0165c0206?ref=keyvalues' rel='nofollow'>https://jobs.lever.co/rainforest/d50cd6e9-7432-491b-83d8-51e...</a></p><p>- Front End Engineer: <a href='https://jobs.lever.co/rainforest/6c8be2c4-b5b8-45c7-a274-f09a67f93b91?ref=keyvalues' rel='nofollow'>https://jobs.lever.co/rainforest/6c8be2c4-b5b8-45c7-a274-f09...</a></p><p>Tech Stack: Ruby, Rails, Grape, Go, Redis, Postgres, QueueClassic, GraphQL, React with redux, KVM, Puppet, Heroku, AWS</p><p>Thanks! Sarah<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 7:36:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TECH1/ruby",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "frontend",
      "ruby"
    ]
  },
  {
    "id": "JViINqE6QLiKKl5ZnNFfhQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16736037",
    "title": "SingleOps | Fullstack Engineer | Atlanta, GA | REMOTE, Full-time | https://singleops.com/careers/ SingleOps is a rapidly growing, Atlanta based, SaaS platform ...",
    "content": "<div>                  <span>SingleOps | Fullstack Engineer | Atlanta, GA | REMOTE, Full-time | <a href='https://singleops.com/careers/' rel='nofollow'>https://singleops.com/careers/</a>SingleOps is a rapidly growing, Atlanta based, SaaS platform for mobile field workforces like tree care services, landscaping, pest control, healthcare — anyone who regularly coordinates employees in the field. The platform combines estimates, scheduling, time tracking, CRM, invoicing, and QuickBooks syncing with a mobile-first interface for teams on the go. Think of it as a cloud-ERP solution like NetSuite, but much easier to use and geared towards field service companies.We've found or niche in the Green space and are looking to scale and double our entire team this year. We use a Ruby on Rails stack, and this year we're transitioning to React as well as hopefully React Native for mobile.We're looking for a Fullstack Web Application Engineer, as well as other sales, marketing and customer success positions. You can fill out the form at <a href='https://singleops.com/careers/' rel='nofollow'>https://singleops.com/careers/</a> or email me directly at adam@singleops.com<span>              </span><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 7:29:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "wGrS9DgPSvq0-6-wsjhbTA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16735877",
    "title": "vVents | Backend, FullStack, Frontend developers, Interns (paid) | India | Full Time | REMOTE",
    "content": "<div>                  <span>vVents | Backend, FullStack, Frontend developers, Interns (paid) | India | Full Time | REMOTE<p>We are building a live video streaming platform and several other functionalities around it. Our backend/streaming team uses several custom and open source media and streaming servers. We are currently hiring people for following open positions.</p><p>1. Backend Engineer (ES6/NodeJS/MongoDB/PostgreSQL) - Experience in NodeJS is necessary and should be able to work with APIs fluently. Also, experience with MongoDB, PostgreSql, Docker, Azure/AWS, Jenkins is required. (Exp 3+ years needed) - 2 Positions</p><p>2. Fullstack Engineer (ES6/NodeJS/ReactJS) - Experience in ReactJS is absolutely necessary along with NodeJs, PostgreSql, MongoDB. (Exp 3+ years needed) - 2 Positions</p><p>3. Frontend Engineer (ES6/ReactJS/ReactNative) - Experience in ReactJS + Redux and React Native + Redux is absolutely necessary along with other frontend related technologies. (Exp 3+ years needed) - 2 Positions</p><p>4. Intern(s) (paid) - We're hiring interns with one goal, to nurture them and employ them full time if they excelled in their internship period. This role has no specific stack attached to it. But we atleast expect that interns should know how to code in JS, HTML/CSS and should have strong computer science fundamentals. Also, this position if selected will require you to work for specific time period. On completion of that time period then full time employment will be considered. Also, expect 50% learning and 50% working. We won't be teaching you entire stuff but guide you on the path. This role is remote as well.</p><p>We offer a competitive salary based on your experience and all other benefits. Salary is no bar for the right candidate.</p><p>To apply, please send your resumes/cv at hnapr@vvents.anyalias.com . Do add [HN-APR] in the title.</p><p>Note: There are multiple positions for each role. Please apply only if you suffice the requirements and are based out of India.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 7:16:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "ubmzHEJFT5u7pTixaWoqjA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16735389",
    "title": "Second Measure (YC S15) | SF Bay Area - San Mateo, CA (downtown) | ONSITE/REMOTE | https://secondmeasure.com ---- Second Measure analyzes ...",
    "content": "<div>                  <span>Second Measure (YC S15) | SF Bay Area - San Mateo, CA (downtown) | ONSITE/REMOTE | <a href='https://secondmeasure.com' rel='nofollow'>https://secondmeasure.com</a><p>----</p><p>Second Measure analyzes billions of credit card transactions to answer real-time questions about consumer behavior.</p><p>Through our self-service analytics platform, we help our clients – some of the world’s largest brands and investment firms – answer questions like:</p><p></p><pre><code>  - Is Lyft gaining or losing market share in NYC? [1]  - What's going on in the meal-kit space? [2]  - How dependent is Stitch Fix on its biggest spenders? [3]  - (Check out our research blog [3])</code></pre>We’re 30 people today - mostly senior engineers and data scientists. Two-thirds of us are technical, more than half with PhDs.<p>We’re looking for other strong builders, especially those who can grow into leadership roles:</p><p></p><pre><code>  - Lead Infrastructure Engineer  - Senior Software Engineer (backend/frontend/data) - REMOTE OK  - Senior Product Designer  - Senior Data Scientist  - (more)</code></pre>I'm a founder (mike@). Apply directly [4] or email jobs@ and CC me.<p>[1] <a href='http://www.sfchronicle.com/business/article/Lyft-gets-boost-from-Uber-s-travails-11262651.php' rel='nofollow'>http://www.sfchronicle.com/business/article/Lyft-gets-boost-...</a></p><p>[2] <a href='https://www.theinformation.com/data-suggest-more-trouble-ahead-for-blue-apron' rel='nofollow'>https://www.theinformation.com/data-suggest-more-trouble-ahe...</a></p><p>[3] <a href='http://blog.secondmeasure.com/2017/12/07/whales/' rel='nofollow'>http://blog.secondmeasure.com/2017/12/07/whales/</a></p><p>[4] <a href='https://boards.greenhouse.io/secondmeasure' rel='nofollow'>https://boards.greenhouse.io/secondmeasure</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 6:32:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "thgufiAOTLKwV6h2O8MmfA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30471?r=rss2",
    "title": "Qkids: Online English Teacher - Work from home",
    "content": "<p>Part-time</p><p><strong>(Anywhere)</strong> </p><div><p><strong>Online English Teacher, </strong><strong>p</strong><strong>art</strong><strong>-</strong><strong>time</strong><strong>, work from home</strong></p><p></p></div><div><p><strong>Employment type</strong>: Contract, part-time</p><p><strong>Duration</strong>: Flexible</p><p><strong>Start date</strong>: ASAP</p><p><strong>Location</strong>: Remote, online</p><p><strong>Hours</strong>: 6-19 hours/week</p><p><strong>Rate</strong>: $16-20 USD/hr&nbsp;(2 lessons)</p></div><p><strong><u>About Qkids</u></strong><u></u></p><p>Qkids is an interactive online teaching platform that connects English teachers to young language learners with fun, user-friendly software in real time. Guiding learners through a curriculum of fun, dynamic, and engaging narrative gaming adventures, English teachers from the United States and Canada lead learners to English mastery from the comfort of their own homes. Qkids provides great support and incredible workplace flexibility that caters to any schedule. Join today! <a href='https://www.facebook.com/JoinQkids/' rel='nofollow'><u>https://www.facebook.com/JoinQkids/</u></a>&nbsp;</p><p><strong><u>Responsibilities</u></strong><u></u></p><p>-Teach English to learners between 5 - 12 years of age through Qkids’ interactive online teaching&nbsp;platform. Each in-lesson time is 30 minutes.&nbsp;All curricula are preset and incorporated with animated characters and games. Training and&nbsp;support provided. </p><p>-Available to teach a minimum of 6 hours (12 lessons) per week. There are 19 hours (38 lessons) available weekly.</p><p><strong>[</strong><strong>Qkids</strong><strong>&nbsp;class time slots]</strong></p><p>7 days a week - Morning Eastern Time (AM - EST): 6:40-7:10, 7:20-7:50, 8:00-8:30, 8:40-9:10</p><p>Plus Friday and Saturday - Night Eastern Time (PM&nbsp;-&nbsp;EST): 8:40-9:10, 9:20-9:50, 10:00-10:30, 10:40-11:10, 11:20-11:50</p><p><strong><u>Requirements</u></strong><u></u></p><p>- Eligible to legally work in the U.S. or Canada</p><p>- Earned a degree or currently enrolled in a university program</p><p>- Prior teaching experience or equivalent in education, tutoring, mentoring, schooling&nbsp;preferred. This can be any form of teaching related, such as homeschooling. </p><p><strong><u>Hiring Process</u></strong><u></u></p><p>Apply with all required materials - Initial screening - Demo Interview 1 - Demo Interview 2 - Trial Classes (paid) - Hired! </p><p><strong><u>Follow Qkids</u></strong></p><p>Website: <a href='http://teacher.qkids.net/' rel='nofollow'><u>http://teacher.qkids.net/</u></a>&nbsp;</p><p>Facebook&nbsp;: <a href='https://www.facebook.com/JoinQkids/' rel='nofollow'><u>https://www.facebook.com/JoinQkids/</u></a>&nbsp;</p><p>LinkedIn&nbsp;: <a href='https://www.linkedin.com/company/qkids.net/' rel='nofollow'><u>https://www.linkedin.com/company/qkids.net/</u></a> </p><p>Glassdoor&nbsp;: <a href='https://www.glassdoor.com/Reviews/QKids-Reviews-E1339997.htm' rel='nofollow'><u>https://www.glassdoor.com/Reviews/QKids-Reviews-E1339997.htm</u></a>&nbsp;</p><p>Blog&nbsp;: <a href='http://www.qkidsblog.com/' rel='nofollow'><u>http://www.qkidsblog.com/</u></a>&nbsp;</p><p><em>This opportunity: Contract, Part</em><em>-</em><em>time, Work from home, </em><em>remote, </em><em>Online, Work online, Tutor, English Teacher, Students</em><em>, stay at home, qkids, teach online</em></p><p></p><p><strong>Questions? </strong><a href='http://teacher.qkids.net/faq' rel='nofollow'><strong><u>http://teacher.qkids.net/faq</u></strong></a><strong> </strong></p><p></p><p><strong>Job Perks:</strong> Work from home, part-time and flexible schedule.</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Mar 26, 2018 6:54:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/unknown",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone",
      "undefined job title"
    ],
    "tagsNames2": [
      "gamedev"
    ]
  },
  {
    "id": "YF96kuydSySjfJ3lF7v7fw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/67355/part-time-it-opportunity-at-an-exciting-sport-travel-startup-at-fixture-travel/",
    "title": "Part-time IT opportunity at an exciting sport travel startup",
    "content": "Great opportunity for talented and passionate IT person.<br /><br />Do you want to help drive significant growth at an early stage start-up? Then this is a unique opportunity to develop and expand your skills through a diverse range of tasks in an incredibly exciting environment.<br /><br />We are looking for an experienced developer who is interested in a one to two days a week opportunity based on a fixed day rate. We are located in Central London, however remote work is possible as well. You would have great freedom and control over your work and would be supported by one IT intern. <br /><br />You would be involved in all IT projects for the business from back-end to front-end development. It necessary to be familiar with the following:<br /><br />• Understanding of OOP (object-oriented programming)<br />• PHP and Symfony experience<br />• Basic front-end coding skills (CSS, HTML, Javascript)<br />• Basic Linux terminal skills<br />• Git skills<br />• Basic database skills, ideally MySQL<br />• Understanding of TDD (test-driven development)<br /><br />If you are interested in this excellent opportunity then please send us your CV and tell us why you would like to join our company. fixturetravel.com<br />",
    "urlFetchPending": false,
    "published": "Mar 22, 2018 4:25:11 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/unknown",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "zKHu5Vx0T7mxugwNfsvJfQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/167792/iot-security-consultant-f-m-proemion?a=UgSsH64ZsOs",
    "title": "IoT Security Consultant (f/m) at PROEMION (Fulda, Deutschland) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Services, Information Technology, Telematics</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Privat</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We give our customers the technology they need to globally transmit and analyze CAN-based telemetry data of mobile industrial machinery and therefore boost their efficiency. Some of the world's most respected OEMs rely on Proemion and thousands of off-road vehicles use our solution daily.</p><p>Proemion is at the forefront of the IoT/Telematics revolution and is looking for an <strong>IoT&nbsp;Security&nbsp;Consultant</strong> <strong>(f/m).</strong> We offer the position on-site in <strong>Fulda</strong>, <strong>Germany</strong> (relocation support offered) at the earliest possible date. We also offer the position as a full-time remote position.</p><p><strong>Your Role</strong></p><ul><li>comprehensively assess system properties from a security point of view</li><li>guide technical, architectural and design decisions to ensure they will not weaken the overall system security or leave us prone to inadequate risks</li><li>identify and document application level vulnerabilities and ensure risks are being addressed</li><li>communicate identified vulnerabilities and develop mitigation strategies</li><li>recommend deployment strategies and parameters</li><li>recommend and facilitate security training for our staff</li><li>proactively identify opportunities for improvements in application security</li><li>conduct security testing and penetration tests.</li></ul><p><strong>Your Skills</strong></p><ul><li>Computer Science degree or equivalent qualification</li><li>several years of relevant work experience in security architecture and engineering</li><li>experience in application software planning, development and integration</li><li>experience in identifying, evaluating and managing risk in a complex and changing environment</li><li>intimate familiarity with existing security protocols</li><li>deep understanding of the operational implications of security hardening</li><li>experience with networking (IP Routing, DNS, reverse Proxying)</li><li>ability to grasp new concepts quickly, self-starting, self-managing</li><li>you value reliability and advancement of team</li></ul>                    </div>                            <h2>                About PROEMION            </h2>            <div><p><strong>Our offer</strong></p><ul><li>independent work in a performance-oriented and challenging atmosphere</li><li>short lines of communication and flat hierarchies foster an open working environment</li><li>modern premises right in the middle of Germany featuring lounge, kicker-table, pool table, team events, additional allowance for “Fitness Insel” and childcare, flextime and further amenities</li></ul><p><strong>About Proemion</strong></p><p>Since 1987 Proemion has delivered CAN devices and connectivity solutions for the most demanding industrial applications. The world’s most respected industrial equipment companies rely on Proemion, to design and build top-notch telematics solutions that enhance performance and safety. On the embedded side, we manufacture telematics devices to collect and transmit CAN-based telemetry data. On the web services side, we use the latest Big Data technologies to process, analyze, and serve billions of data points through our APIs and web portal.</p><p><strong>Ready for the challenge?</strong></p><p>We look forward to your application via our career portal <strong>career.proemion.com </strong>or via mail (<strong><a href='mailto:career@proemion.com' rel='nofollow'>career@proemion.com</a></strong>)!</p><p><strong>Let’s build something great together!</strong></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive salary                            </div>                            <div>                                 Billiard table                            </div>                            <div>                                 Mentoring programm                            </div>                            <div>                                 Modern development environment                            </div>                            <div>                                 Team events                            </div>                            <div>                                 Sport sponsoring                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/embedded",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "c",
      "embedded"
    ]
  },
  {
    "id": "APYnBUjISmi3kPIPm_KS2Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "smashingmagazine.com",
    "url": "https://www.smashingmagazine.com/2018/03/tips-conducting-usability-studies-participants-disabilities/",
    "title": "Tips For Conducting Usability Studies With Participants With Disabilities",
    "content": "        Tips For Conducting Usability Studies With Participants With Disabilities — Smashing Magazine                                                                                  <div></div>  <a rel='nofollow'>Skip to main content</a>  <a rel='nofollow'>Start reading the article</a>  <a rel='nofollow'>Jump to list of all articles</a>        <div>                <div>            <div>    <a title=&quot;← Back to the homepage&quot; rel='nofollow'>                                            </a></div>            <div>                  <a rel='nofollow'>        Search        Topics            </a>              <div>                    <ul>                                                                                                  <li>                    <a rel='nofollow'>                                                    <span>                                                            </span>                                                          <h3>                                <span>Articles <span>.</span></span>                              </h3>                              <p>Design &amp; development</p>                                                                        </a>                </li>                <li>                    <a rel='nofollow'>                                                    <span>                                                            </span>                                                          <h3>                                <span>Books <span>.</span></span>                              </h3>                              <p>Physical &amp; digital books</p>                                                                        </a>                </li>                <li>                    <a rel='nofollow'>                                                    <span>                                                            </span>                                                          <h3>                                <span>Events <span>.</span></span>                              </h3>                              <p>Conferences &amp; workshops</p>                                                                        </a>                </li>                <li>                    <a rel='nofollow'>                                                    <span>                                                            </span>                                                          <h3>                                <span>Jobs <span>.</span></span>                              </h3>                              <p>Find work &amp; employees</p>                                                                        </a>                </li>                <li>                    <a rel='nofollow'>                                                    <span>                                                            </span>                                                          <h3>                                <span>Membership <span>.</span></span>                              </h3>                              <p>Webinars &amp; early-birds</p>                                                                        </a>                </li>                <li>                    <a rel='nofollow'>                        Browse All Topics                    </a>                </li>            </ul>        </div>            </div>            <div>    <div>                    <div>                                    <a rel='nofollow'>                                    Clear Search                                                </a>        </div>                <div>        <a href='https://www.algolia.com/' rel='nofollow'>                    </a>    </div></div>    <div></div>    <div>    <h5>Browse All Topics</h5>    <ul>              <li>            <a rel='nofollow'>Accessibility</a>        </li>              <li>            <a rel='nofollow'>Android</a>        </li>              <li>            <a rel='nofollow'>Animation</a>        </li>              <li>            <a rel='nofollow'>Apps</a>        </li>              <li>            <a rel='nofollow'>CSS</a>        </li>              <li>            <a rel='nofollow'>Design</a>        </li>              <li>            <a rel='nofollow'>Design Patterns</a>        </li>              <li>            <a rel='nofollow'>Design Systems</a>        </li>              <li>            <a rel='nofollow'>E-Commerce</a>        </li>              <li>            <a rel='nofollow'>Freebies</a>        </li>              <li>            <a rel='nofollow'>Graphics</a>        </li>              <li>            <a rel='nofollow'>HTML</a>        </li>              <li>            <a rel='nofollow'>Illustrator</a>        </li>              <li>            <a rel='nofollow'>Inspiration</a>        </li>              <li>            <a rel='nofollow'>iOS</a>        </li>              <li>            <a rel='nofollow'>JavaScript</a>        </li>              <li>            <a rel='nofollow'>Mobile</a>        </li>              <li>            <a rel='nofollow'>Pattern Libraries</a>        </li>              <li>            <a rel='nofollow'>Performance</a>        </li>              <li>            <a rel='nofollow'>Photoshop</a>        </li>              <li>            <a rel='nofollow'>Plugins</a>        </li>              <li>            <a rel='nofollow'>React</a>        </li>              <li>            <a rel='nofollow'>Responsive Web Design</a>        </li>              <li>            <a rel='nofollow'>Service Workers</a>        </li>              <li>            <a rel='nofollow'>Sketch</a>        </li>              <li>            <a rel='nofollow'>Typography</a>        </li>              <li>            <a rel='nofollow'>UI</a>        </li>              <li>            <a rel='nofollow'>Usability</a>        </li>              <li>            <a rel='nofollow'>User Experience</a>        </li>              <li>            <a rel='nofollow'>Wallpapers</a>        </li>              <li>            <a rel='nofollow'>Web Design</a>        </li>              <li>            <a rel='nofollow'>WordPress</a>        </li>              <li>            <a rel='nofollow'>Workflow</a>        </li>          </ul></div>                                                    <div>                <div>                                  </div>              </div>                        <span>Seriously, red? <span>Switch contrast</span></span>          </div>          </div>                                                            <div>                <div>                                  </div>              </div>                        <span>Seriously, red? <span>Switch contrast</span></span>              </div>          <div>        <div>            <div>                    <a rel='nofollow'>        <div>            <div>                <div></div>            </div>        </div>    </a>            <h4>About The Author</h4>        <p>            Peter McNally&nbsp;is a Senior UX Consultant at the <a href='https://www.bentley.edu/centers/user-experience-center/' rel='nofollow'>User Experience Center</a> at Bentley University. Pete has more than 20 years’ experience in usability, information …            <a rel='nofollow'>More about <span>Peter</span>…</a>        </p>                                        <ul>                        <li>                                                            <span>March</span>              12, 2018                                                </li>                        <li>                            <span><a rel='nofollow'>                                <span>Leave a comment</span>                            </a></span>                        </li>                    </ul>                    <h2>Tips For Conducting Usability Studies With Participants With Disabilities</h2>                    <ul>                                      <li>                              <a rel='nofollow'>User Experience</a>                <span>                                    <span>(</span>                                    202                                    <span> articles )</span>                                </span>                          </li>                                      <li>                              <a rel='nofollow'>Usability</a>                <span>                                    <span>(</span>                                    128                                    <span> articles )</span>                                </span>                          </li>                                      <li>                              <a rel='nofollow'>Testing</a>                <span>                                    <span>(</span>                                    42                                    <span> articles )</span>                                </span>                          </li>                                </ul>                    <div></div>                            </div>            <div>                                <div> <div>  <ul>    <li>        Summary    </li>    <li>        Table of Contents    </li>      </ul></div>    <div>        <h6>Quick Summary</h6>        <p>                                            Including more diversity into your usability testing is vital for any product. Here are a number of things you need to consider when planning and executing usability testing with participants with disabilities.                            </p>    </div>    <div>        <h6>Table of Contents</h6>        <div></div>    </div></div>        <div>  <div>    <div>      <a rel='nofollow'></a>    </div>      <div>      <h3>Members support Smashing</h3>    </div>  </div>  <p><em>Wonderful</em>, friendly people who keep this lil' site alive — and <strong>get smarter</strong> every&nbsp;day.</p>  <a rel='nofollow'>Are you smashing, too?&nbsp;→</a></div>                   </div>            <div>                <div>    </div>                <p>Over the last few years, I ran several usability studies with participants with various disabilities. I thought it would help others if I shared some of my experiences. </p><p>In this article, I provide lessons learned or tips to consider in planning and executing usability testing with participants with disabilities. The lessons learned are divided into general that can apply to all types of disabilities; and <strong>lessons learned for three specific disability categories</strong>: visual, motor, and cognitive. These tips will help you regardless where you work: If you work with an established user research team where usability testing is part of your design process or if you work on your own with limited resources but want to improve the quality of the user research by expanding the diversity of participants.</p>    <a href='https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3bae7324-5624-45c7-9d88-ddf5286ae184/figure1.png' rel='nofollow'>            </a>                        Windows 10 high contrast mode of Google.com. (<a href='https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3bae7324-5624-45c7-9d88-ddf5286ae184/figure1.png' rel='nofollow'>Large preview</a>)            <h4>Background</h4><p>Several of our clients from a state government agency to several fortune 500 companies came to us at the <a href='https://www.bentley.edu/centers/user-experience-center' rel='nofollow'>User Experience Center (UXC)</a> for help with their websites. They wanted to make sure users with disabilities could access their site and accomplish their goals.</p><p>There are many different kinds of disabilities, however, there is a general agreement to categorize people with disability into four general categories: <strong>visual</strong>, <strong>auditory</strong>, <strong>motor</strong> (also referred to as &quot;physical&quot;), and <strong>cognitive</strong>. There are different conditions and much variability within each category, e.g., within visual disabilities, color blindness, low vision, and blindness. There is also a distinction as to when a disability is contracted, e.g., a person who was born blind as opposed to one who lost vision later on in life.</p>    <div>      <div>    <p>Getting the process <em>just</em> right ain't an easy task. That's why we've set up <strong>'this-is-how-I-work'-sessions</strong> — with smart cookies sharing what works really well for them. A part of the <a rel='nofollow'>Smashing Membership</a>, of course.</p>      <a rel='nofollow'>        Explore features&nbsp;→      </a>      </div>      <div>        <a rel='nofollow'>        <div>                  </div>      </a>      </div>    </div>  <div><p>Furthermore, as we age or encounter unique situations (such as multi-tasking), we may have a similar experience to people we think of as disabled. Therefore, disabilities should be thought of as a spectrum of abilities that should be accounted for during the design of all user interfaces and experiences.</p><p>Typically, in order to ensure that disabled people can use their digital products and services, companies aim for compliance with accessibility guidelines such as the <a href='https://www.w3.org/WAI/intro/wcag' rel='nofollow'>Web Content Accessibility Guidelines (WCAG 2.0)</a>. While this is critical, it is also important to have users with disabilities try to accomplish real tasks on the site in usability testing. There may be gaps in the overall user experience...</p><p>Think about the typical doors found in buildings. How many times have you tried to open a door one way and realized they actually open the other, for example, push instead of pull. Technically the door is accessible, but it is usable?</p>    <a href='https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a7903b77-df22-4dd7-9749-946c87ff8c14/example-pull-doors.png' rel='nofollow'>            </a>                        Example of doors that are technically accessible, but not usable (handles give impression you should push but must pull to open). (<a href='https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a7903b77-df22-4dd7-9749-946c87ff8c14/example-pull-doors.png' rel='nofollow'>Large preview</a>)            <blockquote><p><a href='http://twitter.com/share?text=Even%20if%20a%20site%20follows%20the%20accessibility%20guidelines%20and%20is%20technically%20accessible,%20users%20may%20not%20be%20able%20to%20accomplish%20their%20goals%20on%20the%20site.&amp;url=https://www.smashingmagazine.com/tips-conducting-usability-studies-participants-disabilities' rel='nofollow'>Even if a site follows the accessibility guidelines and is technically accessible, users may not be able to accomplish their goals on the site.</a></p></blockquote><h4>Lesson Learned</h4><p>In most ways, usability testing with this segment of the population is no different than testing with anyone else. However, there are several areas you need to pay just a bit more attention to so your sessions run smoothly. The lessons or tips are broken down into general ones that can apply to all participants and specific tips for various disability types such as visual, motor, and cognitive.</p><h5>General Lessons Learned</h5><h6>1. Ensure a baseline level of accessibility before usability testing</h6><p>Ensure a baseline level of accessibility before usability testing: Planning usability testing, especially recruiting participants can take time both for the project team and the recruited participants.</p><p>Two good examples of basic accessibility issues that should be addressed prior to usability testing are:</p><ul><li><strong>Missing alternative (alt) text</strong>.<br>Usability testing can be used to see if the alt text used is appropriate and makes sense to participants, but if all the participants are doing is confirming that the alt text is missing then this is not a good use of their time.</li><li><strong>Appropriate color contrast</strong>.<br>All page designs should be reviewed beforehand to make sure all foreground and background colors meet WCAG 2.0 AA color contrast ratios.</li></ul><h6>2. Focus the recruiting strategy</h6><p>If you work with an external recruiter ask them if they have experience recruiting people with disabilities; some do. If you are recruiting internally (without an external recruiter), you may need to reach out to organizations that have access to people with disabilities. For example, if you need to recruit participants with visually disabilities in the United States, you should contact a local chapter of the National Federation of the Blind <a href='https://nfb.org/state-and-local-organizations' rel='nofollow'>(https://nfb.org/state-and-local-organizations)</a> or a local training center such as the Carroll Center for the Blind in Massachusetts <a href='http://carroll.org/' rel='nofollow'>(http://carroll.org/)</a>. If you use social media to advertise your study, a good approach is to use the hashtag <code>#a11y</code> (stands for accessibility — there are 11 letters between the &quot;a&quot; and &quot;y&quot;) in your post.</p><h6>3. Bring their own equipment/assistive technology</h6><p>Allow and encourage participants to bring their own equipment such as their own laptop, especially if they use assistive technology. This way, you can truly see how people customize and use assistive technology.</p><h6>4. Have a backup plan for assistive technology</h6> <p>As stated above in #3. It is best if participants can bring their own equipment. However, it is always wise to plan for the worst, for example, if a participant does not bring their equipment or if there is a technical problem such as you can't connect their equipment to your Wi-Fi network. In the case of visually impaired participants, install assistive technology (AT) such as screen reader software they will be bringing in on a backup PC. For many of the AT software packages, you can get a free trial that should cover you for the usability testing period. This has saved us several times. Even though the configuration was different than what the participants had, we were able to run the session. Participants were quickly able to go into the settings and make some adjustments (e.g., increase the speech rate) and get started with the session.</p>  <div></div><h6>5. Allow additional time</h6> <p>Provide additional time in-between sessions. Typically we like to reserve 30 minutes between participants. However, when participants plan to bring in their own equipment additional time may be required for setting up and resolving any issues that may arise. When testing with individuals with disabilities, we schedule an hour between sessions, so we have extra time for setting up assistive technology and testing it.</p><h6>6. Confirm participant needs</h6><p>Either with the recruiting screener or via email or telephone, confirm what equipment participants will bring in and need to be supplied beforehand. In our lab, we can connect external laptops (that in this case, were outfitted with special accessibility software and settings) to our <a href='http://1beyond.com/' rel='nofollow'>1Beyond system</a> via an HDMI cable. In a recent study, all of our participants' laptops had HDMI ports. However, we forgot to check this beforehand. This is an example of a small but important thing to check to prevent show-stopping issues at the time of the test.</p><h6>7. Consider additional cost</h6><p>Depending on the disability type transportation to the usability testing location may add additional burden or cost. Consider the cost of transportation in the incentive amount. If feasible, consider providing an extra $25-$40 in your incentive amount so participants can take a taxi/Uber/Lyft, etc. to and from your location. Depending on access to public transportation and taxi/ride-sharing rates in your area the amount may vary. Our participants came to the UXC in different ways — some more reliable and timely than others.</p><h6>8. Revise directions</h6><p>Check the directions you provide for accessibility. Make sure they include an accessible path into your building. Test them out beforehand. Do you need to provide additional signage? If so, ensure all signs are clear, concise, and use plain-language directions.</p><h6>9. Review the emergency evacuation plan</h6> <p>Review the plan in the event of a fire or other emergency. Map out the emergency evacuation plan in advance.</p><h6>10. Consider logistics</h6> <p>Consider remote usability testing as an option. One of the benefits of bringing individuals with disabilities into the lab for usability testing is observing first-hand participants' use of the product or website in question. However, the logistics of getting to your location may be just too much for participants. If it's possible to test remotely (we typically do this through Zoom or GoToMeeting), it should be considered. This poses the additional challenge of making sure your process for capturing the remote session is compatible with all of the participant's assistive technology, as well as accessible itself. Troubleshooting remotely is never fun and could be more difficult with this segment of the population.</p><h6>11. Hearing impaired participants</h6> <p>Some participants may have a hearing impairment where the position of the moderator and participant is critical for adequate communication. In the case of hearing-impaired participants, it is important to get their attention before talking to them and also to take turns when engaging in conversation.</p><blockquote><p><a href='http://twitter.com/share?text=To%20get%20the%20most%20of%20this%20research,%20it%20is%20best%20if%20the%20participants%20are%20not%20discovering%20basic%20accessibility%20issues%20that%20should%20have%20been%20discovered%20during%20an%20accessibility%20review%20and/or%20testing.&amp;url=https://www.smashingmagazine.com/tips-conducting-usability-studies-participants-disabilities' rel='nofollow'>To get the most of this research, it is best if the participants are not discovering basic accessibility issues that should have been discovered during an accessibility review and/or testing.</a></p></blockquote><h5>Lessons Learned For Participants With Visual Disabilities</h5><p>Participants with visual disabilities range from people who are blind and use screen readers such as <a href='http://www.freedomscientific.com/Products/Blindness/JAWS' rel='nofollow'>JAWS</a>, to people that need to the text or the screen to be enlarged using software such as <a href='https://www.zoomtext.com/products/' rel='nofollow'>ZoomText</a> or relying on the native screen enlargement in the browser. People that are color-blind also fall into this category.</p><ul><li>For any documents needed prior to the study such as the consent form, send via email beforehand and ask them review and send back in lieu of a physical signature.  If you don't, be prepared to read aloud the consent form and assist in signing the documents for some participants.</li><li>Make sure directions provide step-wise directions; do not rely only on graphical maps as these may not be accessible.</li><li>For all documents, make sure color is not used as the sole cue to convey information.  Print out all documents on a black and white printer to make sure color is not required to make sense of the information.</li><li>Get participants mobile phone numbers in advance and meet them at their drop-off point. Be prepared to guide them to the testing location. Review best practice for guiding blind individuals:<br></li><li>While Braille documents can be helpful for participants that read Braille, the time and cost involved may not be feasible. Furthermore, all blind people do not read Braille, especially people that have lost sight later in life. It is best to make sure all documents can be read via a screen reader. Unless you are sure if there are no accessibility issues avoid PDF documents and send out simple Word documents or text-based emails.</li><li>If participants bring guide dogs do not treat them as pets, they are working. Provide space for the dog and do not pet it unless the participant gives you permission.</li><li>Make sure to explain beforehand any sounds or noise that are or may be present in the room such as unique audio from recording software. This may avoid the participant from becoming startled or confused during the session.</li><li>Initially when I started to work with blind participants I was worried my choice in language might offend. However, over the years I have learned that most blind participants are fairly relaxed when it comes to speech. Therefore, during moderation do not be afraid to use phrases such as &quot;see&quot; or &quot;look&quot; and similar words when talking to blind participants; for example, &quot;please take a look at the bottom of the page&quot; or &quot;what do you see in the navigation menu?&quot;  In my experience, blind participants will not be offended and will understand the figurative meaning rather than the literal meaning.</li><li>Test out all recording equipment/processes beforehand.  Ensure all audio including both human speech in the room and audio/speech from AT such as screen readers will be recorded correctly.  During testing of the equipment adjust the locations of the microphones for optimal recording.</li></ul><h5>Lessons Learned For Participants With Motor Disabilities</h5><p>Motor disabilities refer to disabilities that affect the use of arms or legs and mobility. These individuals may need to use a wheelchair. Some people may not have full use of their hands or arms and cannot use a standard mouse and keyboard. These people may need to voice recognition software which allows to use voice input or use a special pointing device, for example, one that is controlled by their mouth.</p><ul><li>In the directions, make sure the route is accessible and routes them via elevators rather than stairs. Also, if participants are driving note the location of accessible parking.</li><li>Note if doors have accessible door controls. If not you may need to meet the participant and guide them to the testing location.</li><li> Make a note of the nearest accessible restrooms to the testing location.</li><li>As with all participants with disabilities, it is best if they can bring in their own laptop with their assistive technology software installed and any other required assistive technology. However, in the case of participants (such as Adriana in Figure 3) that use voice recognition software such as <a href='https://www.nuance.com/dragon.html' rel='nofollow'>Dragon Naturally Speaking</a> this is critical because they have trained the software to recognize their voice.</li><li>Make sure the desk or table where the participant will be working can accommodate a wheelchair and the height is adjustable. <a href='https://www.compliance.gov/sites/default/files/wp-content/uploads/2010/03/fastfacts_ada.pdf' rel='nofollow'>According to the American with Disabilities Act</a> (ADA), conference tables must be 27 inches high in order to accommodate knee clearance for individuals in wheelchairs..</li></ul>    <a href='https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/515e44c5-a462-4ff0-a2dd-35033cdcc9bb/figure3.png' rel='nofollow'>            </a>                        Adriana Mallozzi conducting a usability test at the User Experience Center.  Adriana has a motor disability (cerebral palsy) which affects her entire body. She uses a wheelchair, a sip-and-puff joystick that acts as a mouse, along with Dragon Naturally Speaking. (<a href='https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/515e44c5-a462-4ff0-a2dd-35033cdcc9bb/figure3.png' rel='nofollow'>Large preview</a>)            <h5>Lessons Learned For Participants With Cognitive Disabilities</h5><p>Individuals with these disabilities cover a wide range of relatively mild learning disabilities such as Dyslexia to individuals with a more profound cognitive disability such as Down syndrome. In general, people with cognitive disabilities have challenges with one or more mental tasks. Rather than looking at specific clinical definitions it best to consider functional limitations in key areas such as memory, problem-solving, attention, reading or verbal compensation. Consider how best to accommodate participants during usability testing. Many of the tips below should also apply to all participants, however for this group you need to be extra aware.</p><ul><li>Sometimes participants will be accompanied by a caretaker or an aide. This person may assist with transportation or may need to be present with the participant during the usability test. If the caretaker is present during the usability test, make sure they understand the structure of the usability test and what will be required of the participant. If you know the participant will be accompanied before the study, you review the goals and protocol prior to arrival via email or phone. That is as much as possible the participant should be one conducting the usability testing, and the caretaker should not be involved unless it is completely necessary.</li><li>In some cases, the caretaker or aide may act like an interpreter. You may need to communicate with this interpreter in order to communicate with the participant. If this is the case, make sure you record the audio coming from both the participant and the interpreter.</li><li>Provide instructions in multiple modalities, for example, both written and verbal. Be patient and be prepared to repeat the task or ask the same question multiple times.</li><li>Be prepared to break tasks into smaller sub-tasks to support memory/attention challenges or fatigue that may set in.</li><li>Ideally, it is best to be consistent with tasks for all participants however for some participants with cognitive disabilities you should be prepared to go off-script or modify tasks on the fly if the current approach is not working.</li><li>Have the participant's comfort and well-being the number one priority at all times.  Don't be afraid to take multiple breaks or end the session early if things are just not working out or the participant is not comfortable.</li></ul>    <a href='https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/787bdd5e-0107-4643-a661-025d0290c6b2/figure4.png' rel='nofollow'>            </a>                        Amazon.com home page zoomed in at 250%. (<a href='https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/787bdd5e-0107-4643-a661-025d0290c6b2/figure4.png' rel='nofollow'>Large preview</a>)            <h4>Additional Insights</h4><p>The tips above should serve as guidelines. Each participant is unique and may require various accommodations depending on their situation. Furthermore, while some of the tips are categorized for specific disability types, specific individuals may have multiple disabilities and/or benefit from a tip from a different category than their primary disability.</p><p>If you or your company have conducted user or customer research, you know the value of gathering feedback about the issues and benefits of products and systems. Testing with individuals with disabilities is no different, as you learn many insights that you would not gain otherwise. However, an additional takeaway for us was the realization that people use assistive technologies in different ways. The following example is specific to people with visual disabilities, but there are similar examples across all groups.</p><p>An assumption might be someone that is blind only uses a screen reader such as JAWS and is an expert at it. We found that people with visual impairments actually differ greatly in the level of support needed from assistive technology.</p><ul><li>Some users need a screen reader for accessing all content.</li><li>Some users (with more sight/with low vision) only need to enlarge content or invert page colors to increase contrast.</li><li>Others may need a combination of approaches. One visually impaired participant used both a screen reader along with the zoom function embedded in the web browser. She only used a screen reader for large paragraphs of text, but otherwise simply zoomed in with the web browser and got very close to the screen when navigating around the website.</li></ul><p>Furthermore, just like anyone, all users are not experts on the software they use. While some users would consider themselves experts, some only learn enough about the software to accomplish what they need and no more.</p><h4>Moving Forward</h4><p>Hopefully you have learned some useful information that will help you include more diversity into your usability testing. However, since there is variability with different disabilities, this may seem overwhelming. I recommend starting small; for example by including one or two participants with disabilities as part of a larger group of 5 to 10 participants. In addition, initially bring in someone that has both experience with usability testing and a lot of experience with their assistive technology so you can focus on getting their feedback rather than how the usability testing process works or their use of their assistive technology.</p><h5>Acknowledgements</h5><p>I would like to thank Jocelyn Bellas, UX Researcher at Bank of America and Rachel Graham, UX Researcher at Amazon. When Rachel and Jocelyn worked at the User Experience Center as Research Associates in 2016, they worked with me on some of the projects referenced in this article and also contributed to a related blog post on this topic.</p><h5>References</h5><ul>    <li>&quot;<a href='http://www.uiaccess.com/accessucd/ut_conduct.html' rel='nofollow'>Conducting Usability Testing</a>,&quot; Henry, S.L. (2007), <em>Just Ask: Integrating Accessibility Throughout Design</em></li>    <li>&quot;A Web for Everyone: Designing Accessible User Experiences,&quot; Horton S., Quesenbery W. (2013), Rosenfeld Media</li>    <li>&quot;<a href='http://uxpamagazine.org/variations_assistive_technology/' rel='nofollow'>ICT and People with Cognitive Disabilities: Variations in Assistive Technology</a>,&quot; Lewis, <em>User Experience Magazine</em></li>    <li>&quot;Why Usability Testing Should be Part of your Accessibility Testing Strategy,&quot; McNally P. (2017, October), <em>The 2017 ICT Accessibility Testing Symposium: Automated &amp; Manual Testing</em></li>    <li>&quot;<a href='https://www.bentley.edu/centers/user-experience-center/usability-studies-and-participants-disabilities-what-you-need-know' rel='nofollow'>Usability Studies and Participants with Disabilities: What you Need to Know</a>,&quot; McNally P., Graham R., Bellas J. (2016, August)</li>    <li>&quot;The Design of Everyday Things,&quot; Norman D. (1988), <em>Basic Books</em></li>    <li>&quot;Handbook of Usability Testing,&quot; Rubin J. (1994), John Wiley &amp; Sons</li></ul><div>    <span>(cc, ra, yk, il)</span></div>  <div></div></div>            </div>        </div>                 <div>            <div>                                                </div>        </div>                    <div></div>                </div>     <div>        <div>            <div>    <h5>Browse All Smashing Magazine Topics</h5>    <ul>              <li>            <a rel='nofollow'>Accessibility</a>        </li>              <li>            <a rel='nofollow'>Android</a>        </li>              <li>            <a rel='nofollow'>Animation</a>        </li>              <li>            <a rel='nofollow'>Apps</a>        </li>              <li>            <a rel='nofollow'>CSS</a>        </li>              <li>            <a rel='nofollow'>Design</a>        </li>              <li>            <a rel='nofollow'>Design Patterns</a>        </li>              <li>            <a rel='nofollow'>Design Systems</a>        </li>              <li>            <a rel='nofollow'>E-Commerce</a>        </li>              <li>            <a rel='nofollow'>Freebies</a>        </li>              <li>            <a rel='nofollow'>Graphics</a>        </li>              <li>            <a rel='nofollow'>HTML</a>        </li>              <li>            <a rel='nofollow'>Illustrator</a>        </li>              <li>            <a rel='nofollow'>Inspiration</a>        </li>              <li>            <a rel='nofollow'>iOS</a>        </li>              <li>            <a rel='nofollow'>JavaScript</a>        </li>              <li>            <a rel='nofollow'>Mobile</a>        </li>              <li>            <a rel='nofollow'>Pattern Libraries</a>        </li>              <li>            <a rel='nofollow'>Performance</a>        </li>              <li>            <a rel='nofollow'>Photoshop</a>        </li>              <li>            <a rel='nofollow'>Plugins</a>        </li>              <li>            <a rel='nofollow'>React</a>        </li>              <li>            <a rel='nofollow'>Responsive Web Design</a>        </li>              <li>            <a rel='nofollow'>Service Workers</a>        </li>              <li>            <a rel='nofollow'>Sketch</a>        </li>              <li>            <a rel='nofollow'>Typography</a>        </li>              <li>            <a rel='nofollow'>UI</a>        </li>              <li>            <a rel='nofollow'>Usability</a>        </li>              <li>            <a rel='nofollow'>User Experience</a>        </li>              <li>            <a rel='nofollow'>Wallpapers</a>        </li>              <li>            <a rel='nofollow'>Web Design</a>        </li>              <li>            <a rel='nofollow'>WordPress</a>        </li>              <li>            <a rel='nofollow'>Workflow</a>        </li>          </ul></div>        </div>        <div>            <div>                <p>With a commitment to quality content for the design community.</p>                <p>Founded by Vitaly Friedman and Sven Lennartz. <span>2006–2018</span>.</p>                <p>Smashing is proudly running on <a href='https://www.netlify.com/?utm_source=link&amp;utm_medium=parter&amp;utm_campaign=sm-footer' rel='nofollow'>Netlify</a>.</p>                <p>Fonts by <a href='http://latinotype.com/' rel='nofollow'>Latinotype</a>.</p>            </div>            <ul>                <li>✎ <a rel='nofollow'>Write for us</a></li>                <li><a rel='nofollow'>Contact us</a></li>                <li><a rel='nofollow'>About us (Impressum)</a></li>                <li><a rel='nofollow'>Privacy policy</a></li>                <li><a rel='nofollow'>Membership login</a></li>                <li><a href='mailto:markus.seyfferth@smashingmagazine.com?subject=Let’s talk about advertising' rel='nofollow'>Advertise</a></li>            </ul>        </div>    </div>    <div>    <a title=&quot;Back to top&quot; rel='nofollow'>                    Back to top                                    </a></div>    <div></div>  <div></div>                ",
    "urlFetchPending": false,
    "published": "Mar 12, 2018 2:20:39 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "PwKTKcewQpCKLDgFwuDn3w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/remote-jobs/omnigo-fund-cryptocurrencies-trader",
    "title": "Omnigo.fund: Cryptocurrencies Trader",
    "content": "<div>  <div>    <h2>Cryptocurrencies Trader</h2>      <h4>Posted Mar  5</h4>    <h3>      <span>Omnigo.fund</span><br>      <span>Headquarters: Abu Dhabi, UAE</span><br>        <a href='http://omnigo.fund' rel='nofollow'>http://omnigo.fund</a>      <br>      <a rel='nofollow'>View all Omnigo.fund jobs →</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>Join Omnigo.fund to become part of a dynamic team that's opening the cryptocurrency market for everyone. We believe that cryptocurrencies are changing the way we will deal with money.</span></div><div><br></div><div><span>We are searching for a partner who is trading our and our customers money and help us with his insights and advice to improve constantly.</span></div><div><br></div><div><span>You are an experienced trader who knows the Cryptocurrency market. You are outperforming the market on a regularly basis and you are adaptive and thrive in a fast-paced, changing environment.</span></div><div><br></div><div><h4><span>FLEXIBLE LOCATION AND TIME</span></h4></div><div><span>We are a completely remote team, so we offer you a great amount of trust and flexibility</span></div><div><br></div><div><h4><span>CUSTOMIZED TOOLS</span></h4></div><div><span>Our software development team will provide you any help needed and is capable of building customized tools to support your trading activity</span></div><div><br></div><div><span><br></span></div><div><span><br></span></div><div><span></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='mailto:veronica.marini@omnigo.fund' rel='nofollow'>veronica.marini@omnigo.fund</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 5, 2018 10:59:07 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Gu5PtS_XRIaRP8mkfoBIiw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16503649",
    "title": "DADI | Design & engineering roles | Remote First (HQ: London, UK) | Full Time",
    "content": "<div>                  <span>DADI | Design &amp; engineering roles | Remote First (HQ: London, UK) | Full Time<p>DADI is a global, decentralized cloud platform, focused on the provision of web services to help you build, scale and grow your digital products. DADI's web services are organized around a microservices architecture that provides a series of intelligent apps for building digital products.</p><p>• Open source, decentralized web services.</p><p>• Work asynchronously.</p><p>• No 9 to 5.</p><p>• Work at your own pace.</p><p>• Minimal meetings.</p><p>• Work where you want.</p><p>Designer: <a href='https://weworkremotely.com/remote-jobs/dadi-designer' rel='nofollow'>https://weworkremotely.com/remote-jobs/dadi-designer</a></p><p>Full Stack Engineer: <a href='https://weworkremotely.com/remote-jobs/dadi-full-stack-engineer' rel='nofollow'>https://weworkremotely.com/remote-jobs/dadi-full-stack-engin...</a></p><p>Frontend Engineer (x2): <a href='https://weworkremotely.com/remote-jobs/dadi-frontend-engineer' rel='nofollow'>https://weworkremotely.com/remote-jobs/dadi-frontend-enginee...</a></p><p>Interested? Contact us at jobs@dadi.co.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 2, 2018 7:30:12 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/Any"
    ],
    "tagsNames1": [
      "Any time zone",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "ihMzgfK1Qqqn8E5DzPnU8A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16498230",
    "title": "HealthPrize | Software Dev | NYC / Norwalk, CT | REMOTE Full-time | https://www.healthprize.com/",
    "content": "<div>                  <span>HealthPrize | Software Dev | NYC / Norwalk, CT | REMOTE Full-time | <a href='https://www.healthprize.com/' rel='nofollow'>https://www.healthprize.com/</a><p>At HealthPrize, we are changing the way people think about their medication and their health! Our growth is being fueled by work with leading brands in life sciences such as Abbott, Walgreens, and Gilead. Join the close-knit engineering team that designs &amp; develops our industry leading patient engagement platform and work with us to measurably improve the state of healthcare globally.</p><p>Backend Hypewords: Java/Kotlin, Amazon Aurora, Redis, Spring-Boot, Docker, Swagger, API Gateway</p><p>Systems Hypewords: AWS, Terraform, AWS ECS/EKS, RDS, Datadog</p><p>Senior Platform Engineer: <a href='https://healthprize.com/careers-page/#op-205414-senior-platf...' rel='nofollow'>https://healthprize.com/careers-page/#op-205414-senior-platf...</a>.</p><p>Lead Site Reliability Engineer: <a href='https://healthprize.com/careers-page/#op-208838-lead-systems...' rel='nofollow'>https://healthprize.com/careers-page/#op-208838-lead-systems...</a>.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 2, 2018 4:00:09 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "java"
    ]
  },
  {
    "id": "oPVrdSIDT6KKaJPKD3Ty4A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16496857",
    "title": "7 Cups | Mental Health | REMOTE, Full-Time | Community Manager | https://7cups.com",
    "content": "<div>                  <span>7 Cups | Mental Health | REMOTE, Full-Time | Community Manager | <a href='https://7cups.com' rel='nofollow'>https://7cups.com</a><p>7 Cups’ mission is to provide affordable behavioral health support services globally. Since graduating from YCombinator in 2013, 7 Cups’ product has shifted the on-demand mental health economy and has continued to scale into serving people from all walks of life. Over 1.9 million people from 189 countries (in 140 different languages) use the platform each month and growing. A career with 7 Cups provides the opportunity to make an impact on the lives of millions.</p><p>We are seeking a Community Manager, capable of taking us to the next level. You have a passion for mental health and will be working to integrate support projects, volunteer teams, and initiatives within each specific sub-community for the purpose of shared community building. This role works with both adult and teen communities and with both listeners and help seekers.</p><p>More details and application process here - <a href='https://www.7cups.com/about/jobs.php' rel='nofollow'>https://www.7cups.com/about/jobs.php</a><span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 2, 2018 12:10:06 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "FfbooXOvTbi-2656R2hvnQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16496511",
    "title": "Signal | Full-Time | SF or REMOTE in US We build the Signal private messaging app. Seeking engineers and designers who ...",
    "content": "<div>                  <span>Signal | Full-Time | SF or REMOTE in US<p>We build the Signal private messaging app.</p><p>Seeking engineers and designers who are passionate about delightful, intuitive and reliable software.</p><p></p><pre><code>  * Service Eng.  * Android Eng.  * Desktop Eng. (Electron &amp; web stack)  * Designer (UX, Graphic Design, etc)</code></pre>At Signal you can:<p></p><pre><code>  * Join a diverse team.  * Put the customer first.  * Build free &amp; open source software.  * Contribute to a fast-growing product.  * Engage with hard problems.  * Take ownership within your discipline.  * Shape the product as a whole.  * Participate in collective decision-making.  * Work remotely.  * Enjoy work-life balance.</code></pre><a href='https://signal.org/' rel='nofollow'>https://signal.org/</a>workwithus@whispersystems.org<p><a href='https://www.keyvalues.com/signal' rel='nofollow'>https://www.keyvalues.com/signal</a><span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 11:29:07 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "Jn4o2_30T2ebzdB132FV5A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16495808",
    "title": "Infinite Food | Mechanical Design Engineers / Mechanical Engineers | Shenzhen, China | $neg + equity available | Full-time or REMOTE |",
    "content": "<div>                  <span>Infinite Food | Mechanical Design Engineers / Mechanical Engineers | Shenzhen, China | $neg + equity available | Full-time or REMOTE | <a href='http://8-food.com/' rel='nofollow'>http://8-food.com/</a><p>Early stage Shenzhen-based, Hong Kong registered company with two years of IP seeking talented Mechanical Design Engineers with fluency in Solidworks. Working language is English, Mandarin or regional languages well regarded. Broad range of interesting work focusing on automation and industrial products, rapid prototyping and iteration with supporting electrical, software, logistics and machine learning engineers. Experience with CFD (heat, fluid and airflow modeling), electrical and food safety regulation in any market, production in thermoform, injection molding, blow molding, extrusion well regarded. Private office in Shenzhen (Houhai, near HK/Shenzhen Wan border crossing). Physical presence encouraged but not a daily requirement.</p><p>Mandarin speakers well regarded, but Chinese knowledge is not required. Clear written technical communication in English is mandatory. Skills and experience first, qualifications a distant second. We respect execution.</p><p>Email in profile, please include 'Candidate: Mechanical Engineer' in subject. No recruiters.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 10:18:08 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "auleDdo-QoefiuUZaiKANA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16495770",
    "title": "TalkJS (https://talkjs.com) | Eindhoven, the Netherlands | REMOTE (< 200km)",
    "content": "<div>                  <span>TalkJS (<a href='https://talkjs.com' rel='nofollow'>https://talkjs.com</a>) | Eindhoven, the Netherlands | REMOTE (&lt; 200km)<p>TalkJS is the chat platform for platforms. We help online marketplaces build great user-to-user communication.</p><p>FULL STACK PROGRAMMER / FRONTEND PROGRAMMER:</p><p>We're looking for an experienced programmer - the kind that could make it to &quot;software architect&quot; at a boring bigco but prefers to get their hands dirty. Our stack is made of Elixir, ES6, React, PostgreSQL and a little bit of Node.</p><p>We're particularly looking for people with strong front-end skills, with an eye for design and UX. This means that either you identify as a frontender, or as a full-stack developer.</p><p>CONTENT MARKETER:</p><p>We're looking for someone who a knack for tech who loves writing stories about how people use chat to make their lives and/or their apps better. Bonus points if you're good at customers or SEO.</p><p>ABOUT YOU</p><p>Our team is small and highly proactive, and we expect the same from you. If you need to be told what to do all the time, don't apply. If you want to be the smartest person in a (chat) room full of interns, don't apply. If you want to move fast with an experienced team, get in touch.</p><p>We prefer on-site for all positions, but remote is OK as long as you're max 2 hours away from Eindhoven so we can meet often. Eindhoven has a great low-cost airport so this includes much of Europe.</p><p>Apply by sending an email to hey@talkjs.com.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 10:14:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "-YkGam2ySum776memDF-_w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16495090",
    "title": "Take a stab at our little challenge and ensure your CV gets reviewed by our team: https://challenge.curbside.com Curbside ...",
    "content": "<div>                  <span>Take a stab at our little challenge and ensure your CV gets reviewed by our team: <a href='https://challenge.curbside.com' rel='nofollow'>https://challenge.curbside.com</a>Curbside is enabling a new way to shop, built for the era of instant mobile commerce. The Curbside app makes it easy to find, buy and pickup products at nearby stores. Curbside searches realtime local inventory across retailers and uses location-based technologies to alert stores when a customer is arriving for a pickup. Curbside helps consumers quickly get what they need and helps retailers better serve their increasingly mobile centric customers. The Curbside Merchant Console enables alerts to staff as customers arrive to pick up orders and also manages online order workflow.<p>Curbside’s investors include Sutter Hill Ventures, Index Ventures, Jerry Yang’s AME Cloud Ventures, Qualcomm Ventures, Eric Schmidt’s Innovation Endeavors, O’Reilly AlphaTech Ventures, Gil Elbaz &amp; David Waxman’s TenOneTen and Chicago Ventures.</p><p>Tech Stack: Clojure, Python, Javascript, iOS, Android, Elasticsearch</p><p>Problem space: mobile commerce, big data, search, machine learning, reverse engineering, distributed systems, location services, user experience.</p><p><a href='https://curbside.com/jobs' rel='nofollow'>https://curbside.com/jobs</a> • Palo Alto, Ca. • Relocation Available • Sorry at this time we cannot sponsor NEW H-1B’s, but we can transfer existing visa’s and sponsor new E3’s, TN’s, and O-1’s.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 9:10:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "QkHoBjpdTJqx0wYQI8P_BQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16494067",
    "title": "KEA | Bay Area | NLP, Telephony, Signal Processing | Full-time & interns, remote + onsite (preferred) | Python / Haskell | 4+ years of experience",
    "content": "<div>                  <span>KEA | Bay Area | NLP, Telephony, Signal Processing | Full-time &amp; interns, remote + onsite (preferred) | Python / Haskell | 4+ years of experience<p>KEA is a voice recognition platform that processes and places orders automatically for merchants when customers call in. We seamlessly transforms incoming speech into tickets fed directly into businesses’ POS systems.</p><p>We are looking for Haskell / Python 3 folks for building speech recognition phone systems for businesses. Email us at emily@kea.ai</p><p>Equity options / market salary / accommodation (if needed)More details:</p><p><a href='https://docs.google.com/document/d/167cFW4jBZ39VivngkW_LtFqwuHAssq7vk3BJqDhXikY/edit?usp=sharing' rel='nofollow'>https://docs.google.com/document/d/167cFW4jBZ39VivngkW_LtFqw...</a></p><p><a href='https://kea.ai' rel='nofollow'>https://kea.ai</a><span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 7:29:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "9EtA6M3eRhCpBIhlRjLRGg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16493198",
    "title": "Grownetics | Application Developer, Platform Engineer, INTERNS | Boulder, CO | Full-Time/Contract | REMOTE",
    "content": "<div>                  <span>Grownetics | Application Developer, Platform Engineer, INTERNS | Boulder, CO | Full-Time/Contract | REMOTE<p>Grownetics is the most advanced cultivation management system for greenhouses and indoor farms. We combine high resolution crop sensing, open automation systems, and individual plant tracking from clone to cure so you can make sure you're growing better every single harvest.</p><p><a href='http://grownetics.co/careers/' rel='nofollow'>http://grownetics.co/careers/</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 1, 2018 6:19:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "n-_8NdWVQeu-ew81ug888Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/66089/digital-designer-home-based-full-time-at-jago/",
    "title": "Digital Designer Home based | Full Time",
    "content": "Jago are looking for a Digital Designer to join the family. Unlike most agencies, there is no commute due to our unique remote working model. We believe you should work where you are most comfortable and more importantly, most inspired. All we ask is that you are within a 30 mins commute to Guildford for when we do meet up. We like to get together regularly to work on larger projects, catch up over coffee and celebrate successes. <br /><br />This role offers a range of different opportunities to grow. You will have a big say over the creative department and the direction it goes in. Jago is a lifestyle company that cares about your growth and your ability to learn and achieve the things you want to achieve.<br /><br />This role will require you to be experienced in Web Design, UX/UI, branding and to have a good understanding of print. You will need to be a self-motivated, driven person who keeps their finger on the pulse of latest trends in the world of digital. You will have an outstanding eye for detail and manage your time efficiently. You will trust your initiative and guide a developers on your vision for digital products. You will be a confident, strong communicator and confident with meeting clients with the team and alone.<br /><br /><br />Technical Requirements<br /><br /><br />- Minimum of 4 years experience in digital design<br />- Natural ability for designing products that are responsive across all platforms<br />- Great working knowledge of Wordpress CMS<br />- Adobe Illustrator, Photoshop and InDesign<br />- Sketch<br />- A good understanding of Invision<br />- A good understanding of Mailchimp<br />- A strong portfolio of digital and branding work<br /><br /><br />It would be an added bonus if you have the following: <br /><br />- Final Cut Pro or After Effects Experience<br />- Basic knowledge of HTML & CSS<br />- Experience in photography<br />- A good understanding of Dotmailer<br /><br />Culture & Benefits<br /><br />Work remotely:<br /><br />We believe you should work where you are most inspired. Autonomy fuels productivity.<br /><br /><br />Speak your mind:<br /><br />The Jago culture encourages you to be yourself and allows you to bring all your ideas to the table. We want you to be an influencer and make your mark on a project.<br /><br /><br />“Be better budget”:<br /><br />Self development is vital, so we give you a budget to spend on learning and development.<br /><br /><br />We grow; you grow:<br /><br />We want you to earn as much as your potential allows, so as our business grows and you develop, your wage will too.<br /><br /><br />Teamwork:<br /><br />We always communicate, inspire and help each other. We are a family.<br /><br /><br />Additional holiday:<br /><br />Great performance is rewarded with additional holiday.<br /><br /><br />Enjoy:<br /><br />We want to enjoy what we do and it’s important to have fun. Whether it’s a running morning, lunch in London or Christmas parties, we have plenty of fun.<br /><br /><br />Startup mentality:<br /><br />Help shape your department. Be part of a team who think for the future.<br /><br /><br />Contact us now for an exciting opportunity!",
    "urlFetchPending": false,
    "published": "Feb 23, 2018 12:00:00 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend",
      "php"
    ]
  },
  {
    "id": "-7Ldkf6YStGuRtpTAph0qA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/remote-jobs/amazix-professional-telegram-moderators-1",
    "title": "AmaZix: Professional Telegram Moderators",
    "content": "<div>  <div>    <h2>Professional Telegram Moderators</h2>      <h4>Posted Feb 19</h4>    <h3>      <span>AmaZix</span><br>      <span>Headquarters: Hong Kong (but entire team is distributed)</span><br>        <a href='http://www.amazix.com/' rel='nofollow'>http://www.amazix.com/</a>      <br>      <a rel='nofollow'>View all AmaZix jobs →</a>    </h3>  </div>    </div>  <div>    <div>AmaZix is the leading provider of community management services for crypto projects. We specialise in helping projects running on the Ethereum blockchain, especially those building up to their ICOs. Projects we work on include Bancor, Stox, BANKEX, Flixxo and Hydrominer.</div><div><br></div><div>We are growing extremely fast and from our founding a few months ago we now have over 100 staff and manage 60 high level projects, with many more asking to come aboard than we can take. We are profitable and have been since day one.</div><div><br></div><div>However some knowledge of what Ethereum or Bitcoin are is necessary, though this is something the right person would be able to research and learn before applying. We pay our staff in Ethereum which can be easily sold for USD or the currency of your choice on a variety of exchanges and we can support you in this.</div><div><br></div><div>Though our company is based in Hong Kong our team is distributed around the world (primarily Europe).</div><div><br></div><div><b>Your position:</b></div><div><br></div><ul><li>We are looking for new talents to help us out with our increasing number of projects. The tasks to complete are (among others):<br></li><li>Moderation of Telegram groups: providing information and support to users, deleting offensive or inadequate messages, banning trolls and spammers, etc.<br></li><li>Sharing new updates from the ICO team in different social media channels: Reddit, Bitcointalk, Telegram, etc., and replying to comments from other users<br></li><li>Gathering questions from users and maintaining FAQ databases</li></ul><div><br></div><div><b>And this is what you should offer:</b></div><div><br></div><ul><li>A fluent level of English (if you are also fluent in Russian or Chinese it will be a plus)<br></li><li>Be willing to dedicate at least 40 hours per week to the task (working hours are negotiable).<br></li><li>Have good social skills, being ready to deal sometimes with complicated users posing nasty questions or FUDing<br></li><li>Be ready to invoice AmaZix for your services<br></li><li>Be comfortable being paid in Ethereum<br></li><li>Be organized and ready to bring your skills into a decentralized organization with members from many different countries</li></ul><div><br></div><div><b>To apply:</b></div><div><br></div><div>To show that you have the required skills (or to show you can learn them quickly), please answer the following questions that you might encounter on the Telegram channels. Answer as if you were a team member answering publicly on a channel with 3000 members.</div><div><br></div><div>1. What is the project Flixxo.com aiming to achieve?</div><div>2. How can I buy FLIXX tokens?</div><div>3. What is Ethereum Gas and how is it used?</div><div>4. Please provide the token contract address of Bancor on Etherscan.</div><div><br></div><div>Please do not reach out via Telegram or other channels for the job posting. We have a large backlog of of applicants and it could take up to a few weeks to respond. Ability to follow instructions is important.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Submit your application to <a href='mailto:dan.johns@amazix.com' rel='nofollow'>dan.johns@amazix.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 19, 2018 8:56:23 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "UYZJa4e5RbWdDu4CYbXAxw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workingnomads.co",
    "url": "https://www.workingnomads.co/jobs/human-resources-wrangler-automattic",
    "title": "Human (Resources) Wrangler",
    "content": "<p>Would you like to take part in building the future of our distributed workforce? Automattic is a place like no other: our fast-growing team of 650+ works from home (or any other location they choose), in one of&nbsp;<a href='https://automattic.com/map/' rel='nofollow'>59 countries</a>, to democratize publishing and make the web a better place. Check out our&nbsp;<a href='https://automattic.com/work-with-us/' rel='nofollow'>Work With Us</a>&nbsp;page for more info on how we work, our development process, and benefits.&nbsp;</p><p>The Human League (externally known as HR) team’s goal is to ensure our company is the best place Automatticians have ever worked,&nbsp;making each person feel welcomed, included, valued, and respected. We are looking for a Human (Resources) Wrangler to join our team and help scale our distributed model as we grow.&nbsp;</p><p>Some of your responsibilities will include managing global compensation, administering benefits programs, analyzing employee engagement data, developing learning opportunities and programs, being a strategic partner to Automatticians, and promoting employee relations.&nbsp;</p><p>Do you have:</p><ul><li>Experience with a lean, fast-growing, fast-paced software, internet, or creative startup?</li><li>An insatiable curiosity for new technology, gadgets, and streamlined processes?</li><li>Experience using WordPress?</li><li>Experience working with remote team members?</li><li>Experience implementing multinational compensation and benefits programs?</li><li>Experience supporting team leads and team members through all aspects of employment (onboarding, coaching others, brainstorming solutions, managing performance improvement plans)?</li><li>A passion for elegant, simple, automated solutions that keep operations running smoothly?</li><li>Exceptional verbal and written communication skills in English?</li><li>An ability to see opportunities to make the work environment better and the initiative to move forward with action?</li></ul>",
    "urlFetchPending": false,
    "published": "Feb 16, 2018 8:27:32 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "c3h4gGzTR6SotZ1a9XubpQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/freedom-formula-growth-accelerator-apprentice",
    "title": "Freedom Formula: Growth Accelerator Apprentice",
    "content": "<div>  <div>    <h2>Growth Accelerator Apprentice</h2>      <h4>Posted Feb 15</h4>    <h3>      <span>Freedom Formula</span><br>      <span>Headquarters: United States</span><br>        <a href='https://freedom-formula.breezy.hr/p/30addd227ecf-growth-accelerator-apprentice?source=weworkremotely' rel='nofollow'>https://freedom-formula.breezy.hr/p/30addd227ecf-growth-accelerator-apprentice?source=weworkremotely</a>    </h3>  </div></div>  <div>    <div><h3><span>Are you a super driven person who enjoys or wants to learn the art and science of running a highly profitable online business - from anywhere in the world?</span></h3></div><div>Are you looking to work with a group of rockstars all around the world, toward big scary goals that will actually make a dent in the world?</div><div><br></div><div>How would you like a bunch of autonomy, and the ability to learn how to run an extremely successful online business from the inside out... From people who have done it repeatedly?</div><div><br></div><div>Are you someone who can strategically take a project from start to finish? Kind of like a Chuck Norris Ninja-level Learner and Certified Badass...</div><div><br></div><div><h3><span>Or even, do you know someone that sounds like this and want $5000 with which to do whatever the heck you want?</span></h3><h3><span></span></h3></div><div>Good news! Please read on…</div><div><br></div><div>We run a really fast-growing company called Freedom Formula, where we help people create their first online business, fire their boss, and live the life that they actually want to live. And we are searching for the next rockstar to add to our tribe.</div><div></div><div><br></div><div><span>Got someone in mind? If you refer the rockstar who we end up working with for more than 2 months, we’ll toss you a cool $5k for connecting everyone. :)</span></div><div></div><div></div><div><br></div><div>We help people travel the world and spend more time with the people that mean most to them. Curious about what we do? Check us out&nbsp;<a href='https://www.youtube.com/channel/UCD_zDKlyozQg_7-Wl_8aBaw' rel='nofollow'>here</a>.</div><div><br></div><div>At the end of the day though, we're a small tribe of really smart and talented rockstars who are working together toward a common goal. And our goal is to completely transform the way people look at jobs they don’t love and entrepreneurship in America and around the world.</div><div><br></div><div>Our entire tribe is remote, so you get to work from anywhere. We are innovating left and right and we do work that changes lives.</div><div><br></div><div>We work hard, get shit done and are insanely informal.</div><div><br></div><div>Don't believe me? What if we did handstands?</div><div><br></div><div></div><div>BOOM. Handstands.</div><div><br></div><div>Anyway... Back to the good stuff.</div><div><br></div><div>We deliver an amazing product to help all of our students and are doing a very very amazing job at marketing and changing people’s lives... which has allowed us to grow really fast.</div><div><br></div><div>But, because of all the growth, some of us have gotten way too busy… Which is where you come in… If you want to go fast.</div><div><br></div><div><span>&quot;I wanna go fast&quot;</span></div><div><br></div><div><span>-Ricky Bobby</span></div><div></div><div></div><div><br></div><div><h2><span>This is for you if:</span></h2></div><ul><li>You’re great at taking ideas and running with them, making sure they’re executed perfectly</li><li>You have an obsessive drive to grow and learn, and do things the right way the first time.</li><li>You are process driven, and good at problem-solving and figuring things out on your own with minimal direction… you can create your own structured work environment.</li><li>You actively read and seek out new learning from books or courses to get better at your role</li><li>You implement. And do so with minimal direction, doing a lot of your own research to find the best way to solve the problem at hand.</li><li>You want to learn how to run profitable internet businesses from the inside, and help build toward big scary goals.</li><li>Lastly and most importantly, you have an unquestioned work ethic. You have a very strong desire to work hard, put in extra time and learn in your off hours.</li></ul><div>If you question your will to work hard, more than the normal 8-4 or 9-5 days, this probably isn’t the best position to apply for.</div><div></div><div><br></div><div>We hate normal jobs, and the 9-5 grind. We believe that regular jobs suck - which is why we never want to be a regular cut-and-paste team with cubicles... or holier-than-thou mission statements... while doing little for the world.</div><div><br></div><div>We have big, scary goals, and are surrounding ourselves with a small tribe of rockstars that are as excited as we are about the goal, so that there is no such thing as ‘work’. We enjoy every minute of it, and want the same for all our tribemates.</div><div></div><div><br></div><div><h2><span>What you'll be doing...</span></h2></div><div>You’ll be working with Evan and Benji directly, as well as our other tribemates, to ensure that any project that we start gets executed perfectly.</div><div></div><div><br></div><div>Sometimes this will mean taking a webinar idea and duplicating out a new marketing funnel for it, sometimes it will mean outlining awesome videos that we can make for our students, sometimes it will be finding badass ways to facilitate engagement within our community... And sometimes it will mean using your knowledge of our audience to help us create more resources to help our students achieve their dreams on Amazon and otherwise.</div><div><br></div><div>This means quickly looking at the goal and principles that drive our decision-making, then developing and executing on a plan to complete the task at hand quickly and effectively.</div><div><br></div><div>Day to day, your tasks will vary quite a bit. But they will ALL revolve around creating more value for our students - who are primarily first-time entrepreneurs. Ultimately, we are just looking for someone who is hungry and ready to learn a ton.</div><div><br></div><div><span>Because of how quickly we are growing, this opportunity will be a huge learning opportunity for someone that is eager to learn how to run profitable businesses online and impact a million lives in the process.</span></div><div><br></div><div>We need someone very driven to make sure we are maximizing all the opportunities we have and getting things done right fast, the first time.</div><div><br></div><div>As a long-term view… When you rock our socks off - this position will transition into an amazing long-term role in the company as we continue to grow.</div><div></div><div><br></div><div><h2><span>What's in it for you?</span></h2></div><ul><li>This is a paid apprenticeship. We want someone who is committed and motivated who can deliver results. We also want that person to be compensated fairly.</li><li>You’ll be part of a fast-growing online company, and learn how we create products that people rave about, and authentic marketing to grow. You will get to work with a thriving and talented tribe, and learn from them.</li><li>It’s a very autonomous position. If you are self-motivated, you will love it. If you are not, it isn’t for you.</li><li>It is completely remote. Work from anywhere you want in the world, as long as you have internet.</li><li>And ideally, if things work out for both of us, you’ll move into a more permanent role in the tribe.</li><li>Ultimately, you will grow, incredibly and incredibly fast, both personally and professionally. And as you do, so will we.</li></ul><div><h2><span>A few other requirements and things you don’t need:</span></h2></div><ul><li>You’re able to work at least 20 hours per week to start, with the potential of going full time.</li><li>Age and experience don’t matter – We’re more interested in qualities: humble, hungry, smart, and entrepreneurial.</li><li>A crazy strong desire to learn and grow.</li><li>Must sometimes make, or be ok with frequent, jokes... :)</li></ul><div></div><div><br></div><div><h2><span>Interested?</span></h2><h2>If that sounds pretty awesome to you then here’s what to do next…</h2></div><div><br></div><div>All applications will go through a vetting process and filtered through our hiring stages. If you’re serious about this, please show it.</div><div><br></div><div><span>The first step</span>&nbsp;is to fill out the application questionnaire on the next page.</div><div></div><div><br></div><div>If you do it right and we like your application, you’ll get into round 2 with further instructions.</div><div><br></div><div>Good luck and I hope to talk to you soon!</div><div><span>Evan</span></div><div><br></div><div><span>Freedom Formula</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://freedom-formula.breezy.hr/p/30addd227ecf-growth-accelerator-apprentice?source=weworkremotely' rel='nofollow'>https://freedom-formula.breezy.hr/p/30addd227ecf-growth-accelerator-apprentice?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 15, 2018 4:50:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "tC6P_bqKQZCBYSFDAcliiQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/advance-research-and-human-development/jobs/77289-ceu-instructor",
    "title": "CEU INSTRUCTOR",
    "content": "<div><h2>CEU INSTRUCTOR at ADVANCE RESEARCH AND HUMAN DEVELOPMENT </h2><div>Florida, Remote · Contract</div></div><div><div>Compensation</div><div>$1K–$10K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The ARAHD consulting Social Worker is responsible for social work education programs and assistance with the activities related to conferences in the ARAHD service area. They will promote compliance with the regulatory requirements and promote the maximization for donation of organs and tissues for research. The position works collaboratively with medical, nursing and other hospice departments as necessary in the planning, design, implementation, evaluation and maintenance of educational and quality assurance programs related to social worker continuing education programs. This position also maintains effective relationships and communications with key personnel. This position is paid on a consultation basis.</p></div>",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 9:27:22 PM",
    "tags": [
      "Contract",
      "Florida",
      "Marketing",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "qdZsUmq0QXWeQEh-oQA0FA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16325118",
    "title": "BRAINSCALE | Cloud Application Developer | FULL-TIME | BANGALORE, IN | www.brainscale.com",
    "content": "<div>                  <span>BRAINSCALE | Cloud Application Developer | FULL-TIME | BANGALORE, IN | www.brainscale.com<p>A Microsoft Gold partner, BrainScale is competent in providing the following services.</p><p></p><pre><code>  -Azure enterprise architecture.  -Workload migration from on-premises data centers in Azure.  -DR as a Service.  -SaaS application development / application re-writes using Azure PaaS.</code></pre>We work with several Fortune-500 customers in the above areas.<p>We are looking to hire a solid Cloud Application Developer who can help in new application development / application migration using Microsoft Azure PaaS services.</p><p>Qualifications:</p><p></p><pre><code>  -Requires at least 4 years C# programming experience.  -Requires minimum of 2 years of experience in Cloud application development using Microsoft Azure PaaS/IaaS services.  -Knowledge of Design Patterns. Ability to think design for a given problem.  -UI/UX experience preferred but not a requirement.  -Prior experience in application performance tuning will be added advantage.</code></pre>Desired Soft Skills:<p></p><pre><code>  -Ability to handle a variety of projects simultaneously.  -Must be self-starter and a team player.  -Ability to work effectively with other teams.  -Experience working with globally distributed team is preferred.  -Excellent customer service attitude, communication skills (written and verbal), and interpersonal skills.</code></pre>Please send your resumes / LinkedIn profiles to jobs@brainscale.com<span>              </span><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 5:42:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "_SVuLoTxSwWfGo6cHMMy2g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/65966/rampd-consultant-at-granttree/",
    "title": "R&amp;D Consultant",
    "content": "DESCRIPTION<br /><br />Experience real freedom at work and help exciting companies get funding for their tech with full support towards CIMA qualification.<br /><br /><br />Do you love the thought of working with a wide variety of entrepreneurs and making a tangible difference to their business? Does the idea of helping big name clients on the tech scene excite you? Would you like to join a diverse, self managing team where you can shape the future of the business from day one? If this sounds like your cup of tea, read on.<br /><br /><br />We are looking for future talent to join our tax credits client management team who are as good with clients as they are crunching numbers behind the scenes. If you have passion for technology, a good head for figures and a love of learning then you could help hundreds of companies a year bring the future closer.<br /><br /><br />By the end of your first year<br /><br /><br />You will be well on the way to a CIMA qualification, with the full support of the company<br />You'll be an authority in government funding and will have learned how to read a company's financial statements.<br />You will have built great relationships with a large number of companies, big and small, giving you a deeper understanding of how start-ups work.<br />You'll also have had the chance to change the future of GrantTree, by taking part in running your team and the business as a whole.<br />REQUIREMENTS<br /><br />About you<br /><br />You are passionate about technology.<br />Ideally, you'll have previously nurtured B2B client relationships, or done something equivalent (like run your own business).<br />You are keen to learn about basic accounting principles and how HMRC’s R&D Tax Credits scheme works.<br />You're totally comfortable producing detailed spreadsheets and written text.<br />You will build rapport with the founders and technical leaders of our client companies, so that you can represent their business in the best way when applying for government funding.<br />If you have a background in technology (particularly software) or finance (corporate tax or accountancy) this is a definite bonus.<br />About us<br /><br />GrantTree was founded 6 years ago and employs 34 people. In our culture everyone has the freedom, power and trust to do great work. We call this open culture. Our open culture champions transparency and allows a flexible approach to work; it’s been successful for us so far, although it's not for everyone (check out our GlassDoor reviews to learn more).<br />BENEFITS<br /><br />We believe that people should be rewarded fairly for the work they do. At GrantTree there is transparency over salaries and the way we work them out. For this role, this is likely to lie between £25k and £35k. We also provide access to health insurance, cycle to work, and we have an annual profit sharing scheme for the whole team (which can be taken as shares or cash).<br /><br />Aside from money, we offer a place where you can be yourself. We want you to develop your skills and fulfil your potential. We have a flexible approach to working, and some of our staff work remotely most of the time. Our office near Old Street is bright and airy, with a well-stocked kitchen and a beautiful roof terrace. You can take up to 6 weeks as holiday each year.<br /><br />Equal opportunities<br /><br />Teams are stronger when they have a diverse range of people. Applications are welcomed from everyone, regardless of the categories they fit into. We also encourage talented ‘square pegs’, who don’t neatly fit into the person specification, to apply.",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 9:58:16 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "YbY9ng40Qq63m7UeCGL4-w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobs.github.com-remote",
    "url": "http://jobs.github.com/positions/9f8326e2-0b98-11e8-80ba-49fbb906adba",
    "title": "Full Time: Frontend Developer - Build the smartest way to buy a car (Remote - full time) at Unhaggle Inc. in Remote",
    "content": "<p>Unhaggle is currently the #1 web portal in Canada for new car buying. The data we provide powers our own tools and products, including our flagship consumer car buying service at Unhaggle.com and leading automotive portals including Yahoo Autos, MSN Autos, Autofocus, AutoGuide, Globe Drive, and others. We have also recently partnered with auto makers to launch a large eCommerce platform allowing the complete purchase of new cars online.</p><p>We are looking for Senior Front-end Developers with experience in web application development. <strong>This is a full-time remote position, we accept applications from anywhere in the world.</strong></p><p>We use GitHub to manage tasks and code reviews as well as tools/services like Travis-CI, Docker, New Relic, Sentry, Browserstack, Stripe, Twilio, Solr and Redis.Our dev team is regularly connected in Slack for communication. We are constantly seeking the best tools available for our development team.</p><p>You will be primarily involved in the following projects/areas:</p><ul><li>Our new eCommerce platform for new car buying, serving major car brands</li><li>Our web portal unhaggle.com</li><li>Several SaaS products we built for Enterprise clients</li><li>Widgets we built for third-party integration, they run in some of the most popular auto websites in Canada.</li><li>We take quality seriously and you should expect to be involved in well written code bases following industry standards and good software development practices.</li></ul><p>Requirements:</p><ul><li>At least 3 years of Javascript professional experience.</li><li>At least 1 year of experience with the Django Web Framework is a bigplus.</li><li>Strong web development experience: we expect that you know XHTML, CSS and Javascriptvery well. Hands on experience with Javascript frameworks is a big plus, specially Vue.js</li><li>Proficient and hands on experience with responsive web sites, including the Bootstrap library.</li><li>You care about writing semantic well formed code and paying attention to standards and good practices.</li><li>Experience using version control software, Git is a plus.</li><li>Track record of delivering completed projects, preferably web-based.</li><li>Easy-going personality. You will actively participate in design discussions and code review.</li></ul><p>Bonus:</p><ul><li>Some experience with Linux is a big plus. You will be asked to deploy changes to our dev machines that are based in Linux (Ubuntu server). </li><li>Some experience with Python and/or experience with Django would be a big plus.</li></ul><p>We are helping consumers to get the best price on new cars in Canada and changing the industry along the way. Working at Unhaggle brings unique challenges, you will have the opportunity to leave a large footprint and have real impact in the product we ship every day to our customers.</p><p>No relocation available, we are a distributed team.</p><p>Please submit resume and cover letter to <a href='mailto:evandro@unhaggle.com' rel='nofollow'>evandro@unhaggle.com</a></p>",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 2:03:24 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "tb8SaAqoSK-zOgHO69v6EQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16300079",
    "title": "Buzz | Lead Node.JS Engineer | Onsite and REMOTE, INTERNS | Full-time | Mountain View, CA",
    "content": "<div>                  <span>Buzz | Lead Node.JS Engineer | Onsite and REMOTE, INTERNS | Full-time | Mountain View, CA<p>Buzz is a community building tool for B2B companies to showcase their products and reach out to their audience directly.</p><p>Compensation: 90K per year + (%.5 - %1.0) vesting in 4 years. Numbers can vary based on experience and location.</p><p>Apply: info@getbuzz.io</p><p>We are looking for a Lead Node.js engineer.- Proficient with Javascript.- Lead development of backend components in Express JS, Node JS and related technologies.- Manage and lead backend development, undertake planning and approach for a feature.- Strong understanding of databases, normalization, caching. Knex.js and Sequelize experience is a plus. Design ER diagrams.- Experience with database optimizations and NoSQL databases is a plus.- Experience with real-time (e.g. Socket.io) is a plus.- JQuery experience is a plus.- Self-driven, diligent, values own and others' time. Understands importance of shipping.</p><p>Our day to day workflow involves planning, developing new backend features, update and optimize the backend architecture. We start by planning with the User Interface. The UI and its flows allows us to design the database models. We create ER diagrams to see the full picture in data models. Then we design the routes, urls, and define what needs to happen. We then write the logic that drives the feature. We take a holistic approach. We refactor features into sub-apps if needed. We write tests using Mocha and Chai. We measure response times, find bottlenecks and optimize.</p><p>We work remotely, using online tools. Our main office is in Mountain View, CA. We work flexible times, and encourage you to set up the best working environment for yourself.We are a small, tightly knit team who truly cares about this product. We are looking for someone who will be just as excited.</p><p>You have your own space, your time, lots of flexibility, and control. Your contributions will make direct impact on our product.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 12:36:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "BXNJKSOIT5KqH_wSN7x5sg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Senior+Consultant&c=Veeva&l=Remote&jk=c74e12e66ddbd903&rtk=1c5g89o025i96838&from=rss",
    "title": "Senior Consultant (EDC - Vault) - Veeva - Remote",
    "content": "<div><b>Senior Consultant (EDC - Vault)</b><br><span>Veeva</span>     -<span>Remote</span>    </div><span>Our Company<br><br>At 1,900 employees and growing and consistently strong financials (NYSE: VEEV), Veeva was named among the top fastest growing public technology companies on Forbes’ annual Fast Tech 25 list. We build innovative cloud solutions for some of the world’s largest pharmas and biotechs, and we need great people like you to make it happen.<br><br>Our Culture &amp; People<br><br>Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It’s genuine, straight-forward, and no fuss.<br><br>Job Summary<br><br>Tired of working with old EDC technology? Looking for an opportunity to change how clinical trials, data and data are managed? Veeva’s Vault Electronic Data Capture (EDC) application will truly change how the industry runs clinical trials and we want you on our team!<br>Veeva Systems is looking for Senior Consultants who have deep design, configuration, data management, and clinical trial expertise with a passion for helping customers transform the way they manage their clinical trial data and content with Vault EDC.<br>As a key member of our EDC Professional Services team, the Senior Consultant will be at the forefront of our mission and responsible for three main things:<br>Understand our customers’ clinical trial and protocol requirements and implement a study design with the Vault EDC application adhering to Good Clinical Data Management Practices and Veeva standards to optimize value.<br>Responsible for authoring all specification documents used by team members and configuring the study design during the development phase of the project.<br>Train and mentor customers and clinical sites who are working with the Vault EDC application or are new to clinical trials.<br>Opportunities are available across the United States for this role. The work location is remote within the U.S. Qualified U.S. based candidates are encouraged to apply.<br><br>Responsibilities<br>Work with customers to review and understand clinical protocol requirements and prepare, review and finalize all project specifications applying industry and Veeva best practices<br>Configure Veeva products during development<br>Support developers and testers during the project lifecycle<br>Support the requirements gathering and specification creation process for all study integrations<br>Conduct on-site or remote user acceptance testing with the customer including coordination of all feedback, resolution of issues and acceptance of the study<br>Create user acceptance testing scripts (if applicable)<br>Support go live activities for the study to ensure a smooth transition of the study to the customer<br>Review requirements as part of the change management process and update specifications and configurations as necessary with associated scoping activities<br>Support services pre-sales activities including review of customer requirements and scoping<br>Act as the customers trusted advisor to ensure that the study trial design is configured in such a way that it meets the customer's goals and offers the full benefits of Veeva’s EDC application<br>Engage with the training group to plan study training and deliver internal external training as needed at investigator meetings and clinical sites (if applicable)<br>Notify project management of project risks and develop contingency plans as necessary<br>Ensure customer success from beginning to end of the project life cycle<br>Assure process compliance with all regulatory and Veeva procedural requirements<br>Participate and contribute to process, product, or best practices initiatives<br>Adherence to all Veeva and EDC Services procedures and policies Requirements<br><br>5+ years’ direct experience working with EDC clinical software solutions in clinical operations, and/or trial management in a project management/consultant role<br>Experience in interpreting clinical protocols and translating requirements into software specifications including writing and reviewing technical documentation<br>Experience in a customer-facing role, preferably with a software professional services organization or consulting background is preferred<br>Working Knowledge of Clinical Trial processes across pharmaceuticals, device and/or biotech sectors, specifically as they relate to design, document, and data collection<br>Ability and willingness to “roll up your sleeves” to implement a clinical solution<br>Ability to quickly understand business requirements<br>Proven ability to work independently in a dynamic, fast-moving environment, but also as part of a team<br>Logical approach to problem solving<br>Ability to manage multiple tasks and project deliverables<br>Proven track record of meeting project timelines/deliverables and attention to detail, process, deadlines, and quality results<br>Demonstrated success with customers during project assessment, planning, development, training and implementation.<br>Excellent verbal and written communication, interpersonal, and presentation skills<br>Expert on life sciences compliance and computer systems validation requirements<br>Ability to travel 25-30% (may include international)<br>4-year college degree required<br>Qualified candidates must be legally authorized to be employed in the United States. Veeva Systems does not anticipate providing sponsorship for employment visa status (e.g., H-1B or TN status) for this employment position. Nice to Have<br><br>Life sciences industry experience and knowledge of clinical trial process preferred (pharmaceutical, biotech, medical device companies, CRO’s and academic &amp; public health organizations).<br>Direct experience with EDC systems such as Medidata RAVE or Oracle/Phase Forward InForm<br>Experience working with system integrators for IVRS, medical coding, eSource, CTMS, eTMF, and other clinical technologies<br>Life Science, computer science or related degree<br>Familiarity with CDISC, ODM and other data management industry standards<br>JAVA experience and technical skills<br>SaaS/Cloud experience in the delivery of clinical trials<br>Enterprise experience and knowledge transfer for running clinical trials with EDC<br>Experience with training for clinical sites and at investigator meetings<br>Consulting experience<br>Locality to major life sciences customer hub (NJ; Boston, MA; San Francisco, CA; Philadelphia, PA; Chicago, IL)<br><br>Veeva is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity or expression, religion, national origin or ancestry, age, disability, marital status, pregnancy, protected veteran status, protected genetic information, political affiliation, or any other characteristics protected by local laws, regulations, or ordinances.</span>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:01:14 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/java",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "go",
      "java"
    ]
  },
  {
    "id": "-mdm03pgRQ-JFXWhietquw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Associate+Technical+Consultant&c=Veeva&l=Remote&jk=a6fbf5507b6f3bc5&rtk=1c5g89oku144k3lk&from=rss",
    "title": "Associate Technical Consultant, Network (MDM) - Veeva - Remote",
    "content": "<div><b>Associate Technical Consultant, Network (MDM)</b><br><span>Veeva</span>     -<span>Remote</span>    </div><span>Our Company<br><br>At 1,900 employees and growing, and consistently strong financials (NYSE: VEEV), Veeva was named among the top fastest growing public technology companies on Forbes’ annual Fast Tech 25 list. We build innovative cloud solutions for some of the world’s largest pharmas and biotechs, and we need great people like you to make it happen.<br><br>Our Culture &amp; People<br><br>Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It’s genuine, straight-forward, and no fuss. Job Summary<br><br>Veeva Network is the industry’s first complete, cloud-based customer master data solution that combines healthcare professional, healthcare organization, affiliations and reference data, software and stewardship services in a single solution that’s seamlessly integrated with Veeva CRM. Veeva Network harnesses the ‘network effect’ of life sciences companies electing to work together to contribute updates to master data repository. The result is accurate, complete and always up-to-date customer data within Veeva CRM.<br>As an Associate Technical Consultant, you will be a member of the Veeva Systems Professional Services group implementing the Veeva Network solution for companies in the life sciences industry. Participate in business and system integration process due diligence, solution design, integration analysis, and data quality assessment to help deliver successful Network implementations for Veeva customers. Collaborate with experienced Consultants and Sr. Consultants to develop consulting, technical analysis, and master data management skills.<br><br>Ideally located in France, Germany, Spain or UK.<br><br>Responsibilities<br><br>Support data quality assessment and data flow analysis of Customer systems<br>Support mapping of legacy systems and Customer attributes to the Network for migration<br>Provide subject matter expertise on the Veeva Network solution<br>Data migration between Customer systems and the Veeva application suite<br>Solution Testing and Documentation Requirements<br><br>Willing to travel up to 75%<br>Excellent verbal and written communication skills are essential as position is client facing<br>Data Transformation and Data Loading Tools<br>Experience with database design and workflow<br>Bachelor’s degree in Business/ Management Information Systems, Computer Science, Computer Engineering, Math, Mechanical Engineering, or other similar degree or commensurate work experience is preferred<br>Fluent in English Nice to Have<br><br>Community involvement or organizational leadership experience is a plus<br><b>Exposure to the following technical disciplines:</b> Web Services, ETL, SQL, Force.com<br>Additional European language(s)</span>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:01:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "y4XxpGV2RICqfW2eFp6I1A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Associate+Technical+Consultant&c=Veeva&l=Remote&jk=a6fbf5507b6f3bc5&rtk=1c5gchuka92paene&from=rss",
    "title": "Associate Technical Consultant, Network (MDM) - Veeva - Remote",
    "content": "<div><b>Associate Technical Consultant, Network (MDM)</b><br><span>Veeva</span>     -<span>Remote</span>    </div><span>Our Company<br><br>At 1,900 employees and growing, and consistently strong financials (NYSE: VEEV), Veeva was named among the top fastest growing public technology companies on Forbes’ annual Fast Tech 25 list. We build innovative cloud solutions for some of the world’s largest pharmas and biotechs, and we need great people like you to make it happen.<br><br>Our Culture &amp; People<br><br>Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It’s genuine, straight-forward, and no fuss. Job Summary<br><br>Veeva Network is the industry’s first complete, cloud-based customer master data solution that combines healthcare professional, healthcare organization, affiliations and reference data, software and stewardship services in a single solution that’s seamlessly integrated with Veeva CRM. Veeva Network harnesses the ‘network effect’ of life sciences companies electing to work together to contribute updates to master data repository. The result is accurate, complete and always up-to-date customer data within Veeva CRM.<br>As an Associate Technical Consultant, you will be a member of the Veeva Systems Professional Services group implementing the Veeva Network solution for companies in the life sciences industry. Participate in business and system integration process due diligence, solution design, integration analysis, and data quality assessment to help deliver successful Network implementations for Veeva customers. Collaborate with experienced Consultants and Sr. Consultants to develop consulting, technical analysis, and master data management skills.<br><br>Ideally located in France, Germany, Spain or UK.<br><br>Responsibilities<br><br>Support data quality assessment and data flow analysis of Customer systems<br>Support mapping of legacy systems and Customer attributes to the Network for migration<br>Provide subject matter expertise on the Veeva Network solution<br>Data migration between Customer systems and the Veeva application suite<br>Solution Testing and Documentation Requirements<br><br>Willing to travel up to 75%<br>Excellent verbal and written communication skills are essential as position is client facing<br>Data Transformation and Data Loading Tools<br>Experience with database design and workflow<br>Bachelor’s degree in Business/ Management Information Systems, Computer Science, Computer Engineering, Math, Mechanical Engineering, or other similar degree or commensurate work experience is preferred<br>Fluent in English Nice to Have<br><br>Community involvement or organizational leadership experience is a plus<br><b>Exposure to the following technical disciplines:</b> Web Services, ETL, SQL, Force.com<br>Additional European language(s)</span>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:01:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "AOIjSu83SnyZ05-yI9CYMg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Associate+Technical+Consultant&c=Veeva&l=Remote&jk=a6fbf5507b6f3bc5&rtk=1c5gm7ns49ma3ej6&from=rss",
    "title": "Associate Technical Consultant, Network (MDM) - Veeva - Remote",
    "content": "<div><b>Associate Technical Consultant, Network (MDM)</b><br><span>Veeva</span>     -<span>Remote</span>    </div><span>Our Company<br><br>At 1,900 employees and growing, and consistently strong financials (NYSE: VEEV), Veeva was named among the top fastest growing public technology companies on Forbes’ annual Fast Tech 25 list. We build innovative cloud solutions for some of the world’s largest pharmas and biotechs, and we need great people like you to make it happen.<br><br>Our Culture &amp; People<br><br>Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It’s genuine, straight-forward, and no fuss. Job Summary<br><br>Veeva Network is the industry’s first complete, cloud-based customer master data solution that combines healthcare professional, healthcare organization, affiliations and reference data, software and stewardship services in a single solution that’s seamlessly integrated with Veeva CRM. Veeva Network harnesses the ‘network effect’ of life sciences companies electing to work together to contribute updates to master data repository. The result is accurate, complete and always up-to-date customer data within Veeva CRM.<br>As an Associate Technical Consultant, you will be a member of the Veeva Systems Professional Services group implementing the Veeva Network solution for companies in the life sciences industry. Participate in business and system integration process due diligence, solution design, integration analysis, and data quality assessment to help deliver successful Network implementations for Veeva customers. Collaborate with experienced Consultants and Sr. Consultants to develop consulting, technical analysis, and master data management skills.<br><br>Ideally located in France, Germany, Spain or UK.<br><br>Responsibilities<br><br>Support data quality assessment and data flow analysis of Customer systems<br>Support mapping of legacy systems and Customer attributes to the Network for migration<br>Provide subject matter expertise on the Veeva Network solution<br>Data migration between Customer systems and the Veeva application suite<br>Solution Testing and Documentation Requirements<br><br>Willing to travel up to 75%<br>Excellent verbal and written communication skills are essential as position is client facing<br>Data Transformation and Data Loading Tools<br>Experience with database design and workflow<br>Bachelor’s degree in Business/ Management Information Systems, Computer Science, Computer Engineering, Math, Mechanical Engineering, or other similar degree or commensurate work experience is preferred<br>Fluent in English Nice to Have<br><br>Community involvement or organizational leadership experience is a plus<br><b>Exposure to the following technical disciplines:</b> Web Services, ETL, SQL, Force.com<br>Additional European language(s)</span>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:01:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "DjQxlK95RWKteYeo0A5TGA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Associate+Technical+Consultant&c=Veeva&l=Remote&jk=a6fbf5507b6f3bc5&rtk=1c5gsus169tlkba1&from=rss",
    "title": "Associate Technical Consultant, Network (MDM) - Veeva - Remote",
    "content": "<div><b>Associate Technical Consultant, Network (MDM)</b><br><span>Veeva</span>     -<span>Remote</span>    </div><span>Our Company<br><br>At 1,900 employees and growing, and consistently strong financials (NYSE: VEEV), Veeva was named among the top fastest growing public technology companies on Forbes’ annual Fast Tech 25 list. We build innovative cloud solutions for some of the world’s largest pharmas and biotechs, and we need great people like you to make it happen.<br><br>Our Culture &amp; People<br><br>Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It’s genuine, straight-forward, and no fuss. Job Summary<br><br>Veeva Network is the industry’s first complete, cloud-based customer master data solution that combines healthcare professional, healthcare organization, affiliations and reference data, software and stewardship services in a single solution that’s seamlessly integrated with Veeva CRM. Veeva Network harnesses the ‘network effect’ of life sciences companies electing to work together to contribute updates to master data repository. The result is accurate, complete and always up-to-date customer data within Veeva CRM.<br>As an Associate Technical Consultant, you will be a member of the Veeva Systems Professional Services group implementing the Veeva Network solution for companies in the life sciences industry. Participate in business and system integration process due diligence, solution design, integration analysis, and data quality assessment to help deliver successful Network implementations for Veeva customers. Collaborate with experienced Consultants and Sr. Consultants to develop consulting, technical analysis, and master data management skills.<br><br>Ideally located in France, Germany, Spain or UK.<br><br>Responsibilities<br><br>Support data quality assessment and data flow analysis of Customer systems<br>Support mapping of legacy systems and Customer attributes to the Network for migration<br>Provide subject matter expertise on the Veeva Network solution<br>Data migration between Customer systems and the Veeva application suite<br>Solution Testing and Documentation Requirements<br><br>Willing to travel up to 75%<br>Excellent verbal and written communication skills are essential as position is client facing<br>Data Transformation and Data Loading Tools<br>Experience with database design and workflow<br>Bachelor’s degree in Business/ Management Information Systems, Computer Science, Computer Engineering, Math, Mechanical Engineering, or other similar degree or commensurate work experience is preferred<br>Fluent in English Nice to Have<br><br>Community involvement or organizational leadership experience is a plus<br><b>Exposure to the following technical disciplines:</b> Web Services, ETL, SQL, Force.com<br>Additional European language(s)</span>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:01:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "6W8APqotReOsHIMcONhTfQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16291549",
    "title": "CareMessage (YC W14) | Remote | https://caremessage.org",
    "content": "<div>                  <span>CareMessage (YC W14) | Remote | <a href='https://caremessage.org' rel='nofollow'>https://caremessage.org</a><p>CareMessage is looking for a Front End Software Engineer to help build the next generation of our web application to streamline care management and deliver interactive mobile programs to improve health outcomes. You will specialize in building responsive and elegant web applications that scale to millions of users in multiple languages.Our engineering team follows agile principles in a test driven development process. We are a remote first team that values open collaboration and shared ownership.</p><p>More info: <a href='https://boards.greenhouse.io/caremessage/jobs/220283' rel='nofollow'>https://boards.greenhouse.io/caremessage/jobs/220283</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 6:02:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "e2MlNg5JQpiE2shd6zgdtA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16291429",
    "title": "SpotHero | Chicago, IL | http://spothero.com",
    "content": "<div>                  <span>SpotHero | Chicago, IL | <a href='http://spothero.com' rel='nofollow'>http://spothero.com</a><p>SpotHero is changing parking, and our tools will redefine the transportation industry. With over a million cars parked, fast growth, and solid funding (<a href='https://angel.co/spothero' rel='nofollow'>https://angel.co/spothero</a>), SpotHero offers countless ways to make an impact on the company and your career.</p><p>Engineering Manager, HeroTech (IoT) Team - <a href='https://spothero.com/careers/996095' rel='nofollow'>https://spothero.com/careers/996095</a> (Chicago or Baltimore)</p><p>Senior Engineering Manager, Operations - <a href='https://spothero.com/careers/988529' rel='nofollow'>https://spothero.com/careers/988529</a> (Chicago or Baltimore)</p><p>Senior Engineer, Consumer - <a href='https://spothero.com/careers/1019222' rel='nofollow'>https://spothero.com/careers/1019222</a> (Chicago or remote)</p><p>Senior Engineer, Search - <a href='https://spothero.com/careers/988520' rel='nofollow'>https://spothero.com/careers/988520</a> (Chicago or remote)</p><p>Staff Engineer, Consumer - <a href='https://spothero.com/careers/993048' rel='nofollow'>https://spothero.com/careers/993048</a> (Chicago or remote)</p><p>To apply, please email your resume to jobs@spothero.com. Include any GitHub account, LinkedIn profile, and any project that you’re particularly proud of. We love seeing work that others loved working on.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 5:53:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "OQOu8aoXSn2CH3reWpqCFg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16291244",
    "title": "Signal | Full-Time | SF or REMOTE in US We build the Signal private messaging app. Seeking engineers and designers who ...",
    "content": "<div>                  <span>Signal | Full-Time | SF or REMOTE in US<p>We build the Signal private messaging app.</p><p>Seeking engineers and designers who are passionate about delightful, intuitive and reliable software.</p><p></p><pre><code>  * Service Eng.  * Android Eng.  * Desktop Eng. (Electron &amp; web stack)  * Designer (UX, Graphic Design, etc)</code></pre>At Signal you can:<p></p><pre><code>  * Join a diverse team.  * Put the customer first.  * Build free &amp; open source software.  * Contribute to a fast-growing product.  * Engage with hard problems.  * Take ownership within your discipline.  * Shape the product as a whole.  * Participate in collective decision-making.  * Work remotely.  * Enjoy work-life balance.</code></pre><a href='https://signal.org/' rel='nofollow'>https://signal.org/</a>workwithus@whispersystems.org<p><a href='https://www.keyvalues.com/signal' rel='nofollow'>https://www.keyvalues.com/signal</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 5:31:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "4F_5NcGbQrCMk8r7egW-oA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16286925",
    "title": "GitHub | San Francisco, CA (HQ); Boulder, CO; Amsterdam; Tokyo; Remote (65%) | Onsite and Remote-OK | https://github.com GitHub ...",
    "content": "<div>                  <span>GitHub | San Francisco, CA (HQ); Boulder, CO; Amsterdam; Tokyo; Remote (65%) | Onsite and Remote-OK | <a href='https://github.com' rel='nofollow'>https://github.com</a><p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over 24 million people use GitHub to build amazing things together across 67 million repositories. With the collaborative features of GitHub.com and GitHub Business, it has never been easier for individuals and teams to write faster, better code.</p><p>To learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: <a href='https://www.keyvalues.com/github' rel='nofollow'>https://www.keyvalues.com/github</a></p><p>Some of our open positions:</p><p>* Elasticsearch Infrastructure Engineer - Remote, US: <a href='https://boards.greenhouse.io/github/jobs/877285#.Wmkka5M-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/877285#.Wmkka5M-dTY</a></p><p>* Engineering Manager, Atom: <a href='https://boards.greenhouse.io/github/jobs/983209#.WmkkbZM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/983209#.WmkkbZM-dTY</a></p><p>* Marketplace Engineering Manager: <a href='https://boards.greenhouse.io/github/jobs/937423#.WmkkcJM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/937423#.WmkkcJM-dTY</a></p><p>* Senior Data Analyst - Infrastructure: <a href='https://boards.greenhouse.io/github/jobs/961302#.WmkkcpM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/961302#.WmkkcpM-dTY</a></p><p>* Senior Engineer Developer Experience: <a href='https://boards.greenhouse.io/github/jobs/993602#.WmkkcpM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/993602#.WmkkcpM-dTY</a></p><p>* Senior Software Engineer - Canada: <a href='https://boards.greenhouse.io/github/jobs/983510#.WmkkdJM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/983510#.WmkkdJM-dTY</a></p><p>* Senior Software Engineer - US: <a href='https://boards.greenhouse.io/github/jobs/953424#.WmkkdJM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/953424#.WmkkdJM-dTY</a></p><p>* Site Reliability Engineer - Data Center: <a href='https://boards.greenhouse.io/github/jobs/875386#.WmkkdpM-dTY' rel='nofollow'>https://boards.greenhouse.io/github/jobs/875386#.WmkkdpM-dTY</a></p><p>Tech Stack: GitHub is a Rails 4 application that is composed of a large monolith and a constellation of services written in Ruby, Go, and a handful of other languages.  The app and its services are exposed both internally and externally via a GraphQL API.  We primarily rely on MySQL for persistent storage, Redis for temporary storage, and, as you might expect, a lot of git repositories.  We rely on Kubernetes for container orchestration.</p><p>email kirstenwright@github.com with questions!<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 1:27:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/ruby",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "ruby"
    ]
  },
  {
    "id": "xlWlrGgkQKmXWK0Qv6I7FQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16286347",
    "title": "Infinite Food | Mechanical Design Engineers / Mechanical Engineers | Shenzhen, China | $neg + equity available | Full-time or REMOTE |",
    "content": "<div>                  <span>Infinite Food | Mechanical Design Engineers / Mechanical Engineers | Shenzhen, China | $neg + equity available | Full-time or REMOTE | <a href='http://8-food.com/' rel='nofollow'>http://8-food.com/</a><p>Early stage Shenzhen-based, Hong Kong registered company with two years of IP seeking talented Mechanical Design Engineers with fluency in Solidworks. Working language is English, Mandarin or regional languages well regarded. Broad range of interesting work focusing on automation and industrial products, rapid prototyping and iteration with supporting electrical, software, logistics and machine learning engineers. Experience with CFD (heat, fluid and airflow modeling), electrical and food safety regulation in any market, experience with production in thermoform, injection molding, blow molding, extrusion well regarded. Private office in Shenzhen (Houhai, near HK/Shenzhen Wan border crossing). Physical presence encouraged but not a daily requirement.</p><p>Mandarin speakers well regarded, but Chinese knowledge is not required. Clear written technical communication in English is mandatory. Skills and experience first, qualifications a distant second. We respect execution.</p><p>Email in profile, please include 'Candidate: Mechanical Engineer' in subject. No recruiters.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 12:04:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "7ccGMYi4TmayOrc7PhRxbA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16286127",
    "title": "ACLU -- National HQ, NYC | (remote is fine for eng positions)",
    "content": "<div>                  <span>ACLU -- National HQ, NYC | (remote is fine for eng positions)<p>+ Director of Data — Establish our Data Science &amp; Analytics team, leading building out data-driven strategies for all of the ACLU’s efforts</p><p>+ Fullstack Engineer — Development for advocacy, mobilization, fundraising and education digital products</p><p>+ Product Designer — UX &amp; UI design for new constituent-facing digital products</p><p>+ Data Analyst, Digital — Analyst driving strategy for all of ACLU’s digital efforts (website, online fundraising, email, social, etc)</p><p>+ Salesforce Technical Product Manager — Own, drive, improve the ACLU’s Salesforce roadmap</p><p>+ Salesforce Developer — Lead development on Salesforce</p><p>All jobs listed here: <a href='https://www.aclu.org/careers?office=26' rel='nofollow'>https://www.aclu.org/careers?office=26</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 11:36:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "d8bgVe1oScuIFzSfjMnLag",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16285579",
    "title": "Take a stab at our little challenge and ensure your CV gets reviewed by our team: curl https://challenge.curbside.com ...",
    "content": "<div>                  <span>Take a stab at our little challenge and ensure your CV gets reviewed by our team: curl <a href='https://challenge.curbside.com' rel='nofollow'>https://challenge.curbside.com</a>Curbside is enabling a new way to shop, built for the era of instant mobile commerce. The Curbside app makes it easy to find, buy and pickup products at nearby stores. Curbside searches realtime local inventory across retailers and uses location-based technologies to alert stores when a customer is arriving for a pickup. Curbside helps consumers quickly get what they need and helps retailers better serve their increasingly mobile centric customers. The Curbside Merchant Console enables alerts to staff as customers arrive to pick up orders and also manages online order workflow.<p>Curbside’s investors include Sutter Hill Ventures, Index Ventures, Jerry Yang’s AME Cloud Ventures, Qualcomm Ventures, Eric Schmidt’s Innovation Endeavors, O’Reilly AlphaTech Ventures, Gil Elbaz &amp; David Waxman’s TenOneTen and Chicago Ventures.</p><p>Tech Stack: Clojure, Python, Javascript, iOS, Android, Elasticsearch</p><p>Problem space: mobile commerce, big data, search, machine learning, reverse engineering, distributed systems, location services, user experience.</p><p><a href='https://curbside.com/jobs' rel='nofollow'>https://curbside.com/jobs</a> • Palo Alto, Ca. • Relocation Available • Sorry at this time we cannot sponsor NEW H-1B’s, but we can transfer existing visa’s and sponsor new E3’s, TN’s, and O-1’s.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 10:33:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "8SkRsDkWSpKsarJnI_udpA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16285356",
    "title": "MailChimp (https://mailchimp.com/about/jobs/) | Atlanta Brooklyn Oakland | Full-Time (FT) & Internships (INTERNS) MailChimp is the world’s leading ...",
    "content": "<div>                  <span>MailChimp (<a href='https://mailchimp.com/about/jobs/' rel='nofollow'>https://mailchimp.com/about/jobs/</a>) | Atlanta Brooklyn Oakland | Full-Time (FT) &amp; Internships (INTERNS)<p>MailChimp is the world’s leading marketing automation platform, and we send more than a billion emails a day. We democratize technology for small businesses, creating innovative products that empower our customers to grow.</p><p>I'm a Python / Go tooling engineer in Operations. I'm remote along with a handful of others. We've recently opened satellite offices in Brooklyn &amp; Oakland.</p><p>There are multiple job listings at <a href='https://mailchimp.com/about/jobs/' rel='nofollow'>https://mailchimp.com/about/jobs/</a> for all available positions / locations. To apply click on the job that best suits you and click on the button in the &quot;Apply Now&quot; box at the bottom of the posting.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 10:06:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/python",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "go",
      "python"
    ]
  },
  {
    "id": "j4R5IV79SvGPKEw4decGOQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16284702",
    "title": "HealthPrize | Software Dev | NYC / Norwalk, CT | REMOTE Full-time | https://www.healthprize.com/",
    "content": "<div>                  <span>HealthPrize | Software Dev | NYC / Norwalk, CT | REMOTE Full-time | <a href='https://www.healthprize.com/' rel='nofollow'>https://www.healthprize.com/</a><p>At HealthPrize, we are changing the way people think about their medication and their health! Our growth is being fueled by work with leading brands in life sciences such as Abbott, Walgreens, and Gilead. Join the close-knit engineering team that designs &amp; develops our industry leading patient engagement platform and work with us to measurably improve the state of healthcare globally.</p><p>Frontend Hypewords: React/Redux for our reference impl. but we use other PWA stacks too - Vue.js/Vuex/Vuetify is next up</p><p>Backend Hypewords: Java/Kotlin, Amazon Aurora, Redis, Spring-Boot, Docker, Swagger, API Gateway</p><p>Systems Hypewords: AWS, Terraform, Ansible, AWS ECS/EKS, RDS, Datadog</p><p>Senior Platform Engineer: <a href='https://healthprize.com/careers-page/#op-205414-senior-platf..' rel='nofollow'>https://healthprize.com/careers-page/#op-205414-senior-platf...</a>.</p><p>Lead Site Reliability Engineer: <a href='https://healthprize.com/careers-page/#op-208838-lead-systems...' rel='nofollow'>https://healthprize.com/careers-page/#op-208838-lead-systems...</a>.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 9:06:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "TFNtgT1FTIWbPM9b_5Kiew",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Positive+Behaviour+Support+Consultant&c=PBS+UK&l=Remote&jk=70c7c1ce24dc094a&rtk=1c5g89oku144k3lk&from=rss",
    "title": "Positive Behaviour Support Consultant - PBS UK - Remote",
    "content": "<div><b>Positive Behaviour Support Consultant</b><br><span>PBS UK</span>     -<span>Remote</span>    <div>        <span>Part-time</span>        </div></div><span><p><b>Job Summary</b></p><p>PBS uk are looking for people to work ‘with’! We use that term considerately. We are aware that people are looking for a certain degree of flexibility in their lives these days and we embrace that. It is certainly what we promote for the people we support, it is what we like a little bit of ourselves and it is what we want for the people we work with too! Therefore we are putting this advert out to explore how people might like to work with us.</p><p>To let you know a little bit about PBSuk, we set up in 2016 and have been getting busier and busier ever since. We consider ourselves incredibly fortunate as we know a lot of start up businesses really struggle (and many shut in their first 24 months). We also consider ourselves fortunate as we have worked with such a range of people, customers and clients on such a wide variety topics (bespoke direct intervention work (children and adults), working with families, joint working with charities, large organisational workforce development, strategic development, conference contributions (presentations and development)…we could go on!)</p><p>With our combined experience over the years we feel that we are in a position to constructively contribute to these varied fields. We are also conscious that you never stop learning, and so we are always seeking new people to work with and appropriate supervision, coaching and mentorship. So, what we are trying to find out is, <b>would anyone like to join our team?</b> We are happy to <b>explore salaried employed positions or to continue our collaboration with associates</b> .The attached advert gives an idea of what we are considering regarding salaried employment.If anyone would like more information please get in touch!</p><p><b>Responsibilities and Duties</b></p><ul><li>Functional Behaviour Assessments,</li><li>Functional Analysis,</li><li>Transition support,</li><li>Developing person centred approaches to delivering behavioural intervention,</li><li>Supporting the implementation of those interventions,</li><li>Supporting families with behavioural home programmes,</li><li>Staff training,</li><li>Supporting companies to develop PBS Strategies that are effective,</li><li>Presenting at conferences, and</li><li>Conducting research.</li></ul><p><b>Qualifications and Skills</b></p><p>The successful candidate will hold, or be working towards a formal qualification in Positive Behaviour Support i.e. PBS BTEC (advanced professional Diploma), BSc in Intellectual and Developmental Disabilities, MSc in Analysis and Intervention in Learning Disability, or Applied Behaviour Analysis.</p><p>Board Certified Behaviour Analyst status is desirable, not essential.</p><p><b>Benefits</b></p><p>To be discussed.</p><p>Job Type: Part-time</p><p>Required experience:</p><ul><li>Positive Behaviour Support: 1 year</li></ul></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 9:00:28 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "ZtMcmiuLS7-3SPFUbolhjA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Positive+Behaviour+Support+Consultant&c=PBS+UK&l=Remote&jk=70c7c1ce24dc094a&rtk=1c5gchuka92paene&from=rss",
    "title": "Positive Behaviour Support Consultant - PBS UK - Remote",
    "content": "<div><b>Positive Behaviour Support Consultant</b><br><span>PBS UK</span>     -<span>Remote</span>    <div>        <span>Part-time</span>        </div></div><span><p><b>Job Summary</b></p><p>PBS uk are looking for people to work ‘with’! We use that term considerately. We are aware that people are looking for a certain degree of flexibility in their lives these days and we embrace that. It is certainly what we promote for the people we support, it is what we like a little bit of ourselves and it is what we want for the people we work with too! Therefore we are putting this advert out to explore how people might like to work with us.</p><p>To let you know a little bit about PBSuk, we set up in 2016 and have been getting busier and busier ever since. We consider ourselves incredibly fortunate as we know a lot of start up businesses really struggle (and many shut in their first 24 months). We also consider ourselves fortunate as we have worked with such a range of people, customers and clients on such a wide variety topics (bespoke direct intervention work (children and adults), working with families, joint working with charities, large organisational workforce development, strategic development, conference contributions (presentations and development)…we could go on!)</p><p>With our combined experience over the years we feel that we are in a position to constructively contribute to these varied fields. We are also conscious that you never stop learning, and so we are always seeking new people to work with and appropriate supervision, coaching and mentorship. So, what we are trying to find out is, <b>would anyone like to join our team?</b> We are happy to <b>explore salaried employed positions or to continue our collaboration with associates</b> .The attached advert gives an idea of what we are considering regarding salaried employment.If anyone would like more information please get in touch!</p><p><b>Responsibilities and Duties</b></p><ul><li>Functional Behaviour Assessments,</li><li>Functional Analysis,</li><li>Transition support,</li><li>Developing person centred approaches to delivering behavioural intervention,</li><li>Supporting the implementation of those interventions,</li><li>Supporting families with behavioural home programmes,</li><li>Staff training,</li><li>Supporting companies to develop PBS Strategies that are effective,</li><li>Presenting at conferences, and</li><li>Conducting research.</li></ul><p><b>Qualifications and Skills</b></p><p>The successful candidate will hold, or be working towards a formal qualification in Positive Behaviour Support i.e. PBS BTEC (advanced professional Diploma), BSc in Intellectual and Developmental Disabilities, MSc in Analysis and Intervention in Learning Disability, or Applied Behaviour Analysis.</p><p>Board Certified Behaviour Analyst status is desirable, not essential.</p><p><b>Benefits</b></p><p>To be discussed.</p><p>Job Type: Part-time</p><p>Required experience:</p><ul><li>Positive Behaviour Support: 1 year</li></ul></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 9:00:28 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "fZbjB95hRT-DxCgr_rD-mQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Positive+Behaviour+Support+Consultant&c=PBS+UK&l=Remote&jk=70c7c1ce24dc094a&rtk=1c5gm7ns49ma3ej6&from=rss",
    "title": "Positive Behaviour Support Consultant - PBS UK - Remote",
    "content": "<div><b>Positive Behaviour Support Consultant</b><br><span>PBS UK</span>     -<span>Remote</span>    <div>        <span>Part-time</span>        </div></div><span><p><b>Job Summary</b></p><p>PBS uk are looking for people to work ‘with’! We use that term considerately. We are aware that people are looking for a certain degree of flexibility in their lives these days and we embrace that. It is certainly what we promote for the people we support, it is what we like a little bit of ourselves and it is what we want for the people we work with too! Therefore we are putting this advert out to explore how people might like to work with us.</p><p>To let you know a little bit about PBSuk, we set up in 2016 and have been getting busier and busier ever since. We consider ourselves incredibly fortunate as we know a lot of start up businesses really struggle (and many shut in their first 24 months). We also consider ourselves fortunate as we have worked with such a range of people, customers and clients on such a wide variety topics (bespoke direct intervention work (children and adults), working with families, joint working with charities, large organisational workforce development, strategic development, conference contributions (presentations and development)…we could go on!)</p><p>With our combined experience over the years we feel that we are in a position to constructively contribute to these varied fields. We are also conscious that you never stop learning, and so we are always seeking new people to work with and appropriate supervision, coaching and mentorship. So, what we are trying to find out is, <b>would anyone like to join our team?</b> We are happy to <b>explore salaried employed positions or to continue our collaboration with associates</b> .The attached advert gives an idea of what we are considering regarding salaried employment.If anyone would like more information please get in touch!</p><p><b>Responsibilities and Duties</b></p><ul><li>Functional Behaviour Assessments,</li><li>Functional Analysis,</li><li>Transition support,</li><li>Developing person centred approaches to delivering behavioural intervention,</li><li>Supporting the implementation of those interventions,</li><li>Supporting families with behavioural home programmes,</li><li>Staff training,</li><li>Supporting companies to develop PBS Strategies that are effective,</li><li>Presenting at conferences, and</li><li>Conducting research.</li></ul><p><b>Qualifications and Skills</b></p><p>The successful candidate will hold, or be working towards a formal qualification in Positive Behaviour Support i.e. PBS BTEC (advanced professional Diploma), BSc in Intellectual and Developmental Disabilities, MSc in Analysis and Intervention in Learning Disability, or Applied Behaviour Analysis.</p><p>Board Certified Behaviour Analyst status is desirable, not essential.</p><p><b>Benefits</b></p><p>To be discussed.</p><p>Job Type: Part-time</p><p>Required experience:</p><ul><li>Positive Behaviour Support: 1 year</li></ul></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 9:00:28 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "VwwlNiQiQImva3NJ05i7IA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Positive+Behaviour+Support+Consultant&c=PBS+UK&l=Remote&jk=70c7c1ce24dc094a&rtk=1c5gsus169tlkba1&from=rss",
    "title": "Positive Behaviour Support Consultant - PBS UK - Remote",
    "content": "<div><b>Positive Behaviour Support Consultant</b><br><span>PBS UK</span>     -<span>Remote</span>    <div>        <span>Part-time</span>        </div></div><span><p><b>Job Summary</b></p><p>PBS uk are looking for people to work ‘with’! We use that term considerately. We are aware that people are looking for a certain degree of flexibility in their lives these days and we embrace that. It is certainly what we promote for the people we support, it is what we like a little bit of ourselves and it is what we want for the people we work with too! Therefore we are putting this advert out to explore how people might like to work with us.</p><p>To let you know a little bit about PBSuk, we set up in 2016 and have been getting busier and busier ever since. We consider ourselves incredibly fortunate as we know a lot of start up businesses really struggle (and many shut in their first 24 months). We also consider ourselves fortunate as we have worked with such a range of people, customers and clients on such a wide variety topics (bespoke direct intervention work (children and adults), working with families, joint working with charities, large organisational workforce development, strategic development, conference contributions (presentations and development)…we could go on!)</p><p>With our combined experience over the years we feel that we are in a position to constructively contribute to these varied fields. We are also conscious that you never stop learning, and so we are always seeking new people to work with and appropriate supervision, coaching and mentorship. So, what we are trying to find out is, <b>would anyone like to join our team?</b> We are happy to <b>explore salaried employed positions or to continue our collaboration with associates</b> .The attached advert gives an idea of what we are considering regarding salaried employment.If anyone would like more information please get in touch!</p><p><b>Responsibilities and Duties</b></p><ul><li>Functional Behaviour Assessments,</li><li>Functional Analysis,</li><li>Transition support,</li><li>Developing person centred approaches to delivering behavioural intervention,</li><li>Supporting the implementation of those interventions,</li><li>Supporting families with behavioural home programmes,</li><li>Staff training,</li><li>Supporting companies to develop PBS Strategies that are effective,</li><li>Presenting at conferences, and</li><li>Conducting research.</li></ul><p><b>Qualifications and Skills</b></p><p>The successful candidate will hold, or be working towards a formal qualification in Positive Behaviour Support i.e. PBS BTEC (advanced professional Diploma), BSc in Intellectual and Developmental Disabilities, MSc in Analysis and Intervention in Learning Disability, or Applied Behaviour Analysis.</p><p>Board Certified Behaviour Analyst status is desirable, not essential.</p><p><b>Benefits</b></p><p>To be discussed.</p><p>Job Type: Part-time</p><p>Required experience:</p><ul><li>Positive Behaviour Support: 1 year</li></ul></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 9:00:28 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "ikrZ8oZETyOcf-FmGE9ZFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16284292",
    "title": "KEA | Bay Area | NLP, Telephony, Signal Processing | Full-time & interns, remote + onsite (preferred) | Python / Haskell | 4+ years of experience",
    "content": "<div>                  <span>KEA | Bay Area | NLP, Telephony, Signal Processing | Full-time &amp; interns, remote + onsite (preferred) | Python / Haskell | 4+ years of experience<p>KEA is a voice recognition platform that processes and places orders automatically for merchants when customers call in. We seamlessly transforms incoming speech into tickets fed directly into businesses’ POS systems.</p><p>We are looking for Haskell / Python 3 folks for building speech recognition phone systems for businesses. Email us at hello@kea.cloud</p><p>Equity options / market salary / accommodation (if needed)</p><p>More details: <a href='https://docs.google.com/document/d/167cFW4jBZ39VivngkW_LtFqwuHAssq7vk3BJqDhXikY/edit?usp=sharing' rel='nofollow'>https://docs.google.com/document/d/167cFW4jBZ39VivngkW_LtFqw...</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 8:25:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/other",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "other"
    ]
  },
  {
    "id": "C6aAl1g7QtaYSz4Lj6YTsg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283676",
    "title": "vVents | Backend, FullStack, Frontend developers, Interns (paid) | India | Full Time | REMOTE",
    "content": "<div>                  <span>vVents | Backend, FullStack, Frontend developers, Interns (paid) | India | Full Time | REMOTE<p>We are building a live streaming product and several functionalities around it. Our backend/streaming team uses several custom and open source media and streaming servers. We are currently hiring people for following open positions.</p><p>1. Backend Engineer (ES6/NodeJS/MongoDB/PostgreSQL) - Experience in NodeJS is necessary and should be able to work with APIs fluently. Also, experience with MongoDB, PostgreSql, Docker, Azure/AWS, Jenkins is required. (Exp 3+ years needed)</p><p>2. Fullstack Engineer (ES6/NodeJS/ReactJS) - Experience in ReactJS is absolutely necessary along with NodeJs, PostgreSql, MongoDB. (Exp 3+ years needed)</p><p>3. Frontend Engineer (ES6/ReactJS/ReactNative) - Experience in ReactJS + Redux and React Native + Redux is absolutely necessary along with other frontend related technologies. (Exp 3+ years needed)</p><p>4. Interns (paid) - We're hiring interns with one goal, to nurture them and employ them full time if they excelled in their internship period. This role has no specific stack attached to it. But we atleast expect that interns should know how to code in JS, HTML/CSS and should have strong computer science fundamentals. Also, this position if selected will require you to work for specific time period. On completion of that time period then full time employment will be considered. Also, expect 50% learning and 50% working. We won't be teaching you entire stuff but guide you on the path. This role is remote as well.</p><p>We offer a competitive salary based on your experience and all other benefits. Salary is no bar for the right candidate.</p><p>To apply, please send your resumes/cv at hnfeb@okverygood.anyalias.com . Do add [HN-FEB] in the title.</p><p>Note: There are multiple positions for each role. Please apply only if you suffice the requirements.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:25:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "kwDMbNh1TluRJcTmXJ6tNA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283609",
    "title": "REMOTE (US Residents Only) or ONSITE in Connecticut/Virginia USA",
    "content": "<div>                  <span>REMOTE (US Residents Only) or ONSITE in Connecticut/Virginia USA<p>Emprise is an established nautical software and hardware company based in Ledyard, CT.</p><p>We're looking for several front-end developers with solid javascript/es6+ experience. Our application uses AngularJS (v1), lodash, html5, and scss. You'll also do a small amount of Java for server API endpoints/controllers.</p><p><a href='https://jobs.github.com/positions/b4de5f62-0520-11e8-8853-f946cd8a523c' rel='nofollow'>https://jobs.github.com/positions/b4de5f62-0520-11e8-8853-f9...</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:17:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/unknown",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones",
      "undefined job title"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "VZI5RMWVSI-xCvGamQ8m4A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283525",
    "title": "Crowdstrike | Irvine, Sunnyvale, Seattle, DC, Minneapolis, London, Bucharest, Remote | Fulltime | ONSITE or REMOTE | http://www.crowdstrike.com/ Crowdstrike Stops ...",
    "content": "<div>                  <span>Crowdstrike | Irvine, Sunnyvale, Seattle, DC, Minneapolis, London, Bucharest, Remote | Fulltime | ONSITE or REMOTE | <a href='http://www.crowdstrike.com/' rel='nofollow'>http://www.crowdstrike.com/</a><p>Crowdstrike Stops Breaches.</p><p>We're hiring software and devops engineers to take the lead on automating our software and systems. Give us a shout if you're interested in the following areas, with other information listed at <a href='http://www.crowdstrike.com/careers/' rel='nofollow'>http://www.crowdstrike.com/careers/</a>.  We've over 25 Engineering positions open right now.</p><p></p><pre><code>  * Cassandra/Elastic/Kafka/Spark/Splunk Scaling and Automation  * Chef/Python/AWS/Docker/Virtualization Scaling and Automation  * Public, Private, Hybrid Cloud and Datacenter Growth at Scale  * Securing systems internally and externally with a focus on automation and visibility</code></pre>I'm hiring 5 positions you can see on the career site:<p></p><pre><code>  * Sr. Virtualization Engineer  * Sr. Network Engineer  * Systems Data Science Engineer  * Data Center Technician (Bay or Sacramento)  * Sr. Systems Engineer (Linux Automation and Optimization)</code></pre>We have a real devops approach - very egalitarian and enabling of engineers. There's tremendous mutual respect and as a result, we get a lot of leading edge stuff done very efficiently.Come join us! See our jobs at <a href='http://www.crowdstrike.com/careers/' rel='nofollow'>http://www.crowdstrike.com/careers/</a>.<span>              </span><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:10:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "R1lUH8DNTAO985bRp5nRYQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283443",
    "title": "ReferWell | node.js contractor - 8-12 weeks | New York, NY / Upstate SC | REMOTE OK (US only), Contract | $50-$60 /hour",
    "content": "<div>                  <span>ReferWell | node.js contractor - 8-12 weeks | New York, NY / Upstate SC | REMOTE OK (US only), Contract | $50-$60 /hour<p>ReferWell ( <a href='https://www.referwell.com/' rel='nofollow'>https://www.referwell.com/</a> ) is delivering better outcomes for patients and better referrals for specialist and primary care doctors in the US.</p><p>Our main office is in Manhattan, and we have a developer presence near Spartanburg, SC, where we intend to set up a dev-focused office later this year.</p><p>The immediate need is for a contractor to assist in building out a hypermedia API for an ongoing partner integration.  The services making up this API run on a stack using docker, mysql, redis, and node.js.  The core need is for someone who is comfortable writing in a modern JS style (async/await, unit and bdt, etc), who avoids slow and unsafe patterns with SQL, and who has some experience with docker, ssh, git, and so forth.</p><p>Familiarity with any of JSON Hypermedia, OAuth2, AWS administration, microservices, Ansible, Consul, or Jenkins is a plus.</p><p>The contract is expected to last 8-12 calendar weeks, though number of hours for each week may vary.  We plan to get started in February, so the decision process should be short.</p><p>As mentioned, we will be setting up a physical office in SC in 2018; for a developer located in the Upstate, this contract could lead into a FT position.</p><p>Please use careers.dev@referwell.com to ask questions or send your details for consideration.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 7:02:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "v4JupIwYSEalagQhWbvzqA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16283171",
    "title": "Nexar | https://www.getnexar.com/ | Tel Aviv | REMOTE",
    "content": "<div>                  <span>Nexar | <a href='https://www.getnexar.com/' rel='nofollow'>https://www.getnexar.com/</a> | Tel Aviv | REMOTE<p>Nexar's mission to eliminate car collisions. We use AI, machine vision, sensor fusion, real-time networking and quite a few other buzzwords to create a new, delightful, and really safe, driving experience, powered by your smartphone, with the potential of saving the 1,300,000 people who die on the road every year.</p><p>We're growing quickly (<a href='https://blog.getnexar.com/nexar-has-raised-30-million-in-series-b-funding-and-is-expanding-its-exec-team-5e9a59775b4d' rel='nofollow'>https://blog.getnexar.com/nexar-has-raised-30-million-in-ser...</a>) and looking for mobile (mid/senior iOS &amp; Android) engineers and product designers to help meet the challenge and opportunity in front of us.</p><p>We have a few really amazing remote team members and looking to add more anywhere in the world.  The job descriptions below are for our office in Tel Aviv but again we're very excited to add some remote only team members as well:</p><p>- <a href='https://www.comeet.co/jobs/nexar/13.008/ios-developer/39.60E' rel='nofollow'>https://www.comeet.co/jobs/nexar/13.008/ios-developer/39.60E</a></p><p>- <a href='https://www.comeet.co/jobs/nexar/13.008/senior-android-developer/1B.603' rel='nofollow'>https://www.comeet.co/jobs/nexar/13.008/senior-android-devel...</a></p><p>- <a href='https://www.comeet.co/jobs/nexar/13.008/product-designer/39.60F' rel='nofollow'>https://www.comeet.co/jobs/nexar/13.008/product-designer/39....</a></p><p>If you have any questions feel free to contact me amitklein at getnexar dot com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 6:36:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "dotnet"
    ]
  },
  {
    "id": "QRirM87iQ8KGPVTpihztJA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/65788/fast-paced-nice-generalist-to-supercharge-our-growth-at-koru-kids/",
    "title": "Fast Paced, Nice Generalist to supercharge our growth",
    "content": "About Koru Kids<br />Koru Kids is London’s fastest growing childcare brand. We’re making it easier and more affordable for families to access high quality childcare.<br /><br />Our after school service matches parents in London with the top 10% of student nannies in London and our nanny share service helps families to share nannies with other local families.<br /><br />We don’t just believe in providing outstanding childcare to families, we are all about using technology to make it seamless for parents. We’ve been blown away by the response from parents and are consistently beating our growth targets.<br /><br />We are backed by fantastic investors, including top venture capitalists and business angels such as Michael Pennington the founder of Gumtree. We won the South of England region in the ‘Best of Britain’ awards 2017, and are currently shortlisted for several awards: the UK Business Awards 2017 as ‘Disruptor of the Year’, and in the Best Women Awards 2017 as ‘Best New Business’, ‘Best Technology’ and ‘Best company working with children and families’.<br /><br />About the Team<br />We have an informal, hard-working and kind team culture. We’re all passionate about our mission and are determined to create the world’s leading childcare brand. Every team member plays a vital role in achieving our goals and we work together so we can get there quicker. Our approach is fast paced – we are constantly challenging, testing and adapting the way we do things.<br /><br />Our founder is Rachel Carrell, the former CEO of DrThom.com, the world’s largest online doctor service, which she grew to over 1.3m paying users in 3 countries. She’s an Oxford alumn, ex-McKinsey, a Rhodes Scholar and a WEF Young Global Leader. Rachel’s joined by an amazing team with backgrounds including Cambridge, UCL, BCG, KPMG, and some of London’s top startups.<br /><br />We take great care with who we hire and all team members are superbly talented and most importantly really nice! If you’re brilliant AND humble, you’ll fit right in.<br /><br />About the role<br />We have huge growth plans for the business and we need someone to help us take our acquisition to the next level.<br /><br />You don’t need any prior marketing experience but you do need to be pro-active, a fast learner and not afraid to try new things.<br /><br />This role will suit someone who enjoys testing new ideas, validating them and gets a kick out of figuring out how to make things work. You need to be analytical and comfortable with numbers. You’ll be organised, comfortable working at a fast pace and able to task switch.<br /><br />You'll be comfortable taking ownership and be responsible for all our acquisition channels including Facebook, Google, SERP, Referrals and more.<br /><br />You’ll also spend time working on customer-facing operations. This means speaking to mums (sometimes dads and nannies, but usually mums) on the phone, and emailing/texting them. This will probably be at least 20% of the job. You’ll get to know our parents, what their needs are and therefore how we can best acquire new ones.<br /><br /><br />Your normal hours of work will be 9am to 6.30pm on weekdays but there may be times when late night are required to cope with spikes in demand. We know you have a private life and other commitments and we work as a team to make sure everyone has a good balance. You’ll normally work from our offices near Old St, although if you like to occasionally work from home that’s totally fine too we support flexibility as long as the work gets done!<br /><br />3 reasons this role is great: <br />1.    You will learn a TON. Marketing will be your main focus, but you’ll get plenty of exposure to operations, product, technology and other aspects of the business. You’ll learn how to found a business, about operations, marketing, technology, and finance. <br />2.    You’ll be making a huge difference to the everyday lives of parents in London. We’re building a business that will profoundly benefit children, women, and families. <br />3.    We’re well-connected in the startup world, so working with us will open lots of doors for you even if you leave. We’ve got a strong track record of helping people we’ve worked with<br /><br />About you<br />We’re after an all-rounder who is clever, practical, positive and nice. We don’t mind what degree you’ve done, as long as you’ve done well in it. We’ll also be looking for evidence of spark and energy in the extracurricular stuff you’ve done.<br /><br />Ideally you will have about 1-2 years of experience in the workforce already.<br /><br />You need to have excellent English – you’ll be writing compelling and concise copy to catch parents attention.<br /><br />You’ll be a key member of our team, and you’ll get all the training, coaching and support you need to do these things well.<br /><br />Essential skills <br />•    You’re able to write clearly, simply and accurately, with perfect spelling and grammar <br />•    You like working with numbers and data. We love people who love analysis <br />•    You’re comfortable with speaking to new people, both in person and on the phone <br />•    You’re emotionally intelligent. Although you’ll like to talk, the most important thing you’ll do is listen. Choosing childcare is an emotional decision, and you’ll need to help parents through the process <br />•    You’re a problem-solver. As we are a young company, there aren’t many fixed processes yet. That means you can create new processes, make suggestions, and tell us we’re doing things wrong <br />•    You roll with it. You understand that startups are unpredictable environments. You are comfortable with a degree of chaos <br />•    You’re nice. You get that no player is bigger than the team. You fit right into our culture of supporting and helping each other.<br /><br />Skills/experience that are not essential but would be fantastic <br />•    Passion for design or photography (you would need your own equipment, but again we could certainly create opportunities for you to practice)<br /><br />Benefits <br />•    Competitive salary dependent on experience <br />•    We work from a beautiful co-working space near Old St in central London. The office has a gym and showers, bike storage, free snacks and drinks, and a programme of social events.",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 3:43:52 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "ekPKfgeVSFKzNOqHO5EoXA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=IT+Security+Mobility+Consultant&c=Threatscape&l=Remote&jk=fe22286054ae16af&rtk=1c5g89oku144k3lk&from=rss",
    "title": "IT Security and Mobility Consultant - Microsoft solutions - Threatscape - Remote",
    "content": "<div><b>IT Security and Mobility Consultant - Microsoft solutions</b><br><span>Threatscape</span>     -<span>Remote</span>    <div>        <span>Full-time,&nbsp;Permanent</span>        </div></div><span><p>Threatscape’s mission is to <b>secure and protect our customers’ data</b> , making it available to employees at all times without compromise to its integrity.</p><p><b>How do we do it?</b></p><p><b>We provide business‐critical IT security</b> <b>solutions</b> <b>and services to large corporate, multinational and state or</b> <b>ganisations in the UK, Ireland,</b> <b>Europe</b> <b>and beyond.</b></p><p>Our expertise in delivering, supporting, maintaining and managing cyber security solutions makes us very much <b>an extension of our customers</b> <b>’* *IT Security teams</b> . We strive for operational excellence coupled with advanced security technologies from global vendors. <b>Threatscape’s high level of vendor accreditation and close vendor relations ensures our customers benefit from the best in service delivery and commercial offerings.</b></p><p><b>We are growing our Irish and UK operations and are looking to hire an experienced engineer to be in charge of the Microsoft projects.</b></p><p><b>Before we tell you about the technical skills</b> needed for the role, let us tell you about the personality that will be a great fit with both the type of company we are and the team.</p><p>We are a great bunch of people with a good sense of humour, and nice to work with.</p><p>We are very successful and highly regarded in our industry and by our clients, and this is based not only on our technical expertise but also because we truly <b>put our customers first</b> and have a <b>flexible approach to work</b> . So, problem anticipation, problem solving and rolling up our sleeves to get things done and sorted are definitely qualities that describe us and what you need to have in order to join us.</p><p><b>Soft skills you need: </b></p><ul><li>Customer focus</li><li>Excellent at building relationships</li><li>Flexible approach to work</li><li>Good at taking initiatives and being proactive (there’s no hand holding here!)</li><li>You need to have a <b>passion for technology and cyber security</b> – you need to <b>want to learn.</b> The entire team is hands on and working on projects so again <b>there’s no hand holding.</b></li></ul><p>That’s what cyber security is about. It evolves constantly, so do we in order to stay ahead of the threat landscape.</p><p>So in that role – Microsoft Consultant (Security solutions) you will be in charge of a variety of tasks related to Microsoft Security Solutions (ATA, CAS, AIP, ATP etc).</p><p><b>Technology focus: </b></p><p>Your primary focus will be to work with those solutions in our portfolio which deal with</p><ul><li><b>Identity and Access Management</b> (such as Azure Active Directory – AAD),</li><li><b>Threat Protection</b> (Advanced Threat Analytics, Windows defender Advanced Threat Protection, Office 365 Threat Protection and Threat Intelligence),</li><li><b>Information Protection</b> (Azure Information Protection, Office 365 Data Loss Prevention, Microsoft Cloud App Security, Office 365 Advanced Security Management, Microsoft Intune),</li><li><b>Security Management</b> (Azure Security Centre, Office 365 Security and Compliance Centre, Windows Defender Advanced Security Centre).</li></ul><p><b>Responsibilities: </b></p><ul><li>Your responsibilities will be quite broad from presales, to implementation, training, troubleshooting and support.</li><li>You will help design and deliver services for those security solutions. You will execute PoCs</li><li>You will do presales support by participating to clients’ meetings.</li><li>You will implement the technology with existing engineers and look to build a team to deliver on an ongoing basis</li><li>You will help design and implement support for Microsoft services.</li></ul><p>Our partnership and work with Microsoft will evolve with time so be prepared for 2 days not looking the same.</p><p>If that’s the challenge you are looking for the we’d love to hear from you.</p><p>You need to have a fair amount of experience with <b>Microsoft security solutions including</b> <b>presales, deployment, support, documentation etc.</b></p><p>Oh and just a few things:</p><ul><li>You need to have an excellent fluent level of English.</li><li>The work will involve travelling within the UK and to Ireland from time to time</li></ul><p>Job Types: Full-time, Permanent</p></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 2:06:10 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "J9HlTE3KRgOR3ZKTFsnH3g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=IT+Security+Mobility+Consultant&c=Threatscape&l=Remote&jk=fe22286054ae16af&rtk=1c5gchuka92paene&from=rss",
    "title": "IT Security and Mobility Consultant - Microsoft solutions - Threatscape - Remote",
    "content": "<div><b>IT Security and Mobility Consultant - Microsoft solutions</b><br><span>Threatscape</span>     -<span>Remote</span>    <div>        <span>Full-time,&nbsp;Permanent</span>        </div></div><span><p>Threatscape’s mission is to <b>secure and protect our customers’ data</b> , making it available to employees at all times without compromise to its integrity.</p><p><b>How do we do it?</b></p><p><b>We provide business‐critical IT security</b> <b>solutions</b> <b>and services to large corporate, multinational and state or</b> <b>ganisations in the UK, Ireland,</b> <b>Europe</b> <b>and beyond.</b></p><p>Our expertise in delivering, supporting, maintaining and managing cyber security solutions makes us very much <b>an extension of our customers</b> <b>’* *IT Security teams</b> . We strive for operational excellence coupled with advanced security technologies from global vendors. <b>Threatscape’s high level of vendor accreditation and close vendor relations ensures our customers benefit from the best in service delivery and commercial offerings.</b></p><p><b>We are growing our Irish and UK operations and are looking to hire an experienced engineer to be in charge of the Microsoft projects.</b></p><p><b>Before we tell you about the technical skills</b> needed for the role, let us tell you about the personality that will be a great fit with both the type of company we are and the team.</p><p>We are a great bunch of people with a good sense of humour, and nice to work with.</p><p>We are very successful and highly regarded in our industry and by our clients, and this is based not only on our technical expertise but also because we truly <b>put our customers first</b> and have a <b>flexible approach to work</b> . So, problem anticipation, problem solving and rolling up our sleeves to get things done and sorted are definitely qualities that describe us and what you need to have in order to join us.</p><p><b>Soft skills you need: </b></p><ul><li>Customer focus</li><li>Excellent at building relationships</li><li>Flexible approach to work</li><li>Good at taking initiatives and being proactive (there’s no hand holding here!)</li><li>You need to have a <b>passion for technology and cyber security</b> – you need to <b>want to learn.</b> The entire team is hands on and working on projects so again <b>there’s no hand holding.</b></li></ul><p>That’s what cyber security is about. It evolves constantly, so do we in order to stay ahead of the threat landscape.</p><p>So in that role – Microsoft Consultant (Security solutions) you will be in charge of a variety of tasks related to Microsoft Security Solutions (ATA, CAS, AIP, ATP etc).</p><p><b>Technology focus: </b></p><p>Your primary focus will be to work with those solutions in our portfolio which deal with</p><ul><li><b>Identity and Access Management</b> (such as Azure Active Directory – AAD),</li><li><b>Threat Protection</b> (Advanced Threat Analytics, Windows defender Advanced Threat Protection, Office 365 Threat Protection and Threat Intelligence),</li><li><b>Information Protection</b> (Azure Information Protection, Office 365 Data Loss Prevention, Microsoft Cloud App Security, Office 365 Advanced Security Management, Microsoft Intune),</li><li><b>Security Management</b> (Azure Security Centre, Office 365 Security and Compliance Centre, Windows Defender Advanced Security Centre).</li></ul><p><b>Responsibilities: </b></p><ul><li>Your responsibilities will be quite broad from presales, to implementation, training, troubleshooting and support.</li><li>You will help design and deliver services for those security solutions. You will execute PoCs</li><li>You will do presales support by participating to clients’ meetings.</li><li>You will implement the technology with existing engineers and look to build a team to deliver on an ongoing basis</li><li>You will help design and implement support for Microsoft services.</li></ul><p>Our partnership and work with Microsoft will evolve with time so be prepared for 2 days not looking the same.</p><p>If that’s the challenge you are looking for the we’d love to hear from you.</p><p>You need to have a fair amount of experience with <b>Microsoft security solutions including</b> <b>presales, deployment, support, documentation etc.</b></p><p>Oh and just a few things:</p><ul><li>You need to have an excellent fluent level of English.</li><li>The work will involve travelling within the UK and to Ireland from time to time</li></ul><p>Job Types: Full-time, Permanent</p></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 2:06:10 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "608z82BuRYedJZfZimy_1w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=IT+Security+Mobility+Consultant&c=Threatscape&l=Remote&jk=fe22286054ae16af&rtk=1c5gm7ns49ma3ej6&from=rss",
    "title": "IT Security and Mobility Consultant - Microsoft solutions - Threatscape - Remote",
    "content": "<div><b>IT Security and Mobility Consultant - Microsoft solutions</b><br><span>Threatscape</span>     -<span>Remote</span>    <div>        <span>Full-time,&nbsp;Permanent</span>        </div></div><span><p>Threatscape’s mission is to <b>secure and protect our customers’ data</b> , making it available to employees at all times without compromise to its integrity.</p><p><b>How do we do it?</b></p><p><b>We provide business‐critical IT security</b> <b>solutions</b> <b>and services to large corporate, multinational and state or</b> <b>ganisations in the UK, Ireland,</b> <b>Europe</b> <b>and beyond.</b></p><p>Our expertise in delivering, supporting, maintaining and managing cyber security solutions makes us very much <b>an extension of our customers</b> <b>’* *IT Security teams</b> . We strive for operational excellence coupled with advanced security technologies from global vendors. <b>Threatscape’s high level of vendor accreditation and close vendor relations ensures our customers benefit from the best in service delivery and commercial offerings.</b></p><p><b>We are growing our Irish and UK operations and are looking to hire an experienced engineer to be in charge of the Microsoft projects.</b></p><p><b>Before we tell you about the technical skills</b> needed for the role, let us tell you about the personality that will be a great fit with both the type of company we are and the team.</p><p>We are a great bunch of people with a good sense of humour, and nice to work with.</p><p>We are very successful and highly regarded in our industry and by our clients, and this is based not only on our technical expertise but also because we truly <b>put our customers first</b> and have a <b>flexible approach to work</b> . So, problem anticipation, problem solving and rolling up our sleeves to get things done and sorted are definitely qualities that describe us and what you need to have in order to join us.</p><p><b>Soft skills you need: </b></p><ul><li>Customer focus</li><li>Excellent at building relationships</li><li>Flexible approach to work</li><li>Good at taking initiatives and being proactive (there’s no hand holding here!)</li><li>You need to have a <b>passion for technology and cyber security</b> – you need to <b>want to learn.</b> The entire team is hands on and working on projects so again <b>there’s no hand holding.</b></li></ul><p>That’s what cyber security is about. It evolves constantly, so do we in order to stay ahead of the threat landscape.</p><p>So in that role – Microsoft Consultant (Security solutions) you will be in charge of a variety of tasks related to Microsoft Security Solutions (ATA, CAS, AIP, ATP etc).</p><p><b>Technology focus: </b></p><p>Your primary focus will be to work with those solutions in our portfolio which deal with</p><ul><li><b>Identity and Access Management</b> (such as Azure Active Directory – AAD),</li><li><b>Threat Protection</b> (Advanced Threat Analytics, Windows defender Advanced Threat Protection, Office 365 Threat Protection and Threat Intelligence),</li><li><b>Information Protection</b> (Azure Information Protection, Office 365 Data Loss Prevention, Microsoft Cloud App Security, Office 365 Advanced Security Management, Microsoft Intune),</li><li><b>Security Management</b> (Azure Security Centre, Office 365 Security and Compliance Centre, Windows Defender Advanced Security Centre).</li></ul><p><b>Responsibilities: </b></p><ul><li>Your responsibilities will be quite broad from presales, to implementation, training, troubleshooting and support.</li><li>You will help design and deliver services for those security solutions. You will execute PoCs</li><li>You will do presales support by participating to clients’ meetings.</li><li>You will implement the technology with existing engineers and look to build a team to deliver on an ongoing basis</li><li>You will help design and implement support for Microsoft services.</li></ul><p>Our partnership and work with Microsoft will evolve with time so be prepared for 2 days not looking the same.</p><p>If that’s the challenge you are looking for the we’d love to hear from you.</p><p>You need to have a fair amount of experience with <b>Microsoft security solutions including</b> <b>presales, deployment, support, documentation etc.</b></p><p>Oh and just a few things:</p><ul><li>You need to have an excellent fluent level of English.</li><li>The work will involve travelling within the UK and to Ireland from time to time</li></ul><p>Job Types: Full-time, Permanent</p></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 2:06:10 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "7gGDhSusRQCjQb8uMyFjFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=IT+Security+Mobility+Consultant&c=Threatscape&l=Remote&jk=fe22286054ae16af&rtk=1c5gsus169tlkba1&from=rss",
    "title": "IT Security and Mobility Consultant - Microsoft solutions - Threatscape - Remote",
    "content": "<div><b>IT Security and Mobility Consultant - Microsoft solutions</b><br><span>Threatscape</span>     -<span>Remote</span>    <div>        <span>Full-time,&nbsp;Permanent</span>        </div></div><span><p>Threatscape’s mission is to <b>secure and protect our customers’ data</b> , making it available to employees at all times without compromise to its integrity.</p><p><b>How do we do it?</b></p><p><b>We provide business‐critical IT security</b> <b>solutions</b> <b>and services to large corporate, multinational and state or</b> <b>ganisations in the UK, Ireland,</b> <b>Europe</b> <b>and beyond.</b></p><p>Our expertise in delivering, supporting, maintaining and managing cyber security solutions makes us very much <b>an extension of our customers</b> <b>’* *IT Security teams</b> . We strive for operational excellence coupled with advanced security technologies from global vendors. <b>Threatscape’s high level of vendor accreditation and close vendor relations ensures our customers benefit from the best in service delivery and commercial offerings.</b></p><p><b>We are growing our Irish and UK operations and are looking to hire an experienced engineer to be in charge of the Microsoft projects.</b></p><p><b>Before we tell you about the technical skills</b> needed for the role, let us tell you about the personality that will be a great fit with both the type of company we are and the team.</p><p>We are a great bunch of people with a good sense of humour, and nice to work with.</p><p>We are very successful and highly regarded in our industry and by our clients, and this is based not only on our technical expertise but also because we truly <b>put our customers first</b> and have a <b>flexible approach to work</b> . So, problem anticipation, problem solving and rolling up our sleeves to get things done and sorted are definitely qualities that describe us and what you need to have in order to join us.</p><p><b>Soft skills you need: </b></p><ul><li>Customer focus</li><li>Excellent at building relationships</li><li>Flexible approach to work</li><li>Good at taking initiatives and being proactive (there’s no hand holding here!)</li><li>You need to have a <b>passion for technology and cyber security</b> – you need to <b>want to learn.</b> The entire team is hands on and working on projects so again <b>there’s no hand holding.</b></li></ul><p>That’s what cyber security is about. It evolves constantly, so do we in order to stay ahead of the threat landscape.</p><p>So in that role – Microsoft Consultant (Security solutions) you will be in charge of a variety of tasks related to Microsoft Security Solutions (ATA, CAS, AIP, ATP etc).</p><p><b>Technology focus: </b></p><p>Your primary focus will be to work with those solutions in our portfolio which deal with</p><ul><li><b>Identity and Access Management</b> (such as Azure Active Directory – AAD),</li><li><b>Threat Protection</b> (Advanced Threat Analytics, Windows defender Advanced Threat Protection, Office 365 Threat Protection and Threat Intelligence),</li><li><b>Information Protection</b> (Azure Information Protection, Office 365 Data Loss Prevention, Microsoft Cloud App Security, Office 365 Advanced Security Management, Microsoft Intune),</li><li><b>Security Management</b> (Azure Security Centre, Office 365 Security and Compliance Centre, Windows Defender Advanced Security Centre).</li></ul><p><b>Responsibilities: </b></p><ul><li>Your responsibilities will be quite broad from presales, to implementation, training, troubleshooting and support.</li><li>You will help design and deliver services for those security solutions. You will execute PoCs</li><li>You will do presales support by participating to clients’ meetings.</li><li>You will implement the technology with existing engineers and look to build a team to deliver on an ongoing basis</li><li>You will help design and implement support for Microsoft services.</li></ul><p>Our partnership and work with Microsoft will evolve with time so be prepared for 2 days not looking the same.</p><p>If that’s the challenge you are looking for the we’d love to hear from you.</p><p>You need to have a fair amount of experience with <b>Microsoft security solutions including</b> <b>presales, deployment, support, documentation etc.</b></p><p>Oh and just a few things:</p><ul><li>You need to have an excellent fluent level of English.</li><li>The work will involve travelling within the UK and to Ireland from time to time</li></ul><p>Job Types: Full-time, Permanent</p></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 2:06:10 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/unknown",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "undefined job title"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  }
]
}
