{
 "items": [
  {
    "id": "VeOPmTqoRPGzcHih9wbUIw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8666-talent-acquisition-analyst",
    "title": "Talent Acquisition Analyst",
    "content": "Talent Acquisition&nbsp;Analyst - Jobmote<div><div><h2>Talent Acquisition&nbsp;Analyst</h2><h5>Clevertech</h5></div></div><div><div><div><div><div><h4>DESCRIPTION</h4><p>Clevertech is looking for a gifted talent acquisition analyst to work with us in our people operations department. to join our worldwide team. Help create the culture for the developers who are creating world class software products for the most exclusive companies in the world.</p><p>From ensuring standards, to providing access to training and development, to organizing online talks attended by hundreds of participants you help set the mood for our developer teams.</p><p>You get excited about getting the best out of team members and have demonstrated the finesse required for people operations.</p><p>You enjoy doing puzzles, talking to new people and insightfully understanding their strengths and weaknesses.You can tell the difference between a type A and type B personality and flesh out strengths in your candidates. Familiarity with technology and software development is a plus, as well as HR best practices and community management.</p><p>No cold calling. No passive recruitment. This position is about doing an initial screen of existing candidates and growing our community of developers and designers.</p><h4>BENEFITS</h4><h5>Own Your Time</h5><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We are a collective of like minded people in over ten countries, and our global perspective shapes our every move.</p><h5>Focused Work</h5><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams. And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p><h5>Learn at your edges</h5><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</p><p>And of course, if you speak at a tech conference, we cover all expenses.</p><h5>Recharge Time</h5><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p>Want to learn more about Clevertech and the team? Check out&nbsp;<a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 27, 2017 8:00:27 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "lMUSFl1XRMeFSPzUOo7pYw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30148?r=rss2",
    "title": "CleverTech: Talent Acquisition Analyst",
    "content": "<p>Full-time</p><p><strong>(Remote)</strong> </p><h3>DESCRIPTION</h3><p>Clevertech is looking for a gifted talent acquisition analyst to work with us in our people operations department. to join our worldwide team. Help create the culture for the developers who are creating world class software products for the most exclusive companies in the world.</p><p>From ensuring standards, to providing access to training and development, to organizing online talks attended by hundreds of participants you help set the mood for our developer teams.</p><p>You get excited about getting the best out of team members and have demonstrated the finesse required for people operations.</p><p>You enjoy doing puzzles, talking to new people and insightfully understanding their strengths and weaknesses.You can tell the difference between a type A and type B personality and flesh out strengths in your candidates. Familiarity with technology and software development is a plus, as well as HR best practices and community management.</p><p>No cold calling. No passive recruitment. This position is about doing an initial screen of existing candidates and growing our community of developers and designers.</p><h3>BENEFITS</h3><h4>Own Your Time</h4><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We are a collective of like minded people in over ten countries, and our global perspective shapes our every move.</p><h4>Focused Work</h4><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams. And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p><h4>Learn at your edges</h4><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</p><p>And of course, if you speak at a tech conference, we cover all expenses.</p><h4>Recharge Time</h4><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p>Want to learn more about Clevertech and the team? Check out&nbsp;<a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Dec 27, 2017 7:46:29 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "BM-ILEa0QHaPIcXDtV6Ktg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5996-recruiter",
    "title": "Zapier: Recruiter",
    "content": "<div>  <div>    <h2>Recruiter</h2>      <h4>Posted Dec 22</h4>    <h3>      <span>Zapier</span><br>      <span>Headquarters: Remote</span><br>        <a href='https://zapier.com/about/' rel='nofollow'>https://zapier.com/about/</a>    </h3>  </div>    </div>  <div>    <div>Hi there! We're looking for an experienced Recruiter supporting diversity hiring to join the Operations team at Zapier. Want to help grow and nurture the team behind a product that allows anyone to do complex, incredible things with the world's APIs? Then keep reading!</div><div><br></div><div>Even though our job description may seem like we're looking for a specific candidate, the role inevitably ends up tailored to the person who applies and joins. Regardless of how well you feel you fit our description, we encourage you to apply if you care deeply about running a fair and balanced hiring and recruiting process that will help match talented people with a role where they can be successful.</div><div><br></div><div>We're a widespread remote team of 100+ people, located in thirteen countries, that think computers should do more work. For the past six years, Zapier has been helping people across the world automate the boring and tedious parts of their job. We do that by helping everyone connect the web applications they already use and love.</div><div><br></div><div>We get together 2-3 times per year for a company retreat, and benefits include great healthcare, dental and vision coverage, 401k retirement plan with company match, profit sharing and 14 weeks paid leave for new parents.</div><div><br></div><div>To be considered for this role, please complete the application on&nbsp;<a href='https://zapier.workable.com/j/2983416B67' rel='nofollow'>Jobs @ Zapier</a></div><div><br></div><div>We're not accepting applications from agencies.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply online: <a href='https://zapier.workable.com/j/2983416B67' rel='nofollow'>https://zapier.workable.com/j/2983416B67</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 22, 2017 9:28:34 PM",
    "tags": [
      "DBG:surround``headquart 3N remot",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Zn6tvuuXTnaIohjeYrfB6g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/64465/smart-nice-generalist-needed-for-customer-acquisition-role-in-fast-paced-amp-friendly-vc-backed-s-at-koru-kids/",
    "title": "Smart, Nice Generalist needed for Customer acquisition role in fast-paced &amp; friendly VC-backed s",
    "content": "About Koru Kids<br />Koru Kids is London’s fastest growing childcare brand. We’re making it easier and more affordable for families to access high quality childcare. <br /><br />Our after school service matches parents in London with the top 10% of student nannies in London and our nanny share service helps families to share nannies with other local families. <br /><br />We don’t just believe in providing outstanding childcare to families, we are all about using technology to make it seamless for parents. We’ve been blown away by the response from parents and are consistently beating our growth targets. <br /><br />We are backed by fantastic investors, including top venture capitalists and business angels such as Michael Pennington the founder of Gumtree. We won the South of England region in the ‘Best of Britain’ awards 2017, and are currently shortlisted for several awards: the UK Business Awards 2017 as ‘Disruptor of the Year’, and in the Best Women Awards 2017 as ‘Best New Business’, ‘Best Technology’ and ‘Best company working with children and families’.<br /><br />About the Team<br />We have an informal, hard-working and kind team culture. We’re all passionate about our mission and are determined to create the world’s leading childcare brand. Every team member plays a vital role in achieving our goals and we work together so we can get there quicker.  Our approach is fast paced – we are constantly challenging, testing and adapting the way we do things. <br /><br />Our founder is Rachel Carrell, the former CEO of DrThom.com, the world’s largest online doctor service, which she grew to over 1.3m paying users in 3 countries. She’s an Oxford alumn, ex-McKinsey, a Rhodes Scholar and a WEF Young Global Leader. Rachel’s joined by an amazing team with backgrounds including Cambridge, UCL, BCG, KPMG, and some of London’s top startups. <br /><br />We take great care with who we hire and all team members are superbly talented and most importantly really nice! If you’re brilliant AND humble, you’ll fit right in.<br /><br />About the role<br />We have huge growth plans for the business and we need someone to help us take our acquisition to the next level. <br /><br />You don’t need any prior marketing experience but you do need to be pro-active, a fast learner and not afraid to try new things.<br /><br />This role will suit someone who enjoys testing new ideas, validating them and gets a kick out of figuring out how to make things work. You need to be analytical and comfortable with numbers. You’ll be organised, comfortable working at a fast pace and able to task switch.<br /><br />You’ll also spend time working on customer-facing operations. This means speaking to mums (sometimes dads and nannies, but usually mums) on the phone, and emailing/texting them. This will probably be at least 20% of the job. You’ll get to know our parents, what their needs are and therefore how we can best acquire new ones.<br /><br />You need to have excellent English – you’ll be writing compelling and concise copy to catch parents attention.<br /><br />You’ll be a key member of our team, and you’ll get all the training, coaching and support you need to do these things well.<br /><br />Your normal hours of work will be 9am to 6.30pm on weekdays but there may be times when late night are required to cope with spikes in demand. We know you have a private life and other commitments and we work as a team to make sure everyone has a good balance. You’ll normally work from our offices near Old St, although if you like to occasionally work from home that’s totally fine too we support flexibility as long as the work gets done!<br /><br />3 reasons this role is great:<br />-    You will learn a TON. Customer acquisition will be your main focus, but you’ll get plenty of exposure to operations, product, technology and other aspects of the business. You’ll learn how to found a business, about operations, marketing, technology, and finance. <br />-    You’ll be making a huge difference to the everyday lives of parents in London. We’re building a business that will profoundly benefit children, women, and families.<br />-    We’re well-connected in the startup world, so working with us will open lots of doors for you even if you leave. We’ve got a strong track record of helping people we’ve worked with<br /><br />About you<br />We’re after an all-rounder who is clever, practical, positive and nice. We don’t mind what degree you’ve done, as long as you’ve done well in it. We’ll also be looking for evidence of spark and energy in the extracurricular stuff you’ve done.<br />Ideally you will have about 1-2 years of experience in the workforce already. <br /><br />Essential skills<br />-    You’re able to write clearly, simply and accurately, with perfect spelling and grammar<br />-    You like working with numbers and data. We love people who love analysis<br />-    You’re comfortable with speaking to new people, both in person and on the phone<br />-    You’re emotionally intelligent. Although you’ll like to talk, the most important thing you’ll do is listen. Choosing childcare is an emotional decision, and you’ll need to help parents through the process<br />-    You’re a problem-solver. As we are a young company, there aren’t many fixed processes yet. That means you can create new processes, make suggestions, and tell us we’re doing things wrong<br />-    You roll with it. You understand that startups are unpredictable environments. You are comfortable with a degree of chaos<br />-    You’re nice. You get that no player is bigger than the team. You fit right into our culture of supporting and helping each other.<br />Skills/experience that are not essential but would be fantastic<br />-    Passion for design or photography (you would need your own equipment, but again we could certainly create opportunities for you to practice)<br /><br /><br />Benefits<br />-    Competitive salary dependent on experience<br />-    We work from a beautiful co-working space near Old St in central London. The office has a gym and showers, bike storage, free snacks and drinks, and a programme of social events.<br />",
    "urlFetchPending": false,
    "published": "Dec 18, 2017 6:15:21 PM",
    "tags": [
      "DBG:surround``your W own W equip",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "4331iw2ASSeBnWzIcjQfyA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8462-recruitment-specialist",
    "title": "Recruitment Specialist",
    "content": "Recruitment Specialist - Jobmote<div><div><h2>Recruitment Specialist</h2><h5>Productive Power</h5></div></div><div><div><div><div><div><p>Are you a personable and organized professional? Do you enjoy interviewing people?&nbsp;Do you want a full-time job working remotely? If so,&nbsp;you&nbsp;could be the perfect recruitment specialist&nbsp;for Productive Power.</p><p>Productive Power helps professionals maximize their productivity through digital training that transforms the way they work. As the recruitment specialist, you will help us recruit sales executives and software trainers to fill our open positions and implement an effective social media campaign.</p><p><strong>Responsibilities:</strong></p><ul><li>Implement current recruitment and sourcing strategies</li><li>Conduct video interviews</li><li>Manage candidates through applicant tracking system</li><li>Conduct background and reference checks</li><li>Coordinate and file all new hire documentation</li><li>Assist with social media outreach and special projects</li></ul><p><strong>Requirements:</strong></p><ul><li>Bachelor's degree</li><li>At least one year of experience recruiting or interviewing</li><li>Enjoy interviewing people</li><li>Excellent and professional written and verbal communication skills</li><li>Detail-oriented with strong organizational skills</li><li>Experience using a PC</li><li>Desire to work remotely</li><li>Live in the United States</li></ul><p><strong>Compensation Plan:</strong></p><ul><li>Salary: $45,000 per year</li><li>Paid time off (vacation, personal and sick)</li><li>Paid holidays</li><li>Employer funded Health Reimbursement Account (HRA)</li><li>401(k) plan with company match</li></ul><p>Join us on our journey to help professionals maximize their productivity and efficiency!</p><p>In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 11:00:31 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "KfPZ8h-6Swi-lWaxO1X3jQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63659",
    "title": "Recruitment Specialist",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div>Are you a personable and organized professional? Do you enjoy interviewing people?&nbsp;Do you want a full-time job working remotely? If so,&nbsp;you&nbsp;could be the perfect recruitment specialist&nbsp;for Productive Power.</div></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 10:46:12 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "9AZFLFeqRm6CfVJU7eLmrQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consumeracquisition-com/jobs/114999-facebook-user-acquisition",
    "title": "Facebook User Acquisition",
    "content": "<div><h2>Facebook User Acquisition at ConsumerAcquisition.com</h2><div>San Francisco, Austin, Los Angeles, Remote · Full Time</div></div><div><div>Skills</div><div>Facebook Advertising</div><div>Compensation</div><div>$80K–$135K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Are you passionate about Facebook advertising and user acquisition? Do you want to deliver world-class performance to clients while having autonomy and personal freedom?  If so, then we want to work with you!</p><p>We are looking for entrepreneurial individuals who are seeking an analytically challenging and strategic role with a fast-growing startup. </p><p>Manage all aspects of Facebook and Instagram advertising campaigns using our proprietary software, AdRules. <br>• Oversee execution and optimization of Facebook advertising campaigns to exceed clients’ goals across many verticals.<br>• Plan, manage, optimize, and report on paid social media campaigns.<br>• Become an expert in Facebook advertising and the AdRules platform.<br>• Write ad copy and work with graphic designers to optimize images.</p><p>Responsibilities:<br>• Manage all aspects of Facebook and Instagram advertising: build ads, analyze data, optimize continuously and manage creative testing.<br>• Develop strategies to exceed clients’ performance goals.<br>• Create images in Photoshop (or manage external designers) and write ad copy to optimize performance.<br>• Analyze your ad spend and use the data to formulate your strategy.<br>• Optimize ads for efficiency based on performance data using our AdRules platform.<br>• Develop client-facing skills on weekly calls, deliver strategic insights and daily summaries.</p><p>Requirements:<br>• Strong analytics, quantitative and problem-solving skills; ability to analyze raw data, draw conclusions, and develop actionable recommendations.<br>• BA / BS / MBA or 2+ years’ experience in high-scale, hands-on performance marketing role with Facebook Ads and User Acquisition.<br>• Experience in performance marketing, online advertising, media buying, lead generation or consulting.<br>• Strong understanding of ads metrics (CPI, CTR, CPC, CPM, CPA, ROAS, ROI, LTV).<br>• Advanced knowledge of Excel.</p><p>Benefits:<br>• Highly competitive salary.<br>• Work from home flexibility.<br>• Uncapped vacation and sick time.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 7, 2017 8:49:42 PM",
    "tags": [
      "Austin",
      "DBG:surround``fulltim 4N remot",
      "Facebook Advertising",
      "Full Time",
      "Los Angeles",
      "Marketing",
      "REMOTE1/100",
      "Remote OK",
      "San Francisco",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "yhdHmdWjROi98GnFpyJ54A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/webind/jobs/110240-master-acquisition-specialist",
    "title": "Master Acquisition Specialist",
    "content": "<div><h2>Master Acquisition Specialist at WeBind</h2><div>Mumbai, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>₹300K–₹500K<br>0.0%–4.0%</div></div><h3>Job Description</h3><div><p>Master Acquisition Specialist would be responsible to coordinate with Webind Masters who are industry leaders, entrepreneurs, field experts etc and closely work with other teams to bring the master-Class to its fitting conclusion. <br>Responsibilities:<br>Assist core team in generating the potential ‘Masters’ list. <br>Pitch leads worthy of being Webind’s Master and bring them onboard.<br>Elucidate the whole model of Webind to potential masters and pitch what’s in it for them. <br>Take care of the Master’s onboarding and his subsequent experience with Webind.</p><p>Must haves:<br>Excellent conversationalist and polite attitude<br>Highly motivated and desire to create a visible impact <br>Team player spirit <br>Loves small teams</p></div>",
    "urlFetchPending": false,
    "published": "Nov 21, 2017 9:00:07 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Marketing",
      "Mumbai",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "c5cxugfGTDC6fq2OcSqBKw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/63578/graduate-or-student-recruiter-work-from-home-at-365-talent-portal/",
    "title": "Graduate or student recruiter - work from home",
    "content": "Are you a student or recent graduate?<br />Would you like to learn how to find, select, interview and place candidates?<br />Would you like to build strong customer service skills?<br />Would you like an interesting career start in a dynamic start-up environment?<br /><br />If you do, please read on!<br /><br />*The company*<br /><br />365 Talent Portal is an international career hub for Microsoft technology consultants and the companies that need to hire them. Our company is a fast growing start-up which has members in 115 countries across the globe. We work with small and medium businesses and enterprise multi-national organisations.<br /><br />We are looking to hire new talent to help our customers to find the perfect candidates. Most of our customers are currently in the UK and the US.<br /><br />*Our Culture*<br /><br />We’re a friendly group of people who have built a participative working environment where everyone can contribute and learn from each other. We value good communication, hard work, lots of fun, great ideas (but good ideas work for us as well!), and self-motivation. We also help our team members blossom through regular coaching, guidance, and advice.<br /><br />What we can offer you:<br />- A flexible work environment with the possibility to work from home at the hours you want.<br />- The opportunity to work and earn an income while studying or working on other part-time projects.<br />- The chance to learn or perfect sought-after skills such as candidate selection and customer service.<br />- Thorough, ongoing training and support to help you reach your goals.<br />- An energetic team of qualified professionals who are always happy to help.<br /><br />*Job Description*<br /><br />The main goal of the Recruiter will be to find the right candidate for each role, and the right role for each candidate. It’s a great opportunity for a student or graduate who is interested in learning about:<br />- How to look for candidates, screen CVs, conduct phone interviews.<br />- How to provide CV and interviewing advice to candidates.<br />- How to advise and provide feedback to employers.<br /><br />Responsibilities:<br />- Match the job descriptions from our clients to the consultants we have on our books or go externally to look for new candidates.<br />- Interview and shortlist candidates (training and mentoring will be provided).<br />- Keep track of the status of each candidate’s application.<br />- Update our customers on the progress of our work.<br />- Learn how to provide CV and career advice.<br />- Work closely with 365 Talent Portal marketing and sales towards achieving team targets.<br /><br />*Career Track*<br /><br />The benefit of working for a start-up is that you can develop in many different directions. Here are a couple of examples of possible career progression paths:<br />- Become a senior recruiter or recruitment team leader.<br />- Explore other company activities and learn new skills.<br /><br />*Working Environment*<br /><br />We are based in London. You will be given the option to either work from home or to work from our London offices.<br /><br />We meet on a regular basis, talk few times a day on the phone, exchange emails, IM and talk through social media. We also hold company meetings once a month in our London offices.<br /><br />*Hours*<br /><br />This role requires that you work at least 20 hours per week. However, we are not a 9-5 organisation. We would expect certain work to be done and you can do it anytime that suits you.<br /><br />*Profile and qualifications*<br /><br />We need team members who can take responsibility for their own workload and who are able to seek support when they need it. Some recruitment or account management experience would be an advantage, but we will consider anyone who has the right attitude and skills.<br /><br />Skills required:<br />- Excellent written and spoken communication skills<br />- Able to communicate professionally with customers<br />- Well organised with an eye for detail<br />- Good at tracking data<br />- Self-motivated and responsible<br />- ‘Start-up spirit’: wants to be a part of a new company’s growth<br />- Able to work as part of a team<br />- Keen to learn and curious<br /><br />• You must be based in the EU and eligible to work in the UK (UK-based candidates preferred)<br />• You must be able to speak and write English fluently<br /><br />*Compensation*<br /><br />Minimum guaranteed income of £500 per month for 20 hours of work per week. You will earn commission on each of your placements, and we will guide and help you to increase your earnings consistently.<br /><br />*How to apply*<br /><br />If you are interested, send us your CV and a cover letter explaining why you think you would be a good candidate. Please note that we will only consider applications which include a cover letter.",
    "urlFetchPending": false,
    "published": "Nov 20, 2017 1:17:21 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/24",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=24, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/HR",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  }
]
}
