{
 "items": [
  {
    "id": "QWQmFCIMSKC9XY8Hh4pBIg",
    "url": "https://remote.co/job/human-resources-recruiter/",
    "title": "Human Resources Recruiter",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:swift/apple/5",
      "DBG_TECH1:k/t/w:swift/mobile/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=8, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=5, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/mobile",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Precision Nutrition",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 28, 2018 4:49:06 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Human Resources Recruiter at <span>Precision Nutrition</span></h2><div><span><i></i> Remote</span>         | <span> International </span></div><div>            <p>Are you a savvy recruiter who will connect the right person to the right role?</p><p>PN is looking for an&nbsp;<strong>experienced recruiter</strong>&nbsp;who’s passionate about health, fitness and helping people live their best life.</p><p>Precision Nutrition is growing, and&nbsp;<strong>we need an HR professional</strong>&nbsp;to recruit talented candidates for our burgeoning team. As one of the largest nutrition coaching companies in the world, PN is bigger than it’s ever been and it’s about to get bigger.</p><p>To help us scale, we need an organized recruiter who knows how to spot the right candidates, guide them through the onboarding process, and efficiently coordinate our extended team of external recruiters and contractors so we can help millions more people live healthier, happier lives.</p><p><strong>Join our adventure</strong><br>We’re embarking on a new adventure, and we need a savvy recruiter to expand our team.</p><p><strong>We’ve got an exciting journey ahead of us</strong><br>Over the next 10 years, Precision Nutrition will be expanding its world-class coaching services into a wide range of new fields, including functional medicine, chiropractic and manual therapy, yoga, group exercise, and more.</p><p>To help us reach our goals and keep us moving forward, we need a personable HR veteran who knows how to cut through the noise and find the best possible talent.</p><p><strong>Who we’re looking for</strong><br>An organized, affable HR expert with an eye for exceptional talent.</p><p><strong>You love what you do.</strong><br>You are committed to HR, building and supporting amazing teams that will shape the future of Precision Nutrition. You thrive on collaborating with people to deeply understand the business objectives and hiring needs so that you can bring in top talent. Networking comes naturally to you, and you’re excited to continue learning, growing, and trying new things in a traditionally stagnant field.</p><p><strong>You’r</strong><strong>e a swift prioritizer who doesn’t compromise on quality.</strong><br>We have some ambitious hiring plans – that’s why we need you. You’re a highly organized problem solver who can prioritize, adapt quickly when the scope changes, and thrive in a fast-paced environment with tight deadlines. At the same time, you will make sure we’re not sacrificing quality and that you’re finding the absolute right person for the role.</p><p><strong>You’r</strong><strong>e an exceptional communicator.</strong><br>You’ll be evangelizing our brand to candidates that may not be familiar with PN, so you’ll need a knack for inspiring people and getting them excited. You know when to speak up and when to listen, and you aren’t afraid to ask questions and get clarity when you need it.</p><p><strong>You’r</strong><strong>e flexible and resilient.</strong><br>You aren’t married to your ideas, and know when to seek out other perspectives. You’re energized to roll up your sleeves and dive in. You’ll be part of an HR team of two, so from time to time, you’ll be wearing other HR hats, so you’ll need to be ready to shift gears easily when things change, and embrace honest feedback rather than being stifled by it.</p><p><strong>Yo</strong><strong>u know how to zoom in and zoom out.</strong><br>You can navigate between the big picture and small details. You are able to understand the overall strategy of our hiring plan and can identify all of the small details required to execute, successfully onboard, and support our new team members so they can start making contributions immediately.</p><p><strong>Yo</strong><strong>u may possess psychic abilities.</strong><br>Okay, not really, but you do have an uncanny way of anticipating issues before they even happen and coming up with creative solutions. You know how to find and turn over stones you may not know exist yet.</p><p><strong>You’re self-motivated and can work independently.</strong><strong>&nbsp;</strong><br>Once you are confident in what you need to do, you can run with it and don’t need a lot of direction.&nbsp;<strong>We’re a fully remote team practicing Holacracy, so your meetings, interviews, and other communications will take place online and you’ll be relatively autonomous. You’ll need to be tech-savvy and comfortable forming and nurturing relationships over Slack and Zoom.</strong></p><p><strong>What you’ll be doing</strong><br>Identifying the right people to join our team</p><p><strong>You’re the matchmaker, analyzing the wants and needs of both sides to find the right match</strong>.<br>Your mission is simple: get our roles into the market so we can attract the right candidates, and get them excited to work with us. You’ll be</p><p>Evaluating our team’s needs. You’ll spend time collaborating with our team to gain a deep understanding of our business, our strategy and our hiring needs so that you can match the right person to the right role.</p><p>Getting the word out. You’ll work with writers and other extended team members to create compelling, accurate job descriptions, then market them in unique, and unconventional, yet highly effective places – even if they’re less traditional. You’ll decide on and coordinate the best methods to source candidates, from a retained search to relevant podcasts to social campaigns.</p><p>Finding the right fit. We attract A LOT of candidates, so you’ll enjoy wading through a big haystack of applicants, and using your discerning eye to find that perfect needle. You’ll also pound the pavement and seek out passive candidates, learn about them inside and out, and excite them about the opportunity to be part of our team.</p><p>Creating an exceptional candidate experience. Applying and interviewing for a job can be stressful for a candidate, but you thrive on raising the bar and making it an exceptional experience. You’ll shepherd candidates through our hiring process from coordinating video interviews to performing reference checks and everything in between. Your interpersonal skills and service orientation ensure that whatever the outcome, each candidate walks away feeling that their interactions with PN exceeded their expectations. They’ll have such a positive experience, they’ll be raving to their friends about it.</p><p><strong>You’re also a guide, helping new hires navigate the waters of their new home.</strong><br>Once you’ve found the right fit, you’ll be getting our new team members ready to hit the ground running.</p><p>Preparing agreements. Since we’re remote, we hire people from all over the globe, so you’ll be putting together employment agreements and contracts based on the candidate, their arrangement and their location.</p><p>Walking new hires through the onboarding process. You’ll help new hires learn about PN, how we work, and integrate them into our awesome team so they dive right in.</p><p>Managing our extended team. We work with a variety of freelancers and contractors, and you’ll maintain those relationships. You’ll check in regularly with our team to ensure everything’s on track, prepare and update agreements, and be sure our extended team is treated like and feels just like an employee or one of our customers would.</p><p>A few important caveats</p><p>This is a dream job, if you’re the right person for it.</p><p><strong>Must-Have #1: You’re experienced.</strong><br>This isn’t your first rodeo.<strong>&nbsp;You have a degree in HR or related field, with at least 4 years of experience in HR and talent acquisition, and a proven track record of hiring the right people for the right role.</strong>&nbsp;You’re well-networked, knowledgeable of hiring practices in Canada and the US (or are willing to learn), and can hit the ground running.</p><p><strong>Must-Have #2: You understand people.</strong><br>You’re a people-person and you know how to guide a conversation to really understand if this person’s a good fit. You pick up on those subtle cues that signal when you need to do more digging, or when someone may not fit in with our culture and team.</p><p><strong>Must-Have #3: You’re ready to think outside the box.</strong><br>We use a variety of mediums to attract candidates, and are always looking for ways to innovate. You aren’t satisfied with the way things are traditionally done, and you’re excited to come up with new ideas.</p><p><strong>Must-Have #4: You’re willing to roll up your sleeves and mature our practice.</strong><br>We’re an HR team of two, so you’ll be rolling up your sleeves and into the details at times, yet always thinking about how we can optimize and improve our systems and processes, so we can do what we do best, while helping our team and PN grow and reach their goals.</p><p><strong>Wondering if this is the right path for you</strong><strong>?</strong><br>Every year, professionals at the top of their field choose to join us. Here are&nbsp;<strong>5 reasons why</strong>.</p><p><strong>W</strong><strong>e give you the freedom to do you.</strong><br>Unlike most companies, we don’t have rigid rules about how and when to do things.<strong>&nbsp;You’ll always be free to work independently, whenever, wherever, and however you want.</strong></p><p><strong>You can work from anywhere.<br>We’re a 100% remote company, and have been working remote for 17 years. When you join our team, you’re no longer shackled to one desk, one office, one city, or even one country!</strong></p><p><strong>Meetings are optional. (No, really.)</strong><br>You’re an adult. You’re capable of deciding how your time should be spent. If you don’t think you need to attend a meeting, you don’t. Simple as that.</p><p><strong>You’ll always feel supported.</strong><br>In a regular office, it’s easy to feel like a hamster in a wheel, powerless to change things. At Precision Nutrition, we work as a team to overcome issues &amp; barriers that stand in each other’s way, and we treat each other with enthusiasm, compassion, and care.</p><p><strong>You’l</strong><strong>l never be bored.</strong><br>People often come to Precision Nutrition after hitting a plateau in their old jobs. At PN, you’ll get the chance to conquer new challenges, learn from the best, and reach thrilling new heights of personal and professional growth.</p><p><strong>Plus: no commute and no 9-to-5 grind.<br>Go ahead: schedule work around your kids. Fly to Europe on a moment’s notice. We don’t care where you’re based or what hours you keep, as long as you always give us your best when it counts.</strong></p><p>Sound like we might just be the perfect company for you? Then you might just be the perfect fit for us.</p><p><strong>Sound like we might just be the perfect company for you?</strong></p><p>Then you might just be the perfect fit for us.</p><p>Precision Nutrition</p>        </div><div>        <a href='https://www.precisionnutrition.com/hr-recruiter/' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "yVenDjs0Sy-VqMtXjExGkg",
    "url": "https://jobspresso.co/job/senior-manager-talent-sourcing/",
    "title": "Senior Manager, Talent Sourcing",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "InVision",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 27, 2018 11:13:37 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Senior Manager, Talent Sourcing</h2><div>Various<br></div><div>Anywhere<br></div><div>Company: InVision<br></div><div>Full Time<br></div><h3>Overview</h3><p>InVision is the digital product design platform used to make the world’s best customer experiences. We provide design tools and educational resources for teams to navigate &nbsp;every stage of the product design process, from ideation to development. Today, more 4 million people use InVision to create a repeatable and streamlined design workflow; rapidly design and prototype products before writing code, and collaborate across their entire organization. That includes more than 80 percent of the Fortune 100, and organizations like Airbnb, Amazon, HBO, Netflix, Slack, Starbucks and Uber, who are now able to design better products, faster.</p><p>Our team is in search of a Senior Manager of Sourcing&nbsp;to help us change the way digital products are designed.</p><p></p><strong>About the Team:</strong><p>InVisionApp is looking for an experienced Sourcing Manager to help build out and take our sourcing team to the next level. In this role, you will develop the skills of your team to help them become expert detectives at searching the web to find the top candidates to fill critical roles at InVision. You will partner with leaders across the company to execute unique sourcing strategies to address current hiring needs while building out candidate pipelines to stay ahead of future growth.</p><p></p><strong>What You’ll Do:</strong><ul></ul><li>Work in partnership with the broader Talent Acquisition leadership team to develop successful sourcing strategies to address current and future hiring needs</li><li>Develop market research to identify top talent and track hiring trends</li><li>Continue to develop and grow our talented team of sourcers by monitoring performance metrics to improving capability and increase productivity</li><p></p><strong>What You’ve Got:</strong><ul></ul><li>5+ years of recruiting experience in a high growth, fast-paced environment</li><li>2+ years of experience leading a recruiting and/or sourcing team focused on developing sourcing skills</li><li>Experience leveraging data to develop successful sourcing strategies that will positively impact immediate and future hiring needs</li><li>Expert level knowledge of building complex boolean strings and using unique ideas to identify top talent</li><li>Passion for always being in-the-know on the latest sourcing trends</li><li>World-class ability to identify and attract top talent, both for an organization and for your own team</li><p></p><strong>About InVision:</strong><p>The company employs a diverse team all over the world. Each InVision team member is given the freedom and tools to do their best work from wherever they choose.</p><strong>InVision offers an incredibly unique work environment.&nbsp;</strong><p>The benefits we offer in the United States and Canada include competitive health plans and a retirement plans. Some InVision-wide benefits offered to all employees across the globe include a flexible vacation policy, monthly coffee shop stipends, annual allowances for books related to your profession, and home office setup &amp; wellness reimbursements. InVision is an international employer so some benefit offerings will vary from country to country.</p><p>InVision is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.</p><div> <div><div><p> <br><br> <b>To apply for this job please visit the URL below.</b> <br><br> Please reference <b>Jobspresso</b> in your job application, so that remote companies know where their best candidates are coming from  <br><br> <a href='https://boards.greenhouse.io/invision/jobs/1378600' rel='nofollow'>https://boards.greenhouse.io/invision/jobs/1378600 →</a></p></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "-1TQbQm-Rt2-WQ_hMw2drQ",
    "url": "https://jobspresso.co/job/technical-recruiter-2/",
    "title": "Technical Recruiter",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "GitLab",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 24, 2018 5:55:29 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Technical Recruiter</h2><div>Various<br></div><div>Anywhere<br></div><div>Fully Remote Company<br></div><div>Company: GitLab<br></div><div>Full Time<br></div><h3>Overview</h3><p>This position can be located anywhere in the world and is remote based.</p><p>GitLab is looking for a technical recruiter to create positive experiences for GitLab applicants and hiring teams. We’re growing quickly and need a dynamic team member to help us identify amazing candidates, improve our existing hiring practices, and deliver exceptional customer service. GitLab strives to be a preferred employer and will rely on the recruiters to act as brand ambassadors by embodying the company values and identifying those values in potential team members. We need a recruiter who is enthusiastic about working with high volume and is dedicated to helping us build a qualified, diverse, and motivated team. This role reports to the Recruiting Director.</p><p></p><strong>Responsibilities</strong><ul></ul><li></li><ul></ul><li>Collaborate with managers to understand requirements and establish effective recruiting strategies</li><li>Develop and advertise accurate job descriptions to attract a highly qualified candidate pool</li><li>Identify creative and strategic ways to source great people</li><li>Apply effective recruiting practices to passive and active candidates</li><li>Source, screen, interview and evaluate candidates</li><li>Assess candidate interest and ability to thrive in an open source culture</li><li>Foster lasting relationships with candidates</li><li>Share best practice interviewing techniques with managers</li><li>Build an effective network of internal and external resources to call on as needed</li><li>Ensure applicants receive timely, thoughtful and engaging messaging throughout the hiring process</li><li>Partner with Marketing to develop and deliver a disruptive employer brand strategy</li><li>Promote our values, culture and remote only passion</li><li>Design and monitor key metrics to evaluate the effectiveness of our employment practices</li><li>Develop recommendations for course corrections by leveraging data from our ATS, post interview and post hire surveys and other feedback loops</li><li>Continually search for opportunities to elevate our brand by identifying industry best practices, evaluating competitors and nurturing networks and partnerships</li><p></p><strong>Requirements</strong><ul></ul><li></li><ul></ul><li>Experience recruiting at all levels, preferably in a global capacity within the software industry, open source experience is a plus</li><li>Proven success in recruiting and filling technical positions</li><li>Demonstrated ability to effectively source and place candidates for all positions at all levels</li><li>Experience with competitive global job markets preferred</li><li>Focused on delivering an excellent candidate experience</li><li>Ambitious, efficient and stable under tight deadlines and competing priorities</li><li>Remote working experience in a technology startup will be an added advantage</li><li>Ability to build relationships with managers and colleagues across multiple disciplines and timezones</li><li>Working knowledge using an applicant tracking systems</li><li>Outstanding written and verbal communication skills across all levels</li><li>Willingness to learn and use software tools including Git and GitLab</li><li>College / University degree in Marketing, Human Resources or related field from an accredited institution preferred</li><li>Successful completion of a&nbsp;</li><a href='https://about.gitlab.com/handbook/people-operations/#background-checks' rel='nofollow'>background check</a><p></p><strong>Hiring Process</strong><ul></ul><li></li><ul></ul><li>Qualified applicants will be invited to schedule a 30 minute&nbsp;</li><a href='https://about.gitlab.com/handbook/hiring/interviewing/#screening-call' rel='nofollow'>screening call</a><li>Next, candidates will be invited to schedule a 30 minute interview with another member of the Recruiting team</li><li>Next, candidates will be invited to schedule a panel interview with other Recruiters</li><li>Next, candidates will be invited to schedule a 30 minute interview with our Recruiting Director</li><li>Next, candidates will be invited to schedule a 30 minute interview with our Chief Culture Officer</li><li>Candidate may also be invited to schedule a 45 minute interviews with our VP of Engineering or other leader</li><li>Finally, our CEO may choose to conduct a final interview</li><div> <div><div><p> <br><br> <b>To apply for this job please visit the URL below.</b> <br><br> Please reference <b>Jobspresso</b> in your job application, so that remote companies know where their best candidates are coming from  <br><br> <a href='https://boards.greenhouse.io/gitlab/jobs/4069242002' rel='nofollow'>https://boards.greenhouse.io/gitlab/jobs/4069242002 →</a></p></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "B6_FIweXQjyrpwABW8cVyA",
    "url": "https://landing.jobs/at/landing-jobs/talent-developer-in-lisbon?utm_campaign=landing+rss&utm_content=Talent+Developer&utm_medium=referral&utm_source=rss",
    "title": "Talent Developer",
    "tags": [
      "DBG:surround``2N( OR(employe,develop,engin,team,workmat), spread, OR(out,across) )",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 20, 2018 10:58:23 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Talent Developer</h2></div><div>Company: Landing.jobs</div><div>Location: Lisbon, PT</div>Level: Junior<br>Language: English <div>Sales &amp; Operations<br>Skills:</div><li>Human Resources </li><li>Recruitment </li><li>Talent Developer </li><li>Tech Recruitment </li><h2>Intro</h2><p><a href='https://landing.jobs' rel='nofollow'>Landing.jobs</a> is a tech recruitment marketplace dedicated to matchmaking top tech talent with top tech employers.</p><p>We are based in <strong>Lisbon</strong> but we have our team spread across <strong>Germany, Spain</strong> and <strong>UK</strong> and we are planning to soon take over a new market and increase our pool of 80K+ users and 200+ active companies!</p><p></p><p><strong>“To provide the best human experience when looking for a tech job in Europe&quot;</strong> </p><p>This is the mission of our <strong>Talent Development Team</strong> and we are looking for someone who's looking to make an impact in the lives of real people to join this team. </p><p>As one of our users said: &quot;Landing.jobs is trying to put Human in Human Resources again.&quot; </p><p>Being part of this team means you are going to help people land jobs and to make better career decisions</p><p><strong>Your Role</strong></p><p>As Talent Advocate you will be dedicated to help our users achieve the goal of getting a job in a short term or plan their career in a long term perspective.</p><p>You will become an expert in tech recruitment market to guide our community.</p><p>You will be evaluated according to our Net Promoter Score which is a rate that shows how happy our users are with your work!</p><p><strong>What you will be doing</strong></p><ul><li>Select the right candidates given the opportunities available at the platform (matching)</li><li>Funnel Analysis to create awareness to numbers and ratios and find solutions to improve</li><li>Understand what are our talents’ interests and career goals</li><li>Make tailored suggestions of job positions based on what they’re looking for</li><li>Share useful information about companies and job openings</li><li>Share market insights (countries, visa, relocation, etc.) and the salary conditions our Talent deserves</li><li>Help improving things like CV and Landing.jobs’ profile</li><li>Give support during the hiring process, including help with decision-making regarding salary negotiations and relocation processes</li><li>Understand if candidate needs further specialised Coaching and act according to their needs</li></ul><h3>Main requirements</h3><ul><li>1-2 years of experience working within recruiting</li><li>You must be a people’s person and someone really communicative</li><li>Data driven mindset and solution oriented</li><li>Positive and proactive attitude, always aiming for more</li><li>Fluent in English so you can talk with our users that come from all over the world</li></ul><h3>Nice to have</h3><ul><li>Previous experience at a Startup</li><li>Previous experience in tech recruitment</li><li>Previous experience in an international environment</li></ul><h3>Perks</h3><ul><li>Access to our internal mentorship program</li><li>Internal team training sessions with invited guests</li><li>Gym &amp; another employee only discounts</li><li>Team-building event every quarter</li><li>Regular community meetups at our office</li><li>Work from home policy</li><li>Team lunch every other Friday</li></ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3iVTi0eZSGGf-lMh5MO6TA",
    "url": "https://jobspresso.co/job/recruiter-7/",
    "title": "Recruiter",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Amazon",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 16, 2018 10:44:08 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Recruiter</h2><div>Various<br></div><div>Anywhere in US<br></div><div>Company: Amazon<br></div><div>Full Time<br></div><h3>Overview</h3><p>At Amazon our mission is to be the most customer-centric company on earth.</p><p>The NA Consumables recruiting team is looking for a Tech Recruiter to work with our highly collaborative team of sourcing recruiters, client lead recruiters, and coordinators. The Recruiter will drive sourcing strategy, identify and recommend process improvements, and partner with team members in the execution of these critical components of talent acquisition.</p><p>The candidate must be able to successfully manage, prioritize and close searches against a timeline and have experience setting benchmarks, metrics, and understand how to prioritize. They thrive in an innovative, fast-paced environment, can roll up their sleeves, work hard, have fun, and get the job done. The best candidates will draw on extensive knowledge of Talent Acquisition and have sharp business acumen, forging dynamic relationships with business leaders, hiring managers and HR business partners. They have a reputation for being exceptional at candidate generation, client/account management, are highly organized, effective communicators, possess the ability to prioritize, push back, and demonstrate a strong sense of urgency, all while being highly customer focused and collaborative.</p><p>· Partner with hiring teams to build and execute effective sourcing, assessment, and closing approaches with an ability to manage customer/partner expectations through a deep understanding of return on investment. · Partner effectively with recruiting team peers and cross-functional partners (Compensation, HR, Systems and Programs teams, etc.) · Must be able to understand how to recruit passive candidates at all levels and develop sophisticated closing strategies that seek for matching fit and motivation rather than focusing on selling alone. · Recommend ideas and strategies related to recruitment that will contribute to the long-range growth of the company, · Articulate in writing a plan with deliverables, timelines and a formal tracking process. · Interview candidates within the framework of the position specification. Possess strong ability to screen, interview and prepare a candidate slate within an appropriate and consistent timeline.</p><br><br><br><br><br><p>BASIC QUALIFICATIONS</p><ul></ul><li>3+ years of proven experience as full cycle recruiter within high growth organizations</li><li>Experience building and utilizing a variety of sourcing plans and tools, including proactive phone and internet research.</li><li>Track record of success in facilitating the identification and attraction of industry leading talent for immediate business needs, as well as for critical long-term talent planning and pipelining</li><li>Experience working with essential tools of the trade, resume databases, and internet sourcing tools</li><li>MS Office – including Word, Excel, PowerPoint and Outlook.</li><li>Excellent written and verbal communication, as well as influencing skills</li><li>Experience managing and prioritizing multiple searches, projects and client relationships.</li><li>Bachelor’s degree, or equivalent experience</li><p>PREFERRED QUALIFICATIONS</p><ul></ul><li>Participate in special projects/recruiting initiatives, including assessment of best practices in interviewing techniques, leveraging of internal sources of talent and identification of top performers</li><li>Excellent written and verbal communication, as well as influencing skills</li><li>Organized, pragmatic people who thrive in a results oriented environment are encouraged to apply</li><li>Skilled at partnering with hiring teams to build effective sourcing, assessment, and closing approaches with an ability to manage customer/partner expectations through a deep understanding of ROI</li><li>Experience creating, measuring and scaling workflow between Candidates, Hiring Managers and the Recruiting team</li><p>Amazon is an Equal Opportunity Affirmative Action Employer- F/M/V/D</p><div> <div><div><p> <br><br> <b>To apply for this job please visit the URL below.</b> <br><br> Please reference <b>Jobspresso</b> in your job application, so that remote companies know where their best candidates are coming from  <br><br> <a href='https://www.amazon.jobs/en/jobs/716245/recruiter' rel='nofollow'>https://www.amazon.jobs/en/jobs/716245/recruiter →</a></p></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "XH0X05fyQ3GA0EWarTlWUQ",
    "url": "https://weworkremotely.com/remote-jobs/action-verb-technical-recruiter",
    "title": "Action Verb: Technical Recruiter",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Action Verb",
      "sameAs": "https://actionverb.com/now-hiring"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 13, 2018 11:54:14 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Technical Recruiter</h2><span>Company: Action Verb<br></span><span>Headquarters: Las Vegas, NV<br></span><span>https://actionverb.com/now-hiring<br><br></span>  <div>    <div><span>Are you a driven recruiter who knows how to seek out top technical talent? Have you ever wanted to take the reigns of recruiting for a company that can hire talent located anywhere in the country? Do you want to build a company’s recruiting pipeline, department, and systems? If so, we’d like to hear from you.</span></div><div><span><br></span></div><div><h4>For This Role, We Want To See This Track Record of Results:</h4></div><div><br></div><ul><li>History of successfully locating engineering talent using online search tools, including LinkedIn, GitHub, etc.</li><li>History of placing actual engineers into actual jobs where both the engineers and the company are happy with the hiring arrangement.</li><li>You’ve developed your own strategies and methods for reaching the “unreachable” engineers who don’t maintain a public presence.</li></ul><div><br></div><div>Please stop reading now if these bullets do not describe your experience. We do not make inexperienced hires. But if they do describe your experience, please read on!</div><div><br></div><div><b>Salary and Benefits</b></div><div><br></div><div>Action Verb offers competitive salaries combined with unparalleled flexibility and other benefits to secure top talent.</div><div><br></div><div>This position pays&nbsp;<b>at least</b>&nbsp;$110,000-130,000 per year, based on experience and track record, plus a great benefits package, and a $2,500 signing bonus to purchase a new computer, desk, or anything else that would help build or refresh your home office.</div><div><br></div><div>After your first year with Action Verb, we’ll update your salary annually based on your performance, as reviewed by your peers. Over the course of your career at Action Verb, your salary can grow by 2-3x if you are one of our highest performers.</div><div><br></div><div>We fully pay base plan health insurance premiums (exact plan details depend on your state of residence), and we’ll pick up the tab for 75% of your spouse or family if they wish to join your chosen plan. We want your family to be healthy.</div><div><br></div><div>You’ll take off 11 company-wide holidays per year as well as 20 days of PTO for vacations. Go have fun. Don’t work all the time.</div><div><br></div><div>Plus, you can join Action Verb Risk Free because of our $7,500 Quitting Bonus Within Your First 90 Days.</div><div><br></div><div>Want to read more about our culture and philosophy?&nbsp;&nbsp;</div><div>Go here:&nbsp;https://actionverb.com/working-at-action-verb</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://actionverb.com/job-ads/recruiter' rel='nofollow'>https://actionverb.com/job-ads/recruiter</a></p>  </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "TVG8D4UuQs2PcFUc59XRbA",
    "url": "https://remote.co/job/hr-generalist-4/",
    "title": "HR Generalist",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Keeping Your Balance",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 13, 2018 6:35:03 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>HR Generalist at <span>Keeping Your Balance</span></h2><div><span><i></i> Remote</span>         | <span> Part-time </span></div><div>            <p><strong>Part-Time HR Generalist</strong></p><p><em><strong>In addition to applying through our website, please call us &amp; leave a voicemail at 415.737.5592 letting us know why you are perfect for this position. Candidates who do not leave a message will not be considered.</strong></em></p><p><strong>WHAT WE DO</strong><br>Keeping Your Balance provides reliable, cloud-based accounting, payroll and HR solutions for fast-growing small businesses. We employ the latest technology to provide efficiencies to our clients, and stay on the cutting edge of the ever-changing accounting industry. Our friendly, knowledgeable and professional team members care about our clients and strive to help them grow their businesses.</p><p><strong>WHO WE WORK WITH</strong><br>We work almost exclusively with fast-growing small business. From restaurants and early stage start-ups to professional service firms and non-profits, KYB provides a scalable accounting solution for high-growth companies.</p><p>We are looking for experienced accounting and HR specialists to join our growing team! Strong written and verbal communication skills are vital to ensure professional communication with clients. The successful candidate will possess not only the required technical skills, but an ability to provide service to our clients with a smile and a natural desire to go above and beyond expectations.</p><p><strong>Responsibilities</strong></p><ul><li>Provide HR support to one or more client accounts in coordination with a support team of bookkeepers, accountants, and HR specialists.</li><li>Administer payroll, and employee benefits and organizational insurance.</li><li>Administer all client Human Resources plans and procedures, as well as development and implementation of new plans and procedures.</li><li>Perform client benefits administration, including claims resolution, change reporting, Open Enrollment, approving invoices for payment and communicating benefits information to employees.</li><li>Manage onboarding and offboarding of employees for client accounts</li><li>Maintain human resource information system records and compiles reports from the database.</li><li>Advise clients on compliance with federal, state and local employment and benefits laws and regulations.</li><li>Provide answers to general HR questions from client, referring them to additional resources when appropriate.</li></ul><p>To be considered, candidates should meet the following requirements:</p><p><strong>Required Skills</strong></p><ul><li><strong>3+ years experience as an HR generalist</strong></li><li><strong>HR certification or qualifications to obtain certification</strong></li><li>Extensive payroll experience, multi-state and/or CA payroll experience are pluses</li><li>Ability to communicate effectively with clients, team members and outside vendors verbally and in writing, providing the necessary follow up to ensure a great customer experience</li><li>Excellent computer skills and proficient in Excel and other standard programs; experience with or the ability to quickly learn Quickbooks accounting software along with cloud-based billing software and various web-based tools for banking and credit card processing.</li><li>High level of general computer knowledge; comfortable learning new programs and tools</li></ul><p><strong>Additional Qualifications</strong></p><ul><li>Familiar with Zenefits or other HRIS</li><li>Multi-client experience a plus</li><li>Comfortable working in a virtual, paperless environment</li><li>Strong ability to meet deadlines and handle multiple assignments</li><li>Proven ability to work in a self-directed manner, with initiative and exceptional follow-through</li><li>Sound judgment, strong decision-making skills &amp; abundant common sense</li><li>High attention to detail, organized, and assertive</li><li>Self-aware, comfortable knowing your own limits and when to ask for help</li><li>High personal ethical standards</li><li>Able to consistently and accurately follow established policies and procedures</li><li>Eager to leverage technology for efficiency and progress</li><li>Friendly demeanor with a positive can-do spirit; takes pride in high-quality work</li></ul><p><strong>This position is part-time (during regular business hours) and 100% remote.&nbsp;</strong>This position has the potential to work into full time in the future. You will work from the location of your choice on your own equipment, which should include high-speed internet, PC with Windows 7 or newer and MS Office, webcam with microphone and speakers, and phone.</p>        </div><div>        <a href='http://keepingyourbalance.applytojob.com/apply/job_20180910163200_AI4P5GAIF77BJIQ0/PartTime-HR-Generalist-Work-From-Home' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "rv_rARGbSuOSEcMpyCaLdQ",
    "url": "https://angel.co/consensys/jobs/231931-human-resources-and-recruiting-coordinator",
    "title": "Human Resources and Recruiting Coordinator",
    "tags": [
      "Brooklyn",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "H.R.",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "ConsenSys",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 50000,
      "maxValue": 55000,
      "info": "0.01% – 0.01%",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 10, 2018 6:10:29 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Human Resources and Recruiting Coordinator at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$50K–$55K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Apply Here: </p><p>ConsenSys is a venture production studio focused on building and scaling tools and enterprise software products powered by Ethereum. Our mission is to use these solutions to power the emerging economic, social, and political operating systems of the planet.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, the music industry, security and infrastructure, and more. To accomplish this, we’ve built out a flat organizational structure which we call the ConsenSys Mesh; a network of individuals &amp; teams working autonomously and towards the same goal. The MeshOps team is responsible for designing and implementing “Meshocracy”, our own operational &amp; company structure loosely based on the principles of holacracy. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p>The Role</p><p>The Human Resources and Recruiting Coordinator is an integral member of our team!  We need help telling our story around the world!  In this role you will develop a solid foundation of knowledge and experience as part of a greater global team serving countless internal customers and projects on 6 continents. You will have the opportunity to build candidate relationships, and partner with recruiters, human resources and hiring managers. The ideal candidate seeks career growth within Recruiting and/or Human Resources and will provide support in many different areas.  This is truly a choose your own destiny situation, and a chance for ownership.  This role will grow and evolve as ConsenSys grows and incolves</p><p>Build excellent relationships across our organization<br>Create welcome packages and kits for new hires<br>Coordinate interview activities on-campus and in-house including, but not limited to, scheduling and calendar invites; interview confirmation emails; reserving interview rooms and telephone/video conference (when necessary); and candidate debrief calls/meetings<br>Schedule and coordinate logistics for all campus recruiting events, e.g. RSVPs, payment/check requests, calendar invites, etc.<br>Manage inventory for all recruiting swag and ensure all swag is readily available.<br>Coordinate offer letter process and as well as onboarding set-up<br>Provide support on special projects and initiatives<br>Assist with the internship program and internal events<br>Assist with wellness endeavors<br>Required Skills:</p><p>Meticulous attention to detail and strong organizational skills with proven ability to prioritize and complete projects within deadlines<br>Self-starter who loves taking initiative<br>Creative problem solver<br>Discreet and able to manage sensitive information<br>Flexibility, high energy and a positive attitude<br>Prior experience in a Recruiting or Human Resources department is preferred<br>Familiarity with applicant tracking systems, HR systems and social media is preferred<br>Ability to focus on the details, but also understand the bigger picture<br>Bonus Points:</p><p>Interest in new technology, Blockchain, and/or Ethereum<br>Humble, kind, and doesn't take themselves too seriously</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "vnCjKbtsQj24yq62IC2x_w",
    "url": "https://jobspresso.co/job/recruiter-6/",
    "title": "Recruiter",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Hyperloop Transportation Technologies",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 9, 2018 11:18:38 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Recruiter</h2><div>Various<br></div><div>Anywhere<br></div><div>Company: Hyperloop Transportation Technologies<br></div><div>Full Time<br></div><h3>Overview</h3><p>In a world of innovation pretenders, Hyperloop Transpiration Technologies is one of the true innovators.</p><p>We are building test and demonstration facilities all around the world, demonstrating how to move people and freight at unheard of speeds, safely, efficiently and sustainably.&nbsp; We are creating new technology and new uses of existing technology to support our entirely new philosophy of transportation.&nbsp; And we are approaching talent measurement, acquisition, and management in a way that few if any other companies have done.</p><p>You can help us with this groundbreaking organizational philosophy to find the best talent in the world.</p><p></p><strong>The Position:</strong><p>Part of our innovation is being very flexible and adaptive.&nbsp; As a result, we welcome recruiting professionals of widely differing levels of accomplishment.&nbsp; All must be good at identifying or identifying and delivering superior candidates and must want to learn but may come to us as sourcers or recruiter/interviewers.</p><p>Our environment offers flexibility regarding time commitment, schedule and the industries and disciplines in which we need to find candidates.&nbsp; We also offer the opportunity to work in a low-supervision/high-collaboration setting.&nbsp; We have recruiters working in Europe and The Americas.</p><p></p><strong>The Ideal Candidate:</strong><p>We offer the freedom to demonstrate high levels of recruiting problem-solving with minimal direction.&nbsp; We offer opportunities to deliver self-motivated results.</p><p>We insist that every member of our team be knowledgeable and passionate about HyperloopTT’s mission.&nbsp; We are inventing and delivering the next generation of transportation and want partners to join us find even more talented and committed individuals for our team.&nbsp; Obviously, this passion is one of the great attractions of being part of HyperloopTT.</p><p></p><strong>The Organization:</strong><p>In April 2018, HyperloopTT signed a historic agreement for the first commercial Hyperloop system of 10km with a developer in Abu Dhabi.&nbsp; Earlier in that month, HyperloopTT began construction of the first full-scale passenger and freight prototype system in Toulouse, France.</p><p>HyperloopTT is realizing the Hyperloop, a system that moves people and goods at unprecedented speeds safely, efficiently, and sustainably. Through the use of unique, patented technology and an advanced business model of lean collaboration, open innovation and integrated partnership, HyperloopTT is creating and licensing technologies.</p><p></p><strong>The Opportunity:</strong><p>You can be an integral part of the greatest transportation transformation since the invention of the airplane.</p><p></p><strong>Compensation:</strong><p>HyperloopTT’s recruiters are project-based, work as many hours as their personal schedules allow, work where they are and are compensated through a generous stock option program.&nbsp; It is an ideal second job.</p><p>Please answer at least 3 of the following optional 7 numbered questions related to your recruiting&nbsp;experience.&nbsp; More is fine and, in fact, helps us.&nbsp; But our intention is to respect how busy you are and not make this application onerous.</p><p>This approach allows continuity throughout the entire employee experience and provides the orderliness and job relatedness sought by employment law.</p><div> <div><div><p> <br><br> <b>Let's do this! Apply for this job at the URL below.</b> <br><br> Please reference <b>Jobspresso</b> in your job application, so that remote companies know where their best candidates are coming from  <br><br> <a href='https://boards.greenhouse.io/httfrance/jobs/1251708' rel='nofollow'>https://boards.greenhouse.io/httfrance/jobs/1251708 →</a></p></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "WJ0Jjg0FQ0KvnX_HOMTL7A",
    "url": "https://jobspresso.co/job/retail-recruiter/",
    "title": "Retail Recruiter",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Rent the Runway",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 9, 2018 4:27:33 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Retail Recruiter</h2><div>Various<br></div><div>Anywhere in San Francisco<br></div><div>Company: Rent the Runway<br></div><div>Contract<br></div><h3>Overview</h3><p></p><strong>Note: This is a remote position but you must be located in San Francisco, CA.</strong><p>Recently named #9 on CNBC’s Disruptor 50 list for 2018, Rent the Runway is transforming the $1.7 trillion global fashion industry by introducing clothing rental as a utility for women. We have pioneered the closet in the cloud and believe that every person globally will soon have a subscription to fashion. Since our launch in late 2009, we have raised $210M from top-tier investors and built one of the most beloved brands on earth. We are proud to be both a profitable and high-growth business, with a loyal 8 million strong customer base who share the experience of renting as being empowering and smart.</p><p>Our 1000+ employees have a revolutionary spirit that permeates our culture. We’ve built – proprietary technology, a one-of-a-kind reverse logistics operation, stores of the future, a viral brand, relationships with hundreds of fashion brands – and we are obsessed with continuing to game change our customer experience.</p><p>We are also trying to revolutionize entrepreneurship itself – proving that diverse teams produce outsized impact. The Rent the Runway Foundation, which our two co-founders launched together in 2015, helps thousands of female entrepreneurs build and scale their own businesses with the mission of increasing the number of high growth women-led companies.</p><p></p><strong>Position Overview:</strong><p>Rent the Runway is looking for a seasoned Contract Recruiter to help grow our retail footprint in San Francisco.. This is a remote position located in San Francisco, CA and you will be responsible for supporting the hiring needs of our San Francisco store location across all positions including store experience associates, merchandising specialists, operations associates, leadership roles and more. We are seeking an experienced recruiter with a proven network and a stellar reputation among the talent market.</p><p></p><strong>Responsibilities:</strong><ul></ul><li>Support recruiting for the San Francisco market focused on attracting retail talent, sourcing and screening top talent for various roles</li><li>Creatively source and network to create pipelines for current and future opportunities while building company presence in the market and actively recruiting</li><li>Interview candidates to determine skill set and level of interest</li><li>Gather and review interview feedback and make recommendations on the most qualified candidates</li><li>Maintain applicant tracking system to ensure accurate and up-to-date information</li><li>Manage, maintain and support current recruiting processes and tools to ensure best practice and consistency</li><p></p><strong>Qualifications:</strong><ul></ul><li>Bachelor’s degree required</li><li>Minimum of 3-5 years experience in high volume, full life-cycle recruitment in the San Francisco market</li><li>Retail industry experience required; experience in fast-paced, tech-driven start up environments preferred</li><li>Depth of knowledge in San Francisco e-commerce, retail and start up industries. Must be well connected in San Francisco with established relationships with top talent (a proven network)</li><li>Able to thrive in fast-paced environments, adapt quickly, and be highly flexible</li><li>Detail-oriented, highly organized, and know how to manage competing demands</li><li>Experience with applicant tracking systems (Greenhouse is a plus)</li><li>Strong verbal and written communication, negotiation skills, and customer service skills</li><li>Entrepreneurial drive</li><li>Ability to operate independently given the remote nature of the position</li><div> <div><div><p> <br><br> <b>Let's do this! Apply for this job at the URL below.</b> <br><br> Please reference <b>Jobspresso</b> in your job application, so that remote companies know where their best candidates are coming from  <br><br> <a href='https://boards.greenhouse.io/renttherunway/jobs/1314599' rel='nofollow'>https://boards.greenhouse.io/renttherunway/jobs/1314599 →</a></p></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "t5D5CVIuRM-VTVLwQtkunw",
    "url": "https://vuejobs.com/jobs/481-vue-js-developer-20-hrs-a-week",
    "title": "Vue.js Developer (20 hrs a week +)",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:vue.js/frontend/40",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=41}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "EverythingFood.com",
      "sameAs": "https://www.everythingfood.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 5, 2018 7:17:16 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h3>Vue.js Developer (20 hrs a week +)</h3><div>Company: EverythingFood.com<br></div> Location: Orange, California, USA, Remote Allowed<br>Job type: Freelance<br>Salary: USD 75-90<br>Skills: <li>Github</li><li>Netlify</li><li>Nuxt</li><li>vue</li><li>vue js</li><div>                        <h3>Company description</h3>                        Online eCommerce Grocery Retailer                    </div><div>                    <h2>Job description</h2>                    <p>This is a cushy job for someone who REALLY know Vue.js, GitHub, Nuxt, Netlify, and reusable components.</p><p>The design team generate a Design Spec. The API Team delivers functioning API endpoints. And all you have to do is stitch everything together.</p>                </div><a href='mailto:ddoble@everythingfood.com' rel='nofollow'>Apply now!</a>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "E2nZL86TSC6S3nNBcz2jdg",
    "url": "http://www.indeed.co.uk/viewjob?t=Unity+Developer+Remote+Working&jk=623ec00a9d3ade90&",
    "title": "Unity Developer 80% REMOTE WORKING - IT Talent - Cardiff",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:unity3d/gamedev/8",
      "DBG_TECH1:k/t/w:unity3d/mobile/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=5, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "£",
      "minValue": 200,
      "maxValue": 250,
      "info": "Contract",
      "unit": "DAY",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 13, 2018 6:47:47 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
