{
 "items": [
  {
    "id": "VIuuz4QIRKyAK_CMJQSi5Q",
    "url": "https://remote.co/job/financial-administrator/",
    "title": "Financial Administrator",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "CDI College",
      "sameAs": "http://www.cdicollege.ca/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 7, 2019 2:43:53 PM",
    "validThrough": "Oct 14, 2019 2:43:53 PM",
    "crawled": "Oct 7, 2019 3:07:34 PM",
    "content": "<h3>Financial Administrator at <span>CDI College</span></h3><div><span><i></i> Remote</span>         | <span> Entry-level </span></div><div>            <p><strong>Online Campus – (FIN-FINADMIN-CS)</strong></p><p>Job Title: Financial Administrator – Online Campus</p><p>Category: Finance</p><p>Location</p><p><strong>Remote (Virtual) – CA – CA (Primary)</strong></p><p># of Hires Needed: 1</p><p><strong>Education: Bachelor Degree</strong></p><p>Background Check and Education Verification Required: Yes</p><p>Job Type: Ongoing Full-Time</p><p><strong>Job Description</strong></p><p>The purpose of the Financial Administrator position is to monitor and coordinate funding for students, ensure the collection of all student accounts receivables, and provide accounting-related services to the Online campus. Under general supervision, the Financial Administrator is responsible for providing assistance, advice and guidance to support the financial needs of students and the campus and to ensure the collection of funds.</p><p><strong>Specifically, the Financial Administrator is responsible for:</strong></p><ul><li>Managing the day-to-day financial operations of the campus</li><li>Continuously analyzing campus financial data to guarantee responsiveness to issues</li><li>Working with students to ensure appropriate funding is secured</li><li>Supporting the administrative functions of the campus to enhance the student experience</li><li>Ensuring compliance with internal and external policies, procedures and standards</li><li>Acting in a manner that upholds the College standards</li></ul><p><strong>Job Requirements</strong></p><p>To be successful in the Financial Administrator position, an individual must be committed to developing, maintaining and demonstrating the following:</p><p><strong>Education and Experience:</strong></p><ul><li><strong>Completion of post-secondary education in Business, Accounting or Finance. Bachelor’s degree preferred.</strong></li><li>A minimum of one years’ accounting or finance experience in a. service-oriented environment</li><li>An equivalent combination of education and experience will be considered.</li></ul><p><strong>Skills and Abilities:</strong></p><ul><li>Solid working knowledge of MS Office including Word, Excel, Outlook and ability to troubleshoot minor computer problems.</li><li>Superior skills in working with numbers, detail orientated.</li><li>Excellent organizational skills with ability to multi-task.</li><li>Ability to complete work in a timely manner with accuracy and attention to detail.</li><li>Ability to work independently with minimum supervision.</li><li>Good judgment and ability to prioritize assignments.</li><li>Ability to work under pressure and maintain a calm focus during hectic periods.</li><li>Understanding of the programs and services provided by the Company.</li><li>Ability to exhibit a professional attitude and image with a commitment to quality service.</li><li>Excellent interpersonal, oral, and written communication skills</li><li>Ability to effectively communicate and interact with all individuals with integrity, empathy and sincerity.</li><li>A positive attitude and customer focused approach.</li></ul>        </div><div>        <a href='https://cdicollege.mua.hrdepartment.com/hr/ats/Posting/view/2495' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "8aiJUXf4TH2GQTGeshs1QQ",
    "url": "https://weworkremotely.com/remote-jobs/mazzei-injector-company-accounting-assistant",
    "title": "Mazzei Injector Company: Accounting Assistant",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Mazzei Injector Company",
      "sameAs": "http://mazzei.net"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 6, 2019 1:14:33 AM",
    "validThrough": "Oct 13, 2019 1:14:33 AM",
    "crawled": "Oct 6, 2019 2:06:30 AM",
    "content": "<h3> Accounting Assistant </h3><div><div>As the Accounting Assistant, you will assist and perform necessary tasks to ensure the accuracy of the company’s accounting records including but not limited to responsibility of daily deposits for multiple business lines, managing AP process &amp; AR related reporting and records management. Pay is $40/hr<br><br><br>Knowledge, Skills, and Abilities:<br>&nbsp;• Basic accounting practices and procedures<br>&nbsp;• Invoicing procedures<br>&nbsp;• Basic accounts payable and/or accounts receivable practices and procedures<br>&nbsp;• Basic computer applications and computerized accounting systems<br>&nbsp;• Cash handing policies and procedures<br>&nbsp;• Meet deadlines<br>&nbsp;• Ability to problem solve and determine best course of action<br>&nbsp;• Work as a team member and foster a cooperative work environment<br><br>Job Type: Full-time, Partime<br><br>Work Location: Remote<br><br>we believe that diversity of experience and thought makes us stronger. We encourage applicants across any race, ethnicity, gender/gender expression, age, religion, ability and experience. With both customers and employees around the world, we are committed to ensuring our team reflects the unique communities around us. We can't wait to meet you.&nbsp;</div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "UfnTUCArSaCNyP4wymTOaA",
    "url": "https://remote.co/job/accounting-associate-2/",
    "title": "Accounting Associate",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Fractured Atlas",
      "sameAs": "https://www.fracturedatlas.org/"
    },
    "salary": {
      "currency": "USD",
      "minValue": 48811,
      "maxValue": 48811,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 48.8k /Year"
    },
    "employmentType": "UNSET",
    "published": "Oct 4, 2019 5:42:36 PM",
    "validThrough": "Oct 11, 2019 5:42:36 PM",
    "crawled": "Oct 4, 2019 6:24:16 PM",
    "content": "<h3>Accounting Associate at <span>Fractured Atlas</span></h3><div><span><i></i> Remote</span>         | <span> Entry-level </span></div><div>            <ul><li><strong>United States</strong></li><li>Full Time</li><li>Entry Level</li></ul><p><strong>OVERVIEW</strong></p><p>Fractured Atlas, the largest association of artists in the U.S., is looking for a full-time Accounting Associate to provide support to the Finance team by managing daily accounting tasks and serve as a point of contact for financial transaction communication across teams.</p><p>The successful candidate will be someone who thrives in Fractured Atlass work hard, live well environment. Our organizational culture embraces people who:</p><ul><li>Seek out challenging problems and relish opportunities to venture into unexplored territory.</li><li>Are entrepreneurial and comfortable with highrisk, highimpact efforts.</li><li>Are agile, creative problem solvers with an unsentimental focus on concrete results.</li><li>Invest their time in quality work and giving others their respect and support.</li></ul><p>Additionally, at Fractured Atlas, we are committed to anti-racism, anti-oppression principles in all areas of our internal and external work. This commitment is grounded in our belief that change is possible, and that our work, and that of the artistic community more broadly, will grow stronger as oppression is eliminated. Learn more about what it’s like to work at Fractured Atlas by visiting work.fracturedatlas.org.</p><p><strong>RESPONSIBILITIES:</strong></p><ul><li>Post journal entries including bills, invoices, and payroll transactions;</li><li>Assist with account analysis and bank reconciliations;</li><li>Prepare and examine accounting records, financial statements, grant financials, and other financial reports;</li><li>Assist in month-end close and annual audit preparation and vouching activities;</li><li>Manage accounts payable and accounts receivable processing;</li><li>Coordinate and execute the filing of regulatory tax forms including (1099, 1042 and state charity renewal forms);</li><li>Communicate financial activities across departments in a timely, error-free manner.</li></ul><p><strong>IN THIS POSITION YOU WILL:</strong></p><ul><li>Report to the Controller, work closely with the Senior Director, Financial Operations &amp; Analysis, and collaborate cross-functionally with other departments, including the Programs, External Relations, and Engineering teams;</li><li>Contribute to the achievement of company and department goals through the timely processing of financial data and coordination with various teams;</li><li>Ensure compliance with all accounting policies and procedures.</li></ul><p><strong>QUALIFICATIONS:</strong></p><ul><li>Ability to enter data into various electronic systems while maintaining its integrity and accuracy;</li><li>Proficiency in Microsoft Office Suite, especially Microsoft Excel;</li><li>Strong organizational skills with the ability to quickly prioritize and pivot between tasks;</li><li>Self-motivated and self-directed. Must have superior attention to detail and be proactive in accomplishing set goals and objectives;</li><li>Possesses a team mentality! The Finance team (if we say so ourselves) is energetic, innovative, and straight-up fun. We work well together and are passionate about what we do.</li><li>Are versed in generally accepted accounting principles (GAAP) and monitor updates with FASB recommendations and standards;</li><li>Bonus points if you are:<ul><li>Proficient in Quickbooks or similar Accounting software;</li><li>Familiar with non-profit accounting standards;</li><li>Experienced with data analytics platforms;</li><li>Passionate about independent artists, creative makers and doers!</li></ul></li></ul><p><strong>LOCATION</strong></p><p><strong>This position can be 100% virtual (with travel about 2-3 times per year).</strong>&nbsp;The Fractured Atlas staff currently live and work in 11 different states, with the organization transitioning to be entirely virtual by January 1, 2020. As such, you can live and work almost anywhere in the United States with a reliable high-speed internet connection. Although you can work from almost anywhere, you must be available to attend meetings during a 9AM-6PM EST window.</p><p><strong>COMPENSATION</strong></p><p>Salary is $48,811.20/year (overtime eligible). Benefits include dental and medical insurance, flexible spending account, 401K plan with employer-contributed match, commuter benefits, professional development allowance, ticket allowance, paid vacation and sick days, paid family leave, and a casual but hard-working, friendly and supportive work environment.</p><p><strong>OUR COMMITMENT</strong></p><p>Fractured Atlas is an equal opportunity employer that values diversity, equity, and inclusion. (Read more about our Anti-Racism and Anti-Oppression commitment.) We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>        </div><div>        <a href='https://fracturedatlas.applytojob.com/apply/j12cEt1Ke0/Accounting Associate?source=www.fracturedatlas.org' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "MBNBUZuLQhO27NpobJ8FXQ",
    "url": "https://remote.co/job/accounting-manager-internal-controls/",
    "title": "Accounting Manager – Internal Controls",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Kraken",
      "sameAs": "https://www.kraken.com/en-us"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 3, 2019 2:36:36 PM",
    "validThrough": "Oct 10, 2019 2:36:36 PM",
    "crawled": "Oct 3, 2019 3:07:26 PM",
    "content": "<h3>Accounting Manager – Internal Controls at <span>Kraken</span></h3><div><span><i></i> Remote</span>        </div><div>            <p>SAN FRANCISCO</p><p>FINANCE</p><p><strong>REMOTE FULL-TIME</strong></p><p><strong>About Kraken</strong></p><p>Our mission is to accelerate the adoption of cryptocurrency so that you and the rest of the world can achieve financial freedom and inclusion. Founded in 2011 and with over 4 million clients, Kraken is one of the world’s largest, most successful bitcoin exchanges and we’re growing faster than ever. Our range of successful products are playing an important role in the mainstream adoption of crypto assets. We attract people who constantly push themselves to think differently and chart exciting new paths in a rapidly growing industry. Kraken is a diverse group of dreamers and doers who see value in being radically transparent. Let’s change the way the world thinks about money! Join the revolution!</p><p><strong>About the Role</strong></p><p><strong>This role is fully remote and based in the US or Canada.</strong></p><p>The Accounting Manager Internal Controls will be an integral part of the Finance leadership team. You will work closely with your Finance and Accounting leadership cohorts as well as business partners and other internal and external stakeholders. This role reports to the Corporate Controller.</p><p><strong>Responsibilities</strong></p><ul><li>Develop company-wide and business process risk assessments to evaluate and address any impact the results may have on the control environment.</li><li>Design and implement efficient and effective controls across the organization.</li><li>Implement documentation including process narratives, process flowcharts, risk and controls matrix and evaluate controls. Particularly around a proprietary exchange trading platform.</li><li>Identify and evaluate business and technology risks, internal controls which mitigate risks, and related opportunities for internal control improvement and implementation.</li><li>Use critical thinking skills to quickly identify internal control deficiencies, evaluate their risk implications, and draw the appropriate conclusions.</li><li>Actively participate in decision making with process owners, provide meaningful insights, and seek to understand the broader impact of current decisions.</li><li>Build and nurture positive working relationships with process owners, by providing high-quality deliverables and communications, providing them tools and templates that can help them better achieve their process objectives and our control objectives.</li><li><strong>Conduct periodic meetings/walkthroughs&nbsp;</strong>with process owners to ensure any changes to processes are updated and properly assessed for control gaps. Supporting process owners through training, reviewing, and providing guidance for their processes.</li><li>Staying current to changes in regulatory guidance, industry best practices, and areas of focus/hot topics for external audits.</li><li>Actively building and managing relationships with Company stakeholders, while promoting the importance of compliance initiatives throughout the organization.</li><li>Facilitate requests between the control owners and the external audit team.</li></ul><p><strong>Skills and Experience</strong></p><ul><li><strong>Bachelor’s degree in Accounting or closely related field</strong></li><li>CPA in good standing strongly preferred</li><li>7+ years of accounting/audit experience</li><li>Industry experience in financial services, fintech, banking, or exchange strongly preferred</li><li>Experience or knowledge with cryptocurrency is strongly preferred</li><li>Knowledge of US GAAP and experience with SOX</li><li>Strong communication skills</li><li>Collaborative, innovative, flexible, and adept at building relationships across the organization</li><li>Ability to handle multiple projects and deliverables in a fast-paced, dynamic environment</li><li>Google Suite and Microsoft Office proficiency</li><li>Microsoft Excel proficiency including pivot tables, H &amp; V-Lookup</li><li>Experience using an ERP systems like GreatPlains, Oracle or NetSuite a plus</li><li>Experience with high volume transactions is a plus</li><li>Audit experience from the Big 4 or national accounting firms is a plus</li></ul>        </div><div>        <a href='https://jobs.lever.co/kraken/03caf209-3f40-457a-b936-930a661fbfbf' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "j44BO-CmSy201GoKYrVWqQ",
    "url": "https://remote.co/job/accountant-8/",
    "title": "Accountant",
    "tags": [
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Accountingprose",
      "sameAs": "https://www.accountingprose.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 2, 2019 6:37:40 PM",
    "validThrough": "Oct 9, 2019 6:37:40 PM",
    "crawled": "Oct 2, 2019 7:31:44 PM",
    "content": "<h3>Accountant at <span>Accountingprose</span></h3><div><span><i></i> Remote</span>        </div><div>            <p>Denver, Colorado, United States · Accounting</p><p><strong>Description</strong></p><p>As an Accountingprose Superhero Accountant, you will be responsible for keeping your clients’ financials up to date on a daily, weekly, monthly, or quarterly basis. This translates to reconciling bank/credit card accounts, entering accounts payable, entering accounts receivable, processing payroll, syncing software, and preparing month-end financial statements.</p><p>You will also be responsible for building trust and rapport with our clients through weekly emailed progress reports and impromptu video calls. In return you will gain mastery over the cloud accounting software that Accountingprose utilizes to perform work, which will help you grow your industry knowledge and advance your career in the age of automation and machine learning. Our goal is increase your relevancy and marketability, while making this a place that offers challenge, excitement, and insulation from industry changes (re: the accounting robots). If you decide to make Accountingprose your forever home (we hope you do!), your career path is yours to create.</p><p><strong>Your day-to-day tasks will include:</strong></p><ul><li>Reconciling bank, credit card, loan, merchant accounts in Xero</li><li>Posting one-time and repeating journal entries in Xero</li><li>Entering and paying bills via Bill.com</li><li>Entering receipts in ReceiptBank and syncing transactions to Xero</li><li>Entering invoices in Xero and setting up payment reminders</li><li>Processing and recording payroll via Gusto</li><li>Calculating, preparing, and remitting single and multi-state sales tax returns</li><li>Updating fixed asset schedules monthly (or when a client makes a big purchase)</li><li>Syncing software or manually pulling reports from: Mindbody, Vagaro, Clio, ActionStep, TradeGecko, Shopify, Shopkeep, Clover, Square, Stripe, Paypal, and many other SaaS apps.</li><li>Preparing and explaining month-end financial statements to small business owners and investors</li></ul><p>Work Hours- Any 8 hours plus a lunch from 7am to 7pm Mountain Time.&nbsp;<strong>You will set your schedule when you begin working for us.</strong></p><p><strong>Requirements</strong></p><ul><li>Complete understanding of full cycle accounting with 2-3 year of hands on experience. You know what is happening behind the scenes when you are posting transactions and you can explain challenging accounting concepts to a novice.</li><li>Intermediate software knowledge: Xero, QBO/QBD, Gusto, Hubspot, Teamwork, Slack, Box, ReceiptBank. Are some of these foreign? No worries! We provide in-depth training to build your skills.</li><li>Ability to multitask but more excited about deep work. You will be working with a handful of clients (15-25/mo depending on the scope of work) but should be excited to work with deep focus for long stretches of time without toggling back and forth.</li><li>A spreadsheet wizard, able to make sense of lots of information. Vlookups and pivot tables experience a plus.</li><li>Strong attention to detail and good analytical skills. Nothing slips past you!</li></ul><p><strong>Benefits</strong></p><ul><li>Unlimited paid vacation</li><li>Paid company holidays</li><li>Paid sick days</li><li>Health Insurance Reimbursement</li><li>Company-supplied computer, second monitor, and internet allowance</li><li>3% Simple IRA Salary Match</li><li><strong>Work from wherever you want- we are totally virtual (though we only hire people authorized to work in the US)</strong></li><li>Awesome people to work alongside of</li></ul>        </div><div>        <a href='https://accountingprose-hiring.workable.com/jobs/1036698' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ZFgnAkKBRJerPYxsAr7dhQ",
    "url": "http://workinstartups.com/job-board/job/85059/accountant-at-marshmallow/",
    "title": "Accountant",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Marshmallow",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 3,
      "maxValue": 3,
      "info": "",
      "unit": "MONTH",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 3 /Month"
    },
    "employmentType": "UNSET",
    "published": "Oct 1, 2019 12:22:28 PM",
    "validThrough": "Oct 8, 2019 12:22:28 PM",
    "crawled": "Oct 1, 2019 2:06:40 PM",
    "content": "<h2 class=&quot;section__header&quot;>DESCRIPTION</h2><br /><p>We're a VC-backed digital insurer. We use machine learning, automation, our own technology stack and comprehensive data integrations to be quicker, cheaper and fairer to customers. Where big insurers have agents, we have algorithms - a difference we are banking on creating one of the most influential financial services companies of this generation.</p><br /><p>We're a team of 35 with experience at the likes of Intercom, Monzo, Transferwise, Depop, backed by investors who have backed Spotify, Monzo, Adyen and others. Over the next 2 years we will grow the team to 150, as we expand our revenue product offering and geography - pushing further in to the multi-trillion $ insurance market.</p><br /><p>We are hiring a fully-qualified accountant to join our finance team.</p><br /><h3>WHAT YOU WILL BE DOING...</h3><br /><ul><br /><li>COLLABORATING WITH OUR HEAD OF FINANCE TO MAKE SURE THAT OUR BOOKS ARE IN ORDER</li><br /><li>WORKING WITH OUR SUPPORT TEAMS TO ENSURE PAYMENTS ARE RECEIVED, RECONCILED AND PROCESSED ON TIME</li><br /><li>WORKING AT THE INTERSECTION OF TECHNOLOGY TO AUTOMATE AS MUCH OF FINANCE AS POSSIBLE</li><br /><li>WORKING WITH OUR PARTNERS TO ENSURE SEAMLESS CASHFLOWS</li><br /><li>FOLLOW UP AND MAINTAINING RECONCILIATION DIFFERENCES</li><br /><li>MANAGING OVERDUE BALANCES</li><br /><li>CASH ALLOCATIONS AND ACCOUNT RECONCILIATIONS</li><br /><li>PREPARING MANAGEMENT REPORTING</li><br /></ul><br /><h3>YOU SHOULD APPLY IF...</h3><br /><ul><br /><li>YOU HAVE BEEN TRAINED AT A BIG FOUR ACCOUNTING FIRM</li><br /><li>THE WORK WE&rsquo;RE DOING SOUNDS EXCITING!</li><br /><li>YOU WANT TO CHANGE THE FACE OF INSURANCE</li><br /><li>YOU WANT TO EXPERIENCE A HIGH GROWTH ENVIRONMENT</li><br /><li>YOU LOVE NUMBERS AND EYE FOR DETAIL</li><br /><li>YOU HAVE AND/OR WANT DATABASE SKILLS AND WORKING WITH LARGE DATASETS</li><br /></ul><br /><h3>BENEFITS</h3><br /><ul><br /><li>COMPETITIVE SALARY&nbsp;</li><br /><li>STOCK OPTIONS&nbsp;</li><br /><li>WORKING FROM HOME&nbsp;</li><br /><li>MONTHLY SOCIALS&nbsp;</li><br /><li>32 DAY HOLIDAY ALLOWANCE (INC BANK HOLIDAYS)&nbsp;</li><br /><li>PENSION&nbsp;</li><br /><li>CYCLE TO WORK SCHEME&nbsp;</li><br /><li>UNLIMITED BOOKS&nbsp;</li><br /><li>EQUIPMENT YOU NEED TO GET THE JOB DONE&nbsp;</li><br /><li>WEEKLY KNOWLEDGE SHARING PRESENTATIONS&nbsp;</li><br /><li>FRIDAY ALL-HANDS WITH SNACKS&nbsp;</li><br /><li>LEARNING AND TRAINING SUPPORTED&nbsp;</li><br /><li>FRUIT, SNACKS AND SOFT DRINKS IN THE OFFICE&nbsp;</li><br /><li>HEALTH INSURANCE&nbsp;</li><br /></ul><br /><h3>LOGISTICS</h3><br /><ul><br /><li>OUR PROCESS CONSISTS OF A PHONE INTERVIEW, A FEW HOURS ONSITE.</li><br /><li>WE HAVE A LOT OF CANDIDATES FOR ALL POSITIONS SO PLEASE BE PATIENT RE. A RESPONSE TO YOUR APPLICATION - WE'RE MOVING AS QUICKLY AS WE CAN :)</li><br /></ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Z78eKT0rToWyFF_ui-xDMw",
    "url": "https://remote.co/job/bookkeeping-team-captain/",
    "title": "Bookkeeping Team Captain",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "MuseMinded",
      "sameAs": "https://museminded.com/"
    },
    "salary": {
      "currency": "USD",
      "minValue": 20,
      "maxValue": 25,
      "info": "",
      "unit": "HOUR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 20 - 25 /Hour"
    },
    "employmentType": "UNSET",
    "published": "Sep 30, 2019 2:45:23 PM",
    "validThrough": "Oct 7, 2019 2:45:23 PM",
    "crawled": "Sep 30, 2019 3:07:25 PM",
    "content": "<h3>Bookkeeping Team Captain at <span>MuseMinded</span></h3><div><span><i></i> Remote</span>        </div><div>            <p><strong>REMOTE – FULL TIME</strong></p><p><strong>VISION</strong></p><p>The mission of MuseMinded (http://museminded.com/about-story/) is to help automate (as much as currently possible) the bookkeeping process for Amazon sellers and more than that: we want to help them turn accounting into a strategic strength for their business, not just an afterthought to file taxes.</p><p>We already have a great virtual team and company, and we’re looking for an experienced bookkeeper with great leadership qualities to come be a co-captain for our bookkeeping operations.</p><p>Day to day tasks will include setting up accounting systems for new clients, completing our monthly bookkeeping process for ongoing clients, and most importantly interfacing with clients on email, phone, and video calls.</p><p><strong>REQUIREMENTS</strong></p><p>During the interview process, we will test to ensure you have a good understanding of basic accounting principles, but by far the most important requirement for us is the type of person you are. To thrive in our work culture, these are the non-negotiable traits each team member must exhibit:</p><ul><li><strong>SERVICE-ORIENTED</strong>&nbsp;You can communicate in a professional way with clients, but more importantly you genuinely care about people and want good things to come their way.</li><li><strong>RELIABLE</strong>&nbsp;You are the most reliable person that you know. You follow through on commitment without fail.</li><li><strong>GROWTH-MINDED</strong>&nbsp;You are always learning, reading books, and making small or big adjustments to improve your life.</li><li><strong>TAKES INITIATIVE</strong>&nbsp;When you see something is broker or out of place, you go out of your way to make fix it. You don’t necessarily need someone to tell you what to do and when. You find things that need done and do them.</li><li><strong>TECH SAVVY</strong>&nbsp;Working with a computer is second nature to you. You pick up new apps and technologies effortlessly.</li></ul><p><strong>Experience with the following is also highly valued</strong>:</p><ul><li>Xero accounting system</li><li>Google Apps (Docs &amp; particularly Google Sheets)</li><li>Slack</li><li><strong>Working in a virtual environment</strong></li></ul><p><strong>OFFER</strong></p><p><strong>This position is full time, averaging between 30 to 40 hours per week.</strong>&nbsp;<strong>You will set your own schedule</strong>, but we expect that you will be available during large parts of our normal working hours (9 – 5 pm ET).</p><p>The starting pay rate will be based on experience, with an expected range between $20 – $25 per hour (salaried at 40 hours per week).</p><p>For the full list of benefits please view the job overview video at the beginning of our online interview process.</p><p><strong>NOTE: This is a position for someone looking to become a long-term member of our team.</strong></p>        </div><div>        <a href='https://museminded.vervoe.net/job-page/worlds-greatest-bookkeeper/1566507971' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "JXw0upfxTwSQXWis-8N38A",
    "url": "http://workinstartups.com/job-board/job/84977/finance-assistant-at-mysense/",
    "title": "Finance Assistant",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=2, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "MySense",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "GBP",
      "minValue": 25000,
      "maxValue": 28000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "GBP 25k - 28k /Year"
    },
    "employmentType": "UNSET",
    "published": "Sep 30, 2019 10:02:30 AM",
    "validThrough": "Oct 7, 2019 10:02:30 AM",
    "crawled": "Sep 30, 2019 11:06:40 AM",
    "content": "<p><strong>Finance Assistant</strong></p><br /><p><br /><br /></p><br /><p>Do you want to join an exciting start-up in the IoT health space? Do you like supporting devices, software, and apps? Do you dream about real-world experience supporting large-scale applications connecting people and devices together using a variety of technologies? Are you motivated by working in a fast-paced dynamic environment? We have an exciting opportunity for a Finance Assistant to join our rapidly growing team.</p><br /><p><br /><br /></p><br /><p><strong>Salary &pound;25K - &pound;28K</strong></p><br /><p><br /><br /></p><br /><p><strong>Responsibilities:</strong></p><br /><ul><br /><li>Ensuring all transactions relating to sales and purchase ledgers are properly recorded in the finance system in accordance with due process</li><br /><li>Ensuring all expense claims are processed and paid in a timely manner and managing the purchase order process following the authorisation matrix</li><br /><li>Liaising with the Front of House to replenish office consumables, and managing all online purchase platforms</li><br /><li>Carrying out regular bank reconciliations and control accounts/ledger accounts reconciliations</li><br /><li>Reconciling customer/supplier statements and ensuring that unreconciled items are followed up</li><br /><li>Preparing and producing monthly payroll using the finance system according to deadline and company procedures</li><br /><li>Logging starters and leavers onto the payroll software, and ensuring all new starters have completed their onboarding process</li><br /><li>Managing employee monthly pension payments and other benefits</li><br /><li>Assisting in the reconciliation and preparation of quarterly VAT returns and any other regulatory returns</li><br /><li>Dealing with pension contributions and paying the pension provider in a timely manner</li><br /><li>Accurately inputting information on starters and leavers and reconciling with the finance system</li><br /><li>Providing assistance with HR administration; supporting the recruitment and induction processes</li><br /><li>Carrying out ad hoc duties as required</li><br /></ul><br /><p><br /><br /></p><br /><p><strong>Skills and Experience:</strong></p><br /><ul><br /><li>Experience as an Accounts Assistant or a similar role</li><br /><li>Previous payroll and HR administration experience essential</li><br /><li>Understanding the sensitivity of the role and the need for respect towards it</li><br /><li>AAT qualified or studying towards achieving an accounting qualification</li><br /><li>Attention to detail</li><br /><li>Excellent organisational skills</li><br /><li>Excellent telephone manner</li><br /><li>Excellent time management</li><br /><li>Good IT skills</li><br /><li>Ability to work autonomously</li><br /><li>A team player</li><br /></ul><br /><p><br /><br /></p><br /><p><strong>Culture and Personality:</strong></p><br /><ul><br /><li>Willing to work hard but also have fun</li><br /><li>Good sense of humour</li><br /><li>Entrepreneurial spirit</li><br /><li>Innovative and open-minded</li><br /><li>Tenacious problem-solver</li><br /><li>Proactive self-starter</li><br /><li>Able to work as part of a wider team</li><br /><li>An appetite for learning</li><br /><li>A passion for technology of all types</li><br /></ul><br /><ul><br /><li>An interest in health and wellbeing</li><br /><li>Enjoys a social office atmosphere</li><br /><li>An appetite to achieve great things and to help many vulnerable people remain independent in their own homes</li><br /></ul><br /><p><br /><br /></p><br /><p><strong>Benefits:</strong></p><br /><ul><br /><li>30 days holiday + your birthday + Public Holidays</li><br /><li>Fruits, Coffee, Tea and breakfast all are in office</li><br /><li>Remote working possible</li><br /><li>Private Health Insurance</li><br /><li>Life Insurance</li><br /><li>Pension scheme</li><br /><li>Office dog (hypoallergenic)</li><br /><li>Relaxed start-up environment - your input matters</li><br /><li>Company laptop</li><br /></ul><br /><p><br /><br /></p><br /><p><strong>About MySense</strong></p><br /><p>MySense is a wellbeing analytics platform built on compassion, by people who understand what it&rsquo;s like to care for a loved one. But we&rsquo;re also a team of dedicated (self-proclaimed) nerds, tech is what we know and love. So, we have combined these two drives and created a product we can be proud of.</p><br /><p>The idea is that peace of mind about a loved one&rsquo;s wellbeing should be at people&rsquo;s fingertips no matter who or where they are. To do this, we created a wearable device and 11 sensors that can be placed around someone&rsquo;s home. Each sensor picks up information about a key activity. This means looking at drinking and eating habits, toilet usage, sleep patterns and heart rate (approximately 5,000 data points). These sensors collect data that our AI then analyses for any patterns of decline in wellbeing. When we start to notice that something isn&rsquo;t looking ideal, we send caregivers notifications so they can address problems before they escalate.</p><br /><p>&nbsp;</p><br /><p>Check us out:</p><br /><p><a href='https://www.mysense.ai/'>https://www.mysense.ai</a></p><br /><p><a href='https://www.linkedin.com/company/mysense'>https://www.linkedin.com/company/mysense</a></p><br /><p>&nbsp;</p><br /><p>We are an equal opportunities employer and welcome applications from all suitably qualified persons regardless of their race, sex, disability, religion/belief, sexual orientation or age.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "9Ou8FtcxTIGv_XFR93gBOA",
    "url": "https://weworkremotely.com/remote-jobs/keasler-cpa-pllc-remote-flexible-staff-accountant-bookkeeper-25-30-hours-per-week",
    "title": "Keasler CPA, PLLC: Remote/Flexible Staff Accountant/Bookkeeper - 25-30 Hours Per Week",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Keasler CPA, PLLC",
      "sameAs": "http://keaslercpa.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 27, 2019 2:50:25 PM",
    "validThrough": "Oct 4, 2019 2:50:25 PM",
    "crawled": "Sep 27, 2019 3:06:29 PM",
    "content": "<h3> Remote/Flexible Staff Accountant/Bookkeeper - 25-30 Hours Per Week </h3><div><div>&nbsp;<strong>Remote/Flexible Staff Accountant</strong>&nbsp;<br><br><br></div><div><em>Through our Virtual Back Office platform, we work alongside our small business clients to efficiently manage their tax, accounting, payroll, and strategic planning needs.</em>&nbsp;<br><br><br></div><div><em>Our team is technologically savvy, works remotely, and maintains their own work schedule. Our internal systems and processes allow us to clearly gauge progress, performance, and expectations, so adherence to traditional daily or weekly work schedule isn’t necessary.</em>&nbsp;<br><br><br></div><div><em>The staff accountant will act as the manager of a group Virtual Back Office clients, and have responsibility for tax return preparation for a modest number of our traditional, or non-Virtual Back Office, clients during tax season. Our business growth is focused solely on our Virtual Back Office platform, and we have significantly reduced our overall traditional tax return preparation in recent years, which has resulted in an increasingly manageable tax seasons – working to have a manageable tax season and minimizing workload compression is a top priority for our firm.</em>&nbsp;<br><br><br></div><div><strong>Responsibilities for Remote/Flexible Accountant:</strong>&nbsp;</div><ul><li>Act as main point of contact and manager for 10-20 Virtual Back Office clients, including tasks such as:&nbsp;<ul><li>Maintaining accounting/bookkeeping in QBO&nbsp;</li><li>Designing and optimizing client’s accounting workflows in QBO&nbsp;</li><li>Assisting client with technology and QBO app selection&nbsp;</li><li>Assistance with client’s administration of payroll system&nbsp;</li><li>Preparation of sales and use tax returns&nbsp;</li><li>Preparation of related corporate, partnership, and owners’ individual tax returns.&nbsp;</li><li>Some clients engage us to handle AR, AP, and payroll administration (running their payroll for them)&nbsp;</li><li>Development and maintenance of client dashboarding &amp; key performance indicator system&nbsp;</li><li>Assist partner in tax &amp; business planning process.&nbsp;</li><li>The Staff Accountant is truly overseeing the client’s entire tax, accounting, and payroll function.&nbsp;</li></ul></li><li>In addition to managing the Virtual Back Office clients, this position would be responsible for a set of traditional, non-Virtual Back Office 1040, 1120S, &amp; 1065 tax return preparation clients, that occasionally need assistance with tax questions or other minor requests outside of tax season. These returns range from fairly simple to moderate complexity. We have actively culled our tax return-only clients, as our Virtual Back Office business has grown, and the remaining tax return-only clients are highly organized, have strong realization/fees, are well trained on our processes, only communicate electronically, &amp; upload all tax documents to ShareFile.</li></ul><div><strong>Requirements &amp; Preferred Experience &amp; Qualifications</strong>&nbsp;</div><ul><li>Required Experience &amp; Qualifications</li><li>2-5 years of experience in a small regional or local accounting firm</li><li>Preparation of simple to moderately complex individual returns, S-corp returns, and simple partnership returns</li><li>Experience in small business accounting &amp; bookkeeping</li><li>Sales tax return preparation</li><li>Required software experience:&nbsp;<ul><li>Quickbooks, and specifically QBO&nbsp;</li><li>UltraTax&nbsp;</li><li>Microsoft Office Suite&nbsp;</li></ul></li><li>Demonstrated experience of managing multiple clients</li><li>Demonstrated experience of advising clients&nbsp;</li><li>Excellent written and verbal communication skills</li><li>Ability to work in a remote team by comfortably using communication tools such as Slack and GoToMeeting to connect with other team members.</li><li>Demonstrated ability to prioritize &amp; maintain your own schedule, while meeting firm and client expectations. We have weekly hour targets, but your schedule is created completely by you.</li><li>Strong analytical skills – ability to see the big picture &amp; how things interrelate within the clients’ accounting, as well as within their business overall.</li><li>Dedicated, secure work space in your home large enough for a multiple monitor set-up.</li><li>Preferred Experience &amp; Qualifications&nbsp;<ul><li>CPA or EA&nbsp;</li><li>Bachelor’s degree in accounting or finance&nbsp;</li><li>eCommerce experience&nbsp;</li><li>Real estate partnership experience&nbsp;</li><li>Multi-state experience&nbsp;</li><li>Preferred software experience:&nbsp;</li><li>Thomson Reuters Creative Solutions suite: UltraTax, Practice CS, FileCabinet CS&nbsp;</li><li>Shopify&nbsp;</li><li>Fathom&nbsp;</li><li>Reach Reporting&nbsp;</li><li>Xero&nbsp;</li><li>Slack&nbsp;</li><li>GoToMeeting&nbsp;</li><li>ShareFile&nbsp;</li></ul></li></ul><div><strong>Benefits:</strong>&nbsp;</div><ul><li>Work from anywhere</li><li>Design and manage your own schedule - we have weekly hour expectations, but your schedule is created and managed completely by you</li><li>Competitive compensation &amp; potential for benefits</li><li>Performance/production bonuses</li><li>401(k) with no waiting period for match, and potential profit sharing contribution</li></ul></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "iTSgEYLbScOTkwTUzO05Qw",
    "url": "https://jobspresso.co/job/select-source-intl-anywhere-in-north-america-and-canada-support-various-accounting-assistant/",
    "title": "Accounting Assistant",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Select Source Intl",
      "sameAs": "http://www.selectsourceintl.com"
    },
    "salary": {
      "currency": "USD",
      "minValue": 40,
      "maxValue": 40,
      "info": "",
      "unit": "HOUR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "USD 40 /Hour"
    },
    "employmentType": "UNSET",
    "published": "Sep 26, 2019 4:29:09 PM",
    "validThrough": "Oct 3, 2019 4:29:09 PM",
    "crawled": "Sep 26, 2019 5:07:36 PM",
    "content": "<h3> Accounting Assistant</h3><div>Various<br></div><div>US or Canada<br></div><div>Hourly Rate: $40<br></div><div>Company: Select Source Intl<br></div><div>ContractFull TimePart Time<br></div><h4>Overview</h4><p></p><strong>About Us:</strong><p>Select Source International, is an award-winning company providing Consulting &amp; Staff Augmentation Services across the Globe in Information Technology, Health Care, Finance &amp; Accounting, Engineering &amp; Human Resources.&nbsp; We are a Minority Business Enterprise (MBE) certified consulting firm headquartered in Minneapolis, MN.</p><p>We provide our customers with permanent placement, Statement of Work (SOW) and staff augmentation services. We work with major corporations and are also a System for Award Management (SAM) and ISO 9001 &amp; 14001 certified company.</p><p>SSI offers an extensive database of readily available, quality candidates. We are a Process driven organization utilizing cutting edge tools to streamline processes with state of the art technologies such as; Oracle’s Taleo for Applicant tracking, Jobma for video Interviewing and resumes, Salesforce for Sales Intelligence, and Jobdiva for onboarding.</p><p>SSI strives to take customer service to a new level by the way in which we interact with both our Clients and Consultants.</p><p></p><strong>About this Role:</strong><p>As the Accounting Assistant, you will assist and perform necessary tasks to ensure the accuracy of the company’s accounting records including but not limited to responsibility of daily deposits for multiple business lines, managing AP process &amp; AR related reporting and records management.</p><p></p><strong>Knowledge, Skills, and Abilities:</strong><ul></ul><li>Basic accounting practices and procedures</li><li>Invoicing procedures</li><li>Basic accounts payable and/or accounts receivable practices and procedures</li><li>Basic computer applications and computerized accounting systems</li><li>Cash handing policies and procedures</li><li>Meet deadlines</li><li>Ability to problem solve and determine best course of action</li><li>Work as a team member and foster a cooperative work environment</li><p></p><strong>Job Type: Full-time, Partime</strong><p></p><strong>Work Location: Remote</strong><p>At Select Source Intl, we believe that diversity of experience and thought makes us stronger. We encourage applicants across any race, ethnicity, gender/gender expression, age, religion, ability and experience. With both customers and employees around the world, we are committed to ensuring our team reflects the unique communities around us. We can’t wait to meet you.</p><div> <div><p> <br><br> <b>To apply for this job please send your job application to the email below.</b> <br><br>Please reference <b>Jobspresso</b> in your application, so that remote companies know where their best candidates are coming from  <br><br> <a href='mailto:adrieneh@selectsourceintl.org?subject=Job application via Jobspresso' rel='nofollow'>adrieneh@selectsourceintl.org</a></p></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "dA8eaRr_Sxa4E7ky6yEGaw",
    "url": "https://remote.co/job/accounts-receivable-associate-real-estate-collections/",
    "title": "Accounts Receivable Associate – Real Estate Collections",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "eXp Realty",
      "sameAs": "https://www.exprealty.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 23, 2019 2:43:07 PM",
    "validThrough": "Sep 30, 2019 2:43:07 PM",
    "crawled": "Sep 23, 2019 3:07:24 PM",
    "content": "<h3>Accounts Receivable Associate – Real Estate Collections at <span>eXp Realty</span></h3><div><span><i></i> Remote</span>        </div><div>            <p><strong>Location: United States</strong></p><p>eXp Realty is one of the fastest growing real estate brands in North America, with thousands of agents operating across the United States and Canada.</p><p>eXp Realty attracts the most talented people from all fields. Whether you’re a real estate professional, engineer, marketer, accountant or another field, you’ll be challenged and inspired every day. Join us on this incredible journey!</p><p><strong>General Summary: </strong></p><p>The Accounts Receivable Associate Real Estate Collection s primary responsibility is to increase the collections effort of outstanding Real Estate Receivables.</p><p><strong>Major Functions:</strong></p><ul><li>Working from self-prepared or provided AR information, research open balances and contact Title Companies and Law Firms for payment of outstanding amounts.</li><li>Document all discussions and interactions within Intacct accounting system.</li><li>Research all differences in cash received compared to outstanding A/R amounts and work with Accounting team to make proper accounting entries to reconcile.</li><li>Advise Accounting staff on write offs where appropriate.</li><li>Monitor and reply to relevant issues in Zoho A/R ticketing channel.</li><li>Confident and professional phone skills to collect past due amounts.</li><li>Ability to keep all interactions professional, positive and quickly to the point.</li><li>Ability and willingness to escalate past due items to the appropriate Manager for resolution.</li><li>Daily reporting of efforts and results.</li></ul><p><strong>Education: </strong></p><ul><li>BA/BS in accounting or finance preferred</li><li><strong>High School Diploma/GED required.</strong></li></ul><p><strong>Experience: </strong></p><ul><li>2+ years of experience in accounts receivable and collections</li><li>Strong knowledge of Microsoft Office applications; especially Excel.</li><li>Experience with Google Suite strongly preferred</li><li>Ability to learn new technology easily required.</li><li>Excellent customer service and communication skills required</li></ul>        </div><div>        <a href='https://jobs.lever.co/exp/5530e680-a3fd-4188-9caa-bdb29bbc429b' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "RyYVM5s1R0aotlWkjGyyOg",
    "url": "https://remote.co/job/financial-software-product-manager/",
    "title": "Financial Software Product Manager",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Deltek Inc.",
      "sameAs": "https://www.deltek.com:443/en/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 20, 2019 6:06:48 PM",
    "validThrough": "Sep 27, 2019 6:06:48 PM",
    "crawled": "Sep 20, 2019 6:24:12 PM",
    "content": "<h3>Financial Software Product Manager at <span>Deltek Inc.</span></h3><div><span><i></i> Remote</span>        </div><div>            <p>US HDQ-Herndon, VA,&nbsp;<strong>US HDQ-Remote, US Midwest-Remote,&nbsp;</strong>US Portland, OR,&nbsp;<strong>US Remote,&nbsp;</strong>US Woburn, MA,&nbsp;<strong>US Woburn-Remote</strong></p><p>5284BR</p><p><strong>Position Responsibilities</strong></p><p>We are seeking a bright, collaborative and driven individual to join our growing global Product Management Team, with a particular focus on architecture, engineering and consulting focused ERP product: Vantagepoint/Vision.</p><p>Do you have a passion for accounting and financials and a thirst for software product innovation? You will join a team who combined have many years of experience with both the Vantagepoint/ Vision product and the architecture, engineering and consulting industries. This team is looking to invest in someone who wants to embark on a journey into strategic product management. You’ll get involved in understanding client requirements, work closely with engineering team to translate those requirements into product features and be at the forefront of innovation and learn from the very best in the market, as we aggressively drive our product and technology roadmaps forward to continue to provide a world-class solution for organizations within the agency and market.</p><p>You must have proven financial accounting ERP experience, using Vantagepoint/Vision or a similar ERP system and have a huge thirst for personal and professional growth. Not for the faint-hearted, this will be a fast-paced and at times, intense role, involving working with internal product experts globally with multiple demands, where you’ll be expected to use your financial accounting experience to bring value to this challenge. Above all, you must love what you do! Below are some of the key responsibilities of this role through the lifecycle of managing requirements from inception to product release:</p><ul><li>Create and own product requirements; establishing a business case for overall need and prioritization</li><li>Perform detailed requirement specifications for new enhancements; particularly related to the accounting, finance, tax, global compliance and multi-company/multi-currency functionality</li><li>Conduct competitive analysis in order to understand the key trends in the industries served by the Vantagepoint/Vision product</li><li>Work with key stakeholders across the organisation to define and prioritize requirements for new features and enhancements</li><li>Assist in defining and managing incremental release plans related to product area ownership, to achieve overall roadmap vision</li><li>Work with our Engineering teams to transform requirements into compelling product enhancements</li><li>Working with our Product Marketing teams to enable the Sales and Service teams to maximize the impact of product enhancements</li><li>Actively participate in product launch to gauge user adoption</li><li>Assist our customer care organization with product questions pertaining to the accounting and finance areas of the product</li><li>Support our sales and account management teams with prospect development and pursuits</li><li>Deliver presentations and training to internal groups and external customers as a part of release readiness, user groups and corporate conferences</li></ul><p>Qualifications</p><p>To be successful in this role, we expect you will have at least 5 years’ experience with accounting systems working at an ERP/financial systems software vendor or as a practitioner working in an organization using a relevant ERP solution and the ability to demonstrate the following:</p><ul><li>Knowledge of architecture, engineering and consulting organizations; market trends, operations and business drivers</li><li>In-depth knowledge of core back-office processes, global statutory and tax requirements and related financial reporting requirements</li><li>Experience working in a finance role</li><li>Experience operating under minimal supervision, with wide latitude for independent judgment</li><li>Commercially minded and proven success of building strong working relationships with cross functional teams</li><li>Exceptional written and oral communication skills, including the ability to communicate clearly with both business and technical stakeholders’ one on one, and in groups of varying size</li><li>Ability to formulate and present a convincing business case and product roadmap to executive management</li><li>Experience managing the complete product development lifecycle would be a plus</li><li>Experience leading user focus groups to elicit requirements and formulate use cases</li></ul><p>We’d really like a self-starter that can produce results with minimal direction but yet a team player who is able to quickly develop internal relationships.</p><p>If this sounds like you, we’d love to hear from you!</p><p><strong>Company Summary</strong></p><p>Better software means better projects. Deltek is the leading global provider of enterprise software and information solutions for professional services, management and IT consulting, architecture and engineering, marketing and advertising agencies, government contractors and other project-based businesses. More than 23,000 organizations and millions of users in over 80 countries around the world rely on Deltek for superior levels of project intelligence, management and collaboration to research and identify opportunities, win new business, recruit and develop talent, optimize resources and streamline operations. Our industry-focused expertise powers project success by helping firms achieve performance that maximizes productivity and revenue.</p>        </div><div>        <a href='https://sjobs.brassring.com/TGnewUI/Search/Home/Home?partnerid=25397&amp;siteid=5259#jobDetails=463181_5259' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "4SEkWhbvQx6MXxs-OpEy-w",
    "url": "https://berlinstartupjobs.com/finance/senior-accountant-your-superfoods/",
    "title": "Senior Accountant // Your Superfoods",
    "tags": [
      "DBG:surround``2N(remot,work) 3W OR(encourag, avail, environ)",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Your Superfoods",
      "sameAs": "https://yoursuper.com/pages/super-careers"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 19, 2019 4:21:33 PM",
    "validThrough": "Sep 26, 2019 4:21:33 PM",
    "crawled": "Sep 19, 2019 5:07:53 PM",
    "content": "<h3>Senior Accountant // Your Superfoods</h3><div> Company:  Your Superfoods <br> <br></div><div> Tags:</div><li>HGB</li><li>VAT Accounting</li><div>  <div>     </div>  <div>  <strong>WE ARE YOUR SUPER&nbsp;</strong> </div>  <div></div>  <div>  We are a fun and fast-moving start-up based improving people’s life with the power of (super) plants. </div>  <div></div>  <div>  After closing our US Series A financing round we are looking to further scale. You have the chance to join the founding team early and become a crucial part of our success </div>  <div>  story. </div>  <div></div>  <div>  We are looking for a Senior Accountant to join our amazing team! You will lead our global accounting efforts in Berlin while partnering up with our US team. Your role will be important in the growth of our company in keeping ethical finance practices. </div>  <div></div>  <div></div>  <div>  <strong>RESPONSIBILITIES</strong> </div>  <ul>   <li>Preparation of monthly and annual financial statements according to the German Commercial Code (HGB)</li>   <li>Carry out bookings in the day-to-day operating business of our Berlin company, including Accounts Payables and inventory reconciliations</li>   <li>Preparation of national and international advance VAT returns</li>   <li>Generate reports and ad-hoc analyses to support the management</li>   <li>Evaluate special accounting topics and represent accounting in cross-divisional projects</li>   <li>Work with auditors, accountants and other external third parties</li>  </ul>  <div>  <strong>WHAT ARE WE LOOKING FOR</strong> </div>  <ul>   <li>Bachelor/Master Degree in Finance or Accounting</li>   <li>At least 5 years of working experience in accounting in Germany</li>   <li>Knowledge of German tax and local statutory requirements</li>   <li>Fluency in English and German, written and verbal</li>   <li>Big 4 experience</li>   <li>Professional Finance qualification, preferably CA, CPA, ACA, ACCA is a plus</li>  </ul>  <div>  <strong>WHY YOUR SUPER&nbsp;</strong> </div>  <ul>   <li>Company culture that can’t be beat, we love what we do and we are all on a mission to improve people’s health</li>   <li>We walk the walk! Health / wellness initiatives and perks</li>   <li>Free Superfoods</li>   <li>An awesome opportunity to help change the world with the power of plants</li>   <li>Flexible schedule and remote work opportunities available within the calendar year</li>  </ul> </div><a href='https://hire.withgoogle.com/public/jobs/yoursupercom/view/P_AAAAAAGAABDNcJ4uAZby3o' rel='nofollow'>Apply for this position</a>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "_4gbw2LiRT2AuI5rvf16Sg",
    "url": "https://remote.co/job/finance-editor-4/",
    "title": "Finance Editor",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "SmartBrief",
      "sameAs": "https://www.smartbrief.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 18, 2019 4:15:59 PM",
    "validThrough": "Sep 25, 2019 4:15:59 PM",
    "crawled": "Sep 18, 2019 5:07:30 PM",
    "content": "<h3>Finance Editor at <span>SmartBrief</span></h3><div><span><i></i> Remote</span>        </div><div>            <p>Category</p><p>Journalism and Editing</p><p><strong>Job Location</strong></p><p><strong>Anywhere USA</strong></p><p>Tracking Code</p><p>475-897</p><p><strong>Position Type</strong></p><p><strong>Full-Time/Regular</strong></p><p>SmartBrief is seeking a full-time editor for its Washington, D.C., office who will help create daily email newsletters for a range of association and corporate partners in D.C. and nationwide. Topics covered will include the financial advisory industry and investing.</p><p>SmartBrief is seeking highly experienced applicants, but will give serious consideration to applicants with strong enthusiasm for covering industry events featuring high-profile industry executives and regulators. Experience or interest in a variety of media formats including social media, video and podcasting a plus.</p><p>Selected applicants will be asked to complete a timed writing and editing test.</p><p><strong>Job Duties:</strong></p><ul><li>Identify and prioritize the most important stories of the day in the financial services industry.</li><li>Write and edit summaries for inclusion in SmartBrief’s finance newsletters.</li><li>Use online publishing tools to create email newsletters and content such as Q&amp;A interviews, event coverage, blog posts and special reports.</li><li>Manage relationships with associations, corporations and other business clients as well as content providers.</li></ul><p><strong>Required Skills &amp; Experience:</strong></p><ul><li>Three to five years of experience in a communications or research role with a news organization, consulting firm, trade association or other relevant group.</li><li>A passion for helping readers stay in-the-know about the latest financial services trends.</li><li>Proven track record of writing and editing accurately on tight deadlines.</li><li>The ability to multi-task is a MUST.</li><li>Facility for using online publishing tools.</li><li>Strong interpersonal and communications skills.</li><li>A keen interest in the rapidly changing world of media and information.</li></ul>        </div><div>        <a href='https://jobs.silkroad.com/SmartBrief/SmartBriefExternalPortalsmartbriefcareerssilkroadc/Jobs/JobDetail?jobId=475' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "XqgtFVWQRlKDIMk2SzfPDw",
    "url": "https://weworkremotely.com/remote-jobs/modern-tribe-bookkeeping-assistant-1",
    "title": "Modern Tribe: Bookkeeping Assistant",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Modern Tribe",
      "sameAs": "https://modern-tribe.breezy.hr/p/2eaf4373001c-bookkeeping-assistant?source=weworkremotely"
    },
    "salary": {
      "currency": "USD",
      "minValue": 20,
      "maxValue": 30,
      "info": "",
      "unit": "HOUR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 20 - 30 /Hour"
    },
    "employmentType": "UNSET",
    "published": "Sep 17, 2019 10:50:50 PM",
    "validThrough": "Sep 24, 2019 10:50:50 PM",
    "crawled": "Sep 17, 2019 11:30:23 PM",
    "content": "<h3> Bookkeeping Assistant </h3><div><div><br>The Opportunity<br><br></div><div>The Bookkeeping Assistant role at Modern Tribe is a champion for the Ops and Finance teams. This role helps to drive Ops/Finance projects forward, both the cyclical monthly efforts as well as entirely new projects.  If you thrive on being helpful and supporting a growing team by resolving and investigating team member inquiries, assisting in coordinating company-wide activities, and preparing AR/AP this gig might be for you. </div><div><br>Responsibilities<br><br></div><ul><li>Assist in the day-to-day activities of the ops team to assure efficient and effective organizational activities</li><li>Provide support to Modern Tribe’s Bookkeeper</li><li>Support ops/finance in resolving or investigating team member inquiries</li><li>Identify areas of inefficiency within the Ops and finance team and collaborate to improve</li></ul><div><br></div><div><br>Personal Competencies<br><br></div><ul><li>Strong communication skills</li><li>Experience working as part of a remote team</li><li>Self-motivated, detail-oriented</li><li>Strong organizational skills</li><li>A methodical approach to all tasks</li><li>Ability to prioritize workloads and meet deadlines</li><li>Fluent English speaker</li></ul><div><br>Knowledge &amp; Experience<br><br></div><ul><li>1-3 years of experience within an Agency environment or in-house ops team</li><li>Knowledge of remote office procedures and workflows</li><li>Experience exercising discretion and confidentiality with sensitive company information</li><li>Excellent organizational skills with an ability to think proactively and prioritize work</li><li>Experience working on a small team and wearing a variety of hats to solve problems as needed</li><li>2-3 years experience accounting or bookkeeping experience in a high growth environment</li><li>&nbsp;Proven experience with Quickbooks Online is required</li><li>Proficient with Slack, Dropbox, Google Drive, Google Docs etc, Google Hangouts etc</li></ul><div><br>Bonus Points<br><br></div><ul><li>&nbsp; Experience with expense management tools such as Expensify&nbsp;</li></ul><div><br>Location<br><br></div><div>Work from anywhere in North, Central or South America. If your timezone is outside of US business hours but you work at least 4+ hours of overlap each day, with some of that time overlapping with PST, let's chat. You must be fluent in English. You just need a computer and a strong wifi signal to support daily video chats with the Tribe.</div><div><br></div><div><br>Compensation<br><br></div><div>Pay range is between $20-$30 US per hour commensurate with qualifications and experience. This is a freelance contract role about 15-20 hours a week.</div><div><br></div><div><br>Inclusion Statment<br><br></div><div>Modern Tribe is committed to a culture that embraces diversity and inclusion. We foster an environment of collaboration, open engagement, fairness and respect regardless of differences in age, race, disability, national origin, gender identity, religion, sexual orientation or veteran status. As a hybrid workspace ranging from distributed contractors to traditional employees, we value the unique perspectives and experiences of our global team.</div><div><br></div><div>We come from all walks of life. We are small business owners. We are tattoo aficionados and 80’s movie buffs and ex-pats. We are homeschool teachers. We are single parents. We are musicians, college drop-outs, and entrepreneurs. We are travelers, feminists, runners, volunteers, and makers. We are a Modern Tribe.</div><div><br></div><div>Everyday we strive to fulfill our motto: live well and do good work. We hope you will consider joining us.</div><div><br></div><div><br>Perks<br><br></div><div>We believe that distributed working is a way of life. We understand what it means to work remotely. We offer consistency in expectations, payment, and support. We believe in learning from each other and fostering personal growth. You can expect to learn a lot while working with us.</div><div><br></div><div>(Also, if you work enough with us, we’ll bring you on the <a href='https://tri.be/team-trip-2019/' rel='nofollow'>team trips</a>.)</div><div><br></div><div><br>Who We Are<br><br></div><div>Modern Tribe, Inc. is a rapidly growing software &amp; design company. We develop custom solutions for some of the world’s largest companies, government institutions and smaller growing organizations. We pride ourselves on our ability to bridge people and technology and to bring the passion and dedication of an entrepreneur to every project. Our team is composed of talented employees and freelancers around North &amp; South America (and a smattering across the globe).</div><div><br></div><div><br>Who You Are<br><br></div><div>We love working with each other because we have built a culture that suits us well. We work primarily with freelancers and coordinate their talents for large projects. To be on our team, you must be:</div><div><br></div><ul><li>HAPPY: Where there is a will, there is a way. Having a positive disposition allows us to achieve great things and to support each other.</li><li>HELPFUL: Always looking for ways that you can help others.</li><li>CURIOUS: It is essential that you have a passion for learning. Technology changes daily, and life has a way of constantly raising the bar.</li><li>ACCOUNTABLE: Our clients expect us to get the right thing done on budget and on time. Communicating expectations and meeting them is the cornerstone of success.</li><li>A FREELANCER</li></ul></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "VritdfYgQLCOqzU1v6ahvQ",
    "url": "http://workinstartups.com/job-board/job/84457/alternative-finance-analyst-intern-at-allied-crowds-ltd/",
    "title": "Alternative Finance Analyst Intern",
    "tags": [
      "DBG:surround``2N(remot,work) 3W OR(encourag, avail, environ)",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=16, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Allied Crowds Ltd",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 16, 2019 3:21:32 PM",
    "validThrough": "Sep 23, 2019 3:21:32 PM",
    "crawled": "Sep 16, 2019 5:06:48 PM",
    "content": "<div id=&quot;comp-jxg80lhm&quot; class=&quot;txtNew&quot; data-packed=&quot;true&quot;><br /><p class=&quot;font_8&quot;><span class=&quot;color_15&quot;>AlliedCrowds has a unique mission: to combine technology, data, and finance in order to disrupt development. We do this by creating innovative products and new financing models that unlock capital for entrepreneurs in emerging markets, enabling them to grow their businesses, hire new employees, and contribute to the global economy. Since its founding, AlliedCrowds has consulted for some of the world&rsquo;s largest development finance institutions, multilateral aid agencies, and private companies involved in development, including UNDP, GIZ, IFC, IsDB, and others.</span></p><br /></div><br /><div id=&quot;comp-jxg80yhm&quot; class=&quot;txtNew&quot; data-packed=&quot;true&quot;><br /><h3 class=&quot;font_3&quot;>The Role</h3><br /></div><br /><div id=&quot;comp-jxg81dfb&quot; class=&quot;txtNew&quot; data-packed=&quot;true&quot;><br /><p class=&quot;font_8&quot;>We are looking to add an intern to help with research, analysis, business development, and consulting. This is an opportunity that gives you considerable responsibility and ownership. The majority of your time will be spent conducting research on emerging market alternative finance, conducting business development, analyzing internal data, and working on client projects.</p><br /></div><br /><div id=&quot;comp-jxg81o7o&quot; class=&quot;txtNew&quot; data-packed=&quot;true&quot;><br /><h3 class=&quot;font_3&quot;>Responsibility</h3><br /></div><br /><div id=&quot;comp-jxg81o9g&quot; class=&quot;txtNew&quot; data-packed=&quot;true&quot;><br /><ul class=&quot;font_8&quot; dir=&quot;ltr&quot;><br /><li><br /><p class=&quot;font_8&quot;>Research and analysis for client projects; examples include:</p><br /><ul class=&quot;font_8&quot;><br /><li><br /><p class=&quot;font_8&quot;>IsDB Innovate&nbsp;- User experience and competitive analysis research</p><br /></li><br /><li><br /><p class=&quot;font_8&quot;>GIZ Entrepreneur Guide&nbsp;- Conduct research on alternative finance in specific countries and assist with data collection</p><br /></li><br /><li><br /><p class=&quot;font_8&quot;>WGEO Capital Finder&nbsp;- Business plan drafting and feasibility study</p><br /></li><br /></ul><br /></li><br /><li><br /><p class=&quot;font_8&quot;>Editing and writing articles and reports</p><br /></li><br /><li><br /><p class=&quot;font_8&quot;>Marketing and business development support</p><br /></li><br /></ul><br /></div><br /><div id=&quot;comp-jxg82853&quot; class=&quot;txtNew&quot; data-packed=&quot;true&quot;><br /><h3 class=&quot;font_3&quot;>Minimum Qualifications</h3><br /></div><br /><div id=&quot;comp-jxg82870&quot; class=&quot;txtNew&quot; data-packed=&quot;true&quot;><br /><ul class=&quot;font_8&quot;><br /><li><br /><p class=&quot;font_8&quot;>Currently pursuing/recently finished a BA/BS, MA/MSc, or MBA in economics, development, finance, or related field</p><br /></li><br /><li><br /><p class=&quot;font_8&quot;>Proven interest in economic development and/or alternative finance</p><br /></li><br /><li><br /><p class=&quot;font_8&quot;>Academic or professional experience in research and analysis</p><br /></li><br /></ul><br /></div><br /><div id=&quot;comp-jxg82t2s&quot; class=&quot;txtNew&quot; data-packed=&quot;true&quot;><br /><h3 class=&quot;font_3&quot;>Preferred Qualifications</h3><br /></div><br /><div id=&quot;comp-jxg82t51&quot; class=&quot;txtNew&quot; data-packed=&quot;true&quot;><br /><ul class=&quot;font_8&quot;><br /><li><br /><p class=&quot;font_8&quot;>Previous experience working in emerging markets</p><br /></li><br /><li><br /><p class=&quot;font_8&quot;>Knowledge of Photoshop, InDesign, and Illustrator</p><br /></li><br /><li><br /><p class=&quot;font_8&quot;>In-depth knowledge of alternative finance</p><br /></li><br /><li><br /><p class=&quot;font_8&quot;>Experience working in international development organizations (UN, World Bank, etc.)</p><br /></li><br /><li><br /><p class=&quot;font_8&quot;>Experience with data science and statistical software packages</p><br /></li><br /></ul><br /><p>Start Date: Immediate</p><br /><p>Location: Roles available in Kensington &amp; City of London + Remote working options available.</p><br /><p>Compensation is flexible and competitive for the right candidate with equity options available.</p><br /><p>To apply, please send your CV/resume with a cover letter and a link to your github or example of work.</p><br /></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3Jdhk9hJRV2U8rrhD2EtQQ",
    "url": "https://remote.co/job/accounting-lead-6/",
    "title": "Accounting Lead",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 3W OR(time,timezon)",
      "DBG:surround``your W own W equip",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/finacc",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Stride Services",
      "sameAs": "https://stride.services/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 13, 2019 2:44:43 PM",
    "validThrough": "Sep 20, 2019 2:44:43 PM",
    "crawled": "Sep 13, 2019 3:07:20 PM",
    "content": "<h3>Accounting Lead at <span>Stride Services</span></h3><div><span><i></i> Remote</span>        </div><div>            <ul><li><strong>(Multiple states)</strong></li><li><strong>Part Time to Full Time</strong></li><li><strong>Stride</strong></li><li><strong>Mid Level</strong></li></ul><p><strong>In addition to applying through our website, please call us &amp; leave a voicemail at 415.737.5592 letting us know why you are perfect for this position. <u><em>Candidates who do not leave a message will not be considered.</em></u></strong></p><p><strong>WHO WE ARE</strong></p><p>Stride is an outsourced finance, accounting and HR services company that helps business owners achieve financial freedom. We provide a broad range of back office services with an emphasis on automation and data analytics to unlock efficiency and actionable insight to drive growth and profitability. Until November 2018, The Company had been operating for the last 15 years as Keeping Your Balance, a leading bookkeeping, HR and payroll services firm in San Francisco.</p><p>Our friendly, knowledgeable and professional team members care about our clients and strive to help them grow their businesses.</p><p><strong>WHO WE WORK WITH</strong></p><p>We work almost exclusively with fast-growing small business. From restaurants and early stage startups to professional service firms and non-profits, Stride provides a scalable accounting solution for high-growth companies.</p><p><strong>POSITION: Accounting Lead</strong></p><p>We are looking for experienced accounting specialists to join our growing team! Strong written and verbal communication skills are vital to ensure professional communication with clients. The successful candidate will possess not only the required technical skills, but an ability to provide service to our clients with a smile and a natural desire to go above and beyond expectations. This position has significant growth potential.</p><p><strong>RESPONSIBILITIES</strong></p><ul><li>Provide client-specific bookkeeping and accounting services including but not limited to:</li><li>Managing day to day processing of accounts receivable and payable using QuickBooks Online, producing reports as requested</li><li>Oversee monthly and quarterly assessments and forecasts of organization’s financial performance against budget, financial and operational goals. Oversee short and long-term financial and managerial reporting</li><li>Reconciling monthly activity, generating year-end reports, and fulfilling tax related requirements</li><li>Administering payroll and employee benefits and organizational insurance.</li><li>Ensure that client requests are resolved and communicated in a timely manner to internal and external parties</li><li>Ensure that our service deliverables are accurate and meet client expectations</li></ul><p><strong>QUALIFICATIONS</strong></p><ul><li>Strong ability to meet deadlines &amp; handle multiple assignments</li><li>Proven ability to work in a self-directed manner, with initiative and exceptional follow-through</li><li>Sound judgment, strong decision making skills &amp; abundant common sense</li><li>High attention to detail, organized, and assertive</li><li>Self aware, comfortable knowing your own limits and when to ask for help</li><li>High personal ethical standards</li><li>Able to consistently and accurately follow established policies and procedures</li><li>Eager to leverage technology for efficiency and progress</li><li>Proven ability to manage time and work efficiently</li><li>Prior experience working in a multi-client environment</li><li>Friendly demeanor with a positive can-do spirit; takes pride in high-quality work</li></ul><p><strong>TECHNICAL QUALIFICATIONS</strong></p><ul><li>7+ years full-charge bookkeeping or accounting experience in a multi-client environment</li><li>Experience providing A/R, A/P and payroll functions</li><li>Ability to communicate effectively with clients, team members and outside vendors verbally and in writing, providing the necessary follow up to ensure a great customer experience</li><li>Proficiency with QuickBooks software</li><li>High level of general computer knowledge; comfortable learning new programs and tools</li><li>Comfortable working in a virtual, paperless environment</li></ul><p><strong>ADDITIONAL DETAILS</strong></p><ul><li><strong>This position is remote (work-from-home). You will work from the location of your choice, in a distraction free environment. </strong></li><li>You will use your own equipment, which should include high-speed internet, PC with Windows 7 or newer and MS Office, webcam with microphone and speakers, and phone.</li><li><strong>Travel requirements are infrequent.</strong> We typically have an annual in-person company-wide meeting.</li><li>While work schedules can be flexible based on location, please note that all team members are required to work during our core <strong>business hours of 9am-2pm Pacific Time</strong>, Monday-Friday.</li></ul><p><strong>BENEFITS</strong></p><p>We know that the most successful members of a team give their best when they are in an environment where they can thrive. That is what we are committed to at Stride. Stride offers a wide range of employee benefits for both part-time and full-time employees. Check out our Benefits Summary here</p>        </div><div>        <a href='http://stride.applytojob.com/apply/job_20190813162738_2CK81WWRAMTS5OAW/Accounting-Lead-remote?source=FLEX' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "7GuogwyKRriyUCxjrqqMCg",
    "url": "https://remote.co/job/tax-accountant-2/",
    "title": "Tax Accountant",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/finacc",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Greenback Expat Tax Services",
      "sameAs": "https://www.greenbacktaxservices.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 10, 2019 5:37:14 PM",
    "validThrough": "Sep 17, 2019 5:37:14 PM",
    "crawled": "Sep 10, 2019 6:23:52 PM",
    "content": "<h3>Tax Accountant at <span>Greenback Expat Tax Services</span></h3><div><span><i></i> Remote</span>        </div><div>            <ul><li><strong>Remote US Expat Tax Accountant (CPA or EA)</strong></li></ul><p><strong>Location: Remote, work from home, any time zone or geography</strong></p><p><strong>Greenback Expat Tax Services</strong>&nbsp;is a company that specializes in preparing tax returns for Americans living overseas. We are a highly energetic, positive, resourceful team working virtually across the globe. We believe that executional excellence is key to success.</p><p>At Greenback, we provide you with the tools that you need to be successful and we bring our clients to you so that you can focus on preparing expat taxes and providing exceptional customer care!</p><p>This is not a traditional JOB- it’s more like a business partnership- and is ideally suited for those folks who love the idea of their earning potential being tied to their individual accomplishments, are obsessively organized and have a natural flair for customer care.</p><p><strong>What we’re looking for:</strong></p><ul><li>CPAs or EAs with 3-5 years of experience preparing US expat tax returns, including specific experience with the additional forms and schedules required for expats (1116, 2555, FinCen 114, 5471, 3520, etc.)</li><li>People who are comfortable managing their own schedule and workload. There are no set hours- you get paid for the work you do and your results. You take on as many customers as you choose (we pre-agree annual targets)</li><li>People who see technology as an enabler and embrace it fully. We use state of the art systems (Salesforce, Box, ProSeries, and Lacerte).</li><li>People who are extremely organized, especially in managing around deadlines. This is a deadline-driven business, so anyone who gets frazzled near a tax deadline or disorganized will struggle.</li><li>Strong attention to detail. Mistakes on tax returns are not cool. We need people who make sure there’s never an error or an oversight.</li></ul><p><strong>Why work with Greenback?</strong></p><ul><li>Again, this is not a traditional 9 to 5. No one has set hours- you have specific responsibilities and obligations related to timeliness of customer care, but it’s up to you to set a schedule that meets those timings.</li><li><strong>No office/no commute.</strong>&nbsp;You have ultimate&nbsp;<strong>flexibility</strong>&nbsp;to decide where you work from and when you work. Want to spend tax season in your home office and the slower season working a lighter load from Mexico or Bali or the coast of Spain? Many on our team do just that.</li><li>You get paid directly in proportion to how many tax returns you complete. Your earning potential is unlimited and a good number of the accountants on our team earn six figures. However, this is also very personal and is directly in relation to your skillset. If you’re a hustler, have high expertise in US expat tax prep, work hard and stay organized, this is a great opportunity for you.</li><li>We have frequent bonus opportunities for excellence in staying organized, timeliness and attention to detail. We’ve heard our accountants described as&nbsp;<strong>personal tax time hero’s</strong>-we compensate accountants above the standard per return pay for above and beyond customer care</li><li>This opportunity is an ideal fit for people who are happy to work on their own, but don’t want to manage the business logistics like marketing, customer acquisition, billing, customer service, etc</li><li>We’re maniacal about customer care- we expect everyone to have an experience with us that makes them want to go straight out and tell their friends how wonderful Greenback is. Accountants who feel that’s important thrive with us and love how happy their customers are at the end of each tax season.</li><li>You will have&nbsp;<strong>access to a peer group of 30+ accountants</strong>&nbsp;that are the best in the industry in regards to not just US expat taxes, but also customer centricity.</li></ul><p>And the best news is- we’re hiring! The business is growing rapidly, and we’re looking to staff 5-10 more accountants this year alone. Apply today!!! To apply, take the following steps:</p><ul><li>Fill out our online assessment (see link below!)</li><li>Attach to the online form not only your resume/CV, but also a cover letter</li></ul><p>We will follow up with all candidates within 5 working days with next steps.</p><p><strong>Location: United States<br>Candidates can be based anywhere in the world, this position is virtual/work from home.</strong></p>        </div><div>        <a href='https://www.greenbacktaxservices.com/jobs/expat-tax-accountant/' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "WWWYF2_wT76o1O7aSCik9A",
    "url": "https://remote.co/job/data-conversion-specialist-sql-investment-finance/",
    "title": "Data Conversion Specialist (SQL, Investment Finance)",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "FinFolio",
      "sameAs": "https://www.finfolio.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 6, 2019 4:35:59 PM",
    "validThrough": "Sep 13, 2019 4:35:59 PM",
    "crawled": "Sep 6, 2019 5:07:14 PM",
    "content": "<h3>Data Conversion Specialist (SQL, Investment Finance) at <span>FinFolio</span></h3><div><span><i></i> Remote</span>        </div><div>            <h5><strong>Who is FinFolio?</strong></h5><ul><li>We make wealth management simpler!</li><li>A SaaS solution&nbsp;that&nbsp;is the backoffice for professional wealth managers</li><li>Our software reports, trades, and bills investment accounts</li><li>Founded in 2008, we recently re-launched our product to rave reviews</li><li><strong>20+&nbsp;employees, 50% are remote, grew 100% over 24 months</strong></li><li>Exciting early-stage startup, adding a new client&nbsp;every&nbsp;12 days</li><li>Passionate and excited about great software and making our clients happy</li></ul><h5><strong>What&nbsp;will you do at this job?</strong></h5><ul><li>Convert data from various legacy financial accounting systems</li><li>Work with the onboarding&nbsp;team to troubleshoot data problems</li><li>Create scripts and use automation tools to convert data efficiently</li><li><strong>Reconcile financial data and accounts, ensuring accuracy of data</strong></li><li>Communicate with clients and vendors about status of data&nbsp;conversions</li><li>Support FinFolio’s software, help troubleshoot data problems, reports, etc.</li><li>Write&nbsp;and&nbsp;improve processes and&nbsp;find ways to be more&nbsp;efficient and accurate</li></ul><h5><strong>What qualifications would help me be successful at FinFolio?</strong></h5><ul><li>Familiar with market operations (Exchanges, stocks, bonds, etc.)</li><li>Prior experience with ELT tools and data conversions</li><li><strong>Strong technologist that knows SQL, scripting languages, or can write code</strong></li><li>Excellent written and verbal communication skills in English</li><li>Must be reliable and self starting, with a strong attention to detail</li><li>Based in the USA, with a quiet home office and fast internet</li><li>Must be tech savvy, able to write scripts&nbsp;and use macro languages</li><li>Finance degree, Series 63 or equivalent experience would be&nbsp;great</li><li>Would be a plus to know FTP, SQL, DOS Batch, or REST APIs</li></ul><h5>&nbsp;<strong>What remote tools do we use?</strong></h5><ul><li>Sococo for video, telepresence and meetings<strong><br></strong></li><li><strong>Slack for intra-office communication</strong></li><li>GMail for communication with clients and data vendors</li><li>Zenefits for HR and payroll</li><li>Google Drive for documents,&nbsp;spreadsheets, etc.</li><li>Hubspot for contact management and help desk (soon)</li></ul><h5><strong>Why should you work here?</strong></h5><ul><li>Work with a team that is&nbsp;excited and passionate about what they do</li><li>Help&nbsp;support an amazing, best-in-class product that is fun to use</li><li><strong>Competitive salary + health/dental + paid time off + 401K match</strong></li><li>Interact with&nbsp;interesting and successful financial advisor&nbsp;clients</li><li>Fun co-working office in Denver RINO:<br><a href='https://www.denver.org/about-denver/neighborhood-guides/river-north-art-district/' rel='nofollow'>https://www.denver.org/about-denver/neighborhood-guides/river-north-art-district/</a></li></ul><p>Location: <strong>US Locations Only</strong></p>        </div><div>        <a href='https://www.finfolio.com/careers#op-312813-data-conversion-specialist-investment-finance' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "9btA1rL1RmG_JmpRtCuXGw",
    "url": "https://remote.co/job/senior-accountant-central-or-eastern-u-s/",
    "title": "Senior Accountant – Central or Eastern U.S.",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "JLL - Jones Lang LaSalle",
      "sameAs": "https://www.us.jll.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 5, 2019 3:01:50 PM",
    "validThrough": "Sep 12, 2019 3:01:50 PM",
    "crawled": "Sep 5, 2019 3:07:19 PM",
    "content": "<h3>Senior Accountant – Central or Eastern U.S. at <span>JLL - Jones Lang LaSalle</span></h3><div><span><i></i> Remote</span>        </div><div>            <p>Full time</p><p>REQ65635</p><p>We are currently seeking a Senior Accountant to join our Client Finance team . Our ideal candidate will work with us in downtown Nashville <strong>however we will consider other qualified candidates in the Central or Eastcoast of the U.S. </strong>This is an exciting opportunity for anyone interested in a career in Accounting and Finance who has a hunger for learning and wants to join an organization that will provide opportunities for growth.</p><p><strong>What this job involves:</strong></p><ul><li>Prepare monthly financial package and submit timely to the Finance Manager for review and approval in order to finalize reporting within deadlines.</li><li>Ensure that all balance sheet accounts are reconciled on a timely basis and outstanding items are followed upon.</li><li>Ensure revenue is recognized in accordance with ASC 606 guidelines.</li><li>Manage client billing process.</li><li>Maintain Accounts Receivables and other Balance Sheet accounts providing monthly commentary for unresolved items.</li><li>Update procedural documentation associated with assigned accounting processes.</li><li>Identify/recommend process improvements and assist in the implementation of those process improvements/changes approved by Finance Director.</li><li>Perform/complete special projects and functions as required by Finance Manager or Finance Director</li></ul><p><strong>Sound like you? Before you apply it’s worth knowing what we are looking for:</strong></p><ul><li><strong>A Bachelor’s degree in Accounting or Finance required; CPA a plus</strong></li><li>2-5 years of accounting experience, some real estate experience preferred</li><li>Experience in real estate or lease accounting is a plus.</li><li>Advanced accounting and analytical skills</li><li>Strong working knowledge of Microsoft Excel and other spreadsheet applications required</li><li>Experience with real estate accounting software a plus (JDE, MRI, Skyline, and/or Timberline) JD Edwards E1 knowledge a plus.</li><li>Excellent verbal and written communication skills</li><li>Demonstrated consistency in values, principles and work ethic</li><li>Strong organizational and analytical skills.</li><li>Strong accounting skills and attention to detail required</li><li>Willingness to take on new challenges, responsibilities, and assignments</li><li>Understanding of and commitment to client services</li><li>A desire to work within a diverse, collaborative, and driven professional environment</li></ul><p><strong>What you can expect from us:</strong></p><p>You’ll join an entrepreneurial, inclusive culture. One where we succeed together – across the desk and around the globe. Where like-minded people work naturally together to achieve great things.</p><p>Our Total Rewards program reflects our commitment to helping you achieve your ambitions in career, recognition, wellbeing, benefits and pay. We’ll offer you a competitive salary and benefits package.</p><p>Join us to develop your strengths and enjoy a fulfilling career full of varied experiences. Keep those ambitions in sights and imagine where JLL can take you…</p><p><strong><em>JLL Privacy Notice</em></strong></p><p>Jones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.</p><p>For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.</p><p>For additional details please see our career site pages for each country.</p><p>For employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy here.</p><p>Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process – you may email us at Accommodation.Reques@am.jl..com. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page &gt; I want to work for JLL.</p>        </div><div>        <a href='https://jll.wd1.myworkdayjobs.com/en-US/jllcareers/job/Nashville-TN/Sr-Accounting-Associate_REQ65635' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "R0bdYaXMSomQMKcEd4btbQ",
    "url": "https://berlinstartupjobs.com/finance/accounting-payroll-manager-8fit/",
    "title": "Accounting/Payroll Manager // 8fit",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "8fit",
      "sameAs": "https://8fit.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 3, 2019 3:19:56 PM",
    "validThrough": "Sep 10, 2019 3:19:56 PM",
    "crawled": "Sep 3, 2019 4:07:35 PM",
    "content": "<h3>Accounting/Payroll Manager // 8fit</h3><div> Company:  8fit <br> <br></div><div> Tags:</div><li>Accounting</li><li>DATEV</li><li>Payroll</li><li>Auditing</li><div>  <p>At 8fit, our vision is to make the world a healthier and happier place – that’s what gets us out of bed every morning. We help millions of people around the world reach their personal goals with workouts and customized meal plans.</p>  <p>We understand the obstacles people face on their health and fitness journey. It’s not easy, and there’s no one-size-fits-all solution. Our app delivers delicious, accessible meal plans and quick, effective workout routines. We guide people in creating and solidifying healthy habits for a sustainable lifestyle.</p>  <p>We are looking for a part-time Accounting Manager to join our Finance team and work with us to help our users live healthier lives, and increase user engagement and retention. You will be responsible for the accounting and payroll for 8fit GmbH.</p>  <p><strong>After your morning coffee, you’ll…</strong></p>  <ul>   <li>Support the daily financial operations: accounts payable, payment runs, reconciliations etc.</li>   <li>Support the monthly closing and financial audits (yearly)</li>   <li>Own and process the monthly payroll</li>   <li>Assist HR processes throughout the entire HR lifecycle, from contract management to leave management</li>   <li>Provide support on topics such as company regulations and policies, compensation, and German employment law, as well as suppliers and freelancers</li>   <li>Provide support with other administrative tasks.</li>  </ul>  <p><strong>You…</strong></p>  <ul>   <li>Communicate: Whether one-to-one or in a group, the ability to exchange ideas effectively and with empathy is a vital part of your skillset.</li>   <li>Own it: Autonomy comes with responsibility. Good or bad, you own your decisions and their outcomes. There’s no such thing as ‘not my job.’</li>   <li>Are curious and creative: Ask questions. Think critically. Vocalize ideas. Try new approaches. Nurture creative problem solving, learning and troubleshooting.</li>   <li>Collaborate: Being able to share and develop ideas as a team makes us stronger. It’s a conversation, not a monologue.</li>   <li>Are agile: Adapting to changes and iterating on initial concepts is all part of the process. There’s no room for rigidity.</li>   <li>Value balance: Work to live, not the other way around. It’s important to have a rich, fulfilling life outside the office.</li>   <li>Are human: Be humble, admit mistakes readily, and never stop learning and growing.</li>  </ul>  <p><strong>What’s in your toolbox?</strong></p>  <p>If that sounds like you, read on. To be successful in this role you’ll need:</p>  <ul>   <li>A degree in Business Administration with a specialisation in Finance/Accounting/Controlling and strong German GAAP / IFRS knowledge</li>   <li>A minimum of 3 years of combined public accounting and/or private industry accounting experience</li>   <li>Experience working with DATEV</li>   <li>You speak and write native-level German and can communicate fluently in English</li>   <li>A great attention to detail and advanced excel skills (e.g. vlookup and pivot tables)</li>   <li>Extremely reliable character with a demonstrated ability to handle sensitive information with discretion.</li>  </ul>  <p><strong>What’s in it for you:</strong></p>  <ul>   <li>Flexible and remote working hours, because a work-life balance should be the rule not the exception</li>   <li>An own-your-own-development budget that supports your personal and professional growth</li>   <li>Stock options, as 8fit’s success is your success</li>   <li>An Urban Sports Club membership — fit is in our name</li>   <li>Weekly workouts, we are a fitness app after all</li>   <li>Healthy snacks and weekly company lunch, so you can feed your body and brain</li>   <li>A helping hand if you need to relocate</li>   <li>Meet-ups, offsites, workshops, and much more.</li>  </ul>  <p><strong>Sweet surroundings:</strong></p>  <p>Situated in the heart of Berlin, our spacious, modern open plan office is located right by the river Spree. We\\’re a short bike ride or scenic walk away from cool cafés, historical and cultural sites, sports events, gyms and fitness studios, as well as spacious parks.</p> </div><a href='https://8fit.workable.com/jobs/1120975' rel='nofollow'>Apply for this position</a>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Jy6lAqSHSRua2UkDJv7cqA",
    "url": "https://problogger.com/jobs/job/jr-accounting-software-writer-remote-friendly/",
    "title": "Jr. Accounting Software Writer (Remote Friendly)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Fit Small Business",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 26, 2019 2:00:00 AM",
    "validThrough": "Sep 2, 2019 2:00:00 AM",
    "crawled": "Aug 26, 2019 5:06:53 PM",
    "content": "<h3>Jr. Accounting Software Writer (Remote Friendly)</h3><div>Company: Fit Small Business</div>Location: New York, NY<br>Job Type: Full-time<div>  <h5>Description</h5>  <div>                    <h4><strong>Jr. Accounting Software Writer&nbsp; (Remote Friendly)</strong></h4><h4><strong>Your role in a nutshell:&nbsp;The Jr. Accounting Software Writer will be an integral part of building the most comprehensive small business accounting and bookkeeping portal on the internet.</strong></h4><h5><strong>This position includes:</strong></h5><ul><li><span>The Jr. Accounting Software Writer will be writing in-depth comparison articles of accounting, bookkeeping, and tax software.</span></li><li><span>Researching (including interviewing experts and participating in demos) and writing articles about specialty software and apps.</span></li><li><span>Updating product features and pricing information.&nbsp;</span></li><li><span>Providing detailed responses to reader questions.</span></li><li><span>Developing infographics and visuals to support written content.</span></li></ul><h5><strong>Our mission:To deliver the best answers to people's questions.</strong></h5><h6><span>Recently named to the Inc. 500 list of America’s fastest-growing private companies, Fit Small Business has more than 3 million small business owners and managers reading our content each month. We deliver well-researched, authoritative articles so these owners can make informed decisions to grow businesses that fuel the economy. Our founders have built successful businesses before, and FSB is profitable with no outside funding. Part of the team of 170+ people is in our NYC headquarters, near Grand Central. Others are distributed across the U.S., Canada, and the Philippines.</span></h6><h5><strong>Does this sound like you?</strong></h5><ul><li><h6><span>As the new Jr. Accounting Software Writer you will have a professional or educational background in bookkeeping and accounting.&nbsp;</span></h6></li><li><h6><span>You’re excited about the ways software and other technology can create efficiencies for small businesses and provide them with new insights.&nbsp;</span></h6></li><li><h6><span>You are passionate about writing and want to share your knowledge in written form to teach our eager readership how to make their small businesses succeed.</span></h6></li></ul><h5><strong>Your Background:</strong></h5><ul><li><h6><span>At least one year of relevant experience.</span></h6></li><li><h6><span>Strong working knowledge of common accounting software, like QuickBooks.&nbsp;</span></h6></li><li><h6><span>You enjoy learning the ins and outs of software and apps.&nbsp;</span></h6></li><li><h6><span>You are a great researcher and writer.</span></h6></li><li><h6><span>You are high energy, and passionate about helping small businesses.</span></h6></li><li><h6><span>You are comfortable working in a startup environment, where things change quickly.</span></h6></li><li><h6><span>You have a strong work ethic.</span></h6></li></ul><h5><strong>Tools We Use:</strong></h5><h6><span>WordPress, Insightly, G Suite, Slack, Trello, Guru, Zoom</span></h6><h6><span>*It's ok if you have not used these, just be enthusiastic to learn them.</span></h6><h6><strong>What we offer you:</strong></h6><ul><li><h6><span>Competitive salary</span></h6></li><li><h6><span>Quality health insurance (subsidized by FSB)</span></h6></li><li><h6><span>Short-term and long-term disability (Paid by FSB)</span></h6></li><li><h6><span>Traditional &amp; Roth 401K plans with matching from first day</span></h6></li><li><h6><span>Vision, dental, and life insurance</span></h6></li><li><h6><span>Flexible Spending Accounts and Commuter Benefits</span></h6></li><li><h6><span>PTO</span></h6></li><li><h6><span>Flexibility</span></h6></li><li><h6><span>Perks and discounts via our PEO</span></h6></li><li><h6><span>A collaborative workplace, which will challenge you and celebrate your work</span></h6></li><li><h6><span>A chance to learn with and from interesting and enthusiastic colleagues</span></h6></li></ul><h6><span>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</span></h6><h6></h6>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "__A3FNNbSMC5jtxV3qNE7Q",
    "url": "https://remote.co/job/bookkeeper-16/",
    "title": "Bookkeeper",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "AudiologyDesign",
      "sameAs": "http://www.audiologydesign.com/"
    },
    "salary": {
      "currency": "USD",
      "minValue": 20,
      "maxValue": 20,
      "info": "",
      "unit": "HOUR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 20 /Hour"
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2019 5:37:08 PM",
    "validThrough": "Aug 29, 2019 5:37:08 PM",
    "crawled": "Aug 22, 2019 6:24:55 PM",
    "content": "<h3>Bookkeeper at <span>AudiologyDesign</span></h3><div><span><i></i> Remote</span>         | <span> Part-time </span></div><div>            <p>Stalwart Journeys LLC (dba AudiologyDesign) is seeking a part-time bookkeeper for our growing business. In business since 2002, AudiologyDesign is the leading digital marketing agency in hearing healthcare. <strong>We are a completely virtual office environment affording the opportunity to conveniently work from home. </strong></p><p><strong>We are seeking a dependable bookkeeper with QuickBooks expertise to:</strong></p><ul><li>Develop, enhance and manage bookkeeping policies and procedures, along with developing a framework to track financial transactions with an established chart of accounts</li><li>Conduct and manage the general ledger</li><li>Appease accounts by balancing entries</li><li>Support accounts by verifying, allocating, and posting transactions</li><li>Put together financial reports by collecting, analyzing, and summarizing account information</li><li>Examine payments received and record deposits</li><li>May also include HR administration, and special projects as assigned</li></ul><p><strong>Competencies</strong>:</p><ul><li><strong>BS Degree in Accounting, Finance or Business Administration preferred or equivalent experience</strong></li><li>5+ years of previous experience as a Bookkeeper</li><li>Solid understanding of QuickBooks</li><li>Prior experience using accounting software</li><li>Strong familiarity with billing</li><li>Comprehensive knowledge of payroll</li></ul><p><strong>Desired Qualities:</strong></p><ul><li>A passion for and sense of personal satisfaction in delighting clients and helping small businesses succeed.</li><li>Ability to communicate clearly and professionally, both orally and in writing.</li><li>Willingness to consistently and accurately follow established policies and procedures.</li><li>Confidence in learning and embracing new technology to solve client issues.</li><li>Experience in developing strong remote team relationships based on trust, accountability, integrity, and sharing of best practices.</li><li>Ability to maintain the highest level of confidentiality</li></ul><p><strong>Mission:</strong> The PT Bookkeeper’s mission is to establish and document solid bookkeeping policies and procedures and ensure accurate and timely data entry and monthly financial reporting – providing the organization the utmost confidence that our accounting records are in order.</p><p><strong>Compensation:</strong></p><ul><li><strong>Part-Time Position</strong></li><li>$20 per hour; 15 hours per week</li></ul>        </div><div>        <a href='https://audiologydesign.com/bookkeeper/' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "e_fI0LsxSt6SwUsN0-BSEw",
    "url": "https://jobmote.com/job/63632/14k-per-month-work-at-home-financial-services/",
    "title": "$14K+ per month - Work At Home - Financial Services",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Google",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 19, 2019 11:24:31 AM",
    "validThrough": "Aug 22, 2019 11:24:31 AM",
    "crawled": "Aug 19, 2019 4:06:26 PM",
    "content": "<div>Salary 100% Commission, <p><strong>This a realistic 6-figure plus career opportunity</strong> for a highly motivated individual who is willing to follow a <strong>PROVEN SYSTEM</strong> and put in the work<strong>. </strong><br><br>Our parent organization paid out <strong>$985 Million </strong>in commissions in 2016,<strong> </strong>and they intend to<strong> </strong>pay out <strong>$4 Billion in 2020</strong>. <br><br>We are taking t<strong>he most successful business model </strong>in the Financial Services industry into a completely virtual environment with solid backing from one of the strongest and best known companies in America.<br><br><br><strong>We are seeking experienced sales &amp; recruiting pros as well as sales trainees.</strong><br><br>You bring the skills, attitudes, and habits of success... We teach you the details. OK to start Part Time.</p><p><br>----------------------------------------------------------------------------------------------------------------------------------------<br>If you would like to learn more, <strong>your NEXT STEP is to watch our intro video.</strong><br><br>If you like what you see on the video, then click the link to request for an initial phone interview<br>to get your questions answered and to see if we're a match.</p><p>---------------------------------------------------------------------------------------------------------------------------------------------</p><p><br><strong>WORK FROM ANYWHERE... </strong>We do everything online: Live training 4 times weekly via livestream<br>presentations, recorded training 24/7 on video, and our client presentations are done via private web conferences<br>using screen sharing technology.<br><br><strong>DO BUSINESS NATIONWIDE</strong> ... This virtual model eliminates all the wasted drive time and<br>no more boring office meetings... you can get a lot more done in a lot less time and you can expand<br>your territory to the entire United States!<br><br><br>Our system enables individuals new to the industry to earn great income as they learn the business,<br>and it enables seasoned industry professionals to expand their business from their local home town<br>to the entire country, and <strong>build a nationwide \\&quot;virtual agency\\&quot;.</strong><br><br><br>This is a unique, lucrative, dynamic opportunity to<strong> take back control of your life and of your financial destiny.</strong><br><br>Set your own hours. <strong>We pay for RESULTS, not attendance</strong>... so if you're looking for a job,<br>this is not for you...but if you're looking for a <strong>SYSTEM </strong>that can allow you to get to a level of income<br>that just has not been possible before, then we might be a match because<strong>...<br><br>We don't punish success, we throw money at it.</strong><br><br><br><strong>What we offer...</strong><br><br>1. <strong>NO LIMITS on your income... be paid what you're really worth.</strong><br>2. Commission advances, overrides, and bonuses <strong>paid twice weekly</strong><br>3. Great quality of life.. work from anywhere<br>4 .<strong> Flexible hours / Time Freedom</strong>... you're the boss<br>5 . Fun, supportive, and positive team culture<br>6. A marketing position that doesn't require any selling<br>7. <strong>Proven SYSTEM</strong> that that produced $732 million in commissions &amp; bonuses in 2015<br>8. Thorough training both live and recorded. Personal mentoring.<br>9. Company wide recognition and bonuses for significant achievement<br>10. Company paid celebrations at beautiful destinations for top producers<br>11. Leadership that cares about your success<br>12. <strong>Leveraged and residual income</strong> over time and <strong>ability to earn equity</strong><br><br>Most importantly, <strong>an opportunity to make a real difference</strong> in people's lives while you<br>escape the 9-5 rat race and <strong>take back control of your life.</strong><br><br><br><strong>What we DON'T do...</strong><br><br>1. No cold calling or door-to-door<br>2. No evening or weekend appointments away from home<br>3. No wasting time fighting traffic &amp; No boring office meetings<br>4. No dress code<br>5. No quotas or minimums except those you set for yourself<br>6. No micro-managing<br>7. No corporate favoritism. Promotions based on results, not politics.<br><br><br><strong>Who We Are Looking For...</strong><br><br>Our ideal candidate is a self-motivated winner who is HUNGRY and just looking<br>for <strong>the right opportunity, the right team, and the right SYSTEM.</strong></p><p>We are looking for self-motivated achievers who are looking for the<strong> freedom and flexibility</strong><br>to work on your own schedule from a virtual office in a REAL business of your own, with one<br>of the strongest companies in the industry.<br><br>Must have strong communication and \\&quot;people skills\\&quot;, a great attitude, HIGH INTEGRITY,<br>enjoy helping people, and be willing to follow our proven system and put in the time and<br>work that we all know is required in order to achieve extraordinary success.<br><br>If that's you, then lets talk.<br><br><br><strong>Part time OK</strong> if you can put in at least 12 hours/week minimum in income producing activity<br>plus 3+ hours per week of online training.<br><br><strong>This is a 1099 independent contractor position. Income is based on results. </strong>Life insurance license<br>is required, which is easy to get. OK to start while working on your pre-license education.</p><p><br><br><strong>YOUR NEXT STEP...</strong><br><br>If you would like to learn more, <strong>your NEXT STEP is to watch our intro video.</strong><br><br>If you like what you see on the video, then click the link to request for an initial phone interview<br>to get your questions answered and to see if we're a match.<br><br><br><strong>TO WATCH THE VIDEO...</strong></p><ol><li>Click the green 'APPLY NOW' button on the lower right side of this page</li><li>Fill in the brief info form and click SUBMIT</li><li>On the next page, click the link to get to our website with the video</li></ol><p><br>We look forward to meeting you on the phone very soon if you would like to discuss the possibilities.<br><br><br>DOUG JONES<br>Senior Vice President</p><p> </p><p>P.S. <strong>As you watch the video, take notes and jot down your questions,</strong> then click the NEXT<br> button below the video to request and initial phone interview so we can get them answered<br> for you and see if we are a match.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "MpEQSibzTBaxaIAcnfiUEQ",
    "url": "https://jobmote.com/job/63610/it-architect-patient-accounting-remote/",
    "title": "IT Architect - Patient Accounting (REMOTE)",
    "tags": [
      "DBG:surround``can 2W remot",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "TIER4 GROUP",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 19, 2019 11:24:30 AM",
    "validThrough": "Aug 22, 2019 11:24:30 AM",
    "crawled": "Aug 19, 2019 4:06:26 PM",
    "content": "<div>Job DescriptionJOB SUMMARYRobinson Key has been contracted by a leading hospital system undergoing a technology transformation to fill the role of IT Architect - Patient Accounting. Join a HIMSS Stage 7 healthcare system with a highly-optimized tech infrastructure including Cerner Smart Room technology. The IT team is also building a new highly collaborative office space designed with innovation in mind. IT Architect, Business Operations Optimizes application usage and workflow efficiency by working with assigned department heads. Serves as an escalation point for upgrades and services for reported issues or for assigned projects. Focuses on revenue cycle, scheduling, HIM, and registration operations for both inpatient and outpatient practices. Assists in training efforts for designated applications as deemed appropriate. Analyze reports to identify operational issues throughout all departments. Design, develop, implement and maintain business solutions and recommendations to improve efficiency. Specialty specifics:o Patient Accounting Must have 3 years of experience, prefer 5 years, building and maintaining Cerner Patient Accounting Must have experience in Cerner CPA. Experience with nThrive (MedAssets) a plus but not required. DEPARTMENT STANDARDS? Provide outstanding customer service to our clients and maintain positive relationships with other employees and contractors. ? Desire and willingness to work in a collaborative, innovative, flexible and team-oriented environment, while displaying a problem solving orientation to issues on a daily basis.? Troubleshoot identified issues, solve end user problems, enhance and optimize applications. ? Particulate in ongoing support and maintenance of existing systems and applications. Perform after-hours maintenance as required. ? Create and maintain detailed technical documentation in regards to enterprise systems and applications. ? Provides on-call coverage as deemed appropriate by management. ? Flexible to complete any assigned task.? Ability to quickly learn and adapt to new procedures, processes, technology and applications. ? Strong planning and organizational skills. ? Exhibit strong communication skills by pro-actively responding to telephone calls, email, in-person, and automated requests for technical support. ? Identify and escalate production-critical issues to appropriate IT personnel. ? Use ticketing system to log and monitor tickets. ? Participates in projects as deemed appropriate by management. ? Evaluates and corrects issues involving configuration of applications. EDUCATION, EXPERIENCE AND QUALIFICATIONS? Minimum of a Bachelor??s Degree in Business, Technology, or related field a MUST.? Prefer 5+ years of experience required. ? Candidates can work remotely from home and travel as needed. Relocation is offered (if desired) but is not required.? Excellent verbal and written communication skills.? Ability to solve complex problems in a timely manner. ? Accurate with good attention to detail. ? Ability to work under own initiative / self-motivated. ? Experience working in a large cross-functional team environment. ? Experience with information technology optimization. ? Dexterity to learn new systems and programs rapidly. ? Must have working knowledge of the industry. This includes but is not limited to configuration management principle and practices, software development lifecycle, and application security practices. ? Must have working knowledge of a within the specific department. ? Must have an understanding of testing methodologies. ? Must have experience working as an intermediary between technical and non-technical teams. ? Proficient in the Microsoft Office Suite (Word, Excel, PowerPoint, OneNote, Outlook, Visio). ? Certifications not required. SDL2017</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3NS2Ij-QSbKUxnwvsLx7gw",
    "url": "https://stackoverflow.com/jobs/282425/analytics-engineer-interested-in-data-science-plus-capital?a=1wIqyqLoJ4tO",
    "title": "Analytics Engineer Interested in Data Science + Finance at Capital (New York, NY) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/24",
      "DBG_TECH1:k/t/w:hadoop/bigdata-ml/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/4",
      "DBG_TECH1:k/t/w:numpy/python/5",
      "DBG_TECH1:k/t/w:pandas/python/5",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:k/t/w:scikit-learn/bigdata-ml/8",
      "DBG_TECH1:k/t/w:scikit-learn/python/5",
      "DBG_TECH1:techWeightMap:{python=19, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=44, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Capital",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 17, 2019 1:06:24 PM",
    "validThrough": "Aug 24, 2019 1:06:24 PM",
    "crawled": "Aug 17, 2019 1:06:25 PM",
    "content": "<h3><span>Analytics Engineer Interested in Data Science + Finance</span>                </h3>                    <h4>About this job</h4>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior, Lead</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Backend Developer, Data Scientist</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Finance, Financial Technology</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>1–10 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Capital | New York, NY<br></div>                    <h4>Remote details</h4>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>New York, NY.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                        <div>                                    <span>Relocation Assistance:</span>                                    <span>Yes</span>                                </div>                        </div>                    </div>                <h4>Technologies</h4><div></div><div>python</div><div>d3.js</div><div>pandas</div><div>scikit-learn</div><div>numpy</div>                <h4>Job description</h4>                <div><p><strong>Who we are</strong></p><p>We are a team of passionate and intellectually diverse individuals, who are building financial services that help companies grow to their fullest potential. We believe that fast, fair, and equitable access to financial intelligence can level the playing field for high performing and high potential companies at any stage in their financing.</p><p>The Capital Machine is a systematic financial analysis tool that functions like Bloomberg, but for private companies. Private companies connect their data to the machine and receive financing offers within hours from Capital’s balance sheet. On the back-end, the machine analyzes and benchmarks company data, facilitating data-driven engagement between those who invest capital and those who need it to scale their businesses.</p><p><strong>What you’ll contribute</strong></p><p>As an Analytics Engineer at Capital, you will work on mission-critical problems related to building robust, scalable data pipelines and productionizing analytics. You understand basic probability theory, applied machine learning, and textual analysis. You’re comfortable writing tested, performant code to migrate ideas from the workbench to production. You love visualization and get excited about making data beautiful and intuitively accessible to end users. At Capital, you’ll develop fluency in the language of capital markets and finance. You are an effective communicator who is excited to build bridges between members of these communities and your own.</p><p><strong>Who you are</strong></p><ul><li>You have strong foundations in machine learning and probability theory, with demonstrated success working on applied challenges</li><li>You’ve mastered OOP in Python and have experience working on backend systems that are deployed to production environment</li><li>You understand fundamental software engineering concepts such as modularity, separation of concerns, data structures and interfaces, and computational complexity</li><li>You’ve implemented unit and functional testing as part of a continuous integration workflow</li><li>You have a good eye for data visualization and experience with static (e.g. ggplot2, Plotly) and dynamic (e.g. Dash, Bokeh) toolkits</li><li>You have solid written and verbal communication skills, with the ability to bridge the gap between those who do and don’t speak fluent “data”</li><li>You’ve worked with a distributed processing framework, such as spark, hive, or hadoop</li><li>You have experience implementing workflow/scheduling frameworks such as luigi or airflow</li><li>You have experience working on--or are interested in learning about and attacking--hard financial problems</li></ul><p><strong>How you'll be supported at Capital</strong></p><ul><li>Unlimited PTO and flexible WFH policy</li><li>Learning stipend to pursue any kind of professional development or continuing education related or not related to your field</li><li>Platinum medical, vision and dental coverage and OneMedical membership for you and your dependents. Includes FSA &amp; HSA options</li><li>Unlimited parental leave plus fertility benefits</li><li>401k plans and co-investment opportunities so you can be a part of Capital's stellar investment performance</li><li>Stipends for wellness, transportation, and electronics (laptops, headphones, monitors - anything you need to do your best work)</li><li>Stocked office with 24/7 access and custom workstations</li><li>Another request? Just let us know!</li></ul>                </div>            <div>        <a href='https://grnh.se/d5c123142' rel='nofollow'>                        Apply now        </a></div>            <h4>About Capital</h4>            <div><p>Capital is on a mission to make the $5 trillion private financial markets fair, transparent, and accessible to anyone who has an innovate idea and is seeking funding. Together, we are creating The Capital Machine to connect founders with investors.</p><p>The Capital Machine is a systematic financial analysis tool that functions like Bloomberg, but for private companies. Private companies connect their data to the machine and receive financing offers for complex $5 to 75 million transactions within hours. On the back-end, the machine analyzes and benchmarks company data. This enables it to select opportunities to hold in the Capital captive balance sheet entity and syndicate other opportunities across its network of institutional Capital partners.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Unlimited PTO and flexible WFH policy</span>                            </li>                            <li>                                <span></span>                                <span>Medical, dental, and vision coverage</span>                            </li>                            <li>                                <span></span>                                <span>Unlimited parental leave plus fertility benefits</span>                            </li>                            <li>                                <span></span>                                <span>401k plans and co-investment opportunities</span>                            </li>                            <li>                                <span></span>                                <span>Stipends for wellness, transportation, and electronics</span>                            </li>                            <li>                                <span></span>                                <span>Comped outings</span>                            </li>                            <li>                                <span></span>                                <span>Stocked office (In-office snacks &amp; cold brew)</span>                            </li>                            <li>                                <span></span>                                <span>Learning and Mentorship Program</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "zeeOcx9sTu2rYROA82002Q",
    "url": "https://remote.co/job/staff-accountant-bookkeeper/",
    "title": "Staff Accountant / Bookkeeper",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:generics/java/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/finacc",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "Bookkeeping for Dentists LLC",
      "sameAs": "https://www.bookkeepingfordentists.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 16, 2019 10:07:03 PM",
    "validThrough": "Aug 23, 2019 10:07:03 PM",
    "crawled": "Aug 16, 2019 10:32:14 PM",
    "content": "<h3>Staff Accountant / Bookkeeper at <span>Bookkeeping for Dentists LLC</span></h3><div><span><i></i> Remote</span>        </div><div>            <h5><b><strong>ABOUT US:</strong></b></h5><p>Bookkeeping for Dentists LLC is a blend of custom software and super passionate people. We are a very tech savvy and modern bookkeeping firm specializing in dental practice benchmarking. We have over 100 clients whom we love and our #1 priority each day is the quality in our work. To achieve high quality, we utilize technology to the fullest and find ways to make every bookkeeping task as streamlined and automated as possible so we can focus on quality in our work and our relationships with clients.</p><h5><b><strong>POSITION WE NEED TO FILL:</strong></b></h5><p>With the immense growth this past year after developing our online web application, we need a personable Staff Accountant to assist with onboarding and cleaning up bookkeeping for new clients. Your primary function is to interface with potential and new clients as an onboarding accountant. You will be supporting them in the transition, answering bookkeeping related questions and helping new clients get started with us by gathering the items we need start, then you will be setting up and or cleaning-up their bookkeeping. We will train you in easy stages and taking new client calls will be the last stage, so don’t be nervous, you’ll be a pro by then.</p><h5><b><strong>ROOM TO GROW:</strong></b></h5><p>There is room for growth in this position. You could be our onboarding accountant forever, or you can later head into other roles as we quickly grow. The choice is yours.</p><h5><b><strong>SPECIFICS:</strong></b></h5><p>The position is 100% remote (work from home) because our entire team is also 100% remote. You will be working directly under the founder, 40 hours per week. Health insurance and 401k benefits are also provided.</p><h5><b><strong>IMPORTANT QUALIFICATIONS (Read Carefully):</strong></b></h5><ul><li>You MUST be SUPER personable with both email and phone calls.</li><li>You must be an excellent conversationalist, professional, and upbeat attitude consistently.</li><li>You MUST have a college degree in accounting (4 years)</li><li>You MUST have more than 2 years of public accounting (CPA Firm) experience</li><li>You must be fantastic with figuring out online/desktop software applications.</li><li>You must have a quiet room with a door, computer, and high-speed internet</li></ul><h5><b><strong>ESSENTIAL FUNCTIONS:</strong></b></h5><ul><li>Right-hand person to the founder with a mission to efficiently support new clients onboarding for bookkeeping services.</li><li>Take the phone calls scheduled with potential clients (all inbound and scheduled, never out-bound) and help them get started</li><li>Gather “getting started” items needed from new clients</li><li>Ability to clean up disastrous bookkeeping or start books from scratch for new clients</li><li>Light sales/marketing tasks</li></ul><h5><strong>BONUS FUNCTIONS:&nbsp;(if you are an impressive candidate)</strong></h5><ul><li>Marking/sales support</li><li>Streamline onboarding processes (find bottlenecks and develop solutions)</li><li>Develop client relationships</li></ul><h5><b><strong>SOFTWARE APPLICATIONS YOU SHOULD KNOW:</strong></b></h5><ul><li>QuickBooks Online (You will use this daily)</li><li>QuickBooks Desktop (we don’t use desktop often)</li><li>Microsoft Office (We use Office 365)</li></ul><h5><b><strong>YOU WON’T BE DOING ANY OF THE FOLLOWING (below):</strong></b></h5><ul><li>No Taxes… seriously, none.</li><li>A/R: we don’t do A/R or collections</li><li>Bill paying: we don’t offer any bill paying or check writing for our clients</li><li>Payroll: we don’t do payroll, but we assist clients by answering payroll questions and reconciling transactions to payroll reports.</li></ul><h5><b><strong>WHAT TO SEND US:</strong></b></h5><p>Please send a resume with cover letter. The cover letter should not be a generic cover letter you send everyone. Make it specific to the job, and explain why you’d be the right candidate. Be yourself.</p><p><strong>Apply to:</strong> careers@bookkeepingfordentists.com</p><h5><b><strong>BONUS:</strong></b></h5><p>We suggest creating a LinkedIn profile if you don’t have one. We give significant points for LinkedIn</p><p>Location: <strong>US Locations Only</strong></p>        </div><div>        <a href='mailto:careers@bookkeepingfordentists.com?subject=Application%20via%20Staff%20Accountant%20%2F%20Bookkeeper%20listing%20on%20https%3A%2F%2Fremote.co' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "4yXO-UHsQNCLMFtc6EkBYQ",
    "url": "https://remote.co/job/international-finance-associate-2/",
    "title": "International Finance Associate",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Shield GEO",
      "sameAs": "https://shield-geo.breezy.hr/p/140fe3fe0223-international-finance-associate-startup-remote-work-for-graduates?source=remote.co"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 15, 2019 4:14:18 PM",
    "validThrough": "Aug 22, 2019 4:14:18 PM",
    "crawled": "Aug 15, 2019 5:08:30 PM",
    "content": "<h3>International Finance Associate at <span>Shield GEO</span></h3><div><span><i></i> Remote</span>         | <span> International </span></div><div>            <h5><strong>Finance Associate</strong></h5><p>Are you passionate about International Business, looking for flexibility in your career and craving creative freedom?</p><p>Then come join our team! We are looking for team-oriented, resourceful and self-motivated candidates.</p><h5><strong>Job Purpose: Finance Associate</strong></h5><p>Shield GEO provides outsourced employment and payroll for hundreds of employees in over 60 countries. Our Finance team is the engine that makes sure all our GEO employees get paid on time every month. They create invoices, process payments, generate payslips and resolve issues. The team collaborates closely with colleagues in Global Mobility, Subject Matter Experts and Implementation to ensure our clients have a great experience.</p><p>This is an administration heavy role as you’ll be creating many invoices and payslips every month. You’ll also be helping our internal teams with any questions they may have around international tax, payroll and finance. You’ll have plenty of support from our operational teams, systems and technology platform.</p><p>You will have the opportunity to work remotely and with flexible hours. You’ll also have the opportunity to advance your career in a young, growing company.</p><h5><strong>Working with Shield</strong></h5><p>If you are excited by the thought of playing an active role in a company that provides opportunities to create and innovate, you’re at the right place.</p><p>We’re a remote-friendly company with employees all around the world. We don’t want to be limited by location and are open to hiring anyone from anywhere – as long as it’s a great fit for us both. Before we get to know you, you might like to get an idea of who we are so you can decide if you want to be a part of what we’re about.</p><p>Every person is unique. At Shield GEO, we encourage an inclusive culture that embraces each individual’s differences. We believe that diversity of thought and experience is vital to generating creative ideas, developing effective strategies and making better decisions.</p><p>When hiring we do not discriminate by any unlawful means including, but not limited to, race, color, religion, gender, gender identity or expression, sexual orientation, national origin, disability, age or veteran status.</p><p>We can’t quite show you what it’s like to work with us but you can hear from our employees themselves. Here’re some articles written by our&nbsp;<a href='https://www.linkedin.com/feed/update/urn:li:activity:6323671460300890112' rel='nofollow'>Co-Founder,</a>&nbsp;<a href='https://www.linkedin.com/feed/update/urn:li:activity:6337257974012137472/' rel='nofollow'>Customer Success Manager&nbsp;</a>and&nbsp;<a href='https://medium.com/@sujah/heres-how-hiring-remote-workers-helped-our-company-culture-c797272677e1' rel='nofollow'>Digital Marketing Manager.</a></p><ul><li><a href='http://shieldgeo.com/about/our-policies/' rel='nofollow'>Working remotely and flexibly with Shield Geo</a></li><li><a href='http://shieldgeo.com/about/our-policies/#leave-policy' rel='nofollow'>Leave policy</a></li><li><a href='http://shieldgeo.com/about/our-policies/#work-equipment-policy' rel='nofollow'>Work equipment policy</a></li><li><a href='https://shieldgeo.com/about/our-policies/#workplace-diversity-policy' rel='nofollow'>Workplace Diversity policy</a></li></ul><h5><strong>Do you share our values?</strong></h5><p>Our 4 values are integral to who we are. Our company culture is constantly evolving, every person who joins us adds something unique to our culture. But our values are shared by all Shield GEO employees. Do these values resonate with you?</p><h5><strong>Grow</strong></h5><p>We believe that personal growth and company growth go hand in hand. We look to foster our own growth and help grow the company. Every day is an opportunity to face a new challenge and get a little better. In our world of international employment it is impossible to know all the answers. Instead of trying to know everything, we focus on knowing how to solve problems. When mistakes happen we know it’s all part of the learning curve and we seek feedback to help us improve. We keep an eye on the big picture so we can identify improvements to processes and systems. As the problems become larger and more complex, it means that we’ll need more flexible and agile minds to come up with solutions.</p><h5><strong>Own It</strong></h5><p>We are self-motivated and love to see tasks to completion. Our managers and team mates are often in different time zones, and that’s ok! We aren’t afraid to step up when things get a little tough. We don’t like to micro-manage or&nbsp;be&nbsp;micromanaged. We trust our team mates to carry out their part of the process. We are responsible for our own workload and making sure we get our most important things done each day. If we get stuck we proactively seek help. And we show our reliability and accountability by keeping our systems updated. This also means our results can speak for themselves.</p><h5><strong>Do The Right Thing</strong></h5><p>Our clients trust us with compliance on their most important asset – their employees. This is a big responsibility! Doing the right thing means often times we choose a harder path and see it through to the end. It means we are open with our colleagues, clients and suppliers about bad news just the same as we share good news. And sometimes doing the right thing means we have to make decisions that will upset the very person we are trying to help. It’s a high standard but we stand by this very strongly. Doing the right thing also means considering how our actions impact those around us.</p><h5><strong>Be Human</strong></h5><p>We are a service business and helping people is at the core of everything we do. We pride ourselves on how we interact with colleagues, service providers and clients. We recognize that in all areas we’re dealing with real humans.<br>We know that working remotely and dealing with such a mix of people around the world is challenging. We know that if we are having trouble understanding someone, they are also struggling to understand us. Empathy is fundamental to helping us discover what people mean and how they are feeling. To avoid misinterpretation we assume best intent in others.<br>Because so much of our communication is written and asynchronous, we default to&nbsp;<em>over-communication</em>. This means we give extra details because we don’t leave people guessing. We make sure our words are clear and easy to understand. And we are kind to our fellow humans.</p><h5><strong>Your Background</strong></h5><ul><li>At least two to three years’ experience within Finance</li><li>International tax or payroll experience strongly preferred. It will be helpful if you are familiar with concepts like employer social security, foreign exchange, gross ups and expense reimbursements.</li><li>Comfortable with technology. We are mostly remote and that means we rely on a bunch of applications to keep connected. That means video conferences (Zoom), chat and messaging (Slack, Skype and Salesforce Chatter), shared documents (Dropbox). You’ll likely be working by yourself during parts of your day without access to tech support.</li><li>Experience with Salesforce or Xero is helpful but not essential.</li></ul><h5><strong>Essential Characteristics of this role</strong></h5><ul><li>Excellent written and verbal communication skills and the ability to absorb information quickly.</li><li>Able to prioritize effectively and work autonomously while coordinating with an international team.</li><li>Exceptional attention to detail and maintaining accurate records.</li><li>Ideally located between UTC+3 and UTC+8 time zones</li><li>Some flexibility in working hours. We discourage overtime work and you will only be expected to work a standard number of hours each week. But we have clients and colleagues all over the world so sometimes you will need to be on calls in the morning or evening.</li><li>Request invoices from our providers located around the world</li><li>Create client invoices to cover the monthly payroll cost for each GEO employee</li><li>Request payslips from our providers around the work</li><li>Record and check payroll outputs within our systems to share with our clients</li><li>Record incoming payments and setup ongoing payments</li><li>Help to manage the team Accounts mailbox</li><li>Keep an accurate record of information in our internal systems by the process due dates</li><li>Check invoices for accuracy before sending to your clients</li></ul><h5><strong>Responsibilities</strong></h5><h6>Payroll and Invoicing</h6><h6>Process Improvement and Projects</h6><p>Everyone at Shield gets involved in projects. These can range from a simple creation of a template to speed up a task through to creating complex automations which eliminate hours of admin work.</p><ul><li>Assist the project team and other internal resources with recommending and implementing process and system improvements.</li><li>Act as a superuser in project teams</li><li>Help train other users when rolling out project solutions</li><li>Keep internal systems updated with progress on all core tasks</li><li>Weekly summary reporting</li><li>Ensure accuracy of all invoicing, payslip and payment data is entered in our internal CRM</li></ul><h6>Reporting</h6><h5><strong>Next Steps</strong></h5><p>If you like what you’re read so far, this is a fantastic opportunity to join a global team committed to service. We’d really like to hear from you! Please keep your cover letter under 250 words and share with us what achievement you’re most proud of.</p><p>Be sure to submit your application quickly, as applications will close Thursday, 22 August, 11:59pm AoE!</p>        </div><div>        <a href='https://shield-geo.breezy.hr/p/140fe3fe0223-international-finance-associate-startup-remote-work-for-graduates?source=remote.co' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "6hB5rzfvTeel2mCq95tUTg",
    "url": "https://jobmote.com/job/62043/14k-per-month-work-at-home-financial-services/",
    "title": "$14K+ per month - Work At Home - Financial Services",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Google",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 15, 2019 12:21:16 PM",
    "validThrough": "Aug 18, 2019 12:21:16 PM",
    "crawled": "Aug 15, 2019 5:06:26 PM",
    "content": "<div>Salary 100% Commission, <p><strong>This a realistic 6-figure plus career opportunity</strong> for a highly motivated individual who is willing to follow a <strong>PROVEN SYSTEM</strong> and put in the work<strong>. </strong><br><br>Our parent organization paid out <strong>$985 Million </strong>in commissions in 2016,<strong> </strong>and they intend to<strong> </strong>pay out <strong>$4 Billion in 2020</strong>. <br><br>We are taking t<strong>he most successful business model </strong>in the Financial Services industry into a completely virtual environment with solid backing from one of the strongest and best known companies in America.<br><br><br><strong>We are seeking experienced sales &amp; recruiting pros as well as sales trainees.</strong><br><br>You bring the skills, attitudes, and habits of success... We teach you the details. OK to start Part Time.</p><p><br>----------------------------------------------------------------------------------------------------------------------------------------<br>If you would like to learn more, <strong>your NEXT STEP is to watch our intro video.</strong><br><br>If you like what you see on the video, then click the link to request for an initial phone interview<br>to get your questions answered and to see if we're a match.</p><p>---------------------------------------------------------------------------------------------------------------------------------------------</p><p><br><strong>WORK FROM ANYWHERE... </strong>We do everything online: Live training 4 times weekly via livestream<br>presentations, recorded training 24/7 on video, and our client presentations are done via private web conferences<br>using screen sharing technology.<br><br><strong>DO BUSINESS NATIONWIDE</strong> ... This virtual model eliminates all the wasted drive time and<br>no more boring office meetings... you can get a lot more done in a lot less time and you can expand<br>your territory to the entire United States!<br><br><br>Our system enables individuals new to the industry to earn great income as they learn the business,<br>and it enables seasoned industry professionals to expand their business from their local home town<br>to the entire country, and <strong>build a nationwide \\&quot;virtual agency\\&quot;.</strong><br><br><br>This is a unique, lucrative, dynamic opportunity to<strong> take back control of your life and of your financial destiny.</strong><br><br>Set your own hours. <strong>We pay for RESULTS, not attendance</strong>... so if you're looking for a job,<br>this is not for you...but if you're looking for a <strong>SYSTEM </strong>that can allow you to get to a level of income<br>that just has not been possible before, then we might be a match because<strong>...<br><br>We don't punish success, we throw money at it.</strong><br><br><br><strong>What we offer...</strong><br><br>1. <strong>NO LIMITS on your income... be paid what you're really worth.</strong><br>2. Commission advances, overrides, and bonuses <strong>paid twice weekly</strong><br>3. Great quality of life.. work from anywhere<br>4 .<strong> Flexible hours / Time Freedom</strong>... you're the boss<br>5 . Fun, supportive, and positive team culture<br>6. A marketing position that doesn't require any selling<br>7. <strong>Proven SYSTEM</strong> that that produced $732 million in commissions &amp; bonuses in 2015<br>8. Thorough training both live and recorded. Personal mentoring.<br>9. Company wide recognition and bonuses for significant achievement<br>10. Company paid celebrations at beautiful destinations for top producers<br>11. Leadership that cares about your success<br>12. <strong>Leveraged and residual income</strong> over time and <strong>ability to earn equity</strong><br><br>Most importantly, <strong>an opportunity to make a real difference</strong> in people's lives while you<br>escape the 9-5 rat race and <strong>take back control of your life.</strong><br><br><br><strong>What we DON'T do...</strong><br><br>1. No cold calling or door-to-door<br>2. No evening or weekend appointments away from home<br>3. No wasting time fighting traffic &amp; No boring office meetings<br>4. No dress code<br>5. No quotas or minimums except those you set for yourself<br>6. No micro-managing<br>7. No corporate favoritism. Promotions based on results, not politics.<br><br><br><strong>Who We Are Looking For...</strong><br><br>Our ideal candidate is a self-motivated winner who is HUNGRY and just looking<br>for <strong>the right opportunity, the right team, and the right SYSTEM.</strong></p><p>We are looking for self-motivated achievers who are looking for the<strong> freedom and flexibility</strong><br>to work on your own schedule from a virtual office in a REAL business of your own, with one<br>of the strongest companies in the industry.<br><br>Must have strong communication and \\&quot;people skills\\&quot;, a great attitude, HIGH INTEGRITY,<br>enjoy helping people, and be willing to follow our proven system and put in the time and<br>work that we all know is required in order to achieve extraordinary success.<br><br>If that's you, then lets talk.<br><br><br><strong>Part time OK</strong> if you can put in at least 12 hours/week minimum in income producing activity<br>plus 3+ hours per week of online training.<br><br><strong>This is a 1099 independent contractor position. Income is based on results. </strong>Life insurance license<br>is required, which is easy to get. OK to start while working on your pre-license education.</p><p><br><br><strong>YOUR NEXT STEP...</strong><br><br>If you would like to learn more, <strong>your NEXT STEP is to watch our intro video.</strong><br><br>If you like what you see on the video, then click the link to request for an initial phone interview<br>to get your questions answered and to see if we're a match.<br><br><br><strong>TO WATCH THE VIDEO...</strong></p><ol><li>Click the green 'APPLY NOW' button on the lower right side of this page</li><li>Fill in the brief info form and click SUBMIT</li><li>On the next page, click the link to get to our website with the video</li></ol><p><br>We look forward to meeting you on the phone very soon if you would like to discuss the possibilities.<br><br><br>DOUG JONES<br>Senior Vice President</p><p> </p><p>P.S. <strong>As you watch the video, take notes and jot down your questions,</strong> then click the NEXT<br> button below the video to request and initial phone interview so we can get them answered<br> for you and see if we are a match.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "jDd2v2HKRWiGnRBB39y9xQ",
    "url": "https://remote.co/job/international-finance-associate/",
    "title": "International Finance Associate",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Shield GEO",
      "sameAs": "https://shieldgeo.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 14, 2019 4:35:52 PM",
    "validThrough": "Aug 21, 2019 4:35:52 PM",
    "crawled": "Aug 14, 2019 5:07:19 PM",
    "content": "<h3>International Finance Associate at <span>Shield GEO</span></h3><div><span><i></i> Remote</span>         | <span> International </span></div><div>            <ul><li><strong>Remote Worldwide</strong></li><li><strong>Full-Time</strong></li><li><strong>Finance</strong></li></ul><p><strong>Finance Associate</strong></p><p>Are you passionate about International Business, looking for flexibility in your career and craving creative freedom?</p><p>Then come join our team! We are looking for team-oriented, resourceful and self-motivated candidates.</p><p><strong>Job Purpose: Finance Associate</strong></p><p>Shield GEO provides outsourced employment and payroll for hundreds of employees in over 60 countries. Our Finance team is the engine that makes sure all our GEO employees get paid on time every month. They create invoices, process payments, generate payslips and resolve issues. The team collaborates closely with colleagues in Global Mobility, Subject Matter Experts and Implementation to ensure our clients have a great experience.</p><p>This is an administration heavy role as you’ll be creating many invoices and payslips every month. You’ll also be helping our internal teams with any questions they may have around international tax, payroll and finance. You’ll have plenty of support from our operational teams, systems and technology platform.</p><p><strong>You will have the opportunity to work remotely and with flexible hours.</strong>&nbsp;You’ll also have the opportunity to advance your career in a young, growing company.</p><p><strong>Working with Shield</strong></p><p>If you are excited by the thought of playing an active role in a company that provides opportunities to create and innovate, you’re at the right place.</p><p>We’re a remote-friendly company with employees all around the world. We don’t want to be limited by location and are open to hiring anyone from anywhere as long as it’s a great fit for us both. Before we get to know you, you might like to get an idea of who we are so you can decide if you want to be a part of what we’re about.</p><p>Every person is unique. At Shield GEO, we encourage an inclusive culture that embraces each individual’s differences. We believe that diversity of thought and experience is vital to generating creative ideas, developing effective strategies and making better decisions.</p><p>When hiring we do not discriminate by any unlawful means including, but not limited to, race, color, religion, gender, gender identity or expression, sexual orientation, national origin, disability, age or veteran status.</p><p><strong>Do you share our values?</strong></p><p>Our 4 values are integral to who we are. Our company culture is constantly evolving, every person who joins us adds something unique to our culture. But our values are shared by all Shield GEO employees. Do these values resonate with you?</p><p><strong>Grow</strong></p><p>We believe that personal growth and company growth go hand in hand. We look to foster our own growth and help grow the company. Every day is an opportunity to face a new challenge and get a little better. In our world of international employment it is impossible to know all the answers. Instead of trying to know everything, we focus on knowing how to solve problems. When mistakes happen we know it’s all part of the learning curve and we seek feedback to help us improve. We keep an eye on the big picture so we can identify improvements to processes and systems. As the problems become larger and more complex, it means that we’ll need more flexible and agile minds to come up with solutions.</p><p><strong>Own It</strong></p><p>We are self-motivated and love to see tasks to completion. Our managers and teammates are often in different time zones, and that’s ok! We aren’t afraid to step up when things get a little tough. We don’t like to micro-manage or&nbsp;<strong>be</strong>&nbsp;micromanaged. We trust our teammates to carry out their part of the process. We are responsible for our own workload and making sure we get our most important things done each day. If we get stuck we proactively seek help. And we show our reliability and accountability by keeping our systems updated. This also means our results can speak for themselves.</p><p><strong>Do The Right Thing</strong></p><p>Our clients trust us with compliance on their most important asset – their employees. This is a big responsibility! Doing the right thing means often times we choose a harder path and see it through to the end. It means we are open with our colleagues, clients and suppliers about bad news just the same as we share good news. And sometimes doing the right thing means we have to make decisions that will upset the very person we are trying to help. It’s a high standard but we stand by this very strongly. Doing the right thing also means considering how our actions impact those around us.</p><p><strong>Be Human</strong></p><p>We are a service business and helping people is at the core of everything we do. We pride ourselves on how we interact with colleagues, service providers and clients. We recognize that in all areas we’re dealing with real humans. We know that working remotely and dealing with such a mix of people around the world is challenging. We know that if we are having trouble understanding someone, they are also struggling to understand us. Empathy is fundamental to helping us discover what people mean and how they are feeling. To avoid misinterpretation we assume best intent in others. Because so much of our communication is written and asynchronous, we default to&nbsp;<em>over-communication</em>. This means we give extra details because we don’t leave people guessing. We make sure our words are clear and easy to understand. And we are kind to our fellow humans.</p><p><strong>Your Background</strong></p><ul><li>At least two to three years’ experience within Finance</li><li>International tax or payroll experience strongly preferred. It will be helpful if you are familiar with concepts like employer social security, foreign exchange, gross ups and expense reimbursements.</li><li>Comfortable with technology. We are mostly remote and that means we rely on a bunch of applications to keep connected. That means video conferences (Zoom), chat and messaging (Slack, Skype and Salesforce Chatter), shared documents (Dropbox). You’ll likely be working by yourself during parts of your day without access to tech support.</li><li>Experience with Salesforce or Xero is helpful but not essential.</li></ul><p><strong>Essential Characteristics of this role</strong></p><ul><li>Excellent written and verbal communication skills and the ability to absorb information quickly.</li><li>Able to prioritize effectively and work autonomously while coordinating with an international team.</li><li>Exceptional attention to detail and maintaining accurate records.</li><li>Ideally located between UTC+3 and UTC+8 time zones</li><li>Some flexibility in working hours. We discourage overtime work and you will only be expected to work a standard number of hours each week. But we have clients and colleagues all over the world so sometimes you will need to be on calls in the morning or evening.</li><li>Request invoices from our providers located around the world</li><li>Create client invoices to cover the monthly payroll cost for each GEO employee</li><li>Request payslips from our providers around the work</li><li>Record and check payroll outputs within our systems to share with our clients</li><li>Record incoming payments and setup ongoing payments</li><li>Help to manage the team Accounts mailbox</li><li>Keep an accurate record of information in our internal systems by the process due dates</li><li>Check invoices for accuracy before sending to your clients</li></ul><p><strong>Responsibilities</strong></p><p>Payroll and Invoicing Process Improvement and Projects</p><p>Everyone at Shield gets involved in projects. These can range from a simple creation of a template to speed up a task through to creating complex automations which eliminate hours of admin work.</p><ul><li>Assist the project team and other internal resources with recommending and implementing process and system improvements.</li><li>Act as a superuser in project teams</li><li>Help train other users when rolling out project solutions</li><li>Keep internal systems updated with progress on all core tasks</li><li>Weekly summary reporting</li><li>Ensure accuracy of all invoicing, payslip and payment data is entered in our internal CRM</li><li>Reporting</li></ul>        </div><div>        <a href='https://shield-geo.breezy.hr/p/140fe3fe0223?source=remote.co' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ojJbdA9EQ_SIR2-HBFjzbw",
    "url": "http://workinstartups.com/job-board/job/83372/business-support-at-followapp/",
    "title": "Business Support",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "FollowApp",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 13, 2019 2:09:30 PM",
    "validThrough": "Aug 20, 2019 2:09:30 PM",
    "crawled": "Aug 13, 2019 4:06:31 PM",
    "content": "<h4><strong>Job Description</strong></h4><br /><p><strong>Job Listing</strong></p><br /><p>Business Support for an expanding healthcare technology startup (English &amp; Spanish required)&nbsp;</p><br /><p><strong>About FollowApp Care</strong></p><br /><p>We are a healthcare technology company specialising in AI-driven patient communication. Our current customers are healthcare providers in the Australian, American, and European regions.</p><br /><p>We are a small team based in London with some remote team members currently. We have plans to expand very quickly with the help of several more contracts underway and plans for investment.</p><br /><p><strong>The Position:</strong></p><br /><p>This is a great role for those who are looking to gain experience in a variety of business functions across a technology startup. You will be mainly working alongside and supporting the Sales, Customer Success, and Product Teams.&nbsp;</p><br /><p><strong>Key Tasks You Will be Involved With Are:</strong></p><br /><ul><br /><li>Working alongside Customer Success, Sales, and Product for client relationship management and setting clients up for long term success&nbsp;</li><br /><li>Engaging in day-to-day communications with clients to ensure successful onboard, uptake and maintenance of our technology with our clients</li><br /><li>Coordination of different internal teams and administrative tasks</li><br /><li>Proactively identifying process improvements</li><br /><li>Strategically leverage customer feedback to influence the product roadmap</li><br /><li>Producing documentation&nbsp;</li><br /><li>Providing training to the users&nbsp;</li><br /><li>Any ad hoc tasks from Sales, Customer Success, and Product</li><br /></ul><br /><p><strong>Ideally You Are A Person Who:</strong></p><br /><ul><br /><li>Has a bachelor degree</li><br /><li>Has proven experience in communication with clients (excellent verbal and written communication skills)</li><br /><li>Is ambitious and motivated&nbsp;</li><br /><li>Enjoys working in a startup environment</li><br /><li>Is tech-savvy and quick at understanding our technology, particularly healthcare technology</li><br /><li>Creative, resourceful, detail-oriented and highly organised (problem solver)</li><br /><li>Self-starter who thrives under ambiguity in a fast-paced, deadline oriented startup environment</li><br /><li>Has experience in PPT and documentation design</li><br /></ul><br /><p><strong>The Location:</strong></p><br /><p>Located conveniently in East Central London, right by Liverpool St station, we are in a co-working space (WeWork) where unlimited coffees, biscuits, and beer are just some of the perks!&nbsp;</p><br /><p>This will be a position available from September, 2019.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "aP3_4Z-vQQKbh0-daQu7-Q",
    "url": "https://jobmote.com/job/60469/telecommute-insurance-national-accounts-director/",
    "title": "Telecommute insurance national accounts director",
    "tags": [
      "DBG:surround``3W(open, telecommut)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/finacc",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "VirtualVocations",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 12, 2019 10:41:21 AM",
    "validThrough": "Aug 15, 2019 10:41:21 AM",
    "crawled": "Aug 12, 2019 3:06:24 PM",
    "content": "<div>An insurance company needs applicants for an opening for a Telecommute Insurance National Accounts Director. Must be able to: Develop, contract, and execute</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
