{
 "items": [
  {
    "id": "2PFKBvffRBywiorJjKZBcg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/172983/senior-test-automation-engineer-scrapinghub?a=W0Ou0ojYvKg",
    "title": "Senior Test Automation Engineer at Scrapinghub  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>About the Job:</strong></p><p>QA is an important function within Scrapinghub. The QA team works to ensure that the quality and usability of the data scraped by our web scrapers meets and exceeds the expectations of our enterprise clients.</p><p><em>Are you passionate about data and data quality and integrity?</em></p><p><em>Do you enjoy using Python to automate testing, analyze data, and speed up manual processes?</em></p><p><em>Are you highly customer-focused with excellent attention to detail?</em></p><p>Due to growing business and the need for ever more sophisticated QA, we are looking for a talented Senior Test Automation Engineer &nbsp;with substantial experience in Python to join our team.</p><p>As a Scrapinghub Engineer, you will build automated test frameworks and ad hoc test scripts to assist in the verification and validation of data quality.</p><p><strong>Due to business requirements, candidates must be based in a European or U.S. time zone.</strong></p><p><strong>Job Responsibilities:</strong></p><ul><ul><li>Understand customer web scraping and data requirements and map these to automated tests.</li><li>Analyze gaps in test coverage and bridge gaps with appropriate automated solutions (full-blown automated test frameworks and ad-hoc scripts) in Python.</li><li>Work under minimal supervision and collaborate effectively with Head of QA, Project Managers, and Developers to realize your test automation deliverables</li><li>Draw conclusions about data quality by producing (using Python or other technologies) basic descriptive statistics, summaries, and visualisations.</li><li>Leverage Scrapinghub proprietary Continuous Integration systems (or build your own) to ensure that automated tests get executed for each spider execution and data delivery.</li><li>Beyond Python-based test automation, proactively suggest and take ownership of improvements to QA processes and methodologies by employing other technologies and tools</li></ul></ul><p><strong>Required Skills:</strong></p><ul><ul><li>BS degree in Computer Science, Engineering or equivalent.</li><li>Demonstrable Python programming knowledge and experience, minimum of 3 years (please provide code samples in your application, via a link to GitHub or other publicly-accessible service).</li><li>Experience in developing automated test frameworks in Python.</li><li>Minimum 5 years in a Software Test, Software QA, or Software Development role, in Agile, fast-paced environment and projects.</li><li>You have been the lead Test Automation Engineer (or Team Lead with hands-on automation responsibilities) in at least one role or in at least one high importance project in one of your previous roles.</li><li>Solid grasp of web technologies and protocols (HTML, XPath, JSON, HTTP, CSS etc.); experience in developing tests against HTTP/REST APIs.</li><li>Strong knowledge of software QA methodologies, tools, and processes.</li><li>Ability to formulate complex SQL queries (or experience in emulating these in Python with libraries like Pandas, PySpark etc)</li><li>Excellent &nbsp;level of written and spoken English; confident communicator; able to communicate on both technical and non-technical levels with various stakeholders on all matters of QA; adept at training non-technical colleagues on test automation execution</li></ul></ul><p><strong>Desired Skills:</strong></p><ul><ul><li>Knowledge and experience of Scrapy and other Python-based scraping frameworks a distinct advantage.</li><li>Prior experience in a Data QA role (where the focus was on verifying data quality, rather than testing application functionality).</li><li>Interest in and flair for Data Science concepts as they pertain to data analysis and data validation (machine learning, inferential statistics etc.); if you have ideas, mention them in your application.</li><li>Knowledge of JavaScript.</li><li>Knowledge of and experience in other technologies that support a modern cloud-based software service (Linux, AWS, Docker, Spark, Kafka etc.)</li><li>Previous remote working experience.</li></ul></ul>                    </div>                            <h2>                About Scrapinghub            </h2>            <div><p>&nbsp;Scrapinghub is a fast growing and diverse technology business turning web content into useful data with a cloud-based web crawling platform, off-the-shelf datasets, and turn-key web scraping services.</p><p>We’re a globally distributed team of 120 Shubbers working from over 30 countries who are passionate about scraping, web crawling, and data science.</p><p>As a new Shubber, you will:</p><p>Become part of a self-motivated, progressive, multi-cultural team.</p><p>Autonomy to make the role your own, supported by great people</p><p>Join a team with huge opportunity to make a difference</p><p>Have the freedom to work from&nbsp;<a href='http://blog.scrapinghub.com/2015/05/12/traveling-tips-for-remote-workers/' rel='nofollow'>wherever you want</a>.</p><p>Have the opportunity to go to conferences and meet with the team from across the globe.</p><p>Get the chance to work with cutting-edge open source technologies and tools.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible working hours                            </div>                            <div>                                 Remote working                            </div>                            <div>                                 Paid time off                            </div>                            <div>                                 Paid open source work                            </div>                            <div>                                 Global team meet ups                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 24, 2018 10:44:01 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/qa",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "E_mA5X8bSJe2T6BjvRgBJw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/medic-mobile-software-test-engineer",
    "title": "Medic Mobile : Software Test Engineer",
    "content": "<div>  <div>    <h2>Software Test Engineer</h2>      <h4>Posted Apr 24</h4>    <h3>      <span>Medic Mobile </span><br>      <span>Headquarters: San Francisco</span><br>        <a href='https://medicmobile.org/careers/software-test-engineer' rel='nofollow'>https://medicmobile.org/careers/software-test-engineer</a>      <br>      <a rel='nofollow'>View all Medic Mobile  jobs →</a>    </h3>  </div>    </div>  <div>    <div>We’re seeking a talented, dedicated, and passionate software test engineer to join our distributed product team.</div><div><br></div><div>Medic Mobile designs, delivers, and supports world-class software for health workers who provide care in the hardest-to-reach communities. Our software is free, open-source, and deployed at scale in the last mile of healthcare. Evidence-based workflows come together in the software to support health workers and families, helping to ensure safe deliveries, track outbreaks, treat illnesses at the doorstep, communicate about emergencies, and more. We envision a more just world in which health workers are supported as they provide care for their neighbors, universal health coverage is a reality, and health is secured as a human right.</div><div><br></div><div>By the end of 2017, Medic Mobile was supporting a network of more than 20,000 frontline health workers. In our next phase of growth, we are scaling through large partnerships and reaching out to health organizations with minimal resources. We aim to support health workers serving 100 million people between 2017 and 2021.</div><div><br></div><div>Our global team supports more than 60 partners across 23 countries, with offices in San Francisco, Nairobi, and Kathmandu. Medic Mobile brings a wide range of experience and creative solutions to complex problems, building and delivering technology that works for people who have been marginalized. We are searching for a Software Test Engineer to contribute to our team, mission, and impact.</div><div><br></div><div><b>You:</b></div><div>●<span>    </span>Can write browser automation tests for web applications ideally with angular and protractor</div><div>●<span>    </span>Are detail oriented and enjoy finding pesky bugs</div><div>●<span>    </span>Have built a test framework from scratch</div><div>●<span>    </span>Are comfortable in a UNIX-like environment</div><div>●<span>    </span>Are familiar with web technologies: HTTP, SSL/TLS, REST, JSON, HTML5, JavaScript</div><div>●<span>    </span>Have experience with regression, and exploratory testing</div><div>●<span>    </span>Have some experience with performance and scalability testing</div><div>●<span>    </span>Thrive working as part of a distributed team with a flexible schedule</div><div>●<span>    </span>Have coursework or experience equivalent to an undergraduate computer science or mathematics degree</div><div>●<span>    </span>Enjoy working remotely with opportunities to travel to project sites (e.g. India, Uganda, Senegal) and work with teammates (e.g. San Francisco, Nepal, Kenya)</div><div>●<span>    </span>Want to help build software that improves lives in a real and significant way</div><div><br></div><div><b>Position Details</b></div><div>The Software Test Engineer works closely with the Director of Engineering, Chief Architect, Product Manager, and the development team to ensure quality assurance of all of Medic Mobile’s mobile health software tools and deployments.</div><div><br></div><div><b>Tests for deployments: 50%</b></div><div>●<span>    </span>Work with project developers to elicit requirements for tests that can improve reliability of configurations</div><div>●<span>    </span>Build and support a test framework for configurations of Medic Mobile tools</div><div>●<span>    </span>Build and maintain tests for the default configuration of the core application</div><div>●<span>    </span>Train and support project developers using test frameworks to ensure high quality deployments of Medic Mobile tools</div><div><br></div><div><b>Tests for core tools: 40%</b></div><div>●<span>    </span>Create test plans for web and Android applications</div><div>●<span>    </span>Build test automation where possible, and performing manual tests where needed.</div><div>●<span>    </span>Learn new programming languages, platforms, toolkits, libraries, tools, and application development paradigms as necessary</div><div>●<span>    </span>Ensure that all software tools are ready for deployment</div><div><br></div><div><b>Planning: 10%</b></div><div>●<span>    </span>Work with the Chief Architect and development team to guide platform development and technical strategy with regards to testing</div><div>●<span>    </span>Work with development team to improve test procedure within the development process</div><div>●<span>    </span>Work effectively, independently, and efficiently with peers, and other product stakeholders.</div><div>●<span>    </span>Participate in weekly product team calls, and daily stand meetings</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>If this role inspires you, please get in touch. Send through a copy of your current CV, along with a cover letter, to Marc Abbyad at <a href='mailto:jobs@medicmobile.org' rel='nofollow'>jobs@medicmobile.org</a> with the subject “Software Test Engineer”. Interviews will be scheduled on a rolling basis, and we aim to bring a new team member on board soon!</p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 24, 2018 8:31:18 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "JQIOBN6TRNiH97lc1Iq5zA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/devexi-qa-engineer",
    "title": "Devexi: QA Engineer",
    "content": "<div>  <div>    <h2>QA Engineer</h2>      <h4>Posted Apr 18</h4>    <h3>      <span>Devexi</span><br>      <span>Headquarters: Fairfax, VA</span><br><br>      <a rel='nofollow'>View all Devexi jobs →</a>    </h3>  </div></div>  <div>    <div><span><h2><span>QA Engineer</span></h2><br></span></div><div><span>DEVEXI is looking for a QA Engineer to join our team. </span></div><div><br></div><div><span>DEVEXI is an early stage healthcare analytics startup building a powerful, sophisticated yet intuitive longitudinal research data platform linking medical and dental data to enable researchers to connect the dots between diagnoses, treatments, prescribed drugs, exposures and short and long-term health outcomes – for groundbreaking, longitudinal studies never before possible.</span></div><div><br></div><div><span>DEVEXI will enable health and medical researchers, universities, teaching hospitals, insurance payers, government health agencies and pharmaceutical companies to improve quality of healthcare delivery, identify best practices and increase successful, cost-effective outcomes.</span><span></span></div><div><br></div><div><h3><span>Culture Fit</span></h3></div><ul><li><span>Able to act as the team goalie</span><br><br></li><li><span>Able to work effectively as part of a remote team</span><br><br></li><li><span>Be friendly</span><br><br></li><li><span>Be a self-starter</span><br><br></li><li><span>Be smart</span><br><br></li></ul><div><li>Able to assist users through a testing process</li></div><div><br></div><div><li>Able to prioritize and context switch when necessary to achieve the bigger vision</li></div><div><br></div><div><h3><span>Skills Required</span></h3></div><ul><li><span>Working knowledge and a solid understanding of:</span><br><br></li><li><span>Ticket workflow on a scrum development team (JIRA)</span><br><br></li><li><span>Git (Bitbucket)</span><br><br></li><li><span>RESTful web services &amp; SaaS</span><br><br></li><li><span>SQL</span><br><br></li><li><span>JSON</span><br><br></li><li><span>Responsive web design and cross-browser/device testing</span><br><br></li><li><span>Linux command line basics</span><br><br></li></ul><div><li>Direct, hands-on prior experience with:</li></div><div><br></div><ul><li><span>Reproducing defects that may occur with end users</span><br><br></li><li><span>Diagnose &amp; infer root causes where possible</span><br><br></li><li><span>Write tickets that are useful/actionable for developers</span><br><br></li></ul><div><li>User Story and Task verification</li></div><div><br></div><div><li>Test case creation and execution for a SaaS product</li></div><div><br></div><div><li>Data-oriented testing: compare &nbsp;results of queries made in the browser with data in the database</li></div><div><br></div><div><li>Excellent reading, writing and communications skills</li></div><div><br></div><ul><li><span>Able to explain a defect to the team in plain English</span><br><br></li><li><span>Elicit requirements clarifications from SMEs where needed</span></li></ul><div><br></div><div><span>Extra credit for:</span></div><div><br></div><ul><li><span>QA automation experience (selenium or alternatives)</span><br><br></li><li><span>Fluency in Java</span><br><br></li><li><span>Experience with AWS</span><br><br></li><li><span>Bachelor’s Degree in Computer Science or related field</span><br></li></ul><div><br></div><div><h3><span>Benefits</span></h3></div><ul><li><span>Involvement in big data health analytics to enable groundbreaking longitudinal research</span><br><br></li><li><span>Full-time remote work (1099 contract)</span><br><br></li><li><span>Excellent work/life balance</span><br><br></li><li><span>No travel required</span><br><br></li><li><span>Work with a quality team of professionals</span><br></li></ul><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please send resume, hourly rate, and availability to <a href='mailto:jobs%2Bqa@devexi.com' rel='nofollow'>jobs+qa@devexi.com</a>.  Must be a U.S. Citizen.</p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 19, 2018 12:50:47 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "JnEW7SrsSWqAgjF25pX9IQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-testers",
    "url": "http://workinstartups.com/job-board/job/68102/qa-engineer-at-monese/",
    "title": "QA Engineer",
    "content": "About Monese<br /><br />At Monese we believe that access to banking and financial services is a right that everybody should enjoy. We are on a mission to ensure that anyone in the world who needs a bank account can get one. By using leading edge technology via smartphones, we offer services that are easy to access, simple to use and cheap to run for anybody.<br /><br />Monese serves hundreds of thousands of customers in the UK and Europe, and we are adding new services on a regular basis.<br /><br />Our fast growing team is located in London, UK and Tallinn, Estonia. By working with us, you will be part of a carefully selected team who are great at what they do and share the belief in our mission of making banking available to everybody. We’re not just a start-up with an idea; we have a proven business model that is growing exponentially and generates strong revenues.<br /><br />About the role<br /><br />We’re looking for a talented and self-motivated QA engineer with experience in all phases of the software development lifecycle to join us on a permanent basis in our London office. You will be responsible for the design, implementation and execution of manual test solutions and supporting test engineering practices.<br /><br />So we are looking for a creative and curious person with hands-on mentality, who likes to figure out puzzles and understand the whole picture. We are very keen to take on board a QA engineer that does not shy away from responsibilities and takes great pride in delivering high quality work.<br /><br />Moreover, your responsibilities will include but are not limited to:<br /><br />* Planning and managing all phases of the quality assurance process<br />* Responsible for the design, implementation and execution of manual test solutions supporting test engineering practices<br />* Develop automation test scripts using the functional test cases<br />* Cross browser web testing<br />* Localisation and regression testing<br />* Identify, record, document and track bugs as well as run tests for all releases<br />* Updating team on open project statuses and testing activity around features<br /><br />We expect you to have:<br /><br />* Previous working experience as QA engineer and/or developer<br />* Experience with consumer facing mobile applications<br />* Education or a proven track record in software development<br />* A high level of proficiency in testing techniques such as exploratory testing<br />* Strong manual mobile app testing experience (experience testing on Android and iOS platform is an advantage)<br />* Up to date understanding of the latest developments in mobile application testing<br />* Ability to take charge of your time and prioritise problems to solve<br />* Good communication skills and the will to be part of our team<br />* Passion about building something truly meaningful in the financial sector<br />* Experience with Testrail or a similar test case management tool<br /><br />Benefits of working at Monese:<br /><br />* Ample opportunity to develop your career within Monese as you will be an important part of a fast-growing company<br />* A horizontal structure where everyone has a voice and makes a direct and valued contribution to building the best product possible<br />* International team of open-minded people in a nice office environment with plenty of perks, snacks and drinks<br />* Opportunity to travel between our offices and meet other teams as well<br />* Many fun team events, office parties and summer ‘weekend-getaway’ to spend some quality time with your colleagues<br />* In- and outdoors Moneser’s sports activities<br />* Flexible working schedule and possibility to work remotely<br />* Stock options and competitive salary<br /><br />Sounds like something for you?<br /><br />Then please send us your CV and cover letter. And be quick to apply, as we will start reviewing the applications and meeting the candidates immediately.",
    "urlFetchPending": false,
    "published": "Apr 18, 2018 8:59:43 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/qa",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "_GNYTO8HTGGN2emNYZiFYg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/172904/friendly-qa-engineer-with-strong-test-automation-swyfft?a=VZaDHVNs1I4",
    "title": "Friendly, QA engineer with strong test automation at Swyfft (Redmond, WA) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Insurance, Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>We need&nbsp;a QA Engineer with test automation skills</strong></p><p>We truly believe that hiring the best people and giving them the tools they need is the biggest key to success.&nbsp; We're currently building a small development team and looking for friendly, talented folks to join the team.&nbsp; We're well-funded and (we think) fun to work with.&nbsp; <br>A key part of moving fast is making sure our product meets a high quality bar. (People get very nervous if the company to which they're entrusting their financial future can't make their own website work right.)</p><p>We need a QA engineer who's comfortable at every part of the job: manual UI testing, black/white box acceptance testing, exploratory testing, test automation, and continuous integration. We've made a big investment in test automation, but we need to take that - and our quality bar in general - to the next level. Another way to put it: you need to be able to read and write code as well as you can write and execute test plans.</p><p>If you have a background in insurance that is a definite plus!</p><p>If you're interested, reach out!</p><p><strong>Skills &amp; Requirements</strong></p><p>Key personal traits:</p><ul><li>Friendly</li><li>Smart</li><li>Detail-oriented</li><li>Eager to learn</li><li>Fast</li><li>Communicative</li></ul><p>Key technologies:</p><ul><li>Jasmine/xUnit</li><li>Jenkins</li><li>SQL Server</li><li>JavaScript/TypeScript</li><li>Knockout/ReactJS</li><li>ASP.NET MVC/WebAPI</li><li>C#</li></ul>                    </div>                            <h2>                About Swyfft            </h2>            <div><p>Swyfft is a well-funded profitable startup that is disrupting the homeowners insurance industry. Unlike other insurer websites that require 10-15 minutes to fill out an application, Swyfft uses sophisticated analytics to offer potential customers a quote in less than 10 seconds and only requires them to enter their address.</p><p>The project is challenging as it requires implementing the Company's analytics into a real-time rating engine as well as seamless integration with many third party systems - and all in a system that can scale to providing tens of thousands of quotes per day.&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Any tech you need                            </div>                            <div>                                 Flexible work schedule                            </div>                            <div>                                 Remote Work                            </div>                            <div>                                 Solid Health Insurance                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 15, 2018 2:07:51 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH1/frontend",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet",
      "frontend"
    ]
  },
  {
    "id": "3kcwDxzMTFyoM4Zu1uLn3Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/112752/remote-automated-test-engineer-openings-selenium-surge?a=BOrbvuPoJyw",
    "title": "REMOTE Automated Test Engineer Openings - Selenium at Surge  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>SURGE is looking for smart, self-motivated, experienced, senior automated test engineers&nbsp;who enjoy the freedom of telecommuting and flexible schedules, to work as long-term, consistent&nbsp;(40 hrs/week) independent contractors (no W2)&nbsp;on a variety of software development projects.</p><p>Experience Required: Selenium (or similar), Java&nbsp; plus.</p><p>Only candidates located in Canada and/ or the US can be considered at this time. Sorry, No Visas.</p><p>Resume must include the tech stack under each job and if you have Angular experience, please include what version of Angular.</p><p>For immediate consideration, email resume and include your cell phone number and start date.</p>                    </div>                            <h2>                About Surge            </h2>            <div><p>Surge is&nbsp;a leading provider of custom web, cloud, mobile, digital, and desktop software development and consulting services to clients in every industry, from hot startups to Fortune 500 companies. Founded in 2007, and listed on the Inc. 5000 list of America's fastest growing companies for four straight years, the Surge team has successfully delivered hundreds of software products, apps, and solutions to its clients using a proven agile/scrum development process combined with an elite group of North American software professionals. Simply put, Surge offers America's best software engineers, on demand, at rates 30-50% less than the competition.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Great Pay                            </div>                            <div>                                 Choose Your Hours                            </div>                            <div>                                 Work From Home                            </div>                            <div>                                 Work With Happy People                            </div>                            <div>                                 Zero Commute                            </div>                            <div>                                 See Your Family More                            </div>                            <div>                                 Travel While You Work                            </div>                            <div>                                 Software Provided                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 15, 2018 2:07:51 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/qa",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "hv_XKP7gQ4qNjBvLJnrVUA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/164284/automation-qa-engineer-sdet-modus-create?a=T5W5U3LYGBO",
    "title": "Automation QA Engineer / SDET at Modus Create  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Are you ready to build great mobile and web-based applications and lead global teams with some of the brightest thought leaders, designers and technologists? &nbsp;</p><p>As our&nbsp;QA Automation Engineer, you are capable of working on a variety of development projects regardless of type and level of complexity. Whether you are on a project with no test framework or one with thousands of test cases already in place, you can provide complete and effective test strategies for the team.</p><p>This role may be performed from a remote location. The incumbent must be located within the United States.</p><p><strong>Great QA Engineers are capable of:</strong></p><ul><li>Pinpointing gaps in test coverage and developing plans to fill those gaps</li><li>Building upon what is available to help improve testing efforts</li><li>Understanding the complexity of test automation</li><li>Knowing which types of testing to incorporate during development</li><li>Providing feedback for existing test processes</li><li>Instilling confidence in the stability of an application</li><li>Handling multiple projects at any given time</li></ul><p>If that sounds like you and you have at least 2-5&nbsp;years of experience working in QA, we have a place for you.</p><p><strong>Your Duties</strong></p><ul><li>Implement automation test solutions based on project needs</li><li>Collaborate daily on a distributed, cross functional agile team</li><li>Develop test strategies and POCs for new projects</li><li>Train clients on new tools and systems</li><li>Mentor junior team members</li><li>Write blog posts on QA best practices</li></ul><p><strong>Required Experience</strong></p><ul><li>Designing test plans and processes for new products</li><li>Testing mobile, mobile web and desktop web-based applications</li><li>Automated functional testing with multiple testing frameworks such as Watir, WebdriverIO, or Codeception</li><li>Incorporating TDD or BDD practices and their associated frameworks like Jasmine, Mocha, or Cucumber. Experience with Cucumber is preferred</li><li>Working with Jenkins, Bamboo, CircleCI or comparable continuous integration systems</li><li>Using Javascript, PHP, Ruby, Python or other comparable languages (multiple languages preferred)</li><li>Working with JIRA or similar bug tracking system</li><li>Working in Agile and/or Kanban environments</li></ul><p><strong>Highly qualified candidates will have</strong></p><ul><li>Concise written and verbal communication skills for documenting bugs and test plans</li><li>Track record of active participation and contributions to the testing community (Stack Overflow, QA/ automation framework forums, Meetup groups, blogging, Twitter)</li><li>Familiarity with database systems, both SQL and NoSQL (For example, MySQL and MongoDB)</li><li>Prior experience with setting up and installing VMs</li><li>Grasp of the command line and scripting languages (like Bash and Powershell)</li><li>Firm understanding of application development and the testing pyramid (UI, Service, Unit)</li><li>Knowledge of utilizing Docker for testing</li><li>Experience with API testing</li><li>Previous experience working as a consultant</li></ul><p><strong>Let’s Talk about You</strong></p><p><strong>You value outcomes above all else:&nbsp;</strong>You have a proven track record shipping great mobile and web products. By understanding the big picture, you articulate strategy and vision with strong written and verbal communication.</p><p><strong>You Lead by Doing:&nbsp;</strong>You realize that the big picture is worthless without getting your hands dirty in the technical details for strategic and tactical problem solving. You understand the value of situational leadership and can adapt to the needs and strength of your team. &nbsp;</p><p><strong>You Love Work, Growth and Learning:&nbsp;</strong>You dream of working in a culture that values hard work, continued learning and innovation with a commitment to building amazing products for clients and their end users. You’ll stop learning when you are dead, and until then you desire to gain deeper knowledge in technology and business.</p><p><strong>Let’s Talk About Us</strong></p><p>Modus Create is a Product Studio offering consulting services and SaaS products for strategic planning, design and execution of web-based and mobile products. We work across multiple industries with Fortune 1000, ISVs, and startups to validate, plan and launch new products. Headquartered in Reston, VA, we are a global, bootstrapped team that has grown from 2 to 140+ people in 30+ countries in 7 years, committed to building the best product consulting firm on the planet. We offer a highly collaborative, autonomous and effective working environment. We love and believe in what we do. This is your chance to be part of building something great.</p><p><strong>Why Modus Create</strong></p><ul><li>Competitive compensation</li><li>Ability to work remotely / telecommute</li><li>Working side-by-side with thought leaders in emerging tech</li></ul><p><strong>Do you have what it takes to join the DC area's most awesome tech company? Let’s start a conversation.</strong></p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Company-provided, top notch hardware, software and services                            </div>                            <div>                                 Competitive compensation &amp; benefits                            </div>                            <div>                                 Ability to expense technical books                            </div>                            <div>                                 GitHub repos for your projects                            </div>                            <div>                                 A chance to get your personal projects sponsored                            </div>                            <div>                                 Travel if you like, stay at home if your don't                            </div>                            <div>                                 Assisted continuous self-development                            </div>                            <div>                                 Talk at meetups                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 15, 2018 2:07:51 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/qa",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "M-EP0ZNJSPeedy2CVOkE2A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/4968-penetration-tester-work-remote-australia",
    "title": "Penetration Tester - Work Remote - Australia",
    "content": "Penetration Tester - Work Remote - Australia - Jobmote<div><div><h2>Penetration Tester - Work Remote - Australia</h2><h5>HackLabs</h5></div></div><div><div><div><div></div></div><div><div><div><p>Job Description</p><p><strong>NOTE: DO NOT APPLY FOR THIS JOB UNLESS YOU ARE A PROFESSIONAL PENETRATION TESTER AND YOUR RESUME REFLECTS AT LEAST 5 YEARS EXPERIENCE IN A POSITION WHERE THIS WAS YOUR JOB.</strong></p><p>HackLabs is looking for motivated IT Security professionals with practical experience and expertise in Network, Web Application penetration testing, Mobile Apps, Social Engineering and SCADA plants in order to conduct engagements for our clients.</p><p>We test everything from startups to Government departments which include critical networks, complex web applications and systems.</p><p>You will ideally work with us in Sydney, Australia from our Manly Beach Labs, (located 2 min walk to beach). However there are remote working opportunities available as well. We have a laid-back office environment with no dress code. i.e. shorts, t-shirts, and flip flops (Thongs in OZ) are the norm.</p><p>On-site assessments are frequently performed in locations throughout Asia Pacific so you must be able to travel 2 weeks a month. Some months there will be no travel, others there could be three weeks, but we try our best to be considerate when scheduling our engagements to limit back to back travel weeks.</p><p><strong>Job Description:</strong></p><ul><li>Perform assessments of customer networks. Identify, Validate and exploit security vulnerabilities Then leverage those vulnerabilities and determine the impact to the organisation of said vulnerabilities by being able to clearly illustrate the business risk within the written report.</li><li>Clearly communicate vulnerability details and risk to customers, both verbally and in writing.</li><li>Be able to independently apply testing methods against a wide variety of targets including: Web Applications, databases, wireless networks, conducting social engineering attacks against customer user base, SCADA/ICS, routing infrastructure, VPN, Cloud, and more.</li></ul><p><strong>Must have:</strong></p><ul><li>8+ years experience in Information Security field</li></ul><p><strong>- 5 years experience conducting penetration testing</strong></p><ul><li><p>experience leading and managing pen testing engagements</p></li><li><p>excellent social skills</p></li><li><p>strong written and verbal communications skills</p></li></ul><p><strong>- the ability to pass a background check</strong></p><ul><li>the ability to pass a verbal technical interview</li></ul><p><strong>- the ability to pass a practical (hands-on) test</strong></p><ul><li><p>expertise in at least one Operating System</p></li><li><p>passion for technology and Information Security</p></li></ul><p><strong>- the ability to conduct a pen test without the use of a vulnerability scanner and exploit framework</strong></p><p><strong>Required Skills:</strong></p><ul><li><p>Deep knowledge of IP networking, Operating Systems, Information Security, security testing tools</p></li><li><p>Highly motivated individual with the ability to work independently and to think outside the box -- &quot;hacker&quot; mentality.</p></li><li><p>Expertise with common security tools; nmap, Nessus, Metasploit, Burp, Zap, CAIN, Linux Kali, etc.</p></li><li><p>Degrees and certifications are a bonus but not required provided you can demonstrate a high degree of technical skills</p></li><li><p>Punctuality</p></li><li><p>Humility - there is no room for the &quot;rock star&quot; hacker here</p></li></ul><p><strong>Please do NOT apply unless you have the &quot;must haves&quot;.</strong></p><p>Relocation allowance for the right individual.</p><p>Company DescriptionWe're a boutique Information Security firm that specialises in conducting security testing. HackLabs was founded by Industry veterans in 2009. HackLabs was acquired by PS&amp;C (ASX:PSZ) in December 2013 and operates as a wholly owned subsidiary.<br>HackLabs have had extensive experience in Penetration Testing (Approximately 20 years and over 2000 penetration tests between them). HackLabs is a CREST approved organisation and Chris Gatford our founder is on the board of CREST Australia.</p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "Apr 14, 2018 10:21:39 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "gX74rysnSTCfrmq1fptYZQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/advanon-ag-qa-engineer-remote",
    "title": "Advanon AG: QA Engineer - Remote",
    "content": "<div>  <div>    <h2>QA Engineer - Remote</h2>      <h4>Posted Apr 13</h4>    <h3>      <span>Advanon AG</span><br>      <span>Headquarters: Zürich, Switzerland</span><br>        <a href='http://www.advanon.com' rel='nofollow'>www.advanon.com</a>      <br>      <a rel='nofollow'>View all Advanon AG jobs →</a>    </h3>  </div>    </div>  <div>    <div><span>Advanon is looking to add new talent to its IT team!</span></div><div><span>If you have the drive to push forward a B2B Fintech startup that’s leading the invoice financing marketplace in Switzerland and Germany, joining our team will put you in a prime position to do just that.</span></div><div><span>Advanon is a rapidly growing, well-funded, FinTech startup based in Zürich, with an office in Berlin. We offer an online platform that allows SMEs to sell their open invoices directly to financial investors. By that, we help SMEs to improve their cash flow, and for investors, we provide a new, short-term, and high-yielding asset class.</span></div><div><span>Our team consists of 30 (and growing) visionary people coming from diverse backgrounds (Google, ING, ETH, HEC). We are proud to say we have 19 different nationalities on the team, a growing presence of women in key roles, and a healthy work-life balance that results in high performance and achievements.</span></div><div><span><br></span></div><div><span><span>What You Would Do: </span><br></span></div><div><span></span></div><ul><li><span>You will lead all testing efforts on our platform</span></li><li><span>You will automate integration tests running on our CI systems using codecept.js and docker</span></li><li><span>You will prepare test scenarios and needed data</span></li><li><span>You will improve and speed up our testing environments</span></li><li><span>You will work with the product and development team to plan the next projects</span></li><li><span>You will evaluate possible risks for new and existing features</span></li><li><span>You will support our business team with your platform knowledge</span></li></ul><div><span><br></span></div><div><span>What We Expect:&nbsp;</span><br></div><ul><li><span>You have a degree in Computer Science, or equivalent training</span></li><li><span>You have 2+ yrs working experience with the latest testing tools and automation</span></li><li><span>You have experience with Ruby on Rails, Agile or Lean</span></li><li><span>You have experience in HTML5, CSS, JavaScript, Front-end frameworks</span></li><li><span>You have the ability to use modern browsers, work with ad blockers, change viewport size, do testing on mobile device</span></li><li><span>You embody a hands-on mindset, and always ready to focus and commit to any task at hand</span></li><li><span>You have creative ideas, thrive when working without supervision, and have a real passion for startups</span></li><li><span>You are fluent in English and ability to read German is a plus</span></li><li><span>If applying for an in-house position you have valid working permission for Switzerland or EU citizenship</span></li></ul><div><span><br></span></div><div><span>What We Offer:&nbsp;</span><br></div><ul><li><span>Competitive salary + share option possibilities</span></li><li><span>Spend time with an innovative and passionate group of professionals building an exceptional product</span></li><li><span>ADVAPERKS, an awesome benefits package: </span><span>Unlimited holiday, 2 weeks per year flight/hotel for holiday is paid, annual transport passes, brekkie/TGIF events, budget for free-time courses, 3-6 months parental leave, remote work time, and even a laundry service option!</span></li></ul><div><span><br></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply via this link: <a href='https://advanon.join.com/jobs/422' rel='nofollow'>https://advanon.join.com/jobs/422</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 13, 2018 6:14:10 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/ruby",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "ruby"
    ]
  },
  {
    "id": "3I0r59lzQ02TTXQpEoFp4g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/skapa-tech-llc-quality-assurance-analyst",
    "title": "Skapa Tech, LLC: Quality Assurance Analyst",
    "content": "<div>  <div>    <h2>Quality Assurance Analyst</h2>      <h4>Posted Apr 12</h4>    <h3>      <span>Skapa Tech, LLC</span><br>      <span>Headquarters: Charlottesville, VA</span><br>        <a href='http://skapatech.com/' rel='nofollow'>http://skapatech.com/</a>      <br>      <a rel='nofollow'>View all Skapa Tech, LLC jobs →</a>    </h3>  </div>    </div>  <div>    <div>We are seeking a mid-level QA Analyst who will developand execute exploratory as well as automated tests in order to ensure we aremeeting our quality goals. QA Analyst responsibilities include estimating, planningand coordinating testing activities. The QA Analyst will also ensure thatquality issues and defects are appropriately identified, documented, trackedand resolved.<br></div><div></div><div></div><div></div><div></div><div></div><div><span></span></div><div><br></div><div></div><div><span>Attention to detail, curiosity and a commitment to high quality deliverablesis essential.</span></div><div><br></div><div><b>Job Type: </b>Contract or Full Time</div><div><b><br></b></div><div><b>Location: </b>Remote&nbsp;</div><div><br></div><div><b>Responsibilities</b></div><div><br></div><div></div><ul><li><span>Ensure the quality of functional areas of the product,for both web application and mobile applications.</span><br></li><li><span>Review stories and tasks andgenerate test plans from them</span><br></li><li><span>Estimate, prioritize, plan andcoordinate testing activities.</span><br></li><li><span>Design, develop and executeautomation scripts.</span><br></li><li><span>Perform thorough regressiontesting on functionalities.</span><br></li><li><span>Present testing results andprogress to management team.</span><br></li></ul><div></div><div><b><br></b></div><div></div><div><b>Qualifications / Skills</b></div><div><br></div><div></div><ul><li>2+ years’ experience in softwareand web quality assurance testing.<br></li><li>Experience in a Agile environment<br></li><li>Strong knowledge of software QAmethodologies, tools and processes<br></li><li>Strong work ethic, positive attitude&amp; excellent collaboration skills.<br></li><li>Must have strong organizationalskills, written and oral communication skills, and problem-solving skills<br></li><li>Demonstrated ability to work onconcurrent projects, activities and tasks under time constraints<br></li></ul><div><b><br></b></div><div><b>Requirements</b></div><div><br></div><div></div><ul><li>Ability to work remotely<br></li><li>Authorized to work in the U.S.<br></li><li>Prefer Candidates Located in USEastern or Central time zones</li></ul><div></div><div></div><div><br></div><div></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send Resume to Skapa Careers: <a href='mailto:skapa.careers@skapatech.com' rel='nofollow'>skapa.careers@skapatech.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 12, 2018 8:07:55 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "qJX0HPlHRpijwx6DlkqZzw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/345709-lead-quality-assurance-balanc3",
    "title": "Lead Quality Assurance (Balanc3)",
    "content": "<div><h2>Lead Quality Assurance (Balanc3) at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$100K–$150K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>We're seeking a Quality Assurance Engineer who is proficient at self-managing his/her projects, with a focus on delivering a high-quality product. The candidate will be detailed, organized and a team player. The candidate will collaborate closely with their project team to ensure successful delivery. The candidate will also be comfortable with communicating any project risks and options to mitigate any project issues that may arise.</p><p>Responsibilities:</p><p>Create and maintain automated testing architecture across our tech stack<br>Oversee and manage multiple projects at a time<br>Estimate, prioritize and plan testing activities<br>Review requirements and provide knowledgeable feedback to ensure they are thorough and detailed<br>Keep thorough documentation of all aspects of a project, including but not limited to:<br>Deployment communication<br>Detailed bug tickets<br>Comprehensive manual and automated test cases<br>Actively participate in project development meetings such as backlog grooming and sprint planning<br>Establish best practices for QA across enterprise projects<br>Build a team to successfully ensure all major software releases meet a high quality standard</p><p>Desired Skills:</p><p>At least 4 years of experience in a QA role<br>Experience working with automation framework tools — possibly Selenium, Protractor, Nightmare etc..<br>Experience with Integration, Regression, Unit &amp; API testing methodologies<br>Good understanding of the Software Development Life Cycle<br>Excellent communication skills<br>Outstanding prioritization and time management skills<br>Fintech experience is a strong plus<br>Blockchain / Ethereum experience a strong plus</p></div>",
    "urlFetchPending": false,
    "published": "Apr 12, 2018 1:57:26 AM",
    "tags": [
      "Brooklyn",
      "Full Time",
      "QA Engineer",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "sFxSkxa-Sae3mo1lVnA2HA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/160831/qa-automation-load-testing-hiptest-locust-finetune-learning?a=RW8D8T4wisg",
    "title": "QA Automation/Load Testing (hiptest, locust, selenium, gherkin, python) at FineTune Learning (Boston, MA) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Assessment, Education Technology, Human Resources</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>FineTune is seeking a senior&nbsp;QA for&nbsp;our&nbsp;AP and Pre-AP software product.&nbsp; &nbsp;We are a fully distributed and international team though 1/3 of us are in Boston Metro area.&nbsp; S/he will have the opportunity to work on&nbsp;mission critical software that will impact 3-5 million students in 2019.&nbsp; If you are well versed in various&nbsp;selenium based testing, load testing (Python Locust), smoke testing, test driven development and have worked in QA'ing at least&nbsp;3 production released software, you are welcome to apply. S/he will be working with our development team, product owners, designers and increase the quality of the software so that we may serve 3 million+ users in 2019.</p><p><strong>Requirements</strong>:</p><ul><li>Proven experience in understanding complex user needs with multiple stakeholders</li><li>5+ years of QA experience</li><li>3+ years experience with API testing, UI testing, end to end testing.</li><li>3+ years experience QA’ing high-availability enterprise software a plus</li><li>5+ years experience with Databases (SQL or noSQL)</li><li>Experience with Selenium</li><li>Experience with Locust for load testing</li><li>Experience with apache&nbsp;bench</li><li>Python based automation</li><li>Strong Agile Experience</li><li>Experience with continuous integration and test driven development</li><li>Ability to dive deep into technical issues.</li><li>Strong verbal and written communication skills</li><li>Experience in debugging performance issues&nbsp;in docker, kubernetes and AWS ECS containers</li><li>Experience in debugging performance issues with javascript and reactjs or other SPA architecture a plus</li><li>Experience with collaborating in github a plus</li><li>Desire to continuously, learn, improve and apply new technologies that will increase operational efficiency and effectiveness</li><li>BS/MS in Computer Science or equivalent a plus</li></ul><p>As we prepare for rapid business growth from here, FineTune Learning is seeking to hire a <strong>Senior QA Automation Engineer</strong> who have worked in at least 3 production released software/web/mobile products. &nbsp;We are looking for people who have strong motivation to grow startup companies, who is agile and continuously improving themselves while having an opinion for great software components and services with great attention to detail in delivering reliable software that is well tested according to user expectations.</p>                    </div>                            <h2>                About FineTune Learning            </h2>            <div><p>We are working on a variety of projects from componentizing and enhancing front end reactjs to optimize user experience and reusability of components.&nbsp; We are constantly collecting data on users to help recommend better resources for their learning.&nbsp; We build interesting but simple dashboards that may help teachers become more data driven.&nbsp; We work on behavioral experiments via randomized control trial through our software. Our backend is mostly python/sqlalchemy and supports graphql and diverse set of databases depending on the application.&nbsp; Continuous integration and continuous deployment are next in our pipeline. We are facing challenges in scalability and automation which we plan to tackle in 2018 and refactor code to&nbsp;increase the software performance and support 5 million users.&nbsp; We work with our design team to make this experience engaging&nbsp;for effective learning. We practice agile and scrum and&nbsp;strive to continuously improve.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Responsible time off                            </div>                            <div>                                 100% remote work/work from anywhere                            </div>                            <div>                                 401k                            </div>                            <div>                                 Health/dental                            </div>                            <div>                                 Profit sharing                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 7:00:46 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/python",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "python"
    ]
  },
  {
    "id": "1djHx8bZSwGLC4V_22Dwpw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/155930/senior-qa-engineer-kodify?a=QiesTMVUKvS",
    "title": "Senior QA Engineer at Kodify  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Entertainment, Media, Online Media</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Senior QA Engineer&nbsp;</strong></p><p>The team at Kodify is looking for a talented QA Engineer to join our remote team and bring new dynamic on board. This specific role is open to remote candidates <strong>based in Europe (a must for us).</strong> With you on board, we’re looking to expand our QA team to support 17 developers and 4 devops working across multiple European locations, and take our projects to a whole new level.</p><p>You will help design and deliver QA Best Practices and automated testing to our applications. &nbsp;Working closely with the QA Lead, and other technical teams to ensure the quality of our code base is constantly improved. Your collaboration with the team will be key to ensuring that their methods and tools are correctly chosen and implemented to ensure best practices are maintained throughout the application's life-cycle.</p><p><strong>Key responsibilities:</strong></p><ul><li><p>Design and documentation of test cases and plans.</p></li><li><p>Develop high-quality test automation software</p></li><li><p>Identifying and recording of bugs, and verifying fixes</p></li><li><p>Assisting development team by reproducing issues</p></li><li><p>Tracking and improving test coverage</p></li></ul><p><strong>Must have:</strong></p><ul><li><p>4+ years of experience in automated QA</p></li><li><p>Significant experience of NodeJS and Javascript (and related technologies)</p></li><li><p>Deep understanding of NodeJS based test automation tools such as Protractor, Webdriver.io, Testcafe, Nightwatch.js, Mocha, Chai and Jest</p></li><li><p>Solid understanding of testing API’s and web services</p></li><li><p>Experience in the creation of Sandbox environments for testing</p></li><li><p>Implemented Stress Testing as part of a deployment strategy</p></li><li><p>Worked with frontend performance testing using tools such as Lighthouse.js</p></li><li><p>Deep understanding of Jenkins CI, and related tools</p></li><li><p>Excellent git(hub) knowledge</p></li><li><p>Skills in debugging issues, and providing developers with significant feedback on failed tests</p></li><li><p>Great communication skills</p></li><li><p>Understand Cost vs Risk in testing strategy</p></li><li><p>A real passion for QA</p></li></ul><p><strong>Bonus points:</strong></p><ul><li><p>Experience working remotely and with remote teams</p></li><li><p>Knowledge and experience in JIRA</p></li><li><p>Experience working in an Agile/Scrum development process</p></li><li><p>Have worked in a high traffic / no-cache environment</p></li><li><p>Understanding of Microservices Architecture</p></li><li><p>AWS, Kubernetes &amp; Docker knowledge</p></li><li><p>Security Testing</p></li><li><p>React skills</p></li></ul><p><strong>About you:</strong></p><ul><li><p>You’re a real&nbsp;<strong>team player</strong>. You love to help and find solutions together.</p></li><li><p>Your&nbsp;<strong>sense of humour</strong>&nbsp;will bring a new dynamic to the team - you love to have fun while you work!</p></li><li><p>You can think on your feet and&nbsp;<strong>adapt well to fast-changing environments</strong>&nbsp;and priorities.</p></li><li><p>You love&nbsp;<strong>analysing data</strong>. You’re a&nbsp;<strong>complexity thinker</strong>&nbsp;and a real problem solver.</p></li><li><p>You’re&nbsp;<strong>flexible and available</strong>&nbsp;when needed. You understand emergency calls can be part of the job and are aware of the challenges supporting a 24/7 environment.</p></li><li><p>You stay updated on industry developments and strive to improve our platform with innovative solutions</p></li><li><p>You are&nbsp;<strong>passionate</strong>&nbsp;about software development &amp; quality</p></li></ul>                    </div>                            <h2>                About Kodify            </h2>            <div><p>Kodify just passed its 6th year anniversary but we're based on years of success, building and managing high-traffic websites. We have grown our websites to 7M visitors per day which comes with a challenging set of technical problems to overcome. Our success is down to Kodify’s <strong>teamwork,</strong> where each one of us plays a key role in getting us one step closer to our goals. All of this doesn’t happen without a healthy portion of <strong>fun &amp; perks!</strong> From company BBQs on our fantastic terrace, to yearly company off-sites, we make sure sure to live by our motto “Work Hard, Play Harder” and balance it all out! It’s our goal to create one of the <strong>best working environments</strong> possible which allows everyone to <strong>grow and achieve their maximum potential</strong> with their individual skill sets.</p><p><strong>What’s on offer</strong></p><ul><li><p>Indefinite employment contract</p></li><li><p>Latest tech equipment: choose whatever boosts your productivity!</p></li><li><p>Core hours with flexitime: work when you’re at your most creative!</p></li><li><p>Training and development budget and free days to attend training/conferences/etc.</p></li><li><p>Agile environment</p></li><li><p>10% time for personal projects</p></li><li><p>Free afternoons on Fridays</p></li><li><p>Company Amazon book account</p></li><li><p>Half Day off on your Birthday</p></li><li><p>Awesome offices and locations: Barcelona, Altea and Montreal!</p></li><li><p>Quarterly team meetups</p></li><li><p>Kodify off-sites, events and team activities!</p></li><li><p>Unique Kodify culture!</p></li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive salary                            </div>                            <div>                                 10%  time for personal projects                            </div>                            <div>                                 Private health insurance                            </div>                            <div>                                 Core hours with Flexitime                            </div>                            <div>                                 Brand new equipment on joining                            </div>                            <div>                                 Learning and development budget                            </div>                            <div>                                 Free lunches                            </div>                            <div>                                 Yearly 3 day company off-sites                            </div>                            <div>                                 Free snacks, drinks and lots of team activities!                            </div>                            <div>                                 Amazing offices in: Barcelona, LA, Altea and Montreal!                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 7:00:46 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/nodejs",
      "TITLE1/qa",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "GUN4_SZFS0elQsd0Q3kapg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-testers",
    "url": "http://workinstartups.com/job-board/job/67626/qa-engineer-at-hero/",
    "title": "QA Engineer",
    "content": "About Hero:<br /><br />21 billion sq ft of physical retail space is siloed from e-commerce. Our team is on a mission to change that.<br />We’re only two years into our journey, but already 350m shoppers on websites like Harvey Nichols and Ted Baker can use Hero to connect live with an associate in their nearest store - perfect for when they need real-time advice from someone in the know. For retail associates, our app represents a whole new way to do their jobs, giving them access to millions of online shoppers, not just customers who pass by the store. <br />This omnichannel approach is evolving billions of sq ft of analogue retail space into hyper-connected smart stores of the future; in cities including London, Paris, New York, Los Angeles and Hong Kong.<br /><br />We’re an energetic team that moves fast. From our offices in London and New York, we’re bringing together a world class collective of problem solvers passionate about blending technology, fashion and retail. Hero was founded in 2015 by the team that previously launched Europe’s largest app commerce company and is privately funded.<br /><br />Find out more at www.usehero.com<br /><br />The Role:<br /><br />We’re looking for someone to build the iOS application in a robust, clean and manageable way; providing the strongest possible base for expanding and growing the product in future, as well as adding new features.<br />Someone who will advocate for best platform practice in feature implementation; advising on how to use the strengths of the platform and collaborate on feasibility and solutions.<br /><br />Ideally, you’ll be someone that thrives in a fast moving environment and enjoys a diversity of challenges. <br /><br />What We’re Looking For:<br /><br />* Proven experience as a quality assurance analyst or relevant role in a commercial environment, ideally at a startup or tier-1 digital agency<br />* Thorough knowledge of methodologies of quality assurance and standards<br />* Experience of testing across multiple platforms (Desktop, Tablet and Mobile testing Web and Native Apps)<br />* Experience of using Jira for workflow and defect management is preferred<br />* Outstanding communication skills and attention to detail, with an eye for spotting design inconsistencies as well as technical issues<br />* Excellent organisational and leadership abilities<br /><br /><br />Our Culture & Benefits:<br /><br />Hero’s culture has been designed to give our team the freedom to do their best work, where they can freely contribute ideas and instantly see the impact of their work - irrespective of their backgrounds, education or years of experience. Our values guide the team to ‘leave their ego at the door’, ‘follow their instincts’ and ‘to become a master of their jungle’. <br /><br />Sound like a good fit? Here’s some other benefits we offer:<br /><br />* Work with a talented team of likeminds who truly love what they do<br />* A competitive salary and stock options in the company<br />* Generous healthcare plan for you and your cohabitating partner<br />* Pension plan<br />* An employee assistance program available 24/7<br />* A shiny new computer, big screen and all the software you need<br />* A chance to work in a creative, productive environment in London’s Fitzrovia with all the snacks, fruit, coffee and tea you can eat/drink<br />* Plenty of team dinners and social events (and regular trips to karaoke!)<br /><br />Please send CV's and a cover letter to jobs@usehero.com. <br />",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 3:52:20 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "lKoDjycuRJi6ZEa8AldD8w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4320-qa-automation-engineer-modus-create",
    "title": "QA Automation Engineer @ Modus Create",
    "content": "<h2>              QA Automation Engineer<small> @ Modus Create</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-04-03 12:17</p></dd>          <dt><span>Description</span></dt>          <dd><p>Are you ready to build great mobile and web-based applications and lead global teams with some of the brightest thought leaders, designers and technologists?  </p><p>As our QA Automation Engineer, you are capable of working on a variety of development projects regardless of type and level of complexity. Whether you are on a project with no test framework or one with thousands of test cases already in place, you can provide complete and effective test strategies for the team.</p><p>This role may be performed from a remote location. The incumbent must be located within the United States.</p><p><strong>Great QA Engineers are capable of:</strong></p><ul><li>Pinpointing gaps in test coverage and developing plans to fill those gaps</li><li>Building upon what is available to help improve testing efforts</li><li>Understanding the complexity of test automation</li><li>Knowing which types of testing to incorporate during development</li><li>Providing feedback for existing test processes</li><li>Instilling confidence in the stability of an application</li><li>Handling multiple projects at any given time</li><li>If that sounds like you and you have at least 2-5 years of experience working in QA, we have a place for you.</li></ul><p><strong>Your Duties</strong></p><ul><li>Implement automation test solutions based on project needs</li><li>Collaborate daily on a distributed, cross functional agile team</li><li>Develop test strategies and POCs for new projects</li><li>Train clients on new tools and systems</li><li>Mentor junior team members</li><li>Write blog posts on QA best practices</li></ul><p><strong>Required Experience</strong></p><ul><li>Designing test plans and processes for new products</li><li>Testing mobile, mobile web and desktop web-based applications</li><li>Automated functional testing with multiple testing frameworks such as Watir, WebdriverIO, or Codeception</li><li>Incorporating TDD or BDD practices and their associated frameworks like Jasmine, Mocha, or Cucumber.Experience with Cucumber is preferred</li><li>Working with Jenkins, Bamboo, CircleCI or comparable continuous integration systems</li><li>Using Javascript, PHP, Ruby, Python or other comparable languages (multiple languages preferred)</li><li>Working with JIRA or similar bug tracking system</li><li>Working in Agile and/or Kanban environments</li></ul><p><strong>Highly qualified candidates will have</strong></p><ul><li>Concise written and verbal communication skills for documenting bugs and test plans</li><li>Track record of active participation and contributions to the testing community (Stack Overflow, QA/ automation framework forums, Meetup groups, blogging, Twitter)</li><li>Familiarity with database systems, both SQL and NoSQL (For example, MySQL and MongoDB)</li><li>Prior experience with setting up and installing VMs</li><li>Grasp of the command line and scripting languages (like Bash and Powershell)</li><li>Firm understanding of application development and the testing pyramid (UI, Service, Unit)</li><li>Knowledge of utilizing Docker for testing</li><li>Experience with API testing</li><li>Previous experience working as a consultant</li></ul><p><strong>Let’s Talk about You</strong></p><p><strong>You value outcomes above all else:</strong> You have a proven track record shipping great mobile and web products. By understanding the big picture, you articulate strategy and vision with strong written and verbal communication.</p><p><strong>You Lead by Doing:</strong> You realize that the big picture is worthless without getting your hands dirty in the technical details for strategic and tactical problem solving. You understand the value of situational leadership and can adapt to the needs and strength of your team.  </p><p><strong>You Love Work, Growth and Learning:</strong> You dream of working in a culture that values hard work, continued learning and innovation with a commitment to building amazing products for clients and their end users. You’ll stop learning when you are dead, and until then you desire to gain deeper knowledge in technology and business.</p><p><strong>Let’s Talk About Us</strong></p><p>Modus Create is a Product Studio offering consulting services and SaaS products for strategic planning, design and execution of web-based and mobile products. We work across multiple industries with Fortune 1000, ISVs, and startups to validate, plan and launch new products. Headquartered in Reston, VA, we are a global, bootstrapped team that has grown from 2 to 140+ people in 30+ countries in 7 years, committed to building the best product consulting firm on the planet. We offer a highly collaborative, autonomous and effective working environment. We love and believe in what we do. This is your chance to be part of building something great.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>United States</p></dd>            <dt><span>Location</span></dt>            <dd><p>This role is a remote position. The work should be performed within the United States.</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 3:16:33 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/qa",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "OT4XeThnTNGcAdR6Rt8paQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-sysadmin",
    "url": "https://weworkremotely.com/remote-jobs/moveon-org-qa-analyst-contract",
    "title": "MoveOn.org: QA Analyst (contract)",
    "content": "<div>  <div>    <h2>QA Analyst (contract)</h2>      <h4>Posted Mar 29</h4>    <h3>      <span>MoveOn.org</span><br>      <span>Headquarters: Virtual</span><br>        <a href='http://www.moveon.org' rel='nofollow'>www.moveon.org</a>      <br>      <a rel='nofollow'>View all MoveOn.org jobs →</a>    </h3>  </div></div>  <div>    <div><span></span></div><div><span>MoveOn.org Civic Action and MoveOn.org Political Action</span></div><div><br></div><div><span>Request for Proposals</span></div><div></div><div><br></div><div><span>Project Title:</span><span> Quality Assurance on MoveOn software systems</span></div><div><br></div><div><span>Proposals accepted on a rolling basis until:</span><span> Friday, April 13, 2018</span></div><div><br></div><div><span>Project Description: </span><span>MoveOn has several highly scaled production software stacks that are pillars of our advocacy work: our </span><a href='http://petitions.moveon.org/' rel='nofollow'><span>petition system</span></a><span>, a peer-to-peer SMS tool called </span><a href='https://github.com/MoveOnOrg/Spoke/' rel='nofollow'><span>Spoke</span></a><span>, and donation and survey pages hosted on the </span><a href='https://actionkit.com/' rel='nofollow'><span>ActionKit</span></a><span> political CRM. Historically, the tech team has done manual QA and regression testing as a part of our development work, but recently our team’s development throughput has become so high that we now need dedicated QA on these key projects to help our team and our work scale, and help us do weekly releases of updates with minimal regressions.</span></div><div></div><div><br></div><div><span>Request for Proposal:</span><span> We are looking for a QA analyst to work alongside the MoveOn tech team to perform weekly regression testing on our 3 key production systems. </span></div><div><br></div><div><span>Scope of Work:</span></div><div><br></div><ul><li><span>Learn how to use the MoveOn </span><a href='http://petitions.moveon.org/' rel='nofollow'><span>petition system</span></a><span> as a petition creator, signer, and admin</span><br><br></li><li><span>Perform weekly regression testing of new petition system functionality, create detailed bug reports with screenshots and steps to reproduce issues in GitHub, and be available to affirm / sign off when bugs are fixed.</span><br><br></li><li><span>Learn how to use </span><a href='https://github.com/MoveOnOrg/Spoke/' rel='nofollow'><span>Spoke</span></a><span> as a texter, text message recipient, and campaign manager.</span><br><br></li><li><span>Perform weekly regression testing of new Spoke functionality, create detailed bug reports with screenshots and steps to reproduce issues in GitHub, and be available to affirm / sign off when bugs are fixed.</span><br><br></li><li><span>Learn how the MoveOn donation and survey pages work, as a MoveOn member user.</span><br><br></li><li><span>Perform weekly regression testing of updated donation and survey functionality, create detailed bug reports with screenshots and steps to reproduce issues in GitHub, and be available to affirm / sign off when bugs are fixed.</span><br><br></li><li><span>For at minimum 4 weeks (and up to 8 weeks), meet once or twice a week with the MoveOn tech team in our daily team meeting to learn about what functionality is available for testing this week.</span><br></li></ul><div><br></div><div><span>Total capacity: candidate would have at least ~8hrs / week availability from late March - end of May, with a possibility of extension. Candidate should be able to be online from 11am - 4pm US EST 1-2 days a week, otherwise work can be completed at any time.</span></div><div></div><div><br></div><div><span>Trial period: this consulting position would start with an initial 10 hour contract to ensure team fit, and then could be extended for the full proposed duration of time. </span></div><div></div><div><br></div><div><span>Organization Overview:</span></div><div><br></div><div><span>As a pillar of the current Resistance movement, MoveOn is mobilizing opposition to Trump and the GOP’s toxic agenda, including helping to lead efforts to defend health care, to stop any new U.S. wars, fighting for a Clean Dream Act, and opposing tax cuts for big corporations and the rich. We are determined to make the 2018 elections a turning point, helping Democrats win the House to create a roadblock to Trump &amp; Republicans’ ability to advance their toxic agenda, while electing new progressive champions who can help lead our country to a better future in races down ballot across the country. &nbsp;In preparing for the opportunities and challenges ahead of us in 2018, MoveOn is investing deeply in building and scaling our</span><span> technology stack. </span></div><div><br></div><div><span>Budget:</span></div><div><br></div><div><span>MoveOn will consider proposals with budgets up to $3k.</span></div><div></div><div><br></div><div><span>Proposal Requirements:</span></div><div></div><div><br></div><div><span>Background</span><span>: Name, title and contact information of primary contact. A brief description of prior QA analyst projects or roles.</span></div><div><br></div><div><span>Approach</span><span>: Describe your strategies for regression testing, creating reproducible bug reports, </span><span>and working in an all-remote, Slack-centric working environment</span><span>.</span></div><div></div><div><br></div><div><span>Experience</span><span>: Proposals should include description of relevant experience, including QA and testing experience, and QA best practices. </span></div><div><br></div><div><span>Schedule and Timeline: </span><span>Please outline a high level timeline for your availability, broken down into hours / week for at least 6 weeks.</span></div><div><span> &nbsp;</span></div><div><br></div><div><span>Cost: </span><span>Include an estimate for hourly rate and total available hours in your proposal.</span></div><div><br></div><div><span>Submission:</span><span> submit to proposals@moveon.org and put &quot;Quality Assurance&quot; in the subject line</span></div><div><span><br></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>submit to <a href='mailto:proposals@moveon.org' rel='nofollow'>proposals@moveon.org</a> and put &quot;Quality Assurance&quot; in the subject line</p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 30, 2018 1:14:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "w3FbiarrT2mrZrfGU3bhsA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4314-qa-analyst-contract-moveon-org",
    "title": "QA Analyst (contract) @ MoveOn.org",
    "content": "<h2>              QA Analyst (contract)<small> @ MoveOn.org</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-03-29 22:11</p></dd>          <dt><span>Description</span></dt>          <dd><p>MoveOn.org Civic Action and MoveOn.org Political ActionRequest for Proposals</p><p>Project Title: Quality Assurance on MoveOn software systems</p><p>Proposals accepted on a rolling basis until: Friday, April 13, 2018</p><p>Project Description: MoveOn has several highly scaled production software stacks that are pillars of our advocacy work: our petition system, a peer-to-peer SMS tool called Spoke, and donation and survey pages hosted on the ActionKit political CRM. Historically, the tech team has done manual QA and regression testing as a part of our development work, but recently our team’s development throughput has become so high that we now need dedicated QA on these key projects to help our team and our work scale, and help us do weekly releases of updates with minimal regressions.</p><p>Request for Proposal: We are looking for a QA analyst to work alongside the MoveOn tech team to perform weekly regression testing on our 3 key production systems. </p><p>Scope of Work:</p><ul><li>Learn how to use the MoveOn petition system as a petition creator, signer, and admin</li><li>Perform weekly regression testing of new petition system functionality, create detailed bug reports with screenshots and steps to reproduce issues in GitHub, and be available to affirm / sign off when bugs are fixed.</li><li>Learn how to use Spoke as a texter, text message recipient, and campaign manager.</li><li>Perform weekly regression testing of new Spoke functionality, create detailed bug reports with screenshots and steps to reproduce issues in GitHub, and be available to affirm / sign off when bugs are fixed.</li><li>Learn how the MoveOn donation and survey pages work, as a MoveOn member user.</li><li>Perform weekly regression testing of updated donation and survey functionality, create detailed bug reports with screenshots and steps to reproduce issues in GitHub, and be available to affirm / sign off when bugs are fixed.</li><li>For at minimum 4 weeks (and up to 8 weeks), meet once or twice a week with the MoveOn tech team in our daily team meeting to learn about what functionality is available for testing this week.</li></ul><p>Total capacity: candidate would have at least ~8hrs / week availability from late March - end of May, with a possibility of extension. Candidate should be able to be online from 11am - 4pm US EST 1-2 days a week, otherwise work can be completed at any time.</p><p>Trial period: this consulting position would start with an initial 10 hour contract to ensure team fit, and then could be extended for the full proposed duration of time. </p><p>Organization Overview:</p><p>As a pillar of the current Resistance movement, MoveOn is mobilizing opposition to Trump and the GOP’s toxic agenda, including helping to lead efforts to defend health care, to stop any new U.S. wars, fighting for a Clean Dream Act, and opposing tax cuts for big corporations and the rich. We are determined to make the 2018 elections a turning point, helping Democrats win the House to create a roadblock to Trump &amp; Republicans’ ability to advance their toxic agenda, while electing new progressive champions who can help lead our country to a better future in races down ballot across the country.  In preparing for the opportunities and challenges ahead of us in 2018, MoveOn is investing deeply in building and scaling our technology stack. </p><p>Budget:MoveOn will consider proposals with budgets up to $3k.</p><p>Proposal Requirements:</p><p>Background: Name, title and contact information of primary contact. A brief description of prior QA analyst projects or roles.</p><p>Approach: Describe your strategies for regression testing, creating reproducible bug reports, and working in an all-remote, Slack-centric working environment.</p><p>Experience: Proposals should include description of relevant experience, including QA and testing experience, and QA best practices. </p><p>Schedule and Timeline: Please outline a high level timeline for your availability, broken down into hours / week for at least 6 weeks.</p><p>Cost: Include an estimate for hourly rate and total available hours in your proposal.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>United States</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Mar 30, 2018 1:10:31 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "dGI7bkXUQSyEAnzLmOB1qg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/remote-jobs/harvest-qa-engineer",
    "title": "Harvest: QA Engineer",
    "content": "<div>  <div>    <h2>QA Engineer</h2>      <h4>Posted Mar 29</h4>    <h3>      <span>Harvest</span><br>      <span>Headquarters: New York, NY</span><br>        <a href='https://www.getharvest.com/careers' rel='nofollow'>https://www.getharvest.com/careers</a>      <br>      <a rel='nofollow'>View all Harvest jobs →</a>    </h3>  </div>    </div>  <div>    <div><span>Harvest is an independent software company making tools that help businesses run smoothly. For the past 11 years, our customers have relied on our products as a critical part of their day-to-day operations. They’re the reason we’re still in business and we owe it to them to deliver the best and most bug-free products we can.</span><br></div><div></div><div><span><br></span></div><div><span>Harvest started as a team of 3 and grew slowly to today’s current total of just over 50 </span><a href='https://workable.com/nr?l=https%3A%2F%2Fwww.getharvest.com%2Fabout%2Fmeet-the-team' rel='nofollow'><span>lovely faces</span></a><span>. Though we have an office in NYC, we hire the best people for the job no matter what city they call home. We’ve been working as a remote team since the beginning, and we work hard to make sure everyone feels included and heard.</span><br></div><div></div><div><span><br></span></div><div><b><span>Some Of What You’ll Do:</span><br></b></div><ul><li><span>Work directly with the product and development teams to set the direction and specifications for new feature development in our suite of applications.</span></li><li><span>Write and use test cases to check new feature development for bugs or potential customer confusion.</span><br></li><li><span>Assist in growing our automated testing library via tools like Selenium and Appium.</span><br></li><li><span>Collaborate with the rest of the QA team to document features, changes, or bugs.</span><br></li><li><span>Help with escalated support to triage, replicate, and verify fixes for customer-reported bugs.</span></li></ul><div><span><br></span></div><div><span><b>Our Ideal Candidate:</b></span><br></div><div></div><ul><li><span>You’re comfortable working on a small team.</span></li><li><span>You’re an excellent communicator with great writing skills.</span><br></li><li><span>You’re excited at the idea of learning and trying new things.</span><br></li><li><span>You’ve worked in QA before and have an excellent eye for detail.</span><br></li><li><span>You have experience writing and maintaining automated tests.</span><br></li><li><span>Your working hours are flexible enough to partially overlap with U.S. Eastern time.</span><br></li></ul><div><span><br></span></div><div><span><b>When You Apply:</b></span><br></div><div></div><ul><li><span>Tell us about your prior experience in QA.</span></li><li><span>Show us </span>the you<span> outside of work—something you take pride in or a hobby.</span><br></li><li><span>Give us a suggestion to improve one of our products (or report a bug!).</span><br></li><li><span>You could work anywhere, why Harvest?</span></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply here: <a href='https://harvest.workable.com/j/666976D1C5' rel='nofollow'>https://harvest.workable.com/j/666976D1C5</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 29, 2018 5:46:19 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/qa",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "B-eBm0w8SVK-lzZUjkMl0A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4293-rfp-texting-tool-selenium-test-development-moveon-org",
    "title": "RFP: Texting Tool Selenium Test Development @ MoveOn.org",
    "content": "<h2>              RFP: Texting Tool Selenium Test Development<small> @ MoveOn.org</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-03-22 19:59</p></dd>          <dt><span>Description</span></dt>          <dd><p>MoveOn.org Civic Action and MoveOn.org Political ActionRequest for Proposals</p><p>Project Title: MoveOn’s Peer-to-Peer Texting Tool Spoke - Selenium Test Development</p><p>Proposals accepted on a rolling basis until: TBD</p><p>Project Description: A key pillar of MoveOn’s campaigning tools is Spoke, an open source peer to peer messaging tool. Spoke’s current stack includes React in the frontend, NodeJS as a backend server. To find out more about the stack and how it’s used, visit: opensource.moveon.org/spoke-p2p. To view the code base, visit: github.com/moveonorg/spoke.</p><p>We are currently looking to add more automated testing in order to decrease our QA time process, ensure app functionality and catch regressions and bugs in new features and code changes. We are currently looking for a proposal that adds the following to the Spoke project: </p><ul><li>Selenium testing framework</li><li>Tests coverage for the following scenarios in the current qa guide: <a href='https://github.com/MoveOnOrg/Spoke/blob/2f181f7f21e37db6b913e77297b1ae9dabe42609/docs/QA_GUIDE.md' rel='nofollow'>https://github.com/MoveOnOrg/Spoke/blob/2f181f7f21e37db6b913e77297b1ae9dabe42609/docs/QA_GUIDE.md</a></li><li>Documentation for adding selenium integration locally in README.md</li><li>Documentation for other contributors on how to add selenium tests in CONTRIBUTING.md</li></ul><p>Request for Proposal: We are looking for a developer with experience building Selenium tests on a NodeJS project. This person will work closely with the Software Engineer, Mobile Technologies at MoveOn. </p><p>Scope of Work:</p><ul><li>Onboard yourself to the code base: github.com/moveonorg/spoke</li><li>Implement a set of GitHub issues that implement qa steps specified here: <a href='https://github.com/MoveOnOrg/Spoke/blob/2f181f7f21e37db6b913e77297b1ae9dabe42609/docs/QA_GUIDE.md' rel='nofollow'>https://github.com/MoveOnOrg/Spoke/blob/2f181f7f21e37db6b913e77297b1ae9dabe42609/docs/QA_GUIDE.md</a></li><li>Create documentation for other developers on how to integrate selenium locally and add tests</li></ul><p>Total capacity: We’ll consider all proposals for this project. Candidate should be available to attend meetings once a week between 11am - 4pm US EST to review submitted work and to answer any questions. </p><p>Organization Overview:</p><p>As a pillar of the current Resistance movement, MoveOn is mobilizing opposition to Trump and the GOP’s toxic agenda, including helping to lead efforts to defend health care, to stop any new U.S. wars, fighting for a clean Dream Act, and opposing tax cuts for big corporations and the rich. We are determined to make the 2018 elections a turning point, helping Democrats win the House to create a roadblock to Trump &amp; Republicans’ ability to advance their toxic agenda, while electing new progressive champions who can help lead our country to a better future in races down ballot across the country.  In preparing for the opportunities and challenges ahead of us in 2018, MoveOn is investing deeply in building and scaling our technology stack. </p><p>Budget:</p><p>MoveOn will consider proposals with budgets up to $3k.</p><p>Proposal Requirements:</p><p>Background: Name, title and contact information of primary contact. A brief description of prior project work with Selenium.</p><p>Approach: Describe your strategies for embedding with a software team, reliably driving tasks to completion, working with Git and GitHub, working with Agile software management strategies, and working in an all-remote, Slack-centric working environment.</p><p>Experience: Proposals should include description of relevant experience, including Selenium best practices with Node projects and multi-browser integration. </p><p>Schedule and Timeline: Please outline a high level timeline for your availability, broken down into hours / week for at least 4 weeks.</p><p>Cost: Include an estimate for hourly rate and total available hours in your proposal.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>United States</p></dd>            <dt><span>Location</span></dt>            <dd><p>US </p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Mar 22, 2018 9:58:49 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/qa",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "LpplOXzoSmuf2aVIBfxlnQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4270-qa-analyst-calix",
    "title": "QA Analyst @ Calix",
    "content": "<h2>              QA Analyst<small> @ Calix</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-03-15 13:15</p></dd>          <dt><span>Description</span></dt>          <dd><p>The Calix Commerce team is seeking a strategic thinker, team player, and self-motivated problem solver to join the team.  You will be tasked with developing and maintaining quality control systems, validating development activity and issue debugging to ensure smooth operation of Calix’s commerce systems.</p><p><strong>Purpose:</strong></p><p>This job includes quality assurance software development, end-to-end automated testing, issue research and debugging, data analysis and data reporting.  This individual will work closely with the Commerce team to ensure quality control and assist in issue resolution.   </p><p><strong>Responsibilities:</strong></p><ul><li>Work with the Commerce team to develop, document, and execute test plans.</li><li>Test new commerce updates, features and integrations.</li><li>Assist with issue debugging and documentation.</li><li>Keep commerce tools covered with up to date automated test scripts.</li><li>Clearly document issues and manage tickets in Jira.</li><li>Maintain development &amp; test environments.</li><li>Provide support to the Calix sales team.</li></ul><p><strong>Minimum Qualifications:</strong></p><ul><li>Bachelors Degree in Computer Science or equivalent practical experience.</li><li>Front-end web development or web QA experience.</li><li>Excellent communication skills at all levels required, including proficiency with major software (Word, Visio, etc.).</li><li>Strong and effective English skills required, both spoken and written.</li><li>Demonstrated ability to intuit the needs and expectations of your users.</li><li>Demonstrated problem solving and logical skills.</li><li>Strong analytical skills and competency in exporting manipulating and importing data with excel and data loaders.</li><li>Strong interpersonal skills required for interfacing with users.</li></ul><p><strong>Preferred Qualifications:</strong></p><ul><li>Experience with Bugsnag or equivalent.</li><li>Experience with Mocha, or equivalent.</li><li>Experience with TestCafe or equivalent.</li><li>Experience with Walkme or equivalent.</li><li>Experience developing Quality Control systems.</li><li>Experience with SQL, XML, XSL, Linux.</li><li>Experience with Salesforce, CPQ and enterprise E-Commerce platforms.</li></ul><p><strong>Equal Employment Opportunity:</strong></p><p>It is Calix’s policy to provide equal employment opportunity for all applicants and employees.  Calix employment-related decisions, including recruitment, hiring, training, compensation, benefits, and promotion are based solely on an individual’s qualifications and ability to accomplish assigned job functions and legitimate business needs.  Calix does not unlawfully discriminate on the basis of race, religion, color, national origin or ancestry, sex (including pregnancy, breastfeeding and medical conditions related to pregnancy and breastfeeding), age (40 and over), sexual orientation, gender identity or expression, pregnancy, medical condition, genetic characteristic or information, marital status (including registered domestic partners), veteran status,  physical or mental disability, status as a victim of domestic violence, sexual assault, or stalking, or any other legally protected criteria.</p><p><strong>About Us:</strong></p><p>Innovative communications service providers rely on Calix platforms to help them master and monetize the complex infrastructure between their subscribers and the cloud. Calix is the leading global provider of the cloud and software platforms, systems and services required to deliver the unified access network and smart premises of tomorrow. Our platforms and services help our customers build next generation networks by embracing a DevOps operating model, optimize the subscriber experience by leveraging big data analytics, and turn the complexity of the smart home and business into new revenue streams.</p><p>To learn more, visit the Calix web site at <a href='http://www.calix.com' rel='nofollow'>www.calix.com</a>.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Remote in Canada, USA</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Mar 15, 2018 3:14:00 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/qa",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "atNfVxV0SqyyePFoAXG_8A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4259-qa-manager-qless",
    "title": "QA Manager @ QLess",
    "content": "<h2>              QA Manager<small> @ QLess</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-03-12 23:49</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>Location:</strong> Work from home or at the QLess HQ in Pasadena, CA.</p><p><strong>Terms of employment:</strong> Salaried employee</p><p><strong>Length of employment:</strong> Full-time</p><p><strong>Benefits:</strong> Medical, dental, and vision</p><p><strong>Our mission:</strong> Eliminate waiting in line around the planet.</p><p><strong>Description:</strong></p><p>QLess is a young, rapidly-expanding company headquartered in Los Angeles, CA, with offices on 6 continents. Our web-based software has given back over 6,000 years of otherwise-wasted time to our millions of users, by allowing them to hold their spot in a virtual line using their cell phone, instead of being stuck waiting in a physical line or a waiting room.</p><p>We are seeking a QA Manager to become an integral part of our team! You will develop and execute software test plans in order to identify software issues.</p><p><strong>Responsibilities:</strong></p><ul><li>Devise and implement test automation strategy for the QLess platform</li><li>Build and run a team of agile QA Engineers</li><li>Investigate and recreate reported defects</li><li>Work with other engineers to troubleshoot and resolve coding issues</li><li>Track and document all testing defects and resolutions</li><li>Participate in the design and development for test automation and support</li></ul><p><strong>Qualifications:</strong></p><ul><li>Previous experience in agile software development and testing on a cross-functional team</li><li>Ability to build and lead a diverse team of top-notch engineers</li><li>Strong history with Continuous Integration and/or Continuous Delivery test strategies</li><li>Deep familiarity with best practices in software test automation for web and mobile applications, including API-level testing, performance testing, and load testing</li><li>Knowledge of Java, Python, or other programming languages</li><li>Familiarity with relational databases such as MySQL, Oracle, and SQL Server</li><li>Strong problem-solving and failure analysis skills</li><li>Deadline and detail-oriented</li></ul><p><strong>Compensation:</strong></p><ul><li>Competitive salary</li><li>Annual Bonus</li><li>Generous stock options</li><li>Unlimited Vacation Time</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Mar 13, 2018 1:49:02 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/ruby",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "ruby"
    ]
  },
  {
    "id": "mNySaZqkS4GTUvVv6paIxg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4227-test-engineer-backend-coffee-meets-bagel",
    "title": "Test Engineer (Backend) @ Coffee Meets Bagel",
    "content": "<h2>              Test Engineer (Backend)<small> @ Coffee Meets Bagel</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-03-05 21:34</p></dd>          <dt><span>Description</span></dt>          <dd><p>If you like fast-paced startups, Coffee Meets Bagel is the place for you. Your mission is to help people fall in love and make sure they have an awesome experience doing so! We are looking for a driven test engineer who is ready to step up and make a big impact at a growing start-up that helps people fall in love.</p><p>You will be a member of our backend team responsible for ensuring the quality of our APIs and core matching platform. You will not only perform end to end tests on our backend APIs and systems, but also be responsible for writing automated API tests. You will report directly to the engineering manager of our backend team.</p><h5>Responsibilities:</h5><ul><li>Coordinate and drive testing efforts including creating and executing test plans, test case development, and test status</li><li>Be involved in end to end testing of all CMB products including but not limited to server API and mobile applications</li><li>Collaborate with engineering, product, and customer service teams to uncover ambiguities in their written requirements, analyze incoming issues, determine reproducibility and conditions under which the issue occurs, and provide guidance towards resolving the issue</li><li>Design, develop and maintain automated test cases </li><li>Manage multiple releases across dev, staging and production environments</li><li>Ensure the best possible reliability, correctness, performance, quality, and responsiveness of the application </li></ul><h5>Requirements:</h5><ul><li>Minimum two years experience in web application testing role</li><li>Experience designing and executing test plans (both automated and manual)</li><li>Ability to write high-quality, self-documenting code using test-driven development techniques</li><li>Understanding of the different testing methodologies</li><li>Familiarity with RESTful APIs to connect front-end applications to back-end service </li><li>Passion for product quality</li><li>Strong desire to work in a fast-paced, startup setting</li></ul><h5>Bonus:</h5><ul><li>Experience with Postgres or another RDBMS </li><li>Proficiency with one or more scripting languages. Python is preferred</li><li>Experience with release management: CI/CD</li><li>Experience working with Jenkins</li></ul><p>Coffee Meets Bagel is helping people around the world fall in love and we LOVE what we do! Come to work every day in our slick new office right in downtown off the Powell Street BART station. We have all the usual startup perks including fully stocked snack bar, catered lunches, flexible work hours, unlimited vacation policy, happy hours, and more!</p><p>Or work from wherever you are from the comfort of your home or the bustle of your favorite coffee shop. We believe in hiring the best engineers wherever they are and strive to create an inclusive and collaborative work environment, even for remote employees!</p><p>Check out our <a href='https://tech.coffeemeetsbagel.com/' rel='nofollow'>tech engineering</a> blog to get a closer look at what we've got going on under the hood! Or maybe you want some deeper insight on the culture at CMB? Jump over to <a href='https://www.keyvalues.io/coffee-meets-bagel' rel='nofollow'>keyvalues.io</a> to see what our engineering team is all about :)</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Mar 5, 2018 11:34:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "01GO7K86SOmIOFfJSjnmQg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/66772/home-critic-visiting-and-testing-the-top-1-of-homes-in-london-at-the-plum-guide/",
    "title": "Home Critic - Visiting and testing the top 1% of homes in London",
    "content": "Background<br /><br /><br />The Plum Guide is building a marketplace of the world’s best holiday homes. For real!<br /><br /><br />We are taking a systematic and obsessive approach to testing every single home on the planet, and accepting only the top 1%.<br /><br /><br />We do so by putting every home through The Plum Test: a gruelling hospitality exam, which uses a mix of algorithms and physical visits by hospitality experts.<br /><br /><br />We launched 2 years ago in London. Since, we have grown at 20% month on month, vetted over 80,000 homes and reached over £11m in annualised sales. We are backed by an all-star cast investor group including Local Globe (TransferWise, OneFineStay, Citymapper), Alex Chesterman (Founder of Zoopla), William Reeve (Founder of Love Film), Alex Saint and Troy Collins (Founders of Secret Escapes), Errol Damlin (Founder of Wonga), Jason Goodman (Founder of Albion) and many more.<br /><br /><br />We just closed our Series A round of funding. The objectives of this round are to take Plum global and continue to differentiate the brand and the experience for our guests and hosts.<br /><br /><br /><br />The Role<br /><br /><br />Home Critics are Plum’s superheroes. They put every home and host that applies through the Plum Home Test. This is how we guarantee the quality of every home in the collection.<br /><br /><br />You’ll visit the homes and conduct a 1.5-3 hours test, depending on the size of the home. You’ll interview the host, rate the home on over 150 criteria, create a floor plan and decide whether it passes or fails. You’ll then create the content that powers our beautiful listings.<br /><br /><br />This is a freelance position. Most Home Critics do between 2 and 6 tests a week – and we ask for at least 8 months’ commitment to apply.<br /><br /><br /><br />What you’ll be up to<br /><br /><br />- Visiting some of the most beautiful vacation homes in London.<br /><br /><br />- Meeting new hosts on each visit and interviewing them about their approach to hosting and the services they provide.<br /><br /><br />- Meticulously collecting information about the home and answering every question fully and diligently. This includes things like measuring shower pressure, checking thread-count and testing the decibel level and wifi signal.<br /><br /><br />- Creating a representative floor plan using software installed on an ipad.<br /><br /><br />- Building the content to create the listings. This includes: the summary description, the highlights, the home truths and the area recommendations (nearby restaurants, cafes, attractions etc.)<br /><br /><br />- Positioning each home for the right target market (e.g. families, couples, business people etc.)<br /><br /><br />- Giving the photographer and stylist guidance on what features to capture during the photoshoot.<br /><br /><br />- Deciding whether each home and host you visit qualifies to join the Plum collection in London.<br /><br /><br />- Providing feedback to the Plum HQ to improve the testing criteria and process.<br /><br /><br />- Building the Plum brand and culture in London and helping make our flagship city an even bigger success!<br /><br /><br /><br />Who we are looking for<br /><br /><br />We’re looking for bright, energetic and passionate people who love London. Get in touch if:<br /><br /><br />- You’re passionate about interiors and design, and have an opinion about what’s good enough and what isn’t. You can spot an Ikea-quality couch from a mile away and believe guests deserve better.<br /><br /><br />- You’re a people-person. You find meeting and getting to know new people easy and a pleasure, and regularly get told you make a great first impression.<br /><br /><br />- You have an excellent written ability and can write in descriptive detail to convey to the reader what a home or experience is like.<br /><br /><br />- You’re organised and always on time for appointments and meetings.<br /><br /><br />- You’re committed. You take responsibilities seriously and never miss deadlines or deliverables.<br /><br /><br />- You have exceptionally high standards. From food to art and fashion, you live and breathe design excellence and have an eye for it.<br /><br /><br />- You take pride in your work and wouldn’t dream of putting your name to something sub-standard.<br /><br /><br />- You’re empathetic and can put yourself in others’ shoes. You can imagine what’s important to guests, especially as tourists to your city.<br /><br /><br />- You’re a good judge of character and good at reading people. You could understand whether someone would be a caring and attentive host after a few hours.<br /><br /><br />- You’re a London expert. You’re always in the know about the best places to eat, must-see galleries and exhibitions, and the up-and-coming neighbourhoods.<br /><br /><br /><br />Why Be a Home Critic<br /><br /><br />- Learn about curation and hospitality. We’re building a unique and fascinating formula for the perfect stay based on art, science and data.<br /><br /><br />- Work flexibly! We don’t expect you to be in the office everyday (but we like it when you drop by). We send you to home tests and you can complete the listing from home or a café.<br /><br /><br />- Get paid to explore incredible homes – it’s a great way to top-up your income.<br />Explore your city and make connections with fascinating hosts.<br /><br /><br />- Be part of a passionate, friendly and transparent culture. We’re building an amazing place to work where everyone is learning and challenging themselves.<br /><br /><br />- Opportunities to grow into new roles. Some of our Home Critics in London have been recruited for office-based roles or special projects.<br /><br /><br /><br />Hours &amp;amp;amp;amp;amp; compensation<br /><br /><br />You will be paid between £50 to £70 per test and listing creation, depending on the size of the home. We estimate each test and listing creation will take around 5 hours. This includes travel time to and from the visited homes if you’re based in London.",
    "urlFetchPending": false,
    "published": "Mar 5, 2018 5:09:15 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/qa",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "iJN0qolMQneE0OpnFmtKPQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/remote-jobs/gtguk-services-ltd-wanted-quality-assurance-assistant-who-lives-to-find-inconsistencies-in-the-details",
    "title": "GTGUK Services Ltd: WANTED: Quality Assurance Assistant Who Lives to Find Inconsistencies in the Details",
    "content": "<div>  <div>    <h2>WANTED: Quality Assurance Assistant Who Lives to Find Inconsistencies in the Details</h2>      <h4>Posted Feb 28</h4>    <h3>      <span>GTGUK Services Ltd</span><br>      <span>Headquarters: UK</span><br><br>      <a rel='nofollow'>View all GTGUK Services Ltd jobs →</a>    </h3>  </div></div>  <div>    <div><span><h2>Do you love digging into and resolving issues found in details? Do you get chills when you find inconsistencies? Do you spot even the smallest error yet can keep track of weekly projects? Are you interested in being part of the behind-the-scenes machine with a 100% remote team that’s successfully living the dream that every other digital marketing entrepreneur is trying to achieve?</h2></span></div><div><br></div><div><span>Well, then, you might be the QA Superstar we’re looking for!</span></div><div><br></div><div><span>This is a </span><em>critical</em><span> role on our team that requires a unique type of person. We need to be able to trust your discerning, detailed eye, without having to hold your hand too much once you’re trained.</span></div><div><br></div><div><span>Qualities of our QA Superstar include:</span></div><div><br></div><div><span>-It cannot be stressed enough: You *must* have </span><span>an incredible level of attention to detail </span><span>for this role.</span></div><div><br></div><div><span>-Independent, self-starter attitude</span></div><div><br></div><div><span>-Discretion is your middle name.</span></div><div><br></div><div><span>-Ability to follow a checklist carefully, again and again, with few errors</span></div><div><br></div><div><span>-Dogged approach to follow-up on inconsistencies and things that seem like errors, as well as follow-up with teammates on getting everything you need, combined with ability to find the answers independently where possible</span></div><div><br></div><div><span>-Prior experience as a freelancer preferred</span></div><div><br></div><div><span>-Experience with Google spreadsheets and multiple tabs preferred but not required</span></div><div><br></div><div><span>-Meticulous care and precision are hallmarks of your skilset</span></div><div><br></div><div><span>-Patience: You’ll wade through complex instructions and you don’t mind re-testing as many times as it takes</span></div><div><br></div><div><span>-Isn’t shy about finding mistakes and embraces imperfection</span></div><div><br></div><div><span>-Written directions are your best buddies</span></div><div><br></div><div><span>Responsibilities include:</span></div><div><br></div><div><span>-Run tests on website and order form functionality after reviewing project overviews</span></div><div><br></div><div><span>-Flag problems and enter them into a Google spreadsheet punch list even when they may not seem like a big deal</span></div><div><br></div><div><span>-Consistent follow-up on problems or questions with other team members on </span><em>anything</em><span> that seems incorrect on any aspect of testing</span></div><div><br></div><div><span>-Able to work during the day between 9:00 AM and 4:30 PM Eastern Time</span></div><div><br></div><div><span>-Must have an iPhone and any type of desktop or laptop computer</span></div><div><br></div><div><span>Why Join Us?</span></div><div><br></div><div><span>You’ll work remotely with a lot of flexibility and independence. We are 100% remote, with team members based in LA, NY, the UK, Eastern Europe, South America, and the Philippines. We don’t care where you’re based as long as you deliver results.</span></div><div><br></div><div><span>Make an impact – help women level-up in their relationships, self-esteem, and happiness.</span></div><div><br></div><div><span>Be part of a positive, upbeat team that deals with each other with respect and gratitude.</span></div><div><br></div><div><span>Take advantage of opportunities for growth. Many on our team have been with the company for years and have moved up or into different roles.</span></div><div><br></div><div><span>HOURS</span></div><div><br></div><div><span>This position starts on an as-needed basis </span><span>with the possibility to grow more within the role</span><span>. You should be available to work flexible hours, with availability for team video calls between the hours of 11 AM - 3 PM Eastern.</span></div><div><br></div><div><span>To be considered, please write us a cover letter as to why you’d be a good fit. Include that letter in the body of your email and do not attach anything, including your resume. Applications with attachments will not be read. We prioritize culture fit, attention to detail, and quality writing when selecting candidates. Show us how detail-oriented you are - could there be a typo in this job posting?</span></div><div><br></div><div><span>We will test top candidates with work that’s very close to the work you’d be doing in this role.</span></div><div><br></div><div><span>ABOUT US</span></div><div><br></div><div><span>Get the Guy is an online dating and relationship advice company that helps women get the results they want in their love lives – but we don’t stop there. Nothing stays at the surface with us; we go deep and show our customers how to transform their confidence and self-esteem to live happier, more fulfilling lives overall. </span></div><div><br></div><div><span>Find out more by watching our CEO Matthew Hussey’s massively popular YouTube videos. (Be sure to tell us in your letter which one you liked best.) </span></div><div><br></div><div><span>You’ll be testing and interviewing with our QA Queen, Victoria Rosendahl. Her favorite color is magenta so she’d love it if you also put that word somewhere in your subject line when sending your letter.</span></div><div><br></div><div><span>Look forward to meeting you!</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send your cover letter in the body of an email to <a href='mailto:recruiting@howtogettheguy.com' rel='nofollow'>recruiting@howtogettheguy.com</a>.</p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 28, 2018 9:47:35 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/go",
      "TECH1/mobile",
      "TITLE1/qa",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "apple",
      "go",
      "mobile"
    ]
  },
  {
    "id": "s1BPO2SgR2-hLhZvlDFWYw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/remote-jobs/modern-tribe-qa-analyst",
    "title": "Modern Tribe: QA Analyst",
    "content": "<div>  <div>    <h2>QA Analyst</h2>      <h4>Posted Feb 27</h4>    <h3>      <span>Modern Tribe</span><br>      <span>Headquarters: Remote</span><br>        tri.be      <br>      <a rel='nofollow'>View all Modern Tribe jobs →</a>    </h3>  </div>    </div>  <div>    <div><b>The Opportunity</b></div><div><br></div><div></div><div>Modern Tribe’s QA team works on a lot of cool projects: over the past year alone, we’ve tested sites built by our dev team for big-name clients including&nbsp;<a href='http://columbialawreview.org/' rel='nofollow'>Columbia Law School</a>,&nbsp;<a href='http://www.foodinnovationgroup.com/' rel='nofollow'>Bon Appetit Magazine</a>,&nbsp;<a href='https://www.eventbrite.com/blog/academy/' rel='nofollow'>Eventbright Academy Blog</a>,&nbsp;<a href='http://hls.harvard.edu/' rel='nofollow'>Harvard Law School</a>&nbsp;and&nbsp;<a href='https://www.whatshouldwedo.com/' rel='nofollow'>What Should We Do (WSWD)</a>. (Want to see how we did? The links above highlight some of our work). And that’s not even including our family of WordPress plugins led by&nbsp;<a href='http://theeventscalendar.com/' rel='nofollow'>The Events Calendar</a>.</div><div><br></div><div>We’ve got a slew of cool projects we are working on in 2017, and need another member for our QA team. If working on high-profile sites for large clients gets you excited and a serious case of attention to detail is your jam, we should talk.</div><div><br></div><div></div><div><b>Responsibilities</b></div><div><br></div><div></div><div><span>QA is responsible for ensuring all aspects of quality at Modern Tribe. It’s a tall order for sure: learning how a site works, creating test plans covering obscure use cases, and then putting it all into practice when testing every aspect of site functionality…it’s a lot of ground to cover. But we’ve got an established workflow down that helps make sure we’re setting the team up with the tools they need to proceed and succeed.</span></div><div>Though every project is different, here’s the gist of our QA flow:</div><div><br></div><ul><li><b>KICKOFF MEETING.</b>&nbsp;Just a kickoff — meet the PM; get your questions answered; set expectations; and schedule milestones.</li><li><b>PREPARING DOCS.</b>&nbsp;Getting started with internal documentation early is hugely important to getting the project into your brain.</li><li><b>REVIEW APPROVED COMPS.</b>&nbsp;Before you start QA or even get a walkthrough, you’ll review the comps to understand the project + prepare a list of questions to ask on the QA walkthrough.</li><li><b>QA WALKTHROUGH.</b>&nbsp;Once development is far enough along for QA to begin, you’ll do a walkthrough with the lead developer to get an overview of the functionality.</li><li><b>PREPARE QA CHECKLIST + TEST PLAN.</b>&nbsp;After seeing each component of the site in action, you’ll put together a first draft at a comprehensive QA checklist and a higher-level overview of what you’re planning to test, in what order, and when.</li><li><b>HEAVY DUTY TESTING.</b>&nbsp;You’ll put the site through its paces and give it a few rounds of full pass bug hunting. Beyond just hitting buttons, you’ll be thinking from a higher level: are there usability concerns? Does what we’re doing here actually make sense as the best way to solve the problem? etc.</li><li><b>CELEBRATING A SUCCESSFUL LAUNCH.</b>&nbsp;What feels better than kicking back after a successful launch? If QA has done their job, the project will launch smoothly, the team will have a finished product to show off, and — most importantly — the client will be happy. It doesn’t get much better than that.</li></ul><div>* Our QA team also generally leads client training and prepares training documentation/videos when appropriate, so be prepared for some direct client communication.</div><div><br></div><ul></ul><div></div><div><b>Personal Competencies&nbsp;&nbsp;</b></div><div><br></div><div></div><ul><li><span>Extremely outgoing and friendly attitude</span></li><li><span>Strong communication     skills</span></li><li><span>Experience working as     part of a remote team</span></li><li><span>Self-motivated,     detail-oriented</span></li><li><span>Strong organizational     skills</span></li><li><span>A methodical approach     to all tasks</span></li><li><span>Ability to work on     multiple projects at the same time and complete tasks in a timely manner</span></li><li><span>Ability to prioritize     workloads and meet deadlines</span></li><li><span>Fluent English     speaker</span></li></ul><div><br></div><div></div><div><b>Knowledge &amp; Experience</b></div><div><br></div><div></div><ul><li><span>Full time 100%     freelancers only!</span></li><li>Has a proven track record in Quality Assurance.</li><li>Pays meticulous attention to detail + fights for the customer. Being able to catch bugs is huge, but it isn’t everything — QA is most effective when it puts itself in the customer or end user’s shoes.</li><li>Knows WordPress well, you’ll be expected to prove your familiarity with the platform.</li><li>Excellent verbal, non-verbal and written communication skills</li><li>Has 1+ year remote freelancing experience.</li></ul><div><span><br></span></div><div></div><div><b>Bonus Points</b></div><div><br></div><div></div><ul><li>Familiarity setting up local WordPress environments + cloning GIT repositories locally</li><li>Skills at training others how to admin complex WordPress sites/projects</li><li>Experience writing and implementing automated testing processes</li></ul><div><span><br></span></div><div></div><div><b>Compensation</b></div><div><br></div><div></div><div><span>Our hourly rate for this gig starts at&nbsp;</span><span>$25-$35/hr</span><span>, depending on experience, with opportunities for rate bumps on annual review. This gig is about 8 hours per week of work to start and ramping up to about 15 -20 hours over the next 2 -3 months. This is a one time contract position, though we are always seeking longer relationships with kick-ass people.</span></div><div><br></div><div></div><div><b>Location</b></div><div><br></div><div></div><div><span>Work from anywhere in the&nbsp;</span><span>US or Canada</span><span>; if you are in&nbsp;</span><span>Central or South America</span><span>, let’s talk. This will be a 100% remote position.&nbsp;</span><span>&nbsp;</span><span>If your working hours are in a timezone outside of the US range, but you work 4+ hours of overlap each day our team might be able to consider your application.</span></div><div><br></div><div></div><div><b>Inclusion Statement</b></div><div><br></div><div></div><div><strong>Modern Tribe is committed toa culture that embraces diversity and inclusion.</strong>&nbsp;We foster anenvironment of collaboration, open engagement, fairness and respect regardlessof differences in age, race, disability, national origin, gender identity,religion, sexual orientation or veteran status. As a hybrid workspace rangingfrom distributed contractors to traditional employees, we value the uniqueperspectives and experiences of our global team.</div><div></div><div>We come from all walks of life. We are small businessowners. We are tattoo aficionados and 80’s movie buffs and ex-pats. We arehomeschool teachers. We are single parents. We are musicians, collegedrop-outs, and entrepreneurs. We are travelers, feminists, runners, volunteers,and makers. We are a Modern Tribe.</div><div><br></div><div></div><div>Everyday we strive to fulfill our motto: live well and dogood work. We hope you will consider joining us.</div><div><br></div><div></div><div><b>Perks</b></div><div><br></div><div></div><div>We believe that freelancing is a way of life. We understandwhat it means to be a freelancer. We offer consistency in expectations,payment, and support. We believe in learning from each other and fosteringpersonal growth. You can expect to learn a lot while working with us.</div><div><br></div><div></div><div>(Also, if you work enough with us, we’llbring you on the&nbsp;<a href='http://tri.be/blog/team-trip-2015/' rel='nofollow'>teamtrip</a>.)</div><div><br></div><div></div><div><b>Who We Are</b></div><div><br></div><div></div><div>Modern Tribe, Inc. is a rapidly growing software &amp;design company. We develop custom solutions for some of the world’s largestcompanies, government institutions and smaller growing organizations. We prideourselves on our ability to bridge people and technology and to bring thepassion and dedication of an entrepreneur to every project. Our team iscomposed of talented employees and freelancers around North &amp; South America(and a smattering across the globe).</div><div><br></div><div></div><div><b>Who You Are</b></div><div><br></div><div></div><div>We love working with each other because we have built aculture that suits us well. We work primarily with freelancers and coordinatetheir talents for large projects. To be on our team, you must be:</div><div><br></div><div></div><ul><li><strong>HAPPY</strong><span>&nbsp;-&nbsp;Where     there is a will, there is a way. Having a positive disposition allows us     to achieve great things and to support each other.</span></li><li><strong>HELPFUL</strong><span>&nbsp;-&nbsp;Always     looking for ways that you can help others.</span></li><li><strong>CURIOUS</strong><span>&nbsp;-&nbsp;It is     essential that you have a passion for learning. Technology changes daily,     and life has a way of constantly raising the bar.</span></li><li><strong>ACCOUNTABLE</strong><span>&nbsp;-&nbsp;Our     clients expect us to get the right thing done on budget and on time.     Communicating expectations and meeting them is the cornerstone of success.</span></li><li><strong>A     FREELANCER</strong><span>&nbsp;-&nbsp;This     means you will also maintain your own     personal client list and that Modern Tribe will only comprise a proportion     of your total income. Regardless of where you live, you need to be already     freelancing.</span></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply on our website <a href='http://m.tri.be/19yl' rel='nofollow'>http://m.tri.be/19yl</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 27, 2018 6:10:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/qa",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "H2O9-m7hR5yqQQHxlc0knA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168988/free-bass-fishing-lessons-for-senior-qa-engineer-catch-co?a=UFKimLRXBKM",
    "title": "Free Bass Fishing Lessons for Senior QA Engineer at Catch Co (Chicago, IL) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>eCommerce, Fishing, Retail</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>The engineering team at Catch Co works together to build a digital platform that serves as the foundation for running and scaling all aspects of our fishing subscription box,&nbsp;<a href='http://workable.com/nr?l=https%3A%2F%2Fmysterytacklebox.com%2F' rel='nofollow'>Mystery Tackle Box</a>. Examples of past and current projects include migrating off legacy platforms, scaling up our custom subscription service with distributed production systems, and building internal tools to improve business processes.</p><p>What makes this a special opportunity:</p><ul><li>In this role, you'll be leading quality assurance and testing alongside a growing engineering team.</li><li>We are a dynamic early-stage startup with tons of momentum (ranked #435 on the 2017 Inc. 500 list of the fastest-growing private companies)</li><li>We place a premium on building a great culture made up of great people</li><li>You will work with and learn from experienced leaders who have a track record of building successful companies</li><li>Work remotely! Other team members work from home throughout the United States.</li><li>Regular “outdoors days” to escape the office and go fishing, hiking, boating, or something else equally as awesome.</li></ul><p>We look for a track record of the following:</p><ul><li>Understanding of quality assurance test methodologies, deliverables, processes, strategies, metrics, techniques and the software development lifecycle (SDLC).</li><li>Testing consumer-facing websites and applications, across multiple browsers and devices.</li><li>Designing and writing test cases, and executing test cases for functional and regression testing.</li><li>Writing thorough and reproducible bug reports.</li><li>Understanding of automated testing strategies and tools.</li><li>Developing automated testing solutions using Selenium (or similar).</li><li>Testing non-UI system components such as relational data (SQL) or API endpoints.</li><li>Quickly obtaining a deep understanding of new domains.</li><li>Staying abreast of current topics and trends in software testing.</li><li>Passion for software testing and technology in general.</li><li>Effectively work remotely within an Agile team environment.</li></ul><p>What you will do:</p><ul><li>Ensure that software applications conform to business requirements and quality standards</li><li>Create and maintain documentation including test plans, test cases, test data, testing progress and schedules</li><li>Design, document, and establish procedures for analyzing and testing as part of the software development life-cycle (SDLC)</li><li>Recommend and assist in driving improvements at all stages of the product life</li><li>Submit and track production and release issues in our issue tracker</li><li>Develop automation test suites using automated testing tools</li><li>Collaborate with members of the product and engineering teams to discuss, architect, and implement solutions.</li></ul><p><strong>You must be eligible to work in the United States. Visa sponsorship is not available.</strong></p>                    </div>                            <h2>                About Catch Co            </h2>            <div><p>We're building a personalized, digital shopping experience that introduces anglers to the best new gear and lifestyle apparel. It all started with our monthly fishing subscription,&nbsp;<a href='https://mysterytacklebox.com/' rel='nofollow'>Mystery Tackle Box</a>, and has grown into additional brands including creating many of our own physical products.</p><p>We work&nbsp;together to build a digital business platform that serves as the foundation for operating and scaling all aspects of our business.</p><p>Examples of past and current projects include migrating off legacy platforms, scaling up our custom subscription service with distributed production systems, and building internal tools to improve business processes.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Health, Dental, and Vision Benefits                            </div>                            <div>                                 401K Plan                            </div>                            <div>                                 Remote/Telecommute                            </div>                            <div>                                 Highly Collaborative Team                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 9:31:15 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "6DJSDvy0RAGXAMsQuZb6AA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4165-quality-assurance-specialist-m-f-komoot",
    "title": "Quality Assurance Specialist (m/f) @ komoot",
    "content": "<h2>              Quality Assurance Specialist (m/f)<small> @ komoot</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-26 14:29</p></dd>          <dt><span>Description</span></dt>          <dd><p>Millions of people experience real-life adventures with our apps. We help users all over the world discover the best hiking and biking routes, and we empower everybody to explore more of the great outdoors. And we’re good at what we do: Our users love our high quality product and have confirmed this by giving us 4.5+ stars in the app stores. To keep us satisfying our users as we expand komoot, we are looking for a passionate quality assurance specialist to join our team and help us continue to build the future of outdoor exploration.</p><h5>Your key responsibilities</h5><ul><li>Monitor and improve the quality of komoot’s iOS, Android and web apps in collaboration with our team of developers, designers, copywriters, and product experts.</li><li>Define relevant tests and execute them for new and existing features.</li><li>Assure the quality of new features through cross-checking behavior, design and copy.</li><li>Keep an overview of bugs and help us enhance/prioritize them in collaboration with developers and our support team.</li><li>Test the product in real world outdoor use cases.</li></ul><h5>Why you will love it</h5><ul><li>You’ll work on an award winning, global product and you’ll tangibly improve the user experience for millions of people.</li><li>We let you work from wherever you want, be it a beach, the mountains, your home or anywhere else that lies in any time zone between UTC-1 and UTC+3.</li><li>Your expert knowledge will make you a key player amongst a team of highly motivated, talented people.</li><li>You’ll work together with developers to improve and streamline testing processes and tools.</li><li>You’ll travel together with our team to amazing outdoor places several times a year to exchange ideas, learnings and go for hikes and rides.</li><li>You’ll use and improve software that we’re pretty sure you’ll end up using for your personal outdoor trips.</li></ul><h5>You will be successful in this position if you</h5><ul><li>Are highly self-driven, responsible, reliable and keen to learn and improve.</li><li>Love to use and improve an awesome product for a great user experience by testing it in real world use cases.</li><li>Have proven experience providing quality assurance support for high quality mobile and web apps (2+ years).</li><li>Understand that perfection is impossible but set it as the goal anyway.</li><li>Have strong organizational skills.</li><li>Have experience in working in a distributed team, have good communication skills and love to work together with others in fast development cycles.</li></ul><h5>Sounds like you?</h5><p>Send us the following</p><ul><li>Your CV.</li><li>A write-up explaining who you are and why you are interested in working at komoot.</li><li>Examples of your work (e.g. PDFs, Slideshare, etc.).</li><li>Something that shows us a little more about what you’re interested in, be it your Twitter/Instagram account or your blog.</li><li>As we love people that go the extra mile, you’ll get bonus points for doing something creative with komoot.</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>We let you work from wherever you want, be it a beach, the mountains, your home or anywhere else that lies in any time zone between UTC-1 and UTC+3.</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 4:29:18 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/go",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "go"
    ]
  },
  {
    "id": "YAsTBx_YR3Gl5cGNyzVdgw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168712/etl-quality-assurance-engineer-webrtcventures?a=UA0uhViOuVa",
    "title": "ETL Quality Assurance Engineer at WebRTC.ventures  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Computer Software, Web Design, Web Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>OVERVIEW</p><p>We are looking to add a QA Engineer to our QA team to focus the definition, execution, and enforcement of new QA processes and guidelines for our Data Engineering team. The QA Engineer may also contribute to other projects as time allows and priorities shift.</p><p>RESPONSIBILITIES</p><ul><li>Assist in defining processes, standards, and overall Quality Assurance practices for the Data Engineering Team</li><li>Model best practices for Quality Assurance engineering, demonstrating thought leadership and a commitment to high standards</li><li>Perform QA testing, particularly for the migration of data sets from SQL Server to Postgres</li><li>Act as a QA resource for other teams as QA expands</li><li>Work with other Scrum team members to define and review Acceptance Criteria and determine the best strategy for testing</li><li>Participate in critical release activities for various platforms and services</li></ul><p>EXPERIENCE and SKILLS</p><p>Mandatory</p><ul><li>Ability to compare data sets in SQL Server and Postgres and produce detailed notes on any discrepancies between data sets</li><li>SQL Server and Postgres experience</li><li>Ability to Load and run database snapshots locally</li><li>Knowledge of Python</li></ul><p>Desirable</p><ul><li>Ability to generate test cases and automated testing scenarios</li><li>Knowledge of and skill working in continuous integration environments</li><li>Performance and benchmark analysis skills</li></ul><p>ORGANIZATION</p><ul><li>Reports to the QA Team Lead</li><li>Is embedded as part of the data pipeline</li></ul>                    </div>                            <h2>                About WebRTC.ventures            </h2>            <div><p>WebRTC.ventures&nbsp;was founded in 2010 by Arin Sime. Arin lives in Virginia, and travels around the companies American training methodologies agile and Scrum and Kanban.&nbsp;</p><p><br> In 2011, Arin was associated with David Alfaro of Costa Rica to begin providing development services software nearshore to customers WebRTC.ventures&nbsp;in the USA. David is a leading IT experience in Costa Rica, and well known in Costa Rica as one of the first to bring Agile to America Central. <br> <br> David and Arin ensure that WebRTC.ventures always strives to deliver high quality services and high efficiency for our customers. &nbsp;But our team full command so that really makes us special. Read our Commando's Creed to know the values that have made us successful <a href='http://www.agilityfeat.com/creed' rel='nofollow'>http://www.agilityfeat.com/creed</a></p><p>Our team builds communication applications for the web and mobile, using real time technologies like WebRTC, TokBox, PubNub, and more.</p><p>We do one thing: Product Development. But we do that one thing in three different ways: Design, Development, and Training. It's the joy of creating better software products that run as a common thread through everything we do. Through design assessments and implementation, to development projects, to training client teams on how to build better software, our goal is always to help &nbsp;create products customers will love.</p><p><br>Oh..we actually do like long walks on the beach, and annually take our team on trips in Costa Rica or other interesting places in Latin America.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 100% Remote - Work From Home                            </div>                            <div>                                 Paid Company Outings                            </div>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Passionate People                            </div>                            <div>                                 Cutting Edge Technologies                            </div>                            <div>                                 Ideal Environment for Creative Minds                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 23, 2018 10:10:12 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "rxTgXOhDTAaywVe3tJldJA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-testers",
    "url": "http://workinstartups.com/job-board/job/66432/senior-automated-test-engineer-at-kasko/",
    "title": "Senior Automated Test Engineer",
    "content": "*The Job*<br /><br />We’re looking for a test architect ready to build the automated test strategy from the ground up.   We need to test the front end, back end, API’s, platform reliability.<br /><br />We want someone who is independent and capable of taking responsibility for the whole process. You’ll have the opportunity to build things the way you want to from scratch.<br /><br />We want to hear from you directly. At the moment we are not engaging with recruiters.<br /><br /><br />*Problem we Are solving*<br /><br />Insurance  -  we all need it, most people are confused by it and few really &quot;get it&quot;. Insurance products are hard to understand and don't always seem to cover what you expect and on top of this buying insurance isn't easy. In a world where we can get most things at the click of a button, buying insurance is usually still an offline or late-1990s-digital nightmare, with confusing forms and a horrible customer experience. Existing legacy IT systems make it hard for insurers to bring out new products quickly, to sell them in digital channels, to integrate 3rd party services and to test what works and what doesn't, in a low cost way.<br /><br />*KASKO's Solution?*<br /><br />We offer a digital insurance platform, which acts as a middle layer between insurers and the digital world. This makes it easy for insurers:<br /><br />* to create new insurance products<br />* offering best-in-class digital customer journeys<br />* connect to 3rd party APIs<br />* build in a sandbox or fully integrated with existing systems<br /><br />We can do this in a matter of weeks, rather than the traditional insurance speed of months or years. KASKO's platform empowers the multitrillion-dollar insurance industry to embark on the digital revolution that other industries have gone through already. It allows insurers to build better products for consumers and allows digital business of all types to work closer with insurers to deliver these products.<br /><br />*Who We Are?*<br /><br />We're backed by some of the UK's top investors incl. Seedcamp (TransferWise, PropertyPartner) and Chris Slater (Co-founder Simply Business, 500m exit). We are currently expanding our awesome development team. We also believe that you need to like and respect the people you work with and have some fun together. Thus, at least every quarter we will pick a European city, Airbnb and have some work but mostly fun :) We're a diverse team from England, UK, Germany, Holland, and Latvia with background in engineering, strategy consulting, enterprise sales, economics etc.<br /><br />*The Technology*<br /><br />We have a simple technology philosophy. Anything and everything should be automated. The front end of our platform is currently built on JS Webapps. The backend is build entirely on a Microservices architecture. These together allows us to easily deal with the multitude of complex and different workflows that could go into selling different insurance products in different places. Currently we get things done with *Angular.js, PHP*, and *AWS*, however we don't limit our selection to these technologies, we believe that a good engineer can rapidly pick up any technology.<br /><br />*What we offer?*<br /><br />We believe our early-stage team members are essential to shaping this business. <br /><br />* Join a small team of around 20 full-time people who love what they do. <br />* Very attractive package of salary and options<br />* Unlimited holiday policy<br />* Flexible working.  Work from the office, your home, or the beach <br />* Company trips several times a year<br />* Discretionary educational budget, which has been spent on things like coding, marketing and other online courses and books",
    "urlFetchPending": false,
    "published": "Feb 20, 2018 3:44:56 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "kFOacubfSVK0J8QOqp_ztQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/articulate-qa-engineer",
    "title": "Articulate: QA Engineer",
    "content": "<div>  <div>    <h2>QA Engineer</h2>      <h4>Posted Feb 13</h4>    <h3>      <span>Articulate</span><br>      <span>Headquarters: 100% Remote</span><br>        <a href='https://articulate.com/company/careers' rel='nofollow'>https://articulate.com/company/careers</a>    </h3>  </div>    </div>  <div>    <div><span><b>About the job</b></span><span><br></span></div><div></div><div></div><div></div><div><span><b><br></b></span></div><div><span>We're makers. We believe the job of a product team is more than just writing and testing code. We are here to create experiences which delight our customers, this is always our top priority.&nbsp;</span></div><div><br></div><div>We're a fully distributed company with a high degree of autonomy and no office space. At Articulate you'll work closely with an awesome team of developers, designers and writers to increase our web presence and improve our community.<br></div><div></div><div></div><div></div><div><br></div><div>The ideal person for this job is a curious QA Engineer with a good eye. This person sweats the details, focuses on quality results instead of effort and sees problems as opportunities to learn and level up as a team. Comfort testing products across multiple platforms&nbsp;from web, desktop to mobile&nbsp;is a must. Solid gif skills and emoji game are big bonus.<br></div><div></div><div></div><div></div><div><br></div><div>You should have a working knowledge of testing methodologies that put the customer first and be committed to seeing those&nbsp;customers achieve success. You'll verify quality through exploratory testing and develop unique and creative workflows to test products - always advocating on behalf of the customer.&nbsp;<br></div><div></div><div></div><div></div><div><span><br></span></div><div><span><b>About the company</b></span><br></div><div></div><div></div><div></div><div><br></div><div>Articulate is a highly successful, fully remote software company that’s changing the way the world learns. Our award-winning e-learning tools are used by 78,000+ organizations across the globe to create engaging online and mobile courses. Our customers include 93 of the Fortune 100 and 19 of the top 20 U.S. universities. And our online community of 550,000+ members is the largest, fastest-growing community in the industry.<br></div><div></div><div></div><div></div><div><br></div><div>We empower employees to thrive by fostering a culture of autonomy, productivity, and respect. We’re all free to exercise our crafts the best way we know how to reach our goals as individuals and teams. Each and every one of us is focused on producing results that directly impact the company’s success. And we all strive to do what’s right by people, both internally and externally, instead of taking the shortest route to the highest profits.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Visit <a href='http://bit.ly/articulate-qa-engineer' rel='nofollow'>http://bit.ly/articulate-qa-engineer</a> to upload your resume &amp; cover letter and tell us why you're a great fit!</p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 13, 2018 8:20:00 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "4TZcA3jJQJuK58asHlPhvw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/167463/quality-assurance-specialist-m-f-komoot?a=Ua2krqZ2j60",
    "title": "Quality Assurance Specialist (m/f) at komoot (Berlin, Germany)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer, Mobile Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cycling, Information Technology, Mobile Application</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Millions of people experience real-life adventures with our apps. We help users all over the world discover the best hiking and biking routes, and we empower everybody to explore more of the great outdoors. And we’re good at what we do: Our users love our high quality product and have confirmed this by giving us 4.5+ stars in the app stores. To keep us satisfying our users as we expand komoot, we are looking for a passionate quality assurance specialist to join our team and help us continue to build the future of outdoor exploration. &nbsp;&nbsp;&nbsp;</p><p><strong><strong>Your key responsibilities</strong></strong></p><ul><li>Monitor and improve the quality of komoot’s iOS, Android and web apps in collaboration with our team of developers, designers, copywriters, and product experts.</li><li>Define relevant tests and execute them for new and existing features.</li><li>Assure the quality of new features through cross-checking behavior, design and copy.</li><li>Keep an overview of bugs and help us enhance/prioritize them in collaboration with developers and our support team.</li><li>Test the product in real world outdoor use cases.</li></ul><p><strong><strong>Why you will love it</strong></strong></p><ul><li>You’ll work on an award winning, global product and you’ll tangibly improve the user experience for millions of people.</li><li>We let you work from wherever you want, be it a beach, the mountains, your home or anywhere else that lies in any time zone between UTC-1 and UTC+3.</li><li>Your expert knowledge will make you a key player amongst a team of highly motivated, talented people.</li><li>You’ll work together with developers to improve and streamline testing processes and tools.</li><li>You’ll travel together with our team to amazing outdoor places several times a year to exchange ideas, learnings and go for hikes and rides.</li><li>You’ll use and improve software that we’re pretty sure you’ll end up using for your personal outdoor trips.</li></ul><p><strong><strong>You will be successful in this position if you</strong></strong></p><ul><li>Are highly self-driven, responsible, reliable and keen to learn and improve.</li><li>Love to use and improve an awesome product for a great user experience by testing it in real world use cases.</li><li>Have proven experience providing quality assurance support for high quality mobile and web apps (2+ years).</li><li>Understand that perfection is impossible but set it as the goal anyway.</li><li>Have strong organizational skills.</li><li>Have experience in working in a distributed team, have good communication skills and love to work together with others in fast development cycles.</li></ul><p><strong><strong>Sounds like you?</strong></strong></p><p>Then send us the following:</p><ul><li>Your CV.</li><li>A write-up explaining who you are and why you are interested in working at komoot.</li><li>Examples of your work (e.g. PDFs, Slideshare, etc.).</li><li>Something that shows us a little more about what you’re interested in, be it your Twitter/Instagram account or your blog.</li><li>As we love people that go the extra mile, you’ll get bonus points for doing something creative with komoot.</li></ul>                    </div>                            <h2>                About komoot            </h2>            <div><p><strong>We Love What We Do</strong></p><p>Komoot is the world’s leading outdoor app. We offer modern explorers best-in-class tech so that hikers and bikers have topographic maps, turn-by-turn navigation, recommendations on cool places and more at their fingertips.</p><p><strong>The Freedom To Rock Your Craft</strong></p><p>The world’s leading outdoor app, komoot hires the best folks to do what they love. Have a passion for the great outdoors and an ability to get things done? You might be the superstar we’re searching for.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work wherever you thrive                            </div>                            <div>                                 38 paid vacation days                            </div>                            <div>                                 Health insurance                            </div>                            <div>                                 Latest computers and devices                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 10, 2018 9:59:56 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/go",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "go"
    ]
  },
  {
    "id": "awwTwh0aQxS3TIt5RIG3Dw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/167534/senior-qa-analyst-red-rock-tech-solutions-llc?a=UbvRjHczqta",
    "title": "Senior QA Analyst at Red Rock Tech Solutions, LLC (Colorado Springs, CO)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer, Mobile Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Location:&nbsp; Colorado Springs, CO (preferred); remote is an option (must reside in the US)</p><p>Industry:&nbsp; Transportation</p><p>Red Rock Tech Solutions (a division of American Logistics Company, LLC) is a growing, entrepreneurial, software development company in the passenger transportation industry.&nbsp; We use a custom-built platform to dispatch, track, and report on thousands of trips for our customers every single day. We are pushing boundaries in databases, mapping, scheduling, routing, and optimization.</p><p>We are looking for a great Senior Software QA Analyst who is well-rounded and passionate about ensuring the quality of our solutions, being an advocate for the end users, and anything else they do. &nbsp;You will be expected to know how to do lots of stuff (or to learn it quickly) – boredom should not be a problem.</p><p>Rather than merely test systems after they are built, our QA team is involved in all steps from requirements creation into development &amp; code review, and through deployment.</p><p><strong>Team Size / Dynamics</strong></p><ul><li>You will be working with a small distributed team: other QA members, and a variety of technical team members (systems- and developer- groups, DBAs, and PMs)</li><li>We are collaborative workers, and use Kanban for task management, and daily Stand Up meetings for coordination</li></ul><p><strong>Technical Environment</strong></p><ul><li>We are heavily invested in Microsoft technology with Windows Server, .NET, and SQL Server serving as the foundation for our systems</li><li>We maintain &amp; develop solutions on a variety of platforms, including mobile, web, and desktop</li></ul><p><strong>Responsibilities</strong></p><ul><li>Review recommended enhancements/additions for incorporation into our products/services</li><li>Help craft requirement specifications that are testable</li><li>Design test plans and scripts from project requirements</li><li>Research &amp; coordinate resolution of issues related to solution quality, consistency &amp; utility</li><li>Maintain accurate tracking of issues and work items</li><li>Ability to guide and assist the team’s various testing activities</li></ul><p><strong>Skills</strong></p><ul><li>Required<ul><li>3+ years within Software QA discipline (or 5+ years in the Software Development Industry)</li><li>Experience with breaking programs &amp; systems built by others</li></ul></li><li>Desired<ul><li>Solid understanding of QA processes, methodologies and best practices</li><li>Experience with automated testing</li><li>Experience with VSTS</li><li>Experience in product development/requirements specification creation</li><li>Experience with Continuous Integration</li><li>Experience with transportation related technologies</li><li>Ability to work constructively with developers, QA, IT, and Project Managers towards a common goal</li></ul></li></ul><p>The other requirements (hard to quantify, but important nonetheless):</p><ul><li>Being passionate is important... the solutions you vet help support our aggressive growth as a company. We want you to own the projects you work on, and make them the best they can be.&nbsp; Transportation is an exciting field, and we are looking for somebody who can get excited about transforming it.</li><li>We need somebody who communicates well. Being able to communicate well in the English language, both written and verbal, is important.&nbsp; You will end up working with people other than developers &amp; technical team members (end users, company management, etc.).</li><li>We require a willingness to adapt and learn. Nobody knows everything, and we don't expect you to either.&nbsp; You will need the ability to pick things up quickly and be nimble in your approach.</li></ul><p>Red Rock Tech Solutions (a division of American Logistics Company, LLC) is an Equal Opportunity Employer.</p>                    </div>                            <h2>                About Red Rock Tech Solutions, LLC            </h2>            <div><p>Red Rock Tech Solutions (a division of American Logistics Company, LLC) is a growing, entrepreneurial, software development company in the passenger transportation industry.&nbsp; We provide a proprietary platform to request, dispatch, track, and report on over ten thousand trips for our customers every single day. We are pushing boundaries in databases, mapping, scheduling, routing, and optimization.</p><p>We are looking for a great Quality Assurance Engineer who is well-rounded and passionate about data, technology, and anything else they do. &nbsp;You will be expected to know how to do lots of stuff (or to learn it quickly) – boredom should not be a problem.</p><p>Red Rock Tech Solutions is an Equal Opportunity Employer.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Comprehensive Health Care Package                            </div>                            <div>                                 401(k) with employer match                            </div>                            <div>                                 Company Paid Life Insurance                            </div>                            <div>                                 Company Paid Long Term Disability                            </div>                            <div>                                 Flexible Spending Account                            </div>                            <div>                                 Volunteer Incentive Program                            </div>                            <div>                                 Great Work/Life Balance                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 10, 2018 9:59:56 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/qa",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  }
]
}
