{
 "items": [
  {
    "id": "w9yNy8HaTuWdinhgCGCiOg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168108/developer-support-specialist-dropsource?a=UnrPSWb5oXe",
    "title": "Developer Support Specialist at Dropsource (Raleigh, NC) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Mobile Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Mobile Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>OPPORTUNITY</strong></p><p>Dropsource is looking for someone to drive and deliver developer support to our users. If you love helping people solve problems and enjoy troubleshooting complex technical issues, this is an opportunity to help our community of users build data-driven and truly native mobile apps on the Dropsource platform. You’ll be part of an innovative, high-tech, well-funded startup working to change the way software is built. The Dropsource editor is a unique development environment that dramatically speeds up the process of app creation. We are not looking for the average customer support person for this role – you will become a Dropsource expert and will provide reliable and professional guidance to our users that will help them to implement a wide variety of app use cases. You’ll regularly debug development projects, specifications, and integrations.</p><p><strong>WHAT YOU’LL DO</strong></p><p>You’ll own Developer Support at Dropsource, taking responsibility for fielding support requests, work with product developers and other team members to ensure swift resolutions to user issues, while aiming to resolve support problems yourself without assistance wherever possible, and build best practices for support. You’ll need to quickly onboard yourself with the platform and other technologies as required, finding the information&nbsp;<em>you</em>&nbsp;need to give our users the help&nbsp;<em>they</em>&nbsp;need to develop their apps. This role needs a self-directed, analytical individual who is motivated by customer success, is keen to create a dialogue with our community, and to capture user feedback on the product.</p><p><strong>Your responsibilities will include:</strong></p><ul><li>Respond to support requests via live chat, forum, email, calls&nbsp;during&nbsp;ET business hours (GMT -5)</li><li>Manage support via a variety of channels, prioritizing effectively between issue and customer types</li><li>Support will include troubleshooting problems in the functionality of user apps / helping users to debug projects, implement app development use cases, and integrate external services with the platform</li><li>Drive support strategy within the team</li><li>Liaise with developers to report and follow up on bugs/issues</li><li>Liaise with other team members to contribute to product, marketing, and education initiatives</li><li>Analyze and report on user feedback</li><li>Advocate for the user perspective, proactively flagging up potential issues</li><li>Help with enterprise client support</li><li>Contribute to product and roadmap discussions and decisions based on your frontline interactions with the Dropsource user community, guarding a customer-first orientation</li></ul><p><strong>Requirements and Qualifications</strong></p><p>The ideal candidate will meet the following requirements:</p><ul><li>Experience delivering technical support</li><li>Ideally you’ve supported users on a developer product</li><li>You’re a problem solver and facilitator, motivated to help people build their projects</li><li>You strive to achieve a high level of responsiveness and are always focused on customer success / satisfaction</li><li>Understanding of software development concepts and willingness to learn</li><li>You might not be a software developer but you can code to a basic level in at least one language (e.g. HTML, Javascript, Java, JSON) and will be confident learning about app development, APIs, data modeling, and tinkering with other technologies as required</li><li>You can pick up skills quickly, synthesizing what you’ve learned and conveying it to others</li><li>Familiarity with mobile development concepts is a plus</li><li>Self-directed, proactively taking responsibility for issues and able to figure out problems with minimal help</li><li>When you encounter something you don’t know, your first instinct is to figure it out yourself, but you know when to ask for help when you do need it</li><li>You enjoy developing constructive relationships with a community of users</li><li>Able to thrive within a fast moving startup environment including people in different locations</li><li>Excellent written communicator, able to convey complex instructions and guidance to people from a diverse range of backgrounds, many speaking English as a second language</li></ul><p>Dropsource Offers</p><p>Dropsource is headquartered in downtown Raleigh, NC and offers flexible office hours, telecommuting options, competitive salaries and benefits and equity participation.</p><p><strong>DROPSOURCE (QUEUE SOFTWARE INC.) IS AN EQUAL OPPORTUNITY EMPLOYER</strong></p>                    </div>                            <h2>                About Dropsource            </h2>            <div><p>Dropsource is a downtown Raleigh, NC based SaaS company founded in 2014. Dropsource is the mobile application development platform (MADP) for developing the next generation of truly native, powerful, data-driven mobile apps. Its unprecedented visual approach, browser-based UI and cloud-based platform enable developers of diverse skill levels to take their apps from concept to prototype to market without manually writing a single line of code. At the heart of Dropsource is a powerful automated code generator that writes lean, clean, editable and truly native source code. As the only platform in its category with a fully visual, drag-and-drop interface, Dropsource is at the forefront of automated programming for mobile apps. Check us out at <a href='http://www.dropsource.com' rel='nofollow'>www.dropsource.com</a>.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Competitive Salaries                            </div>                            <div>                                 Equity Options                            </div>                            <div>                                 Healthcare                            </div>                            <div>                                 New Computer                            </div>                            <div>                                 Free Parking                            </div>                            <div>                                 Company Swag                            </div>                            <div>                                 Unlimited vacation                            </div>                            <div>                                 Work From Home/Remote                            </div>                            <div>                                 401K                            </div>                            <div>                                 Learning Benefits (Free online courses, Audible account, etc.)                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 18, 2018 11:18:35 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/mobile",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "mobile"
    ]
  },
  {
    "id": "FfZTVQkaRWyShGFoZo1rEQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165806/new-green-field-development-of-an-enterprise-follow-appcare?a=TBAc2P2Mtwc",
    "title": "New Green-field Development of an Enterprise Cloud based Platform! at Follow App.Care",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>B2B, B2C, Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong><strong>Software Engineer</strong></strong></p><p>Required:</p><ul><li>.Net 4.5 – preferably C# - 4+ years</li><li>Asp .Net, MVC&nbsp; - 4+ years</li><li>JavaScript – 1+ years</li><li>SQL – 1+ years</li><li>Minimum 4+ years commercial experience delivering projects in the cloud, preferably Azure</li><li>Full Software Lifecycle experience</li><li>Demonstrable knowledge of Architecture design patterns</li></ul><p>Nice to have:</p><ul><li>.Net Core and converting existing .Net Apps to Core</li><li>An understanding of Development methodologies such as TDD and DDD.</li><li>AngularJs 1+ Years</li><li>React experience</li></ul>                    </div>                            <h2>                About Follow App.Care            </h2>            <div><p>Our team works hard to innovate for our customers, so they can focus on what’s most important to them their patients and their business. We provide personalised branded patient engagement software&nbsp;that identifies patients in need and generates valuable feedback.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Remote Working                            </div>                            <div>                                 Exciting company Environment and Culture                            </div>                            <div>                                 Pension Plan                            </div>                            <div>                                 Innovative projects and exposure to the latest technologies                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 10, 2018 9:59:56 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "HgnDYcgbSz-XsNW_ifITSw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/award-force-client-success-jedi-western-europe",
    "title": "Award Force: Client Success Jedi, Western Europe",
    "content": "<div>  <div>    <h2>Client Success Jedi, Western Europe</h2>      <h4>Posted Feb  9</h4>    <h3>      <span>Award Force</span><br>      <span>Headquarters: Sydney, Australia</span><br>        <a href='https://www.awardforce.com/' rel='nofollow'>https://www.awardforce.com/</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>Awesome opportunity to join a fast-growth global startup with a great product!</span></div><div><span>Flexibility to work remotely with a friendly team.</span><br></div><div></div><div></div><div><span>Award Force (</span><a href='http://www.awardforce.com' rel='nofollow'><span>www.awardforce.com</span></a><span>) is a fast-growing Australian SaaS company with a great product, expanding internationally. We are looking for a people person who can develop fantastic client relationships with the aim of loyalty and retention.</span></div><div><span><b><br></b></span></div><div><span><b>Essentials</b></span></div><ul><li><span>You’re located in UK or Western Europe</span><br></li><li><span>Native English speaker (or 100% fluent), bi-lingual is a bonus!</span><br></li><li><span>You love solving problems and helping others solve theirs </span><br></li><li><span>You have a natural aptitude with technology, experience with SaaS and are able to learn new systems quickly</span><br></li><li><span>You’re curious, and love learning. If you don’t know something, you speak up, and if you have an idea for improvement you can’t keep quiet!</span><br></li><li><span>You’re super organised and process oriented. You will be comfortable using multiple tools for various aspects of the role</span><br></li><li><span>You have fantastic interpersonal skills and are an excellent communicator, verbal and written. You are not hesitant to jump on a call with a client even if just to talk about the weather!</span><br></li><li><span>You have the ability to communicate complex issues in plain language</span><br></li><li><span>You’re calm in high pressure situations</span><br></li><li><span>You can work independently, are self-motivated, but enjoy being part of a team</span><br></li><li><span>Working remotely suits you perfectly, &nbsp;your natural work ethic and passion for helping people will keep you motivated!</span><br></li><li><span>You have access to fast, reliable internet and a dedicated space to work without distractions</span><br></li></ul><div><span><b><br></b></span></div><div><span><b>What we offer</b></span><br></div><div></div><div></div><ul><li><span>Full-time role, based remotely</span><br></li><li><span>Competitive salary, commensurate with experience</span><br></li><li><span>Friendly, sociable, responsible team </span><br></li><li><span>Opportunity to grow your career and income with a growing business</span><br></li><li><span>Lots of training and good internal support</span><br></li><li><span>We’re ready to go when you are, the sooner the better</span></li></ul><div><span><br></span></div><div><span><b>About us</b></span></div><div><span>Award Force is the industry-leading cloud software for organisers of awards, grants, scholarships and pitch competitions to manage submission, evaluation and award of results, online.</span><br></div><div></div><div></div><div><span><br></span></div><div><span>We provide the platform to accept awards entries/applications, allocate them to judges/evaluators who then do their judging online, all the while providing organisers clear visibility on how their program is going.</span><br></div><div></div><div></div><div><span><br></span></div><div><span>Since launching in Australia late 2013, we’ve had an outstanding market response and we’re now supporting a growing list of clients across Asia Pacific, Europe, North &amp; South America and the Middle East. </span><br></div><div></div><div></div><div><span><br></span></div><div><span>Award Force is a beautifully designed, high quality system and we make sure all our clients have a fantastic experience!</span><br></div><div></div><div></div><div><span><br></span></div><div><span>Our growing team is distributed across 14 cities in 9 countries, mostly working from home offices. &nbsp;We use a range of internet-based tools for communication and collaboration that help our teams work closely over global distance and time zones. We’re an energetic group of intelligent, creative people, driven by high standards and are passionate about creating and delivering an exceptional product and service.</span><br></div><div></div><div></div><div><span><br></span></div><div><span><b>Your role</b></span><br></div><div></div><div></div><div><span>Based anywhere in Western Europe, you will be communicating with people across countries, cultures and time zones on a daily basis.</span><br></div><div></div><div></div><div><span><br></span></div><div><span>You’ll love this role if you’re self-motivated, genuinely enjoy talking with people and solving problems. Lots of energy, confidence with technology and a sense of humour are a must!</span><br></div><div></div><div></div><div><span><br></span></div><div><span>Like any good startup, it can get messy— responses may be required at odd hours, and our processes are always evolving. You’ll be part of this too. If you have a great idea, let’s test it out! We’re not big on bureaucracy, only results. &nbsp;We don’t expect you to be a slave to your chair, but you will need to be flexible. </span><br></div><div></div><div></div><div><span><br></span></div><div><span>The best part about Award Force? It’s really fun :) It’s a fantastic product, and the people we speak with are diverse and lovely. We work in the recognition industry— every day we help our clients uncover and reward everyday people doing exceptional things!</span></div><div><span><br></span></div><div><span><b>Responsibilities</b></span></div><ul><li><span><b>Client success and retention</b></span><br></li><li><span>Onboard new clients and guide them from sign-off through to launch</span><br></li><li><span>Communicate frequently and effectively with the aim of helping clients grow their program. You will advise best practices, introduce them to new features and keep your finger on how they are feeling about Award Force</span><br></li><li><span>Responsible for 100% retention of your accounts</span></li><li><b>Technical support</b></li></ul><ul><li><span>Issue diagnosis</span><br></li><li><span>Resolution of 1st level support issues via support tickets and phone calls</span><br></li><li><span>Work with the internal team to resolve more complex issues</span></li><li><b>Be amazing with clients</b></li><li>Respond quickly</li><li>Able to really listen to people, get to the heart of the issue and see it through to resolution</li><li>Convey appreciation and respect to our clients at all times</li><li>Perform regular check-ins to make sure all clients feel heard and valued</li><li>Build trusting relationships based on honesty and transparency</li><li><b>Contribute to continuous improvement</b></li></ul><ul><li><span>Identify and report common user issues for product improvement</span><br></li><li><span>Identify and fill gaps in support documentation</span></li><li><span>Be on the lookout for anything that can be better</span></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Submission is via the Award Force system only, the application will take you about 15-20 minutes and applications outside the system will not be considered.Ready? Here you go… <a href='https://careers.awardsplatform.com' rel='nofollow'>https://careers.awardsplatform.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 9, 2018 8:38:27 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/support",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "oE03_lfnQZmUHQJuYBM0EQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/65976/customer-success-manager-at-recruitment365/",
    "title": "Customer Success Manager",
    "content": "We are looking for an organised, analytical and curious Customer Success Manager to join a leading enterprise software company based in London. They provide an innovative platform to some of the biggest companies in the UK and globally. Being a scale-up business, they are now entering the new phase of their fast growth and very ambitious international expansion.<br /><br />You will become a product expert, knowing the platform, marketplace and methodology inside-out to provide advice and best practice support internally and externally. It's important that you are a conscientious individual, always wanting the best for the customers and the team. <br /><br />As the Customer Success Manager, it will be your responsibility to gain a detailed understanding of customers' business structures, people, challenges and requirements to ensure the platform is used to run various initiatives and become part of your clients daily working processes. Along with this you will be required to run complex client renewals to close out in advance of deadlines - forecasting renewal times, percentage and upsell, carrying a specific target number.<br /><br />*You will become an Expert and Advisor doing the following:*<br /><br />*Shift existing client perceptions and habits to encourage widespread change and adoption of platform and methodologies. <br />*Contributing to pre-sales conversations to help win new customers.<br />*Training and enablement of customers on the methodology, industry best practice and how to use the platform for success.<br /><br />*Part of your role will entail account management and retention to a variety of clients. This will involve:*<br /><br />*Driving customers' strategy and growth to embed use of the platform, prove value and create customer advocates.<br />*Carry out Land and Expand strategy by taking new clients and mapping out their delivery plan and potential growth path, managing diverse customers and deliverables.<br />*Working with the client to plot out short, medium and long-term account goals and milestones.<br />*Ensuring the platform is successfully embedded in the organisation by identifying new use cases and working to get the client set up with full user adoption.<br />*Working closely with On-boarding Managers on the set up of new clients to ensure you are well placed to drive forward strategic growth post On-boarding.<br />*Ensuring customers are fully engaged in customer advocacy programmes, participating in thought leadership activities and the community.<br /><br />*Relationship Management and People:*<br /><br />*Building relationships with key customer contacts to ensure high levels of satisfaction and ensure continued growth and partnership.<br />*Building client trust throughout client engagement to foster honest and robust working relationships and become a trusted advisor.<br />*Influencing customers to adopt best practice set up and approaches to bring about long-term success of their initiatives.<br />*Working closely alongside other teams, as well as any external partners or consultancies to ensure we are meeting and balancing all needs.<br />*Participating in though leadership and client events and social activities to form genuine relationships beyond day to day activities.<br />*National and international travel to visit customers onsite, as well as online meetings.<br /><br />*The Person*<br />We are looking for someone with the following characteristics:<br /><br />*Up for hard work: which is really rewarding when the job is done, working within a super fun team.<br />*Problem solver: Looking for and presenting solutions, not problems, whether for customers or internal.<br />*Strong communicator: Able to progress conversations, relationships and deliverables to the desired outcome.<br />*Curious: Always keen to learn (you will never stop) and willing to dig, and ask why / how / what if.<br />*Capacity to learn quickly: Understand, retain and explain a lot of varied information from methodologies and innovation theory, to customer specifics and technical detail/requirements.<br />*Self-aware and emotionally intelligent: Ability to read a room/ customer dynamics/ organisational politics, understand what's required, and be able to position yourself appropriately.<br />*Resilient: Capable of being enthusiastic even when faced with difficult problems.<br />*A strong interest in tech and innovation: with the ability to clearly explain even the most complicated ideas to a non-techy audience.<br />*Excellent IT skills: must be highly proficient in a wide range of functionality on both Mac & PC operating systems.<br />*Ability to display empathy with customers to build solid relationships.<br />",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 12:01:07 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/embedded",
      "TITLE1/support",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "LFahRJqcTdmMSwx94htMjQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/pagely/jobs/113286-wordpress-support-engineer",
    "title": "WordPress Support Engineer",
    "content": "<div><h2>WordPress Support Engineer at Pagely</h2><div>Remote, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>PHP, Wordpress, Nginx, HTML/CSS/PHP/MYSQL</div><div>Compensation</div><div>$45K–$75K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>As a Pagely support tech, you are an integral part of the Pagely team and responsible for creating an exceptional experience for our customers. You strive to provide superior customer support and genuinely enjoy helping people. You love learning and have a strong background of working with WordPress, HTML and CSS and PHP debugging skills. As a support tech you have patience, great communication skills and create graceful solutions to complex problems. You will be responsible for handling all incoming customer support issues, responding in a professional, timely, manner and keeping an open line of communication with customers and between your team members.</p><p>This is a technical customer-facing position, you need to know your way around a linux command line and have an understanding of the building blocks of the WWW (Domains, DNS, Servers, Web Caching, etc.)</p><p>We run a tier-less support organization. There is no designation like Level 1, or 2 for support reps. Here everyone is skilled.</p><p>Basic Requirements</p><p>- Enjoy problem solving<br>- Passion for helping people<br>- Strong troubleshooting skills<br>- Creative problem solving skills<br>- Self motivated and disciplined<br>- Technically adept<br>- Organized with an understanding of prioritizing<br>- Desire to learn</p><p>Technical Requirements</p><p>- Firm grasp in all areas of WordPress (Core, Themes, Plugins)<br>- Linux Command line skills<br>- Skills in LAMP/LEMP stacks<br>- Experience with DNS<br>- Basic knowledge of networks and cloud computing</p><p> PLEASE apply via <a href='https://pagely.com/careers/' rel='nofollow'>https://pagely.com/careers/</a></p></div>",
    "urlFetchPending": false,
    "published": "Feb 5, 2018 6:10:02 PM",
    "tags": [
      "DevOps",
      "Full Time",
      "HTML/CSS/PHP/MYSQL",
      "Nginx",
      "PHP",
      "REMOTE1/100",
      "Remote",
      "Remote OK",
      "TECH1/php",
      "TITLE1/support",
      "TZ/unknown",
      "Wordpress"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "gSqnu-OERMyYwHq8CnZ6tA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165464/support-engineer-scrapinghub?a=TutiJkWY6e4",
    "title": "Support Engineer at Scrapinghub",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Are you interested in supporting web crawlers harnessing the Scrapinghub platform, which powers crawls of over 3 billion pages a month? Do you like working in a company with a strong open source foundation? Scrapinghub helps companies, ranging from Fortune 500 enterprises to up and coming early stage startups, turn web content into useful data with a cloud-based web crawling platform, off-the-shelf datasets, and turn-key web scraping services. Join us in making the world a better place for web crawler developers with our team of top talented engineers working remotely from more than 30 countries.</p><p>Due to business requirements, candidates must be based in the APAC timezone.&nbsp;</p><p><strong>Role Responsibilities</strong></p><ul><ul><li>Provide world class support for our Scrapinghub customers by delighting them in every interaction</li><li>Investigate and resolve issues keeping the customer up to date on progress</li><li>Strong customer focus with a mindset for preventing future recurrence of issues and be an advocate for customer to get the best value possible.</li><li>Demonstrate leadership and ability to work independently to resolve complex technical issues.</li><li>Share ideas, issues and lessons learned with the rest of the team and the community by constantly adding to and updating our Knowledge Base and process documentation.</li><li>Engage with engineering teams to help resolve issues and propose new features/processes that will improve our products and our customer service.</li><li>Act as Subject Matter Expert for existing or new Product and be the advocate for the Product including new product/feature readiness and gathering feedback.</li><li>Assist developers in the customer organizations to help troubleshoot their spider code to the extent you can.</li><li>Provide assistance to internal groups in Scrapinghub to troubleshoot issues and make configuration changes</li><li>Effectively collaborate within the team and with other teams to constantly improve the processes and tools for greater efficiency and better customer satisfaction</li><li>Work closely with Customer Success and Sales to make the onboarding experience smooth for customers during pre-sales and post-sales phase.</li><li>Be available to participate in the weekend on-call rotation - approximately one weekend per month.</li></ul></ul><p><strong>Skills/ Qualifications</strong></p><ul><ul><li>3+ years of support or equivalent experience in a customer facing role</li><li>Basic understanding of Computer Networks (DNS, HTTP, TCP/IP, TLS/SSL)</li><li>Fundamental knowledge of web programming and standards (HTML, Javascript, APIs, REST, JSON, Mysql).</li><li>Experience with any server side programming</li><li>Familiarity with Linux/UNIX or Mac Terminal command-line and simple scripting.</li><li>Basic understanding of Python to be able to write a simple code or review code.</li><li>Excellent verbal and written English skills and ability to articulate a complex system or problem based on the type of audience.</li><li>Strong team player with good analytical and technical writing skills.</li><li>Strong relationship building skills with a sense of collaboration.</li><li>Ability to multi-task and manage multiple priorities and commitments.</li><li>Availability to work full time, during APAC hours.</li></ul></ul>                    </div>                            <h2>                About Scrapinghub            </h2>            <div><p>Founded in 2010, Scrapinghub is a fast growing and diverse technology business turning web content into useful data with a cloud-based web crawling platform, off-the-shelf datasets, and turn-key web scraping services.</p><p>We’re a globally distributed team of over 100 Scrapinghubbers working from over 30 countries who are passionate about scraping, web crawling, and data science.</p><p>As a new Scrapinghubber, you will:</p><p>Become part of a self-motivated, progressive, multi-cultural team.</p><p>Autonomy to make the role your own, supported by great people</p><p>Join a team with huge opportunity to make a difference</p><p>Have the freedom to work from&nbsp;<a href='http://blog.scrapinghub.com/2015/05/12/traveling-tips-for-remote-workers/' rel='nofollow'>wherever you want</a>.</p><p>Have the opportunity to go to conferences and meet with the team from across the globe.</p><p>Get the chance to work with cutting-edge open source technologies and tools.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible working hours                            </div>                            <div>                                 Remote working                            </div>                            <div>                                 Paid time off                            </div>                            <div>                                 Paid open source work                            </div>                            <div>                                 Global team meet ups                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "suQZi_53TMCQWrxamOAjxg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/166866/publisher-support-engineer-mediavine?a=TXCHx7CVpcY",
    "title": "Publisher Support Engineer at Mediavine (Seattle, WA)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Advertising, Advertising Technology, Publishing</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>1-10 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Mediavine, a fast-growing advertising management company representing over 2500 websites in the food, lifestyle, DIY, and entertainment space, is searching for a technical support engineer to assist in supporting our publishers and work with our engineering team to launch new products. We are looking for a junior level developer to assist our support team in triaging bugs and solving technical problems for our publishers.</p><p>We are looking for someone who is comfortable explaining technical issues in non-technical ways, and someone who is able to provide excellent service throughout stressful situations. Since you will be working with publishers who may be dealing with difficult issues, we expect you to be able to empathize with our publishers and help de-escalate situations.</p><p>As a Publisher Support Engineer at Mediavine, you can expect to:</p><ul><li>Troubleshoot and resolve support tickets from publishers</li><li>Work with the development team on plugin rollouts</li><li>Work with the support team to triage different technical problems</li><li>Help to educate publishers on technical concepts &amp; explain in non-technical ways</li><li>Provide basic tweaks to customer blogs</li></ul><p>Requirements:</p><p>Must Haves</p><ul><li>Bachelors Degree in Computer Science OR equivalent technical experience</li><li>Comfortable with HTML, CSS, basic JavaScript &amp; PHP</li><li>Familiar with Content Management Systems (WordPress, Blogger, SquareSpace, etc.)</li><li>2+ years experience in a customer service role</li><li>Excellent problem solving and troubleshooting skills</li><li>Ability to empathize with customers</li><li>Continuous drive to learn</li><li>Native level proficiency with the English language</li><li>Located within the United States</li></ul><p>Bonus points for</p><ul><li>Experience working with Agile Frameworks like SCRUM</li><li>Technical experience within the Wordpress platform</li><li>Experience with transactional databases (SQL, mySQL, etc.)</li></ul><p><strong>Benefits</strong></p><ul><li>Travel opportunities</li><li>Work Remote</li><li>Comprehensive Benefits including 401k, Health, Dental, and Vision insurance</li><li>Learning Allowance</li><li>Access to experienced engineers with direct mentorship opportunities</li><li>Generous Vacation/Time off policies</li></ul>                    </div>                            <h2>                About Mediavine            </h2>            <div><p>Mediavine has been an internet publisher since 2004. We own and operate The Hollywood Gossip, TV Fanatic, Movie Fanatic and Food Fanatic.</p><p>In 2013, when Food Fanatic was launched and our relationship with bloggers began, we learned we weren’t alone in our frustrations with the way most ad networks are run. Since then we've teamed up with over 2000 different publishers to create frustration free advertising experiences running high quality, non intrusive and relevant advertisements.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Travel                            </div>                            <div>                                 Flexible Hours                            </div>                            <div>                                 Work Remote                            </div>                            <div>                                 Comprehensive Benefits                            </div>                            <div>                                 Work with emerging Tech                            </div>                            <div>                                 401k                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "El6JnEWoQJetylLM-vJQOQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/232919-corporate-trainer-consensys-enterprise",
    "title": "Corporate Trainer - ConsenSys Enterprise",
    "content": "<div><h2>Corporate Trainer - ConsenSys Enterprise at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$80K–$160K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Apply here: <a href='https://consensys.net/open-positions/?gh_jid=673662' rel='nofollow'>https://consensys.net/open-positions/?gh_jid=673662</a></p><p>ConsenSys is a venture production studio focused on building and scaling tools, disruptive startups, and enterprise software products powered by decentralized technology, specifically Ethereum. Our mission is to use these solutions to power the emerging economic, social, and political operating systems of the planet.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, security and infrastructure, and more. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us. Our Enterprise team is responsible for solution development and delivery for corporate clients and has led some of the most innovative production blockchain implementations in the world.</p><p>ConsenSys Enterprise is currently seeking a Corporate Trainer who will be responsible for preparing and facilitating training sessions for new and existing employees, as well as clients. The ideal candidate has experience as a Corporate or Executive Trainer, with strong relationship building skills, and has a focus on talent management and development. The Corporate Trainer will utilize a variety of best practices, techniques and educational concepts to effectively guide employees on all aspects of company operations.</p><p>Our Enterprise customers are some of the largest companies and financial institutions in the world and you will need to structure complex trainings and programs. We are the driving force behind two major industry consortia, the Enterprise Ethereum Alliance and Accounting Blockchain Coalition, and contribute significantly to the governance and operations of both.</p><p>About the Role:</p><p>Partner with the Director of Education and Senior Management to determine training needs and ensure that the training curriculum satisfies those needs<br>Provide ongoing coaching and feedback to employees, ensuring they have the necessary tools for success<br>Employ creative training methods to provide an environment where participants are adequately engaged in learning.<br>Manage attendance, training calendars, and records.<br>Seek ongoing feedback and keep lines of communication open to participants, peers and management team; modify sessions as needed<br>Issues assessment tools to monitor participant progress<br>Identify specific skill/gaps to ensure training objectives are satisfied<br>Provide input and makes recommendations regarding the procedures and practices appropriate to training subjects<br>Perform other related duties and activities as required<br>About You:</p><p>The ideal candidate will at a minimum have a Bachelors’ degree in a related discipline or work experience equivalent and experience in Corporate Training of not less than three (3) years<br>Excellent stage presence, ability to train in both large and small employee environments<br>The ability to establish and present the ConsenSys culture<br>Bilingual, or Trilingual a plus<br>Proven customer focused, providing excellent customer service to internal and external team members.<br>Ability to maintain the highest level of confidentiality<br>Excellent organizational skills and the ability to work in a fast-paced environment are essential</p></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:40:39 PM",
    "tags": [
      "Brooklyn",
      "Business Development",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/frontend",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "6pvCt7urS-Geus-jKR0-QA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Customer+Service+Agent&c=Ethfinex&l=Remote&jk=ab3f963e09673663&rtk=1c5g89oku144k3lk&from=rss",
    "title": "Remote Customer Service Agent - Ethfinex - Remote",
    "content": "<div><b>Remote Customer Service Agent</b><br><span>Ethfinex</span>     -<span>Remote</span>    <div>        <span>Full-time,&nbsp;Part-time,&nbsp;Contract</span>        </div></div><span><p><b>Who we are</b></p><p>We’ve assembled a small, agile team, working in remote locations, at the beginning of a fast-moving, disruptive industry.</p><p>We are passionate about what we do. We’re optimistic about the future, and we are hard at work shaping it.</p><p>Ethfinex is an information &amp; exchange platform for ERC20 tokens and Ethereum-based projects. Our mission is to create the home of digital token trading &amp; discussion - the world’s most liquid digital asset exchange platform, owned &amp; run by the people using it.</p><p>Our vision is to create a free and accessible global digital economy by disrupting the current financial services industry. Come join us, and lay the foundation for a decentralised future.</p><p><b>Who we are looking for</b></p><p>We are looking for world-class Remote Customer Service Agents to join our growing team.</p><p>When we say “world-class,” we mean it. We don’t want to be second best. Our goal is to lead not only the industry, but to deliver a level of support which is recognized outside it too.</p><p><b>Responsibilities</b></p><ul><li>Answer a variety of customer queries via different channels, including e-mail, live chat and social media.</li><li>Educate our growing customer base in the use of our tools and the technology which backs it up.</li><li>Investigate technical issues which have resulted in delayed deposits, withdrawals, etc.</li><li>Become an expert in every aspect of our products, such as cryptocurrencies, tokens and trading.</li><li>Be a true advocate for our customers.</li><li>Create tutorial videos and knowledge base articles in order to assist customers in resolving issues independently.</li><li>Collate and filter feedback from customers and make suggestions as to how we can improve our service and increase efficiency (this is an important one, you will have a voice in how we operate, and you will be given the credit you deserve for your success).</li></ul><p><b>Your Experience</b></p><p><b>Essential</b></p><ul><li>You will be remotely located, so laser focused drive and determination are a must.</li><li>1+ years in a Customer Service role responding to large volumes of emails and chats.</li><li>Excellent written and verbal skills (in English).</li><li>Proficient in Mac OS or Linux.</li><li>Strong communication skills, your fellow team members will also be remote.</li><li>Experience of ticketing and/or live chat software (OS Tickets, Zen Desk, Happy Fox etc.)</li><li>Genuine interest in and understanding of cryptocurrencies, tokens and block chain technology.</li><li>Able to explain complex concepts in easy to understand language</li></ul><p><b>Desirable</b></p><ul><li>Experience of working remotely/homeworking.</li><li>Experience in the cryptocurrency/block chain space.</li><li>Additional languages.</li><li>Experience creating tutorial videos and knowledgebase content.</li></ul><p><b>Other Requirements</b></p><ul><li>A quiet space to enable you to work remotely.</li><li>Ability to travel abroad for training if required.</li><li>A stable internet connection of 8 Mbps minimum.</li><li>A Linux or Mac OS computer capable of running multiple applications simultaneously.</li><li>Ability to work flexible hours, remember you will be at home so it’s not all bad.</li></ul><p><b>Keep in mind</b></p><p>Please keep in mind that whomever is successful in securing this role will not be directly employed but will be a contractor. We will pay you a generous salary and you will have the flexibility to work from wherever you want in the world!</p><p>We do however not pay your taxes, insurance etc. so you will be responsible for taking care of that.</p><p>Please also keep in mind that as you will be working remotely we will ask you to install various software packages on your computer including one which monitors productivity when working.</p><p><b>How to apply</b></p><p>In order to apply please include your most up to date CV/Resume as well as telling us a little bit about yourself, your past employment and your thoughts on the industry.</p><p>Please don’t send us a template cover letter, we want to get to know you and find out how you would fit into our team. Show us the real you.</p><p>The ability to communicate via email is essential for this role so unfortunately, we will be unable to consider any applications which do not include a cover letter.</p><p>Please also let us know your availability and your salary expectations in USD.</p><p>Job Types: Full-time, Part-time, Contract</p></span>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 11:03:30 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "sMdFDZNCTw2FZK9dCIyIIw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Customer+Service+Agent&c=Ethfinex&l=Remote&jk=ab3f963e09673663&rtk=1c5gchuka92paene&from=rss",
    "title": "Remote Customer Service Agent - Ethfinex - Remote",
    "content": "<div><b>Remote Customer Service Agent</b><br><span>Ethfinex</span>     -<span>Remote</span>    <div>        <span>Full-time,&nbsp;Part-time,&nbsp;Contract</span>        </div></div><span><p><b>Who we are</b></p><p>We’ve assembled a small, agile team, working in remote locations, at the beginning of a fast-moving, disruptive industry.</p><p>We are passionate about what we do. We’re optimistic about the future, and we are hard at work shaping it.</p><p>Ethfinex is an information &amp; exchange platform for ERC20 tokens and Ethereum-based projects. Our mission is to create the home of digital token trading &amp; discussion - the world’s most liquid digital asset exchange platform, owned &amp; run by the people using it.</p><p>Our vision is to create a free and accessible global digital economy by disrupting the current financial services industry. Come join us, and lay the foundation for a decentralised future.</p><p><b>Who we are looking for</b></p><p>We are looking for world-class Remote Customer Service Agents to join our growing team.</p><p>When we say “world-class,” we mean it. We don’t want to be second best. Our goal is to lead not only the industry, but to deliver a level of support which is recognized outside it too.</p><p><b>Responsibilities</b></p><ul><li>Answer a variety of customer queries via different channels, including e-mail, live chat and social media.</li><li>Educate our growing customer base in the use of our tools and the technology which backs it up.</li><li>Investigate technical issues which have resulted in delayed deposits, withdrawals, etc.</li><li>Become an expert in every aspect of our products, such as cryptocurrencies, tokens and trading.</li><li>Be a true advocate for our customers.</li><li>Create tutorial videos and knowledge base articles in order to assist customers in resolving issues independently.</li><li>Collate and filter feedback from customers and make suggestions as to how we can improve our service and increase efficiency (this is an important one, you will have a voice in how we operate, and you will be given the credit you deserve for your success).</li></ul><p><b>Your Experience</b></p><p><b>Essential</b></p><ul><li>You will be remotely located, so laser focused drive and determination are a must.</li><li>1+ years in a Customer Service role responding to large volumes of emails and chats.</li><li>Excellent written and verbal skills (in English).</li><li>Proficient in Mac OS or Linux.</li><li>Strong communication skills, your fellow team members will also be remote.</li><li>Experience of ticketing and/or live chat software (OS Tickets, Zen Desk, Happy Fox etc.)</li><li>Genuine interest in and understanding of cryptocurrencies, tokens and block chain technology.</li><li>Able to explain complex concepts in easy to understand language</li></ul><p><b>Desirable</b></p><ul><li>Experience of working remotely/homeworking.</li><li>Experience in the cryptocurrency/block chain space.</li><li>Additional languages.</li><li>Experience creating tutorial videos and knowledgebase content.</li></ul><p><b>Other Requirements</b></p><ul><li>A quiet space to enable you to work remotely.</li><li>Ability to travel abroad for training if required.</li><li>A stable internet connection of 8 Mbps minimum.</li><li>A Linux or Mac OS computer capable of running multiple applications simultaneously.</li><li>Ability to work flexible hours, remember you will be at home so it’s not all bad.</li></ul><p><b>Keep in mind</b></p><p>Please keep in mind that whomever is successful in securing this role will not be directly employed but will be a contractor. We will pay you a generous salary and you will have the flexibility to work from wherever you want in the world!</p><p>We do however not pay your taxes, insurance etc. so you will be responsible for taking care of that.</p><p>Please also keep in mind that as you will be working remotely we will ask you to install various software packages on your computer including one which monitors productivity when working.</p><p><b>How to apply</b></p><p>In order to apply please include your most up to date CV/Resume as well as telling us a little bit about yourself, your past employment and your thoughts on the industry.</p><p>Please don’t send us a template cover letter, we want to get to know you and find out how you would fit into our team. Show us the real you.</p><p>The ability to communicate via email is essential for this role so unfortunately, we will be unable to consider any applications which do not include a cover letter.</p><p>Please also let us know your availability and your salary expectations in USD.</p><p>Job Types: Full-time, Part-time, Contract</p></span>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 11:03:30 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "st_-ESwhTKSOv5Hi6xqEnw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Customer+Service+Agent&c=Ethfinex&l=Remote&jk=ab3f963e09673663&rtk=1c5gm7ns49ma3ej6&from=rss",
    "title": "Remote Customer Service Agent - Ethfinex - Remote",
    "content": "<div><b>Remote Customer Service Agent</b><br><span>Ethfinex</span>     -<span>Remote</span>    <div>        <span>Full-time,&nbsp;Part-time,&nbsp;Contract</span>        </div></div><span><p><b>Who we are</b></p><p>We’ve assembled a small, agile team, working in remote locations, at the beginning of a fast-moving, disruptive industry.</p><p>We are passionate about what we do. We’re optimistic about the future, and we are hard at work shaping it.</p><p>Ethfinex is an information &amp; exchange platform for ERC20 tokens and Ethereum-based projects. Our mission is to create the home of digital token trading &amp; discussion - the world’s most liquid digital asset exchange platform, owned &amp; run by the people using it.</p><p>Our vision is to create a free and accessible global digital economy by disrupting the current financial services industry. Come join us, and lay the foundation for a decentralised future.</p><p><b>Who we are looking for</b></p><p>We are looking for world-class Remote Customer Service Agents to join our growing team.</p><p>When we say “world-class,” we mean it. We don’t want to be second best. Our goal is to lead not only the industry, but to deliver a level of support which is recognized outside it too.</p><p><b>Responsibilities</b></p><ul><li>Answer a variety of customer queries via different channels, including e-mail, live chat and social media.</li><li>Educate our growing customer base in the use of our tools and the technology which backs it up.</li><li>Investigate technical issues which have resulted in delayed deposits, withdrawals, etc.</li><li>Become an expert in every aspect of our products, such as cryptocurrencies, tokens and trading.</li><li>Be a true advocate for our customers.</li><li>Create tutorial videos and knowledge base articles in order to assist customers in resolving issues independently.</li><li>Collate and filter feedback from customers and make suggestions as to how we can improve our service and increase efficiency (this is an important one, you will have a voice in how we operate, and you will be given the credit you deserve for your success).</li></ul><p><b>Your Experience</b></p><p><b>Essential</b></p><ul><li>You will be remotely located, so laser focused drive and determination are a must.</li><li>1+ years in a Customer Service role responding to large volumes of emails and chats.</li><li>Excellent written and verbal skills (in English).</li><li>Proficient in Mac OS or Linux.</li><li>Strong communication skills, your fellow team members will also be remote.</li><li>Experience of ticketing and/or live chat software (OS Tickets, Zen Desk, Happy Fox etc.)</li><li>Genuine interest in and understanding of cryptocurrencies, tokens and block chain technology.</li><li>Able to explain complex concepts in easy to understand language</li></ul><p><b>Desirable</b></p><ul><li>Experience of working remotely/homeworking.</li><li>Experience in the cryptocurrency/block chain space.</li><li>Additional languages.</li><li>Experience creating tutorial videos and knowledgebase content.</li></ul><p><b>Other Requirements</b></p><ul><li>A quiet space to enable you to work remotely.</li><li>Ability to travel abroad for training if required.</li><li>A stable internet connection of 8 Mbps minimum.</li><li>A Linux or Mac OS computer capable of running multiple applications simultaneously.</li><li>Ability to work flexible hours, remember you will be at home so it’s not all bad.</li></ul><p><b>Keep in mind</b></p><p>Please keep in mind that whomever is successful in securing this role will not be directly employed but will be a contractor. We will pay you a generous salary and you will have the flexibility to work from wherever you want in the world!</p><p>We do however not pay your taxes, insurance etc. so you will be responsible for taking care of that.</p><p>Please also keep in mind that as you will be working remotely we will ask you to install various software packages on your computer including one which monitors productivity when working.</p><p><b>How to apply</b></p><p>In order to apply please include your most up to date CV/Resume as well as telling us a little bit about yourself, your past employment and your thoughts on the industry.</p><p>Please don’t send us a template cover letter, we want to get to know you and find out how you would fit into our team. Show us the real you.</p><p>The ability to communicate via email is essential for this role so unfortunately, we will be unable to consider any applications which do not include a cover letter.</p><p>Please also let us know your availability and your salary expectations in USD.</p><p>Job Types: Full-time, Part-time, Contract</p></span>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 11:03:30 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "3YycRLPEQpmjvY9xN0okjA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Customer+Service+Agent&c=Ethfinex&l=Remote&jk=ab3f963e09673663&rtk=1c5gsus169tlkba1&from=rss",
    "title": "Remote Customer Service Agent - Ethfinex - Remote",
    "content": "<div><b>Remote Customer Service Agent</b><br><span>Ethfinex</span>     -<span>Remote</span>    <div>        <span>Full-time,&nbsp;Part-time,&nbsp;Contract</span>        </div></div><span><p><b>Who we are</b></p><p>We’ve assembled a small, agile team, working in remote locations, at the beginning of a fast-moving, disruptive industry.</p><p>We are passionate about what we do. We’re optimistic about the future, and we are hard at work shaping it.</p><p>Ethfinex is an information &amp; exchange platform for ERC20 tokens and Ethereum-based projects. Our mission is to create the home of digital token trading &amp; discussion - the world’s most liquid digital asset exchange platform, owned &amp; run by the people using it.</p><p>Our vision is to create a free and accessible global digital economy by disrupting the current financial services industry. Come join us, and lay the foundation for a decentralised future.</p><p><b>Who we are looking for</b></p><p>We are looking for world-class Remote Customer Service Agents to join our growing team.</p><p>When we say “world-class,” we mean it. We don’t want to be second best. Our goal is to lead not only the industry, but to deliver a level of support which is recognized outside it too.</p><p><b>Responsibilities</b></p><ul><li>Answer a variety of customer queries via different channels, including e-mail, live chat and social media.</li><li>Educate our growing customer base in the use of our tools and the technology which backs it up.</li><li>Investigate technical issues which have resulted in delayed deposits, withdrawals, etc.</li><li>Become an expert in every aspect of our products, such as cryptocurrencies, tokens and trading.</li><li>Be a true advocate for our customers.</li><li>Create tutorial videos and knowledge base articles in order to assist customers in resolving issues independently.</li><li>Collate and filter feedback from customers and make suggestions as to how we can improve our service and increase efficiency (this is an important one, you will have a voice in how we operate, and you will be given the credit you deserve for your success).</li></ul><p><b>Your Experience</b></p><p><b>Essential</b></p><ul><li>You will be remotely located, so laser focused drive and determination are a must.</li><li>1+ years in a Customer Service role responding to large volumes of emails and chats.</li><li>Excellent written and verbal skills (in English).</li><li>Proficient in Mac OS or Linux.</li><li>Strong communication skills, your fellow team members will also be remote.</li><li>Experience of ticketing and/or live chat software (OS Tickets, Zen Desk, Happy Fox etc.)</li><li>Genuine interest in and understanding of cryptocurrencies, tokens and block chain technology.</li><li>Able to explain complex concepts in easy to understand language</li></ul><p><b>Desirable</b></p><ul><li>Experience of working remotely/homeworking.</li><li>Experience in the cryptocurrency/block chain space.</li><li>Additional languages.</li><li>Experience creating tutorial videos and knowledgebase content.</li></ul><p><b>Other Requirements</b></p><ul><li>A quiet space to enable you to work remotely.</li><li>Ability to travel abroad for training if required.</li><li>A stable internet connection of 8 Mbps minimum.</li><li>A Linux or Mac OS computer capable of running multiple applications simultaneously.</li><li>Ability to work flexible hours, remember you will be at home so it’s not all bad.</li></ul><p><b>Keep in mind</b></p><p>Please keep in mind that whomever is successful in securing this role will not be directly employed but will be a contractor. We will pay you a generous salary and you will have the flexibility to work from wherever you want in the world!</p><p>We do however not pay your taxes, insurance etc. so you will be responsible for taking care of that.</p><p>Please also keep in mind that as you will be working remotely we will ask you to install various software packages on your computer including one which monitors productivity when working.</p><p><b>How to apply</b></p><p>In order to apply please include your most up to date CV/Resume as well as telling us a little bit about yourself, your past employment and your thoughts on the industry.</p><p>Please don’t send us a template cover letter, we want to get to know you and find out how you would fit into our team. Show us the real you.</p><p>The ability to communicate via email is essential for this role so unfortunately, we will be unable to consider any applications which do not include a cover letter.</p><p>Please also let us know your availability and your salary expectations in USD.</p><p>Job Types: Full-time, Part-time, Contract</p></span>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 11:03:30 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "jq2KtaeHRyuA1UOmC_8lrA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16286390",
    "title": "FreeAgent, Edinburgh and REMOTE (UK-only) https://www.freeagent.com At FreeAgent we help freelancers and micro-businesses be more successful ...",
    "content": "<div>                  <span>FreeAgent, Edinburgh and REMOTE (UK-only)<p><a href='https://www.freeagent.com' rel='nofollow'>https://www.freeagent.com</a></p><p>At FreeAgent we help freelancers and micro-businesses be more successful by putting them in control of their company finances.</p><p>We have built an award-winning online accounting product that offers full end-to-end compliance, from time tracking to tax return filing. We're based in beautiful Edinburgh and we're growing from strength to strength with over 60,000 paying customers and strong YoY growth. Our NPS is off the charts (70!) - customers love what we do!</p><p>We're a growing team of over 140 people, and recently became a public company listed on AIM ($FREE.L). The majority of our team are based in Edinburgh but we have staff distributed across the UK. If you want to help us make small businesses awesome at doing their finances, we're have great opportunities in our product and engineering team. Our stack is currently Ruby/Rails, JavaScript, React.js, MySQL, RabbitMQ, Elasticsearch, SmartOS.</p><p>We currently have senior full-stack and operations engineers vacancies available. Senior engineers at FreeAgent have the opportunity to provide technical leadership and help to grow their teams. We like to work with people who show initiative and continually seek to improve themselves, their teammates, and our codebase. Our product teams are small and cross functional, enjoying a great degree of responsibility. We invest in our platform (code health, scalability, security) as well as working on new features.</p><p>You can apply directly via the website – <a href='https://www.freeagent.com/company/careers' rel='nofollow'>https://www.freeagent.com/company/careers</a> – or feel free to get in touch with me directly: maria [at] freeagent [dot] com.</p><p>(We are looking for UK-based full-time staff and contractors only right now)<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 12:09:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH1/ruby",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet",
      "ruby"
    ]
  },
  {
    "id": "Z3MyvjAvQvS6m6Uaxd7QHA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/doist-support-specialist-bilingual-chinese-english",
    "title": "Doist: Support Specialist (Bilingual Chinese/English)",
    "content": "<div>  <div>    <h2>Support Specialist (Bilingual Chinese/English)</h2>      <h4>Posted Jan 31</h4>    <h3>      <span>Doist</span><br>      <span>Headquarters: Remote</span><br>        <a href='https://doist.workable.com/jobs/503762/candidates/new' rel='nofollow'>https://doist.workable.com/jobs/503762/candidates/new</a>    </h3>  </div>    </div>  <div>    <div>At Doist,<span> our mission is to inspire the workplace of the future by creating simple yet powerful productivity tools (like </span><span><a href='http://www.todoist.com' rel='nofollow'><span>Todoist</span></a><span> and </span><a href='https://twistapp.com/' rel='nofollow'><span>Twist</span></a>) that promote a more balanced, more fulfilling way to live. </span>Our best resource, hands-down, is our team. For the last five years, we’ve focused on fostering an amazing culture of scrappiness, independence, responsibility and ownership. We believe that a strong, vibrant and cohesive company culture comes before anything else.</div><div><br></div><div>Our diverse international team continues to grow and, now, we are seeking to hire a Bilingual Support Specialist who has a passion, the right skills, and a solid experience to deliver excellent customer service and delight our customers with care.</div><div><b><br></b></div><div><b>YOUR ROLE</b></div><div><br></div><div><b>In this full-time, fast-paced and intellectually challenging role, you’ll be: </b><br></div><div></div><div></div><ul><li>Delivering outstanding multi-channel (Zendesk, social media, blog, app stores, etc.) customer support in English and Chinese</li><li>Reproducing product issues, reporting them to the appropriate engineering teams and monitoring their status</li><li>Sharing user feedback with internal teams to identify customer needs and translate user insights into a better product experience</li></ul><div><br></div><div><b>REQUIREMENTS</b></div><div><b><br></b></div><div><b>We’re looking for someone with:</b><br></div><div></div><div></div><div></div><div></div><ul><li>Native-level fluency, both written and spoken, in English and Chinese (additional language skills is a plus)</li><li>Good understanding of at least 2 of the following operating systems: macOS, Windows, Android, iOS</li><li>Excellent writing skills with an articulate, conversational style</li><li>Extremely proactive, organized and responsible, with the ability to work well independently and as part of a team</li><li>Demonstrated passion for customer care</li><li>Enthusiasm about working in an international, multi-cultural environment</li><li>Willingness to work flexible hours and weekend shifts when required</li><li>Ideal applicants are existing Todoist users who use the product regularly</li></ul><div><br></div><div><b>BENEFITS</b></div><div><br></div><div>We’re bootstrapped, profitable, and committed to building a sustainable company that will continue to grow for decades to come. That means we value work-life balance and invest in our employees’ long-term growth.</div><div><br></div><div> <b>We offer:</b><br></div><div></div><div></div><div></div><div></div><ul><li>Competitive compensation</li><li>Generous paid vacation + national holidays</li><li>Education stipends</li><li>Flexible schedule and location</li><li>And much more</li></ul><div><br></div><div>This is a remote position, so you will be free to work from wherever you please on whatever schedule works best for you. You’ll also have the option to work from our office in Porto, Portugal, Barcelona, Spain, or rent a co-working space in the city where you live.</div><div><br></div><div>We invite you to learn more about how we work on <a href='http://workable.com/nr?l=https%3A%2F%2Fblog.doist.com%2F' rel='nofollow'>Doist’s Ambition &amp; Balance blog</a>.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://doist.workable.com/jobs/503762/candidates/new' rel='nofollow'>https://doist.workable.com/jobs/503762/candidates/new</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 5:13:17 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "KGljM8CeSHW5EVER-VjvmQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/65721/onboarding-and-support-specialist-founding-member-at-an-events-app/",
    "title": "Onboarding and support specialist (founding member)",
    "content": "Onboarding and support specialist for an events app (contractor)<br /><br />The big picture - we sell, onboard and account manage the products and services of tech companies that are looking to gain traction abroad without the risk and cost of setting up there. This specific role is to onboard and support customers on an events app.<br /><br />Job spec<br /><br />This is a great opportunity for someone to get in early as a founding member whilst making some decent coin. This will initially not require much of your time however you will need to have flexibility during the day (perfect as a side project for someone). This role is as much about managing relationships and problem solving as it is about tech.<br /><br />When one of our sales team makes a sale for an event or a series of events, it's assigned to a support specialist (you). You'll make initial contact with the client for an 'onboarding call' during which you'll confirm with them what they want and what that means in terms of configuring the app for their purpose. This is usually a back and forth process and, on average, takes hours not days.<br /><br />Once the onboarding process is complete and the event is ready, we switch to support mode. This consists of:<br />- testing the app before the event to make sure it works<br />- calling the client just before the event to see if they need any assistance<br />- being available to them during the event in case something goes wrong - sometimes we can troubleshoot level one issues and sometimes we have to escalate them to our tech team<br />- contacting the client post event to see how things went<br /><br />On offer<br /><br />10% of revenue and shares (not a salaried position)<br />Can work remotely<br />You won't have to do anything until we've made a sale then it will be handed over to you<br />Note - this is an opportunity to get involved in a startup that's currently in the garage stage<br /><br />Ideal for<br />A student/recent graduate looking for startup experience and a side hustle<br />A freelancer looking to add another project to their calendar<br /><br />If you have any questions please feel free to get in contact. We look forward to hearing from you.",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 11:49:16 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Z8QRoLbVRd2kKAIVHmHpPw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/wp-all-import-wordpress-customer-support-for-wp-all-import",
    "title": "WP All Import: WordPress - Customer Support for WP All Import",
    "content": "<div>  <div>    <h2>WordPress - Customer Support for WP All Import</h2>      <h4>Posted Jan 29</h4>    <h3>      <span>WP All Import</span><br>      <span>Headquarters: The Internet</span><br>        <a href='http://www.wpallimport.com/hiring/' rel='nofollow'>http://www.wpallimport.com/hiring/</a>    </h3>  </div>    </div>  <div>    <div><b>$30 per hour and a minimum of 30 hours per week.</b></div><div><br></div><div>Our team is 100% remote and distributed across the world. We have team members in the US, Canada, Thailand, India, Ukraine, and Romania. It doesn’t matter where you live or what time zone you’re in.</div><div><br></div><div>Your main responsibility will be to reply to customers asking for help with WP All Export and WP All Import. You need to love to help others and be able to eeep it friendly even when dealing with difficult customers. You need to enjoy the whole process of turning anxious, confused, or angry customers into happy ones. You must be an excellent writer. We want our support replies to be friendly, easy to understand, and concise.</div><div><br></div><div><b>›&nbsp;</b><b>›&nbsp;</b><b>Flexibility</b></div><div>We are a small team, but we try to give everyone as much flexibility as possible. Flexibility means that you can work in the mornings, or the evenings, or both, or in the middle of the night, or whatever. It means you can take two weeks off to go on a trip. It means you can wake up and decide you don’t feel like working and take the day off without telling anyone.</div><div><br></div><div>It doesn’t mean you can work 50hrs one week and then 5hrs the next. It doesn’t mean that you can work two 15 hour days and then take the rest of the week off.</div><div><br></div><div><b>›&nbsp;</b><b>›&nbsp;</b><b>Responsibilities</b></div><div>Our customer support reps are expected to perform the following tasks:</div><ul><li><span>Respond to customer support inquiries</span><br></li><li>Add to and improve documentation</li><li>Aggregate user feedback and assist with roadmap decisions</li><li>Reproduce bugs and test fixes</li><li>Test development versions of WP All Import before release<br></li></ul><div></div><div><br></div><div><b>›&nbsp;</b><b>›&nbsp;</b><b>Minimum Requirements</b></div><div>Candidates must have the following knowledge and experience in order to be considered:</div><ul><li>Minimum availability of 30 hours per week.</li><li>Expert-level WordPress knowledge: troubleshooting, development, database structure, etc.</li><li>Intermediate-level PHP knowledge. Can quickly write PHP functions, use arrays, and make use of our API.</li><li>Familiarity with&nbsp;phpMyAdmin, cPanel, WordPress sites via FTP.</li><li>Fast, hands on learner. Can quickly pick up new software, PHP functions, and related technologies.</li><li>Able to communicate in a concise and timely manner via Basecamp and GitHub.<br></li></ul><div></div><div><br></div><div><b><br></b></div><div><b>›&nbsp;</b><b>›&nbsp;</b><b>Bonus Points</b></div><div></div><div>The more of these boxes you can tick the better, in descending order of importance:</div><ul><li>Experience with WooCommerce.<br></li><li>Experience in plugin development.<br></li><li>Up to date knowledge of WordPress.<br></li><li>Knowledge of XPath.<br></li><li>Attends WordCamps, meetups, or other industry conferences.<br></li><li>Experience working remotely as part of a distributed team.<br></li></ul><div></div><div><br></div><div><b>›&nbsp;</b><b>›&nbsp;</b><b>To Apply</b></div><div>Visit http://www.wpallimport.com/hiring/#apply.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='http://www.wpallimport.com/hiring/#apply' rel='nofollow'>http://www.wpallimport.com/hiring/#apply</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 28, 2018 7:20:11 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "1kn_W58aS6GujQg7QYpkTw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/taxjar-technical-support-specialist",
    "title": "TaxJar: Technical Support Specialist",
    "content": "<div>  <div>    <h2>Technical Support Specialist</h2>      <h4>Posted Jan 27</h4>    <h3>      <span>TaxJar</span><br>      <span>Headquarters: Fully Remote, US</span><br>        <a href='https://www.taxjar.com/jobs' rel='nofollow'>https://www.taxjar.com/jobs</a>    </h3>  </div>    </div>  <div>    <div>TaxJar’s remote-only team of nearly 30 people is growing fast. We have an immediate opening on our Technical Success team for someone who is passionate about helping people and working with software.</div><div></div><div><br></div><div><h3>On the Technical Success Team you will</h3></div><div><br></div><ul><li>Solve technical problems for customers on a daily basis. Our technical success specialists need to be fast learners and get up to speed quickly on our product and integrations.</li><li>Categorize and quickly respond to customer questions and requests via email</li><li>Face debugging issues not only within our own codebase but also with the many technologies employed by our customers.</li><li>Troubleshoot&nbsp;<a href='http://workable.com/nr?l=https%3A%2F%2Fdevelopers.taxjar.com%2Fapi%2Freference%2F' rel='nofollow'>SmartCalcs API</a>&nbsp;questions, and help customers with&nbsp;<a href='http://workable.com/nr?l=https%3A%2F%2Fwww.taxjar.com%2Fguides%2Fsales-tax-guide-for-woocommerce%2F%23how-to-install-the-woocommerce-sales-tax-plugin-from-taxjar' rel='nofollow'>WooCommerce plugin</a>&nbsp;and&nbsp;<a href='http://workable.com/nr?l=https%3A%2F%2Fwww.taxjar.com%2Fguides%2Fintegrations%2Fmagento%2F%23getting-started-with-taxjar' rel='nofollow'>Magento extension</a>&nbsp;questions</li><li>Track all customer requests and trending product issues</li><li>Distill complex issues into underlying causes and work directly with our product development teams to deploy solutions while consistently delivering world-class support.</li><li>Interact with the developers to help identify root causes to bugs and exceptions reported by customers or by our application.</li></ul><div><br></div><div><h3>Requirements</h3></div><div>This is a full-time remote position, available to folks located in the continental US only.</div><div><br></div><ul><li>1+ years in technical help desk role</li><li>Demonstrate an ability to troubleshoot errors in Ruby and PHP applications</li><li>Experience supporting open source carts like WooCommerce and Magento.</li><li>Highly-skilled in written and verbal communications</li><li>Experience working with a remote team</li><li>Extremely patient...sales tax can be painful and our goal is to ease that pain :-)</li><li>Help monitor and support 24/7 applications and services</li><li>Approaches success from the customer’s point of view</li><li>Enjoys teaching</li><li>Able to explain complex concepts in easy to understand language</li><li>Interested in understanding the ins-and-outs of sales tax</li><li>Attentive to details, both in communication and in explaining how TaxJar works</li></ul><div><span><br></span></div><div><h3>Benefits</h3></div><div><br></div><div>Visit&nbsp;<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttps%2525253A%2525252F%2525252Fwww.taxjar.com%2525252Fjobs%2525252F' rel='nofollow'>www.TaxJar.com/jobs</a>&nbsp;for a full list of benefits and remote perks that we offer all employees.</div><div><br></div><div><h3>About TaxJar</h3></div><div><br></div><div>TaxJar is the leading technology solution for busy eCommerce sellers to manage sales tax, and is trusted by more than 10,000 businesses. We were founded to help eCommerce owners spend less time on sales tax and more time growing the businesses they love. We’re profitable and growing quickly in a space with unlimited opportunity.</div><div><br></div><div><a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttp%253A%252F%252Fworkable.com%252Fnr%253Fl%253Dhttp%25253A%25252F%25252Fworkable.com%25252Fnr%25253Fl%25253Dhttps%2525253A%2525252F%2525252Flife.taxjar.com%2525252F' rel='nofollow'>We’re a happy team</a>&nbsp;and we all really love what we do. We've created a space where high-achievers can succeed, but are also safe to fail. We're profitable and focused on growing TaxJar sustainably. We're always learning how to make TaxJar the best place to work for all of us, and not just another tech startup. We’re always looking for an amazing new teammates to come share in the excitement of solving real-world problems with technology.</div><div><br></div><div><span><b>If you're not the perfect fit for this position, but you know someone who is, we'll pay you $1,000 if you refer us to the person we hire.</b></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Got what it takes? Apply here: <a href='https://taxjar.workable.com/jobs/652935/candidates/new' rel='nofollow'>https://taxjar.workable.com/jobs/652935/candidates/new</a> Treat this as a first interview. Fair warning: we get lots of resumes. You have to stand out in order to advance to the next phase in our hiring process.</p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 26, 2018 4:59:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "fI7DGjkaSSmT7QO0KmV-Rg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/65542/customer-success-manager-at-nickelled/",
    "title": "Customer Success Manager",
    "content": "&quot;Nickelled&quot;:https://www.nickelled.com is looking for a customer success manager who can help us take our customers to the next level.<br /><br />We’re a fast-growing SaaS company where our customers come first - and we’re looking for somebody who understands the processes behind what makes them successful. If you’re passionate about getting to the nuts and bolts of business problems and working as part of a trusting team to find a resolution, you’re the sort of person that we want to talk to.<br /><br />We are not a traditional company - we work remotely, we’re highly independent, we set our own targets, and we’re deliberately picky about the kind of customers who we work with. This makes for a challenging, stimulating, friendly and fun environment in which your ideas go further and your efforts produce results faster than in a “traditional” business.<br /><br />You’ll be expected to help our new clients get up to speed, troubleshoot problems as they arise and proactively reach out to customers who we think might be struggling to get value from our systems.<br /><br />We are looking for somebody who:<br /><br />* Takes a consultative approach to problem-solving<br />* Is comfortable with technology basics<br />* Can work with the CEO of a customer as easily as they can the support team<br />* Enjoys understanding and breaking down problems<br />* Has a friendly, fun, professional tone<br />* Is happy to call up a customer to get things moving<br />* Can be proactive on a daily basis -- and stay organised at the same time<br />* Has limitless positivity<br />* Has excellent spoken and written English<br />* Is persistent - and not discouraged if someone doesn’t answer your first … or fifth email<br />* Is happy to be firm, without being rude<br /><br />If this sounds like you, we should talk - start by sending us your resume/CV or LinkedIn profile. This position is part time (two days a week) and suitable for remote workers from anywhere in the world.<br /><br />About Nickelled<br /><br />Nickelled allows anyone to build interactive, code-free walkthroughs to train, onboard and convert every user. Our easy step-by-step guides can be added to any website WITHOUT code integration - you can create your first Nickelled website walkthrough in minutes and share with colleagues, customers or prospects in seconds. Customers large and small, including Gumtree (an eBay company), The World Bank and Gengo use Nickelled to train their customers or teams on everything from new website updates, work processes and online tools.<br /><br />Nickelled was founded in 2014 and is registered in London, United Kingdom.<br />",
    "urlFetchPending": false,
    "published": "Jan 26, 2018 7:07:30 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "LNyeLUhPSBa7OgMjxZB5Mw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "unicornhunt.io",
    "url": "https://unicornhunt.io/jobs/onboarding-and-support-specialist-at-an-events-app",
    "title": "Onboarding and support specialist |founding member",
    "content": " <p>Onboarding and support specialist for an events app (contractor)</p><p></p><p>The big picture - we sell, onboard and account manage the products and services of tech companies that are looking to gain traction abroad without the risk and cost of setting up there. This specific role is to onboard and support customers on an events app.<br></p><p></p><p><b>Job spec</b></p><p>This is a great opportunity for someone to get in early as a founding member whilst making some decent coin. This will initially not require much of your time however you will need to have flexibility during the day (perfect as a side project for someone). This role is as much about managing relationships and problem solving as it is about tech.</p><p>When one of our sales team makes a sale for an event or a series of events, it's assigned to a support specialist (you). You'll make initial contact with the client for an 'onboarding call' during which you'll confirm with them what they want and what that means in terms of configuring the app for their purpose. This is usually a back and forth process and, on average, takes hours not days.<br>Once the onboarding process is complete and the event is ready, we switch to support mode. This consists of:<br>- testing the app before the event to make sure it works<br>- calling the client just before the event to see if they need any assistance<br>- being available to them during the event in case something goes wrong - sometimes we can troubleshoot level one issues and sometimes we have to escalate them to our tech team<br>- contacting the client post event to see how things went</p><p></p><p><b>On offer</b></p><p></p><p></p><ul><li>10% of revenue and shares (not a salaried position)<br></li><li>Can work remotely<br></li><li>You won't have to do anything until we've made a sale then it will be handed over to you.<br></li></ul><p></p><p></p><p>Note - this is an opportunity&nbsp;to get involved in a startup that's&nbsp;currently&nbsp;in the garage stage.</p>Ideal for<ul><li>A student/recent graduate looking for startup experience and a side hustle</li></ul><ul><li>A freelancer looking to add another project to their calendar</li></ul>If you have any questions please feel free to get in contact. We look forward to hearing from you.<p></p> ",
    "urlFetchPending": false,
    "published": "Jan 25, 2018 8:06:33 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "2yYss_hRQRGCwDt6Yl1FjA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/decisiv-inc-support-agent",
    "title": "Decisiv, Inc.: Support Agent",
    "content": "<div>  <div>    <h2>Support Agent</h2>      <h4>Posted Jan 26</h4>    <h3>      <span>Decisiv, Inc.</span><br>      <span>Headquarters: Glen Allen, VA</span><br>        <a href='https://www.decisiv.com/support-agent-remote' rel='nofollow'>https://www.decisiv.com/support-agent-remote</a>    </h3>  </div>    </div>  <div>    <div><h3><span>Job Summary</span></h3></div><div><span>Decisiv is looking for talented support professionals to work remotely on a contract basis as we simultaneously grow our customer base outside of North America and update/expand our platform and its underlying technology stack.</span><br></div><div><span>We need great people to support Decisiv’s cloud-based Service Relationship Management (SRM) platform outside of North America and to help our Support team evolve from a co-located, startup-style, North-America-only team to a highly-professional, remote-first, worldwide Support organization.</span><br></div><div><h3><span>What You’ll Be Doing</span></h3></div><div><span>Decisiv Support is a small, fast-growing, and remote-first team, so you'll acquire experience on a variety of technologies and support situations while working with us. That said, here are some things you're likely to do as a Support Agent:</span></div><div><br></div><ul><li><span></span><span>Support customers’ day-to-day support requests via email, telephone, live chat, or in-app</span></li><li><span></span><span>Thoroughly documenting potential defects for troubleshooting by Support Engineers and QA</span></li><li>Monitor platform performance and triage customer-reported problems</li><li><span></span><span>Work effectively and efficiently under limited supervision, earning autonomy to use initiative and independent judgment</span></li><li><span></span><span>Evaluate current and new Decisiv functionality and create written and visual content for knowledge base articles &amp; videos, tool tips, and template responses to customer questions and problems</span></li><li><span></span><span>Learn! Our Support team and our platform are evolving, so there will be many opportunities to learn and grow.</span></li></ul><div><h3><span>Necessary Qualifications</span></h3></div><ul><li><span></span><span>1+ year(s) of academic or technical experience with:</span></li><li><span></span><span>Desktop and mobile operating systems</span></li><li><span></span><span>All major browsers and versions</span></li><li><span></span><span>Common web protocols and technologies such as HTTP, FTP, email deliverability; and network connectivity</span></li><li><span></span><span>Reading and interpreting log files, regardless of source application</span></li></ul><div><li><span></span><span>1+ years of support experience in a technology environment comparable to Decisiv</span></li><li><span></span><span>Ability to clearly articulate complex thoughts in any situation, from having a technical discussion with an engineer to working with a non-technical user</span></li><li><span></span><span>Ability to manage time and prioritize efficiently</span></li><li><span></span><span>Ability to create ‘How To’ videos, knowledge base articles, application walk-throughs, or other similar content</span></li><li><span></span><span>Bachelor’s degree or an equivalent combination of education and experience (a degree is&nbsp;<strong>not</strong>&nbsp;required!)</span></li><li><span>Proficient spoken and written communication skills in both American English and&nbsp;<em>at least one of</em>&nbsp;the following: Spanish, French, Swedish, or Japanese.</span></li><h3><span>Other Requirements</span></h3><span></span><span></span></div><ul><li><span>Reliable access to an appropriate work&nbsp;</span>location where you can take telephone &amp; video calls and record high-quality video &amp; audio without interruption, distraction, or background noise</li></ul><div><span></span><span></span></div><ul><li><span>A strong, stable broadband internet connection that can handle simultaneous Voice Over Internet Protocol (VOIP) calls, streaming video, and comparable high-bandwidth applications (typically, 8 Mbps upload / 1.5 Mbps download at a minimum)</span></li></ul><ul><li><span></span><span>Availability to work&nbsp;</span><span>40 hours per week&nbsp;</span><span>and be “on-call”<span>&nbsp;</span></span><span>for select weekends (typically, one weekend every other month)&nbsp;</span><span>within Decisiv Support's hours of operations</span><span></span></li></ul><div><span></span><span></span></div><ul><li><span>Located full-time in one of the following locations or time zones:</span></li><li><span></span><span>Gothenburg, Sweden</span></li></ul><ul><li><span></span><span>Ageo, Japan</span></li><li><span>Central Time</span></li><li><span></span><span>Mountain Time</span></li><li><span></span><span>Pacific Time</span></li><li><span></span><span>Western European Time</span></li><li><span></span><span>Central European Time</span></li><li><span></span><span>Japan Standard Time.</span></li></ul><div><h3><span>Desirable Qualifications</span></h3></div><ul><li><span></span><span>Academic or technical experience with a well-known programming or scripting language (e.g., Ruby on Rails, Java/C++, JavaScript, PHP, Python)</span></li><li><span></span><span>Experience creating ‘How To’ videos, knowledge base articles, application walk-throughs, or other, similar content</span></li><li><span></span><span>Experience with maintenance &amp; repair functions for commercial vehicles (or a comparable industry)</span></li><li><span></span><span>Experience with Decisiv Support’s technology stack (e.g., Zendesk, github, Jira, Confluence, Slack, Zoom, New Relic, Pager Duty, StatusPage.io, Pendo.io)</span></li><li><span></span><span>Proficient spoken and written communication skills in more than two languages (i.e., American English and two or more of Spanish, French, Swedish, Japanese, or other languages).</span></li></ul><div><h3><span>Why work with Us?</span></h3></div><div><span>Our Support group is a small, tight-knit, and scrappy team that’s fixated on helping our users succeed. We value empathy, selflessness, action, transparency, clarity, and productivity/results. We invest in our team through get-togethers, group learning, conferences, and trying new things. We believe in bringing a diversity of experiences, knowledge, viewpoints, and voices to our team as we transform into a worldwide Support organization.</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Does the role seem like a good fit for you? If so, we want to hear from you! Applying is easy. Just submit the following to <a href='mailto:careers@decisiv.com' rel='nofollow'>careers@decisiv.com</a>:1. Your most current resume2. Cover letter (see below for more details)While applying is pretty easy, standing out among candidates does take effort. You see, it’s pretty hard (and very time consuming) for us to find the truly great candidates, so we ask you make it really obvious to us just how great you are. The easiest way to do that is to address the following questions/topics in your cover letter: 1. What would you work on if you were given a month to do anything that would help users be successful with an application and need less help from Support?2. Why do you want to work in Support, and why would you be a great Decisiv Support Engineer?3. What are your career goals, and how does a Support role and working at Decisiv fit with those goals?4. If you have them, share examples of Support content you’ve personally created (e.g., How-To videos, knowledge base articles, FAQs, API documentation). Don’t have any of your own examples? Share some examples that you think are really good and tell us why.</p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 25, 2018 3:41:35 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/ruby",
      "TITLE1/support",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "c",
      "ruby"
    ]
  },
  {
    "id": "C-keAv3CQZi3Wg8jC6aKeQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/decisiv-inc-support-engineer",
    "title": "Decisiv, Inc.: Support Engineer",
    "content": "<div>  <div>    <h2>Support Engineer</h2>      <h4>Posted Jan 26</h4>    <h3>      <span>Decisiv, Inc.</span><br>      <span>Headquarters: Glen Allen, VA</span><br>        <a href='https://www.decisiv.com/support-engineer-remote' rel='nofollow'>https://www.decisiv.com/support-engineer-remote</a>    </h3>  </div>    </div>  <div>    <div><h2><br></h2></div><div><h3><span>Job Summary</span></h3></div><div><span>Decisiv is looking for talented support engineers to work remotely on a contract basis as we simultaneously grow our customer base outside of North America and update/expand our platform and its underlying technology stack.</span><br></div><div></div><div></div><div><span>We need great people to support Decisiv’s cloud-based Service Relationship Management (SRM) platform outside of North America and to help our Support team evolve from a co-located, startup-style, North-America-only team to a highly-professional, remote-first, worldwide Support organization.</span><br></div><div></div><div></div><div><h3><span>What You’ll Be Doing</span></h3></div><div><span>Decisiv Support is a small, fast-growing, and remote-first team, so you'll likely acquire experience on a variety of technologies and support situations while working with us. That said, here are some things you're likely to do as a Support Engineer:</span><br></div><div></div><div></div><div><span></span><span></span></div><ul><li><span>Handle complex support requests via email, telephone, live chat, or in-app</span></li><li><span></span><span>Triage, troubleshoot, and document potential defects</span></li><li><span></span><span>Work with customers and partners to troubleshoot system integration problems</span></li><li>Monitor platform performance and participate in incident response</li><li><span></span><span>Interact with Decisiv’s Quality Assurance, Engineering, and Operations teams to resolve defects and incidents</span></li><li>Evaluate current and new Decisiv functionality and create written and visual content for knowledge base articles &amp; videos, tool tips, and in-app walk-throughs<br><span></span></li><li><span></span><span>Experiment! - our Support team, our platform, and our company are evolving, so everything can change.</span></li></ul><div><h3><span>Necessary Qualifications</span></h3></div><ul><li><span></span><span>Academic or technical experience with:</span></li><li>Common desktop and mobile operating systems<br><span></span></li><li><span></span><span>Common web &amp; mobile technologies: all major browsers; HTTP; FTP; Javascript; APIs; email deliverability; and connectivity challenges</span></li><li><span></span><span>A well-known programming or scripting language (e.g., Ruby on Rails, Java/C++, JavaScript, PHP, Python)</span></li><li><span></span><span>Reading and interpreting API log files, regardless of source application</span></li></ul><div><li>Ability to clearly articulate complex thoughts in any situation, from having a technical discussion with an engineer to working with a non-technical user<br></li></div><div></div><div></div><div><span></span><li><span></span><span>Ability to manage time and prioritize efficiently with limited oversight</span></li><li><span></span><span>Experience creating ‘How To’ videos, knowledge base articles, walk-throughs, and similar content</span></li><li><span></span><span>Bachelor’s degree or an equivalent combination of education and experience (a degree is&nbsp;<strong>not</strong>&nbsp;required!)</span></li><li><span><span>Proficient spoken and written communication skills in both American English and&nbsp;</span><em>at least one of</em><span><span>&nbsp;</span>the following: Spanish, French, Swedish, or Japanese</span></span></li><h3><span>Other Requirements</span></h3></div><ul><li><span></span><span>Reliable access to an appropriate work environment a</span><span>&nbsp;location where you can take telephone &amp; video calls and record high-quality video &amp; audio without interruption, distraction, or background noise</span><span></span></li><li><span>A strong, stable broadband internet connection that can handle simultaneous Voice Over Internet Protocol (VOIP) calls, streaming video, and comparable high-bandwidth applications (typically, 8 Mbps upload / 1.5 Mbps download at a minimum)</span></li><li><span></span><span>Availability to work&nbsp;<span>40 hours per week&nbsp;</span>and be “on-call”&nbsp;<span>for select weekends (typically, one weekend every other month)&nbsp;</span>within Decisiv Support's hours of operations</span><br><span></span></li><li><span>Located full-time in one of the following locations or time zones:</span></li><li><span></span><span>Gothenburg, Sweden</span></li><li><span>Ageo, Japan</span></li></ul><ul><li><span></span><span>Central Time</span></li><li><span></span><span>Mountain Time</span></li><li><span></span><span>Pacific Time</span></li><li><span></span><span>Western European Time</span></li><li><span></span><span>Central European Time</span></li><li><span></span><span>Japan Standard Time</span></li></ul><div><h3><span>Desirable Qualifications</span></h3></div><ul><li><span></span><span>Experience with maintenance &amp; repair functions for commercial vehicles (or a comparable industry)</span></li><li><span></span><span>Experience with Decisiv Support’s technology stack (e.g., Zendesk, github, Jira, Confluence, Slack, Zoom, New Relic, Pager Duty, StatusPage.io, Pendo.io)</span></li><li>Proficient spoken and written communication skills in more than two languages (i.e.,&nbsp;American English and two or more of Spanish, French, Swedish, Japanese, or other languages).</li></ul><div><h3><span>Why work with us?</span></h3></div><div><span>Our Support team is a small, tight-knit, and scrappy team that’s fixated on helping our users succeed. We value empathy, selflessness, action, transparency, clarity, and productivity/results. We invest in our team through get-togethers, group learning, conferences, and trying new things. We believe in bringing a diversity of experiences, knowledge, viewpoints, and voices to our team as we transform into a worldwide Support organization.</span><br></div><div></div><div></div><ul><li><span></span></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Does the role seem like a good fit for you? If so, we want to hear from you!Applying is easy. Just submit the following to <a href='mailto:careers@decisiv.com' rel='nofollow'>careers@decisiv.com</a>:1. Your most current resume2. Cover letter (see below for more details)While applying is pretty easy, standing out among candidates does take effort. You see, it’s pretty hard (and very time consuming) for us to find the truly great candidates, so we ask you make it really obvious to us just how great you are. The easiest way to do that is to address the following questions/topics in your cover letter:1. What would you work on if you were given a month to do anything that would help users be successful with an application and need less help from Support?2. Why do you want to work in Support, and why would you be a great Decisiv Support Engineer?3. What are your career goals, and how does a Support role and working at Decisiv fit with those goals?4. If you have them, share examples of Support content you’ve personally created (e.g., How-To videos, knowledge base articles, FAQs, API documentation). Don’t have any of your own examples? Share some examples that you think are really good and tell us why.</p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 25, 2018 3:34:23 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/frontend",
      "TECH1/ruby",
      "TITLE1/support",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "c",
      "frontend",
      "ruby"
    ]
  },
  {
    "id": "scIsfvTQQ2ycCsQojsYe1w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/wildbit-customer-success-postmark-eu",
    "title": "Wildbit: Customer Success: Postmark (EU)",
    "content": "<div>  <div>    <h2>Customer Success: Postmark (EU)</h2>      <h4>Posted Jan 23</h4>    <h3>      <span>Wildbit</span><br>      <span>Headquarters: Philadelphia, PA</span><br>        <a href='https://wildbit.workable.com/j/75F7939904' rel='nofollow'>https://wildbit.workable.com/j/75F7939904</a>    </h3>  </div>    </div>  <div>    <div><b>About Wildbit</b></div><div><br></div><div>At Wildbit, we believe developers shouldn’t spend time in the weeds of process, infrastructure, and communication. Our products remove that pain, allowing teams to design, code, and ship brilliant software. Our apps include Postmark, Beanstalk, and Conveyor. (This position is for Postmark.)</div><div><br></div><div>Beyond our work, Wildbit exists for our team, and our products and customers allow us to do the best work of our lives, together. We’ve been in business for 17 years, and over 100,000 companies around the world trust our products to help them create and ship incredible software. We currently have a team of 26 with 15 of those team members working remotely from all over the world. We don’t dabble in remote-work or just barely tolerate it, we run the company as if everyone was remote, and we go out of our way to ensure that remote team members feel just as much a part of the family as the folks in Philadelphia.</div><div><br></div><div>To learn more about the importance of a healthy culture at Wildbit, you can browse our blog posts about culture, and you’ll get a clearer picture of how we’re different from your average team.</div><div><br></div><div><b>About this Position</b></div><div><br></div><div>We’re looking for someone who understands that customer success is a focus on customers, not on ourselves. At Wildbit, our focus is entirely on enabling teams to build and launch their own products and services. Our success team handles our customer's needs proactively (success) and reactively (support) across our three products (Beanstalk, Conveyor, and Postmark).</div><div><br></div><div>We currently have solid time zone coverage in the Americas, but we’d like to expand the team to add someone from the EU to help provide better time zone coverage for our customers whose day starts a little earlier. And don’t worry, with 3 (current) other team members in Europe, you won’t be the only one working slightly different hours from the rest of the team.</div><div><br></div><div>You’ll help new customers get up to speed quickly, educate developers on industry best practices, and help our team identify where we can better meet the needs of our customers. This means creating content and user guides, talking to customers over various channels (email, support, live chat, phone, etc), analyzing behaviors, and keeping our developers and designers up to speed at all times. Most of all, this job is about empowering developers to do their best work. And to have fun doing it!</div><div><br></div><div><b>Requirements:</b></div><div><br></div><ul><li><span>a solid understanding of transactional email and email technologies (SPF, DKIM, DMARC)</span></li><li><span>experience in measuring and tracking your own results</span></li><li><span>for this position, we’re looking someone in or near Europe to work 8am–4pm UTC/GMT</span></li><li><span>solid writing skills for answering customer support requests as well as writing help docs and user guides</span></li><li><span>empathy for novice developers</span></li><li><span>a desire to teach</span></li></ul><div><br></div><div><i>Nice to haves:</i></div><div><br></div><ul><li><span>previous experience in customer success/product management</span></li><li><span>previous experience in customer support</span></li><li><span>previous experience supporting or building a Saas product</span></li></ul><div><br></div><div><b>Benefits:</b></div><div><br></div><ul><li><span>Full health benefits</span></li><li><span>Company-paid team retreats</span></li><li><span>Computer of your choice, renewed every 2 years</span></li><li><span>Quarterly profit sharing</span></li><li><span>Attend conferences</span></li><li><span>40 hour work week with flexible hours and 25 paid days off per year (We’re currently experimenting with 4-day/32 hour work weeks and 20 paid days off per year)&nbsp;</span></li></ul><div><br></div><div><b>Wildbit is an equal opportunity employer and proud of it.</b></div><div><br></div><div>We’re committed to building a diverse team, and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. At our core we believe deeply in diversity, inclusiveness, and acceptance as all being key parts of a healthy team.<br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Submit application via the link provided above</p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 22, 2018 10:36:33 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "aCXoTCxjToyiA0hfEELahQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/wildbit-customer-success-postmark-apac-region",
    "title": "Wildbit: Customer Success: Postmark (APAC Region)",
    "content": "<div>  <div>    <h2>Customer Success: Postmark (APAC Region)</h2>      <h4>Posted Jan 23</h4>    <h3>      <span>Wildbit</span><br>      <span>Headquarters: Philadelphia</span><br>        <a href='https://wildbit.workable.com/j/0097939AB2' rel='nofollow'>https://wildbit.workable.com/j/0097939AB2</a>    </h3>  </div>    </div>  <div>    <div><b>About Wildbit</b></div><div><br></div><div>At Wildbit, we believe developers shouldn’t spend time in the weeds of process, infrastructure, and communication. Our products remove that pain, allowing teams to design, code, and ship brilliant software. Our apps include Postmark, Beanstalk, and Conveyor. (This position is for Postmark.)</div><div><br></div><div>Beyond our work, Wildbit exists for our team, and our products and customers allow us to do the best work of our lives, together. We’ve been in business for 17 years, and over 100,000 companies around the world trust our products to help them create and ship incredible software. We currently have a team of 26 with 15 of those team members working remotely from all over the world. We don’t dabble in remote-work or just barely tolerate it, we run the company as if everyone was remote, and we go out of our way to ensure that remote team members feel just as much a part of the family as the folks in Philadelphia.</div><div><br></div><div>To learn more about the importance of a healthy culture at Wildbit, you can browse our blog posts about culture, and you’ll get a clearer picture of how we’re different from your average team.</div><div><br></div><div><b>About this Position</b></div><div><br></div><div>We’re looking for someone who understands that customer success is a focus on customers, not on ourselves. At Wildbit, our focus is entirely on enabling teams to build and launch their own products and services. Our success team handles our customers needs proactively (success) and reactively (support) across our three products (Beanstalk, Conveyor, and Postmark).</div><div><br></div><div>We currently have solid time zone coverage in the Americas, but we’d like to expand the team to improve the hours we’re available. We’d like to add someone to work during HAST hours (Hawaii) to better support our west coast customers, as well as customers in Australia and New Zealand.</div><div><br></div><div>You’ll help new customers get up to speed quickly, educate developers on industry best practices, and help our team identify where we can better meet the needs of our customers. This means creating content and user guides, talking to customers over various channels (email, support, live chat, phone, etc), analyzing behaviors, and keeping our developers and designers up to speed at all times. Most of all, this job is about empowering developers to do their best work. And to have fun doing it!</div><div><br></div><div><b>Requirements:</b></div><div><br></div><ul><li><span>a solid understanding of transactional email and email technologies (SPF, DKIM, DMARC)</span></li><li><span>experience in measuring and tracking your own results</span></li><li><span>for this position, we’re looking someone in or near the Pacific to work 8am-4pm HAST (Hawaii)</span></li><li><span>solid writing skills for answering customer support requests as well as writing help docs and user guides</span></li><li><span>empathy for novice developers</span></li><li><span>a desire to teach</span></li></ul><div><br></div><div><i>Nice to haves:</i></div><div><br></div><ul><li><span>previous experience in customer success/product management</span></li><li><span>previous experience in customer support</span></li><li><span>previous experience supporting or building a Saas product</span></li></ul><div><br></div><div><b>Benefits:</b></div><div><br></div><ul><li><span>Full health benefits</span></li><li><span>Company-paid team retreats</span></li><li><span>Computer of your choice, renewed every 2 years</span></li><li><span>Quarterly profit sharing</span></li><li><span>Attend conferences</span></li><li><span>40 hour work week with flexible hours and 25 paid days off per year (We’re currently experimenting with 4-day/32 hour work weeks and 20 paid days off per year)</span></li></ul><div><span></span></div><div><span><br></span></div><div><b>Wildbit is an equal opportunity employer and proud of it.</b></div><div><br></div><div>We’re committed to building a diverse team, and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. At our core we believe deeply in diversity, inclusiveness, and acceptance as all being key parts of a healthy team.<br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Submit application with the provided URL above</p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 22, 2018 10:30:30 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "XvM1miFoSnKC0RWq5WJ4GA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/zapier-support-operations-manager",
    "title": "Zapier: Support Operations Manager",
    "content": "<div>  <div>    <h2>Support Operations Manager</h2>      <h4>Posted Jan 23</h4>    <h3>      <span>Zapier</span><br>      <span>Headquarters: San Francisco</span><br>        <a href='https://zapier.workable.com/j/B5178415AC' rel='nofollow'>https://zapier.workable.com/j/B5178415AC</a>    </h3>  </div>    </div>  <div>    <div>Hi there! We're looking for someone to help cultivate our growing Support team at Zapier. The Support Operations Manager helps shepherd all the initiatives in Support that have Leads (e.g., Documentation, Training), helping to prioritize their work for the best results and highest impact. They're responsible for managing the Leads of those initiatives, setting an example in helping users directly, and working with Support Managers to ensure those initiatives have proper bandwidth from the right people. If you love helping users and developing others to get results that make those users' lives even easier, then read on!</div><div><br></div><div>Even though our job description may seem like we are looking for a specific candidate, the role inevitably ends up tailored to the individual who applies and joins. Regardless of how well you feel you fit our description, we encourage you to apply if you have a heart for users and love helping them directly. You also enjoy leveling up individuals so they can drive results for their teams.</div><div><span><br></span></div><div><span><b>About You</b></span><br></div><div></div><div></div><div><span><b><br></b></span></div><div><span>You put your teammates' and customers' needs first.</span>&nbsp;You enjoy helping support teams and enabling them to do great work. You put in the time to understand the strengths and weaknesses of those who report to you, providing ways to magnify their strengths and provide feedback to improve their weaknesses.</div><div><br></div><div><span>You have experience driving results.</span>You've successfully led projects involving the work of a team of people. You do this by holding that team accountable to goals and stay aligned with company-wide priorities, while enabling your team to work autonomously.</div><div><span><br></span></div><div><span>You have excellent communication skills.</span>&nbsp;You make sure those who report to you understand how they are doing and what is important at any point in time. You're always available with a suggestion on how to phrase a response to a tricky customer ticket.</div><div><span><br></span></div><div><span>You have experience hiring and managing a team.</span>&nbsp;This isn't your first rodeo. You have hired, trained and managed folks before.</div><div><span><br></span></div><div><span>You love helping users directly.</span>&nbsp;Everyone at Zapier does Support, and as a leader in the Support team it's part of your daily routine. You make customers feel empowered after interacting with support and not feel stupid because of a small mistake. You love the opportunity to solve new problems every day and won't give up when you don't know the answer right away.</div><div><span><br></span></div><div><span>You wear many hats.</span>&nbsp;You are constantly leveling up your people management skills. You have the relevant Support skills to build rapport with those you manage. On a weekly basis you can expect to be holding one-on-ones with Support Leads, thinking through tricky tickets and giving feedback, prioritizing Support project work, and helping influence the direction of Support for all of Zapier.</div><div><span><br></span></div><div><span>You take pride in empowering teammates.</span>&nbsp;As a manager you know that by helping to get the best out of many people, you can achieve results far greater than would be possible alone. That challenge motivates and excites you.</div><div><br></div><div><b>Things You Might Do</b></div><div><br></div><div>Zapier is a small, fast-growing, and remote-first company, so you'll likely get experience on many different projects across the organization. That said, here are some things you'll probably do:</div><div><br></div><ul><li>Help meet and exceed our Support goals</li><li>Build rapport with Support Leads and work hard to help them level up their skills</li><li>Collaborate with Support leads and managers to prioritize project work and set direction for Support as a whole</li><li>Help customers via email or chat to ensure they have the best experience possible, troubleshooting their problems and answering their questions</li><li>Hold weekly one on ones with Support Leads</li><li>Experiment: this is a startup so everything can change<br></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://zapier.workable.com/j/B5178415AC' rel='nofollow'>https://zapier.workable.com/j/B5178415AC</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 22, 2018 4:26:09 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "dOkSGR0yQKuZxQ4Q_cvChQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "craigslist-java-seattle",
    "url": "https://seattle.craigslist.org/see/sof/d/technical-support-and/6464694336.html",
    "title": "Technical Support and Software/qa/dba/etc (Work from home)",
    "content": "Technical Support and Software/qa/dba/etc (Work from home) \nhide this posting  unhide \n< image 1 of 1 > \ncompensation: $45,000+ based on support delivered \nemployment type: full-time \ntelecommuting okay \n\n\nQR Code Link to This Post\n The ITSC is seeking agents to provide telephone technical support for the \norganization's customers.\n The ITSC is an industry-leading provider of Expert technical support for \nFortune 1000 organizations.\n LOCATION: The ITSC's organizational structure provides agents the opportunity \nto work from home. Agents must be based in the United States.\n HOURS: Multiple options available - please indicate if open to 3rd shift times\n APPLY HERE NOW!:\n\nhttps://docs.google.com/forms/d/e/1FAIpQLSf_oOVO8lNEOJquGMMSu7lp9EXGyPUd2XCZi4abuoPeVbXqow/viewform?usp=sf_link\n \n<https://docs.google.com/forms/d/e/1FAIpQLSf_oOVO8lNEOJquGMMSu7lp9EXGyPUd2XCZi4abuoPeVbXqow/viewform?usp=sf_link>\n DESCRIPTION:\n Agents for the ITSC provide high-touch, white-glove support for corporate IT, \nbusiness software and mobile devices. Support covers technical details as well \nas &quot;how-to&quot; questions for a variety of topics including:\n - Microsoft Excel, Outlook, Word, PowerPoint, Access, Visual Basic for \nApplications (VBA), SharePoint, etc.\n - Adobe Creative Cloud applications (Illustrator, InDesign, Photoshop, etc.)\n - Windows operating systems\n - iPhone, iPad, Android and Blackberry mobile devices\n CompTIA A+, Microsoft Specialist, HDI-Support Center Analyst (HDI-SCA) \ncertifications a SIGNIFICANT PLUS\n Agents must also have familiarity with server environments, standard network \narrangements and security concepts.\n This is an external, Customer-facing position. Agents must be conscientious \nabout providing thorough support, and be understanding, responsive and \ncooperative for client support requests. They must also have strong \ninterpersonal and communication skills, and the ability to explain technical \nconcepts in a clear, non-technical manner.\n Agents must pay close attention to detail and following internal processes \nfor providing support and documenting all steps taken. They also need to be \nteam players, collaborative with their colleagues and a desire to be a resource \nand share their knowledge with others.\n ADDITIONAL PREFERRED SKILLS:\n - The ability to learn new applications quickly, and to certify in numerous \nsoftware applications\n - Bilingual in SPANISH or FRENCH is a plus\n - Familiar with ITIL, COPC and/or Six Sigma\n - Familiar with any of the following: Visual BASIC, VB .NET, C#, C++, Java, \nJavaScript, or any other object orientated programming language\n APPLY HERE NOW!:\n\nhttps://docs.google.com/forms/d/e/1FAIpQLSf_oOVO8lNEOJquGMMSu7lp9EXGyPUd2XCZi4abuoPeVbXqow/viewform?usp=sf_link\n \n<https://docs.google.com/forms/d/e/1FAIpQLSf_oOVO8lNEOJquGMMSu7lp9EXGyPUd2XCZi4abuoPeVbXqow/viewform?usp=sf_link>\n\n * Principals only. Recruiters, please don't contact this job poster. \n * do NOT contact us with unsolicited services or offers \n * OK to highlight this job opening for persons with disabilities",
    "urlFetchPending": false,
    "published": "Jan 19, 2018 1:54:21 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "AaW6_OtWRCuX5k95XTFrAQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "craigslist-java-seattle",
    "url": "https://seattle.craigslist.org/see/tch/d/technical-support-and/6464694341.html",
    "title": "Technical Support and Software/qa/dba/etc (Work from home)",
    "content": "Technical Support and Software/qa/dba/etc (Work from home) \nhide this posting  unhide \n< image 1 of 1 > \ncompensation: $45,000+ based on support delivered \nemployment type: full-time \ntelecommuting okay \n\n\nQR Code Link to This Post\n The ITSC is seeking agents to provide telephone technical support for the \norganization's customers.\n The ITSC is an industry-leading provider of Expert technical support for \nFortune 1000 organizations.\n LOCATION: The ITSC's organizational structure provides agents the opportunity \nto work from home. Agents must be based in the United States.\n HOURS: Multiple options available - please indicate if open to 3rd shift times\n APPLY HERE NOW!:\n\nhttps://docs.google.com/forms/d/e/1FAIpQLSf_oOVO8lNEOJquGMMSu7lp9EXGyPUd2XCZi4abuoPeVbXqow/viewform?usp=sf_link\n \n<https://docs.google.com/forms/d/e/1FAIpQLSf_oOVO8lNEOJquGMMSu7lp9EXGyPUd2XCZi4abuoPeVbXqow/viewform?usp=sf_link>\n DESCRIPTION:\n Agents for the ITSC provide high-touch, white-glove support for corporate IT, \nbusiness software and mobile devices. Support covers technical details as well \nas &quot;how-to&quot; questions for a variety of topics including:\n - Microsoft Excel, Outlook, Word, PowerPoint, Access, Visual Basic for \nApplications (VBA), SharePoint, etc.\n - Adobe Creative Cloud applications (Illustrator, InDesign, Photoshop, etc.)\n - Windows operating systems\n - iPhone, iPad, Android and Blackberry mobile devices\n CompTIA A+, Microsoft Specialist, HDI-Support Center Analyst (HDI-SCA) \ncertifications a SIGNIFICANT PLUS\n Agents must also have familiarity with server environments, standard network \narrangements and security concepts.\n This is an external, Customer-facing position. Agents must be conscientious \nabout providing thorough support, and be understanding, responsive and \ncooperative for client support requests. They must also have strong \ninterpersonal and communication skills, and the ability to explain technical \nconcepts in a clear, non-technical manner.\n Agents must pay close attention to detail and following internal processes \nfor providing support and documenting all steps taken. They also need to be \nteam players, collaborative with their colleagues and a desire to be a resource \nand share their knowledge with others.\n ADDITIONAL PREFERRED SKILLS:\n - The ability to learn new applications quickly, and to certify in numerous \nsoftware applications\n - Bilingual in SPANISH or FRENCH is a plus\n - Familiar with ITIL, COPC and/or Six Sigma\n - Familiar with any of the following: Visual BASIC, VB .NET, C#, C++, Java, \nJavaScript, or any other object orientated programming language\n APPLY HERE NOW!:\n\nhttps://docs.google.com/forms/d/e/1FAIpQLSf_oOVO8lNEOJquGMMSu7lp9EXGyPUd2XCZi4abuoPeVbXqow/viewform?usp=sf_link\n \n<https://docs.google.com/forms/d/e/1FAIpQLSf_oOVO8lNEOJquGMMSu7lp9EXGyPUd2XCZi4abuoPeVbXqow/viewform?usp=sf_link>\n\n * Principals only. Recruiters, please don't contact this job poster. \n * do NOT contact us with unsolicited services or offers \n * OK to highlight this job opening for persons with disabilities",
    "urlFetchPending": false,
    "published": "Jan 19, 2018 1:54:21 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "QqSJYMsvRhivI_i5qCJMow",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/scheduleonce-technical-customer-support-manager-us",
    "title": "ScheduleOnce: Technical Customer Support Manager - US",
    "content": "<div>  <div>    <h2>Technical Customer Support Manager - US </h2>      <h4>Posted Jan 19</h4>    <h3>      <span>ScheduleOnce</span><br>      <span>Headquarters: California</span><br>    </h3>  </div>    </div>  <div>    <div>ScheduleOnce is an innovative and thriving software-as-a-service company that provides a feature-rich scheduling platform to businesses. The Remote Technical Support Specialist is an entry level role which gives you the opportunity to grow inside the company. This is an exciting work from home opportunity requiring you to work and engage with others in a virtual environment while providing our customers with a high-quality customer service experience. As a member of our Customer Success team, you will receive full training in order to give the best support to our customers.<br></div><div></div><div><b><br></b></div><div><b>As a member of the Customer Success Department you would:</b><br></div><div></div><ul><li>Answer phone calls and emails from customers</li><li>Determine the scope of the customer's issue in an effective and professional manner</li><li>Effectively resolve customer issues in a timely manner</li><li>Maintain a high level of customer satisfaction with focus on first call resolution</li><li>Resolve customer requests by investigating problems, developing solutions and recommending additional products and/or services relevant to the assessment of the customer needs.</li></ul><div><b><br></b></div><div><b>We are looking for:</b></div><ul><li>Some college completed in a relevant field (mathematics, computer science, linguistics, IT, physics, biology, chemistry etc.)</li><li>Excellent written and oral communication skills</li><li>The ability to learn new technical concepts quickly</li><li>The ability to communicate technical directions over the phone to a variety of users</li><li>Excellent customer interaction skills</li><li>Strong organizational and multitasking skills</li><li>Ability to problem-solve</li><li>Ability to follow written instructions</li><li>Ability to work in a fast-paced changing environment</li><li>Up to 5 years of Customer Success/Support experience (SaaS experience preferred)</li><li>Analytical mindset with ability to quickly recognize patterns</li><li>Superb writing and communication skills: accurate, focused, and detailed</li><li>Excellent at multitasking and productivity</li></ul><div><b><br></b></div><div><b>What we offer you at ScheduleOnce:</b></div><ul><li>100% work from home</li><li>Medical &amp; dental insurance</li><li>401K plan</li><li>Paid time off</li><li>Paid training</li></ul><div>Job Type: Full-time</div><div><br></div><div>Salary: $25,000.00 to $30,000.00 /year</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='mailto:cs-hr@scheduleonce.com' rel='nofollow'>cs-hr@scheduleonce.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 18, 2018 10:25:17 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "X9thQQSUT3eEH-El1Bu0fA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/hot-jar-customer-success-manager-us-est",
    "title": "Hot Jar : Customer Success Manager (US EST)",
    "content": "<div>  <div>    <h2>Customer Success Manager (US EST)</h2>      <h4>Posted Jan 18</h4>    <h3>      <span>Hot Jar </span><br>      <span>Headquarters: Malta</span><br>        <a href='https://careers.hotjar.com/o/customer-success-manager-us-east-coast-malta/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/customer-success-manager-us-east-coast-malta/?source=WeWorkRemotely</a>    </h3>  </div>    </div>  <div>    <div><em><strong>Note:</strong>&nbsp;Although this is a remote position, due to the necessary overlap with Europe we are seeking candidates&nbsp;in&nbsp;EST&nbsp;only.</em></div><div></div><div><br></div><div>We are looking for a well organized and self driven&nbsp;<strong>Customer Success Manager</strong>&nbsp;to join a newly formed team working remotely with a fast growing startup.&nbsp;</div><div><br></div><div>The Customer Success team assists and supports prestigious Hotjar customers in over 184 countries by providing product advice, assistance and guidance to a portfolio of assigned companies. Customer Success Managers also work closely with our product and marketing teams to help prioritize and define changes to Hotjar in order to continuously improve the value and the overall customer experience delivered.</div><div></div><div><br></div><div>All Customer Success Managers receive extensive product and marketing training&nbsp;–&nbsp;as well as a yearly budget for additional training and self-development. With this knowledge you will help Hotjar customers setup and use Hotjar features to improve the experience and performance of their sites and apps.</div><div>&nbsp;</div><div><br></div><div><strong><span>What Customer Success Managers do...</span></strong></div><div><br></div><ul><li>Presenting product demos to inbound prospective customers and helping them make an informed decision by answering their questions about Hotjar.</li><li>Onboarding assigned new customers by enabling and assisting with installation, adoption within the organization as well as providing product training and guidance to internal teams.</li><li>Onboarding existing assigned customers to new features and functionality in Hotjar that will drive value for their organization.</li><li>Owning the overall relationship with assigned customers, which includes: Increasing adoption and usage, ensuring retention and satisfaction.</li><li>Advocating customer needs and issues with other teams.</li><li>Establishing a long-term trusted advisor relationship with assigned customers and driving continued value of our products and services.</li><li>Creating 'WOW' moments by consistently delivering world-class service and support with empathy and understanding.</li><li>Developing, preparing, and nurturing customers for advocacy. This includes assisting with interviews and case studies.</li><li>Working to identify and/or develop upsell opportunities.</li><li>Collaborating with Sales Coordinators to coordinate paperwork, agreements and regulatory questions for new customers as well as monitoring and following up on renewals at end of yearly contracts.</li></ul><div></div><div><br></div><div><strong>Compensation Range</strong></div><div><br></div><div>The budgeted compensation range for this role is €50,000 to €70,000 annually. Ranges are based on market research and are equitable to other roles within Hotjar. The actual compensation offered to a successful candidate will be based on relative experience and skills. At this time we are only able to provide official employment status to those located in Malta. All other candidates will join our team as full-time consultants and will be responsible for paying any taxes or applicable fees where they reside.&nbsp;</div><div><br></div><div><h4><b>Requirements</b></h4></div><ul><li>At least 2 years prior experience in Customer Success Management or equivalent history of increasing customer satisfaction, adoption, and retention.</li><li>Very strong English communication skills – both written and spoken. If you are fluent in other languages, tell us! German, French, Spanish and Portuguese will be considered as assets.</li><li>Familiarity with the basics of HTML, CSS, Javascript, and using browser developer tools.</li><li>Previous experience working with a SaaS product is preferred but not essential.</li><li>Ability to effectively communicate complex concepts that empower our users without making them feel small.</li><li>Ability to work independently and within a team - accountable for your own actions and able to act with both urgency and integrity towards both, personal and shared work goals.</li><li>Desire and drive to always be learning.</li><li>Experience working in technical support roles and teams and agile experience are a plus.</li><li>Must submit to a background check confidentially processed by our third party.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply via <a href='https://careers.hotjar.com/o/customer-success-manager-us-east-coast-malta/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/customer-success-manager-us-east-coast-malta/?source=WeWorkRemotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 17, 2018 3:35:31 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java"
    ]
  },
  {
    "id": "Ae3cTX3vQrGTvrt1wiZkcg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/hotjar-6136-customer-success-manager-us-est",
    "title": "HotJar : Customer Success Manager (US EST)",
    "content": "<div>  <div>    <h2>Customer Success Manager (US EST)</h2>      <h4>Posted Jan 18</h4>    <h3>      <span>HotJar </span><br>      <span>Headquarters: Malta</span><br>        <a href='https://careers.hotjar.com/o/customer-success-manager-us-east-coast-malta/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/customer-success-manager-us-east-coast-malta/?source=WeWorkRemotely</a>    </h3>  </div>    </div>  <div>    <div><em><strong>Note:</strong>&nbsp;Although this is a remote position, due to the necessary overlap with Europe we are seeking candidates&nbsp;in&nbsp;EST&nbsp;only.</em></div><div></div><div><br></div><div>We are looking for a well organized and self driven&nbsp;<strong>Customer Success Manager</strong>&nbsp;to join a newly formed team working remotely with a fast growing startup.&nbsp;</div><div><br></div><div>The Customer Success team assists and supports prestigious Hotjar customers in over 184 countries by providing product advice, assistance and guidance to a portfolio of assigned companies. Customer Success Managers also work closely with our product and marketing teams to help prioritize and define changes to Hotjar in order to continuously improve the value and the overall customer experience delivered.</div><div></div><div><br></div><div>All Customer Success Managers receive extensive product and marketing training&nbsp;–&nbsp;as well as a yearly budget for additional training and self-development. With this knowledge you will help Hotjar customers setup and use Hotjar features to improve the experience and performance of their sites and apps.</div><div>&nbsp;</div><div><br></div><div><strong><span>What Customer Success Managers do...</span></strong></div><div><br></div><ul><li>Presenting product demos to inbound prospective customers and helping them make an informed decision by answering their questions about Hotjar.</li><li>Onboarding assigned new customers by enabling and assisting with installation, adoption within the organization as well as providing product training and guidance to internal teams.</li><li>Onboarding existing assigned customers to new features and functionality in Hotjar that will drive value for their organization.</li><li>Owning the overall relationship with assigned customers, which includes: Increasing adoption and usage, ensuring retention and satisfaction.</li><li>Advocating customer needs and issues with other teams.</li><li>Establishing a long-term trusted advisor relationship with assigned customers and driving continued value of our products and services.</li><li>Creating 'WOW' moments by consistently delivering world-class service and support with empathy and understanding.</li><li>Developing, preparing, and nurturing customers for advocacy. This includes assisting with interviews and case studies.</li><li>Working to identify and/or develop upsell opportunities.</li><li>Collaborating with Sales Coordinators to coordinate paperwork, agreements and regulatory questions for new customers as well as monitoring and following up on renewals at end of yearly contracts.</li></ul><div></div><div><br></div><div><strong>Compensation Range</strong></div><div><br></div><div>The budgeted compensation range for this role is €50,000 to €70,000 annually. Ranges are based on market research and are equitable to other roles within Hotjar. The actual compensation offered to a successful candidate will be based on relative experience and skills. At this time we are only able to provide official employment status to those located in Malta. All other candidates will join our team as full-time consultants and will be responsible for paying any taxes or applicable fees where they reside.&nbsp;</div><div><br></div><div><h4><b>Requirements</b></h4></div><ul><li>At least 2 years prior experience in Customer Success Management or equivalent history of increasing customer satisfaction, adoption, and retention.</li><li>Very strong English communication skills – both written and spoken. If you are fluent in other languages, tell us! German, French, Spanish and Portuguese will be considered as assets.</li><li>Familiarity with the basics of HTML, CSS, Javascript, and using browser developer tools.</li><li>Previous experience working with a SaaS product is preferred but not essential.</li><li>Ability to effectively communicate complex concepts that empower our users without making them feel small.</li><li>Ability to work independently and within a team - accountable for your own actions and able to act with both urgency and integrity towards both, personal and shared work goals.</li><li>Desire and drive to always be learning.</li><li>Experience working in technical support roles and teams and agile experience are a plus.</li><li>Must submit to a background check confidentially processed by our third party.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply via <a href='https://careers.hotjar.com/o/customer-success-manager-us-east-coast-malta/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/customer-success-manager-us-east-coast-malta/?source=WeWorkRemotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 17, 2018 3:35:31 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "c_EcYFj6SCm5PAsMG-1Npw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/65038/technical-support-engineer-at-poq/",
    "title": "Technical Support Engineer",
    "content": "We are a Software-as-a-Service startup that powers the iOS and Android shopping apps of international retailers like House of Fraser, Radley, MADE.com and Missguided. We’re relentless at seeking out the most advanced technology and our software is constantly improving. This means that our clients are always at the forefront of innovation.<br /><br />We have collaborated with many clients and integrated with lots of partners to launch apps with cutting-edge features including: augmented reality, product merchandising, tailored push notifications and app marketing. The Poq platform drives millions of revenue for our customers every month, and facilitates thousands of transactions every day.<br /><br />Poq was founded in 2011 by Oyvind, CEO, Michael, COO, Jun, CTO, and Mike, CCO. We have built an amazing team of diverse and brilliant minds.<br /><br />About the role<br /><br />Reporting directly to the Head of Support, the Dev Ops Engineer will be a key part of the Support team to ensure our clients are happy and apps function well. You will be responsible to support our expanding US market and ensure all live apps remain healthy during UK evening hours. You will also be a key driver in our monitoring processes and operating in Azure. You are passionate about problem solving and can handle urgent issues calmly and independently. You can communicate well with clients, manage their expectations, guide them on any changes they need to make and will be the first point of contact for any evening urgent issues that occur.<br /><br />You will have an understanding of software, Azure (or similar) servers, and configuration tools. You will also contribute across many support and dev ops tasks to ensure the good health of our apps and clients success. This role will involve some training time in our London office but will be based remotely so can cover West coast US business hours; there will be crossover with the UK for 1-2 hours at the beginning of your day and the end of UK business hours.<br /><br />What you’ll be doing<br /><br />•    First point of contact for priority and urgent issues – Triage and investigate issues and manage fixes or escalate as appropriate <br />•    Client communication. Email and phone support to update on issues, progress and guide a client when issues or changes needed on their side <br />•    App health monitoring – Set up and manage effective monitoring and alerting <br />•    Operating in Azure - Reset or add more servers, scale up data base, communication with our MSP if azure is down <br />•    Roll back faulty releases <br />•    Set up and running of product feeds <br />•    Technical admin tasks via our Configuration tool <br />•    Other Dev ops tasks to contribute to the health and improvements to our platform <br />•    Testing – unit and regression testing for fixes or changes <br />•    Zendesk and Jira ticket management – Make sure any issues are well documented so can be fixed quickly by the right person <br />•    Work as part of the Support team and collaborate on internal processes and servicing clients<br /><br />What we’re looking for<br /><br />•    Two years of experience managing and configuring Cloud platforms like Azure services <br />•    Two years of experience working with DevOps tools e.g. Visual Studio •    •    Team Services (VSTS) and Configuration <br />•    Experience in a devops/support role for a software company <br />•    Client communication (email and phone) and management <br />•    Testing – mobile or software preferred <br />•    Ability to jump on issues quickly, calmly and independently <br />•    Experience working with data files like a product file <br />•    Microsoft Excel including knowledge of CSV and XML <br />•    Ability to work evening hours<br /><br />Desirables<br /><br />•    Computer Science/Informatics/STEM degree or similar <br />•    Experience with Google Analytics <br />•    System administration <br />•    Networking <br />•    APIs <br />•    Experience using testing tools like postman and Charles proxy<br /><br />Benefits<br /><br />•    Competitive salary <br />•    Remote working <br />•    Quarterly team events (we’ve done a Segway tour, BBQs, Junkyard Golf, a Graffiti Workshop and more!)<br /><br />We love spending time together as a team, check us out on Instagram.<br /><br />How to apply<br /><br />For further information or to apply, please email recruitment@poqcommerce.com<br /><br />Please introduce yourself and attach a copy of your CV with any supporting links/info.",
    "urlFetchPending": false,
    "published": "Jan 12, 2018 11:37:44 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/dotnet",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "dotnet"
    ]
  },
  {
    "id": "ebxtycgxQpaoPVQpUbC94A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/onthegosystems-italian-support-person-needed-for-wpml-forum-german-would-be-a-good-plus",
    "title": "OnTheGoSystems: Italian Support Person Needed for WPML forum (German would be a good plus)",
    "content": "<div>  <div>    <h2>Italian Support Person Needed for WPML forum (German would be a good plus)</h2>      <h4>Posted Jan 10</h4>    <h3>      <span>OnTheGoSystems</span><br>      <span>Headquarters: 100% remote</span><br>        <a href='https://www.onthegosystems.com/' rel='nofollow'>https://www.onthegosystems.com/</a>    </h3>  </div>    </div>  <div>    <div><span>Being an OnTheGoSystems supporter is about helping people. You need to know WordPress inside out, and it would be a nice plus if you have some experience with our products (mainly WPML &amp; Toolset). </span></div><div><br></div><div><span>It’s important to be a good team player, an excellent communicator, to be creative, straightforward and honest.&nbsp;<strong><span>You’ll need to have perfect written and spoken English and Italian at this time. (Good German writing skills would be a big plus)</span></strong>.</span></div><div><br></div><div><span>Above all, we are looking for hard-working people who just love helping others and get satisfaction from resolving problems.</span></div><div><br></div><div><span>It’s a full-time job and we don’t mind whether you work from a tent or a boat. You do need, however, a reliable strong internet connection (we meet daily using Skype and Google Hangouts) and self-discipline.</span></div><div><br></div><div><span>You will be replying to questions from clients, debugging issues, looking at configurations and code lines, talking to other team members and escalating issues or features to our development teams. We are looking for people who know what GIT, WP Loop, PhpStorm, Taxonomy&nbsp;and .MO files are and if they don’t are very happy to learn! We are constantly teaching ourselves new technologies and workflows and we have an intensive training program both for newbies and for experienced supporters.</span></div><div><span><br></span></div><div><span>We come from all around the world, from many different cultures, speaking dozens of languages and we make beautiful products. We invite you to become part of a special team!</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please, apply here:<a href='https://www.onthegosystems.com/jobs/#supporters' rel='nofollow'>https://www.onthegosystems.com/jobs/#supporters</a>Make sure to highlight the languages you speak and make your application stand out from the rest.</p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 9, 2018 5:34:00 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "jU7yqU0LSouTtmQ4bq-aiA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/64860/customer-onboarding-specialist-at-teamup-sports-inc/",
    "title": "Customer Onboarding Specialist",
    "content": "ABOUT US!<br /><br />Teamup (goteamup.com) is an all-in-one business management solution for independent fitness businesses. Our customers include businesses like CrossFit gyms, yoga studios, martial arts centres, and more.<br /><br />Since 2012, teamup has helped thousands of businesses take control of payments, scheduling, and member management. <br /><br />Our remote team of 10 is currently based in the UK, US, and Spain. <br /><br />THE JOB<br /><br />Qualifying potential customers<br />Managing the onboarding sequence via telephone, email and chat<br />Screenshare demos <br />Handling a variety of incoming enquiries <br />Following up consistently on all channels<br />Phone and email communication with customers and prospects<br /><br />YOU HAVE<br /><br />Native-level English proficiency and are excited to work directly with customers via email, phone or screen share<br />Ability to listen to and engage potential customers by phone, and understand their requirements.<br />Determination for every customer to have a great experience with teamup and a desire to take responsibility for the customers you are helping<br />Experience working in a remote environment (comfortable primarily communicating over platforms like Close.io, Hipchat, Skype, Basecamp, ZenDesk, Jira etc.)<br />Computer literacy <br />The schedule to work Monday through Friday, 9am - 5:30pm UK time, with ability to cover some hours during evenings, weekends and on public holidays if required<br /><br />ESSENTIAL TO HAVE (bonus points for both)<br /><br />Experience of fitness businesses<br />Experience working in the software industry <br /><br />WHY WORK FOR US?<br /><br />We’re a very small team doing very big things — your work will make a huge impact and your voice will be heard! We offer a competitive salary, gym membership, team meet ups and a great team atmosphere to help you achieve your best work.<br /><br />Salary <br />£21,000 per annum <br /><br />To apply for the position of Customer Onboarding Specialist please complete the below steps:<br /><br />1. Send a copy of your CV<br />2. Send a cover letter explaining why you think you're suitable for the role",
    "urlFetchPending": false,
    "published": "Jan 8, 2018 3:07:11 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "Ygtc0PVzSv68bNkesZAS0A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4081-support-engineer-aptible",
    "title": "Support Engineer @ Aptible",
    "content": "<h2>              Support Engineer<small> @ Aptible</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-01-08 03:55</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong><em>Are you a software engineer looking for a challenge? Do you want to work directly with other engineers and developers as customers? Do you want to scale a high-growth startup?</em></strong></p><p>Aptible is hiring a support engineer to help us build a safer Internet for sensitive data.</p><p>It's true: Software is eating the world, powered by the Internet. A growing wave of developers all over the world are using web-scale technology to build and deploy health care, fintech, banking, payments, IoT, blockchain, machine learning, and other B2B applications.</p><p>Security and compliance are mandatory from day one for these teams of developers, but many of them struggle. When their teams are small, they can’t afford to hire full-time for security or compliance. When they scale, they find that existing security and compliance management tools suck.</p><p>At Aptible, we make people-centered security products that help developer teams build security into their architecture and their organization’s culture:</p><p>Enclave is a container orchestration platform built for developers that automates security best practices and controls needed for deploying and scaling Dockerized apps in regulated industries.</p><p>Gridiron is like the missing QuickBooks for security management. It helps developers design and run security management programs that meet and exceed requirements like HIPAA, SOC 2, and ISO 27001. Customers use it to build trust with their own customers and partners, and prepare for certifications.</p><p><strong>In this role you will:</strong></p><ul><li>Work directly with Enclave customers to diagnose and resolve their technical issues</li><li>Work with Aptible product engineers and site reliability engineers to improve the Enclave and Gridiron products</li><li>Learn a ton about Linux, AWS, Docker, and many modern web frameworks</li></ul><p><strong>You might be a good fit for this role if:</strong></p><ul><li>You have experience working with Linux and AWS</li><li>You’ve diagnosed and fixed bugs in several different software applications (and enjoy doing so!)</li><li>You are excited to work with Docker</li><li>You enjoy learning about modern web frameworks</li><li>You have strong writing skills and are comfortable with the responsibility of communicating directly with customers</li></ul><p><strong>You might be a good fit for Aptible if:</strong></p><ul><li>You think having a safe, private Internet is important</li><li>You prefer to work with a small group of high performers, relative to the scope of our customer/revenue base</li><li>You are a deliberate communicator, and value good communication</li><li>You’re self-directed and comfortable with autonomy and responsibility</li><li>You’re ready to work remotely, communicating asynchronously across time zones and cultures</li><li>You love learning, and want to grow professionally</li></ul><p><strong>Why you should work at Aptible:</strong></p><ul><li>Making the Internet safe to trust with sensitive data is a good thing!</li><li>It’s also pretty fun!</li><li>You will learn a lot about security, compliance, DevOps, and SaaS. We work very closely, collaborating across the company and teaching each other.</li><li>You will get to work with customers doing really cool things</li><li>You will feel invested in your work: We are highly internally transparent with business strategy, successes and failures, and management decisions. You will have a direct impact on success, and whether we achieve our goals.</li><li>You will help us build a business for the long term, investing in a sustainable business model and building trust with our customers through transparency and visibility</li><li>We are backed by excellent investors and have the resources we need to do a great job</li><li>Everyone gets to live in the place that suits them best. We work remotely, and meet up at least twice a year in places like Mexico, San Diego, Brooklyn, Barcelona, Denver, and Ann Arbor/Detroit. Next up: Paris? Iceland?</li><li>A+ benefits</li><li>Mandatory vacation</li></ul><p><em>Please be sure to include a cover letter that explains why you will be a good fit for this role.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Jan 8, 2018 5:54:56 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "0ToWfGMOSruzRDFnIkBRtg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63955",
    "title": "Customer Support Specialist",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Joining the Gaia GPS Team<br><br>Come build the best outdoor mapping software in the world. Your efforts will directly help a community of record-breaking backpackers, world-renowned guides, conservation scientists, wildland firefighters, hunters, offroaders, and more. Find Gaia GPS in the App Store, Google Play Store, and on gaiagps.com.<br>As a Customer Support Specialist, you'll correspond with Gaia GPS users, and help them in using Gaia GPS for their adventures and work. You'll create technical documentation and marketing materials. And you'll have a critical role in helping to improve the software, by understanding users and providing feedback into the product development process.<br><br>Your Main Responsibilities:<br><br></p><ul><li>Email Support/Technical Support<br></li><li>You'll assist users who want to learn about using the app, but you'll also dig deep into technical issues and bugs.<br></li><li>Answer user requests quickly and concisely<br></li><li>Communicate clearly and effectively with the engineering team about bugs and other issues<br></li><li>You'll need to answer about 20 emails per day, ranging in difficulty from quick and easy, to research intensive. At first, you'll stick with the easy questions but quickly transition to more difficult ones.<br></li><li>Write and maintain documentation<br></li><li>This includes our user-facing Help Center as well as an internal Help Center for the support staff<br></li><li>Other responsibilities may include writing and video work for marketing, managing ad campaigns, GIS work to help produce maps, or even writing code.<br><br>Qualifications:<br><br></li><li>concise and powerful writer<br></li><li>Ability to understand and solve obscure problems (poorly phrased questions, novice users)<br></li><li>Works hard without constant supervision (remote experience a plus)<br></li><li>Good with computers (learn new programs easily, coding/html/css knowledge a plus)<br></li><li>You don't need to be able to write your own programs, but basic knowledge of programming concepts will help you better understand technical issues, which is a large part of this job.<br><br>Traits/Activities We've Seen Correlate with Success:<br></li><li>you're an expert at something, and you've developed hard skills (examples: musical instrument, a -Master's degree, programming, bodybuilding, video production)<br></li><li>you have a lot of persistence (example: thru-hiked the Pacific Crest Trail)<br></li><li>you excelled at a rigorous program (example: salesperson who hit metrics, REI associate top performer)<br></li><li>you are self-taught in some areas<br></li><li>vested interest in the outdoors and/or maps<br></li><li>interest in or experience with programming<br></li><li>previous experience working remotely<br></li><li>good memory/recall<br><br>It's important to recognize that in a small company, you'll often be on your own. You won't always be told what problems to solve or what to work on. You should be a great self-starter and have an entrepreneurial spirit.<br><br>Please note the company is 100% remote - you should think about whether this will be a good setup for you. The advantages include huge flexibility in working hours, a quiet office, and the ability to work from home or wherever you like. The disadvantage is lack of physical society... we only get together a couple times a year, and this means finding physical society in local community and family. We collaborate via group chat, video calls, Slack, Quip, Github, Zoom, Dropbox, and Trello.<br><br>Compensation and Benefits<br><br>Flexible Schedule:<br>The team spans all US time zones, and you can set your own hours. People on the team often shuffle around hours so they can go hiking, skiing, or hunting at the best times. Your hours will be more constrained to start, during training.<br><br>The Comm team communicates frequently and it is important to overlap a few hours every day during regular business hours. Some weekend work necessary (usually about 1 weekend per month).<br><br>Compensation:<br><br>This is a full-time salaried position starting at $30,000/year - depends on experience and location<br></li><li>401K match - 100% up to 5% of salary<br></li><li>the potential for stock options later<br></li><li>comped cellular and home internet<br></li><li>Paid Time Off:<br></li><li>4 weeks of vacation<br></li><li>10-12 holidays, which you can shuffle around<br></li><li>5 sick days<br></li><li>maternity/paternity - 2 months/6 weeks<br><br>Other Benefits:<br><br></li><li>great computers/desks/chairs and other equipment provided<br></li><li>company-only and family-included retreats (previous trips include backcountry skiing to Peter Grubb Hut, hiking in Zion National Park, hiking in Rocky Mountain National Park, Tahoe skiing/hiking)<br></li><li>opportunities to go to conferences<br><br>How the Job Starts:<br><br>Starting out will include getting to know the Gaia GPS app, learning how to use the customer support platform, and learning to answer customer questions via email.<br>As you grow into your role, you will continue to take on more challenging technical issues. If time allows in the shoulder seasons, you'll have time to work on other things and develop new professional skills.<br><br>More about Us:<br>Every member of the small, profitable, boot-strapped Gaia GPS team shares a love of the outdoors, and works remotely from places all over North America (CA, MT, OK, WI, Canada). Read more about the team here: <a href='https://www.gaiagps.com/company/' rel='nofollow'>https://www.gaiagps.com/company/</a><br>Multiple team members thru-hiked the longest trails in the US (PCT and AT), and the technical team is highly competent, founded by an ex-Googler. Fifty percent of the team is female, including the technical founder.</li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 27, 2017 8:54:52 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/mobile",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "go",
      "mobile"
    ]
  },
  {
    "id": "uUKrV7DWS4e67DDez2zFqw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5995-customer-support-champion",
    "title": "Olark : Customer Support Champion",
    "content": "<div>  <div>    <h2>Customer Support Champion </h2>      <h4>Posted Dec 22</h4>    <h3>      <span>Olark </span><br>      <span>Headquarters: Ann Arbor, MI</span><br>        <a href='http://www.olark.com' rel='nofollow'>www.olark.com</a>    </h3>  </div>    </div>  <div>    <div>You probably haven’t run into a company like Olark before.</div><div><br></div><div><span>We are 40 people distributed around the globe working together to fundamentally change the way people communicate with businesses. We care deeply about customer service which is reflected in our&nbsp;</span><a href='https://www.olark.com/customers/why-we-do-all-hands-support' rel='nofollow'><span>All Hands Support</span></a><span>&nbsp;model. Our passion and dedication for our over 10,000 customers is a direct result of our&nbsp;</span><a href='https://www.olark.com/values' rel='nofollow'><span>people centric org model</span></a><span>. Simply put: we are on a mission to make business human.&nbsp;</span></div><div><br></div><div><span>Are you fanatical about providing great customer support and have meticulous attention to detail? We are looking for a new member to join our support team!</span></div><div><br></div><div><span>You will play a pivotal role in helping define our customer support culture by contributing to our positive organization and fulfilling our company goals to provide the best possible experience to our customers. We do this by building user-facing web applications and infrastructure to help thousands of people build stronger connections with their customers via real-time web chat.</span></div><div><span><br></span></div><div><span>Note: this is a fully-remote position. You must be based within the US or Canada in either the Eastern or Central time zone.&nbsp;</span></div><div><br></div><div><h3><span>Your primary responsibilities will be:</span></h3></div><ul><li><span><span>Frontline support:&nbsp;interacting with existing and potential customers, primarily via Olark chat and email, and occasionally over the phone, Skype or social media.</span></span></li></ul><div><h3><span>What we expect of you:</span></h3></div><ul><li><span>1-3 years of public facing customer support experience. Aptitude to learn technologies and tools like chat, email and CRM software.</span></li><li><span>You must be located within the Eastern or Central time zones.&nbsp;This is preferred in order to provide our customers with adequate support across all regions. This particular role will work Eastern time zone hours.</span></li><li><span>Excellent written and spoken English-language proficiency; proficiency in other languages is icing on the cake!</span></li><li><span>You need to LOVE chatting with people and solving problems.</span></li><li><span>You have mad skills at communicating technical issues to both engineers and to new users of all skill levels.</span></li><li><span>You have demonstrated experience providing amazing customer service and making people happy.</span></li><li><span>Experience with, or willingness to try, working remotely.</span></li></ul><div><h3><span>You can expect a lot from us:</span></h3></div><div><span>First off, make sure to read about our team culture at&nbsp;</span><a href='http://www.olark.com/jobs' rel='nofollow'><span>olark.com/jobs</span></a><span>, and our values at&nbsp;</span><a href='http://www.olark.com/values' rel='nofollow'><span>olark.com/values</span></a><span>. You can also get a sense of our history at&nbsp;</span><a href='http://www.olark.com/10000' rel='nofollow'><span>olark.com/10000</span></a><span>. Beyond what you see there, as a member of our support team you can expect:</span></div><div><br></div><ul><li><span>A great remote culture and team: Even though we’re geographically dispersed, our team makes the effort to connect to one another and we provide in person opportunities to further enhance that bond. We genuinely like each other. &nbsp;</span></li><li><span>A life outside of work: Olarkers generally work 40 hour weeks. Work is a marathon, not a sprint. We are building a company for the long haul.</span></li><li><span>We value your time to do focused work: We have one weekly required customer support meeting and a team wide sync. We appreciate and take advantage of the time we have to get in sync, but we also deeply value and respect our time to think and do focused work.</span></li></ul><div><br></div><div><em><em>Olark is committed to diversity in its workforce. Olark is an equal employment opportunity employer and considers qualified applicants without regard to gender, sexual orientation, gender identity, race, veteran or disability status.</em></em></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply here: <a href='https://olark.recruiterbox.com/jobs/fk0fier' rel='nofollow'>https://olark.recruiterbox.com/jobs/fk0fier</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 22, 2017 4:48:55 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/support",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "bEc9HwqhRTCLFL5pHpzSqg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63898",
    "title": "Customer Support Champion",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div>You probably haven’t run into a company like Olark before.</div><div><br></div><div><span>We are 40 people distributed around the globe working together to fundamentally change the way people communicate with businesses. We care deeply about customer service which is reflected in our&nbsp;</span><a href='https://www.olark.com/customers/why-we-do-all-hands-support' rel='nofollow'><span>All Hands Support</span></a><span>&nbsp;model. Our passion and dedication for our over 10,000 customers is a direct result of our&nbsp;</span><a href='https://www.olark.com/values' rel='nofollow'><span>people centric org model</span></a><span>. Simply put: we are on a mission to make business human.&nbsp;</span></div><div><br></div><div><span>Are you fanatical about providing great customer support and have meticulous attention to detail? We are looking for a new member to join our support team!</span></div><div><br></div><div><span>You will play a pivotal role in helping define our customer support culture by contributing to our positive organization and fulfilling our company goals to provide the best possible experience to our customers. We do this by building user-facing web applications and infrastructure to help thousands of people build stronger connections with their customers via real-time web chat.</span></div><div><span><br></span></div><div><span>Note: this is a fully-remote position. You must be based within the US or Canada in either the Eastern or Central time zone.&nbsp;</span></div><div><br></div><div></div><ul><li><span><span>Frontline support:&nbsp;interacting with existing and potential customers, primarily via Olark chat and email, and occasionally over the phone, Skype or social media.</span></span></li></ul><div></div><ul><li><span>1-3 years of public facing customer support experience. Aptitude to learn technologies and tools like chat, email and CRM software.</span></li><li><span>You must be located within the Eastern or Central time zones.&nbsp;This is preferred in order to provide our customers with adequate support across all regions. This particular role will work Eastern time zone hours.</span></li><li><span>Excellent written and spoken English-language proficiency; proficiency in other languages is icing on the cake!</span></li><li><span>You need to LOVE chatting with people and solving problems.</span></li><li><span>You have mad skills at communicating technical issues to both engineers and to new users of all skill levels.</span></li><li><span>You have demonstrated experience providing amazing customer service and making people happy.</span></li><li><span>Experience with, or willingness to try, working remotely.</span></li></ul><div></div><div><span>First off, make sure to read about our team culture at&nbsp;</span><a href='http://www.olark.com/jobs' rel='nofollow'><span>olark.com/jobs</span></a><span>, and our values at&nbsp;</span><a href='http://www.olark.com/values' rel='nofollow'><span>olark.com/values</span></a><span>. You can also get a sense of our history at&nbsp;</span><a href='http://www.olark.com/10000' rel='nofollow'><span>olark.com/10000</span></a><span>. Beyond what you see there, as a member of our support team you can expect:</span></div><div><br></div><ul><li><span>A great remote culture and team: Even though we’re geographically dispersed, our team makes the effort to connect to one another and we provide in person opportunities to further enhance that bond. We genuinely like each other. &nbsp;</span></li><li><span>A life outside of work: Olarkers generally work 40 hour weeks. Work is a marathon, not a sprint. We are building a company for the long haul.</span></li><li><span>We value your time to do focused work: We have one weekly required customer support meeting and a team wide sync. We appreciate and take advantage of the time we have to get in sync, but we also deeply value and respect our time to think and do focused work.</span></li></ul><div><br></div><div><em><em>Olark is committed to diversity in its workforce. Olark is an equal employment opportunity employer and considers qualified applicants without regard to gender, sexual orientation, gender identity, race, veteran or disability status.</em></em></div><div><br></div><p><strong>To apply:</strong> Please apply here: <a href='https://olark.recruiterbox.com/jobs/fk0fier' rel='nofollow'>https://olark.recruiterbox.com/jobs/fk0fier</a></p></span></td><td></td><td><a rel='nofollow'>10d</a></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 22, 2017 4:48:55 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/support",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "N8BpgHYxSdaTVwR8L1YCHw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5974-it-support-specialist",
    "title": "Peerfit: IT Support Specialist",
    "content": "<div>  <div>    <h2>IT Support Specialist</h2>      <h4>Posted Dec 19</h4>    <h3>      <span>Peerfit</span><br>      <span>Headquarters: US</span><br>        <a href='https://peerfit.com' rel='nofollow'>https://peerfit.com</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>Peerfit is a fast-growing, remote-first startup that is changing the landscape of wellness. We help employers leverage an expansive network of fitness offerings on a platform that helps members partake in classes/memberships using their peer group as a driver for engagement.</span></div><div><br></div><div><span>As an IT Support Specialist, you will help support the operations of the business through administration of custom and third-party web-based software applications, triage and troubleshooting technical support requests through Zendesk, and helping staff balance technology ease-of-use with meeting the regulatory requirements of the healthcare industry.</span></div><div><br></div><div><span>Strongly favor candidates with experience in compliance and security, with Google Apps &amp; Zendesk administration, and as a self-starter in a fully remote organization.</span></div><div><br></div><div><span>Other qualities we are seeking:</span></div><div><br></div><ul><li>Passion for health and fitness</li><li>Based in the US</li><li>Ability to adapt to the needs and pace of a growing startup</li><li>Self-motivated and persistent&nbsp;</li><li>Comfortable managing a backlog of issues of various priorities</li><li>Experienced in working through complex problems and identifying root-cause</li><li>Empathetic to users of varying technical abilities</li><li>Excellent written and interpersonal communication skills</li><li>Confident in managing your remote environment to minimize distractions, downtime and maximize distributed collaboration, communication</li><li>Flexibility to handle changing responsibilities</li></ul><div><br></div><div><span>What You Get:</span></div><div><br></div><ul><li>The opportunity to work in a supportive, team-oriented, and goal-driven startup culture with a passion for fitness</li><li>Remote first team</li><li>Health Insurance &amp; other benefits</li><li>Free fitness classes through Peerfit</li><li>Salary &amp; bonuses based on performance</li><li>The opportunity to help expand the impact of Peerfit across the United States and, someday, the world!</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please submit your application and resume for the IT Support Specialist role here: <a href='https://hire.withgoogle.com/public/jobs/peerfitcom/view/P_AAAAAADAAADIFKoKARIYDS' rel='nofollow'>https://hire.withgoogle.com/public/jobs/peerfitcom/view/P_AAAAAADAAADIFKoKARIYDS</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 20, 2017 12:18:20 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "78xEnZaEQ-WP6YvUsVqNgA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63848",
    "title": "IT Support Specialist",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div><span></span></div><div><span>Peerfit is a fast-growing, remote-first startup that is changing the landscape of wellness. We help employers leverage an expansive network of fitness offerings on a platform that helps members partake in classes/memberships using their peer group as a driver for engagement.</span></div><div><br></div><div><span>As an IT Support Specialist, you will help support the operations of the business through administration of custom and third-party web-based software applications, triage and troubleshooting technical support requests through Zendesk, and helping staff balance technology ease-of-use with meeting the regulatory requirements of the healthcare industry.</span></div><div><br></div><div><span>Strongly favor candidates with experience in compliance and security, with Google Apps &amp; Zendesk administration, and as a self-starter in a fully remote organization.</span></div><div><br></div><div><span>Other qualities we are seeking:</span></div><div><br></div><ul><li>Passion for health and fitness</li><li>Ability to adapt to the needs and pace of a growing startup</li><li>Self-motivated and persistent&nbsp;</li><li>Comfortable managing a backlog of issues of various priorities</li><li>Experienced in working through complex problems and identifying root-cause</li><li>Empathetic to users of varying technical abilities</li><li>Excellent written and interpersonal communication skills</li><li>Confident in managing your remote environment to minimize distractions, downtime and maximize distributed collaboration, communication</li><li>Flexibility to handle changing responsibilities</li></ul><div><br></div><div><span>What You Get:</span></div><div><br></div><ul><li>The opportunity to work in a supportive, team-oriented, and goal-driven startup culture with a passion for fitness</li><li>Remote first team</li><li>Health Insurance &amp; other benefits</li><li>Free fitness classes through Peerfit</li><li>Salary &amp; bonuses based on performance</li><li>The opportunity to help expand the impact of Peerfit across the United States and, someday, the world!</li></ul><p><strong>To apply:</strong> Please email your resume with cover letter to <a href='mailto:productjobs@peerfit.com' rel='nofollow'>productjobs@peerfit.com</a> with the subject 'IT Support Specialist'</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 20, 2017 12:18:20 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "jNvEbfu-RiWDAzjwP3Wk1w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8583-administrative-assistant-office-ninja",
    "title": "Administrative Assistant (Office Ninja)",
    "content": "Administrative Assistant (Office&nbsp;Ninja) - Jobmote<div><div><h2>Administrative Assistant (Office&nbsp;Ninja)</h2><h5>Clevertech</h5></div></div><div><div><div><div><div><h4>About You</h4><p>You have solid experience supporting a team and staying organized.</p><p>You are a go-getter and love diving into any task - big or small.</p><p>You love tech and believe that startups are going to change the world.</p><p>You’re fun! You’re charismatic! And you enjoy research and calendar management. You thrive on fast-paced deadlines, managing complex projects and shocking your team with neat tricks and innovative problem-solving skills.</p><p>You love social media and consider yourself a guru in the field.</p><p>You’re available from 9am-5pm EST and it’s a HUGE plus if you have previous experience on a distributed team!</p><p>Bonus points if you can tell us what the best hotel in London is, or you previously worked in a client focused role, in literally any industry.</p><h4>BENEFITS</h4><h5>Own Your Time</h5><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We are a collective of like minded people in over ten countries, and our global perspective shapes our every move.</p><h5>Focused Work</h5><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams. And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p><h5>Learn at your edges</h5><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</p><p>And of course, if you speak at a tech conference, we cover all expenses.</p><h5>Recharge Time</h5><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p>Want to learn more about Clevertech and the team? Check out&nbsp;<a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 19, 2017 5:00:34 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "ljJDVJQ2SHm1ic0fUWe3wQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30135?r=rss2",
    "title": "Clevertech: Administrative Assistant (Office Ninja)",
    "content": "<p>Full-time</p><p><strong>(Remote)</strong> </p><h3>About You</h3><p>You have solid experience supporting a team and staying organized.</p><p>You are a go-getter and love diving into any task - big or small.</p><p>You love tech and believe that startups are going to change the world.</p><p>You're fun! You’re charismatic! And you enjoy research and calendar management. You thrive on fast-paced deadlines, managing complex projects and shocking your team with neat tricks and innovative problem-solving skills.</p><p>You love social media and consider yourself a guru in the field.</p><p>You're available from 9am-5pm EST and it's a HUGE plus if you have previous experience on a distributed team!</p><p>Bonus points if you can tell us what the best hotel in London is, or you previously worked in a client focused role, in literally any industry.</p><h3>BENEFITS</h3><h4>Own Your Time</h4><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We are a collective of like minded people in over ten countries, and our global perspective shapes our every move.</p><h4>Focused Work</h4><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams. And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p><h4>Learn at your edges</h4><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</p><p>And of course, if you speak at a tech conference, we cover all expenses.</p><h4>Recharge Time</h4><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p>Want to learn more about Clevertech and the team? Check out&nbsp;<a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Dec 19, 2017 4:04:29 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "XjaRl3muT822D-6bXwo5cQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8546-technical-support-specialist-hi-or-ak-based",
    "title": "Technical Support Specialist (HI or AK based)",
    "content": "Technical Support Specialist (HI or AK based) - Jobmote<div><div><h2>Technical Support Specialist (HI or AK based)</h2><h5>Intellum</h5></div></div><div><div><div><div><div><h3>DESCRIPTION</h3><p>We are seeking a Technical Support Specialist to join our growing team. The scope of this role is to help the users of our tools reach their highest potential by educating them about our products, industry standards, and best practices. To be successful, you must be an excellent communicator, a creative and critical thinker, a master of organization, and a passionate learner. Most importantly, you need to love helping people! </p><p>We are in the process of expanding our team to support our growing list of global clients. Our headquarters is located in Atlanta, GA and this position will expand the hours that our support services are available. The ideal candidate for this position would be geographically located in Alaska or Hawaii.</p><ul><li>Answer support tickets in a timely manner</li><li>Coordinate issues with other shift(s) or Account Strategists as appropriate to ensure timely resolution</li><li>Build relationships with our clients and promote Intellum’s culture through the ticketing process</li><li>Support the Client Success team as needed</li></ul><h3>REQUIREMENTS</h3><ul><li>2+ years in a technical help desk role</li><li>SaaS software support experience preferred</li><li>Zendesk experience preferred</li><li>Experience with learning software a plus</li><li>Team player: automatically lending a hand when a co-worker is in need and asking for help when appropriate</li><li>Excellent organizational &amp; time management skills</li><li>Active learner who will hold him/herself accountable for his/her own job performance</li><li>Naturally positive and open-minded; able to view the world from more than one perspective</li><li>Creative thinker</li><li>Flawless written and verbal communication skills in English</li></ul><p><strong>NOTE: This is a remote position, however, due to the need to assist our clients around the clock, we are looking for a candidate located in Alaska or Hawaii.&nbsp;</strong></p><h3>BENEFITS</h3><ul><li>Insurance (US based only)</li><li>Medical - 100% of employee premiums covered</li><li>Dental - 100% of employee premiums covered</li><li><p>Vision - 100% of employee premiums covered</p></li><li><p>401(k) with matching (US based only)</p></li><li><p>Boost Budget - $3,500 per year in educational funds (All locations)</p></li></ul><p><strong>About Intellum:&nbsp;</strong> Intellum is an Atlanta-based SaaS company, with a development team distributed around the world. We strive to hire the best, regardless of location. Our clients include organizations such as Google, NASCAR, AT&amp;T, and Facebook. To learn more, please visit this&nbsp;<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttps%253A%252F%252Fintellum-inc.workable.com%252F' rel='nofollow'>link</a>.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 16, 2017 3:00:33 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "LH1kNlkLRZu5hDw9HB0U5A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5966-technical-support-specialist-hi-or",
    "title": "Intellum: Technical Support Specialist (HI or AK based)",
    "content": "<div>  <div>    <h2>Technical Support Specialist (HI or AK based)</h2>      <h4>Posted Dec 16</h4>    <h3>      <span>Intellum</span><br>      <span>Headquarters: Atlanta</span><br>        <a href='http://www.intellum.com' rel='nofollow'>www.intellum.com</a>    </h3>  </div>    </div>  <div>    <div><h3></h3></div><ul></ul><div><h3>DESCRIPTION</h3></div><div>We are seeking a Technical Support Specialist to join our growing team. The scope of this role is to help the users of our tools reach their highest potential by educating them about our products, industry standards, and best practices. To be successful, you must be an excellent communicator, a creative and critical thinker, a master of organization, and a passionate learner. Most importantly, you need to love helping people!<br></div><div></div><div></div><div>We are in the process of expanding our team to support our growing list of global clients. Our headquarters is located in Atlanta, GA and this position will expand the hours that our support services are available. The ideal candidate for this position would be geographically located in Alaska or Hawaii.</div><div><br></div><ul></ul><div><li>Answer support tickets in a timely manner</li><li>Coordinate issues with other shift(s) or Account Strategists as appropriate to ensure timely resolution</li><li>Build relationships with our clients and promote Intellum’s culture through the ticketing process</li><li>Support the Client Success team as needed</li></div><div><h3>REQUIREMENTS</h3></div><ul><li>2+ years in a technical help desk role</li><li>SaaS software support experience preferred</li><li>Zendesk experience preferred</li><li>Experience with learning software a plus</li><li>Team player: automatically lending a hand when a co-worker is in need and asking for help when appropriate</li><li>Excellent organizational &amp; time management skills</li><li>Active learner who will hold him/herself accountable for his/her own job performance</li><li>Naturally positive and open-minded; able to view the world from more than one perspective</li><li>Creative thinker</li><li>Flawless written and verbal communication skills in English</li></ul><div><strong>NOTE: This is a remote position, however, due to the need to assist our clients around the clock, we are looking for a candidate located in Alaska or Hawaii.&nbsp;</strong></div><div><br></div><div><h3>BENEFITS</h3></div><ul><li>Insurance (US based only)</li><li>Medical - 100% of employee premiums covered</li><li>Dental - 100% of employee premiums covered</li><li>Vision - 100% of employee premiums covered</li></ul><div><li>401(k) with matching (US based only)</li><li>Boost Budget - $3,500 per year in educational funds (All locations)</li><br></div><div></div><div><strong>About Intellum:&nbsp;</strong>Intellum is an Atlanta-based SaaS company, with a development team distributed around the world. We strive to hire the best, regardless of location. Our clients include organizations such as Google, NASCAR, AT&amp;T, and Facebook. To learn more, please visit this&nbsp;<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttps%253A%252F%252Fintellum-inc.workable.com%252F' rel='nofollow'>link</a>.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply here - <a href='https://intellum-inc.workable.com/jobs/626088' rel='nofollow'>https://intellum-inc.workable.com/jobs/626088</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 16, 2017 2:05:44 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "66PG9IMISaWhu0Rx-LUhBw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63793",
    "title": "Technical Support Specialist (HI or AK based)",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div></div><ul></ul><div></div><div>We are seeking a Technical Support Specialist to join our growing team. The scope of this role is to help the users of our tools reach their highest potential by educating them about our products, industry standards, and best practices. To be successful, you must be an excellent communicator, a creative and critical thinker, a master of organization, and a passionate learner. Most importantly, you need to love helping people!<br></div><div></div><div></div><div>We are in the process of expanding our team to support our growing list of global clients. Our headquarters is located in Atlanta, GA and this position will expand the hours that our support services are available. The ideal candidate for this position would be geographically located in Alaska or Hawaii.</div><div><br></div><ul></ul><div><li>Answer support tickets in a timely manner</li><li>Coordinate issues with other shift(s) or Account Strategists as appropriate to ensure timely resolution</li><li>Build relationships with our clients and promote Intellum’s culture through the ticketing process</li><li>Support the Client Success team as needed</li></div><div></div><ul><li>2+ years in a technical help desk role</li><li>SaaS software support experience preferred</li><li>Zendesk experience preferred</li><li>Experience with learning software a plus</li><li>Team player: automatically lending a hand when a co-worker is in need and asking for help when appropriate</li><li>Excellent organizational &amp; time management skills</li><li>Active learner who will hold him/herself accountable for his/her own job performance</li><li>Naturally positive and open-minded; able to view the world from more than one perspective</li><li>Creative thinker</li><li>Flawless written and verbal communication skills in English</li></ul><div><strong>NOTE: This is a remote position, however, due to the need to assist our clients around the clock, we are looking for a candidate located in Alaska or Hawaii.&nbsp;</strong></div><div><br></div><div></div><ul><li>Insurance (US based only)</li><li>Medical - 100% of employee premiums covered</li><li>Dental - 100% of employee premiums covered</li><li>Vision - 100% of employee premiums covered</li></ul><div><li>401(k) with matching (US based only)</li><li>Boost Budget - $3,500 per year in educational funds (All locations)</li><br></div><div></div><div><strong>About Intellum:&nbsp;</strong>Intellum is an Atlanta-based SaaS company, with a development team distributed around the world. We strive to hire the best, regardless of location. Our clients include organizations such as Google, NASCAR, AT&amp;T, and Facebook. To learn more, please visit this&nbsp;<a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttps%253A%252F%252Fintellum-inc.workable.com%252F' rel='nofollow'>link</a>.</div><div><br></div><p><strong>To apply:</strong> Please apply here - <a href='https://intellum-inc.workable.com/jobs/626088' rel='nofollow'>https://intellum-inc.workable.com/jobs/626088</a></p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 16, 2017 2:05:44 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "V4OD6OohS1Ome75f59ypZw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/jobs/5944-part-time-administrative-email-coordinator",
    "title": "Treats: Part-time Administrative Email Coordinator",
    "content": "<div>  <div>    <h2>Part-time Administrative Email Coordinator</h2>      <h4>Posted Dec 12</h4>    <h3>      <span>Treats</span><br>      <span>Headquarters: Remote</span><br>    </h3>  </div></div>  <div>    <div><span></span></div><div>We're looking for&nbsp;business or email writers with a track record in hard work and good writing.&nbsp;This is a part-time (25/30 hours) remote freelance position.&nbsp; This is a great remote position for individuals looking to work-from-home and receive stable, reliable income. In this position, you will solely be responsible for email correspondence with prospects and setting calendar appointments for sales reps.&nbsp;</div><div><br></div><div><b>Duties and Responsibilities</b></div><div><br></div><div>Manage multiple high volume inboxes throughout the day and correspond with executives and prospects</div><div><br></div><div>Exhibit excellent use of English&nbsp;</div><div><br></div><div>Research company key words from google and other websites</div><div><br></div><div>Multitask activities and execute efficiently&nbsp;</div><div><br></div><div>Set appointments for several different sales reps and manage multiple calendars</div><div><br></div><div><b>Requirements</b>:&nbsp;</div><div>Advanced Google/Google chrome experience</div><div><br></div><div>Fast typer, comfort with technology and data entry</div><div><br></div><div>Able to think quickly and move at a fast pace</div><div><br></div><div>Ability to quickly learn and utilize a variety of softwares and systems</div><div><br></div><div>Excellent writer</div><div><br></div><div>Native English speaker</div><div><br></div><div>Excellent research skills</div><div><br></div><div>Ability to quickly disseminate information and use accordingly</div><div><br></div><div>Ability to use a fast working computer (must supply your own)</div><div><br></div><div>Ability to calendar and schedule appointments in differing time zones</div><div><br></div><div>Excellent time management</div><div><br></div><div>Availability approx.&nbsp;10-4pm EST&nbsp;Mon.-Fri.</div><div><br></div><div><b>Preferred skills, but will teach:&nbsp;</b></div><div><br></div><div>Salesforce</div><div><br></div><div>Join.me</div><div><br></div><div><b>Education Requirements:&nbsp;</b></div><div><br></div><div><span>Bachelor’s Degree preferred, but not required if skills and experiences match</span></div><div><br></div><div>Minimum 2+ years’ experience in general business environment with data entry, project coordination, writing, and/or administrative experience.&nbsp;</div><div><br></div><div><b>Physical Requirements:</b></div><div><br></div><div>Sit for prolonged periods.</div><div><br></div><div>Coordinate multiple tasks simultaneously.</div><div><br></div><div>Once interviewed, you will be ask to take a 10-15 min. computer test.</div><div><br></div><div><b>Other:</b></div><div><br></div><div>Includes paid training<br></div><div>Work from home<br></div><div>This is a great remote position for individuals looking to work from home and receive stable, reliable income in a low stress environment. It is good opportunity for anyone looking to supplement other income/another job, for stay-at-home moms, budding entrepreneurs who want stable income, or freelancers.&nbsp;</div><div><br></div><div>Pay: $400-$425 per week</div><div><br></div><div><b>Application</b>:&nbsp;</div><div>Resume</div><div><br></div><div>Answer the following questions:&nbsp;<br></div><div>Why are you looking for a part-time job?&nbsp;<br></div><div>Why does this position interest you?&nbsp;<br></div><div>What's your business or email writing experience?</div><div></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send resume and answer the following questions to <a href='mailto:amandaflorence2835@gmail.com' rel='nofollow'>amandaflorence2835@gmail.com</a>: Why are you looking for a part-time job? Why does this position interest you? What's your business or email writing experience?Once selected for an interview, you will be asked to take a 10-15 min. computer test.</p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 10:14:20 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Wnq8Ub1iTxCMkdvfuW_tbA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8468-customer-operations-associate",
    "title": "Customer Operations Associate",
    "content": "Customer Operations Associate - Jobmote<div><div><h2>Customer Operations Associate</h2><h5>Clerky</h5></div></div><div><div><div><div><div><p>Here at Clerky, we build software to make legal paperwork easier for businesses and their attorneys. We're profitable and growing sustainably. We're the most popular way for high-growth technology startups to form, and are also used by tons of top tier startups and investors for fundraising.</p><p>As a customer operations associate at Clerky, you will be the face of the company to thousands of startup founders, investors, and attorneys. These customers use Clerky to get critical legal paperwork done, often on a tight timeline. Our success is based on word-of-mouth, so we have a strong culture of providing world-class service (ask us about our satisfaction ratings). We are rabidly customer-centric. Both our founders have substantial work experience in customer operations, and consider it integral to driving revenue and growth, rather than a cost-center.</p><p>Helping our customers is unusually challenging due to the nuanced and specialized nature of their questions. The level of craftsmanship that goes into writing responses to our customers can be intense. We're looking for someone who thinks critically about their writing and is always looking for ways to improve. Along the way, you'll also pick up a ton of knowledge about startups and startup law. If you love learning and constantly challenging yourself, this position is for you.</p><p>We're looking for someone who genuinely loves helping others and is dedicated to a career in customer operations. This position has tremendous opportunity for growth and advancement within customer operations, but is not a good fit as a stepping stone to other departments.</p><p><strong>Responsibilities</strong></p><ul><li>Writing thoughtful, responsive replies to customer emails<br></li><li>Writing and maintaining help center articles; identifying ideas for new articles based on customer inquiries<br></li><li>Spotting trends in customer issues that other team members should be alerted to<br></li><li>Coordinating with registered agent services to submit government filings<br></li><li>Auditing third-party service provider invoices and resolving discrepancies<br></li><li>Targeted outreach to customers for various product initiatives<br></li><li>Being an expert on our very complex software<br></li><li>Working with our engineering team to debug software issues our customers encounter<br></li><li>Assisting product development by testing new features and bug fixes, and conveying customer feedback</li></ul><p><strong>Minimum Requirements</strong></p><ul><li>Genuine love for helping people and high emotional intelligence<br></li><li>Exceptional written English communication skills, including the ability to write precisely and succinctly<br></li><li>Dedication to a career in customer operations<br></li><li>Extremely detail-oriented<br></li><li>Technologically savvy - you should be confident in your ability to use new software without training<br></li><li>Drive to do it better than it's ever been done before<br></li><li>2 years work experience in email-based customer operations or customer support roles</li></ul><p><strong>This is a great fit if you want to work:</strong></p><ul><li>... at a customer-centric company where customer support is truly a top priority<br></li><li>... at a company where providing customer support is unusually intellectually challenging<br></li><li>... in a company that strongly values efficiency, autonomy, and self motivation<br></li><li>... with bright people who are extremely passionate about their work<br></li><li>... where you'll be a key early team member&nbsp;</li></ul><p>This is a 100% remote position, open to anyone living in a US timezone. You'll be able to work from home or from anywhere else. Hours are flexible as long as they substantially overlap with standard business hours. We offer top-of-market compensation and benefits, reasonable hours, and reasonable customers.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 2:00:26 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "WGDuw7LfRB6jeLrVDfLjZw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5928-customer-operations-associate",
    "title": "Clerky: Customer Operations Associate",
    "content": "<div>  <div>    <h2>Customer Operations Associate</h2>      <h4>Posted Dec 11</h4>    <h3>      <span>Clerky</span><br>      <span>Headquarters: Burlingame, CA</span><br>        <a href='https://www.clerky.com' rel='nofollow'>https://www.clerky.com</a>    </h3>  </div>    </div>  <div>    <div>Here at Clerky, we build software to make legal paperwork easier for businesses and their attorneys. We're profitable and growing sustainably. We're the most popular way for high-growth technology startups to form, and are also used by tons of top tier startups and investors for fundraising.</div><div><br></div><div>As a customer operations associate at Clerky, you will be the face of the company to thousands of startup founders, investors, and attorneys. These customers use Clerky to get critical legal paperwork done, often on a tight timeline. Our success is based on word-of-mouth, so we have a strong culture of providing world-class service (ask us about our satisfaction ratings). We are rabidly customer-centric. Both our founders have substantial work experience in customer operations, and consider it integral to driving revenue and growth, rather than a cost-center.</div><div><br></div><div>Helping our customers is unusually challenging due to the nuanced and specialized nature of their questions. The level of craftsmanship that goes into writing responses to our customers can be intense. We're looking for someone who thinks critically about their writing and is always looking for ways to improve. Along the way, you'll also pick up a ton of knowledge about startups and startup law. If you love learning and constantly challenging yourself, this position is for you.</div><div><br></div><div>We're looking for someone who genuinely loves helping others and is dedicated to a career in customer operations. This position has tremendous opportunity for growth and advancement within customer operations, but is not a good fit as a stepping stone to other departments.</div><div><br></div><div><b>Responsibilities</b></div><div><br></div><ul><li>Writing thoughtful, responsive replies to customer emails<br></li><li>Writing and maintaining help center articles; identifying ideas for new articles based on customer inquiries<br></li><li>Spotting trends in customer issues that other team members should be alerted to<br></li><li>Coordinating with registered agent services to submit government filings<br></li><li>Auditing third-party service provider invoices and resolving discrepancies<br></li><li>Targeted outreach to customers for various product initiatives<br></li><li>Being an expert on our very complex software<br></li><li>Working with our engineering team to debug software issues our customers encounter<br></li><li>Assisting product development by testing new features and bug fixes, and conveying customer feedback</li></ul><div><br></div><div><b>Minimum Requirements</b></div><div><br></div><ul><li>Genuine love for helping people and high emotional intelligence<br></li><li>Exceptional written English communication skills, including the ability to write precisely and succinctly<br></li><li>Dedication to a career in customer operations<br></li><li>Extremely detail-oriented<br></li><li>Technologically savvy - you should be confident in your ability to use new software without training<br></li><li>Drive to do it better than it's ever been done before<br></li><li>2 years work experience in email-based customer operations or customer support roles</li></ul><div><br></div><div><b>This is a great fit if you want to work:</b></div><div><br></div><ul><li>... at a customer-centric company where customer support is truly a top priority<br></li><li>... at a company where providing customer support is unusually intellectually challenging<br></li><li>... in a company that strongly values efficiency, autonomy, and self motivation<br></li><li>... with bright people who are extremely passionate about their work<br></li><li>... where you'll be a key early team member&nbsp;</li></ul><div><br></div><div>This is a 100% remote position, open to anyone living in a US timezone. You'll be able to work from home or from anywhere else. Hours are flexible as long as they substantially overlap with standard business hours. We offer top-of-market compensation and benefits, reasonable hours, and reasonable customers.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply at: <a href='http://cler.ky/2nPhLqZ' rel='nofollow'>http://cler.ky/2nPhLqZ</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 1:04:03 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "j35BxAthS4GhcC_gFzeYmA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/160491/customer-support-engineer-platformsh?a=RP4jGs3sgko",
    "title": "Customer Support Engineer at Platform.sh",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior, Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Continuous Delivery, PaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We're looking for strong technologists who are good at talking directly to customers.</p><p><strong>Company:</strong></p><p>Platform.sh the award-winning PaaS solution is looking for a talented customer support engineer who is passionate about site uptime and happy customers.</p><p>Our customers run thousands of web applications in over 100 countries consuming 10s of thousands of CPUs on multiple public clouds. We were shipping containers before Docker, our sales team can explain the CAP Theorem. We can clone whole running systems, including the data, services, and networking in a matter seconds. The main API to operate and orchestrate our clusters of LXC containers is Git. We're hardcore technologists with equally hardcore customers.&nbsp;</p><p>Our customers need top-notch support to master the Platform.sh fun. Can you explain the intricacies of command line tools? We run OEM PaaS services for famous brands like Magento Enterprise Cloud Edition and Sensio Cloud - can you help us build and run these vibrant software products?</p><p><strong>Responsibilities:</strong></p><p>As a <strong>Customer Support Engineer, you liaise with customers with concerns and feed the engineering team with feedbacks. </strong>You will also be essential for diagnostics and debugging of failing applications and systems, and you have a strong mandate to help us automate and streamline everything we do. You are periodically on call in case disaster strikes. You're our front line, and when our customers think of how great Platform.sh is, they think of you.</p><ul><li>diagnose and debug failing applications and systems</li><li>respond to customer inquiries concerns and suggestions about our product in a timely manner</li><li>deploy and configure cloud resources</li><li>participate in on-call response to high priority tickets and incidents</li><li>troubleshoot issues pertaining to the infrastructure running customer applications</li><li>active participation to automation and streamlining projects</li></ul><p><strong>Must have:&nbsp;</strong></p><ul><li>Extensive experience&nbsp;with web applications of various kinds. PHP, Node.js, and Python applications are especially important to our current business</li><li>Experience with IaaS solutions, such as AWS, Microsoft Azure</li><li>Excellent communication and presentation skills: demoing products, explaining value and fielding technical, process and business-related questions</li><li>Ability to do the job in exquisite written and spoken English</li><li>Deep understanding of complete, modern hosting stacks</li><li>Experience with CDNs</li><li>Knowledge of DNS</li><li>Understanding of SSL certificates and encryption</li><li>Ability to use Git</li></ul><p><strong>Nice to have:</strong></p><ul><li>Knowledge of Magento Ecommerce, Symfony, Drupal, eZ Platform, or Typo3</li><li>Relational database skills</li><li>Public speaking experience</li><li>Blogging or writing experience</li><li>Experience as a performing musician, competitive athlete, dancer, actor, scout, sailor, or magician</li><li>Ability to kick ass in Chess or Go</li><li>A passion for photography, painting, or home brewing beer</li></ul>                    </div>                            <h2>                About Platform.sh            </h2>            <div><p>We’re a venture capital funded, award-winning team of hard-core hackers who want to revolutionize the way that developers and agencies build and deploy web applications. We’re mostly distributed, but we meet up daily in cyberspace, and occasionally in Paris, France. &nbsp;We value enthusiasm, team spirit, and a constant desire to expand personal knowledge and contribute to the community. We provide a multi-cultural, casual and balanced work environment. We recently helped launch&nbsp;Magento Enterprise Cloud Edition and the Sensio Cloud on Platform.sh technology.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from home, wherever you are                            </div>                            <div>                                 Safe and friendly working environment                            </div>                            <div>                                 Stock options for everyone                            </div>                            <div>                                 Rest and recovery are essential to health and happiness; we get that                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "tu4U0puyRPCZDHoqt8WAHA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/110183-awesome-people",
    "title": "Awesome People",
    "content": "<div><h2>Awesome People at Forkable</h2><div>San Francisco, Remote · Full Time</div></div><div><div>Compensation</div><div>$60K–$120K<br>0.0%–15.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Are you an amazing [engineer, salesperson, operations manager, social media guru, ...]? We're always on the lookout for awesome people to join us in our mission to automate the world's lunch.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Full Time",
      "Hardware Engineer",
      "Mobile Developer",
      "REMOTE1/100",
      "Remote OK",
      "San Francisco",
      "Software Engineer",
      "TECH1/unknown",
      "TITLE1/support",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  }
]
}
