{
 "items": [
  {
    "id": "bnABF53TQfCFpuWoAH8nEQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-copywriting",
    "url": "https://weworkremotely.com/remote-jobs/simpletexting-copywriter-and-marketer-for-mobile-marketing-software-as-a-service-company",
    "title": "SimpleTexting: Copywriter and Marketer for Mobile Marketing Software as a Service Company",
    "content": "<div>  <div>    <h2>Copywriter and Marketer for Mobile Marketing Software as a Service Company</h2>      <h4>Posted May 24</h4>    <h3>      <span>SimpleTexting</span><br>      <span>Headquarters: Miami, FL</span><br>        <a href='https://simpletexting.com/' rel='nofollow'>https://simpletexting.com/</a>      <br>      <a rel='nofollow'>View all SimpleTexting jobs →</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>SimpleTexting is seeking an entry-level copywriter and marketer to help with company messaging, marketing, and copywriting. </span></div><div><br></div><div><span>This is a remote full-time contract position and requires a disciplined and motivated individual. </span></div><div><br></div><div><span>Responsibilities:</span></div><div><br></div><ul><li><span>Research the marketplace to help optimize the way we communicate our offering at several first touch points (e.g., the way we tell our story on our homepage)</span><br></li><li><span>Work with senior management to modify first-touch messaging based on research.</span><br></li><li><span>Write new copy for the company product site.</span><br></li><li><span>Work with our SEO agency to determine content gaps and write copy to fill them.</span><br></li><li><span>Research long-form site article ideas and present to management for writing approval.</span><br></li><li><span>Research short-form blog article ideas and present to management for writing approval.</span><br></li><li><span>Anything else we think you would succeed at and would help the company.</span><br><br></li></ul><div><span>Qualifications:</span></div><div><br></div><ul><li><span>Creativity, intelligence, and affinity for a good turn of phrase.</span><br></li><li><span>Experience with marketing or sales copy is ideal.</span><br><br></li></ul><div><span>The perfect match is an articulate individual with an interest in internet technology and marketing. You will have the opportunity to collaborate with excellent professionals, internally and externally. This is your opportunity to see how a distributed team of professionals works to build, support, and advance a software as a service platform. </span></div><div></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send an email to <a href='mailto:jobs@simpletexting.net' rel='nofollow'>jobs@simpletexting.net</a> with a few non-boilerplate sentences about yourself and why you're the right person for this opportunity. Include a one-page PDF resume along with a writing sample and/or a link to your portfolio.Include 3-5 questions that you’d like to ask us after reviewing our website and this job ad.Include the phrase “I like guacamole” in the subject line of your email.</p>  </div>",
    "urlFetchPending": false,
    "published": "May 24, 2018 4:31:19 PM",
    "tags": [
      "DBG:surround``5N( opportun,             2N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Ep8pV-KMQ4evu6fAa5a2PA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/367859-self-management-curriculum-designer-content-creator",
    "title": "Self-Management Curriculum Designer/Content Creator",
    "content": "<div><h2>Self-Management Curriculum Designer/Content Creator at ConsenSys</h2><div>Brooklyn, Remote, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Instructional Design., Curriculum Development</div><div>Compensation</div><div>$50K–$60K<br>0.001%–0.001%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ConsenSys is a venture production studio and the leading technology firm in blockchain globally. We deliver products, solutions and platforms built using blockchain technology to transform how business is done in complex network of buyers, suppliers and consumers.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, the music industry, security, and infrastructure, and more. To accomplish this we've built out a flat organizational structure which we call the ConsenSys Mesh: a network of individuals &amp; teams working autonomously and towards the same goal.  Our mission is to use these decentralized solutions to fundamentally reshape the economic, social, and political operating systems of the planet. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p>About Organizational Development &amp; Global Operations at ConsenSys</p><p>Consensys is developing itself as a self organizing system. ConsenSys  believes that this is the only way we can be nimble and innovative enough to stay in the lead of the blockchain field. Project DNA combines our Organizational Development &amp; Global Operations Circles. Our goal is to facilitate the development of a self-organizing ecosystem that is agile, scalable, representative and transparent. We coordinate the creation of the mindsets, structures and skillsets needed for self-organization at the individual, team, and company-wide level.</p><p>About the role</p><p>The Self-Management Curriculum Designer/Content Creator will be a key builder of content in order to help our team improve our ability to scale and move towards a decentralized organization. You will be instrumental in establishing the design of the curriculum, building and curating content for Decentralized Organizations 101. You will play an integral role internally in our people’s self-management journey as well as sharing with the world what we are doing organizationally at ConsenSys. You will be a critical driver to our ability to scale and move towards a decentralized operating system.</p><p>Responsibilities</p><p>Define objectives for various courses<br>Outline the concept for a course or curriculum, defining (needs for) the course medium, content delivery, assessments, accompanying materials, and complementary learning approaches<br>Synthesize, build and write course content based on input from subject matter experts, written material, previous training courses, interviews, etc.<br>Use PowerPoint/Keynote to draft screen layouts, graphics and interactions appropriate to the content<br>Write the audio script for each course and work with subject matter experts<br>Work with subject matter experts to design evaluation and measurement systems to achieve learning objectives<br>Facilitate production process (graphics, animations, audio &amp; editing)<br>Work with subject matter experts and course sponsors to collect feedback and integrate it into the next course draft<br>Proof course at multiple stages of development and make or document required changes<br>Define project schedules and manage multiple projects simultaneously. Keep track of project tasks and status using defined methods<br>Complete various training, project management, and administrative tasks as needed<br>Participate in the team’s Agile sprint planning meetings to help define goals and direction<br>Provide insight into the latest learning tools, trends, and ideas</p><p>Requirements</p><p>You have exceptional written communication skills and preferably experience developing copy and copy editing content<br>You have experience in instructional design/curriculum design<br>You are user-centered in your approach on everything<br>You take an Agile, experimental approach in problem-solving<br>Passionate about and have experience in building the “future of work”, e.g. Teal organizations, self-management, movement building<br>Able to work collaboratively and communicate effectively with teammates, community members, vendors, and partners<br>Comfortable with ambiguity, yet driven to create order out of chaos<br>Resourceful self-starter<br>Focused and scrupulous about details<br>Demonstrated desire and drive to be a recognized thought leader within the larger Self-Management or Movement-Building community<br>Comfortable with working in a remote-first environment<br>Up to 30% travel</p><p>Experience with startups, or working at a non-traditional corporate organization or nonprofit is preferred.  Knowledge about blockchain &amp; Ethereum is not required, but candidates should be interested in the technologies poised to transform the way we live, and be open to learning deeply about blockchain topics.</p></div>",
    "urlFetchPending": false,
    "published": "May 18, 2018 2:21:14 AM",
    "tags": [
      "Brooklyn",
      "Curriculum Development",
      "DBG:surround``fulltim 4N remot",
      "DBG:surround``remot W OR(career,first)",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=5}",
      "Full Time",
      "Instructional Design.",
      "Operations",
      "REMOTE1/100",
      "Remote",
      "Remote OK",
      "TECH1/gamedev",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ]
  },
  {
    "id": "KErIr9FnQOC_oYhgs5y8Nw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/129539-restaurant-scout-content-editor",
    "title": "Restaurant Scout / Content Editor",
    "content": "<div><h2>Restaurant Scout / Content Editor at Forkable</h2><div>Los Angeles, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The restaurant scout finds great new restaurants for Forkable and helps us input them into our system. Sometimes you'll need to try the food out to make sure it's up to snuff.</p></div>",
    "urlFetchPending": false,
    "published": "May 15, 2018 3:43:53 AM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Los Angeles",
      "Office Manager",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "KguC7Px-ToueDk3jXqzyVQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/129538-restaurant-scout-content-editor",
    "title": "Restaurant Scout / Content Editor",
    "content": "<div><h2>Restaurant Scout / Content Editor at Forkable</h2><div>San Francisco, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The restaurant scout finds great new restaurants for Forkable and helps us input them into our system. Sometimes you'll need to try the food out to make sure it's up to snuff.</p></div>",
    "urlFetchPending": false,
    "published": "May 15, 2018 3:43:53 AM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Office Manager",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "San Francisco",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "lbOHZnHtTkG2vjxxPndAgA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/decentraland-senior-technical-writer",
    "title": "Decentraland: Senior Technical Writer",
    "content": "<div>  <div>    <h2>Senior Technical Writer</h2>      <h4>Posted May 13</h4>    <h3>      <span>Decentraland</span><br>      <span>Headquarters: Remote</span><br>        decentraland.org      <br>      <a rel='nofollow'>View all Decentraland jobs →</a>    </h3>  </div></div>  <div>    <div><span></span></div><div><span>We are looking for a versatile writer to join our Content and Marketing team to help write Decentraland’s blog posts, product announcements, press releases, and documentation. We are at the forefront of WebVR and blockchain technology: our foundation in this cutting-edge, developing technology requires that we provide our users with the clearest and most accessible content possible.</span></div><div><br></div><div><span>We are seeking a writer with previous experience writing marketing and technical content for a developer audience. However, our ideal candidate will possess a general writing skill set and the ability to adapt their tone and style to fit a wide range of genres and audiences -- all while staying true to Decentraland’s image as a brand and organization. The ability to perform independent research, interview subject matter experts, and write collaboratively with other content contributors are all equally critical to success in this role.</span></div><div></div><div><br></div><div><span>Responsibilities:</span></div><div><br></div><ul><li><span>Work with the content and marketing teams to write weekly blog posts and newsletters describing the Decentraland team’s most recent developments.</span><br><br></li><li><span>Write blog posts covering a range of topics related to the Decentraland platform. This could include WebVR development, Ethereum, user experience and design in virtual reality, blockchain-based cryptography and security, cryptocurrencies, and blockchain-based gaming.</span><br><br></li><li><span>Help with the creation of technical and non-technical documentation, like tutorials for our developer tools, FAQs, and technical reference documentation for our API.</span><br><br></li><li><span>Help with the creation of marketing content for publication across each of our social media channels.</span><br></li></ul><div><br></div><div><span>Minimum Requirements:</span></div><div><br></div><ul><li><span>Fluency in English with excellent verbal and written communication skills</span><br><br></li><li><span>A working knowledge of blockchain technology and the Ethereum ecosystem</span><br><br></li><li><span>A desire to work with a distributed, fast-moving team!</span><br></li></ul><div><br></div><div><span>Recommended Qualifications:</span></div><div><br></div><ul><li><span>A voracious attention to detail and meticulous writing and editing skills</span><br><br></li><li><span>Experience writing technical documentation for a developer audience</span><br><br></li><li><span>Experience writing on a content marketing team</span><br><br></li><li><span>Strong familiarity with the communities surrounding Ethereum, cryptocurrencies, and crypto-collectibles</span><br><br></li><li><span>Experience and comfort working on a distributed team</span><br><br></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send us your resumé and work samples (blogs, documentation, etc) to <a href='mailto:jobs@decentraland.org' rel='nofollow'>jobs@decentraland.org</a>. We will get back to you shortly :).</p>  </div>",
    "urlFetchPending": false,
    "published": "May 14, 2018 12:40:25 AM",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``headquart 3N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "___-m80pQk-HXaBi8cvW7w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/remote-jobs/animalz-content-manager",
    "title": "Animalz: Content Manager",
    "content": "<div>  <div>    <h2>Content Manager</h2>      <h4>Posted May 11</h4>    <h3>      <span>Animalz</span><br>      <span>Headquarters: New York, NY</span><br>        <a href='https://animalz.breezy.hr/p/890c4d42e71401-content-manager?source=weworkremotely' rel='nofollow'>https://animalz.breezy.hr/p/890c4d42e71401-content-manager?source=weworkremotely</a>      <br>      <a rel='nofollow'>View all Animalz jobs →</a>    </h3>  </div></div>  <div>    <div>Animalz is a content marketing agency that strives to create the best content on the web. We help companies—particularly B2B SaaS businesses—grow by making great content that their audience loves.</div><div><br></div><div>Our focus is on written content that helps companies educate and inform their audiences on strategies and tactics for being successful in their work. Product, design, marketing, sales, and engineering are the main topic areas we cover.</div><div><br></div><div><span>You could be</span>:</div><ul><li>an experienced content marketer looking to take your career to the next level</li><li>a journalist looking to make a career switch</li><li>a digital marketer looking to hone in on content marketing</li><li>an aspiring entrepreneur who wants to learn more about technology</li></ul><div><span>An ideal content manager at Animalz</span>:</div><ul><li>deeply passionate about writing and approach all forms of content with a creatively curious mindset</li><li>write clearly, concisely, and in an organized way</li><li>have a marketing sense for storytelling</li><li>understand the business side of writing</li><li>well-organized, independently motivated and loves working directly with customers</li><li>is fascinated by the role technology plays in our day-to-day lives and the ways it continues to shape our future.</li></ul><div><span>Responsibilities</span>:</div><div></div><div><br></div><ul><li>Compose, revise and deliver 2-4 blog posts per week</li><li>manage 2-4 customers</li><li>help craft and pitch ideas</li><li>content strategy</li><li>promotion</li><li>help the team learn from your customers by celebrating wins and sharing opportunities</li></ul><div><span><span>About Animalz</span></span></div><div><br></div><div><span></span></div><div>We’re a remote team with a home base in NYC and team members scattered around the world. We have an eclectic team of current and former scientists, journalists, operations folks, and more.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://animalz.breezy.hr/p/890c4d42e71401-content-manager?source=weworkremotely' rel='nofollow'>https://animalz.breezy.hr/p/890c4d42e71401-content-manager?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "May 11, 2018 4:54:01 PM",
    "tags": [
      "DBG:surround``5N( opportun,             2N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``home W base",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "_dzdGEfZSB6ajfek4Fjbtw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30558?r=rss2",
    "title": "fly.io: Writer, Content Creator, Dev Advocate",
    "content": "<p>Full-time</p><p><strong>(Chicago, IL)</strong> </p><div><div><div><p>fly.io is an open core, programmable CDN. Developers write JavaScript Edge Applications locally, test them, and deploy across our global network of servers.</p><p>We're hiring to improve our publishing! You might want to apply if you enjoy JavaScript and writing for developers. You'll be really good for this role if you can come up with interesting ideas and turn them into finished content. We're remote first, and super flexible, so you hopefully like talking to other people on Slack and getting together with the rest of the company every few months. If you like giving talks and going to conferences, you can do that too (but it's not a requirement)!</p><p>Example content:</p><ul><li><a href='https://fly.io/articles/fly-edge-apps-advanced-http-routing/' rel='nofollow'>https://fly.io/articles/fly-edge-apps-advanced-http-routing/</a></li><li><a href='https://onehostname.com/' rel='nofollow'>https://onehostname.com</a></li></ul><p>Salary is is competitive (they require we enter compensation on our posting, but that is not necessarily the bucket), our equity grants are relatively large (up to 2% of the company), and we offer health benefits for US based employees.</p><p>&nbsp;</p></div></div></div><p><a rel='nofollow'></a></p><p></p><p><strong>Apply:</strong> To apply, send an email to jobs@fly.io. Please include a developer focused writing sample, and links to any code you've written.</p>",
    "urlFetchPending": false,
    "published": "May 4, 2018 7:24:53 PM",
    "tags": [
      "DBG:surround``remot W OR(career,first)",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "oO5NvwnASn-0Lm_DOaV9kg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-copywriting",
    "url": "https://weworkremotely.com/remote-jobs/fly-io-content-creator-writer-dev-advocate",
    "title": "fly.io: Content Creator, Writer, Dev Advocate",
    "content": "<div>  <div>    <h2>Content Creator, Writer, Dev Advocate </h2>      <h4>Posted May  3</h4>    <h3>      <span>fly.io</span><br>      <span>Headquarters: Chicago, IL</span><br>        <a href='https://fly.io/' rel='nofollow'>https://fly.io/</a>      <br>      <a rel='nofollow'>View all fly.io jobs →</a>    </h3>  </div>    </div>  <div>    <div>We're hiring to improve our publishing! You might want to apply if you enjoy JavaScript and writing for developers. You'll be really good for this role if you can come up with interesting ideas and turn them into finished content. We're remote first, and super flexible, so you hopefully like talking to other people on Slack and getting together with the rest of the company every few months. If you like giving talks and going to conferences, you can do that too (but it's not a requirement)!</div><div><br></div><div>Example content:</div><div><br></div><div>https://fly.io/articles/fly-edge-apps-advanced-http-routing/</div><div>https://onehostname.com</div><div><br></div><div>Salary is is competitive, our equity grants are relatively large (up to 2% of the company), and we offer health benefits for US based employees.</div><div></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>To apply, send an email to <a href='mailto:jobs@fly.io' rel='nofollow'>jobs@fly.io</a>. Please include a developer focused writing sample, and links to any code you've written.</p>  </div>",
    "urlFetchPending": false,
    "published": "May 4, 2018 1:13:27 AM",
    "tags": [
      "DBG:surround``remot W OR(career,first)",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "LFdknuQTRLiLy-b8GnUZ0g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-copywriting",
    "url": "https://weworkremotely.com/remote-jobs/fly-io-technical-writer-dev-advocate",
    "title": "fly.io: Technical Writer, Dev Advocate",
    "content": "<div>  <div>    <h2>Technical Writer, Dev Advocate </h2>      <h4>Posted May  3</h4>    <h3>      <span>fly.io</span><br>      <span>Headquarters: Chicago, IL</span><br>        <a href='https://fly.io/' rel='nofollow'>https://fly.io/</a>      <br>      <a rel='nofollow'>View all fly.io jobs →</a>    </h3>  </div>    </div>  <div>    <div>We're hiring to improve our publishing! You might want to apply if you enjoy JavaScript and writing for developers. You'll be really good for this role if you can come up with interesting ideas and turn them into finished content. We're remote first, and super flexible, so you hopefully like talking to other people on Slack and getting together with the rest of the company every few months. If you like giving talks and going to conferences, you can do that too (but it's not a requirement)!</div><div><br></div><div>Example content:</div><div><br></div><div>https://fly.io/articles/fly-edge-apps-advanced-http-routing/</div><div>https://onehostname.com</div><div><br></div><div>Salary is is competitive, our equity grants are relatively large (up to 2% of the company), and we offer health benefits for US based employees.</div><div></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>To apply, send an email to <a href='mailto:jobs@fly.io' rel='nofollow'>jobs@fly.io</a>. Please include a developer focused writing sample, and links to any code you've written.</p>  </div>",
    "urlFetchPending": false,
    "published": "May 4, 2018 1:13:27 AM",
    "tags": [
      "DBG:surround``remot W OR(career,first)",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "fSgay5OyTZK2ARfGvXyzAA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/175061/technical-writer-needed-for-contract-work-croud?a=WI1m0WSzcEo",
    "title": "Technical Writer needed for contract work - remote working possible at Croud (Shrewsbury, UK) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Digital Agency</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>OVERALL PURPOSE OF THE ROLE:</strong></p><p><span>Capable and experienced Technical Writer required for a fast growing and technically driven digital marketing agency. The role, which is based in the Shrewsbury office, is key to Croud achieving their goal of developing an unparalleled Digital Marketing application platform. The Platform itself is based on years of experience delivering tools and services directly to an Agency and gathering feedback via close interaction with the Agency employees. Croud Inc Ltd are now looking to consolidate those learnings and produce a dedicated platform that will expose those tools and services via a number of different of channels including SaaS and BTC. We need a best in class Technical Writer to product world class documentation from the outset such that we can build out the platform vision without compromise.</span></p><p><strong>MAIN ACTIVITIES / TASKS:</strong></p><ul><li><span>Develops a thorough understanding of the audience and the documentation required by meeting with senior DevOps and Product team members to discuss technical problems</span></li><li><span>Researches and builds knowledge about products, services, technology, or concepts to be documented</span></li><li><span>Determines the clearest and most logical way to present information and instructions for greatest reader comprehension and writes and edits technical information accordingly</span></li><li><span>Revises, edits, or updates instructions, technical information, and frequently asked questions as necessary</span></li><li><span>Creates all required technical documentation such that constituent products and services can be outsourced.</span></li><li><span>Creates standardised specification templates to ensure consistency of product catalogue and documentation</span></li></ul><p><strong>REQUIRED KNOWLEDGE, SKILLS &amp; EXPERIENCE:</strong><span><br></span></p><ul><li><span>3 years of experience in technical writing</span></li><li><span>Experience working on SaaS products</span></li><li><span>Experience of working on internet systems involving APIs and Web apps</span></li><li><span>Familiarity with version control systems (Git)</span></li><li><span>Understanding of and ability to document REST interfaces</span></li><li><span>Understanding of and ability to document API products</span></li><li><span>Excellent time and project management experience</span></li></ul><p>                    </p></div>                            <h2>                About Croud            </h2>            <div><p>Croud is turning the world of digital marking on its head thanks to a unique combination of a globally distributed network of on-demand domain experts and a suite of ground breaking automation solutions.</p><p>As a result we are able to offer our clients a range of highly cost effective and best in class digital marketing solutions across a range of services including &nbsp;PPC, SEO, Content, Display and Paid Social. We sincerely believe we are the best agency in the world and that employing the very best people is essential to ensure that we remain in that position.</p><p>We’re looking for an exceptional&nbsp;PHP developer to help us build out our suite of tools and services that help us deliver the best service to our customers.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 25 days annual leave plus bank holidays                            </div>                            <div>                                 Annual performance bonus                            </div>                            <div>                                 Sale commission and candidate referral bonus                            </div>                            <div>                                 Pension scheme                            </div>                            <div>                                 Gym membership contributions                            </div>                            <div>                                 Ride to Work scheme                            </div>                            <div>                                 Free fruit, breakfast cereals and tea &amp; coffee                            </div>                            <div>                                 Childcare Voucher Scheme                            </div>                            <div>                                 Share options following six months of employment                            </div>                            <div>                                 Enhanced Maternity / Paternity package                            </div>                    ",
    "urlFetchPending": false,
    "published": "May 2, 2018 8:57:29 AM",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=1}",
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "J_PUOt_wSiW94EBZsBPdTw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-copywriting",
    "url": "https://weworkremotely.com/remote-jobs/custody-x-change-writer-researcher-latin-america-natively-fluent-english",
    "title": "Custody X Change: Writer / Researcher: Latin America, Natively Fluent English",
    "content": "<div>  <div>    <h2>Writer / Researcher: Latin America, Natively Fluent English</h2>      <h4>Posted May  2</h4>    <h3>      <span>Custody X Change</span><br>      <span>Headquarters: Utah, USA</span><br>        <a href='https://www.custodyxchange.com' rel='nofollow'>https://www.custodyxchange.com</a>      <br>      <a rel='nofollow'>View all Custody X Change jobs →</a>    </h3>  </div>    </div>  <div>    <div>I'm hiring someone to join our marketing team. Your role initially will be to research the child custody process for each of the 50 US states (one at a time - it's a big project), primarily by calling and emailing attorneys, mediators, and other custody experts. You will then write the information you learned into webpages (5+ per state). These webpages are for the general public to read when searching for their state's child custody process. We already have some information about each state on our website, and we'd like to expand it, as it's helpful to our current and future customers.</div><div><br></div><div>Previous research experience isn't required. However, you will have to be a decent writer, who can write in a concise and informative manner, to match our writing style for our website. This job is strictly in English and requires native English proficiency, although it is only available to those living in Latin America.</div><div><br></div><div>We are based in the US, but you will be paid in your local currency at an equivalent of USD $6-7 per hour. For example, if you live in Brazil, your pay would start between 20-24 BRL per hour. Or if you live in Mexico, your pay would start between 110-125 MXN per hour.</div><div><br></div><div>I'd like to hire you if you:<br></div><ul><li>Have native English skills, both speaking and writing; if English is not your first language, your TOEFL score must be 115+ or your IELTS score must be 8.5+</li><li>Enjoy writing and can write in a concise and informative manner</li><li>Would like to research topics by calling and emailing</li><li>Can stay on task without supervision and work independently</li><li>Live in Latin America</li><li>Want to work from home in a long-term, full-time position</li><li>And we get along; to see the team you'll be joining, visit our about us page</li></ul><div><br></div><div>My company is called Custody X Change. I've been working on the business since 2004. We sell software that creates child custody schedules and parenting plans. We're building a web/mobile application that will make it easy for families to communicate about custody scheduling, children's activities, and shared expenses. This will reduce a lot of conflict. And it will save people a ton of money in legal fees.</div><div><br></div><div>If you want to help people discover a genuinely helpful product, and join a small, distributed team, then we should talk.</div><div><br></div><div>To apply, email me at careers@custodyxchange.com, and:<br></div><ul><li>Include your resume in PDF format</li><li>Somehow use the word &quot;strawberry&quot; in the subject of your email</li><li>Answer the following 5 questions in your email, in this order:</li></ul><ol><li>Where do you live and what's your city like? (50-100 words)</li><li>Why are you looking for a remote job? (50-100 words)</li><li>Why will you do well working independently, with limited supervision? (50-100 words) </li><li>What's your story on how you learned English? And if you didn't learn it as your first language, what was your TOEFL or IELTS test score? (50-100 words)</li><li>What do you think about the starting salary? (50-100 words) </li></ol><div><br></div><div>Note: agencies need not apply; I'm looking for an employee to join our team.</div><div><br></div><div>Thanks,<br></div><div>-Ben</div><div><br></div><div>P.S. I want you to be happy working for me. I'll pay you a good salary and you can work normal hours. I care about results, not bureaucracy.<br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Follow the instructions listed above.</p>  </div>",
    "urlFetchPending": false,
    "published": "May 2, 2018 4:16:45 AM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(locat,live,resid) 3W OR(america,usa,europeanunion,europ) 5W work 2W from 2W home",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "jQGfAdeERYOm_jlGc9_2Gg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/68529/features-music-writers-at-giglist/",
    "title": "Features music writers",
    "content": "*About GigList*<br /><br />GigList is a market-disruptive music events and magazine site that launched in April 2017. Powered by an ambitious and successful team, we’re pushing the boundaries of what music media and event listings can achieve.<br /><br />*About the role*<br /><br />GigList is looking for full time, features writers to work on interesting editorial features and artist interviews. The candidate will be required to submit editorial and features ideas, or pick up on ones already in our content calendar. Focussing largely on industry topics, music reviews, artist profiles and interviews.<br /><br />*About you*<br /><br />The role is a remote one and can be based anywhere in the country. You will be a self-motivated person, who is passionate about music, with great organisation skills, and excellent writing abilities. This role will likely develop into a sub-editor role within 12 months, so is ideal for those with some experience already, who are looking to launch their careers in music journalism.<br /><br />*How to apply*<br /><br />Send us your CV and writing samples and we will be in touch soon to arrange an interview.",
    "urlFetchPending": false,
    "published": "Apr 30, 2018 10:39:08 AM",
    "tags": [
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "pcrTS_L_Q_-eGKOeGMv85A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/8114-technical-writer-rest-api-remote-job",
    "title": "Technical Writer- Rest API - Remote job",
    "content": "Technical Writer- Rest API - Remote job - Jobmote<div><div><h2>Technical Writer- Rest API - Remote job</h2><h5>Infinitum Global LLC</h5></div></div><div><div><div><div></div></div><div><div><div><p>Position Title: Technical Writer - (only W2 profiles)</p><p>Location : <strong>REMOTE POSITION</strong></p><p>Duration : 12Months W2 Contract Position</p><p><strong>Job Description:</strong></p><p><strong>Looking for contractor-technical writer type resource whom we can leverage for developing the Clear Commerce partner integration document for Restful API</strong>.</p><p><strong>Domain experience:</strong> Looking for commerce, credit cards, finance, banking domain experience.</p><p><strong>Responsibilities</strong></p><p>Work with internal teams to obtain an in-depth understanding of the product and the documentation requirements</p><p>Produce high-quality documentation that meets applicable standards and is appropriate for its intended audience</p><p>Write easy-to-understand user interface text, online help and developer guides</p><p>Create tutorials to help end-users use a variety of applications</p><p>Analyze existing and potential content, focusing on reuse and single-sourcing opportunities</p><p>Create and maintain the information architecture</p><p><strong>Requirements</strong></p><p>Proven working experience in technical writing of software documentation</p><p>Ability to deliver high quality documentation paying attention to detail</p><p>Ability to quickly grasp complex technical concepts and make them easily understandable in text and pictures</p><p>Excellent written skills in English</p><p>Strong working knowledge of Microsoft Office</p><p>Basic familiarity with the SDLC and software development</p><p>University degree in Computer Science, Engineering or equivalent preferred</p><ul><li>provided by Dice Technical writer, Restful API </li></ul></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "Apr 28, 2018 10:24:33 PM",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "URyBl_lfRYuE44_rUc-5rw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/8110-cisco-unified-communications-engineer-remote",
    "title": "Cisco Unified Communications Engineer (Remote)",
    "content": "Cisco Unified Communications Engineer (Remote) - Jobmote<div><div><h2>Cisco Unified Communications Engineer (Remote)</h2><h5>Valor Global</h5></div></div><div><div><div><div></div></div><div><div><div><p>Members of the Valor Solutions team implement technical solutions as developed by Solutions Architects for Valor s customers.</p><p>This position will be responsible for the following:</p><ul><li>Manage both service requests and trouble tickets related to the Cisco UCCE environment within predefined SLA s</li><li>Create documentation for customers and keep documentation up to date with an attention to detail and natural desire to be thorough</li><li>Responsible for resolving technical escalations from the Service Desk staff</li><li>Participate in on call rotation</li></ul><p>ESSENTIAL DUTIES AND RESPONSIBILITIES</p><ul><li>Add, Delete User</li><li>Add, change or delete a hard/IP Soft phone</li><li>Deploy or recover physical device</li><li>Adding IP Phone Service Subscriptions</li><li>Modifying or Adding a hunt group appearance</li><li>Reset Voice Mailbox</li><li>Change a Parameter (Name, Department or User ID) Number within the CMDB</li><li>Assign Line to Existing Phone</li><li>Add a Voicemail box to an existing phone</li><li>Add, change, move or delete station features</li><li>Assign or Modify Class of Service to an existing phone</li><li>Adding or Deleting Software Extensions</li><li>Change Name of a Voice Mailbox to a new user</li><li>Create or Delete Speed Call/Dial Lists</li><li>Create ACD Login ID</li><li>Station Call Redirection</li><li>Create or Delete Distribution Lists.</li><li>ACD Group Creation or Deletion</li><li>External VM Network Changes</li><li>Menu Tree modification</li><li>TOD Changes</li><li>Add, change, move or delete all extension assignments</li><li>Create, modify or delete traffic patterns</li><li>Manage port utilization</li><li>Add, change, or delete a Class of Service</li><li>Add, change, or delete a Class of Restrictions</li><li>Add, Change or remove a member in a trunk group</li></ul><p>EDUCATION AND/OR EXPERIENCE</p><ul><li><strong>High School Diploma or GED</strong></li><li><strong>BA/BS in Information Technology or Technology related degree (preferred)</strong></li><li>Minimum five (2+) years of experience working in technical support role</li><li>Cisco, Juniper, or other VoIP or network certifications desirable</li></ul><p>CERTIFICATIONS</p><p>A current CCNA Voice/Collaboration Certification or CCNP Voice/Collaboration Certification would be desirable</p><ul><li>provided by Dice Cisco, Juniper, VoIP </li></ul></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "Apr 28, 2018 10:24:30 PM",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "1lg5kp3HSqG0cNT9mWg6uA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/remote-jobs/lean-startup-co-head-of-content-marketing",
    "title": "Lean Startup Co.: Head of Content & Marketing",
    "content": "<div>  <div>    <h2>Head of Content &amp; Marketing</h2>      <h4>Posted Apr 19</h4>    <h3>      <span>Lean Startup Co.</span><br>      <span>Headquarters: Anywhere</span><br>        <a href='https://lean-startup-co.breezy.hr/p/8ab6e7d4b4b701-head-of-content-marketing?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/8ab6e7d4b4b701-head-of-content-marketing?source=weworkremotely</a>      <br>      <a rel='nofollow'>View all Lean Startup Co. jobs →</a>    </h3>  </div>    </div>  <div>    <div><span>ABOUT US:</span></div><div><br></div><div>Born from the global movement spawned by bestselling-author Eric Ries,&nbsp;<a href='http://leanstartup.co/' rel='nofollow'>Lean Startup Company</a>&nbsp;coaches a global community on the latest modern management techniques. We help advance Lean Startup principles, which provide a cutting edge, scientific framework for innovation and customer development. It’s about continuous testing so organizations of all sizes can effectively adapt and adjust before it’s too late.</div><div><br></div><div>Through our&nbsp;<a href='https://leanstartup.co/2018-conference/' rel='nofollow'>flagship conference</a>, educational materials, and expert faculty, we arm organizations with the entrepreneurial tools necessary to transform how they work. We serve every size company and sector of the economy —- from the the aspiring entrepreneur to high-growth startups, nonprofits, and large bureaucratic institutions. Our engaged community looks to us for practical knowledge and valuable lessons in modern management.</div><div></div><div></div><div><br></div><div><span>ABOUT THE POSITION</span></div><div><br></div><div>As the home base for the Lean Startup movement, we have a hearty community of enthusiastic followers.&nbsp;<span><span>And now we are seeking a creative, analytical and metrics-driven Director of Marketing who believes in the power of storytelling, has a proven track record of telling our own story and championing new marketing ideas and initiatives to accelerate our impact.</span></span></div><div><br></div><div>Come join us if you’re ready to&nbsp;<em>help our customers solve the world’s biggest problems.</em></div><div><br></div><div><span></span></div><div><br></div><div><span>You’ll thrive in this role if you have experience delivering results in these four areas of core competency:</span></div><div><br></div><ol><li><em>You have proven experience developing and leading company marketing strategy and vision and implementing innovative marketing and media initiatives to drive sales and revenue growth.</em></li><li>You’ve lead a high performing marketing team at 1+ startups and have a track record of successful outcomes using data-driven decision making.</li><li>You can share stories showing your uncanny ability to stay ahead of the curve by covering emerging trends, partnering with high-quality industry experts and testing and implementing multi-channel campaigns and initiatives to 1) increase audience reach and brand awareness and 2) drive customer engagement and acquisition.</li><li>You understand that your team supports the sales team’s ability to excel. You are their partner in crime and understand that your successful marketing initiatives will ultimately help drive growth.</li></ol><div><li><em>Not only are you a marketing extraordinaire, but you are also financially savvy.</em></li></div><ul><li>Sure, there are plenty of folks that can show how they produce results from their marketing efforts, but you also demonstrate a deep understanding of the business and delicate balance between marketing spend and results.</li><li>You have a track record of developing, setting and managing ambitious and actionable marketing goals, forecasts, and operating budgets that are aligned to target metrics.</li><li>You believe in and practice financial stewardship.</li></ul><div><li><em>You have experience honing product positioning, messaging and branding to effectively A) tell a brand’s story across new industry verticals and geographies and B) to drive sales and revenue growth.</em></li></div><ul><li>This isn’t your first time selling and marketing product offerings in the consulting services space. You can share stories about how you’ve positioned products for entry into new markets and verticals (including leveraging pricing strategies). You have proven success refining, or repositioning, product offerings and know the impact of this effort on the business (sales conversion rates, revenue, etc).</li><li>You can clearly communicate the value of the last few products you sold/marketed and how it is the&nbsp;<em>ideal&nbsp;</em>solution for your customer’s problems.</li><li>You can share unique narratives and stories that have positioned your company as a thought leader.</li></ul><div><li><em>Track record of leading and managing a successful marketing team</em></li></div><ul><li>You have 3+ years of experience with and enjoy recruiting, hiring, coaching and developing a high performing team.</li><li>Your passion and drive is contagious and inspires your team towards a common goal.</li></ul><div></div><div></div><div><br></div><div><span>In this role, you’ll spearhead initiatives that align the marketing strategy and vision across the whole company, with an initial strong focus on driving the marketing for our annual flagship conference. You will:</span></div><div><br></div><ol><li>Develop and drive company-wide marketing and media campaigns/initiatives aimed to:</li><li>Increase reach, engagement and brand awareness</li><li>Improve product offerings, product positioning and messaging (including sales and marketing collateral)</li><li>Test, report on, learn and iterate from the outcomes of those initiatives</li></ol><div><li>Drive company growth, and customer acquisition and retention, via a full stack of marketing activities like:</li></div><ul><li>Customer and Product research, discovery and development</li><li>Product refinement (re-positioning) and messaging</li><li>Collecting proof points from customers (e.g., case studies)</li><li>Product/vertical marketing</li><li>Channel marketing, demand generation and customer acquisition</li><li>Corporate branding, internal and external</li><li>Partner marketing</li><li>Thought leadership content marketing</li></ul><div><li>Ensure marketing message and brand consistency across sales, marketing and the company as a whole.</li></div><div><span>You’ll fit right into this role and our team if:</span></div><div><br></div><ul><li>You’re curious and resourceful. You LOVE solving problems and aren’t afraid to admit you are obsessed with getting the details right.</li><li>You have experience with, and ENJOY working for a young growing startup. You’ll work directly with the Co-Founder and must love the balance you need in this role; a mix of big picture strategic thinking and rolling up your sleeves and getting into the details.</li><li>You love that we’re seeking a fresh voice and leader to step in. You’re excited to be the architect that builds out the marketing function and to steer a well-run ship and team.</li><li>You have a strong sense of ownership and urgency as it relates to the health of the company.</li><li>You possess high levels of integrity, autonomy, and self-motivation.</li><li>You are open to feedback, take ownership of your mistakes, and love applying your lessons learned to get 10x better.</li><li>You have a keen ability to manage competing and changing priorities.</li><li>You are assertive, fair, and capable of directing others and implementing projects with little to no supervision.</li><li>You work well with cross-functional teams and hold yourself accountable for your actions.</li></ul><div><span>Requirements:</span></div><div><br></div><ul><li>BA/BS in Marketing, Business or related field preferred. MBA or other related graduate degree a plus.</li><li>7+ years of Marketing experience, with at least 3 years of experience leading a team.</li><li>Familiarity with and enjoy working remotely and collaboratively (Slack, Zoom, Google apps).</li><li>Excellent written, verbal and presentation skills.</li><li>Ability to juggle and prioritize many different tasks simultaneously, and enjoy collaborating with a wide range of teams.</li><li>Experience with Google Analytics (report generation &amp; analysis)</li><li>Bonus if you have marketing experience in Lean Startup, tech and/or innovation space.</li></ul><div><span></span></div><div></div><div><br></div><div><span>Why You’ll Love Working With Us</span></div><div><br></div><ol><li>We encourage growth.</li><li>If it’s your dream to become a leader in an organization, this is the role for you. We seek people who want to be promoted and grow with us.</li><li>You’ll have your very own Lean Startup coach to support practicing Lean Startup methods in achieving marketing outcomes (i.e., A/B testing, leading indicators, actionable metrics, etc.)</li></ol><div><li>You can work from wherever you want, as long as you have a working laptop and solid internet connection.</li></div><ul><li>We’re a 100% remote team using fun collaborative tools.</li><li>We encourage unplugging and prefer you don’t check email while you’re away.</li><li>Although we’re a fully remote team, we conduct our meetings via Zoom video calls and incorporate quarterly team onsites to get face time (fun team bonding activities included!)</li></ul><div><li>Big impact.</li></div><ul><li>If you’ve ever wanted to be in the middle of it all and leave a legacy, this is it. The work we do will go down in history as powerfully-transformative.</li><li>We are a startup with&nbsp;<span>global brand recognition</span>&nbsp;headquartered in San Francisco, CA. Our global community will give you a front row seat to the challenges they’re facing around innovation. Better yet, you get to help them solve their problems.</li></ul><div>The&nbsp;<span>position is a 100% remote, full-time role</span>, but we ask that you’re 1) located in&nbsp;<span>the U.S.</span>&nbsp;and 2) available to communicate during Pacific Time business hours.</div><div><br></div><div>*Note - We understand that you are eager to hear back from us. We receive a lot of applications and cannot respond to all of them. Please do not reach out to us regarding your application. If there is a mutual fit, we will contact you to move forward with the next steps in the process.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://lean-startup-co.breezy.hr/p/8ab6e7d4b4b701-head-of-content-marketing?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/8ab6e7d4b4b701-head-of-content-marketing?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 19, 2018 3:50:27 PM",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 3W OR(time,timezon)",
      "DBG:surround``remot 4W OR(skype, slack)",
      "DBG_TECH1:k/t/w:arm/embedded/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=8, frontend=0}",
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/writer",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "u8se0e8xRimnRGU2dL7kjw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/lean-startup-co-community-concierge",
    "title": "Lean Startup Co.: Community Concierge",
    "content": "<div>  <div>    <h2>Community Concierge</h2>      <h4>Posted Apr 17</h4>    <h3>      <span>Lean Startup Co.</span><br>      <span>Headquarters: Anywhere</span><br>        <a href='https://lean-startup-co.breezy.hr/p/1198ed23b8f701-community-concierge?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/1198ed23b8f701-community-concierge?source=weworkremotely</a>      <br>      <a rel='nofollow'>View all Lean Startup Co. jobs →</a>    </h3>  </div>    </div>  <div>    <div><span><b>ABOUT US:</b></span><br></div><div></div><div>Born from the global movement spawned by bestselling-author Eric Ries,&nbsp;<a href='http://leanstartup.co/' rel='nofollow'>Lean Startup Company</a>&nbsp;offers the most exciting education solutions in modern management available today.<br></div><div></div><div><br></div><div>We help advance Lean Startup principles, which provide a cutting edge, scientific framework for innovation so organizations of all sizes can effectively adapt and adjust before it’s too late.<br></div><div></div><div><br></div><div>Our year-round efforts transform how organizations work by arming them with an entrepreneurial methodology. We serve every size company and sector of the economy — from the the aspiring entrepreneur to high-growth startups, nonprofits, and large bureaucratic institutions. They look to us for practical lessons in modern management. We serve our highly-engaged community with professional, practical&nbsp;<a href='https://leanstartup.co/blog/' rel='nofollow'>content&nbsp;</a>and&nbsp;<a href='https://leanstartup.co/2018-conference/' rel='nofollow'>live events</a>&nbsp;and by connecting leaders with experts who can coach them in Lean Startup.<br></div><div></div><div><b><br></b></div><div><span><b>ABOUT THE POSITION</b></span></div><div>We’re seeking a community-driven customer concierge to be the conduit between our global network and our remote Lean Startup Co. team. This is a&nbsp;<span>full time, remote</span>&nbsp;administrative role for a self-starter with excellent organizational skills who loves helping customers resolve questions in a timely manner. You’re the vital first step in connecting our avid community members with our community experts, educators, events, and resources.</div><div><br></div><div><span><b>Concierge Responsibilities</b></span></div><div><br></div><ul><li>Field all calls to our general company phone line and email. Respond to all inquiries/correspondences within 24 business hours.</li><li>Assess the needs of incoming inquiries to understand the individual’s needs. Be their advocate to get them to the right solution.</li><li>Based on knowledge of solutions across the Lean Startup ethos, connect the community member with the person(s) applicable to their needs. For example, conference team, ambassador program, Lean Impact, volunteer opportunities, or other allies in our community.</li><li>Log and categorize all inquiries, including the sources and themes of the questions, as well as the outcomes.</li><li>Make the experience high-touch and well organized; the community member should feel satisfied with his/her needs being met.</li><li>Develop FAQs and directory/escalation flows based on common inquiries.</li><li>Be flexible and adaptable to new LSCo team needs as they arise; you’re the all-important administrative support for our events, sales, education teams, and community efforts.</li></ul><div><span><br></span></div><div><span><b>Administrative Support Responsibilities</b></span></div><div><br></div><ul><li>Support the Education team with:</li><li>Call/meeting preparation</li><li>Creation of decks, proposals and agreements</li><li>Calendaring support for calls and meetings</li><li>Use tools like Salesloft</li><li>And other responsibilities as needs and opportunities arise</li></ul><div><li>Support business development team with Salesforce data entry and regular maintenance/audits as well as Google Drive organization</li><li>Manage and create ad hoc Salesforce report requests</li><li>Other support requests as needed.</li><br></div><div><b><br></b></div><div></div><div><span><b>You’ll fit right into our team if:</b></span></div><div><br></div><ul><li>You pride yourself on being extremely detail oriented and have excellent communication skills. You proof anything you write multiple times before hitting “send.”</li><li>You’ve mastered the art of phone and email communication when it comes to understanding how to treat each person with the utmost respect and care.</li><li>You’re personable and empathetic. You’re able to quickly connect with people, gain their trust, and guide them in the right direction.</li><li>You’re an excellent troubleshooter, able to spot and figure out the solutions for an array of issues with minimal guidance from others. You take pride in problem-solving.</li><li>You have experience with, and genuinely enjoy working for a young, growing startup.</li><li>You have a strong sense of ownership and urgency as it relates to the health of the company.</li><li>You possess high levels of integrity, autonomy, and self-motivation.</li><li>You are open to feedback, take ownership of your mistakes, and love applying your lessons learned to get 10x better.</li><li>You have a keen ability to manage competing and changing priorities.</li><li>You work well with cross-functional teams and hold yourself accountable for your actions.</li></ul><div><span><br></span></div><div><span><b>Requirements</b></span></div><div><span><b><br></b></span></div><ul><li>College degree</li><li>2+ yrs experience in sales support and/or similar role (office manager/administrative assistant/customer liaison). Must have demonstrated experience representing a company in a professional, friendly manner.</li><li>Experience with Salesforce.</li><li>Comfort working with a remote team and using the tools such work requires (Slack, Zoom, Google apps)</li></ul><div><span><br></span></div><div><span><b>Bonus if you have:</b></span></div><div><br></div><ul><li>Experience selling or supporting a sales team selling consulting services.</li><li>Business development experience in Lean Startup, tech and/or enterprise innovation spaces.</li></ul><div><span><br></span></div><div><span><b>Why You’ll Love Working With Us</b></span></div><div><br></div><ul><li><em>We encourage growth.</em></li><li>If it’s your dream to become a leader in an organization, this is the role for you. We seek entrepreneurial types who want to be promoted and grow with us.</li></ul><div><li><em>You can work from the location of your choice as long as you have a working laptop and solid internet connection.</em></li></div><ul><li>We’re a 100% remote team that incorporates quarterly team onsites to ensure we have face time (fun team bonding activities included!)</li><li>We encourage unplugging for vacation and prefer you don’t check email while you’re away.</li></ul><div><li><em>You’ll have a big impact.</em></li></div><ul><li>If you’ve ever wanted to be in the middle of massive business transformations, this is the role for you. The work we do is powerfully transformative.</li><li>We are a startup with&nbsp;<span>global brand recognition</span>&nbsp;headquartered in San Francisco, CA. Our global community will give you a front row seat to the innovation challenges they’re facing. Better yet, you’ll get to help them solve those problems.</li></ul><div><span><br></span></div><div>*<span>Note:</span>&nbsp;Once you’ve applied for the job, we understand that you’ll be eager to hear back from us. Due to the high volume of applicants, we can’t respond individually regarding your specific application.Please do not reach out to us regarding your application. If there is a mutual fit, we will contact you to move forward with the next steps in the process.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://lean-startup-co.breezy.hr/p/1198ed23b8f701-community-concierge?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/1198ed23b8f701-community-concierge?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 17, 2018 3:54:07 PM",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "ZP4FNJrIQzu8JsNQNkFy6w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/replay-gaming-limited-community-coordinator",
    "title": "Replay Gaming Limited: Community Coordinator",
    "content": "<div>  <div>    <h2>Community Coordinator</h2>      <h4>Posted Apr  6</h4>    <h3>      <span>Replay Gaming Limited</span><br>      <span>Headquarters: London</span><br>        <a href='http://www.replaypoker.com' rel='nofollow'>www.replaypoker.com</a>      <br>      <a rel='nofollow'>View all Replay Gaming Limited jobs →</a>    </h3>  </div></div>  <div>    <div><span></span></div><div><span>The role</span></div><div></div><div><br></div><div><span>We’re looking for a Community Coordinator to join our small, fully-distributed Operations team on a Tuesday through Saturday schedule. This is a remote, full-time position available to candidates based anywhere in the US or UK.</span></div><div></div><div><br></div><div><span>As a Community Coordinator, you’ll be connecting with our player base daily. You’ll help us cover our ticket queues, assisting players with technical issues, rules questions, abuse reports, payment disputes, and any other questions they may have. You’ll be their advocate, passing along suggestions and feedback to management to help shape our development plan.</span></div><div></div><div><br></div><div><span>You’ll be one person on a Community team of three people passionate about providing the best poker experience for our players. This means you’ll have the chance to be innovative and own exciting projects, from assisting with volunteer management, blog publishing, creating social media content, and more! You’re someone who thinks creatively and can move a project forward without micromanagement.</span></div><div></div><div><br></div><div><span>Our team makes heavy use of Slack, ZenDesk, Confluence, Asana, Intercom, Discourse, WordPress, Disqus, and various social media channels. While you don’t need to be an expert with any of this software, we are looking for someone technically-savvy enough to pick things up quickly.</span></div><div></div><div><br></div><div><span>About us</span></div><div></div><div><br></div><ul><li><span>We’re a growing team, so you’ll have a huge impact on the decisions and work being done.</span><br><br></li><li><span>Our company is spread out across Europe, North America, South America and Asia.</span><br><br></li><li><span>We currently have a small London office (WeWork South Bank Central) where the CEO and COO are based, while everyone else works remotely, 100% of the time. If you're close to London, then you'll have the option to use our London office whenever you prefer.</span><br></li></ul><div><br></div><div><span>Qualifications and skills</span></div><div></div><div><br></div><ul><li><span>2+ years of customer support experience.</span><br><br></li><li><span>Remote work experience.</span><br><br></li><li><span>Technical aptitude. You should know how to clear a cache, take a screenshot, make a gif, and send a tweet.</span><br><br></li><li><span>Familiarity with help desk software, social media, and online forums.</span><br><br></li><li><span>Outstanding English language skills and the ability to communicate complicated subjects in a simple, readable way.</span><br><br></li><li><span>Tuesday - Saturday availability, with the ability to attend meetings from 11am - 1pm Eastern Time.</span><br><br></li><li><span>Empathy, patience, positivity, and enthusiasm for teamwork. We value soft skills here!</span><br></li></ul><div><br></div><div><span>Ideal candidates will also have …</span></div><div></div><div><br></div><ul><li><span>A love of poker, or the desire to learn!</span><br><br></li><li><span>Social media and/or blog management experience.</span><br><br></li><li><span>A background of forum participation or moderation.</span><br><br></li><li><span>Payments, disputes, and fraud experience.</span><br><br></li><li><span>Volunteer management experience.</span><br><br></li><li><span>A history of creating measurable goals and owning metrics.</span><br><br></li><li><span>Experience with mobile and/or freemium games.</span><br><br></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send a resume to <a href='mailto:ash@replaypoker.com' rel='nofollow'>ash@replaypoker.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 6, 2018 5:34:32 PM",
    "tags": [
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "UNpeKp3LQbOv0NrrQWmW7A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-copywriting",
    "url": "https://weworkremotely.com/remote-jobs/litcharts-freelance-writer",
    "title": "LitCharts: Freelance Writer",
    "content": "<div>  <div>    <h2>Freelance Writer</h2>      <h4>Posted Apr  4</h4>    <h3>      <span>LitCharts</span><br>      <span>Headquarters: New York</span><br>        <a href='http://www.litcharts.com' rel='nofollow'>www.litcharts.com</a>      <br>      <a rel='nofollow'>View all LitCharts jobs →</a>    </h3>  </div></div>  <div>    <div><span></span></div><div><span>LitCharts writers are an exclusive group of excellent writers with a deep understanding of literature and how to teach it to others. LitCharts writers have gone on to become best-selling nonfiction writers, 2017 national book award finalists, New York Times journalists, Harvard literature PhD candidates, and more. Now you can apply to join them!</span></div><div></div><div><br></div><div><span>We're hiring writers to help expand our collection of over 500 literature guides. Writers can work from anywhere and compensation varies based on the length and difficulty of the work. Pace and schedule are flexible, though our ideal candidates will have at least 10 hours per week to spend writing LitCharts.</span></div><div><br></div><div><span><br></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please send a resume as well as two writing samples to <a href='mailto:writing@litcharts.com' rel='nofollow'>writing@litcharts.com</a>. Samples should be academic papers that demonstrate your ability to analyze literature with insight and clarity. Samples should be at least 5 pages long, and can be up to any length (a thesis would be fine, for instance). We will not consider applications that do not include academic papers focused on literature. </p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 11:19:31 PM",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "P6pAq5-eQ32oaOmoMjyWHw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/remote-jobs/audience-ops-blog-writer-for-ongoing-retainer-topics-wordpress-design-dev-business",
    "title": "Audience Ops: Blog Writer for Ongoing Retainer (Topics: WordPress / Design / Dev / Business / Marketing)",
    "content": "<div>  <div>    <h2>Blog Writer for Ongoing Retainer (Topics: WordPress / Design / Dev / Business / Marketing)</h2>      <h4>Posted Apr  3</h4>    <h3>      <span>Audience Ops</span><br>      <span>Headquarters: US</span><br>        <a href='https://audienceops.com/jobs/writer/?src=weworkremotely' rel='nofollow'>https://audienceops.com/jobs/writer/?src=weworkremotely</a>      <br>      <a rel='nofollow'>View all Audience Ops jobs →</a>    </h3>  </div>    </div>  <div>    <div><span>Write your very best stuff at Audience Ops!</span><br></div><div></div><div><span><br></span></div><div>We're currently seeking a writer who has experience working with (and writing about) any of the following subjects:<br></div><div></div><div><br></div><ul><li>WordPress</li><li>Web design</li><li>Web development</li><li>User Experience</li><li>Software development</li><li>Business</li><li>Online marketing</li></ul><div><span><br></span></div><div><span>That said — the most important quality we’re looking for is your ability to write for industries that are relatively unfamiliar to you. You love asking questions and turning research interviews into compelling articles. You’ll be able to build your knowledge as you write for niche clients over a long period of time.</span><span></span></div><div><br></div><div><b>About working at Audience Ops:</b></div><div><b><br></b></div><div><span>We give you steady writing work, a proven team-driven process that allows you to research each audience, come up with topics that matter, and we’ll support you so you can produce stuff that will resonate and genuinely help those readers get ahead.</span><br></div><div></div><div><span>Here’s why our writers love being part of the Audience Ops team:</span><br></div><div></div><div><span><br></span></div><ul><li>Steady, longterm, reliable freelance retainer.</li><li>You get to brainstorm and research your own topics to write about.</li><li>Our editors and other teammates are here to support you.</li><li>Work from anywhere, any hours (we just care that your weekly deadlines are met)</li><li>The best team Slack chat on the Internet </li></ul><div><span><br></span></div><div><span><b>Requirements:</b></span></div><div><span><b><br></b></span></div><ul><li>Must be based in the United States</li><li>You’re comfortable working remotely</li><li>You have steady, ongoing part-time availability.</li><li>You've written blog content professionally and have samples of your work to share.</li></ul><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Submit your application here:  <a href='https://audienceops.com/jobs/writer/?src=weworkremotely' rel='nofollow'>https://audienceops.com/jobs/writer/?src=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 4:35:56 PM",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:wordpress/php/15",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=15, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/writer",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "V93GP4X0TQ-wW4b-p9IQlA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16742046",
    "title": "Karat - Seattle, WA & Remote Karat is a startup that conducts technical interviews for companies including Intuit, Jet, Mulesoft ...",
    "content": "<div>                  <span>Karat - Seattle, WA &amp; Remote<p>Karat is a startup that conducts technical interviews for companies including Intuit, Jet, Mulesoft and more. Our mission is to make interviewing for a software job a 5-star candidate experience. To accomplish this we use remote collaboration technology to enable candidates to interview wherever and whenever they’re most comfortable; we use rigorously tested and calibrated questions to provide consistent recommendations; and most importantly of all, we hire and train exceptional programmers and communicators to conduct these interviews. We are growing our remote interviewer team and internal engineering team in Seattle, WA.</p><p>Freelance Expert Interviewer - Remote - 15 to 40hrs per week <a href='https://jobs.lever.co/karat/d44ab283-c7c0-4bbd-b8c3-4dc0ced64c86?lever-origin=applied&amp;lever-source%5B%5D=HNWH' rel='nofollow'>https://jobs.lever.co/karat/d44ab283-c7c0-4bbd-b8c3-4dc0ced6...</a></p><p>Senior Software Engineer - Seattle, WA - Relocation Available <a href='https://jobs.lever.co/karat/7d70ca8a-2ed6-49a3-8403-b842ceabb60b?lever-origin=applied&amp;lever-source%5B%5D=HNWH' rel='nofollow'>https://jobs.lever.co/karat/7d70ca8a-2ed6-49a3-8403-b842ceab...</a></p><p>Product Manager - Seattle, WA - Relocation Available <a href='https://jobs.lever.co/karat/f97df2b1-fc3e-4566-8764-8eb7f9eac5f8?lever-origin=applied&amp;lever-source%5B%5D=HNWH' rel='nofollow'>https://jobs.lever.co/karat/f97df2b1-fc3e-4566-8764-8eb7f9ea...</a></p><p>Content Engineer- Seattle, WA - Relocation Available <a href='https://jobs.lever.co/karat/b56e272e-2c2d-4528-bc2e-d4c07fce3ab2?lever-origin=applied&amp;lever-source%5B%5D=HNWH' rel='nofollow'>https://jobs.lever.co/karat/b56e272e-2c2d-4528-bc2e-d4c07fce...</a></p><p>Opening soon - For more information please email cate@karat.io</p><p>-Engineering Manager - Seattle WA - Relocation available<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 9:00:07 AM",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "0YueHQ1DS4qWq72-b4L7Ug",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/remote-jobs/agentfire-com-chief-content-officer-pro-video-blog-creator-w-community-building-exp-for-real-estate",
    "title": "AgentFire.com: Chief Content Officer! - Pro Video/Blog Creator w/ Community Building Exp. for Real Estate Industry",
    "content": "<div>  <div>    <h2>Chief Content Officer! - Pro Video/Blog Creator w/ Community Building Exp. for Real Estate Industry</h2>      <h4>Posted Mar 27</h4>    <h3>      <span>AgentFire.com</span><br>      <span>Headquarters: Online</span><br>        AgentFire.com      <br>      <a rel='nofollow'>View all AgentFire.com jobs →</a>    </h3>  </div>    </div>  <div>    <div>Hi Guys,&nbsp;</div><div><br></div><div>It's time for AgentFire to get very serious about it's content marketing. Our self-published content ranks&nbsp;<b>tremendously&nbsp;</b>well thanks to thousands of quality backlinks established over the last 5 or so years. We're looking on someone who can help us truly capitalize on that with engaging, well-planned written&nbsp;<b>and</b>&nbsp;video content for our client base and broader audience.&nbsp;</div><div><br></div><div>We build real estate websites for real estate agents and brokers in the USA and Canada - For an example of a company creating killer content within our space you can check here:&nbsp;https://placester.com/real-estate-marketing-academy/</div><div><br></div><div>In summary we're looking for someone</div><ul><li><b>Content Writing:&nbsp;</b>Someone that can write concise, highly engaging content predicated around an intimate knowledge of both our product and our consumer base. Our stuff ranks really well so there should be a focus on creating very targeted content designed to rank well for various long tail keywords.&nbsp;</li><li><b>Video:&nbsp;</b>Can stand in front of a white (or otherwise neutral) background to record videos (we have animators and people that will do all of the edits, for an example video check here:&nbsp;https://placester.com/real-estate-marketing-academy/ - so you would plan out your content, film in front of a whiteboard and do basic editing -&nbsp;we have animators that would add in our characters / animations based on your oversight&nbsp;</li><li><b>Community Building</b>: Someone with an extremely friendly / infectious type personality that can help us build out the 'community' aspect of our business. We have tons of really happy clients (https://www.facebook.com/pg/AgentFireSites/reviews/) and we want to build content that supports them and helps them to engage more with us and with each other!</li><li><b>Bonus: Experience w/ Facebook and/or Google Marketing:&nbsp;</b>The most compelling content for our industry centers around Facebook and Google Marketing strategies (really anything that helps real estate agents generate more leads and close more deals) - so experience here is a big plus!</li></ul><div><span><br></span></div><div><b>Hours</b></div><div>You can work pretty much whenever you want - generally speaking our hours are from 9am to 9pm EST - and we are definitely looking for someone that can work fulltime (40hrs +)</div><div><br></div><div><b>Compensation</b></div><div>Pay will be commensurate with experience and what you bring to the table! Starting at $15/hr-$20/hr (and possibly higher for a real killer)</div><div><br></div><div><b>Location</b></div><div>This is a work from home position (why else would I post on weworkremotely.com! hehe) however if you've ever fancied the idea of living abroad in a place like Medellin, Colombia (which is where I'm personally based and have a small office) - that door is open and major bonus points as I've got recording stuff / film crew setup here!</div><div><span><br></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>If you think you'd be a good fit for the position, please send your application with as much information as possible (i.e. content or videos you've created) to <a href='mailto:nelson@agentfire.com' rel='nofollow'>nelson@agentfire.com</a>! </p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 28, 2018 1:21:02 AM",
    "tags": [
      "DBG:surround``OR(work,remot) 3W 3W(OR(wherev,whenev,where), OR(want,comfort))",
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/writer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ]
  }
]
}
