{
 "items": [
  {
    "id": "hRa5HtM2T0u3KfSm4nRl-g",
    "url": "https://remote.co/job/it-quality-assurance-analyst-ii-automation-focus/",
    "title": "IT Quality Assurance Analyst II – Automation Focus",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:sql-server/dotnet/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=1, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "CyraCom",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 26, 2018 6:41:11 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>IT Quality Assurance Analyst II – Automation Focus at <span>CyraCom</span></h2><div><span><i></i> Remote</span>        </div><div>            <p><strong>Region:Remote/Offsite Employee</strong></p><p><strong>Location:Remote Employee</strong></p><p><strong>Employment Duration:Full time</strong></p><p><strong>Description</strong></p><p><strong><em><u>POSITION SUMMARY:</u></em></strong></p><p>As an IT Quality Assurance Analyst II (Automation Focus) your attention to detail is unmatched. You enjoy validating code for both defects and usability issues and find satisfaction knowing that your work elevates the success of the team and the company. You believe in the power of collaboration and guide your daily interactions and behaviors as such and strive to steadily improve the standing of the IT team by listening to, learning from and teaching those around you. You will balance tactics with strategic thinking, shift towards a higher percentage of project work and help elevate Quality Assurance Effort.</p><p><strong>As an IT Quality Assurance Analyst II (Automation Focus) you will:</strong></p><ul><li>Create and implement both Manual and&nbsp;<strong>Automated&nbsp;</strong>test cases that directly reflect the user flow within CyraCom’s various and complicated system.</li><li>Thoroughly understand our domain knowledge, allowing you to effectively test individual system components at all levels while simultaneously considering the impact to the aggregate environment.</li><li>Document, track and resolve defects identified in testing by working collaboratively with the appropriate project team members.</li><li>Be a subject matter expert for your domain by staying on top of quality assurance industry and best practices.</li><li>Thrive off of a team environment and enjoy working with and supporting Development, Project Managers, Sales, Marketing and Systems.</li></ul><p><strong>As an IT Quality Assurance Analyst II you are:</strong></p><ul><li>Collaborative you understand the whole is greater than its parts.</li><li>Positive you believe in the infectious power of positive thinking and display this in your everyday work.</li><li>Passionate you love what you do and can’t wait to apply your skills to help people communicate.</li><li>Continually Learning you have an insatiable appetite to constantly improve yourself.</li><li>Technically Savvy you understand technical concepts and practices and create solutions that scale.</li><li>Self-Motivated you thrive in an environment where you work autonomously.</li><li>Goal oriented you understand how your work fits in the big picture and follow through to make your goals a reality.</li><li>A Team Player you understand the basics tenants of being a great teammate including proper time management, communication and attendance.</li></ul><p><strong>As an IT Quality Assurance Analyst II, you must have:</strong></p><ul><li>2-4 years of directly related IT quality assurance experience.</li><li><strong>Strong understanding of automated testing techniques and tools</strong>&nbsp;.</li><li>Enhanced knowledge of IT quality assurance governance processes and procedures.</li><li>Enhanced knowledge of various types of testing including user, functional, regression, stress, load, black box, white box, and gray box.</li><li>Excellent verbal, written and graphical communication skills.</li></ul><p><strong>Ideally, you will also have:</strong></p><ul><li><strong>Graduated from an accredited college or university with a Bachelor’s degree in Computer Science, Information Technology or directly related field.</strong></li><li>Experience with Test Rail, Pivotal Tracker, Selenium,&nbsp;<strong>Protractor, Appium</strong>, containerization, micro-services and SQL Server.</li><li>Experience with Agile</li></ul><p><strong>What else you can expect:</strong></p><p><strong><u>Physical Demands</u></strong>&nbsp;:</p><ul><li>Requires sitting or standing for extended periods of time.</li><li>Extensive use of a computer and repetitive hand movements in the performance of duties.</li><li>Occasional lifting and carrying of material weighing up to twenty pounds may be required</li><li><strong><u>Equipment Operated</u></strong>&nbsp;: Personal computer, printers, fax, copier and telephone.</li><li><strong><u>Environmental Factors</u></strong>&nbsp;: None.</li></ul><p><strong>Where Would You Work?</strong></p><p><strong>This position will be available as remotely based or located at one of our CyraCom offices in the United States.</strong></p><p><em>Duties not listed in this position description may be required of the employee at the discretion of management</em>&nbsp;.&nbsp;<em>The incumbent may delegate all or any of his/her duties to qualified personnel; however, such delegation does not relieve him/her of overall responsibility and accountability for the successful conduct of those duties.</em></p><p><strong>WHY WORK FOR CYRACOM?</strong></p><p>CyraCom International, Inc. is the leading provider of language interpreting services and operates the most extensive network of large-scale interpreter contact centers. CyraCom impacts the lives of millions in the United States by connecting those with limited English proficiency to critical services. In business since 1995, CyraCom services thousands of clients throughout the US, Canada, and Europe. The Company was named to the Inc. 5000 list of fastest growing private companies in the United States for a ninth year in a row and eleventh time overall in 2017.</p><p><strong><em>We’re saving lives every day.</em></strong></p><p>CyraCom team members help thousands of people communicate every day by removing cultural and linguistic barriers in all levels of every day conversation. We ensure high levels of accessibility by providing interpretation services over the phone, through video, and on-site at our client locations. We work relentlessly to provide the support and infrastructure necessary to ensure people can communicate at a moment’s notice, because at any time our service could be needed in a life-saving event. Our hundreds of clients span numerous industries, including hospitals, banks, insurers, entertainment companies, and government agencies.</p><p><strong><em>Our employees most often say three things:</em></strong></p><ul><li><strong>Culture:&nbsp;</strong>You have the resources of a large company with the flexibility and excitement of a start-up.</li><li><strong>Impact:&nbsp;</strong>Your contributions matter; people notice the changes and improvements you create.</li><li><strong>Meaning:&nbsp;</strong>Your work ultimately helps improve the lives of millions in the United States CyraCom helps those who cannot communicate normally to access to healthcare and other vital services.</li></ul><p><strong>COMPANY CULTURE</strong></p><p>We value our employees and believe that an enjoyable work environment is beneficial to all. Here are some ways we contribute to that goal:</p><ul><li>We celebrate our diverse workforce.</li><li>We encourage our employees’ professional and personal growth, including tuition reimbursement and internal promotions</li><li>We provide a business casual dress code (with casual Fridays).</li><li>On occasion, CyraCom provides a professionally catered luncheon for employees at each of our locations.</li><li>CyraCom also sponsors occasional Spirit Days customized for each location and its employees.</li></ul><p><strong>BENEFITS HIGHLIGHTS</strong></p><p>CyraCom provides a generous menu of benefits from which you can pick and choose what is best for you and your family, including Medical, Rx, Dental, Vision, Life, AD&amp;D, Disability, 401(k), Paid Time Off, Employee Assistance, Employee Referral Program, Tuition Reimbursement, and professional development.</p><p>CyraCom also provides competitive salaries, along with discretionary bonuses based on individual and company performance</p><p><strong>Equal Opportunity Employer</strong></p><p><em>Cyracom International, Inc.’s success is driven by the advantage created by the collective efforts of its employees, and is dependent upon a diverse, inclusive environment that embraces change, new ideas, respect for the individual and fosters an equal opportunity for success. We have zero tolerance for discrimination, intimidation or harassment of any kind. Cyracom International, Inc. is an equal opportunity employer. CyraCom International, Inc. maintains a drug-free workplace.</em></p>        </div><div>        <a href='https://chp.tbe.taleo.net/chp01/ats/careers/requisition.jsp?org=CYRACOM&amp;cws=1&amp;rid=9432' rel='nofollow'>Apply for job</a>    </div>"
  },
  {
    "id": "C3MpPlbDQmOTNkNS34NBBQ",
    "url": "http://jobmote.com/jobs/23727-senior-system-test-engineer-remote-work-available-for-the-right-candi",
    "title": "Senior System Test Engineer (Remote Work Available for the Right Candi",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:angular/frontend/8",
      "DBG_TECH1:k/t/w:c#/c/12",
      "DBG_TECH1:k/t/w:c#/dotnet/30",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:typescript/frontend/2",
      "DBG_TECH1:k/t/w:typescript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=30, c=12, mobile=0, go=0, nodejs=3, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=11}",
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Precision Systems",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 26, 2018 10:20:39 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p>Our Fortune 500 direct client is hiring for an experienced systems test engineer to develop automation frameworks in C#. The ideal candidate has experience with C# development, Webdriver/C#, Cucumber, etc. This role is based out of Colorado Springs, CO, but a remote work arrangment can be made for the right candidate! Does this sound right the right fit for you? </p><p>If so, APPLY NOW! </p><p>Essential Skills:<br>Javascript &amp; Typescript<br>WebDriver using C#<br>C#/Rest APIs<br>Speckflow<br>Experienced GitHub for code branching </p><p>Plusses:<br>Experience working in Angular/Typescript is a plus </p><p>Please click the Apply Now button to apply for the job.<br>We will review your resume and call if you are qualified.<br>Resumes will NOT be sent to clients without your approval. </p><p><strong>REFERRALS WANTED - $ 1000 REWARD!</strong><br>Refer a colleague to us, and Precision will give you $ 1000 if we find a job for that person! </p><p>(The fine print: The referred candidate must be previously unknown to us. Start date must be within 6 months of referral.) </p><p><strong>THERE ARE MANY IT STAFFING FIRMS YOU CAN WORK WITH.<br>WHY WORK WITH PRECISION?</strong> </p><p>Our Clients. We work with the best. </p><ul><li><p>We are direct vendors to Fortune 500 companies across North America </p></li><li><p>We're the top provider of contract IT professionals to many of our clients </p></li></ul><p>Our Experience. We know how to sell our candidates to clients. </p><ul><li>We've been in business for over 20 years, and have made thousands of successful placements<br></li></ul><p>Our Background. Precision is run by former IT professionals. </p><ul><li><p>We know what it is like to be an IT consultant working in a large organization. </p></li><li><p>We actually understand your skills. We'll make sure that you are right for the job, and that the job is right for you. </p></li></ul><p>Our Reputation for Quality. Clients favor Precision's candidates. </p><ul><li><p>We take the time to learn about you so that we can best match you to our openings and sell you to our clients. </p></li><li><p>Our clients know from experience that Precision's consultants are the most qualified and the best fit for their project teams. </p></li></ul><p>Our Ethics. We pride ourselves on our ethical business practices. </p><ul><li><p>We never submit your resume without your permission, and we never give your resume to other staffing companies </p></li><li><p>We are up front about pay rates and the interviewing process, and provide you with constant feedback. </p></li></ul><p>Our Responsibility. We take seriously our obligations to our consultants. </p><ul><li><p>We always pay on time </p></li><li><p>We offer highly competitive pay rates, as well as an opportunity to participate in our group health insurance, long term disability and 401(k) plans. </p></li><li><p>When required, we carefully manage H1-B and Green Card applications, and involve you at every step. </p></li><li><p>We have dedicated HR personnel that will answer the phone when you call. </p></li></ul><p><strong>THE STAFFING FIRM YOU WORK WITH MATTERS.<br>WORK WITH PRECISION.</strong> </p><p>Job ID 3664DI-0026 - provided by Dice C#.NET </p></div></div><div></div></div></div>"
  },
  {
    "id": "O2cQyvWvSYeOl0zYnBE7UQ",
    "url": "http://jobmote.com/jobs/23669-senior-system-test-engineer-remote-work-available-for-the-right-candi",
    "title": "Senior System Test Engineer (Remote Work Available for the Right Candi",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:angular/frontend/8",
      "DBG_TECH1:k/t/w:c#/c/10",
      "DBG_TECH1:k/t/w:c#/dotnet/25",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:typescript/frontend/2",
      "DBG_TECH1:k/t/w:typescript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=25, c=10, mobile=0, go=0, nodejs=3, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=11}",
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Precision System Design, Inc.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 25, 2018 7:20:56 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p>Our Fortune 500 direct client is hiring for an experienced systems test engineer to develop automation frameworks in C#. The ideal candidate has experience with C# development, Webdriver/C#, Cucumber, etc. This role is based out of Colorado Springs, CO, but a remote work arrangment can be made for the right candidate! Does this sound right the right fit for you? </p><p>If so, APPLY NOW! </p><p>Required: </p><p>Javascript &amp; Typescript<br>WebDriver using C#<br>C#/Rest APIs<br>Speckflow<br>Experienced GitHub for code branching </p><p>Plusses: </p><p>Experience working in Angular/Typescript is a plus </p><p>.............................. </p><p>We will call qualified candidates after review.<br>Resumes will NOT be sent to clients without your approval. </p><p>.............................. </p><p><strong>REFERRALS WANTED - $1000 REWARD!</strong><br>Refer a colleague to us, and Precision will give you $1000 if we find a job for that person! </p><p>(The fine print: The referred candidate must be previously unknown to us. Start date must be within 6 months of referral.) </p><p>Overtime: straight time<br></p></div></div><div></div></div></div>"
  },
  {
    "id": "aa22jT9SQrund2N9zg2cXw",
    "url": "https://stackoverflow.com/jobs/198961/net-qa-engineer-ii-at-fast-growing-cannabis-growflow?a=14IYeTVUuFOg",
    "title": ".NET QA Engineer II at fast growing Cannabis Startup (remote) at GrowFlow (Seattle, WA) ",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 3W OR(time,timezon)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 9W 4N( OR(offic,onsit), time)",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:dotnet/dotnet/40",
      "DBG_TECH1:k/t/w:sql-server/dotnet/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=47, c=2, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/qa",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "GrowFlow",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 50000,
      "maxValue": 75000,
      "info": "Equity",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>.NET QA Engineer II at fast growing Cannabis Startup (remote)</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>QA/Test Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Agriculture, B2B, CRM</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>11-50 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: GrowFlow | Seattle, WA<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                            <div>                                    <span>Preferred Timezone:</span>                                    <span>(GMT-08:00) Pacific Time +/- 4 hours</span>                                </div>                                                            <div>                                    <span>Office Location:</span>                                    <span>Seattle, WA.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>.net</div><div>azure</div><div>qa</div><div>automated-tests</div><div>selenium</div>                <h3>Job description</h3>                <div><p>Join a high growth startup that is working to revolutionize the future of Sales and Traceability in the legal recreational Cannabis space. GrowFlow is a leading seed to sale traceability solution for the state of Washington. &nbsp;We are rapidly growing to help producers and processors track grow operations and improve their sales process.</p><p>As a QA Engineer II, you will be involved throughout the development lifecycle with particular emphasis on the quality assurance of software development and deployment. The QA Engineer II will head this new department and be responsible for test planning, documenting, coordinating, and executing activities related to the testing of systems, databases, user interfaces. This is a hybrid role that will include both manual testing and automation scripting for functional, integration, regression, and performance testing to meet the business requirements, and the strategic mission and goals of the organization while mitigating risk.&nbsp;</p><p>GrowFlow is a small organization where everyone wears multiple hats.&nbsp; In addition to owning the QA Department you will be expected to review any support incidents that come from the Customer Service team, before they get handed to Development.&nbsp; Additionally, you will be expected to handle the occasional .NET development tasks that are suitable for your skills.</p><p>Must be a self-starter, with excellent communication and interpersonal skills, and strong attention to detail. Displays the ability to work with quality tools, methods, and techniques as applicable to Information Technology. You will be expected to manage work tasks independently and will assist in the planning, organizing and coordinating of technical tasks and work assignments, collaborating closely with Development, Product Team, Customer Success and the CEO.&nbsp;&nbsp;</p><p>Must be a driven, passionate individual who works well with a team.</p><p><strong>What you’ll do</strong></p><ul><li>Write Test Cases and execute Test Case to ensure development outputs meet defined specification cases in coordination with Business requirements, Technical Specifications, installers / upgrades documents, and management.</li><li>Perform Exploratory, Functional, Integration, UI, back-end testing, White box/Black box testing. Demonstrate the capacity to investigate and debug the complex issues.</li><li>Analyze automation test results and present analysis.</li><li>Write SQL queries to validate the backend.</li><li>At times perform automated regression and performance testing.</li><li>Participate in QA and Development peer reviews of SQL structure and Automation scripting.</li><li>Document software defects using Trello bug tracking system.</li><li>Use Test Case Management tools such as VS Test Professional</li><li>Monitor bug resolution efforts and track successes.</li><li>Participate in troubleshooting and triaging of issues with different teams to drive towards root cause identification and resolution.</li><li>Display a basic understanding of testing methodology and product knowledge in the design of tests.</li><li>Plans and conducts the analysis, inspection, design, test, and/or integration to assure the quality of large and complex projects.</li></ul><p><strong>What we’re looking for</strong></p><ul><li>2-4 years’ experience required in software testing in .NET Full Stack development</li><li>Knowledgeable in testing methodology, design, execution and attaining product knowledge.</li><li>Experience with QA techniques including black box, white box, and gray box approaches for smoke, regression, functional, user acceptance and exploratory testing.</li><li>Experience with the development of use cases, test scenarios and/or test plans.</li><li>Investigating and debugging complex issues.</li><li>Experience with Agile testing.</li><li>Intermediate experience with relational database theories (MS SQL Server preferred).</li><li>Experience using Trello, JIRA or other bug tracking tools.</li><li>Experience using Test Case Management tools such as VS Test Professional</li><li>1-2 years required software development/automation experience</li><li>Hands-on working experience with GUI / Web Automation Testing Tool (Selenium).</li><li>Experience creating XPath queries and functions.</li><li>Hands-on experience with any of the following scripting languages: (C# and T-SQL).</li><li>Experience integrating test suites into a TFS.</li><li>Experience using Git .</li><li>Experienced in data mining and validation using SQL.</li></ul><p><strong>Required Experience</strong></p><ul><li>Must be organized, detail-oriented, deadline-driven, and able to handle multiple responsibilities in a fast-paced environment.</li><li>Ability to work under pressure and meet tight deadlines.</li><li>Demonstrate a high level of motivation, confidence, integrity, and responsibility</li></ul><p><strong>Please include with answers to the following with your cover letter (please do this, we will ask if you don't)</strong></p><ol><li>What is a problem that you solved that you are most proud of?</li><li>What is an example of a feature that you recently shipped and what was the process for developing and getting it shipped?</li><li>What's your favorite tool that allows you to be more efficient?</li></ol>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/198961?reset=False&amp;ra=14IYeTVUuFOg&amp;oqs=a%3D14IYeTVUuFOg' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About GrowFlow</h3>            <div><p>We are a fully remote team based in Washington, Oregon, Montana, California, Florida and Canada.</p><p>What we offer</p><ul><li>A low ego environment where you can give and receive direct feedback.</li><li>Transparent leadership that openly shares the thinking behind company direction and strategy.</li><li>A flat organization where you are encouraged to contribute to company direction and strategy.</li><li>Stock in a company that has the potential to transform the way cannabis is bought and sold.<br><br><strong>Please note that GrowFlow uses an extensive interview process</strong></li></ul><ol><ol><li>Initial interview takes 30 minutes.</li><li>If Initial is satisfactory, this is followed by a Work History interview that takes 45 minutes.</li><li>If exemplary, you will interview with the CTO for one hour.</li><li>If you make the top 5, you will be asked to perform a 3-4 hour coding and scripting test.</li><li>If you make the short list, you will interview with the Development team for one hour.</li><li>If you are a finalist, we will do a back-ground check and call your employment references.</li><li>If satisfactory, you will have a 30-minute interview with the CEO as a final check and to determine your final salary and/or stock options.</li></ol></ol>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Stock Options</span>                            </li>                            <li>                                <span></span>                                <span>Paid Vacation</span>                            </li>                            <li>                                <span></span>                                <span>Remote workplace</span>                            </li>                            <li>                                <span></span>                                <span>Collaborative Environment</span>                            </li>                    </ul>                "
  },
  {
    "id": "zwTYxRnfTkKZcB_v8hFQWg",
    "url": "https://stackoverflow.com/jobs/196936/mobile-qa-engineer-lonely-planet?a=142RH4bSI1MY",
    "title": "Mobile QA Engineer at Lonely Planet (Nashville, TN) ",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 16W timezon",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 9W 4N( OR(offic,onsit), time)",
      "DBG_TECH1:k/t/w:android/java/4",
      "DBG_TECH1:k/t/w:android/mobile/8",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:firebase/mobile/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:ios/apple/6",
      "DBG_TECH1:k/t/w:ios/mobile/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=22, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=6, java=4, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/mobile",
      "TITLE1/qa",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Lonely Planet",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 75000,
      "maxValue": 100000,
      "info": "",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Mobile QA Engineer</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Mobile Developer, QA/Test Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Online Travel, Travel &amp; Tourism, Travel Planning</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>201-500 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Lonely Planet | Nashville, TN<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                            <div>                                    <span>Preferred Timezone:</span>                                    <span>(GMT-06:00) Central Time </span>                                </div>                                                            <div>                                    <span>Office Location:</span>                                    <span>Nashville, TN.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>qa</div><div>android</div><div>mobile</div><div>ios</div>                <h3>Job description</h3>                <div><p><em>The mobile team at Lonely Planet is the caretaker of<a href='http://lonelyplanet.com/guides' rel='nofollow'>&nbsp;Guides</a>, the ultimate companion for travelers on the ground in a new destination, and&nbsp;<a href='http://lonelyplanet.com/trips' rel='nofollow'>Trips</a>, a community of travelers sharing their adventures with each other and the world.</em></p><p>As a team, we rise to the challenge of bringing over 40 years of authored travel content to life on mobile devices in a way that is engaging for our community and relevant for individual travelers around the globe.</p><p>We’re committed to delivering apps of exemplary quality that are fast &amp; reliable across a broad range of devices. We are seeking a&nbsp;<strong>Mobile QA Engineer</strong>&nbsp;to join our team and lead the QA process for our products on both Android &amp; iOS. Although the team has some QA processes in place, we have never had a dedicated QA resource, so this is an opportunity for a qualified candidate to substantially define and own the QA process for apps used by millions of customers each year.</p><p>We’re seeking candidates based in Nashville, TN for this role but will consider extraordinary candidates based in other US cities.</p><p><strong>All candidates must be:</strong></p><ul><li>An expert in the field of native mobile QA, with a portfolio of popular, active applications that you’ve helped to maintain</li><li>Professionally fluent in English</li><li>Proficient at clear, concise written communication</li><li>Experienced with working on a remote team</li><li>Highly self-motivated</li><li>Obsessively detail-oriented&nbsp;</li></ul><p><strong>Daily responsibilities will vary, but will include:</strong></p><ul><li>Working with the team to develop standards for measuring product quality and readiness to release</li><li>Owning the QA workflow from story conception to software deployment</li><li>Creating, maintaining, and executing automated and manual test cases that implement our standards</li><li>Detecting, isolating, reproducing, documenting, and prioritizing defects</li><li>Reporting those defects to the team &amp; verifying fixes</li><li>Scheduling &amp; executing routine regression testing prior to releases</li><li>Testing new features and enhancements across various devices and scenarios</li></ul><p><strong>Bonus if familiar with:</strong></p><ul><li>Popular native mobile automation and testing technologies, including Espresso and UI Automator for Android, and XCUITest and UIAutomation for iOS</li><li>CI tools such as Jenkins, Travis CI, etc</li><li>Firebase Test Lab</li></ul><p><strong><strong>What’s in it for you?</strong></strong></p><p>This is an exceptional opportunity to work for a growing team in a globally loved brand in a truly global company, with offices in the UK, US, Australia, Ireland, China &amp; India. You will also receive 3 weeks of vacation, a competitive salary based on your experience and region, 401K and great medical coverage.</p><p><strong><strong>I’m In!</strong></strong></p><p>Please ensure you submit a cover letter detailing your salary expectations along with your CV telling us why you’d like to join our team.</p><p><em>Lonely Planet participates in the federal government's E-Verify program. With E-Verify, we are able to confirm the employment authorization of all newly hired employees through an electronic database maintained by the Social Security Administration and Department of Homeland Security. The E-Verify process is completed in conjunction with the Form I-9, Employment Eligibility Verification, upon commencement of employment. E-Verify is not used as a tool to pre-screen candidates. For up-to-date information on E-Verify, please go to&nbsp;<a href='http://www.uscis.gov/' rel='nofollow'>www.uscis.gov</a>&nbsp;and click on the 'E-Verify' logo.</em></p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/196936?reset=False&amp;ra=142RH4bSI1MY&amp;oqs=a%3D142RH4bSI1MY' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About Lonely Planet</h3>            <div><p>The legendary travel/adventure company is going digital—again. This time, we're overhauling our desktop and mobile offerings and preparing to launch Lonely Planet into the 21st—nay, the 27th century. The ultimate goal is to create a kind of hitchhiker's guide to the galaxy for travelers: a way of accessing rich, powerful, and contextual information about people, places, and things, whether you're on your computer in SOMA or on your smartphone in Kandahar.</p><p>Based on that description, you may be tempted to say that we're building an encyclopedia. Not so fast. Instead of a general reference tool, we're building a targeted searchlight for road warriors, a cicerone for globetrotters, a traveling companion that quickly and intelligently reports on everything from popular phrases to wall outlets to lethal animals. Because you have better things to do than getting eaten by a Komodo dragon on your honeymoon. What you see right now—our current website and apps—are the preface to a much grander vision that we hope to implement in the very near future. To that end, we're hiring the best and brightest from all over the globe with the intention of forming a world-class technology team. In other words: don't think of us as a company that only prints books. We're a technology company, and we're pretty stoked about it.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Work remotely!</span>                            </li>                            <li>                                <span></span>                                <span>Flexi-time</span>                            </li>                            <li>                                <span></span>                                <span>15 - 25 days</span>                            </li>                            <li>                                <span></span>                                <span>Choose your own machine</span>                            </li>                            <li>                                <span></span>                                <span>Conferences and training</span>                            </li>                            <li>                                <span></span>                                <span>Casual work environment</span>                            </li>                            <li>                                <span></span>                                <span>Work alongside a talented, driven team</span>                            </li>                    </ul>                "
  },
  {
    "id": "CCCJ-AfDQxC5aPRint7GGA",
    "url": "https://stackoverflow.com/jobs/169664/qa-test-developer-integral-analytics?a=UTNLzxKAZG0",
    "title": "QA/Test Developer at Integral Analytics (Cincinnati, OH) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:angularjs/frontend/16",
      "DBG_TECH1:k/t/w:c#/c/4",
      "DBG_TECH1:k/t/w:c#/dotnet/10",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:dotnet/dotnet/16",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=26, c=4, mobile=1, go=0, nodejs=1, bigdata-ml=8, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=17}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Integral Analytics",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 85000,
      "maxValue": 120000,
      "info": "",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>QA/Test Developer</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>QA/Test Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Data &amp; Analytics, Energy &amp; Utilities</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>11-50 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Public</span>                                    </div>                            </div>                    </div>                <div>Company: Integral Analytics | Cincinnati, OH<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Cincinnati, OH.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>.net</div><div>c#</div><div>json</div><div>soap</div><div>angularjs</div>                <h3>Job description</h3>                <div><p><strong>POSITION DESCRIPTION: QA/TEST DEVELOPER</strong></p><p>Integral Analytics (IA), an industry leader in electric grid load forecasting, distributed energy resource planning and valuation and related analytics is currently seeking a Quality Assurance/Software Test Developer to contribute to our software development, provisioning and support teams.</p><p>You’ll design and engineer custom automated test frameworks from the ground up.&nbsp; You are a great coder who has an in-depth understanding of best practices surrounding automation testing, as well as an innate knack to know which tool or methodology is best suited under a given circumstance. Additionally, you should be able to interpret software requirement specifications, in order to create test plans with leading project test cycles (including smoke, regression, functional and performance testing).</p><p>This individual will work directly with our product developers, product and customer success managers and will play a lead role in the release and integration processes and ongoing client support.&nbsp; This person will report directly to the Manager of DevOps. The position will contribute to the vision, mission and values of IA through superior customer service and enhancement to IA’s product suite.</p><p><strong>Skills &amp; Requirements</strong></p><p><strong>Responsibilities:</strong></p><ul><li>Implement testing frameworks to perform functional, regression, e2e and performance tests</li><li>Author and review testing plans, test strategies and test cases on all assigned projects</li><li>Implement automated tests that verify functionality, performance, reliability, scalability and security of applications and components</li><li>Record and track defects, uncovered during execution of automated tests</li><li>Work as part of a team to deliver solutions in an Agile fashion</li><li>Ability to break down complex product requirements, providing development estimates as needed.</li><li>Document testing procedures and contribute to overall product documentation requirements.</li></ul><p><strong>Required Qualifications:</strong></p><ul><li>Bachelor’s degree in Computer Science, or equivalent</li><li>3+ years of experience with automation testing of web-based applications using a structured testing methodology</li><li>3+ years of experience with automated functional testing tools, such as Selenium</li><li>Ability to write automation tests in Java and C#</li><li>Experience integrating automated testing process with Continuous Integration tools, such as Jenkins or Microsoft Team Services</li><li>Comfortable working in a Microsoft .NET environment</li><li>Team player with excellent interpersonal skills and the ability to work in a fast-paced environment</li><li>Strong analytical capability, independent thinking and good decision-making skills</li><li>Demonstrated excellent oral and written communication skills with the ability to listen, articulate, facilitate and advocate</li></ul><p><strong>Preferred Qualifications:</strong></p><ul><li>Experience testing RESTful JSON and SOAP APIs</li><li>Experience writing automated tests for MVC web applications and single page web applications that leverage modern Javascript frameworks, such as AngularJS</li></ul><p><strong>Benefits</strong></p><ul><li>Health, Vision, Dental</li><li>401K with company match</li><li>Paid Time Off (PTO)</li><li>Company paid holidays</li><li>Optimistic, supportive, and FUN work environment</li></ul><p>The duties and responsibilities described above are essential functions of the position. Integral Analytics and its parent, Willdan Group, Inc. are EEO/AA/M/F/Vet/Disability Employers</p><p>Join us at Integral Analytics as our software plans and manages the energy networks of the future!</p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/169664?reset=False&amp;ra=UTNLzxKAZG0&amp;oqs=a%3DUTNLzxKAZG0' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About Integral Analytics</h3>            <div><p>Integral Analytics is a Greentech Media Grid Edge Awardee and Fierce SmartGridNews winner of best innovation in big data and analytics. Since 2005, dozens of domestic and international electric utilities have relied on IA data science software applications to plan, value, monitor, operate and capitalize the future of the energy industry, integrate distributed energy resources (DER) and manage grid modernization. IA’s software products, LoadSEER, IDROP and DSMore merge economics and engineering to provide the industry’s most comprehensive and statistically-robust forecasting and scenario platform upon which utilities, DER owners and other stakeholders may make optimal financial, program and engineering decisions. Integral Analytics delivers the “value blueprint of the grid edge”, reducing stakeholder risks and customer costs to manage the evolving planning and operations needs of electric distribution systems.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Competitive compensation</span>                            </li>                            <li>                                <span></span>                                <span>Informal, creative environment</span>                            </li>                            <li>                                <span></span>                                <span>Thinkers AND Doers</span>                            </li>                            <li>                                <span></span>                                <span>Solving the unsolvable</span>                            </li>                            <li>                                <span></span>                                <span>Growth is guaranteed</span>                            </li>                    </ul>                "
  },
  {
    "id": "syKKVuViR8m3xQE3O0Loyw",
    "url": "https://stackoverflow.com/jobs/194496/test-automation-qa-engineer-codership?a=13e89bEsPxW8",
    "title": "Test automation QA engineer at Codership  ",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:distributed-computing/bigdata-ml/8",
      "DBG_TECH1:k/t/w:gdb/c/13",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=13, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ],
    "hiringOrganization": {
      "name": "Codership",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "€",
      "minValue": 45000,
      "maxValue": 65000,
      "info": "",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Test automation QA engineer</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Junior, Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>QA/Test Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Clustering, Distributed Systems, Replication</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>1-10 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Codership | No office location<br></div><h3>Technologies</h3><div></div><div>automated-tests</div><div>sql</div><div>database</div><div>concurrency</div><div>replication</div>                <h3>Job description</h3>                <div><p>As a test automation QA engineer you will be responsible for working with the development team at Codership and create and execute deterministic tests, make builds of Galera Cluster and develop and extend test automation frameworks.<br><br>You will be also working closely with MariaDB development and quality assurance teams to prioritize software bug fixes.<br><br>A successful candidate has a profound understanding of concurrency control, race conditions, deadlocks, retrieving and analyzing backtraces with gdb.<br><br>To apply for this job send an email to <a href='mailto:jobs@galeracluster.com' rel='nofollow'>jobs@galeracluster.com</a> and instead of a cover letter solve the simple task described in&nbsp;<a href='https://gist.github.com/vasild/022460bcfdf4739d8f196a0aa5f36e09' rel='nofollow'>https://gist.github.com/vasild/022460bcfdf4739d8f196a0aa5f36e09</a> and attach its solution. Candidates that apply without the solution will get no reply. Do not apply via stackoverflow.</p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/194496?reset=False&amp;ra=13e89bEsPxW8&amp;oqs=a%3D13e89bEsPxW8' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About Codership</h3>            <div><p>Codership develops replication and clustering solutions for open source databases, adopting novel ideas from latest DBMS and distributed computing research to build fundamentally new high availability solution. Our flagship product, Codership's Galera Cluster for MySQL, provides high system uptime with no data loss and scalability for the future growth. Galera is open-source product and can be used to replicate any transactional database.</p><p>By&nbsp; 2016 Galera Cluster and it's variants'&nbsp;MariaDB Galera Cluster and Percona XtraDB Cluster has been downloaded over <strong>1 million</strong>&nbsp; times. There are thousands of Galera users. Our product is included in many <strong>Linux distros</strong>. Galera Cluster is <strong>most used clustering solution for OpenStack</strong> high availability according to OpenStack survey. We are Red Herring 2014 Top 100 Europe and Top 100 Global Winner.</p><p>We won <strong>Application of the Year 2014</strong> Award in April 2014 from the MySQL Community. The MySQL Community Awards panel committee said: “Galera provides MySQL with synchronous replication, offering a long-time sought-for High Availability solution for MySQL™. It is fast becoming one of the main technologies everyone is building next-gen businesses around. It is an important part of the renaissance of what’s next for the “MySQL ecosystem”.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Remote Work</span>                            </li>                            <li>                                <span></span>                                <span>Expected Working Hours 40/week</span>                            </li>                            <li>                                <span></span>                                <span>Flexible Working Hours</span>                            </li>                            <li>                                <span></span>                                <span>Vacation/Days Off</span>                            </li>                            <li>                                <span></span>                                <span>Professional Equipment Sponsorship</span>                            </li>                            <li>                                <span></span>                                <span>Your Work Matters</span>                            </li>                    </ul>                "
  },
  {
    "id": "9J5pIizASUWC-sHlwitQmQ",
    "url": "https://stackoverflow.com/jobs/164284/qa-automation-engineer-sdet-modus-create?a=T5W5U3LYGBO",
    "title": "QA Automation Engineer - SDET at Modus Create  ",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "DBG_TECH1:k/t/w:bash/other/1",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=1, dotnet=0, c=0, mobile=0, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "Modus Create",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>QA Automation Engineer - SDET</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Contract</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>QA/Test Developer</span>                                    </div>                            </div>                    </div>                <div>Company: Modus Create | No office location<br></div><h3>Technologies</h3><div></div><div>javascript</div><div>selenium-webdriver</div><div>jasmine</div><div>testing</div><div>automated-tests</div>                <h3>Job description</h3>                <div><p>Are you ready to build great mobile and web-based applications and lead global teams with some of the brightest thought leaders, designers and technologists? &nbsp;</p><p>As our&nbsp;QA Automation Engineer, you are capable of working on a variety of development projects regardless of type and level of complexity. Whether you are on a project with no test framework or one with thousands of test cases already in place, you can provide complete and effective test strategies for the team.</p><p>This role may be performed from a remote location and is estimated to require an effort of 40 hours per week. Priority will be given to candidates within the Western Hemisphere.</p><p><strong>Your Duties</strong></p><ul><li>Implement automation test solutions for a web app used in the education space</li><li>Collaborate daily on a distributed, cross functional agile team located in the Western Hemisphere</li><li>Develop test strategies and POCs for our client</li><li>Train clients on new tools and systems</li><li>Collaborate daily with UX, Engineering, and DevOps to test and deliver an intuitive, highly visible web app</li><li>Consult to our end client regarding development best practices</li><li>Work at least 4 hours time-zone aligned from 8 AM - 12 Noon or 9 PM - 1 PM&nbsp;with GMT -4</li></ul><p><strong>Required Experience</strong></p><ul><li>Have at least 2-5&nbsp;years of experience working in Automation QA</li><li>Designing test plans and processes for new products</li><li>Testing mobile, mobile web and desktop web-based applications</li><li>Strong experience using&nbsp;JavaScript</li><li>Automated functional testing with Selenium Webdriver&nbsp;similar systems</li><li>TDD or BDD practices and their associated frameworks like Jasmine, Mocha, Cucumber.&nbsp;</li><li>Working with Jenkins, Bamboo, CircleCI or comparable continuous integration systems</li><li>Working with JIRA or similar bug tracking system</li><li>Working in Agile and/or Kanban environments</li><li>Previous experience working as a consultant</li></ul><p><strong>Highly qualified candidates will have</strong></p><ul><li>Concise written and verbal communication skills for documenting bugs and test plans</li><li>Track record of active participation and contributions to the testing community (Stack Overflow, QA/ automation framework forums, Meetup groups, blogging, Twitter)</li><li>Familiarity with database systems, both SQL and NoSQL (For example, MySQL and MongoDB)</li><li>Prior experience with setting up and installing VMs</li><li>Grasp of the command line and scripting languages (like Bash and Powershell)</li><li>Firm understanding of application development and the testing pyramid (UI, Service, Unit)</li><li>Knowledge of utilizing Docker for testing</li><li>Experience with API testing</li></ul>                </div>            <div>        <a href='https://moduscreate.applytojob.com/apply/EMDDIgdGIL/QA-Automation-Engineer?source=stackoverflow' rel='nofollow'>                        Apply now        </a></div>            <h3>About Modus Create</h3>            <div><p><strong>Let’s Talk about You</strong></p><p><strong>You value outcomes above all else:</strong>&nbsp;You have a proven track record shipping great mobile and web products. By understanding the big picture, you articulate strategy and vision with strong written and verbal communication.</p><p><strong>You Lead by Doing:&nbsp;</strong>You realize that the big picture is worthless without getting your hands dirty in the technical details for strategic and tactical problem solving. You understand the value of situational leadership and can adapt to the needs and strength of your team. &nbsp;</p><p><strong>You Love Work, Growth and Learning:</strong>&nbsp;You dream of working in a culture that values hard work, continued learning and innovation with a commitment to building amazing products for clients and their end users. You’ll stop learning when you are dead, and until then you desire to gain deeper knowledge in technology and business.</p><p><strong>Let’s Talk About Us</strong></p><p>Modus Create is a Product Studio offering consulting services and SaaS products for strategic planning, design and and execution of web-based and mobile products. We work across multiple industries with Fortune 1000, ISVs, and startups to validate, plan and launch new products. Headquartered in Reston, VA, we are a bootstrapped team that has grown from 2 to 100+ people spread around the globe in 7 years, committed to building the best product consulting firm on the planet. We offer a highly collaborative, autonomous and effective working environment. We love and believe in what we do. This is your chance to be part of building something great.</p><p><strong>Why Modus Create</strong></p><ul><li>Competitive compensation</li><li>Ability to work remotely / telecommute</li><li>Working side-by-side with thought leaders in emerging tech</li></ul><p><strong>Do you have what it takes to join the DC area's most awesome tech company? Let’s start a conversation.</strong></p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Company-provided, top notch hardware, software and services</span>                            </li>                            <li>                                <span></span>                                <span>Competitive compensation &amp; benefits</span>                            </li>                            <li>                                <span></span>                                <span>Ability to expense technical books</span>                            </li>                            <li>                                <span></span>                                <span>GitHub repos for your projects</span>                            </li>                            <li>                                <span></span>                                <span>A chance to get your personal projects sponsored</span>                            </li>                            <li>                                <span></span>                                <span>Travel if you like, stay at home if your don't</span>                            </li>                            <li>                                <span></span>                                <span>Assisted continuous self-development</span>                            </li>                            <li>                                <span></span>                                <span>Talk at meetups</span>                            </li>                    </ul>                "
  },
  {
    "id": "ioUpIABORU-sPpSeCTPeaw",
    "url": "https://remoteok.io/jobs/68580",
    "title": "Automation Q.A. Engineer",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``OR(&quot;not&quot;,no) 3W locat W requir",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 2W hour",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/java",
      "TITLE1/qa",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "java"
    ],
    "hiringOrganization": {
      "name": "Wallethub",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2018 6:02:35 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<td><span><h2>Automation Q.A. Engineer</h2></span><br><span><h3>Wallethub</h3></span> <span>verified</span></td><div><div><br>Company details<br><br>WalletHub is one of the leading personal finance destinations in the US. We're looking for a motivated and experienced&nbsp;Automation QA Engineer for a full-time, permanent, remote position.<br><br>Ideal Candidate<br><br>You are the ideal candidate for this job if you have:<br><br><br>* At least 2 years experience in Test Automation with Java and Selenium<br><br>* At least 2 years experience in Manual Testing<br><br>* Excellent attention to details<br><br>* Ability &amp; motivation to work a minimum of 55 hrs per week<br><br>* Proven ability to meet deadlines and handle multiple tasks in a fast-paced environment<br><br>* Must stay up-to-date with developing technologies and showcase them in your work<br><br>* Proficient in written/spoken English<br><br><br><br><br>Responsibilities<br><br><br>* Testing and assuring high quality performance of website<br><br>* Reporting and validating bugs for all components<br><br>* Creating test plans and test cases<br><br>* Identify opportunities for improvement and make constructive suggestions for change<br><br><br><br><br>Our Offer<br><br><br>* Very competitive salary based on skills and prior experience<br><br>* Raise and advancement opportunities based on periodic evaluations<br><br>* Visa sponsorship (if outside the US sponsorship is granted after&nbsp;24 months with the company, based on performance)<br><br><br><br><br>More about WalletHub<br><br>WalletHub is a high-growth fintech company based in Washington, D.C. that is looking for talented, hard-working individuals to help us reshape personal finance. More specifically, we are harnessing the power of data analytics and artificial intelligence to build the brain of a smart financial advisor, whose services we’re offering to everyone for free. The WalletHub brain enables users to make better financial decisions in a fraction of the time with three unique features:<br><br>1) Customized Credit-Improvement Tips: WalletHub identifies improvement opportunities and guides you through the necessary corrections.<br><br>2) Personalized Money-Saving Advice: WalletHub’s savings brain constantly scours the market for load-lightening opportunities, bringing you only the best deals.<br><br>3) Wallet Surveillance: Personal finance isn’t as scary with 24/7 credit monitoring providing backup, notifying you of important credit-report changes.<br><br>In addition to the valuable intelligence the brain provides, WalletHub is the first and only service to offer free credit scores and full credit reports that are updated on a daily basis absent of user interaction, rather than weekly or monthly and only when a user logs in. Some other services hang their hats on free credit scores and reports, yet they’re still inferior to what WalletHub considers minor pieces to a much larger puzzle.<br><br>How to Apply<br><br>To get our attention, all you need to do is send us a resume. If we believe that you will be a good match, we'll contact you to arrange the next steps. You can&nbsp;apply directly on Stackoveflow or email your application to&nbsp;jobs.dev@wallethub.com<br><br>Note:&nbsp;This position does not have a location requirement and can be performed either remotely (including from outside the U.S.). Please also be aware this position entails working at least 55 hours per week and requires an overlap with EST business hours.<p>See more jobs at <span>Wallethub</span></p></div></div>"
  },
  {
    "id": "XHQ2Z5ZWTkiGHc0b3nkxTg",
    "url": "https://remoteok.io/jobs/68527",
    "title": "Automation QA Engineer",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``OR(&quot;not&quot;,no) 3W locat W requir",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 2W hour",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/java",
      "TITLE1/qa",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "java"
    ],
    "hiringOrganization": {
      "name": "Wallethub",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 17, 2018 11:01:12 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<td><span><h2>Automation Quality Assurance Engineer</h2></span><br><span><h3>Wallethub</h3></span> <span>verified</span></td><div><div><br>Company details<br><br>WalletHub is one of the leading personal finance destinations in the US. We're looking for a motivated and experienced&nbsp;Automation QA Engineer for a full-time, permanent, remote position.<br><br>Ideal Candidate<br><br>You are the ideal candidate for this job if you have:<br><br><br>* At least 2 years experience in Test Automation with Java and Selenium;<br><br>* At least 2 years experience in Manual Testing;<br><br>* Excellent attention to details;<br><br>* Ability &amp; motivation to work a minimum of 55 hrs per week;<br><br>* Proven ability to meet deadlines and handle multiple tasks in a fast-paced environment;<br><br>* Must stay up-to-date with developing technologies and showcase them in your work;<br><br>* Proficient in written/spoken English.<br><br><br><br><br>Responsibilities<br><br><br>* Testing and assuring high quality performance of website<br><br>* Reporting and validating bugs for all components<br><br>* Creating test plans and test cases<br><br>* Identify opportunities for improvement and make constructive suggestions for change<br><br><br><br><br>Our Offer<br><br><br>* Very competitive salary based on skills and prior experience<br><br>* Raise and advancement opportunities based on periodic evaluations<br><br>* Visa sponsorship (if outside the US sponsorship is granted after&nbsp;24 months with the company, based on performance)<br><br><br><br><br>More about WalletHub<br><br>WalletHub is a high-growth fintech company based in Washington, D.C. that is looking for talented, hard-working individuals to help us reshape personal finance. More specifically, we are harnessing the power of data analytics and artificial intelligence to build the brain of a smart financial advisor, whose services we’re offering to everyone for free. The WalletHub brain enables users to make better financial decisions in a fraction of the time with three unique features:<br><br>1) Customized Credit-Improvement Tips: WalletHub identifies improvement opportunities and guides you through the necessary corrections.<br><br>2) Personalized Money-Saving Advice: WalletHub’s savings brain constantly scours the market for load-lightening opportunities, bringing you only the best deals.<br><br>3) Wallet Surveillance: Personal finance isn’t as scary with 24/7 credit monitoring providing backup, notifying you of important credit-report changes.<br><br>In addition to the valuable intelligence the brain provides, WalletHub is the first and only service to offer free credit scores and full credit reports that are updated on a daily basis absent of user interaction, rather than weekly or monthly and only when a user logs in. Some other services hang their hats on free credit scores and reports, yet they’re still inferior to what WalletHub considers minor pieces to a much larger puzzle.<br><br>How to Apply<br><br>To get our attention, all you need to do is send us a resume. If we believe that you will be a good match, we'll contact you to arrange the next steps. You can&nbsp;apply on Stackoveflow or email your application to&nbsp;jobs.dev@wallethub.com<br><br>Note:&nbsp;This position does not have a location requirement and can be performed either remotely (including from outside the U.S.). Please also be aware this position entails working at least 55 hour per week and requires an overlap with EST business hours.<p>See more jobs at <span>Wallethub</span></p></div></div>"
  },
  {
    "id": "zFeF73TgReSHG7pFg8p9mQ",
    "url": "https://angel.co/consensys/jobs/345709-lead-quality-assurance-balanc3",
    "title": "Lead Quality Assurance (Balanc3)",
    "tags": [
      "Brooklyn",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "QA Engineer",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "ConsenSys",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=585912&listings[0][]=58885"
    },
    "salary": {
      "currency": "$",
      "minValue": 100000,
      "maxValue": 150000,
      "info": "No Equity",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 14, 2018 6:49:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Lead Quality Assurance (Balanc3) at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$100K–$150K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>We're seeking a Quality Assurance Engineer who is proficient at self-managing his/her projects, with a focus on delivering a high-quality product. The candidate will be detailed, organized and a team player. The candidate will collaborate closely with their project team to ensure successful delivery. The candidate will also be comfortable with communicating any project risks and options to mitigate any project issues that may arise.</p><p>Responsibilities:</p><p>Create and maintain automated testing architecture across our tech stack<br>Oversee and manage multiple projects at a time<br>Estimate, prioritize and plan testing activities<br>Review requirements and provide knowledgeable feedback to ensure they are thorough and detailed<br>Keep thorough documentation of all aspects of a project, including but not limited to:<br>Deployment communication<br>Detailed bug tickets<br>Comprehensive manual and automated test cases<br>Actively participate in project development meetings such as backlog grooming and sprint planning<br>Establish best practices for QA across enterprise projects<br>Build a team to successfully ensure all major software releases meet a high quality standard</p><p>Desired Skills:</p><p>At least 4 years of experience in a QA role<br>Experience working with automation framework tools — possibly Selenium, Protractor, Nightmare etc..<br>Experience with Integration, Regression, Unit &amp; API testing methodologies<br>Good understanding of the Software Development Life Cycle<br>Excellent communication skills<br>Outstanding prioritization and time management skills<br>Fintech experience is a strong plus<br>Blockchain / Ethereum experience a strong plus</p></div>"
  },
  {
    "id": "my67LgLzQk-bzdzsm5R18w",
    "url": "https://remoteok.io/jobs/68485",
    "title": "Software Automation QA Engineer",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``OR(&quot;not&quot;,no) 3W locat W requir",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 2W hour",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/java",
      "TITLE1/qa",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "java"
    ],
    "hiringOrganization": {
      "name": "Wallethub",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 14, 2018 2:51:45 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<td><span><h2>Software Automation Quality Assurance Engineer</h2></span><br><span><h3>Wallethub</h3></span> <span>verified</span></td><div><div><br>Company details<br><br>WalletHub is one of the leading personal finance destinations in the US. We're looking for a motivated and experienced&nbsp;Automation QA Engineer for a full-time, permanent, remote position.<br><br>Ideal Candidate<br><br>You are the ideal candidate for this job if you have:<br><br><br>* At least 2 years experience in Test Automation with Java and Selenium;<br><br>* At least 2 years experience in Manual Testing;<br><br>* Excellent attention to details;<br><br>* Ability &amp; motivation to work a minimum of 55 hrs per week;<br><br>* Proven ability to meet deadlines and handle multiple tasks in a fast-paced environment;<br><br>* Must stay up-to-date with developing technologies and showcase them in your work;<br><br>* Proficient in written/spoken English.<br><br><br><br><br>Responsibilities<br><br><br>* Testing and assuring high quality performance of website<br><br>* Reporting and validating bugs for all components<br><br>* Creating test plans and test cases<br><br>* Identify opportunities for improvement and make constructive suggestions for change<br><br><br><br><br>Our Offer<br><br><br>* Very competitive salary based on skills and prior experience<br><br>* Raise and advancement opportunities based on periodic evaluations<br><br>* Visa sponsorship (if outside the US sponsorship is granted after&nbsp;24 months with the company, based on performance)<br><br><br><br><br>More about WalletHub<br><br>WalletHub is a high-growth fintech company based in Washington, D.C. that is looking for talented, hard-working individuals to help us reshape personal finance. More specifically, we are harnessing the power of data analytics and artificial intelligence to build the brain of a smart financial advisor, whose services we’re offering to everyone for free. The WalletHub brain enables users to make better financial decisions in a fraction of the time with three unique features:<br><br>1) Customized Credit-Improvement Tips: WalletHub identifies improvement opportunities and guides you through the necessary corrections.<br><br>2) Personalized Money-Saving Advice: WalletHub’s savings brain constantly scours the market for load-lightening opportunities, bringing you only the best deals.<br><br>3) Wallet Surveillance: Personal finance isn’t as scary with 24/7 credit monitoring providing backup, notifying you of important credit-report changes.<br><br>In addition to the valuable intelligence the brain provides, WalletHub is the first and only service to offer free credit scores and full credit reports that are updated on a daily basis absent of user interaction, rather than weekly or monthly and only when a user logs in. Some other services hang their hats on free credit scores and reports, yet they’re still inferior to what WalletHub considers minor pieces to a much larger puzzle.<br><br>How to Apply<br><br>To get our attention, all you need to do is send us a resume. If we believe that you will be a good match, we'll contact you to arrange the next steps. You can&nbsp;apply on Stackoveflow or email your application to&nbsp;jobs.dev@wallethub.com<br><br>Note:&nbsp;This position does not have a location requirement and can be performed either remotely (including from outside the U.S.). Please also be aware this position entails working at least 55 hour per week and requires an overlap with EST business hours.<p>See more jobs at <span>Wallethub</span></p></div></div>"
  },
  {
    "id": "mhNd3r56TtWd1dN1NEL9pQ",
    "url": "https://landing.jobs/at/gokid/qa-engineer-in-porto-2018-8?utm_campaign=landing+rss&utm_content=QA+Engineer&utm_medium=referral&utm_source=rss",
    "title": "QA Engineer",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=4, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=2, java=1, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/mobile",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 13, 2018 7:29:23 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>QA Engineer</h2></div><div>Company: GoKid</div><div>Location: Porto, PT</div><div>Remote location: Partially remote</div>Salary: 20.000 - 25.000 €<br>Level: Intermediate<br>Language: English <div>QA / Testing<br>Skills:</div><li>JavaScript </li><li>QA Engineering </li><li>Quality Assurance </li><li>Test Automation </li><li>Test Planning </li><h2>Intro</h2><p>GoKid is the complete carpool solution for schools, teams, and active families allowing families to carpool with others they know and trust.</p><p>We have developed an app that makes carpool setup easy and convenient—allowing parents to share driving responsibilities with other families they know and trust. There are no paid drivers. Parents help each other save time by using the excess capacity in their cars. As a smart city solution we are drastically reducing emissions by taking cars off the road. We are working with global corporations, smart cities, OEMs and schools.</p><p>We are looking to expand our passionate development team and want to add a skilled QA Engineer who would be responsible for helping to produce test scenarios, creating and executing manual and automated test cases, capturing and reporting defects in Jira, and helping to organize bug fixing content of team sprints. This is a full-time permanent role.</p><p>As a member of our team, you will be expected to work with the team but show individual initiative and ownership of your own tasks as well as a high quality of work. You will report directly to the lead developer as well as checking in with the company’s executive team--we are a small team and communication flows freely to all levels of the company.</p><p>We are looking for critical thinkers who want to grow with the company and who will productively contribute to discussions around future features and integrations for our mobile-first technology as well as give recommendations for best practices based on previous experience.</p><p>We follow Agile methodology and Scrum procedures, operating on 2-week sprints, but as a small team we need each member to be flexible and roll with changes if they come up mid-sprint #startuplife.</p><p>Our team participates in daily standup calls on Slack as well as bi-weekly sprint planning and demo calls. While we are headquartered in New York City, we are looking to build out a team in Europe. Currently the tech team works as a remote team, regular and good communication is a must :)</p><h3>Main requirements</h3><ul><li>+3 years of relevant experience in QA testing</li><li>Working knowledge of Javascript</li><li>Working knowledge of browser debugging tools</li><li>In-depth understanding of Web stacks</li><li>Experience in automation testing</li><li>Previous experience developing software test cases</li><li>Must be someone who understands the importance of clear documentation</li><li>Constantly keeping up with the latest technology trends, and willing to embrace change</li><li>Must be available for daily standup calls, a bi-weekly demo call and a bi-weekly sprint planning calls on Slack as well as regular daily chat communication on Slack.</li><li>Ideally will be located in Porto, Portugal. We are open to remote team members near the GMT time zone (current team spans eastern Americas to western Europe).</li><li>Fluent English speaker and a good communicator.</li></ul><h3>Nice to have</h3><ul><li>If you have various Android and iOS testing devices you can bring to the job, that is a big plus</li><li>Technical degree and previous work in a startup company is a big plus</li><li>We are looking to fill this role in Porto, Portugal, but are open to remote team members as well.</li></ul>"
  },
  {
    "id": "scNSMGC1TZimhHHOGbAtKg",
    "url": "https://remoteok.io/jobs/68419",
    "title": "Automation QA Engineer",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``OR(&quot;not&quot;,no) 3W locat W requir",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 2W hour",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/java",
      "TITLE1/qa",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "java"
    ],
    "hiringOrganization": {
      "name": "Wallethub",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 9, 2018 2:05:57 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<td><span><h2>Automation Quality Assurance Engineer</h2></span><br><span><h3>Wallethub</h3></span> <span>verified</span></td><div><div><br>Company details<br><br>WalletHub is one of the leading personal finance destinations in the US. We're looking for a motivated and experienced&nbsp;Automation QA Engineer for a full-time, permanent, remote position.<br><br>Ideal Candidate<br><br>You are the ideal candidate for this job if you have:<br><br><br>* At least 2 years experience in Test Automation with Java and Selenium;<br><br>* At least 2 years experience in Manual Testing;<br><br>* Excellent attention to details;<br><br>* Ability &amp; motivation to work a minimum of 55 hrs per week;<br><br>* Proven ability to meet deadlines and handle multiple tasks in a fast-paced environment;<br><br>* Must stay up-to-date with developing technologies and showcase them in your work;<br><br>* Proficient in written/spoken English.<br><br><br><br><br>Responsibilities<br><br><br>* Testing and assuring high quality performance of website<br><br>* Reporting and validating bugs for all components<br><br>* Creating test plans and test cases<br><br>* Identify opportunities for improvement and make constructive suggestions for change<br><br><br><br><br>Our Offer<br><br><br>* Very competitive salary based on skills and prior experience<br><br>* Raise and advancement opportunities based on periodic evaluations<br><br>* Visa sponsorship (if outside the US sponsorship is granted after&nbsp;24 months with the company, based on performance)<br><br><br><br><br>More about WalletHub<br><br>WalletHub is a high-growth fintech company based in Washington, D.C. that is looking for talented, hard-working individuals to help us reshape personal finance. More specifically, we are harnessing the power of data analytics and artificial intelligence to build the brain of a smart financial advisor, whose services we’re offering to everyone for free. The WalletHub brain enables users to make better financial decisions in a fraction of the time with three unique features:<br><br>1) Customized Credit-Improvement Tips: WalletHub identifies improvement opportunities and guides you through the necessary corrections.<br><br>2) Personalized Money-Saving Advice: WalletHub’s savings brain constantly scours the market for load-lightening opportunities, bringing you only the best deals.<br><br>3) Wallet Surveillance: Personal finance isn’t as scary with 24/7 credit monitoring providing backup, notifying you of important credit-report changes.<br><br>In addition to the valuable intelligence the brain provides, WalletHub is the first and only service to offer free credit scores and full credit reports that are updated on a daily basis absent of user interaction, rather than weekly or monthly and only when a user logs in. Some other services hang their hats on free credit scores and reports, yet they’re still inferior to what WalletHub considers minor pieces to a much larger puzzle.<br><br>How to Apply<br><br>To get our attention, all you need to do is send us a resume. If we believe that you will be a good match, we'll contact you to arrange the next steps. You can&nbsp;apply on Stackoveflow or email your application to&nbsp;jobs.dev@wallethub.com<br><br>Note:&nbsp;This position does not have a location requirement and can be performed either remotely (including from outside the U.S.). Please also be aware this position entails working at least 55 hour per week and requires an overlap with EST business hours.<p>See more jobs at <span>Wallethub</span></p></div></div>"
  },
  {
    "id": "D0cBjVxmRUO6yNadWqkUsg",
    "url": "https://feeds.feedblitz.com/~/563917474/0/problogger/jobs~Backpacking-Freelance-Writer-amp-Gear-Tester/",
    "title": "Backpacking Freelance Writer & Gear Tester",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "99Boulders",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 9, 2018 2:00:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Backpacking Freelance Writer &amp; Gear Tester</h2><div>Company: 99Boulders</div>Location: USA<br>Job Type: Contract<div>  <h4>Description</h4>  <div>                    <p>Hey there, Alex from 99Boulders here. I’m looking for a backpacking freelance writer and gear tester to, well, test backpacking gear and then write articles about it.</p><p>If you’re someone who goes on lots of backpacking trips then this gig is perfect for you. You’ll get free gear (you get to keep your favorite piece from each assignment) and you can profit from the backpacking trips you’re already taking because I'll pay you a flat fee to test the gear.</p><p>Here are all the juicy details:</p><p>&nbsp;</p><p><strong>RESPONSIBILITIES</strong></p><ul><li><strong>Test backpacking gear</strong>&nbsp;by taking it with you on your backpacking trips and also when necessary by designing and conducting side-by-side tests at home to compare various features</li><li><strong>Take photos of the gear and your testing processes</strong>&nbsp;to include in your articles. Smartphone photos are fine.</li><li><strong>Write articles and reviews of the gear based on your testing.</strong>&nbsp;The most common type of article you’ll write will be ‘best of’ articles ranking and reviewing the top options you’ve tested (<a href='https://www.99boulders.com/best-battery-packs-for-camping-and-backpacking' rel='nofollow'>Example</a>). I will occasionally also assign you articles on other topics related to backpacking and backpacking gear.</li><li><strong>Ship gear back to me when you’re done with it (occasionally).</strong>&nbsp;Each assignment will include multiple pieces of gear. You keep your favorite and ship back the rest. This occurs infrequently because I’m fine with you batching shipments. For example, our climbing gear tester has been working for the site for almost a year and has only had to ship gear back to me two or three times.</li><li><strong>Pick up gear from the nearest Amazon Locker (occasionally).</strong>&nbsp;Shipping you gear presents a minor problem: the package might be stolen from your doorstep. This has happened to us once before. If I am worried that an expensive piece of gear could be stolen I might choose to ship it to the Amazon Locker nearest to you for you to pick up.</li><li><strong>Conduct research and interview experts (occasionally).</strong>&nbsp;In order to be able to write some articles you might have to conduct internet research and/or interview experts via phone or email.</li></ul><p>&nbsp;</p><p><strong>BENEFITS</strong></p><ul><li><strong>Free gear</strong>&nbsp;– you get to keep your favorite piece of gear from each assignment</li><li><strong>Quality articles for your portfolio</strong>&nbsp;– one of our former writers included her 99Boulders articles in her portfolio and successfully pitched Backpacker magazine. Another writer had one of his 99Boulders articles republished on rockandice.com, a top climbing site.</li><li><strong>Ongoing and consistent assignments in a contract position</strong>&nbsp;– as long as you keep doing good work I'll keep having assignments for you. Seasonality and your own ability to get out in the field to test gear will affect frequency of assignments, but I’ll work with you to make the most of months where you don’t have any trips planned. I’m also highly flexible and am happy to schedule assignments so that they best fit your schedule.</li><li><strong>Competitive pay and compensation for testing</strong>&nbsp;– I offer a competitive per-word rate for articles and pay a flat fee for the testing portion of each assignment. You also get to invoice me for shipping costs so there's no cost to you to ship me back the gear.</li><li><b>Ability to work remotely on your own time</b></li><li><strong>Ability to pitch me your own article ideas</strong></li><li><strong>Consideration for related assignments and positions</strong>&nbsp;– if you do a good job testing backpacking gear you’ll be among the first considered for any future positions that may open up and any future assignments involving other types of outdoor gear, such as outdoor clothing and footwear</li></ul><p>&nbsp;</p><p><strong>REQUIREMENTS</strong></p><ul><li><strong>Living in US</strong></li><li><strong>Fluent in English</strong></li><li><strong>3+ years backpacking experience</strong></li><li><strong>Freelance writing experience</strong></li><li><strong>You must be the type of backpacker who goes on lots of backpacking trips.</strong>&nbsp;If you aren’t, you won’t have enough chances to adequately test the gear at a decent rate, and I won’t be able to assign you many assignments.</li></ul><p>Bonus points if you have any of the following:</p><ul><li>Professional or exceptional backpacking experience (e.g. thru-hiked the AT, worked as a NOLS instructor)</li><li>Some photography chops</li></ul><p>NOTE: Your testing will mainly focus on lightweight and ultralight backpacking gear. If you’re the type of backpacker who isn’t much concerned with weight then your gear preferences won’t align well with those of your readers and as a result you won’t be a good fit for the position.</p><p>&nbsp;</p><p><strong>INTERESTED? LET'S TALK NEXT STEPS</strong></p><ol><li>Apply via the link below</li><li>If I like your application I’ll reach out to you to discuss payment rates</li><li>Once we agree on payment I’ll move you on to a paid trial which will consist of 1-2 trial assignments</li><li>If you do a good job on the trial assignments we’ll have a brief phone interview</li><li>If I decide to hire you I will ask you to sign a contract and fill out a W-9</li></ol>          </div>          </div>"
  },
  {
    "id": "Eb-o3kZXSzSe2ilv3lHgjQ",
    "url": "https://unicornhunt.io/jobs/product-and-quality-analyst-at-midrive",
    "title": "Product and Quality Analyst",
    "tags": [
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "Midrive",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 2, 2018 6:12:17 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<p>At Midrive, we’re reinventing driving and insurance for the digital generation. The old way of doing things is broken. 53% of learners fail their first test. Of those who pass, 1 in 5 crash in the first 6 months. That’s unacceptable.</p><p>Our technology helps learners find top-rated instructors and access pay-as-you-go insurance, so they can pass-first time and ultimately become safer drivers.</p><p>Since launch, over 300,000 young people in the UK have used our apps, data and tech to gain their independence. We are growing quickly and are now available in over 100 towns and cities in the UK, expanding to a new one each week.</p><p>Founded in 2013, Midrive has raised over £7.5m to date from a respected group of well-connected and supportive investors ‒ including Holiday Extras and Initial Capital. You may have heard about our recent crowdfunding round which was the 4th largest equity fund-raise target in Crowdcube's history.</p><p>We’ve recently been named #19 in the Startup 100, the annual ranking of the most game-changing and exciting new businesses launched in the last three years. We were also named ‘Digital Business of the Year’ by the Federation of Small Businesses in 2017.</p><p>Want to help us build the future of learner driving and insurance? Then join us!</p> <h4>REQUIREMENTS</h4><p>Midrive are looking for a curious self starter with a keen eye for detail to help us clarify product requirements, and rigorously test and report on usability of our range of web and mobile products.</p><p>This person will make a real difference to the business by making sure that features and functionality meet and exceed users’ expectations. They will also have a chance to get involved in user research and contribute their own product ideas.</p><p>This role would be perfect for someone with a background in science (experience running experiments, patience to rigorously test, and skill at reporting data results from a variety of sources) who likes to break things and wants to gain experience in product management and quality assurance. Previous experience is not a must for this role, as training will be given.</p><p>What your role will involve:</p><ul><li>Designing and implementing tests.</li><li>Reviewing system requirements and tracking quality assurance metrics.</li><li>Assisting with project management, ensuring all stories have good and well understood acceptance criteria.</li><li>Conducting tests before product launches to ensure software runs smoothly and meets client needs, while being cost-effective.</li><li>Documenting these quality processes in line with the relevant guidelines.</li><li>Working with engineering leads to define a roadmap for automating quality and compliance activities.</li><li>Taking responsibility for releases (you will be managing the release process rather than a team).</li><li>Ultimately, monitoring all stages of software development to identify and resolve system malfunctions to meet quality standards.</li></ul><p>What we're looking for:</p><ul><li>An ability to understand and anticipate end users’ expectations in order to experience the products as they would.</li><li>Curiosity, initiative, and an analytical nature.</li><li>Good written and verbal communication skills.</li><li>An ability to interpret collect and interpret data, and clearly present findings.</li><li>Good numeracy.</li><li>Experience working as part of a multidisciplinary team.</li></ul>  <h4>BENEFITS</h4><p>At Midrive, we work hard, so that's why we make sure that we have best facilities to play harder! We have a host of perks: Free coffee and snacks, Wednesdays treats, Happy Hour Thursdays, team yoga sessions, and training/sharing sessions. We also have regular fun social events - recent adventures have included a glamping trip, escape rooms, comedy clubs, and silent discos.</p><p>Midrive is simply a great place to work. We have a fantastic team of talented people working on an interesting product they are passionate about, and a friendly, social atmosphere. We're also a dog friendly office! Add to that competitive salaries, pension plan, and other perks, it's clear why we're a top choice.</p><h4><strong>DIVERSITY</strong></h4><p>Diversity and inclusion are essential values at Midrive. We know we'll do our best and most impactful work when we feel we're represented and we belong. We're proud to actively recruit and hire talented people from a wide variety of backgrounds and experiences. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p> "
  },
  {
    "id": "Pcd6Q-PsTXSlhXueMPWj1Q",
    "url": "http://workinstartups.com/job-board/job/70480/qa-engineer-at-perlego/",
    "title": "QA Engineer",
    "tags": [
      "DBG:surround``10W(work, offic, dai)",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/50",
      "TECH1/python",
      "TITLE1/qa",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "python"
    ],
    "hiringOrganization": {
      "name": "Perlego",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jun 28, 2018 10:22:33 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "*About* <br /><br />Perlego is an electronic library streaming textbooks to students. Perlego is a start up which has been running for 16 months with a beta version of the platform. It is currently in the process of growing it’s engineering team, acquiring content and seeking a QA Engineer to join us and improve our quality control. To see the platform you could be supporting, head to:  www.perlego.com<br />Perlego are seeking someone that can work from the office in central London with remote 1 day/week. You will need to have the right to live and work in the UK.<br /><br /><br />*Job Description*<br /><br />The company are seeking a QA Engineer to produce test plans, tests cases and automated tests working with our agile developers in our path to continuous delivery.  The role will primarily involve planning and creating test cases, writing automated acceptance tests, and co-orindating with developers to produce an effective quality control measures for our engineering team.  <br />You will be expected to be a knowledgeable team player taking on a variety of test activities in our IT team whilst promoting agile testing best practices. The ideal QA engineer will have a strong understanding of test planning, Web applications, APIs and Selenium.  <br /><br />*Key Responsibilities*<br /><br />-Planning and documenting test cases in conjunction with the product owner and development team.<br />-Producing automated acceptance tests for Web Applications using Selenium & WebDriverIO. <br />-Producing automated tests of APIs using appropriate tooling. <br />-Co-ordinating with the development team to create and run acceptance tests within the sprint.<br />-Manual / Exploratory testing of areas without automated coverage.<br />-Provide guidance and promotion of QA best practices, TDD and BDD within the development team.<br />-Identification and documentation of defects.<br />-Collect quality data and monitor team quality metrics. <br />-Shape the Quality management strategy for the company. <br /><br />*Person Specification*<br /><br />Education:  Degree in a Technical field (or equivalent experience) <br />Experience:  <br />-Experience writing automated acceptance tests using Selenium / WebDriverIO for Web Applications.<br />-Experience testing working with developers within an Agile (Scrum) environment.<br />-Understanding of testing best practices (TDD,BDD) and ability to promote them throughout the company. <br />-Understanding of web applications, API’s and test approaches for them. <br />-Understanding of mobile applications and test approaches for them.  <br />-Familiarity with Javascript and databases (SQL/NoSQL)<br /><br />*Skills*  <br />Technical skills in: Test Automation (Selenium & WebDriverIO) <br />Required experience : 2 years in a commercial testing role.<br />Other: Test planning, Test documentation, Agile Scrum, Team player<br />Additional valuable skills:  Cucumber, Gherkin, Postman, Appium, Jest, Browserstack, MYSQL, AWS, Penetration Testing, OWASP familiarity. Python<br /><br />"
  }
]
}
