{
 "items": [
  {
    "id": "xnAPrz3BTteLmtUQaj7apQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/300606-database-administrator-balanc3",
    "title": "Database Administrator - Balanc3",
    "content": "<div><h2>Database Administrator - Balanc3 at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>MongoDB, Node.js, Databases, Go (Golang), Rust</div><div>Compensation</div><div>$90K–$120K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ConsenSys is a venture production studio focused on building and scaling tools and enterprise software products powered by Ethereum. Our mission is to use these solutions to power the emerging economic, social, and political operating systems of the planet.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, security and infrastructure, and more. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p>The Balanc3 team is building and developing financial reporting products built on top of the ethereum blockchain and is responsible for driving blockchain initiatives in the accounting industry.</p><p>About the Role:</p><p>The database administrator is responsible for the performance, integrity and security of a database. They will also be involved in the planning and development of the database, as well as troubleshooting any issues on behalf of the user</p><p>Responsibilities:</p><p>Establishing the needs of users and monitoring user access and security;<br>Monitoring performance and managing parameters to provide fast responses to front-end users;<br>Mapping out the conceptual design for a planned database;<br>Considering both back-end organization of data and front-end accessibility for end-users;<br>Refining the logical design so that it can be translated into a specific data model;<br>Further refining the physical design to meet system storage requirements;<br>Installing and testing new versions of the DBMS;<br>Maintaining data standards, including adherence to the Data Protection Act;<br>Writing database documentation, including data standards, procedures, and definitions for the data dictionary (metadata);<br>Controlling access permissions and privileges;<br>Developing, managing and testing back-up and recovery plans;<br>Ensuring that storage and archiving procedures are functioning correctly;<br>Capacity planning;<br>Communicating regularly with technical, applications and operational staff to ensure database integrity and security;<br>Commissioning and installing new applications and customizing existing applications in order to make them fit for purpose.<br>Requirements:</p><p>Database experience: MongoDB, Redis, Postgres<br>Programing Languages: Node, GoLang, Rust<br>Proven working experience as a Database administrator<br>Hands-on experience with database standards and end user applications<br>Excellent knowledge of data backup, recovery, security, integrity and SQL<br>Familiarity with database design, documentation and coding<br>Previous experience with DBA case tools (frontend/backend) and third party tools<br>Problem solving skills and ability to think algorithmically<br>Fintech experience is a strong plus<br>Blockchain / Ethereum experience a strong plus</p><p>Directly apply on our website!: <a href='http://bit.ly/2AVAdAW' rel='nofollow'>http://bit.ly/2AVAdAW</a></p></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:40:39 PM",
    "tags": [
      "Backend Developer",
      "Brooklyn",
      "Databases",
      "Full Time",
      "Go (Golang)",
      "MongoDB",
      "Node.js",
      "REMOTE1/100",
      "Remote OK",
      "Rust​",
      "TECH1/go",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "Po8ZE7ksThy0d68GlNnKBA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/163888/senior-database-administrator-olo?a=SXHAueBZ5QI",
    "title": "Senior Database Administrator at Olo (New York, NY)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Database Administrator, System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>E-Commerce, Mobile, Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>At Olo we develop an online food ordering platform used by many of the country’s largest restaurant chains, reaching millions of consumers. Olo is revolutionizing the customer experience at these restaurant chains, and we're looking for a talented database administrator to join our team and help achieve this vision. You'll work with a smart, passionate team dedicated to delivering amazing products using modern tools and technologies.</p><p>As part of the team you will play a significant and visible role in helping us scale one of the most advanced food ordering platforms in the market. You will collaborate with our engineering team to guide database designs and query optimizations. You will help us ensure that our databases run smoothly across both Production and Development/QA environments. You will contribute to ongoing performance monitoring, alerting, and tuning. You will help us diagnose and resolve production incidents.</p><p>This is a full-time position in our engineering team. Any member of that team may work at Olo’s headquarters in New York City’s Financial District or remotely from anywhere in the U.S. In fact, more than half of our engineering team is remote!</p><p><strong>Requirements</strong></p><ul><li>Experience building and running a high-availability SQL Server Enterprise cluster in a 24/7 OLTP environment</li><li>Detailed knowledge of SQL Server features, language, and internal workings</li><li>Some experience monitoring and tuning PostgreSQL</li><li>Comfortable in the scripting language of your choice</li><li>Experience with data warehousing and ETL/ELT pipelines</li><li>Experience with large tables (billions of rows) in zero-downtime environments</li></ul><p><strong>Beneficial</strong></p><ul><li>Experience with Redis, ElasticSearch, AWS Redshift, AWS Athena, AWS Redshift Spectrum, or AWS DynamoDB</li><li>Experience with Graph databases (e.g. Neo4J)</li></ul>                    </div>                            <h2>                About Olo            </h2>            <div><p>Olo reaches millions of consumers by powering mobile and online ordering for many of the country’s largest restaurant chains. Mobile ordering and payments is an exciting and active industry full of interesting players and yet still a relatively untapped market ripe for disruption.</p><p>We’re quite up-front about the technical challenges our business faces. Running a platform with multiple white-labeled front-ends, that maintains real-time connections into thousands of restaurants’ POS systems, and coordinates complex transactions between these and other third parties (such as payment gateways and gift card providers) is not for the faint of heart!</p><p>Olo is located at 26 Broadway in the historic Standard Oil Building, the former home of John D. Rockefeller. &nbsp;We offer great benefits, such as 20 days of Paid Time Off, fully paid health, dental and vision care premiums, stock options, a generous parental leave plan, and perks like FitBits, rotating craft beers on tap in our kitchen, and food events featuring our clients' menu items (now you know why we give out FitBits!). Check out our&nbsp;<a href='https://www.olo.com/images/culture.jpg' rel='nofollow'>culture map</a>.&nbsp;<br><br>Olo is an equal opportunity employer and diversity is valued at our company. All applicants receive consideration for employment. We do not discriminate on the basis of race, religion, color, national origin, gender identity, sexual orientation, pregnancy, age, marital status, veteran status, or disability status.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 20 Days of PTO                            </div>                            <div>                                 Semi-private offices                            </div>                            <div>                                 Health, Vision &amp; Dental coverage (you + your family)                            </div>                            <div>                                 Flexible working hours                            </div>                            <div>                                 Competitive Compensation Package                            </div>                            <div>                                 Powerful workstations                            </div>                            <div>                                 401(k) Plan                            </div>                            <div>                                 Maximum respect                            </div>                            <div>                                 Food events &amp; monthly team events                            </div>                            <div>                                 12 week paid parental leave                            </div>                    ",
    "urlFetchPending": false,
    "published": "Jan 1, 2018 5:18:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/dotnet",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "dotnet"
    ]
  },
  {
    "id": "LWTttPRRR-GD1DkNvEmLag",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Oracle+Knowledge+Management&c=Apps+IT&l=Remote&jk=eb7a9df6bc65a4d8&rtk=1c2p4rb2o0j051va&from=rss",
    "title": "Oracle Knowledge Management - OKM - Apps IT - Remote",
    "content": "<div><b>Oracle Knowledge Management - OKM</b><br><span>Apps IT</span>     -<span>Remote</span>    <div>        <span>Contract</span>        </div></div><span><p>Our client rwquires an <b>Oracle</b> <b>OKM</b> consultant to work remotely anywhere in the USA</p><ul><li>Should have strong <b>Oracle</b> Knowledge Management (Inquira) all modules</li><li>Should have experience in Support and Implementation exp in <b>Oracle</b> Knowledge management</li><li>Good to have the development experience with InQuira Suite</li></ul><p><b>Technical</b> Skills</p><ul><li>Lang - JAVA, JavaScript, Python, Shell Scripting</li><li>jQuery. InQuira Suite, XML</li><li>Web Frameworks - Spring BOOT, Custom Java Web applications</li><li>Search - <b>OKM</b> , Elastic</li></ul><p>Job Type: Contract</p></span>",
    "urlFetchPending": false,
    "published": "Dec 28, 2017 11:03:27 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/java",
      "TITLE1/dbms",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend",
      "java"
    ]
  },
  {
    "id": "PVAJbefgS4aadzy6fDCObA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/163274/principal-engineer-graph-database-driven-kalles-group?a=SKW2O06wi3u",
    "title": "Principal Engineer - Graph Database-Driven Payments Platforms at Kalles Group (Seattle, WA)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer, Database Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cybersecurity, Retail, Technology Consulting</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Kalles Group is a Seattle Security, Business, and Technology consulting firm on a mission to redefine professional services with the human workplace. &nbsp;Our subject-matter expert engagement teams are built to succeed. We align diverse career paths to bear on pressing business and technology challenges.&nbsp;</p><p>Kalles Group Business and Technology Consulting is a platform for you to become someone better through your work.</p><p><strong>Role Overview</strong></p><p>This Kalles Group <strong>Principal Engineer, Graph Database Driven Payments Platforms </strong>will work closely with our business and technology teams to model complex database structures and data relationships, at the forefront of the innovation of retail payments technology. The <strong>Principal Engineer</strong> must have exceptional analytical and problem-solving skills and a track record of taking complex concepts and applying practical resolutions.</p><p><strong>Key Activities</strong></p><ul><li>Lead the design, development, testing, and deployment of a graph database solution using Neo4j, OrientDB, or TitanDB. Current data management uses an Oracle RDBMS.</li><li>Design and change graph data models in accordance with technical and business requirements</li><li>Heighten for high performance, efficiency, scalability, and stability of the database</li><li>Describe the database architecture and development best practices</li></ul><p><strong>Qualifications</strong></p><ul><li>Bachelor’s/Master’s Degree in Computer Science/Engineering or a related field (or equivalent experience)</li><li>5-10 years of Java / Scala development</li><li>Solid OO Programming and OO Design knowledge</li><li>Knowledge in developing REST / JSON applications and multi-threaded applications</li><li>Robust unit/integration testing knowledge</li><li>Strong ability to develop code and to debug without using an IDE</li><li>Experience in Agile Development Methodology (Scrum/Kanban)&nbsp;</li><li>Deep understanding in Graph languages: Cypher, Gremlin, Groovy Script</li><li>Past performance of delivery using graph databases such as Neo4j, TitanDB or OrientDB</li><li>Skilled knowledge of complex system integration projects in a cross-domain, cross-partner, multi-application, multi-sourced technology environment is preferred.</li><li>Prior experience with any of the following is a plus: Oracle RDBMS, Neo4j, Sisense, AllegroGraph, Oracle Spatial &amp; Graph, Teradata Aster, ArangoDB, Graphbase, ThingSpa, Bitsy, ArangoDB, DEX Sparksee, Titan, VelocityGraph, InfoGrid Oracle NoSQL Database, OrientDB, Blazegraph, Weaver, Stardog, Sqrrl Enterprise, GraphDB, MapGraph, VertexDB, Cayley, Graph Engine, FlockDB, Apache Giraph, Horton will be a plus.</li></ul><p><strong>Location</strong></p><p><strong>Downtown Seattle - Up to&nbsp;80% Remote.&nbsp;</strong> <strong>Need first week&nbsp;on-site to meet team, and thereafter can be on-site 1 week per month, Monday-Thursday.&nbsp; Travel and expenses paid.&nbsp;&nbsp;</strong></p><p><strong>Compensation</strong></p><p>160-200k + Strong Paid Holidays, Vacation, Health/Dental/Vision, 401(k)</p><p>Additional compensation considerations made for local engineers, or those willing to relocate.</p><p><strong>What's Next?</strong></p><p>Apply Today! &nbsp;1 step application process, no hoops to jump through.</p><p>Kalles Group is an equal opportunity employer.</p>                    </div>                            <h2>                About Kalles Group            </h2>            <div><p>Kalles Group is a Seattle Security, Business, and Technology consulting firm on a mission to redefine professional services with the human workplace. Our subject-matter expert engagement teams are built to succeed, aligning diverse career paths to bear on pressing business and technology challenges as we serve as a platform to become something better through your work.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Choice of Hardware and Equipment                            </div>                            <div>                                 Time for Side Projects                            </div>                            <div>                                 Emphasis on Work/Life Balance (40 hours, generous PTO, flex schedule)                            </div>                            <div>                                 Collaborative Work Spaces                            </div>                            <div>                                 Health, Vision, Dental --- Up to 90% of Premiums Paid ---                            </div>                            <div>                                 401(k) with Numerous Plan Choices                            </div>                            <div>                                 Work-From-Home (After 1 month, 30-50%)                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 19, 2017 12:17:17 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "UBoxQGqdSqeIzIopeiNKPw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Siteminder+Admin&c=Pamten&l=Remote&jk=7ccfc04a9e053012&rtk=1c168dmmc0m614mo&from=rss",
    "title": "Siteminder Admin (W2-CONTRACT) - Pamten - Remote",
    "content": "<div><b>Siteminder Admin (W2-CONTRACT)</b><br><span>Pamten</span>     -<span>Remote</span>    <div>        <span>Contract</span>        </div></div><span>:<br><br>This position would start in early January 2018.<br>Projected as a 1 year contract +<br>One stop Skype/Webex interviews week of Dec 11<br>REMOTE position<br><br><b>Requirements</b><br><br>3+ years of SiteMinder (needs 12.52SP1 or later and at least12.51) Policy Server and Web Agent. CAT-140 certified a plus.<br>Tomcat<br>CloudFoundry<br>Java skillset very important too.<br>.NET/Azure also would be a plus.<br><br>This position would be responsible for helping integrate SiteMinderapplications with CloudFoundry (Tomcat) and MS Azure Private Cloud environments<br><br>Recommended (will be asked)<br>CA Directory<br>ODSEE (Oracle Directory Server)<br>Active Directory<br>Splunk, or Oneview monitoring for agents/logs What SIEMproducts?<br>Fortify against own code if they do any development<br>Tomcat experience a Plus, Tomcat 8<br>Apache 2.4 experience<br><br><b>Min Education: </b>Bachelor Degree in ComputerScience, Software Engineering or Information Systems or related or combinationof education/training and/or progressive experience.</span>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 4:54:47 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java"
    ]
  },
  {
    "id": "WUu96X9eRYqgPH0twAAVRA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Siteminder+Admin&c=Pamten&l=Remote&jk=7ccfc04a9e053012&rtk=1c168qlbf0kh20f7&from=rss",
    "title": "Siteminder Admin (W2-CONTRACT) - Pamten - Remote",
    "content": "<div><b>Siteminder Admin (W2-CONTRACT)</b><br><span>Pamten</span>     -<span>Remote</span>    <div>        <span>Contract</span>        </div></div><span>:<br><br>This position would start in early January 2018.<br>Projected as a 1 year contract +<br>One stop Skype/Webex interviews week of Dec 11<br>REMOTE position<br><br><b>Requirements</b><br><br>3+ years of SiteMinder (needs 12.52SP1 or later and at least12.51) Policy Server and Web Agent. CAT-140 certified a plus.<br>Tomcat<br>CloudFoundry<br>Java skillset very important too.<br>.NET/Azure also would be a plus.<br><br>This position would be responsible for helping integrate SiteMinderapplications with CloudFoundry (Tomcat) and MS Azure Private Cloud environments<br><br>Recommended (will be asked)<br>CA Directory<br>ODSEE (Oracle Directory Server)<br>Active Directory<br>Splunk, or Oneview monitoring for agents/logs What SIEMproducts?<br>Fortify against own code if they do any development<br>Tomcat experience a Plus, Tomcat 8<br>Apache 2.4 experience<br><br><b>Min Education: </b>Bachelor Degree in ComputerScience, Software Engineering or Information Systems or related or combinationof education/training and/or progressive experience.</span>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 4:54:47 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java"
    ]
  },
  {
    "id": "g1-gZjsbR2-tfmsglAyiXw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/161306/senior-aws-redshift-engineer-clevertech?a=S60YRaL2nfy",
    "title": "Senior AWS Redshift Engineer at Clevertech",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>DESCRIPTION</strong></p><p>Clevertech is looking for a Senior AWS Redshift Engineer to join our global team. We are looking for team members to help us develop world class software products for the most exclusive organizations in the world. We have been at this since 2000, and continue to grow off our best asset, our people.</p><p>You are comfortable translating functional and technical requirements into detailed architecture and design in addition to overall system architecture, scalability, reliability, and performance. You are highly experienced with large-scale data analytics and data warehousing. You are able to devise proactive solutions to project-related issues and have stellar communication skills to be able to effectively communicate and inspire trust in all stakeholders.</p><p><strong>We will only consider candidates who have worked with petabytes of data in Redshift.</strong></p><p><strong>REQUIREMENTS</strong></p><p>Clevertech looks for craftsmen developers who take ownership of their code. You can deliver quickly while being clever to avoid missteps. You have an effective positive attitude that shines as you show your care about client and colleague concerns. You are always learning and are a transparent communicator even when it is challenging. You thrive on challenging yourself daily and seek to surround yourself with like-minded individuals.</p><p>Technically, you have an excellent background with large-scale data structures, highly scalable server architectures and experience with network load balancers and network security. Familiarity with large-scale distributed server infrastructure design and development is essential in addition to being comfortable with industry best practices.</p><p><strong>BENEFITS</strong></p><p><strong>Own Your Time</strong></p><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We are a collective of like minded people in over ten countries, and our global perspective shapes our every move.</p><p><strong>Focused Work</strong></p><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams. And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p><p><strong>Learn at your edges</strong></p><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</p><p>And of course, if you speak at a tech conference, we cover all expenses.</p><p><strong>Recharge Time</strong></p><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p>Want to learn more about Clevertech and the team? Check out&nbsp;<a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Full-Time Telecommuting                            </div>                            <div>                                 Flexible Schedules                            </div>                            <div>                                 Paid Time Off                            </div>                            <div>                                 Ability to Work with Cutting-Edge Technology                            </div>                            <div>                                 Opportunity to Work with and Learn from Top Developers                            </div>                            <div>                                 Contribute to Open Source                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/ruby",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "ruby"
    ]
  },
  {
    "id": "hLze_ElGSiCBV0vnOVgrAA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/142097/php-mvc-laravel-cakephp-mysql-developer-vimbly-nyc?a=LEBxn4PeBEY",
    "title": "PHP MVC (Laravel, CakePHP) / MySQL developer at Vimbly - NYC (New York, NY)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Recreation &amp; Leisure, Software Development / Engineering, Web Development</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Why join Vimbly?</strong></p><p><span>Vimbly Technologies is a funded and profitable web 2.0 startup looking for a highly motivated, hard-hitting PHP developer to join the team. &nbsp;Vimbly Technologies is a fast-paced company focused on creating custom best-in-class, high-performance solutions for enterprises spanning a variety of industries. &nbsp;At Vimbly, you’ll work side-by-side with proven talent, creative intelligence, and smiley faces (with firm but non-painful handshakes) -- out of our office in the best city in the world, right across from the Empire State Building. Your work will have a direct and meaningful impact on the product. We aren't looking for another cog in the wheel. You will be given significant responsibility and independence. You will be challenged.</span></p><p><strong>PHP MVC Developer</strong></p><p>We are looking for a PHP MVC developer with a burning curiosity, passion for building great products, track record of writing maintainable code, and reputation of being reliable and efficient. &nbsp;Our preferred MVC frameworks are Laravel and CakePHP.</p><p><span>Candidates able to join our team on-site in our office in Midtown Manhattan are highly preferred, but consideration for remote work will be given to exceptional candidates. &nbsp;Please indicate your location on your application; applications without a location will be ignored.</span></p><p><strong>Responsibilities</strong></p><ul><li><span>Work directly with leadership on implementing cutting-edge company initiatives</span></li><li><span>Develop scalable and robust back-end systems (e.g., payment, analytics, scheduling)</span></li><li><span>Work with front-end team to integrate user-facing markup into systems</span></li><li><span>Take ownership of multiple projects and learn new technologies over time</span></li></ul><p><strong>Benefits</strong></p><ul><li><span>100% employer-covered health, dental &amp; vision insurance</span></li><li><span>Unlimited vacation days (just get your work done)</span></li><li><span>Activity budget to try items on Vimbly -- try one, try them all!</span></li><li><span>Personal movie outings (you'll get more pairs of movie tickets than you're able to use -- so you'll know the contrast from a Vimbly activity!)</span></li><li><span>Unlimited Amazon reading budget to buy any book you please</span></li><li><span>Monthly social outings (Laser tag and paintball? Coming right up...)</span></li><li><span>Monthly massage and optional monthly manicure… except they come to you</span></li></ul><p><strong>Requirements</strong></p><ul><li><span>Expert-level experience with PHP and MySQL</span></li><li><span>Strong experience working with MVC paradigm</span></li><li><span>Understanding of front-end development and implementation (HTML5, CSS3, and jQuery)</span></li><li><span>Knowledge of Git version control</span></li><li><span>Exemplary attention to detail</span></li><li><span>Bachelor's degree in computer science, engineering, or equivalent</span></li></ul><p><strong>Bonus Points</strong></p><ul><li><span>Laravel or CakePHP</span></li><li><span>SASS</span></li><li><span>Composer</span></li><li><span>Track record with microservices and multi-server architectures</span></li><li><span>System administration in Linux and Apache</span></li><li><span>nginx</span></li><li><span>Experience with process efficiency optimization</span></li></ul>                    </div>                            <h2>                About Vimbly - NYC            </h2>            <div><p>Founded in 2011, Vimbly is a funded web 2.0 startup that lets users find and book recreational activities for free. Our mission is to eliminate hours of research for thousands of activities like tango lessons, intro photography classes, or Italian cooking sessions. All the information is in one place instead of the usual process of Googling, picking nearby locations, checking prices, manually comparing schedules (which are each presented differently), and then exchanging emails to lock it down.</p><p>The Vimbly team is a diverse, smart and energetic group of problem solvers. &nbsp;We are each experts in our specific trade, unified by a passion to build a great product that will change the way people discover activities, date ideas, things to do, and life experiences.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Health / dental / vision insurance                            </div>                            <div>                                 Activity budget to try items on Vimbly                            </div>                            <div>                                 Unlimited vacation days (just get your work done)                            </div>                            <div>                                 Monthly massage and optional monthly manicure... and they come to you                            </div>                            <div>                                 Monthly social outings (laser tag and paintball? Coming right up...)                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "bI7NTt5DRb6lB2JowdRbGw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4042-server-operator-remote-in-europe-asia-region-dnsimple",
    "title": "Server Operator (Remote in Europe/Asia region) @ DNSimple",
    "content": "<h2>              Server Operator (Remote in Europe/Asia region)<small> @ DNSimple</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-12-06 03:52</p></dd>          <dt><span>Description</span></dt>          <dd><p>We are looking for a person to add to our talented server operations staff in the Europe or Asia Pacific regions. You will help us to keep our systems online to deliver the best DNS service to our customers around the world.</p><h5>Required skills and experience</h5><p><strong>Chef</strong></p><p>We automate everything we can with Chef and their products, having experience with this is the most important requirement.</p><p><strong>Open source contributions</strong></p><p>Our team contributes a lot to the open source community and we hope you do as well. We would love to see what you've done to help others.</p><h5>Other skills</h5><ul><li>Empathy and communication; Since we are distributed, we communicate mostly in written form, via pull requests, Slack and with our customers when doing support. Being able to understand and make yourself understood to customers and colleagues is essential.</li><li>Ability to learn; We manage many different technologies, sometimes in new, innovative ways. We are constantly touching and improving our platform. We celebrate curiosity and creativity.</li></ul><h5>Job requirements</h5><ul><li>Customer support; Everyone at the company does day to day support to our customers. The operations team is also required to provide support to our internal teams. We appreciate people sensitive to our customer's needs.</li><li>Remote work; We are remote first and we work asynchronously. We have a team focused environment which requires good collaboration skills, but sometimes you'll need to be able to self drive and work alone, then sync back up for reviews and reporting. Asking lots questions is part of everyone's day to day.</li><li>Writing documentation; Since we are all async, good caring on documentation is something we all do and value.</li><li>Travel; We meet up three times a year. We don't require you to go to a conference but we'll support you if you want to speak at one.</li><li>On-call rotation; Everyone technical (operators and developers) helps with the pager rotation to keep our systems working.</li></ul><h5>Our Stack</h5><p>This is the software and systems we deploy and run today. Knowledge and demonstrable skills with any of these are major bonus points.</p><ul><li>Ubuntu Linux (We're on 14.04 and migrating to 16.04)</li><li>DataDog (How we submit metrics data to monitor all the things. Metrics/Monitoring experience is a bonus)</li><li>PostgreSQL (Storing all the data to serve to our internal services)</li><li>Ruby (Our website and API is built on it along with a few of our operations utilities)</li><li>GoLang (Used to help ship zone updates to our name servers and perform redirects)</li><li>Erlang (The beast behind our DNS servers)</li><li>Nginx and HAProxy (Used heavily to secure and serve our various APIs)</li><li>Redis (All our stats and background queues to process everything)</li><li>Python (Used in our DataDog agent to help parse logs and teach it new monitoring tricks)</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Remote in Europe/Asia region</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 5:52:09 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/dbms",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ]
  }
]
}
