{
 "items": [
  {
    "id": "Z7wB56K7Ro-ekLpAMJ8Iew",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/169446/solutions-architect-citrusbyte?a=UPgJj8p7MDS",
    "title": "Solutions Architect at Citrusbyte  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development, Web Design</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Citrusbyte&nbsp;is a software consultancy that believes in using simple tools to solve problems. We build custom systems for both startups and enterprises - You can see our&nbsp;portfolio&nbsp;for more information about our clients.</p><p>We have offices in Los Angeles and New York, but we work remotely with people from all around the world.</p><p>Our engineers have experience in a consultative environment, excellent communication skills and a desire to work with talented teams building innovative products. We work closely with our clients, sharing our experience and processes to help them define and create their products.</p><p>Most of our projects are written in&nbsp;Ruby, so experience in this language is required, but we are looking for experienced polyglot engineers who have a hunger for learning new languages and tools. At Citrusbyte, learning is part of the job, and you should always be able to answer the question: &quot;what have I learned this week?&quot;</p><p>We believe that less is more and we vehemently value simplicity. This is reflected in the tools we choose to work with. For this reason we tend to avoid using big frameworks like Ruby on Rails and instead lean towards smaller tools like Sinatra, Roda or Cuba.</p><p>We have also done projects in Elixir, Node.js, Go, Python, Lua, etc. And strive to learn new tools and languages everyday. We believe in always choosing the right tool for the job and we are very open minded about trying different technologies.</p><p>As a Solutions Architect, you will have a consultative role, directly supporting our clients and our teams so we can achieve our mission. These are some of the things you'll be responsible for:</p><p><strong>Responsibilities</strong></p><p><br><strong>Sales</strong></p><ul><li>Assisting the sales team with uncovering and understanding technical requirements from our clients.</li><li>Producing estimates and risk assessments for prospective projects.</li><li>Preparing and delivering technical presentations to support sales.</li><li>Creating artifacts to support the sales process such as prototypes, diagrams, etc.</li></ul><p><strong>Project Kick-start and Discovery</strong></p><ul><li>Becoming a domain expert for the problems Citrusbyte needs to solve.</li><li>Researching and documenting the client’s existing infrastructure, systems, technologies, teams and in general all the information the engineering team will need to start the project implementation phase successfully.</li><li>Validating integration points into client’s systems, and validating technical hypotheses, through prototyping, tech spikes, and technical feasibility efforts.</li><li>Collaborating with the rest of the team on defining a mission and strategy for the project as well as starting to delineate what the product will be.</li><li>Day-to-day point of contact for all things technical with client stakeholders and client team.</li><li>Guide the client through complex technology selection and platforming decisions to support a successful implementation phase.</li><li>Continually educating client and client stakeholders about the benefits of Citrusbyte’s approach and process to software and solutions development.</li><li>Develop strong and durable relationships with key client stakeholders and client technical/IT organization.</li><li>Contributing to planning a resourcing strategy for the project, taking into consideration the required skill sets, team size, etc.</li></ul><p><strong>Project Implementation</strong></p><ul><li>Lead the relationship with the client from the engineering side. Able to receive feedback about our engineering team directly and mediate if necessary when there are any conflicts.</li><li>On-boarding and guiding the team throughout the client’s ecosystem (accounts, VPN, who to talk about a particular topic, etc).</li><li>Contributing to design engineering solutions for our client. Stepping back and thinking about what we’re building with a focus on usability, simplicity and quality.</li><li>Helping define the project technology stack and identifying the risks of the project execution plan.</li><li>Ensuring that projects live up to Citrusbyte engineering quality standards.</li><li>Ensuring that multiple projects across a single account adhere to consistent best practices, processes and technology stacks.</li><li>Augmenting the engineering team to solve challenging and complex problems.</li><li>Mentoring and coaching the team to consult with the client, so everyone becomes a trusted advisor and is empowered to take on a consultative role.</li><li>Maintain strong and durable relationships with key client stakeholders and client technical/IT organization.</li></ul><p><strong>Project&nbsp;Hand-off</strong></p><ul><li>Gathering requirements from the client&nbsp;and any necessary stakeholders for&nbsp;handing over the project.</li><li>Collaborating with the team to create a successful project hand-off plan.</li></ul><p><strong>Project Support &amp; Maintenance</strong></p><ul><li>Collaborating on defining a resourcing strategy for any support or maintenance commitments after the implementation phase is complete.</li><li>Ensuring that our team has an effective plan for supporting the project as it grows.</li></ul><p><strong>Job Requirements</strong></p><ul><li>Over 10 years of experience in software engineering.</li><li>Over 5 years of experience directly consulting with clients.</li><li>Proficient and experienced with at least 3 programming languages.</li><li>Demonstrates continuous learning and being up to date with modern technologies.</li><li>Demonstrates a strong preference for simplicity in all aspects of software development.</li><li>Excellent spoken and written english level.</li><li>Lives within UTC-8 and UTC-3.</li></ul>                    </div>                            <h2>                About Citrusbyte            </h2>            <div><p><a href='https://citrusbyte.com/' rel='nofollow'>Citrusbyte</a>&nbsp;is a software consultancy focused on using modern tools to solve complex problems for global businesses. We are a pioneer in remote workplaces with a diverse team of communicative, experts spread across 20+ countries.</p><p>We strongly advocate minimalism and this is represented in the tools we choose to work with. Every team gets to decide on their own stack depending on the requirements of the project.</p><p>Our main offices are in Los Angeles and New York, but we work remotely with people from all around the world.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Open Vacation Policy                            </div>                            <div>                                 Hardware                            </div>                            <div>                                 Health, Vision, Dental Benefits                            </div>                            <div>                                 Fitness Reimbursement Program                            </div>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Paternity &amp; Maternity Leave                            </div>                            <div>                                 Education Allowance                            </div>                            <div>                                 Conference Assistance                            </div>                            <div>                                 Annual Company Retreat                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/ruby",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "ruby"
    ]
  },
  {
    "id": "98yVgLSqSJCpznob_e6scg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16512361",
    "title": "Kloudless | Solutions Engineer | San Francisco area (Berkeley); Taipei, TW; REMOTE | Full-time | $120-140k + equity (SF) | Series A stage",
    "content": "<div>                  <span>Kloudless | Solutions Engineer | San Francisco area (Berkeley); Taipei, TW; REMOTE | Full-time | $120-140k + equity (SF) | Series A stage<p>Kloudless’s unified APIs enable engineering teams to quickly integrate their applications with other software services: <a href='https://kloudless.com' rel='nofollow'>https://kloudless.com</a>.</p><p>We’re looking for an experienced Solutions Engineer to serve as a technical resource during all stages of business development and lead advanced technical support for our customers.</p><p>Ideal candidates have strong DevOps experience with Linux systems, experience in a customer-facing role, familiarity with web application development and REST APIs, and are eager to join an early-stage company.</p><p>Apply here: <a href='https://developers.kloudless.com/careers?gh_jid=4004123002' rel='nofollow'>https://developers.kloudless.com/careers?gh_jid=4004123002</a></p><p>Kloudless is backed by some of Silicon Valley’s top investors including David Sacks (co-founder of PayPal and Yammer) and Tim Draper (investor in Box, Tesla, SpaceX).</p><p>We offer competitive salaries and benefits, including insurance plans, flexible paid time off, telecommuting, and snacks. Our team-wide activities include outings, lunches and dinners.</p><p>- Vinod, Co-Founder &amp; CTO<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 4, 2018 1:33:07 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "EGritTXoSHC1y3sjxwMQUQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168868/solutions-architect-americas-auth0?a=UDfB1Nh77Pi",
    "title": "Solutions Architect - Americas at Auth0 (Bellevue, WA) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, IT Security, Software Development / Engineering</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div>Auth0 provides an enterprise-grade platform that secures billions of log-ins every year. The company makes it easy to implement even the most complex identity solutions for their web, mobile, IoT and internal applications, as well as sophisticated identity management for employees, customers and partners. Auth0 has raised over $54 million from Meritech Capital, NTT DoCoMo, Trinity Ventures, Bessemer Venture Partners, K9 Ventures, Silicon Valley Bank, Founders Co-Op, Portland Seed Fund and NXTP Labs.Thousands of enterprises and millions of users worldwide depend on Auth0 for authentication and authorization of their most mission-critical apps, APIs and IoT devices. &nbsp;&nbsp;Auth0’s top priorities are availability and security.This role could be located anywhere in the the Americas - Bellevue WA is preferredSolutions Architects&nbsp;are responsible for implementation and best practice coaching for our biggest customers. They help translate business and security requirements into technical requirements and implementing it. The role requires both broad and deep technology and identity management knowledge, with the ability to architect solutions by mapping customer business and security problems to Auth0 solutions. They will also communicate with sales, support, and product teams to ensure flawless execution of the support and implementation process.<p><strong>Responsibilities:</strong></p><ul><ul><li>Assisting customers in architecting, planning, developing/implementing and applying governance for integrating Auth0 in customers solutions as appropriate.</li><li>Apply advanced analysis skills and experience in principals of solutions design to define appropriate customer solution, scope the effort and provide technical leadership.</li><li>Conduct quality &amp; product usage checks to ensure customer &amp; product satisfaction expectations are being achieved for customers and that a high level of service is being delivered.</li><li>Develop and maintain project plans, issues logs, and status reports.</li><li>Track customer satisfaction metrics; identify opportunities to improve metrics and team efficiency based on results of reporting and analytics.</li></ul></ul><p><strong>Requirements:</strong></p><ul><ul><li>The Solutions Architect must have proven experience managing projects through the entire project lifecycle. This includes managing multi-phase/multi-dimensional/multi-resource projects to a conclusion while maintaining high customer satisfaction. The role requires an individual who is resourceful, confident under pressure and has demonstrated skill in both crisis management and expectation management.</li><li>Comprehensive experience with security solution architecture from an application perspective and demonstrable success of aligning technical teams with business, and managing the delivery of associated technical services, solutions, architectures, and technologies. Technical knowledge of authentication and authorization protocols, threat modeling and application security.</li><li>Familiarity with the whole development lifecycle including modern development tools, languages and frameworks, continuous integration/deployments tools and monitoring, performance, and optimization practices.</li><li>In depth knowledge and experience with at least one development language/technology. Experience with Node.js and front-end development frameworks is a plus.</li><li>Excellent written and verbal communication skills. Ability to set expectations and communicate goals and objectives with customers and teammates. Ability to communicate, influence, build and maintain strong working relationships with stakeholders at all levels in order to achieve successful outcomes for the business. This will include explaining technical concepts to nontechnical stakeholders if required. Ability to successfully communicate and coordinate with departments across the organization, including Sales, QA, Product Management, etc. Ability to understand and escalate issues efficiently and appropriately.</li><li>Ability to delegate responsibilities, assign special tasks and projects, identify new opportunities for process improvement. Must have a passion for the customer which is demonstrated through professionalism and striving for excellence in all aspects of the customer experience.</li><li>Serve as a coach, mentor, knowledge resource, and escalation point for customers and support representatives</li><li>Multitasking and Time Management Skills</li><li>Experience in Pre-sales and Delivery Consulting is a plus</li></ul></ul>Auth0 values diversity and inclusion and is an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Auth0 participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.                    </div>                            <h2>                About Auth0            </h2>            <div><p>Auth0 provides an enterprise-grade platform that secures billions of log-ins every year. The company makes it easy to implement even the most complex identity solutions for their web, mobile, IoT and internal applications, as well as sophisticated identity management for employees, customers and partners. Auth0 has raised over $54 million from Meritech Capital, NTT DoCoMo, Trinity Ventures, Bessemer Venture Partners, K9 Ventures, Silicon Valley Bank, Founders Co-Op, Portland Seed Fund and NXTP Labs.</p><p>Thousands of enterprises and millions of users worldwide depend on Auth0 for authentication and authorization of their most mission-critical apps, APIs and IoT devices. Auth0’s top priorities are availability and security.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Competitive Equity                            </div>                            <div>                                 Free Nespresso                            </div>                            <div>                                 Top-of-the-Line Macbooks and other great tools                            </div>                            <div>                                 Embrace Distributed Work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 9:31:15 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "XAnCItm_TMe-HNa1m6Iwzg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168334/presales-solution-architect-scrapinghub?a=Us9bzxPxYEo",
    "title": "PreSales Solution Architect at Scrapinghub  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Big Data</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Scrapinghub is looking for a motivated Senior Solution Architect to further accelerate the rapid growth the company has seen in the last 3+ years. As a Solution Architect, you will be in charge of the requirement analysis phase of our Professional Services projects. You will gather the customer requirements, analyze and provide technical solutions to our customers and our internal teams for development and delivery. You will be pivotal in translating customer and technical project requirements across various internal and external teams. &nbsp; <strong>Please note this post-holder will need to liaise and work closely with colleagues and customers in the U.S. there for a U.S. location of the post-holder is required.</strong></p><p><strong>Job Responsibilities:</strong></p><ul><ul><li>Meet with customers for requirement collection and provide technical consultation and advice.</li><li>Deconstruct raw business / customer &nbsp;requirements and identifying the actual business problems the customer is trying to solve.</li><li>Translate customer requirements into a viable business solution, execute the necessary; conduct deep technical investigation, propose the best approach and solution inclusive of effort, cost estimates, and occasionally project timelines which fit the customer’s business goals and expectations.</li><li>Build Proof of Concepts, to showcase technical expertise in data acquisition projects, assess feasibility, refine scope, and &nbsp;achieve project collaboration and engagement</li><li>Mentor developers to build a strong team of Solution Architects.</li><li>Ensure you are up-to-date on Scrapinghub products and service offerings which will enable you to provide an architectural solution that includes the latest capabilities and provide value to our customers</li><li>Create, write and present customer proposals and ensure it completely captures the technical requirements for the solution proposed</li><li>Take ownership of learning upcoming product and service capabilities by requesting training sessions from the concerned team.</li><li>Work with subject matter experts to provide better solutions.</li></ul></ul><p><strong>About you:</strong></p><ul><ul><li>You have solid knowledge and understanding of aspects of web crawling using Python.</li><li>You have strong client and customer facing experience - minimum of 3 years experience in a similar position within a technical environment</li><li>You have excellent communication skills, both written and verbal, and are comfortable in document writing, both technical and non technical</li><li>You possess excellent presentation skills and experience in articulating technical and business solutions to both technical and non technical audiences.</li><li>You have the ability to articulate and convey technical solutions effectively and clearly to internal teams and stakeholders.</li><li>You have the zeal to understand customer business requirements really well by asking the right questions.</li><li>You have the confidence to assert and justify the technical feasibility of a requirement, to make decisions, negotiate scope, and assess risk.</li><li>You have solid experience of mentoring teams preferably software developers.</li><li>You demonstrate proven knowledge and experience of estimation, planning, and project management.</li><li>You are well organized, self-motivated, and communicative -- an essential skill in a remote team.</li></ul></ul><p><strong>Bonus points for:</strong></p><ul><ul><li>You have experience in web crawling in Scrapy / any other tools.</li><li>A proven track record of working with a remote team</li><li>Knowledge of and interest in web crawling, data mining and information retrieval</li></ul></ul>                    </div>                            <h2>                About Scrapinghub            </h2>            <div><p>Founded in 2010, Scrapinghub is a fast growing and diverse technology business turning web content into useful data with a cloud-based web crawling platform, off-the-shelf datasets, and turn-key web scraping services.</p><p>We’re a globally distributed team of 120 Shubbers working from over 30 countries who are passionate about scraping, web crawling, and data science.</p><p>As a new Shubber, you will:</p><p>Become part of a self-motivated, progressive, multi-cultural team.</p><p>Autonomy to make the role your own, supported by great people</p><p>Join a team with huge opportunity to make a difference</p><p>Have the freedom to work from&nbsp;<a href='http://blog.scrapinghub.com/2015/05/12/traveling-tips-for-remote-workers/' rel='nofollow'>wherever you want</a>.</p><p>Have the opportunity to go to conferences and meet with the team from across the globe.</p><p>Get the chance to work with cutting-edge open source technologies and tools.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible working hours                            </div>                            <div>                                 Remote working                            </div>                            <div>                                 Paid time off                            </div>                            <div>                                 Paid open source work                            </div>                            <div>                                 Global team meet ups                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 18, 2018 11:18:35 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/python",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "python"
    ]
  },
  {
    "id": "U-DAbh-BSSybuj9Tqdwjtw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/742-presales-solution-architect",
    "title": "PreSales Solution Architect",
    "content": "PreSales Solution Architect - Jobmote<div><div><h2>PreSales Solution Architect</h2><h5>Scrapinghub</h5></div></div><div><div><div><div><div><p><strong>Job Responsibilities:</strong></p><ul><li>Meet with customers for requirement collection and provide technical consultation and advice.</li><li>Deconstruct raw business / customer &nbsp;requirements and identifying the actual business problems the customer is trying to solve.</li><li>Translate customer requirements into a viable business solution, execute the necessary; conduct deep technical investigation, propose the best approach and solution inclusive of effort, cost estimates, and occasionally project timelines which fit the customer’s business goals and expectations.</li><li>Build Proof of Concepts, to showcase technical expertise in data acquisition projects, assess feasibility, refine scope, and &nbsp;achieve project collaboration and engagement</li><li>Mentor developers to build a strong team of Solution Architects.</li><li>Ensure you are up-to-date on Scrapinghub products and service offerings which will enable you to provide an architectural solution that includes the latest capabilities and provide value to our customers</li><li>Create, write and present customer proposals and ensure it completely captures the technical requirements for the solution proposed</li><li>Take ownership of learning upcoming product and service capabilities by requesting training sessions from the concerned team.</li><li>Work with subject matter experts to provide better solutions.</li></ul><p><strong>About you:</strong></p><ul><li>You have solid knowledge and understanding of aspects of web crawling.</li><li>You have strong client and customer facing experience - minimum of 3 years experience in a similar position within a technical environment</li><li>You have excellent communication skills, both written and verbal, and are comfortable in document writing, both technical and non technical</li><li>You possess excellent presentation skills and experience in articulating technical and business solutions to both technical and non technical audiences.</li><li>You have the ability to articulate and convey technical solutions effectively and clearly to internal teams and stakeholders.</li><li>You have the zeal to understand customer business requirements really well by asking the right questions.</li><li>You have the confidence to assert and justify the technical feasibility of a requirement, to make decisions, negotiate scope, and assess risk.</li><li>You have solid experience of mentoring teams preferably software developers.</li><li>You demonstrate proven knowledge and experience of estimation, planning, and project management.</li><li>You are well organized, self-motivated, and communicative -- an essential skill in a remote team.</li></ul><p><strong>Bonus points for:</strong></p><ul><li>You have experience in web crawling in Scrapy / any other tools.</li><li>A proven track record of working with a remote team</li><li>Knowledge of and interest in web crawling, data mining and information retrieval</li></ul></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Feb 15, 2018 8:20:43 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ]
  },
  {
    "id": "rWRu6sIxQDeLOij7PnKbzA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/147082/senior-security-architect-bromium-uk-ltd?a=NkfZygbeuyc",
    "title": "Senior Security Architect at Bromium UK Ltd (Cambridge, UK)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Cybersecurity, Security Software, Virtualization</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Job Title:&nbsp;&nbsp; Senior Security Architect </strong></p><p><strong>Department:&nbsp;&nbsp; Engineering</strong></p><p><strong>Location:&nbsp;&nbsp; Cambridge, UK or Cupertino, CA or Remote</strong></p><p><strong>Position Summary:</strong></p><p>You will work closely with our development and product management teams, maintaining and enhancing the security and functionality of the Bromium suite of products. You will write technical reports publishing your research and present these papers at computer security conferences as well as authoring technical reports for internal and external purposes.</p><p><strong>Job Responsibilities:</strong></p><ul><li>Keeping up to date with the latest security events and working with engineering to ensure our product stack provides protection</li><li>Investigating known malicious activity and examining the impact</li><li>Researching new threats and providing analysis on behavior</li><li>Publishing research, presenting technical talks and contributing to the Bromium blog&nbsp;</li></ul><p><strong>Job Requirements:</strong></p><ul><li>Experience with or ability to understand a complex set of interactions between components of a large software solution</li><li>Solid understanding of current security threats, exploitation techniques, mitigation and hardening technologies (particularly endpoint security products) on the Windows platform</li><li>Knowledge of hypervisor technologies and advanced x86 platform functionality (VTx, UEFI, kernel development)</li><li>Proven experience of C/C++ code auditing (for both language-specific and logic errors)</li></ul><p><strong>The following skills and attributes are a plus:</strong>&nbsp;</p><ul><li>Knowledge of Microsoft Windows internals and the history of security vulnerabilities in Windows</li><li>Previous experience of sandbox design and implementation</li><li>Knowledge of browser internals</li><li>Experience giving talks at security conferences, reporting vulnerabilities discovered to vendors and publishing papers on computer security</li><li>Experience of Python code auditing</li></ul>                    </div>                            <h2>                About Bromium UK Ltd            </h2>            <div><p>The security of the computer systems most of us use every day is rubbish. Clicking on a web link, opening an email, connecting to a Wi-Fi hot spot, plugging in a USB stick – it’s like playing with fire.</p><p>What if we told you that you could click on anything and never have your system compromised? You could be a part of our team building cutting-edge technology to protect computers around the world using Bromium’s revolutionary micro-virtualization based security. Micro-virtualization provides protection by running user tasks in isolated micro-VMs, ensuring malicious activity is contained and thus preventing cyber-attacks spreading through a user’s system or the wider network. We protect the world’s most secure organizations, and are now growing our team to meet customer demand.</p><p>You will be based at our global center of engineering in Cambridge, working with a world leading team. Everyone at Bromium has an important impact on the company, directly affecting the products we ship – your ideas and effort matter. There is opportunity for career advancement, everyone receives stock options and we offer a generous benefits package including life assurance, income protection and travel insurance as well as free lunches, snacks and a stocked beer fridge and ice cream freezer!</p><p>We take what we do seriously but we also like to have fun while doing it. A Friday evening pub trip, and a social at the Cambridge Beer Festival never go amiss. We’re driven, we’re always thinking ahead, and we’re learning all the time. If you want to make a positive change and work on a product to be proud of, join us at Bromium.</p><p><strong>Company Overview:</strong></p><p>Bromium was founded in 2010 with a mission to restore trust in computing. The company’s founders, Ian Pratt and Simon Crosby have a long and deep history of innovation in virtualization and security. Inspired by the isolation principles of traditional virtualization, the Bromium team has created a game-changing new technology called micro-virtualization to provide powerful enterprise by protecting end users against advanced malware. Bromium has its headquarters in Cupertino, California and an R&amp;D center in Cambridge, UK. The company is backed by top-tier investors, including Andreessen Horowitz, Ignition Capital, Highland Capital Partners, Intel Capital, Meritech Capital and Lightspeed Venture Partners.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Private health insurance (including family)                            </div>                            <div>                                 Travel insurance including family and leisure trips (UK)                            </div>                            <div>                                 Life Assurance, Income Protection and Employee Assistance Programme                            </div>                            <div>                                 $5,000 referral bonus scheme                            </div>                            <div>                                 Childcare voucher scheme (UK)                            </div>                            <div>                                 Monthly team lunches, weekly pastries, unlimited snacks/drinks                            </div>                            <div>                                 Onsite parking and undercover bike shed (UK)                            </div>                            <div>                                 Informal flexible working                            </div>                            <div>                                 Discounted gym, onsite shower facilities                            </div>                            <div>                                 Fun culture, hard working team environment                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/solution",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "I1uy1pBzSOSkUDlEt2C0Gg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/200965-solutions-architect-sales-engineer-consensys-enterprise",
    "title": "Solutions Architect / Sales Engineer - ConsenSys Enterprise",
    "content": "<div><h2>Solutions Architect / Sales Engineer - ConsenSys Enterprise at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$120K–$200K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Apply Here: <a href='https://consensys.net/open-positions/?bzid=5e75cb05b559' rel='nofollow'>https://consensys.net/open-positions/?bzid=5e75cb05b559</a></p><p>The Role</p><p>We are currently seeking Solution Architects / Sales Engineers to join our Enterprise team. In this position you will be the technical representative for ConsenSys' products and services, working closely with our Business Development Managers and Delivery Leads in our Enterprise organizartion.</p><p>This is a hands-on technologist role -- you are not just doing slideware, you’re crafting enterprise blockchain solutions for large organizations. Experience seeing the entire lifecycle from conception to design to technology evaluation to pilot program to implementation to maintenance and support is crucial.</p><p>Solutions Architects / Sales Engineers do not act as typical consultants - they function as blockchain technical leads &amp; architects during the sales process in conjunction with a sales lead, at our client locations for short term engagements and do everything from developing initial prototype applications to running training and remaining engaged through delivery.</p><p>Database, distributed systems, full stack development, security &amp; cryptography, and previous blockchain (especially Ethereum) experience are all huge pluses. We're looking for customer-facing hands-on technologists with a track record of success to join us in locations throughout North America, Europe, and Asia Pacific.</p><p>Our Solutions Architects / Sales Engineers are responsible for securing the client's technical endorsement through complex sales processes including: requirements gathering, solution architecture, product and competitive positioning, partner enablement, proposal generation and drafting appropriately scoped statements of work. You could be onstage at a conference one day, working on a client proposal the next, and delivering partner training the following week, all while collaborating with our product teams on feature roadmaps, token launches or marketing roadshows.</p><p>A great candidate for this position will be confident whether espousing the business benefits of blockchain technology to executives or diving into code with developers. This person will have a minimum of 3 - 5 years of experience working with with technologists and executives through enterprise software sales cycles, notably with experience in emerging technology ecosystems. If you worked in a pre-sales technical or consulting role at a leading big data, machine learning, or PaaS company for the past few years, you may well have the type of background we are looking for. A similar background at a leading systems integrator or in solutions delivery is also relevant. You need to be comfortable being held accountable to client-based outcomes and in particular vendor/technology selection.</p><p>From a tactical standpoint, you are highly effective at leading discovery meetings, designing and presenting bespoke sales proposals, staying current on blockchain technology developments, and building and delivering product / technology demos. You must take a hands on approach to technology, collaborating with our internal development teams and clients alike. Last but not least, we expect the solution architects / sales engineers to complete a successful project handover to the delivery team assigned to the project and maintain the client relationship through the delivery phase.</p><p>If you are ready to take the leap in joining a fast growing company in a business development capacity, we encourage you to apply today!</p><p>Ability to travel 30-50+% required. Varies by location and team.</p><p>Responsibilities:</p><p>You would be working with customers, partners, and prospects to understand and propose solutions using ConsenSys technologies<br>Lead technical sales process for numerous customers day to day, from introductory meetings (net new sales) through post-sales (customer satisfaction, upselling, and subscription renewals)<br>Map your customer requirements to current and future offerings<br>Educate your prospects on the business value of blockchain in general, Ethereum and ConsenSys' offerings<br>Drive progress towards successful sales, in concert with Business Development Managers and Delivery Leads<br>You should focus on customer success<br>Continuously learn and update your skills in quickly evolving technologies<br>Qualifications:</p><p>Ability to switch context quickly throughout the day with numerous contending demands<br>Minimum 3 years experience and success working in a customer-facing role<br>Hands-on, technical, problem solver<br>Development experience with OO programming and full stack development<br>Unix/Linux expertise required<br>Comfortable partenering with customers and public speaking<br>Demonstrated experience gathering and understanding customer business requirements<br>Experience with full stack development and modern development tools<br>Knowledge of distributed systems<br>Experience with many of the following:</p></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:40:39 PM",
    "tags": [
      "Brooklyn",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Software Engineer",
      "TECH1/bigdata-ml",
      "TITLE1/solution",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "esy2Nc2bSuy_hm79dhEYxA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16285404",
    "title": "Endjin | UK | Azure | https://endjin.com",
    "content": "<div>                  <span>Endjin | UK | Azure | <a href='https://endjin.com' rel='nofollow'>https://endjin.com</a><p>Do you think you would like to come and explore what is happening in data, analytics and business transformation with us in 2018?</p><p>Are you the kind of person that just can't leave a question unanswered? Do you really want to know how things work, and share that knowledge with your team and the wider community? Do you understand how people and technology can come together to craft something special, each reshaping the other?</p><p>Endjin are hiring developers at all levels, from apprentices to seniors, to work on exciting projects with clients from all over the world, in verticals from retail to financial services, utilities and media.</p><p>We build modern data platforms in the cloud, and use them to help businesses adopt machine learning, data science, and automation.</p><p>We work with fascinating new technologies like Service Fabric, Reactor, Cosmos DB, and Data Lake to develop novel software architecture at the boundaries of hyperscale computing, for our clients, our own internal IP, and partners like Microsoft.</p><p>We increase our value by using our products, blueprints and library of intellectual property, sharing the benefit with our clients and partners.</p><p>We value life-long learning and an eye for quality. We will help you to find the best learning techniques, tools, and team-working, so that you can achieve your potential, and deliver the best value to our clients; while balancing your personal goals and home life.</p><p>Our employees have a mutual respect, regardless of where they are in their career. Ideas are developed by the whole team, from interns to seniors.</p><p>Equally, our clients pass the &quot;nice to work for&quot; test (and usually do so with flying colours). As part of that, we try to understand the ethical implications of the work we undertake. We seek to do the best we can for each other, for our profession, clients, and for the world at large.With no external investors, endjin has been built as a sustainable, lifelong business: we are a company to retire out of, not exit at the expense of the employees.</p><p>You can work remotely from anywhere in the UK, and we hold meet-ups in London on a regular basis. You design your ideal working environment, and we will make it happen together.</p><p>Apart from a real passion for learning, you probably dream in data - how it can be represented, handled, secured and manipulated. A bit of maths improves your day. You know a couple of programming languages pretty well (we do a lot of C# and Typescript, but you may know R, or Python too). You love working with other people, but value the opportunity to spend time in your own head, thinking things through.</p><p>You can learn more about our projects at <a href='https://endjin.com' rel='nofollow'>https://endjin.com</a>, see a video about our career development pathways <a href='https://vimeo.com/200191869' rel='nofollow'>https://vimeo.com/200191869</a> or read our blog <a href='https://blogs.endjin.com' rel='nofollow'>https://blogs.endjin.com</a></p><p>Contact us on hello-at-endjin-dot-com if you think this looks like a good opportunity for you.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 10:12:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/python",
      "TITLE1/solution",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "python"
    ]
  },
  {
    "id": "uEQs3_P1SUeUWhicUK7tpA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16284013",
    "title": "Ciena | IT Cloud Architect | ONSITE (Baltimore, MD) or REMOTE, USA | Full-Time",
    "content": "<div>                  <span>Ciena | IT Cloud Architect | ONSITE (Baltimore, MD) or REMOTE, USA | Full-Time<p>IT Infrastructure Enterprise Cloud Architect</p><p>Diverse existing and new business system workloads needs to move to AWS, Azure (or Oracle?!?!) clouds.Large migration project. Hands on cloud and automation experience required, as well as ability to drive discussions and vision at executive level.Candidate would be able to get to Hanover, MD office easily.  Either local or remote.</p><p>Ciena is a major network gear and software vendor, probably this message went over our gear to reach you.  In addition to using cloud providers, they are our customers.</p><p><a href='https://ciena.wd5.myworkdayjobs.com/en-US/Careers/job/US-MD-Hanover-7031/Cloud-Infrastructure-Architect_R006901-1' rel='nofollow'>https://ciena.wd5.myworkdayjobs.com/en-US/Careers/job/US-MD-...</a></p><p>Copy me as well please pwarner@&lt;company-name&gt;.com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 8:00:04 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "mCnAmIFCSgOJjz9uBbQHPw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/429-cloud-solution-engineer",
    "title": "Cloud Solution Engineer",
    "content": "Cloud Solution Engineer - Jobmote<div><div><h2>Cloud Solution Engineer</h2><h5>Dito</h5></div></div><div><div><div><div><div><p>Dito is looking for a Cloud Solutions Engineer to join our team! &nbsp;&nbsp;The position is remote so you will get to enjoy the luxuries and flexibility of working from home.</p><p>As a Cloud Solutions Engineer, the key responsibility will be to drive enterprise infrastructure, applications and analytics to public clouds while supporting the Sales team to develop and earn new business with prospects and existing customers. &nbsp;The position may be remote but our teams work together closely with you playing a crucial role in addressing “buying” questions that will involve the design and implementations of public and hybrid cloud application architecture, as well as cloud-hosted business intelligence. &nbsp;</p><p>You will get to leverage your creative juices and technical abilities around infrastructure, system and application design using web, mobile, cloud, and open source technologies. Experience across various enterprise solutions/ technology stacks (IaaS/PaaS/SaaS) and ability to provide guidance to diverse stakeholders and external vendors will be the foundation of yours and our success! &nbsp;</p><p>A few details about your day to day objectives;</p><ul><li>Lead change across large platforms / functional areas / organizations to public clouds.</li><li>Conduct architectural and engineering review of proposed IT investments/solutions to determine the strategic alignment and technical soundness.</li><li>Demonstrate thought leadership in cloud computing across multiple channels and become a trusted advisor to decision makers.</li><li>Identify, develop and document repeatable design and implementation methodology </li><li>Partner with project teams, vendors, support organizations, functional architects, systems specialists and other technical resources in this hands-on role driving cloud migration/adoption from inception to production implementation.</li><li>Collaborate with the product, data, and infrastructure architects and be responsible for the defining-designing-delivering the technical architectures, patterns, technical quality, risks, fitness for purpose and operability of technical architecture solutions.</li><li>Provide technical recommendations to senior executives to assist the decisions on proposed IT investments/solutions and assume responsibility for technical presentations demonstrating a good understanding of application, data, infrastructure, architecture expertise and application systems design. </li><li>Lead application workload and data migration, design and build interfaces between applications and other providers, as well as ownership of overall migration effort, workloads, backup and DR services &nbsp;</li><li>Able to analyze, design, and implement cloud migration strategies without impacting business continuity </li><li>Project scoping skills; methods, knowledge and experience of application processes, development, implementation and deployment to achieve project objectives. </li></ul></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Jan 26, 2018 7:28:29 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  }
]
}
