{
 "items": [
  {
    "id": "sX3ImUq6RH2afE9vMKJ8Mw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/remote-jobs/breeze-church-management-senior-php-mysql-developer",
    "title": "Breeze Church Management: Senior PHP/MySQL Developer",
    "content": "<div>  <div>    <h2>Senior PHP/MySQL Developer</h2>      <h4>Posted Mar 28</h4>    <h3>      <span>Breeze Church Management</span><br>      <span>Headquarters: Remote</span><br>        <a href='https://www.breezechms.com' rel='nofollow'>https://www.breezechms.com</a>      <br>      <a rel='nofollow'>View all Breeze Church Management jobs →</a>    </h3>  </div>    </div>  <div>    <div>Do you dream about PHP code? Create MySQL database structures on napkins for fun? Have a passion for helping churches?</div><div><br></div><div><span>If so, we’d <i>love</i> to talk!</span></div><div><span><br></span></div><div><span>Breeze is a software company focused on serving churches and we’re looking for an advanced PHP/MySQL developer to join our team. The position would focus on both the front-end interface and backend functioning of Breeze.</span></div><div><span><br></span></div><div><span>This is a remote position that would begin on a contract basis. With the right fit, we’d love to consider a full time hire. Breeze is a fully distributed team and so all work would be done remotely. Compensation would be commensurate with experience.</span><br></div><div></div><div></div><div><span><br></span></div><div><span><b>Preferred Experience</b></span></div><div><span><b><br></b></span></div><ul><li>5+ Years PHP Experience<br></li><li>5+ Years MySQL Experience<br></li><li>jQuery Experience<br></li><li>HTML/CSS Experience<br></li><li>MVC Framework Experience<br></li><li>Git Experience<br></li><li>Server Management Experience<br></li><li>Unit Testing Experience<br></li><li>Photoshop/Illustrator Experience<br></li><li>Have an iOS or Android phone</li></ul><div><span><br></span></div><div><span><b>Additional Skills / Experience</b></span><br></div><div></div><div><span><b><br></b></span></div><div></div><ul><li>Passionate about helping churches be successful<br></li><li>Phenomenal written and verbal communication skills<br></li><li>Previous remote work experience<br></li><li>A high value for fun, finding meaning in your work, the ability to laugh at yourself, and being a team player.<br></li></ul><div><span><br></span></div><div><span><b>You can learn more about Breeze at:</b></span></div><div><span>https://www.breezechms.com</span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>We’re only considering individual developers (no agencies please) within the United States of America. If this looks like a potential fit, we’d love to hear from you. You can use the link below to apply.<a href='https://team.breezechms.com/form/breeze-developer-2018-ext' rel='nofollow'>https://team.breezechms.com/form/breeze-developer-2018-ext</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 28, 2018 4:23:22 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "1KqT4Q6hS3-chJc4O1bdUg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/162426/contractors-required-with-full-stack-skills-to-voiteq-ltd?a=StiQ0XDBxU4",
    "title": "Contractors required with full stack skills to work on modern .NET & SQL server at Voiteq Ltd (Blackpool, UK) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Contract</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, Logistics &amp; Distribution, Retail Industry</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Job description</strong></p><p>Voiteq&nbsp;is&nbsp;looking for strong engineers to join our team on a <strong>3-month fixed term contract</strong>, working on a range of apps for our software serving the logistics industry.&nbsp;We build apps that use voice-directed work solutions, so there's lots of interesting ways to get involved with working with voice and wearable computers.&nbsp;<strong>Analytics</strong>&nbsp;is a big part of our business, so any experience working with data warehousing or dashboard tools is a plus.</p><p>You'll be working as part of cross-functional agile teams, to help to deliver our product roadmap. We have decades of domain experience in-house and we'll use that to help build better products. We use&nbsp;<strong>Jira</strong>&nbsp;to manage our user stories and take other bits from scrum, like regular standups, code reviews and planning poker sessions.</p><p><strong>Culture</strong></p><p>Good code is important. We do regular code reviews and run our internal projects on light-touch scrum. We spend the time to get things right. We've invested a lot of effort in our build and deployment tools, using stuff&nbsp;like&nbsp;<strong>Jenkins</strong>&nbsp;and&nbsp;<strong>Octopus</strong>&nbsp;and we're moving towards a&nbsp;<strong>DevOps</strong>&nbsp;way of working.&nbsp;</p><p><strong>Remote Working</strong></p><p>We're happy to offer remote working for the right candidates, but would like you to be available to come to a UK office when required, possibly 2-3 times a month.</p><p><strong>Skills &amp; Requirements</strong></p><ul><li>Proven experience in modern high-level language (ideally&nbsp;<strong>C#</strong>)</li><li>Ability to write testable and decoupled code (DI with e.g.&nbsp;<strong>Autofac</strong>/<strong>Moq</strong>)</li><li>Work well in a team and with non-technical people</li><li>Experience with modern source control (<strong>Git</strong>)</li></ul>                    </div>                            <h2>                About Voiteq Ltd            </h2>            <div><p>Nearly all the products we buy come from a warehouse. The logistics industry is a low-profile giant; it employs 1 in 12 jobs in the UK.</p><p>Voiteq makes products and services to make logistics businesses more efficient in their warehouse operations.&nbsp;</p><p>Our core business adds intelligence into existing warehousing operations, getting workers away from carrying bits of paper around to receiving instructions on a voice device. Through process engineering we have made companies like Kellogg's up to 40% more efficient in their warehousing picking operations.</p><p>Privately owned, we have a strong internal dev team. Many of our staff are long-serving and have been here since the formation of the company in 2000. We have an open environment, with regular standups and code reviews. We have flexible working arrangements, and are happy to have people work from home when appropriate.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Working                            </div>                            <div>                                 Bike to work scheme                            </div>                            <div>                                 Up to 30 days a year paid time off                            </div>                            <div>                                 Funded Social Events                            </div>                            <div>                                 Unlimited Fruit, Snacks, Tea and Coffee                            </div>                            <div>                                 Charitable fundraising events and fun days                            </div>                            <div>                                 Profit share scheme                            </div>                            <div>                                 Company share scheme                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 23, 2018 10:10:12 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "xnAPrz3BTteLmtUQaj7apQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/300606-database-administrator-balanc3",
    "title": "Database Administrator - Balanc3",
    "content": "<div><h2>Database Administrator - Balanc3 at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>MongoDB, Node.js, Databases, Go (Golang), Rust</div><div>Compensation</div><div>$90K–$120K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ConsenSys is a venture production studio focused on building and scaling tools and enterprise software products powered by Ethereum. Our mission is to use these solutions to power the emerging economic, social, and political operating systems of the planet.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, security and infrastructure, and more. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p>The Balanc3 team is building and developing financial reporting products built on top of the ethereum blockchain and is responsible for driving blockchain initiatives in the accounting industry.</p><p>About the Role:</p><p>The database administrator is responsible for the performance, integrity and security of a database. They will also be involved in the planning and development of the database, as well as troubleshooting any issues on behalf of the user</p><p>Responsibilities:</p><p>Establishing the needs of users and monitoring user access and security;<br>Monitoring performance and managing parameters to provide fast responses to front-end users;<br>Mapping out the conceptual design for a planned database;<br>Considering both back-end organization of data and front-end accessibility for end-users;<br>Refining the logical design so that it can be translated into a specific data model;<br>Further refining the physical design to meet system storage requirements;<br>Installing and testing new versions of the DBMS;<br>Maintaining data standards, including adherence to the Data Protection Act;<br>Writing database documentation, including data standards, procedures, and definitions for the data dictionary (metadata);<br>Controlling access permissions and privileges;<br>Developing, managing and testing back-up and recovery plans;<br>Ensuring that storage and archiving procedures are functioning correctly;<br>Capacity planning;<br>Communicating regularly with technical, applications and operational staff to ensure database integrity and security;<br>Commissioning and installing new applications and customizing existing applications in order to make them fit for purpose.<br>Requirements:</p><p>Database experience: MongoDB, Redis, Postgres<br>Programing Languages: Node, GoLang, Rust<br>Proven working experience as a Database administrator<br>Hands-on experience with database standards and end user applications<br>Excellent knowledge of data backup, recovery, security, integrity and SQL<br>Familiarity with database design, documentation and coding<br>Previous experience with DBA case tools (frontend/backend) and third party tools<br>Problem solving skills and ability to think algorithmically<br>Fintech experience is a strong plus<br>Blockchain / Ethereum experience a strong plus</p><p>Directly apply on our website!: <a href='http://bit.ly/2AVAdAW' rel='nofollow'>http://bit.ly/2AVAdAW</a></p></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:40:39 PM",
    "tags": [
      "Backend Developer",
      "Brooklyn",
      "Databases",
      "Full Time",
      "Go (Golang)",
      "MongoDB",
      "Node.js",
      "REMOTE1/100",
      "Remote OK",
      "Rust​",
      "TECH1/go",
      "TITLE1/dbms",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  }
]
}
