{
 "items": [
  {
    "id": "gEtOSEAHTSmOYBS9H5dWvQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/186054/senior-design-researcher-wikimedia-foundation-inc?a=10oB4xcfSAyQ",
    "title": "Senior Design Researcher at Wikimedia Foundation, Inc. (San Francisco, CA) ",
    "content": "<div>                                    <h2>About this job</h2>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Education Technology, eLearning, Non-Profit</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>201-500 people</span>                                    </div>                            </div>                    </div>                                                    <h2>Technologies</h2>                    <div>                        <a rel='nofollow'>design</a><a rel='nofollow'>user-interface</a>                    </div>                                            <h2>Job description</h2>                <div><p><strong>Location:&nbsp;</strong>San Francisco, CA or Remote&nbsp;</p><p><strong>Duration:&nbsp;</strong>Permanent</p><p><strong>Hours:&nbsp;</strong>Full time</p><p><strong>Summary</strong></p><p>The&nbsp;Wikimedia Foundation’s Product Design Strategy Group is seeking a senior design researcher to whose primary focus will be to work with the&nbsp;Anti-Harassment Tools (AHT) Team to support the development of&nbsp;<a href='https://meta.wikimedia.org/wiki/Community_health_initiative#Anti-Harassment_Tools' rel='nofollow'>tools</a>&nbsp;and&nbsp;<a href='https://meta.wikimedia.org/wiki/Community_health_initiative#Policy_Growth_&amp;_Enforcement' rel='nofollow'>policies</a>&nbsp;aimed at reducing online harassment and other disruptive behavior on Wikipedia and Wikimedia projects. &nbsp;Formed in 2017, the AHT team’s mission is to address a wide range of behavior: from content vandalism, stalking, name-calling, trolling, doxxing, and discrimination, to anything that targets individuals for unfair and harmful attention. As the world’s largest encyclopedia, and a cornerstone of the open content movement, Wikimedia seeks to build and model an online community that aligns with its mission of inclusion and diversity.</p><p>The team is building tools that will: help detect harassment and stalking; make it easier for people to report harassment; help wiki administrators to evaluate reports; and block unwanted harassers from our projects. &nbsp;Working closely with product managers, developers, community advocates and many passionate volunteers, the Sr. Researcher will design qualitative and quantitative research that results in actionable insights that can drive the development of these new tools. &nbsp;Wikipedia and the other Wikimedia projects are complex places, both socially and technically — this position requires enthusiasm for learning about new communities, processes, and cultural norms.</p><p>The WMF Product Design Strategy Group provides strategic research and experimentation to help inform and inspire future product and platform decisions.</p><p><strong>Responsibilities:</strong></p><ul><li>Design, drive and support qualitative and quantitative research agenda to better understand the needs of Wikipedia contributors who have experienced or witnessed harassment, and administrators who are working to protect the editing community</li><li>Perform&nbsp;analysis of complex, dynamic online communities to identify&nbsp;opportunities and problematic areas of existing tools and workflows</li><li>Help design a set of interdependent software features, in collaboration with the editors who will use those features</li><li>Consult and collaborate with other researchers to ensure quality and usability of output</li></ul><p><strong>Requirements:</strong></p><ul><li>Expertise in multiple qualitative research methodologies, e.g. surveys, textual analysis, and ethnographic interviewing and observation, including qualitative analysis methods.</li><li>A strong sense of mission and energy for this initiative</li><li>Experience with quantitative research methodologies, e.g. statistical analysis, data visualization, data manipulation</li><li>Outstanding written and verbal communication skills</li><li>Aptitude for defining and measuring project success</li><li>Strong time-management skills</li><li>Self sufficiency and ability to resolve what blocks your work within a cross-functional team environment</li><li>Comfortable working on short deadlines and the ability to pivot quickly</li><li>Experience leading research projects from start to finish (solo and in collaboration with others)</li><li>Collaborative nature (willingness to make collaboration across time zones via remote functionality work, as well as in person collaboration)</li><li>Academic training in Behavioral or Social Sciences (e.g. sociology, social psychology, anthropology), Information Science, or Human-Computer Interaction background</li><li>5+ years of professional experience in a research role</li><li>Masters Degree or PhD in a related field</li><li>Experience working collaboratively with design teams to translate insights into actionable recommendations</li></ul><p><strong>Pluses:</strong></p><ul><li>A nuanced understanding of group dynamics and online cultural practices</li><li>Experience working in interdisciplinary teams with data scientists and designers</li><li>A history of social activism, volunteering, and/or open source contribution</li><li>Experience contributing to Wikimedia projects</li><li>A strong portfolio of public presentations of research work (e.g. conference presentations, white papers, peer-reviewed manuscripts)</li></ul><p><strong>The Wikimedia Foundation is...&nbsp;</strong></p><p>...the nonprofit organization that supports Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge, free of interference. We host the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. The Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive financial support from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.</p><p><em>The Wikimedia Foundation is an equal opportunity employer, and we encourage people with a diverse range of backgrounds to apply</em></p><p><strong>Benefits &amp; Perks *</strong></p><ul><li>Fully paid medical, dental and vision coverage for employees and their eligible families (yes, fully paid premiums!)</li><li>The Wellness Program provides reimbursement for mind, body and soul activities such as fitness memberships, baby sitting, continuing education&nbsp;and much more</li><li>The 401(k) retirement plan offers matched contributions at 4% of annual salary</li><li>Flexible and generous time off - vacation, sick and volunteer days, plus 19 paid holidays - including the last week of the year.</li><li>Family friendly! 100% paid new parent leave for seven weeks plus an additional five weeks for pregnancy, flexible options to phase back in after leave, fully equipped lactation room.</li><li>For those emergency moments - long and short term disability, life insurance (2x salary) and an employee assistance program</li><li>Pre-tax savings plans for health care, child care, elder care, public transportation and parking expenses</li><li>Telecommuting and flexible work schedules available</li><li>Appropriate fuel for thinking and coding (aka, a pantry full of treats) and monthly massages to help staff relax</li><li>Great colleagues - diverse staff and contractors speaking dozens of languages from around the world, fantastic intellectual discourse, mission-driven and intensely passionate people</li></ul><p><strong>More information</strong></p><p><a href='https://wikimediafoundation.org/' rel='nofollow'>WMF</a></p><p><a href='https://blog.wikimedia.org/' rel='nofollow'>Blog</a></p><p><a href='https://annual.wikimedia.org/2017/' rel='nofollow'>Annual Report - 2017</a></p><p><a href='https://meta.wikimedia.org/wiki/Strategy/Wikimedia_movement/2017' rel='nofollow'>Wikimedia 2030</a></p>                </div>                                    <div>                                    <div>                                        <div>        <a href='https://stackoverflow.com/jobs/apply/186054?reset=False&amp;ra=10oB4xcfSAyQ&amp;oqs=a%3D10oB4xcfSAyQ' rel='nofollow'>Apply now</a></div>                                    </div>                        </div>        </div>            <h2>About Wikimedia Foundation, Inc.</h2>            <div><p><strong>The Wikimedia Foundation is...</strong></p><p>...the nonprofit organization that supports Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared&nbsp;knowledge,&nbsp;and that everyone should be able to access that knowledge, free of interference. We host the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. The Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive&nbsp;<a href='https://donate.wikimedia.org/w/index.php?title=Special:LandingPage&amp;uselang=en&amp;utm_medium=wmfWikiLink&amp;utm_source=B_FAQ&amp;utm_campaign=C_FAQ' rel='nofollow'>financial support</a>&nbsp;from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.</p><p><em>The Wikimedia Foundation is an equal opportunity employer, and we encourage people with a diverse range of backgrounds to apply.</em></p>            </div>                            <h2>Benefits</h2>                    <ul>                            <li>                                <span></span>                                <span>Fully paid premiums for medical, dental &amp; vision insurance premiums</span>                            </li>                            <li>                                <span></span>                                <span>401(k) with 4% matching contribution</span>                            </li>                            <li>                                <span></span>                                <span>7-12 weeks parental leave with 100% pay + lactation room</span>                            </li>                            <li>                                <span></span>                                <span>Wellness Program ($1800 annual) to promote wellness &amp; personal growth</span>                            </li>                            <li>                                <span></span>                                <span>Pre-tax savings plans for Transportation &amp; Parking</span>                            </li>                            <li>                                <span></span>                                <span>Flexible work schedules and remote working options</span>                            </li>                            <li>                                <span></span>                                <span>Pet Friendly office</span>                            </li>                            <li>                                <span></span>                                <span>Commitment to diversity &amp; inclusion throughout the employee lifecycle</span>                            </li>                            <li>                                <span></span>                                <span>12 days vacation, 19 days holiday, 2 days volunteer work and more!</span>                            </li>                            <li>                                <span></span>                                <span>Lean more at https://wikimediafoundation.org/wiki/Work_with_us</span>                            </li>                    </ul>                ",
    "urlFetchPending": false,
    "published": "Jun 1, 2018 7:40:45 PM",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:c/c/10",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=10, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "-yS8rjKFQH6-hnYvxTINIw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/spiceblue/jobs/89428-ux-ui-designer",
    "title": "UX / UI DESIGNER",
    "content": "<div><h2>UX / UI DESIGNER at Spiceblue</h2><div>Chennai, Remote · Full Time</div></div><div><div>Skills</div><div>Javascript, HTML5 &amp; CSS3</div><div>Compensation</div><div>₹120K–₹300K<br>No Equity</div></div><h3>Job Description</h3><div><p>* Minimum 3 years experience in user interface and user experience design.<br>* Mastery of Adobe Photoshop, Illustrator, HTML, CSS &amp; Javascript.<br>* Solid understanding of usability and limitations for both web and mobile.<br>* Recent experience in designing mobile apps.<br>* Proficient on all stages of the design process, from concepts to implementation.<br>* Obsessive about beautiful design, details and strong usability.<br>* Be a good team player, accept feedback and collaborate well with others.<br>* Be self-directed, self-motivated, organized and disciplined.<br>* Be able to multi-task and meet deadlines in a fast paced environment.<br>* Have an online portfolio that shows at least 3 completed projects.</p></div>",
    "urlFetchPending": false,
    "published": "May 29, 2018 7:12:01 PM",
    "tags": [
      "Chennai",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=10}",
      "Designer",
      "Full Time",
      "HTML5 & CSS3",
      "Javascript",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "4_YKAfJ3QfCTaJjcLXAGrQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/11594-ux-ui-designer",
    "title": "UX/UI Designer",
    "content": "UX/UI&nbsp;Designer - Jobmote<div><div><h2>UX/UI&nbsp;Designer</h2><h5>Out of the Sandbox</h5></div></div><div><div><div><div></div></div><div><div><div><p>Out of the Sandbox (<a href='https://outofthesandbox.com/' rel='nofollow'>https://outofthesandbox.com/</a>) is the leading designer of premium Shopify themes and is known for providing an exceptional customer support experience. Our award-winning team has developed the most popular and best-reviewed themes available for Shopify. Shopify is a rapidly growing commerce platform with 500k+ merchants in over 150 countries.</p><h4>Background and context for this role:</h4><p>In the Shopify and theme design world, UX plays a particularly significant role because there are two different user types we must account for: the customer of the online shop as well as the “merchant” who will be interacting with the theme settings to setup their site.</p><p>The merchant’s experience of the setup process is affected by the availability and complexity of the settings they have at their disposal for each page, section and component of their theme, and we endeavor to keep this as clear and straightforward as possible, while still giving them lots of options and flexibility.&nbsp;</p><p>At the same time, we want to ensure enough built-in consistency and best practices that they cannot inadvertently create a shop that leads to unsightly interfaces or poor UX for their customers.</p><p>As a UX/UI specialist, you will play a key role in researching, conceptualizing and designing interface solutions for these interesting yet unique UX/UI challenges!&nbsp;</p><h4>What you’ll do</h4><ul><li>Play a key role in establishing design standards and UI component libraries for new themes</li><li>Work with the Design Director to define and maintain the creative vision for both upcoming and existing themes, including overall styling and micro-interactions</li><li>Create conceptual wireframes for theme components and layouts, along with their related settings</li><li>Create high-fidelity mockups to solidify and illustrate the design direction for a theme, and to serve as a go-to reference for the development team</li><li>Create interactive prototypes for demonstration or user testing purposes</li><li>Advocate for UX best practices and design standards</li><li>Apply and maintain a consistent art style throughout the entire project interface</li><li>Collaborate with our dev, documentation, and support teams to help shape a successful user experience for both the merchant and end user of our themes</li><li>Review, test and approve design-related features, giving feedback and guidance to the dev team to help achieve pixel perfection</li><li>Suggest enhancements and improvements to our themes in terms of new features, improved UI, better UX on the theme editor side, etc.</li><li>Contribute to other design projects, including graphics and content creation for demo shops, social feeds and marketing campaigns</li></ul><h4>What you’ll need</h4><ul><li>Fluency in modern best practices for UX and interaction design, and a deep empathy for all users</li><li>Current with the latest UI trends, and keen on staying tuned to emerging UI technologies</li><li>Solid experience designing and prototyping mobile and desktop interfaces</li><li>Proficiency in Sketch, InVision, Balsamiq, Photoshop, or other prototyping tools</li><li>A strong portfolio demonstrating your passion for interactive design, including samples of wireframes, component libraries and live projects</li><li>Super detail-oriented, strong aesthetic sensibility and appreciation of good visual design</li><li>Excellent eye for color, shape, composition and iconography</li><li>Ability to articulate the rationale for design decisions</li><li>Basic understanding of HTML, CSS/SASS, JavaScript/jQuery and comfortable working with GitHub</li><li>Ability to work in a remotely distributed, collaborative environment, alongside the rest of our awesome and highly technical team</li><li>Ability to embrace feedback and adapt designs as required in collaboration with other designers and the rest of the team</li><li>Comfortable working with flexible processes, knowing when to pivot and shift as necessary</li></ul><h4>Nice to have</h4><ul><li>Familiarity with a11y and usability requirements</li><li>Comfortable tweaking styles in CSS, editing Shopify’s liquid templates and interacting with git&nbsp;repositories</li><li>Previous experience with ecommerce&nbsp;sites</li><li>Familiarity with the Shopify platform in particular</li><li>Experience using a design methodology to improve workflow speed and efficiency</li><li>Motion graphic and animation design</li><li>Graphic design and image editing capabilities</li><li>Although Out of the Sandbox is a remote company, preference will be given to candidates based in Ottawa or Toronto</li></ul><p>&nbsp;</p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "May 28, 2018 12:20:45 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:css/frontend/6",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:jquery/frontend/8",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:k/t/w:sass/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=25}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "9SlEwTa5S3Sys0cBqxAacw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30612?r=rss2",
    "title": "Out of the Sandbox: UX/UI Designer",
    "content": "<p>Full-time</p><p><strong>(Ottawa, Ontario)</strong> </p><p>Out of the Sandbox (https://outofthesandbox.com/) is the leading designer of premium Shopify themes and is known for providing an exceptional customer support experience. Our award-winning team has developed the most popular and best-reviewed themes available for Shopify. Shopify is a rapidly growing commerce platform with 500k+ merchants in over 150 countries.</p><h3>Background and context for this role:</h3><p>In the Shopify and theme design world, UX plays a particularly significant role because there are two different user types we must account for: the customer of the online shop as well as the “merchant” who will be interacting with the theme settings to setup their site.</p><p>The merchant’s experience of the setup process is affected by the availability and complexity of the settings they have at their disposal for each page, section and component of their theme, and we endeavor to keep this as clear and straightforward as possible, while still giving them lots of options and flexibility.&nbsp;</p><p>At the same time, we want to ensure enough built-in consistency and best practices that they cannot inadvertently create a shop that leads to unsightly interfaces or poor UX for their customers.</p><p>As a UX/UI specialist, you will play a key role in researching, conceptualizing and designing interface solutions for these interesting yet unique UX/UI challenges!&nbsp;</p><h3>What you’ll do</h3><ul><li>Play a key role in establishing design standards and UI component libraries for new themes</li><li>Work with the Design Director to define and maintain the creative vision for both upcoming and existing themes, including overall styling and micro-interactions</li><li>Create conceptual wireframes for theme components and layouts, along with their related settings</li><li>Create high-fidelity mockups to solidify and illustrate the design direction for a theme, and to serve as a go-to reference for the development team</li><li>Create interactive prototypes for demonstration or user testing purposes</li><li>Advocate for UX best practices and design standards</li><li>Apply and maintain a consistent art style throughout the entire project interface</li><li>Collaborate with our dev, documentation, and support teams to help shape a successful user experience for both the merchant and end user of our themes</li><li>Review, test and approve design-related features, giving feedback and guidance to the dev team to help achieve pixel perfection</li><li>Suggest enhancements and improvements to our themes in terms of new features, improved UI, better UX on the theme editor side, etc.</li><li>Contribute to other design projects, including graphics and content creation for demo shops, social feeds and marketing campaigns</li></ul><h3>What you’ll need</h3><ul><li>Fluency in modern best practices for UX and interaction design, and a deep empathy for all users</li><li>Current with the latest UI trends, and keen on staying tuned to emerging UI technologies</li><li>Solid experience designing and prototyping mobile and desktop interfaces</li><li>Proficiency in Sketch, InVision, Balsamiq, Photoshop, or other prototyping tools</li><li>A strong portfolio demonstrating your passion for interactive design, including samples of wireframes, component libraries and live projects</li><li>Super detail-oriented, strong aesthetic sensibility and appreciation of good visual design</li><li>Excellent eye for color, shape, composition and iconography</li><li>Ability to articulate the rationale for design decisions</li><li>Basic understanding of HTML, CSS/SASS, JavaScript/jQuery and comfortable working with GitHub</li><li>Ability to work in a remotely distributed, collaborative environment, alongside the rest of our awesome and highly technical team</li><li>Ability to embrace feedback and adapt designs as required in collaboration with other designers and the rest of the team</li><li>Comfortable working with flexible processes, knowing when to pivot and shift as necessary</li></ul><h3>Nice to have</h3><ul><li>Familiarity with a11y and usability requirements</li><li>Comfortable tweaking styles in CSS, editing Shopify's liquid templates and interacting with git&nbsp;repositories</li><li>Previous experience with ecommerce&nbsp;sites</li><li>Familiarity with the Shopify platform in particular</li><li>Experience using a design methodology to improve workflow speed and efficiency</li><li>Motion graphic and animation design</li><li>Graphic design and image editing capabilities</li><li>Although Out of the Sandbox is a remote company, preference will be given to candidates based in Ottawa or Toronto</li></ul><p>&nbsp;</p><p></p><p><strong>Job Perks:</strong> This position includes an employer paid benefits plan for medical/dental expenses, a health and wellness program, flexible hours and vacation policy, conference travel, and any hardware or software required. </p><p><strong>Apply:</strong> Please include a link to your design portfolio.</p>",
    "urlFetchPending": false,
    "published": "May 28, 2018 10:05:27 AM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:css/frontend/6",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:jquery/frontend/8",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:k/t/w:sass/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=25}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "_nmqfYPFSqits0bSdxcmkA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/69353/packaging-designer-at-social-gamma/",
    "title": "Packaging Designer",
    "content": "Social Gamma is looking for an experienced graphic designer that can help us for a project. The project is for a company and we are looking for someone withe expertise in packaging design. This is a freelance project and can be remote. Please attach your portfolio. We need somebody ASAP! <br /><br /><br />With a savvy and sassy creative team, we build beautiful brands. We bring your brand to life with a brand blueprint and then curate, create and shoot eye-catching content and social feeds. We build engaged, highly targeted & active online communities by activating targeted growth hacking strategies. We guarantee targeted social growth, with specific KPIs demonstrating monthly, quarterly and yearly growth, compared against market and competitor averages.",
    "urlFetchPending": false,
    "published": "May 25, 2018 10:01:39 AM",
    "tags": [
      "DBG:surround``can 2W remot",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Ji4aJ9J2R8CD35JJJS78Fg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/spiceblue/jobs/57903-graphic-designer",
    "title": "Graphic Designer",
    "content": "<div><h2>Graphic Designer at Spiceblue</h2><div>Chennai, Remote · Full Time</div></div><div><div>Skills</div><div>Adobe Photoshop, Adobe Illustrator, HTML/CSS/PHP/MYSQL, Photoshop, Illustrator, Flash, Maya, Max, Illustration</div><div>Compensation</div><div>₹120K–₹300K<br>No Equity</div></div><h3>Job Description</h3><div>No description available.</div>",
    "urlFetchPending": false,
    "published": "May 24, 2018 5:45:30 PM",
    "tags": [
      "Adobe Illustrator",
      "Adobe Photoshop",
      "Chennai",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:flash/frontend/8",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=11}",
      "Designer",
      "Full Time",
      "HTML/CSS/PHP/MYSQL",
      "Photoshop, Illustrator, Flash, Maya, Max, Illustration",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "xcsaxTThQPWLIPGgBi6VmQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/69339/mid-level-designer-sizestream-at-metail-ltd/",
    "title": "Mid-level Designer - SizeStream",
    "content": "Gamechangers wanted. We are creating a cutting edge made to measure shopping experience built on proprietary 3D body scanner technology. Doing it justice takes a great user experience and innovative design, always true to the brand.<br /><br />For users, the product delivers garments that fit perfectly through an an efficient but engaging shopping experience. For fashion retailers, the product boosts online sales, reduces returns and differentiates their offering.<br /><br />This is a unique opportunity to determine an entirely new consumer experience that must work seamlessly across in-store and online channels. As a UX/UI designer, you’ll have critical impact on how this product works, looks and feels. You’ll work as part of the dedicated Made to Measure Product Team, working with a tight knit group of fellow product managers and engineers.<br /><br />Responsibilities:<br /><br />We are looking for a UX/UI Designer to join our sister company, SizeStream. You are passionate about developing strategies based off insights of real people, have the mastery of the craft t turn these insights into beautifully designed products (both interactions and visuals) and inspires the organisation by showing/ prototyping what is possible before built. You’re excited by a challenge and have a knack for picking things up quickly and running with them. Committed to ruthless prioritisation, you won’t be afraid to make tough decisions.<br /><br />Day to day you will be responsible for working with the team to define the optimal user journey, create and user-test wireframes and prototypes, conduct user research and create visual designs, ensuring designs are successfully implemented and brought to life. <br /><br />Determine how the made to measure product works, looks and feels.<br />Conduct user research and optimise their journey, and analyse and monitor the impact of any change to a product. <br />Work with the development team to implement designs.<br />Create and user-test wireframes and prototypes. <br />In-store 3D scanner designs and shopfront work.<br />Develop user stories and preliminary designs for client-facing tools. <br />Essential Requirements: <br /><br />User focused – a deep understanding and appreciation of the process of identifying users’ needs<br />Analytical – ability to weigh the pros and cons, cost and benefits of different designs, backed by research and data<br /><br />Working experience on one of the major prototyping tools for UX (Principle, Flinto, Framer etc)<br /><br />Experience designing for mobile (web and native)<br /><br />High level of understanding of graphic design and visuals<br /><br />An online portfolio showcasing your previous designs and processes<br /><br />Communication, presentation and interpersonal skills<br /><br />Desirable Requirements: <br /><br />4+ years UX/UI design experience<br /><br />Excellent skills in UI design using Sketch, Illustrator and Zeplin<br /><br />Knowledge of HTML/CSS<br /><br />Knowledge of animation and video editing software<br /><br />Interest in clothes and fashion<br /><br />Animation skills<br /><br />The Team:<br /><br />SizeStream is creating a cutting edge made to measure shopping experience built on proprietary 3D body scanner technology. You will work closely with developers, marketing, product managers and be able to make a big impact and learn a lot.",
    "urlFetchPending": false,
    "published": "May 24, 2018 4:04:00 PM",
    "tags": [
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:animation/gamedev/16",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=16, php=0, embedded=0, frontend=3}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ]
  },
  {
    "id": "efD6agSSTU-_lNwWEhKuwg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/69161/looking-a-greatinspired-personfreelancer-to-partner-amp-design-our-webcodinghtml-dept-at-boxsmart/",
    "title": "Looking a GREAT/INSPIRED PERSON/FREELANCER to partner &amp; design our Web/Coding/Html Dept!",
    "content": "[ LONDON APPLICANTS ONLY]<br /><br />The time has come! At last a designer advert that isn't boring! But why?<br /><br />Well because at BoxSmart, we are a team of interesting people that aren't boring in the tech world! We are ENERGY.<br /><br /><br />I’m not just saying this. This is the last advert and INSPIRATIONAL, REAL and GREAT designers needs to see!<br /><br />We are seeking someone that can offer<br />Web design<br />ASP net and coding backend<br />HTML pages for our mailouts<br />and more things you can offer!<br /><br />[Who is writing this ENERGETIC email???]<br /><br />We are BoxSmart. A team of over 13 individuals that help small brands get better pricing for their packaging needs.<br /><br />We built Boxsmart to help talented people launch their brands and leave the filthy rat race that London has made these days. So you can get an idea of the type of people that run this ship – GIVERS.<br /><br /><br />This role is really to find the right PERSON. A ‘right person’ will work with the Martketing Director (nifty place to be if you influence them with your talents. Plenty of room in a startup to climb the ladder? Just a thought…).<br /><br />The ‘Right Person’ is a subjective thing but we know what it is. We can carve any intern to wherever they wish to go if you are like the ‘Right Person’ for BoxSmart. So here goes:<br /><br /><br />1- Someone that has a sense of PURPOSE. That doesn’t chase money (it comes as the byproduct of good work. We look after our family/team. We commit to everyone that works here are BoxSmart).<br /><br /><br />2- Someone that is simply fed up of the rat race. That is ‘boxed’ (excuse the pun) in a fixed role and can’t dip their finger in certain areas. Well we need someone flexible and up for trying new areas of the business – that way you can fall into a role you love later on within the team (see… we DO care)<br /><br /><br />3- A ‘giver’, not a taker: So many people take, take, take. Nobody gives first. Everyone at BoxSmart TRUSTS and gives first. Can you?<br /><br /><br />4- Someone highly creative. Lateral and charismatic. This is ESSENTIAL. We will know in the first TWO MINUTES on our phone chat – so you can’t hide!<br /><br /><br /><br />5- Someone that eventually wants to run their own business. I mean, why would a business not want to hire someone with those aspirations? Probably someone that wants you good enough to exploit but not good enough for you to leave right? Well at boxsmart we always offer other business ventures we build and aim for everyone to enjoy their lives by embracing GROWTH (we currently have three businesses we are building, alongside this. The right person is always welcome to take the reins. I mean, why not?? A good person deserves to grow).<br /><br /><br />6- Someone that has a LIFE TOO! This role is remote. You visit the CEO/Marketing once a week or so and work via phone. You have a life. Can pay your bills and work SMART. We don’t need someone imprisoned at a desk. We are over that. In fact we all work from home, coffee shops and have board meetings over dinners at nice restaurants! Why not? We are clever and we work in a remote generation.<br /><br /><br />The role:<br /><br /><br />This is the part where we tell you the core basics of the role:<br /><br /><br /><br />A – To support the Ceo/Marketing team in rebuiding the website and making the other sites to come<br /><br />B - To help with digital mediums for the BoxSmart departments: Exhibitions/PouchSmart and other spin offs that we are launching!<br /><br /><br />And that’s it! Just someone that wants to team up!<br /><br />[What do i get?]<br />Well we will pay you a 'case by case' amount, BUT we can also offer you commissions on any results we get online. We also will, once you hit 6 months, give you equity in any new website you build!<br /><br />So it's someone looking for the LONG BALL as well as a decent amount in the short term. We want a member of the TEAM<br /><br /><br />We will teach you all aspects of business. You are on the pulse with the CEO and the privilege to work with a a great team!<br /><br /><br />So it’s not just a job! It’s a JOURNEY!<br /><br /><br /><br />Have a think,.. We need the right person… the rest will fall into place.<br /><br />Team BoxSmart!",
    "urlFetchPending": false,
    "published": "May 19, 2018 6:02:34 PM",
    "tags": [
      "DBG:surround``OR(you,we,employe,develop,engin,abl,workmat) 2W work 2W from 2W home",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "pamivRAeQ4aCzJclKhjJow",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/create-ape-inc-contract-ux-ui-designer",
    "title": "Create Ape, inc.: Contract UX/UI Designer",
    "content": "<div>  <div>    <h2>Contract UX/UI Designer </h2>      <h4>Posted May 18</h4>    <h3>      <span>Create Ape, inc.</span><br>      <span>Headquarters: Southern California </span><br>        <a href='https://createape.com/' rel='nofollow'>https://createape.com/</a>      <br>      <a rel='nofollow'>View all Create Ape, inc. jobs →</a>    </h3>  </div>    </div>  <div>    <div><span><b>Create Ape is hiring again!</b></span></div><div><span><b>Work from home? Check!&nbsp;</b></span></div><div><span><b>Full autonomy. You bet!&nbsp;</b></span></div><div><span><b>Micro manage? Naaa ...ain't nobody got time for that.</b></span></div><div><span>(We were going to post a more sterile job description but then decided... better not ;)</span></div><div><span><br></span></div><div><span><b>Who we are:</b></span></div><div><span>Fun and lean design agency</span></div><div><span><b><br></b></span></div><div><span><b>What we are looking for:</b></span></div><div><span>UX/UI designer for full-time remote contract role. Salary is 3-4K a month with lots of room to grow.&nbsp;</span></div><div><span><br></span></div><div><span>Type of work:</span></div><ul><li><span>Informational sites</span></li><li>Parallax sites</li><li>Mobile Apps</li><li>Complex web apps</li><li><span>Wire framing + Prototypes (Holla @ Invision yo!)</span></li></ul><div><span><br></span></div><div><span><b>What you need to bring to the table:</b></span></div><ul><li><span>Be flexible</span></li><li><span>Be able to work during our business hours (9am to 5pm PST).</span></li><li><span>Be available throughout the day via slack/email/etc.</span></li><li><span>Four or more years of UX/UI design experience and a portfolio to back it up.</span></li><li><span>Ability to create clickable prototypes using InVision.</span></li><li><span>Experience with Basecamp/Freedcamp to post and collaborate on projects.</span></li><li><span>Extensive experience in using UX/UI design best practices to design solutions and a deep understanding of mobile-first and responsive design.</span></li><li><span>Ability to iterate designs and solutions efficiently, quickly, and intelligently.&nbsp;</span></li><li><span>Be curious and intuitive: we ask our designers to decipher and translate user data, analytics, and environment/tech restrictions into beautiful compelling designs and flows.</span></li></ul><div><span><br></span></div><div><span><b>Basic&nbsp; Tools You Should Know</b></span></div><ul><li><span>Sketch</span></li><li><span>Adobe Creative Cloud; minimally Photoshop and Illustrator</span></li><li><span>InVision</span></li><li><span>Google Drive and Dropbox</span></li><li><span>Slack</span></li></ul><div><span><br></span></div><div><span><b>Big bonus if you can:</b></span></div><ul><li><span>Have some print design chops working in Illustrator + Indesign&nbsp;</span></li><li><span>Basic knowledge of front end code (HTML. CSS, etc)</span></li><li><span>Extrapolate and use analytical data (Google Analytics, CrazyEgg, KissMetrics etc) to create data-driven design solutions;</span></li><li><span>Experience conducting remote usability tests to validate designs;</span></li><li><span>Solid understanding for goal-driven design principles;</span></li><li><span>Solid understanding of conversion-based design solutions;</span></li></ul><div><span><br></span></div><div><span><b>If you like what you see and want to get out of that commute...holla at us with your portfolio, resume, and seriously... a cover page that's interesting or makes us laugh ;)</b></span></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='mailto:afard@createape.com' rel='nofollow'>afard@createape.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "May 18, 2018 10:28:55 PM",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:responsive-design/frontend/13",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=16}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "4rBVxG6DTBi0249X394TFg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/367843-self-managing-systems-designer-facilitator",
    "title": "Self-Managing Systems Designer & Facilitator",
    "content": "<div><h2>Self-Managing Systems Designer &amp; Facilitator at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Change Management, Building Coalitions, Organizational Development</div><div>Compensation</div><div>$135K–$145K<br>0.001%–0.001%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ConsenSys is a venture production studio and the leading technology firm in blockchain globally. We deliver products, solutions and platforms built using blockchain technology to transform how business is done in complex network of buyers, suppliers and consumers.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, the music industry, security, and infrastructure, and more. To accomplish this we've built out a flat organizational structure which we call the ConsenSys Mesh: a network of individuals &amp; teams working autonomously and towards the same goal. &nbsp;Our mission is to use these decentralized solutions to fundamentally reshape the economic, social, and political operating systems of the planet. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p>About Organizational Development at ConsenSys</p><p>Consensys is developing itself as a self organizing system. ConsenSys believes that this is the only way we can be nimble and innovative enough to stay in the lead of the blockchain field. Project DNA combines our Organizational Development &amp; Global Operations Circles. Our goal is to facilitate the development of a self-organizing ecosystem that is agile, scalable, representative and transparent. We coordinate the creation of the mindsets, structures and skillsets needed for self-organization at the individual, team, and company-wide level.</p><p>About the role</p><p>The Self-Management Facilitator/Systems Designer will be a key facilitator, thought leader and brand builder in improving our ability to scale and move towards a decentralized operating system. You will be instrumental in establishing the brand of the Organizational Development circle as a thought leader in decentralized systems of self-management. You will play an integral role as facilitator and coach to our people in their self-management journey. You will be a critical driver to our ability to scale and move towards a decentralized operating system.</p><p>The Organizational Development team is working to build out the operating system, training and skills building capability and education systems needed to build a decentralized, self-managed organization. &nbsp;Because we are creating a self organizing system, this role requires facilitative leadership -- the ability to develop common vision among teams. Even though the role needs is senior level experience, it also requires the ability to follow the leadership from other team members. That element of culture fit is an essential aspect of this role.</p><p>Responsibilities</p><p>Work with the Organizational Development circle to identify high impact areas for change at the individual, team and system levels<br>Build hypotheses around these areas of change, design,develop and execute these experiments<br>Work with Organizational Development to facilitate the process of building self-organizing systems, practices, and mindsets at ConsenSys with teams, individuals and the company as a whole<br>Help build a diverse team to deliver and measure these experiments<br>Set up key metrics and feedback loops to be able to adapt the process as necessary<br>Build our brand through communication of learnings and case studies throughout the organization</p><p>Requirements</p><p>You have built effective systems of self-management in organizations or communities<br>Proven experience through case studies of building coalitions that have successfully reached their change goals<br>You care about doing high-leverage, impactful work in the world<br>Creating a system of organizing humans built foundationally in trust keeps you up at night or gets you up in the morning<br>Passionate about and have experience in building the “future of work”, e.g. Teal organizations, self-management, movement building<br>You are user-centered in your approach on everything<br>You take an Agile, experimental approach in problem-solving<br>Can communicate with stakeholders across many different businesses and international teams<br>Can build multicultural teams that are highly effective<br>Highly facilitative<br>Creative and innovative problem-solver<br>Able to work collaboratively and communicate effectively with teammates, community members, vendors, and partners<br>Comfortable with ambiguity, yet driven to create order out of chaos<br>Systems thinker, with ability to understand key business drivers that contribute to operational and financial success.<br>Demonstrated desire and drive to be a recognized thought leader within the larger Self-Management or Movement-Building community. An established network and positive brand are a plus.<br>Comfortable with working in a remote-first environment<br>Up to 30% travel</p><p>Experience with startups, or working at a non-traditional corporate organization or nonprofit is preferred. &nbsp;Knowledge about blockchain &amp; Ethereum is not required, but candidates should be interested in the technologies poised to transform the way we live, and be open to learning deeply about blockchain topics.</p></div>",
    "urlFetchPending": false,
    "published": "May 18, 2018 11:41:34 AM",
    "tags": [
      "Brooklyn",
      "Building Coalitions",
      "Change Management",
      "DBG:surround``fulltim 4N remot",
      "DBG:surround``remot W OR(career,first)",
      "Full Time",
      "Operations",
      "Operations Manager",
      "Organizational Development",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "aMbPPs39Rd20lXODVVv3UA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/waggl-ui-ux-designer",
    "title": "Waggl: UI/UX Designer",
    "content": "<div>  <div>    <h2>UI/UX Designer</h2>      <h4>Posted May 16</h4>    <h3>      <span>Waggl</span><br>      <span>Headquarters: Sausalito, CA</span><br>        waggl.com      <br>      <a rel='nofollow'>View all Waggl jobs →</a>    </h3>  </div>    </div>  <div>    <div><span></span></div><div><span>Waggl is looking for an experienced UI/UX Designer to join our growing team.</span></div><div><br></div><div><span><b>How we are different</b></span></div><div><br></div><div><span>We know that as a designer you can work many places. Waggl’s work environment is unique.</span></div><div><br></div><ul><li><span>We care deeply about our work. Both the quality of what we produce and its impact.</span><br></li><li><span>We believe everyone deserves to have their voice heard from a brand new hire to the CEO. This is key to our product and our culture. We check titles at the door.</span><br></li><li><span>We trust you. You can work from home, in the office, or from an RV traveling across the country as long as you stay connected and get your work done. We trust you to take the time off you feel you need to recharge and be your best. No questions asked.</span><br></li><li><span>We improve the work lives of hundreds of thousands of people around the world.</span><br></li><li><span>We work really smart.</span><br></li><li><span>We are growing like crazy.</span><br></li><li><span>All these things and more have led us to be named as one of the Best Places to Work by Inc magazine.</span><br><br></li></ul><div><span><b>How we work</b></span></div><div><br></div><div><span>We work really hard to balance collaboration, autonomy, efficiency and high quality output. We do this through informal interactions, short daily meetings, and efficient planning meetings. Our team is made up of developers, designers and QA folks.</span></div><div><br></div><div><span><b>Where you fit in</b></span></div><div><br></div><div><span>We’re looking for a designer to be an equal voice on our product design team, coming up with effective solutions for the design challenges that we face. The designer has opinionated design skills that enables them to weigh the strengths and weakness of different approaches. They understand the role of user interaction and animation in the design process and can demonstrate it throughout. They are a self-starter who can take ideas and run with them- creating variations and iterate quickly with rapid prototyping.</span></div><div><br></div><div><span><b>Requirements</b></span></div><div><br></div><ul><li><span>3+ years of professional experience designing real-world products</span><br></li><li><span>Normal work hours are EDT, CDT, or PDT, AST (e.g. you live in North America, Central America, or South America)</span><br></li><li><span>Team player</span><br></li><li><span>Speak Fluent English (communication is critical on our team)</span><br></li></ul><div><br></div><div><span><b>Nice to have</b></span></div><div><br></div><ul><li><span>Experience with user testing environments</span><br></li><li><span>Experience with front end web dev (HTML/CSS)</span><br></li><li><span>Experience with designing business to business software</span><br></li></ul><div><br></div><div><span><b>About Waggl</b></span></div><div><br></div><div><span>Waggl (</span><a href='http://www.waggl.com' rel='nofollow'><span>www.waggl.com</span></a><span>) is the most human way for organizations to crowdsource feedback. Waggl lives at the intersection of two organizational realities: companies want to be on the pulse of their employees and employees want to know that their opinions count. Featured in WSJ, Entrepreneur, and Fast Company, Waggl is one of the leading platforms to help organizations become more agile, aligned and hyper-aware, so they can make better decisions and execute more effectively.</span></div><div><br></div><div><span>Waggl provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Waggl complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply at <a href='https://goo.gl/forms/Zt1dvbhxsAATbiUd2' rel='nofollow'>https://goo.gl/forms/Zt1dvbhxsAATbiUd2</a></p>  </div>",
    "urlFetchPending": false,
    "published": "May 16, 2018 11:01:54 PM",
    "tags": [
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=3}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ]
  },
  {
    "id": "clHaDBk2RQ2k2apj0dkQcg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30587?r=rss2",
    "title": "Optuno: Experienced Web Design Sales Representative",
    "content": "<p>Full-time</p><p><strong>(Remote)</strong> </p><p><strong>Job Description</strong></p><p>Optuno is a web design and development company that provides 100% customized, stress-free websites for businesses for a fraction of the cost of going to a web design firm. The company grew out of a desperate need for sane website development. Optuno provides a unique, stress-free and fully-managed experience for the creation, maintenance and marketing of websites.</p><p>We are looking for a seasoned sales representative with experience in website sales. You must have a proven, successful track record working in the website design and development industry and can pick up the phone to provide a consultation and make a sale without hesitation. This is a great opportunity for experienced, passionate professionals looking for a work-from-home position with a game-changing web design company.</p><p>Experience in website sales is required. Experience in digital marketing is a plus. This is a work from home, contract position that pays hourly, plus commission. The interview process will require you to make sales test calls.</p><p><strong>Key Responsibilities</strong></p><p>• Engage with prospective clients by phone to provide consultation of Optuno services and features<br>• Make cold calls, prospect and close sales over the phone<br>• Handle inbound calls from prospective clients<br>• Solicit information from clients to help them select the best plan for their business<br>• Become an expert on Optuno's services to answer questions about plans, pricing, features and troubleshoot issues prior to closing the sale<br>• Answer questions about various plans, pricing, features and troubleshoot issues prior to<br>• Log calls and notes through a basic system, set follow up tasks and communicate with supervisor<br>• Speak and act professionally<br>• Be comfortable with an ever-changing, fast paced environment<br>• Able to work remotely</p><p><strong>Requirements</strong></p><p>• Ability to follow a sales script, adjusting responses, as needed<br>• Experience in website sales<br>• Knowledge of web design and development<br>• Basic understanding of SEO<br>• Exceptional verbal and written communication skills.<br>• A can-do, positive attitude<br>• Ability to communicate professionally with an easy-to-understand approach<br>• Internet connection and intermediate computer skills<br>• Availability to work Monday through Friday, 8:30 AM- 5:00 PM, as needed based on call volume</p><p><strong>Our Values</strong></p><p>Optuno is a fast-paced environment. Here are our values. If you value these things, too, then we hope you will apply!<br>• Excellence: We strive for pixel-perfect work. Details are important.<br>• Problem-Solver: We dive in and figure things out.<br>• Zeal for Clients: This is our business. We help our clients develop websites, every step of the way, with an upbeat attitude.<br>• Honesty: We provide truth wrapped in kindness topped with a helpful approach.</p><p><strong>Compensation</strong></p><p>• $10-20/hr (depending on level of experience) + commission &amp; bonuses</p><p></p><p><strong>Job Perks:</strong> awesome team, bonuses</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "May 16, 2018 3:03:13 AM",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "9HiEnMZcQkmtu9vPQOkPJw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/69015/user-researcher-ampamp-experience-designer-at-mindwave-ventures/",
    "title": "User Researcher &amp;amp; Experience Designer",
    "content": "User Researcher & Experience Designer<br />Based Central London<br />Permanent, Full Time<br /><br />Mindwave Ventures are rethinking, reshaping and redesigning how technology is used to create impact at scale within healthcare.<br /><br />The team are seeking a UX designer with a strong background in user research to join the team full time. You will work closely with designers, users and clients to facilitate conversations and ensure the products we create are useful, usable and valuable.<br /><br />Projects you will work across may include, but are not limited to:<br /><br />•    A clinical assessment app for developing countries<br />•    A personal health record platform for mental health services<br />•    A software platform that facilitates discussions in hospital appointments<br />•    A goal-setting app for employment services<br /><br />Your responsibilities:<br /><br />You will work alongside our Lead Designer and collaborate with the team on all activities below.<br />•    Conduct user research (in-depth interviews, designing surveys, collating and presenting results)<br />•    Facilitate discovery, design and strategy workshops<br />•    Write reports to consolidate the outputs, findings and recommendations <br />•    Synthesise insights and identify user needs<br />•    Translate user needs into user stories for development<br />•    Map out user journeys and service blueprints<br />•    Create clickable prototypes for user testing<br />•    Engage with clients, presenting work to date and insights<br />•    Design and create presentations, reports, style guides and assets<br /><br /><br />Skills and experience – must haves:<br /><br />•    Confidence and experience facilitating conversations and workshops<br />•    Experience designing and conducting face to face and remote user testing <br />•    An interest in data and evidence and how to use it to improve products and processes<br />•    Experience using Adobe Creative tools such as InDesign, Illustrator and Photoshop and Sketch<br />•    Experience of creating interactive experiences for apps (mobile & tablet) and web (mobile, tablet and desktop)  <br />•    Solid understanding of UX principles <br />•    Incredible attention to detail <br />•    On top of the latest digital trends and standards, including accessibility principles<br />•    Able to work remotely as an individual as well as in a team setting <br /><br /><br />Desirable<br /><br />•    Have worked in an Agile environment<br />•    Experience across multiple user testing tools and platforms <br />•    Have used a wide variety of user research and testing methods - e.g. in-depth interviews, surveys, workshops, remote testing, analysis<br />•    Data visualisation experience is a bonus, but not a must<br /><br /><br />About us<br /><br />Mindwave Ventures are making an impact in the world of health and wellbeing by creating products and services that truly meet the needs of our users.<br /><br />We value testing and learning above all else, using good design and evidence to drive our projects forward. <br /><br />We’re an incredibly passionate and energetic team consisting of designers, researchers, project managers and developers. We work closely with clinicians and other third parties to ensure we are utilising the best brains in the biz – across a multitude of sectors. <br /><br />If you want to come and make a big change in a small place, we’d love to hear from you.<br /><br />To apply, please send us:<br /><br />• CV - showing your key skills, interests and personality<br />• Short cover letter - why is working at Mindwave right for you?<br />• Portfolio of UX and UI – showcasing a select number of projects that show your work in the field.",
    "urlFetchPending": false,
    "published": "May 15, 2018 12:48:45 PM",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``OR(abl,will,challeng,flexibl,experi,get,prefer) 2W 2N(work,remot)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/designer",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "YQz4x6CPS1awGt_3ilUQcw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/10230-experienced-telecommuting-web-designer",
    "title": "Experienced Telecommuting Web Designer!",
    "content": "Experienced Telecommuting Web&nbsp;Designer! - Jobmote<div><div><h2>Experienced Telecommuting Web&nbsp;Designer!</h2><h5>Advant Interactive</h5></div></div><div><div><div><div></div></div><div><div><div><p>We are Advant Interactive, a group of design and developer nerds. We’re a small bunch (thus far), but we have plans for world domination - or at the very least, we’d like to be in business a long, long time.</p><p>We’re located in Long Beach, just a Kobe 3-pointer from the sand, and a taxi ride from the heart of LA. We need someone who seeks a position on the cutting edge of web development. Don’t live in LA? Not a problem - we’re open to making a telecommute option work for you.</p><p><strong>IMPORTANT:</strong> Our ideal candidate has a solid background in user-centered design and experience working on a variety of e-commerce products and sites in all different kinds of fields - from selling shoes to selling legal services and everything in-between.</p><p>All candidates must work with speed and enjoy sweating over tight deadlines. They must live to design and not be satisfied until they’ve seen a project through.</p><p><strong>Who are you?</strong> The dude (or dudette) for the role should have a minimum of two years in the world of web design, with a portfolio that’s likely to blow our socks off.</p><p>Because we live in the virtual world, it does not matter where you reside, as long as you are available during business hours. Still reading?</p><p><strong>Do you have the following requirements?</strong></p><ul><li>Can WOW us with your designs.</li><li>Can create user-centered visual layouts and design elements for web and mobile applications.</li><li>Can confidently explain your design decisions in meetings with the boss and client.</li><li>Have a strong background in User Interaction and Visual Design.</li><li>Have the ability to self-motivate and self-adjust when needed.</li><li>Ability to stay up-to-date with current technology and trends.</li></ul><p><strong>And it goes without saying…</strong></p><p>You can both talk the talk and walk the walk. You have 20:20 vision when it comes to fine details. You consider missing a deadline one of the seven deadly sins.</p><p>If you’ve gotten this far, you could be just what we’re looking for!</p><p>Apply today!</p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "May 12, 2018 1:21:33 AM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(&quot;not&quot;,no,doesn't) W matter 3W OR(locat,live,resid)",
      "DBG:surround``avail 8W 2N( OR(core,busi), hour)",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "EDxvfIDiTNSGaXxiYxVuag",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30580?r=rss2",
    "title": "Advant Interactive: Experienced Telecommuting Web Designer!",
    "content": "<p>Part-time</p><p><strong>(Long Beach, CA)</strong> </p><p>We are Advant Interactive, a group of design and developer nerds. We’re a small bunch (thus far), but we have plans for world domination - or at the very least, we’d like to be in business a long, long time.</p><p><br><br>We’re located in Long Beach, just a Kobe 3-pointer from the sand, and a taxi ride from the heart of LA. We need someone who seeks a position on the cutting edge of web development. Don’t live in LA? Not a problem - we’re open to making a telecommute option work for you.</p><p><br><br><strong>IMPORTANT:</strong> Our ideal candidate has a solid background in user-centered design and experience working on a variety of e-commerce products and sites in all different kinds of fields - from selling shoes to selling legal services and everything in-between.</p><p><br><br>All candidates must work with speed and enjoy sweating over tight deadlines. They must live to design and not be satisfied until they’ve seen a project through.</p><p><br><br><strong>Who are you?</strong> The dude (or dudette) for the role should have a minimum of two years in the world of web design, with a portfolio that’s likely to blow our socks off.</p><p><br><br>Because we live in the virtual world, it does not matter where you reside, as long as you are available during business hours. Still reading?</p><p><br><br><strong>Do you have the following requirements?</strong></p><ul><li>Can WOW us with your designs.</li><li>Can create user-centered visual layouts and design elements for web and mobile applications.</li><li>Can confidently explain your design decisions in meetings with the boss and client.</li><li>Have a strong background in User Interaction and Visual Design.</li><li>Have the ability to self-motivate and self-adjust when needed.</li><li>Ability to stay up-to-date with current technology and trends.</li></ul><p><strong>And it goes without saying…</strong></p><p><br><br>You can both talk the talk and walk the walk. You have 20:20 vision when it comes to fine details. You consider missing a deadline one of the seven deadly sins.</p><p><br><br>If you’ve gotten this far, you could be just what we’re looking for!</p><p><br><br>Apply today!</p><p></p><p><strong>Job Perks:</strong> Work remotely!Be a part of our EPIC team!</p><p><strong>Apply:</strong> 1. Send us links to your best work online.2. Let us know your location.3. Please indicate your freelance hourly rate.4. Provide your current availability.</p>",
    "urlFetchPending": false,
    "published": "May 12, 2018 12:58:03 AM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(&quot;not&quot;,no,doesn't) W matter 3W OR(locat,live,resid)",
      "DBG:surround``avail 8W 2N( OR(core,busi), hour)",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "UJf84_1TRdCFqWe66nHvgA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/help-scout-senior-product-designer",
    "title": "Help Scout: Senior Product Designer",
    "content": "<div>  <div>    <h2>Senior Product Designer</h2>      <h4>Posted May 11</h4>    <h3>      <span>Help Scout</span><br>      <span>Headquarters: remote</span><br>        <a href='http://www.helpscout.com/careers' rel='nofollow'>www.helpscout.com/careers</a>      <br>      <a rel='nofollow'>View all Help Scout jobs →</a>    </h3>  </div>    </div>  <div>    <div>Hello, there.</div><div><br></div><div>We’re Help Scout. A company you’ve maybe heard of before, or maybe not, but either way you’ve landed on this page because you were at least a little curious, and we like that about you. We spend our time making it easier for SMBs to talk with their customers. Today Help Scout is used by more than 8,000 businesses in 140 countries.</div><div><br></div><div>We’re looking for someone who’s really smart, and humble, and thorough, and meticulous, and self-motivated, and kind, and a little funny, and tenacious, and did I say self-motivated? Well, that’s because we’re a remote company! Being remote is fantastic, it’s empowering, and it’s perfect for people who like to be their own boss and push themselves to be at their very best every day.</div><div><br></div><div>That’s where you come in. As a Product Designer at Help Scout, you’ll spend your days creating tools that our customers use to deliver a great experience. Smiles on faces — if that’s your jam, we’d love to meet you.</div><div><h4>About the role:</h4></div><ul><li>You’ll be the sixth member of the Help Scout design team. We work remotely from places like New York, Sydney, Ireland and Nashville. You can work from wherever you please as long as you have 4+ hours of overlap with EDT (US East Coast).</li><li>We’ll ask you to own the entire design process. For a new project, you’ll be given a brief and will partner with Product to do User/Customer research. You’ll be doing the wireframes, prototyping, visual design, interaction design, and will partner with engineers to get the implementation juuuuuust right.</li><li>You’ll be embedded on a couple cross-functional teams with one product lead, one QA, and 2-5 engineers depending on the project. You’ll work hand-in-hand with your teammates to ship your best work to our customers.</li><li>Although each designer is embedded on different teams, it’s important that everyone makes each other better. Over Slack, video chats, and design docs, you’ll provide guidance and critical feedback on other work outside of your purview. You’ll also get that sort of support from your teammates on your projects.</li><li>You will have the freedom to pioneer your own discovery phase and find ways to improve our product. You’ll find that we’re passionate about putting in the work to constantly improve on the things we’ve made.</li><li>The role says “Senior” but we do not delineate between junior and senior designers on the team. We’re looking for senior-level skill and experience in every role at Help Scout, partially because it works better in a remote culture.</li></ul><div><h4>About you:</h4></div><ul><li>Your passion is to work on large-scale software a lot of people use, but to be given ownership of the project from concept to completion. The design challenges are complex, and the work has a bunch of constraints. Despite the difficulty, this is the work you love most.</li><li>We all love a good pattern library and pixel-perfect design, but you prefer to get involved in a project way before then. For you, it starts with sketches, wireframes and a keen understanding of the problem from all angles.</li><li>You’re very thorough and detail-oriented. You don’t get tired of solving a problem and iterating on the solution, even after a few months of working towards the best experience.</li><li>You’re humble, yet opinionated about what makes a great product experience. You leverage your skills and expertise to help others and make the people around you better at their craft.</li><li>You have more than a few years of design experience, and you’ve grown so much that you cringe when you look back at your early work.</li><li>You can simplify complex problems and clearly articulate your thought process to others in writing. This is especially important in a remote culture like ours.</li><li>You collaborate well and communicate early and often. You explain your work by extrapolating on everything from your inklings and curiosities, to the rationale behind final your decisions.</li><li>You actively seek critical feedback. As a matter of fact, you can’t get enough of it, because you know that your work only gets better when your team puts their eyes on it.</li><li>You have strong taste, and your eye for visual design is as strong as your ability to dream up exceptional customer experiences.</li><li>You prefer to collaborate directly with developers and product stakeholders, carefully considering the tension between business and customer needs.</li><li>When it comes to understanding a problem, you have no hesitation in setting up customer interviews, doing usability testing, or conducting a survey.</li><li>This isn’t an absolute requirement, but strong HTML and CSS skills will likely make you a more successful product designer at Help Scout. If you can write JavaScript, it’s all the better, but we won’t ask you to write production code.</li></ul><div><h4>Who you'll work with</h4></div><ul><li><a href='https://www.linkedin.com/in/lindaeliasen/' rel='nofollow'>Linda Eliasen</a>, Design Team Lead - You’ll be reporting to Linda. She’s been a designer like you, for companies like Mailchimp, Dropbox and Squarespace.</li><li>Design team -<a href='http://seanhalpin.io/' rel='nofollow'>Sean</a>,<a href='https://www.linkedin.com/in/wjaredmcdaniel/' rel='nofollow'>Jared</a>(co-founder),<a href='https://buzzusborne.com/' rel='nofollow'>Buzz</a>and<a href='http://anthonyjones.me/' rel='nofollow'>Tony</a>can’t wait to meet you!</li><li><a href='https://www.linkedin.com/in/benderson/' rel='nofollow'>Ben Henderson</a>, Director of Product - You’ll work with Ben and any other Product leads to craft specs and see projects through to completion. He ran Product at Campaign Monitor, and before that ran a client agency for eight years.</li><li><a href='https://www.linkedin.com/in/nickfrancis1/' rel='nofollow'>Nick Francis</a>, CEO - Nick is still very hands-on with the product and design process. On some projects you’ll work directly with him to create something.</li></ul><div><h4>Benefits</h4></div><ul><li><span>Competitive Salary</span>- We pay at or above market salary in most cases and evaluate a lot of research to make sure everyone is paid well. The formula we use to calculate all salaries is public to employees and is improved upon regularly.</li><li><span>Health and dental insurance</span>- We cover you and your family's health/dental insurance 100%. If you are based in the US, we'll cover you on our Aetna policy. If you're based outside the US, we offer a healthcare stipend.</li><li><span>Long-term/Short-term Disability Insurance &amp; Life Insurance</span>- We cover 100% of the premiums for LT/ST Disability insurance and base Life Insurance. You also have the option to purchase supplementary life insurance through our provider. (currently US only)</li><li><span>Flexible vacation</span>- Take time off when you need it, we trust you.</li><li><span>Paid parental leave, including adoption and foster care</span>- 12 weeks for primary caretaker and 4 weeks for secondary caretaker.</li><li><span>401k with 1% match</span>- via Betterment for Business (currently US only)</li><li><span>Personal Development stipend</span>- Up to $1,800 per year to improve your craft</li><li><span>Great tools</span>- Each employee will be provided with a Mac laptop and 27'' display (or equivalent equipment of choice).</li><li><span>Home Office Stipend</span>- You'll also receive $1,000 to spend on outfitting your home office, as well as up to $350 a month to rent a co-working space if you like.</li><li><span>Company Retreats</span>- Twice a year, we get together to meet and work in person, covered by Help Scout.</li><li><span>Complete transparency</span>- Everyone has full access to business metrics and financial information about the company.</li></ul><div><span>About Us</span></div><div><br></div><div>Help Scout is made by roughly 70 people in 40+ cities around the world, all with a passion for excellence in their craft.</div><div><br></div><div>We come from diverse backgrounds and are united by an enthusiasm for great products and delightful customer experiences.</div><div><br></div><div>Since launching in April of 2011, Help Scout now powers 8,000+ support teams in over 140 countries. Our<a href='https://www.helpscout.net/' rel='nofollow'>software</a>is used and trusted by businesses of every shape and size.</div><div><br></div><div><span>Designed to go the distance</span></div><div><br></div><div>Our mission is to foster the world’s customer-centric businesses by providing tools that serve customers in the most human, helpful way. While growth is important, team and values are paramount. We’re always striving to do impactful work we’re proud of in lieu of chasing overnight success.</div><div><br></div><div><span>We’re builders without borders</span></div><div><br></div><div>Our entire team is free to work remotely from wherever they choose. We overcome remote challenges through transparency, trust, and video conferencing. The reward is worth the effort—we’ll take talent, skill, and diverse perspectives over local geography any day.</div><div><br></div><div>Above all, we want Help Scout to be a place where passionate people can do their very best work. You won’t find any ping-pong tables or kegerators here. Instead, you’ll be surrounded by driven, supportive teammates who will push you to be better. We take work/life harmony seriously, too, as we want every career at Help Scout to be a long and satisfying one.</div><div><br></div><div><span>Diversity &amp; Inclusion</span></div><div>We are an equal opportunity employer and are committed to building a company that embraces and celebrates<a href='https://www.helpscout.net/blog/diversity-inclusion/' rel='nofollow'>diversity and inclusion</a>. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, or disability status.</div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://jobs.lever.co/helpscout/d6b8ecfc-ff62-4be0-82f3-f0945709bfdc' rel='nofollow'>https://jobs.lever.co/helpscout/d6b8ecfc-ff62-4be0-82f3-f0945709bfdc</a></p>  </div>",
    "urlFetchPending": false,
    "published": "May 11, 2018 11:29:23 PM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG:surround``headquart 3N remot",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:embedded/c/2",
      "DBG_TECH1:k/t/w:embedded/embedded/16",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:macos/apple/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=2, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=2, java=0, gamedev=0, php=0, embedded=16, frontend=4}",
      "REMOTE1/100",
      "TECH1/embedded",
      "TITLE1/designer",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "embedded"
    ]
  },
  {
    "id": "pFXffC_-TtuMvjaF2ryVBw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/britecore-mid-level-ui-ux-designer",
    "title": "BriteCore: Mid-Level UI/UX Designer",
    "content": "<div>  <div>    <h2>Mid-Level UI/UX Designer</h2>      <h4>Posted May 10</h4>    <h3>      <span>BriteCore</span><br>      <span>Headquarters: Springfield, MO</span><br>        <a href='https://jobs.lever.co/britecore.com/85550062-7223-4ee3-b8d2-0188d5977d23' rel='nofollow'>https://jobs.lever.co/britecore.com/85550062-7223-4ee3-b8d2-0188d5977d23</a>      <br>      <a rel='nofollow'>View all BriteCore jobs →</a>    </h3>  </div>    </div>  <div>    <div><span>We are hiring for a mid-level UI/UX designer who is able to help us take complex workflows and distill them into a thoughtful experience for people using our app.</span></div><div><br></div><div><span>This position is on our growing design team, which works closely with our development teams as part of an iterative design process. You would have an important role in helping us redesign key parts of our app UI, and would also be part of an overall effort to create and standardize our design system. We're also looking for someone to help us grow as a team and solidify our design processes.</span><b><strong></strong></b></div><div><br></div><div><b><strong>The kind of work we do</strong></b><b><br></b></div><div><span>BriteCore is essentially a CMS for insurance companies. They use it to manage all aspects of their business, including tracking policies, managing contacts and handling claims.</span></div><div><br></div><div><span>This means our users typically see our app more as a business tool like Microsoft Word or Google Sheets than a website (even though it is completely a web-based app). They also are using BriteCore for several hours every day, and are concerned with doing things quickly and efficiently. This, along with the complicated nature of insurance, means we deal with some complex workflows, and try to set ourselves apart from our competitors with a smooth UX that helps them navigate these tough processes.</span></div><div><br></div><div><b><strong>What you might be doing</strong></b><br></div><div></div><div></div><div></div><div><span>We’re looking for a team member who thinks critically about user experience, and is able to see it through with a polished interface. This means you might do things like:</span><br></div><div></div><div></div><div></div><div></div><ul><li>Ask in-depth questions to understand a process, and back up decisions with research and user tests<br></li><li>Iterate on designs using a variety of techniques, such as sketches, workflow diagrams and high-fidelity mockups<br></li><li>Create an aesthetically pleasing, on brand UI for a new or existing component in our design system</li></ul><div><br></div><div><b>What it's like to work here</b><br></div><div></div><div></div><div></div><div><span>BriteCore is a remote-first company — even employees who live in our home city of Springfield, MO usually work from home! And most of the people you will work with are scattered across the US and the globe. This means that remote team members are just as much part of the company as local employees. We also allow a lot of flexibility in terms of time off. In return, we expect all of our employees to be productive and accountable, which means you'll work alongside a great, dedicated team.</span><br></div><div></div><div></div><div></div><div></div><div><span><br></span></div><div><b><strong>Requirements &amp; Responsibilities</strong></b><br></div><div></div><ul><li>Several years of experience in the field is preferred<br></li><li>Ability to create effective and beautiful interfaces that solve our user's problems<br></li><li>Iterate and improve on existing parts of the app<br></li><li>Inform design decisions with data, user testing<br></li><li>Communicate clearly<br></li><li>Welcome feedback and collaboration<br></li><li>Be friendly, confident, and patient with others<br></li><li>Self-direct<br></li><li>Stay up on industry best practices and trends</li></ul><div><br></div><div><b><strong>Technology We Use</strong><br></b></div><ul></ul><div></div><ul><li>Sketch, Balsamiq, or other wireframing tools<br></li><li>Invision<br></li><li>Adobe Creative Suite</li></ul><div><br></div><div><span>Coding Experience is very helpful, but not required:</span><br></div><div></div><div></div><div></div><div></div><ul><li>HTML5<br></li><li>SCSS, PostCSS<br></li><li>GitHub<br></li><li>Command Line</li></ul><div><br></div><div><b><strong>Benefits and Compensation</strong><br></b></div><ul><li>$45k-$80k based on experience and proven performance<br></li><li>Benefit from working alongside and observing a team of world-class engineers and designers<br></li><li>Comprehensive health insurance coverage including medical, dental, and vision<br></li><li>Flexible schedule<br></li><li>Relaxed work environment<br></li><li>Remote work<br></li><li>Flexible learning time — explore your ideas and new technologies on the clock<br></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>See the full description and apply here:<a href='https://jobs.lever.co/britecore.com/85550062-7223-4ee3-b8d2-0188d5977d23' rel='nofollow'>https://jobs.lever.co/britecore.com/85550062-7223-4ee3-b8d2-0188d5977d23</a></p>  </div>",
    "urlFetchPending": false,
    "published": "May 10, 2018 8:53:35 PM",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot W OR(career,first)",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:sass/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=10}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "WRqgwEUhS_q8VuwDVO2SIg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/68909/website-designer-amp-developer-at-level-5/",
    "title": "Website Designer &amp; Developer",
    "content": "<br /><br />We are an agile application development company.<br /><br />Currently I am on the look out for a designer/developer with the following skills:<br /><br />- PHP 7<br />- Zend Framework (2/3)<br />- Symfony<br />- Doctrine2<br />- Gulp/SASS/LESS<br />- Github<br />- Agile Development (optional)<br />- AWS<br /><br />This is not a full 5 day a week role, but potentially could lead into it.  This is ideally for those who have their own projects to work on, but also have capacity for more work!<br /><br />We require a range of skills, and tasks will never be the same! It's an interesting job... seriously!<br /><br />Get in touch - working on site is a must (but can work remotely to).  You must live in Medway/Kent.",
    "urlFetchPending": false,
    "published": "May 10, 2018 5:28:17 PM",
    "tags": [
      "DBG:surround``can 2W remot",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:php-7/php/8",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:sass/frontend/5",
      "DBG_TECH1:k/t/w:symfony/php/8",
      "DBG_TECH1:k/t/w:zend-framework/php/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=29, embedded=0, frontend=10}",
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "7YXnJhYBQ5iOCx1ZEIaJfg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/9621-telecommute-ux-ui-virtual-reality-designer",
    "title": "Telecommute UX UI Virtual Reality Designer",
    "content": "Telecommute UX UI Virtual Reality Designer - Jobmote<div><div><h2>Telecommute UX UI Virtual Reality Designer</h2><h5>SweetRush Inc.</h5></div></div><div><div><div><div></div></div><div><div><div><p>A provider of e-learning and content creation solutions has an open position for a Telecommute UX UI Virtual Reality Designer. </p><p>Core Responsibilities Include:<br>Designing and wire framing UI/UX elements for virtual reality applications<br>Implementing 2D interfaces such as launchers and 3D interfaces for use while in VR<br>Qualifications for this position include: </p><p>Works in Sketch<br>Familiar with coding, comfortable opening up a development solution and understanding how it works<br>Has a strong digital portfolio showcasing mobile apps or similar designs<br>3-5 years of experience in similar roles<br>Advanced written and conversational English skills<br>Excited about the future of immersive technologies such as AR and VR </p></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "May 7, 2018 10:22:52 AM",
    "tags": [
      "DBG:surround``3N(telecommut, posit) NOT fulltim",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "yXO0uH1HT32xWfC6D_4j6g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/68773/graphic-design-talent-at-kurv-music/",
    "title": "Graphic Design Talent",
    "content": "About: Kurv is a wearable touch controller that fits into the palm of your hands detecting motion, gesture and pressure to feel your intentions.<br /><br />Our mission: Creating the next generation of touch computer interfaces.<br /><br />Opportunity: Chanel your passion into a career….<br />This is a great opportunity to gain experience working within small high calibre team, to develop your skills and see your work to fruition. You will assist the founders layout the creative vision of the company. Working alongside our engineers, and musicians help design and define the look and feel of the brand.<br /><br />Behind every great brand, is a team of great people. Are you one of them?<br />We are seeking a high-caliber individual with a passion for music, technology, and human centred design.<br /><br />What’s involved: The position requires a person who in self-motivated, fearless, persistent and curious to learning new things.<br /><br />What we are looking for….<br />– Fluent in Adobe Suite; Photoshop, Illustrator and other<br />– Photography & Video; Amateur or professional level<br />– Experience in Webflow; preferred but not necessary<br />– Familiar with Apple design guidelines<br />– Final Cut Pro; preferred but not necessary<br />– Relevant undergraduate or post-graduate degree<br />– Technology savvy<br /><br />Choose a job you love, and you will never have to work a day in your life. Are you a Match?<br />If so show us your passion and demonstrate what you feel you can bring to Kurv by submitting your application today by emailing your CV, cover letter and online portfolio or URL<br /><br />Career prospects: Big jobs usually go to those who prove their ability to outgrow small ones.<br /><br />Financial rewards are based on results: The harder I work, the luckier I get!<br />We are a startup so budget is limited. Our position is suitable for a junior designer.<br /><br />Length: 1 Months +<br /><br />Location: Central London. Flexible<br /><br />Hours: No divas as there are eight hours of hard work for every two minutes of glamour. Flexible daily or when ever the task at hand is finished.<br /><br />Availability: We are working on a tight deadline. Candidate is required to be able to start immediately and dedicate a significant amount of time to the project.<br /><br />Curious find out more and follow us:<br />kurvguitar.com<br />twitter.com/kurvguitar<br />facebook.com/kurvguitar<br />kickstarter.com/projects/1570728111/",
    "urlFetchPending": false,
    "published": "May 5, 2018 8:03:36 PM",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/designer",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "RZSUg5L-T-Wh--rWg8LPWg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/68701/mobile-uiux-designer-at-argent-blockchain-browser/",
    "title": "Mobile UI/UX designer",
    "content": "*About Argent*<br />Argent is led by experienced entrepreneurs and funded by some of the best VCs in the world.<br /><br />Blockchain technology will lead to global, transparent and accessible financial and consumer services. Our mission is to give millions of users access to this new, decentralized web.<br /><br />*Create delight*<br />At Argent, we live and breathe products that people love. Everything we create should be simple, but beautiful. Instinctive, yet surprising.<br /><br />Like we’ve read your mind.<br /><br />*Autonomy, Mastery and Purpose*<br />You will be joining a highly experienced, fast-moving and collaborative team.<br /><br />We work in a very open, visible way. We trust each other, and value input from every other discipline in the team. And we seek insight from our users constantly.<br /><br />*Change the world*<br />The decentralised web is evolving rapidly. The impact this will have is hard to comprehend right now. But it could be even bigger than the original internet was.<br /><br />Getting involved so early means you will be at the forefront of this change. You will be shaping the future for millions, possibly billions of people.<br /><br />*The role*<br />We are looking for a user-centred Interaction Designer. You will have strong typographic, illustrative and motion design skills.<br /><br />You have a passion for mobile consumer products and a strong interest in blockchain technologies.<br /><br />You seek input early and often. You work openly and have a love of crafting delightful, playful interactions. We use Figma for prototyping, because it is open and live by default.<br /><br />*UI Designer requirements are:*<br />2+ years' experience of working on native mobile app UIs<br />Profound UI design skills with a solid portfolio of design projects. This must include examples of interactive motion design.<br />Confident externalising thoughts and ideas on paper / whiteboards etc. We will be collaborating a lot and seek an effective communicator.<br />Preferably some experience with HTML, CSS, and JavaScript for rapid prototyping.<br />Strong visual design skills with good understanding of user-system interaction<br />Strong presentational and team player abilities<br />Strong problem-solving skills with creative approach<br />Experience of working in an Agile/Scrum development process<br />BA or MA in Human-Computer Interaction, Interaction Design, animation or other related area<br />How we work ?<br />As a distributed team, we’re not too bothered by when and where you work. That said, you will need to be able to come to London at least 2 days a week to start with.",
    "urlFetchPending": false,
    "published": "May 3, 2018 4:06:29 PM",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:animation/gamedev/8",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=4}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ]
  },
  {
    "id": "_e4dg0PGS0iMfkNUneoLcg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16981844",
    "title": "Beaver Digital | Designers / Illustrators / JS Devs | Full-time/Part-time | Seattle | Remote or onsite | www.beaver.digital",
    "content": "<div>                  <span>Beaver Digital | Designers / Illustrators / JS Devs | Full-time/Part-time | Seattle | Remote or onsite | www.beaver.digital<p>We make excellent, high quality home pages that companies love. We are looking for illustrators and/or front-end people who are available for full or part time work.</p><p>Send me an email nikkwong0 at gmail<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "May 3, 2018 1:51:06 AM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "x6fm5yUWQI2RF-swIIrYzw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30552?r=rss2",
    "title": "NewCity: Senior Designer",
    "content": "<p>Full-time</p><p><strong>(Blacksburg, VA strongly preferred, but remote possible for perfect fit)</strong> </p><p><a href='https://www.insidenewcity.com/' rel='nofollow'>NewCity</a>, a digital agency in Blacksburg, Virginia, is looking for a Senior Designer to join our team. You will work daily with our design and development staff, as well as our clients, to bring new ideas to life.<strong></strong></p><h2><strong>The Company</strong></h2><p>NewCity is a 23-year-old, 25-person firm, working in a highly collaborative, low-ego environment to create digital experiences for the real world. We ask big questions, dream big dreams, but at the end of the day we build things that work. Our culture is can-do, roll-up-your-sleeves, I’ve got your back and you’ve got mine. We’re constantly learning, experimenting and reinventing NewCity.</p><p>We’re organized around seven key disciplines: user experience, visual design, content strategy, front-end and back-end development, digital marketing and analytics, project management and business development. Our project teams are made of people from each discipline.</p><h2>The Job</h2><p>As a Senior Designer at NewCity, you will</p><ul><li>inspire clients as you explore how their brand will shine in digital, occasionally developing new brand identities in the process.</li><li>take ownership of the design process from concept and design to presentation and delivery, working directly with clients and on 2 to 4 project teams at a time.</li><li>manage and mentor junior designers.</li><li>play an integral role in moving NewCity's creative approach forward.</li><li>periodically participate in sales pitches to prospective clients.</li><li>travel occasionally to work on-site directly with clients, usually not longer than 2-3 days at a time.</li></ul><p>This is s full-time position. Preference will be given to applicants available to work at our office in Blacksburg, Virginia. We are open to considering full-time remote for candidates with successful experience as a remote team member and the references to prove it.</p><p>We offer competitive salaries and a comprehensive benefits package.</p><h2><strong>You</strong></h2><ul><li>You have 5+ years experience creating gorgeous, brand-driven, human-centered design for responsive web and mobile and an online portfolio that reflects your awesomeness.</li><li>You are proactive by nature and possess strong communication, collaboration, research, problem-solving and presentation skills.</li><li>You present design ideas clearly and effectively with insightful rationale.</li><li>You’ve got a solid understanding of how production and programming requirements affect your design. Knowing the opportunities and constraints of CSS, HTML and CMS platforms is fundamental in creating successful design solutions for our clients. Knowing how to collaboratively communicate your vision to developers is key to ensuring the quality of the final product.</li><li>You have a hunger to learn more and do things better. You're not afraid to break things or shift your assumptions in order to grow and excel, and love sharing what you've learned to help others do the same. We win together.</li><li>You use Sketch daily and maintain expert muscle-memory of Adobe Creative Suite to wield whenever necessary. Experience in logo design and brand systems, app design, prototyping (Principle, Figma, Framer, etc.) and familiarity with design systems are a big plus.</li></ul><h2><strong>The Clients</strong></h2><p>If you <a href='https://www.insidenewcity.com/work' rel='nofollow'>review our portfolio</a>, you’ll see a lot of work in higher education. It represents about 70% of our work each year. We love working with colleges and universities. It’s a dynamic, constantly changing space that always presents fresh challenges. The rest of our work is mainly with non-profits and B2B corporations. Roughly half our work each year is with repeat clients.</p><p>Our clients say there’s nothing cookie-cutter in our portfolio. They say we capture the unique DNA of their brand. That’s huge for us. You’ll be instrumental in helping us continue to do that.</p><h2><strong>Equal Opportunity</strong></h2><p>Equal Employment Opportunity has been, and will continue to be, a fundamental principle of NewCity. &nbsp;As an equal opportunity employer, employment is based upon personal capabilities, qualifications and performance. NewCity does not discriminate on the basis of race, color, religion, sex, sexual orientation, age, national origin, disability or any other legally protected status.</p><p>We’re eager to bring more people onto our team who make us richer with their differences. Our industry has historically seen lower participation from minorities, but it’s something we want to help change.</p><p></p><p><strong>Apply:</strong> If this sounds both challenging and fun to you, please apply on our website with your resume, cover letter, and portfolio. Indicate whether or not you are open to relocation in your cover letter. No phone calls please.</p>",
    "urlFetchPending": false,
    "published": "May 2, 2018 8:50:05 PM",
    "tags": [
      "DBG:surround``2N( OR(feasibl,OR(consid,consider),occas,possibl), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=3}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "pPn8FgLvR4WmtEoSlbY-PQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16978237",
    "title": "Stealth startup | Ruby (RoR), iOS (mostly swift), Android, graphic or UI/UX designer, or PM | Silicon Valley + remote (we're ...",
    "content": "<div>                  <span>Stealth startup | Ruby (RoR), iOS (mostly swift), Android, graphic or UI/UX designer, or PM | Silicon Valley + remote (we're flexible) | Full-time only | Competitive salaries depending on role, experience, and location (ranging $50k - $160k)<p>We are a stealth company, with millions in seed funding, founded by serial entrepreneurs looking to crack open the unyielding world of real estate and homeownership. This unique industry is riddled with extreme fragmentation and is plagued by a sea of uninspired product offerings. We're a team of seasoned operators and developers that loves to move fast and laughs in the face of nasty-hairy challenges that lie in our path. Home base for us is in the Silicon Valley but we have a team that spans eight countries. So whether you're in bay area, thinking of moving to SV, or are happy where you're at, we'd love to hear from you.</p><p>The most important thing we're looking for is a hunger to change the world. If you're an audacious soul looking to tackle one of the biggest problems that plagues our society today and yearning to join an experienced team at the ground floor, then hit us up!</p><p>We have a bias towards developers and PMs with a few years of experience, but if you're especially intrigued and self-motivated, then let us know anyways. Let's chat!</p><p>Email your resume and (optional) references/code samples to us at jobs &lt;at&gt; zilly.email<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "May 2, 2018 7:01:06 PM",
    "tags": [
      "DBG:surround``home W base",
      "DBG_TECH1:k/t/w:android/java/2",
      "DBG_TECH1:k/t/w:android/mobile/4",
      "DBG_TECH1:k/t/w:ios/apple/4",
      "DBG_TECH1:k/t/w:ios/mobile/4",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/16",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:k/t/w:swift/apple/10",
      "DBG_TECH1:k/t/w:swift/mobile/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=24, go=0, nodejs=0, bigdata-ml=0, ruby=20, apple=14, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/mobile",
      "TECH1/ruby",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile",
      "ruby"
    ]
  },
  {
    "id": "8bD8KR7MTaSO-SNH4NAoYA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/68595/contract-web-designer-amp-developer-at-geckoboard/",
    "title": "Contract Web Designer &amp; Developer",
    "content": "Geckoboard is a growing product company on a mission — we’re transforming the way businesses work by helping them make use of their data. We make it easy for our customers to create beautiful TV dashboards showing their most important business metrics.<br /><br />To better communicate this message, we’re looking for a Web Designer and Developer to help us make some changes to our website. You’ll be designing and building a number of new landing pages to explain the benefits of Geckoboard for different job functions and integration types. These pages will be persuasive, informative and bundled with visual appeal, but most importantly, deliver a fantastic user experience.<br /><br />*Based in our London office*, you’ll be joining our team for an initial *one-month contract*, with a possible extension to two-months. <br /><br />*You will be:*<br />* Working alongside our Creative Copywriter and a Project Manager to design and build landing pages that deliver an exceptional user experience and convert our users.<br />* Owning the process through: mockups, design, layout and build.<br />* Taking onboard feedback and discovering the best solutions that balance user experience, visual design, communicating Geckoboard’s message effectively and converting users.<br />* Working in an iterative process where we ship, test and refine.<br /><br />*You should apply if:*<br />* You enjoy designing and building attractive landing pages that deliver a fantastic user experience and convert users!<br />* You’re more than comfortable with HTML, CSS, and ideally Sass and Bourbon.<br />* You’re familiar with Siteleaf, Jekyll, or any other CMS that uses the Liquid templating language.<br /><br />*Bonus points:* <br />* Javascript experience.<br />* Experience creating icons and illustrations.<br /><br />*Please be sure to include your portfolio and examples of your past work in your application.*<br /><br /><br /><br />The Geckoboard Story<br /><br />Thousands of businesses use Geckoboard to build live TV Dashboards that focus teams on what matters. We take the complexity out of connecting data and make it simple for anyone to understand key metrics at a glance. We have pre-built integrations with 60+ tools including Google Analytics, Salesforce, Zendesk, Intercom and Google Sheets and our customers include Marketo, Slack, and Skyscanner.<br /><br />In our mission to make data useful, our growing team of 40+ is headquartered in London and span across eight time zones - from Mumbai to London, San Francisco to Hawaii and more. We're always looking for people with diverse backgrounds who bring unique perspectives and skills to join our team and in return we constantly strive to ensure that we offer the most encouraging, inclusive, and efficient environment possible.<br /><br />We don't just pay lip service to work-life balance, we actively and strongly encourage it. Flexible working hours and the ability to regularly work from home lets you work in a way that fits you and your family. We see our contractual obligation to offer 25 days of paid holiday as a minimum for everyone in the organisation, not a limit.<br /><br />We actively contribute to professional development, courses, conferences, and books. Our Engineering & Product team also run fortnightly &quot;Innovation Wednesdays&quot;, where everyone has complete freedom to work on anything that interests them, from contributing to open source, to learning a new skill, or improving our internal tools and processes.<br /><br />And, don’t take our word for it, see what the team say about the projects they work on: &quot;https://medium.com/geckoboard-under-the-hood&quot;:https://medium.com/geckoboard-under-the-hood and their experience of working with us on Glassdoor: &quot;https://www.glassdoor.co.uk/Reviews/Geckoboard-Reviews-E878996.htm&quot;:https://www.glassdoor.co.uk/Reviews/Geckoboard-Reviews-E878996.htm. You can also read more about our values and benefits on our Careers page at &quot;https://www.geckoboard.com/careers/&quot;:https://www.geckoboard.com/careers/.",
    "urlFetchPending": false,
    "published": "May 1, 2018 12:52:42 PM",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:k/t/w:sass/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=14}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "SsnCx7VpStiQSSmNow9HAg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30544?r=rss2",
    "title": "Float: Product Designer",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><p>We're looking to hire our first dedicated Product Designer to deliver simple, thoughtful, features and functionality for our customers.</p><p>To achieve this you’ll:</p><ul><li><strong>Gather the right information:</strong> Conduct user interviews, surveys and analyze internal data to inform and validate product ideas.</li><li><strong>Draft user flows and visual designs:</strong> Using tools like Sketch and InVision, you’ll define solutions for internal and customer review.</li><li><strong>Lead projects from start to finish:</strong> You’ll project manage features from concept through to launch, managing team sprints, work prioritization and grooming backlogs.</li><li><strong>Participate in product strategy discussions:</strong> You’ll collaborate with our team to define the product roadmaps.</li><li><strong>Provide launch support:</strong> You’ll work closely with our Customer Success team to educate and deliver assets to support new features.</li></ul><p>This is a 100% remote role. You’ll report directly to our CEO, who is based in Melbourne, Australia.</p><p><strong><br>About You</strong></p><p>You're a great communicator, a talented writer, naturally curious and confident. You have experience working with modern, web-based, desktop-first applications. SaaS &amp; mobile B2B experience a bonus.</p><p>You have demonstratable experience with:</p><ul><li>Conducting user interviews, surveys and various forms of data collection.</li><li>Developing briefs and functional specifications to communicate proposed features.</li><li>Designing users flows and prototyping solutions in tools such as Sketch and InVision.</li><li>Delivering end-to-end features and improvements for applications.</li><li>Managing scope through sprint-based, iterative development.</li></ul><p>You're not a programmer, but you do have a high-level understanding of web-based technologies, their constraints and opportunities.</p><p><strong><br>About Us</strong></p><p>We're the leading resource scheduling application for agencies, studios and firms. Since 2012, we've been helping teams in more than 150 countries keep track of who’s working on what and when including NASA, Vice, Buzzfeed and RGA.</p><p>We’re profitable and 100% funded by our customers. Our team of twelve includes members in Australia, New York, Dallas, Cleveland, Portugal and Ukraine. We encourage people of different backgrounds, perspectives and locations to enhance our team and deliver their best work.</p><p>www.float.com</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Apr 26, 2018 11:40:01 AM",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR( australia, japan, newzealand)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/Asia"
    ],
    "tagsNames1": [
      "Asia time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "24wuuEE8S3SWOY04OrEMMA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/cartoonmango/jobs/113204-ux-designer",
    "title": "UX Designer",
    "content": "<div><h2>UX Designer at Cartoon Mango </h2><div>Bengaluru, Remote · Full Time</div></div><div><div>Skills</div><div>User Experience Design</div><div>Compensation</div><div>₹300K–₹800K<br>No Equity</div></div><h3>Job Description</h3><div><p>Experience : 1+ Years</p><p>Qualification : Should have certification/degree/diploma in Interaction design, User Experience Design, New media design, Communication Design or related design field·<br>Software Skills : Adept in the usage of Sketch, Illustrator, Photoshop or any other tool required to ship out wireframes, high fidelity mockups and User-centered design prototyping.<br>Portfolio to accompany resume </p><p>We are looking an an experience focused designer with the following qualities <br>Strong conceptual, creative and visual skills with the ability to explain design rationale <br>Skilled in User research, Collaborating on user experience planning with consumer focus groups and making understanding user flows<br>Exceptional production value and attention to detail for user experience and Designs <br>Empathy for products, applications and consumers/end users.<br>Overall responsibility for understanding the brief and converting that into appealing, highly usable user-centric design interfaces, task flows, screen designs and interaction models. <br>Develops understanding of the end users of the application through secondary and primary research (user interviews, research data) and thus capable of low fidelity prototypes. Presents high fidelity designs/mock-ups. <br>Prior UXD experience for Mobile and Web applications <br>Ability to collaborate with the development and UI team to evolve design<br>Understanding of web and mobile applications design patterns <br>Executing interaction design and contributing to  visual design as a part of a multi-disciplinary team <br>Flexible, versatile and able to lead and handle multiple projects and be able to take end to end responsibility for projects including interacting with the clients<br>Self driven and passionate about everything new happening in the design field globally, technology trends</p></div>",
    "urlFetchPending": false,
    "published": "Apr 25, 2018 5:47:01 PM",
    "tags": [
      "Bengaluru",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown",
      "UI/UX Designer",
      "User Experience Design"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "sGWcse3NTCanQeyBUJGI_Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/mobalytics/jobs/143066-senior-product-designer",
    "title": "Senior Product Designer",
    "content": "<div><h2>Senior Product Designer at Mobalytics</h2><div>Earth, Santa Monica, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Rapid Prototyping, UI/UX Design, Attention to Detail, Video Games, User Behavior Analysis, Product Design</div><div>Compensation</div><div>$80K–$120K<br>0.1%–0.5%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>We’re looking for an incredible UX designer with interaction and visual design skills to join us on a quest in helping all players get better and unlock their potential. You’ll have the chance to work on a personal performance analytics platform for gamers that is the first of its kind in a booming eSports industry that’s been growing exponentially for years.</p><p>This means the chance to improve the gaming experience of your fellow summoners all over the world, working alongside video game enthusiasts like yourself. The aim of our company is to build powerful tools that enable all players to step up their game and present their best self to the community they play in, AND of course, we want it to be a fun journey…</p><p>That’s where you come in! As a UX designer, we want you to design the interface that our players see and interact with every day. Players need to fall in love with our tool as soon as they start using it,  and your aesthetic sense is what will seduce them. In fact, they need to love using it so much that they reach a point they won't be able to live without it!  League of Legends is where we are starting, but if you love all sorts of games and find yourself thinking about tools you could create for them, you are definitely in the right place with us.</p><p>We have a highly transparent work philosophy for everything from workflow to salary. The team is distributed all over the world, so where you want to pitch up in a hammock in Thailand, work from your mother’s basement in Michigan or anything in between doesn’t matter. Your love for League and video games, your attention to detail, and love for user experience does.</p><p>Role-specific skills we’re looking for:</p><p>1. We want you to lead the design of the product and make sure that our app is beautiful and easy to use. <br>- We want you to think and design as an end user. To do that, you have to understand the nature of our users and be one of them. That means you should probably play a lot of games…competitively...</p><p>2. You should be familiar with the design process of a new app or feature. <br>- Be self-reliant enough to carry the whole team through the process. Start with user stories, sketches, and prototypes. Finish with the design of the interfaces and user testing.</p><p>3. You should be able to take broad concepts or ideas and turn them into valuable features for our users. <br>- Understand business needs and connect them with design decisions that can be articulated in individual or group settings. <br>- Partner with engineers, product managers, and data scientists to oversee the user experience of a product from concept to launch — and then continue to improve it.</p><p>4. Bonus points for:<br>- Experience in designing Dashboards for SaaS products.<br>- Experience in designing complex interfaces and making them easy to understand.<br>- Fostering a culture of design.</p><p>Life skills we value:</p><p>1. Plays the games with some measure of desire to improve. <br>- Of course, we want you to be someone who plays the games we create our tools around. Playing them may be enough, but to communicate to players effectively you must have some sort of latent desire to improve…No we don’t care if you are Bronze or Diamond.</p><p>2. Self-initiated, fast learner with a positive attitude. <br>- We don’t want to tell you what to do all the time. Hopefully, you will tell us what we need to be doing. <br>- We want “can do” people, not “can’t do” people. In our experience, passion breeds enthusiasm, which breeds a strong desire to learn. That’s why we want to know you care.</p><p>3. Strong sense of team spirit thriving in a fast-paced environment. <br>- Think of our team as a ranked team, we strive for excellence and don’t waste each other's time with BS. <br>- We all support each other, but that also means being good critics. Be able to take criticism! That is the only real path to improvement!</p><p>4. Excellent attention to detail, quality of work and time management. <br>- Be proud of your work, not for our sake, but for yours. We will be proud too! - Working hard is important, but being efficient is more important, so using your time wisely is paramount to successful projects.</p><p>If you love games and have a strong desire to create beautiful products for a passionate community of competitive gamers, this is the place for you. We really want to help players be their best self when playing with others around the world, and you should help us create that environment.</p></div>",
    "urlFetchPending": false,
    "published": "Apr 25, 2018 5:37:37 PM",
    "tags": [
      "Attention to Detail",
      "DBG:surround``fulltim 4N remot",
      "Earth",
      "Full Time",
      "Product Design",
      "REMOTE1/100",
      "Rapid Prototyping",
      "Remote OK",
      "Santa Monica",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown",
      "UI/UX Design",
      "UI/UX Designer",
      "User Behavior Analysis",
      "Video Games"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "EAPkBQ0XRzCaQI7KCXaa0w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/174022/ux-ui-designer-clevertech?a=WmpV0FBgRck",
    "title": "UX/UI Designer at Clevertech  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Designer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>DESCRIPTION</strong></p><p>Clevertech is looking for a UX/UI Designer to join our global team. We are looking for team members to help us develop world class software products for the most exclusive organizations in the world. We have been at this for seventeen years, and continue to grow off our best asset, our people.</p><p>In this role you will have significant responsibility in one of our project development teams to ensure client satisfaction by executing on the deliverables.</p><p><strong>REQUIREMENTS</strong></p><p>Clevertech looks for craftsmen developers who take ownership of their designs. You can deliver quickly while being clever to avoid missteps. You have an effective positive attitude that shines as you show your care about client and colleague concerns. You are always learning and are a transparent communicator even when it is challenging. You thrive on challenging yourself daily and seek to surround yourself with like minded individuals.</p><p>You understand good UX and good UI and what that means and love to create successful designs (that delight customers) and you can successfully bring a whole concept from idea to wireframe, to mockup/prototype and have the deliverables to prove it. You have worked in significant mobile projects and have participated in the full design cycle to deliver world class, pixel perfect designs.</p><p><strong>BENEFITS</strong></p><p><strong>Own Your Time</strong></p><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travelers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting.</p><p><strong>Recharge Time</strong></p><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p><strong>Care For Yourself</strong></p><p>You’ll receive a health/wellness monthly stipend that goes towards covering medical insurance, dental insurance or joining a gym!</p><p><strong>Focused Work</strong></p><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams.</p><p><strong>Learn at your edges</strong></p><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here. And of course, if you speak at a tech conference, we cover all expenses.</p><p><strong>Clevertech Swag</strong></p><p>And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over Slack.</p><p>Want to learn more about Clevertech and the team? Check out&nbsp;<a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p><p>APPLY FOR THIS POSITION</p>                    </div>                            <h2>                About Clevertech            </h2>            <div><p><strong>We’re always looking for smart, driven, entrepreneurial developers to join our team.</strong></p><p><strong>If you like new ideas and want to work with a virtual but absurdly talented group of people in a learning-friendly environment, check out the open positions.</strong></p><p><strong>No matter what you do at Clevertech, you'll play a part in transforming ideas into software that changes the world.</strong></p><p><strong>Just answer a few quick questions and learn a little more about our culture.</strong></p><p><strong>We’re waiting for you, and ready to do great things together!</strong></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Full-Time Telecommuting                            </div>                            <div>                                 Flexible Schedules                            </div>                            <div>                                 Paid Time Off                            </div>                            <div>                                 Ability to Work with Cutting-Edge Technology                            </div>                            <div>                                 Opportunity to Work with and Learn from Top Developers                            </div>                            <div>                                 Contribute to Open Source                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 24, 2018 10:44:01 PM",
    "tags": [
      "DBG:surround``fulltim 4N telecommut",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "xy1WvKtzR4q3Zm5K-KVxeg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/68215/uiux-designer-at-resi/",
    "title": "UI/UX Designer",
    "content": "We are Resi. The straight-forward modern architect.<br /><br />We believe in making world-class residential architecture accessible to all. Through our use of technology we can offer a high quality and cost effective service right across the UK.<br /><br />Working here, you’ll discover that we do things a little differently to our competitors. We’re looking to shake up the architecture industry and so need an ambitious, no-holds-barred team to make this happen.<br /><br />We have a fun, dynamic team located in Bermondsey (no, not the fancy part!). Currently, we’re a small team of under 30, but we’re growing quickly and on the hunt for a creative all rounder to join the team.<br /><br />Most companies say they are an equal opportunities employer but we really mean it. We are led by a female CEO and a female CTO. We actively encourage people who feel like they don’t fit the traditional stereotypes to apply. Your experience is all that matters.<br /><br />We are looking to find a UI/UX Designer to become an integral part of our team. You will chiefly be responsible for designing and developing workflows and interfaces that our customers and team love.<br /><br />*Responsibilities:*<br />*Craft intuitive and aesthetically pleasing interfaces that tackle real life problems<br />*Work across the company and help diagnose process our weak spots and ways to fix them<br />*Build user journeys, wireframes and mockups to aid the product design process<br />*Collaborate with our designers and engineers to ship great product<br /><br />*What we offer:*<br />*A good London-based salary<br />*The opportunity for rapid progress<br />*Ownership of your work & area<br />*On the job training<br />*30 days holiday<br />*The chance to help build a company from the ground up<br /><br />All applications should include a link or PDF portfolio, CV and a cover letter as to why you think you would be a good fit for Resi.",
    "urlFetchPending": false,
    "published": "Apr 22, 2018 1:03:05 PM",
    "tags": [
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "AF3NCfekRjm5i4JwBBndBw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/secured-universe/jobs/73428-ui-ux-jedi",
    "title": "UI/UX Jedi",
    "content": "<div><h2>UI/UX Jedi at Secured Universe</h2><div>San Diego, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>UI/UX Design, User Interface, Mobile UX Design, Mobile UI Design</div><div>Compensation</div><div>$40K–$120K<br>0.0%–5.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The title says it all.</p></div>",
    "urlFetchPending": false,
    "published": "Apr 16, 2018 10:29:27 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Mobile UI Design",
      "Mobile UX Design",
      "REMOTE1/100",
      "Remote OK",
      "San Diego",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown",
      "UI/UX Design",
      "UI/UX Designer",
      "User Interface"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "i0vQ6ajJQGaS-Ej2JayuTA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/68014/designer-at-heist-studios/",
    "title": "Designer",
    "content": "Role: Designer, Heist Studios<br />Reporting to: Art Director<br />Location: Clerkenwell, London<br /><br />Our vision<br /><br />At Heist, we believe underwear can be an instrument of progress. While many industries understand our era’s desire for autonomy, choice and freedom, women’s underwear has lagged behind. Effectively, all women are living in underwear inadequate to their time.  <br /><br />We believe that radical innovation in underwear design can ensure that every woman, every day, is living in underwear that allows her to progress in the way that she demands in every other area of her life. That’s why our designs are built on an understanding of how bodies move, not just how they look.<br /><br />This approach led us to reimagine the most mundane wardrobe staple, a pair of tights, into a product that redefines superiority in comfort and fit for every female body. We’re now using polymer physics, computational engineering models and 3D knitwear to reinvent shapewear. Next, we’ll be taking our design ethos to make a bra that actually fits. (Finally!)<br /><br />Our journey<br /><br />We may be only two years old, but it’s already been quite a ride. Our first range reinvented the humble pair of tights, delivering 30% month-on-month growth and propelling us into the pages of almost every major European publication. We’re backed by some of the biggest investors in fashion and technology, and on a busy day, we can sell a pair of tights every 15 seconds. Even our tube adverts caused a scandal. Most importantly, we have tens of thousands of customers who genuinely love Heist and the products we develop and ship around the world. We are continually growing and creating a creative brand that not just looks good, but also tell a story.    <br />Your responsibilities<br /><br />As Designer, you will work on a range of tasks from designing emails and banners to advertising, across both print and digital. You will be working within our Creative team, supporting them on day to day tasks as we continue to grow.<br /><br />Being more specific, you will:<br /><br />•    Design work for new banner ads, print and web material.<br />•    Be able to constantly think of new designs to push Heist forward.<br />•    Ability to take ownership of design projects across multiple platforms both online and offline.<br />•    Provide final artwork across a wide range of projects, from print advertising through to display ads and social posts. This will include repurposing of existing assets.<br />•    Work with external partners and agencies<br />•    Support the creation of conceptual designs for new projects<br />•    Refresh existing email, print and advertising templates with relevant imagery and copy. <br /><br /> Your experience<br /><br />We firmly believe extraordinary people come from a wide range of backgrounds, but we would expect that you have:<br /><br />•    Advanced knowledge of studio software, including Adobe Creative Suite InDesign, Illustrator and Photoshop and skills in all other Creative Suite programs.<br />•    An outstanding awareness of current design trends.<br />•    A brilliant understanding of typography and layout and a good understanding of the print process.<br />•    Thorough understanding of asset supply requirements across all media disciplines<br />•    Past experience in retouching is a nice to have <br />•    The ability to work collaboratively within a team with other creatives and have the ability to take creative direction from the Art Director to bring design concepts to life when necessary.<br />•    Exceptional attention to detail<br />•    An excellent eye and passion for design.<br />•    The ability to meet deadlines without compromising quality<br />•    Creative agency experience is desirable <br /><br />You<br /><br />We are a diverse bunch of people at Heist. That said, there are some characteristics we always look for:<br />•    You deeply care about Heist’s mission; you have a desire to build something iconic, that will disrupt an industry, and women’s lives.<br />•    You thrive on challenge and change; you naturally gravitate to the hardest questions first and love thinking differently to solve them. <br />•    You are biased towards action and you’re happiest when you’re ‘getting stuff done’.<br />•    You’re open, positive & straightforward. You’re not afraid to stand up for your convictions, even when it’s hard to do so.<br />•    You delight in your colleagues’ successes and thrive on your failures; you grasp any opportunity for learning and constantly seek to improve.",
    "urlFetchPending": false,
    "published": "Apr 16, 2018 12:19:40 PM",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "fZqfA8fUQdeU7MkHOQz3Hg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/173089/sr-ux-ui-developer-us-remote-railroad19?a=W318m1nABvW",
    "title": "Sr UX/UI Developer (U.S. remote) at Railroad19  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Frontend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Services, Consulting, Software Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>At Railroad19, we develop customized software solutions and provide software development services.&nbsp; We are currently seeking a talented Sr. Front-end Engineer&nbsp;to join our world-class team of developers assigned to work on various project teams at our Enterprise client. This role will be responsible for contributing to the development, and implementation of front-end solutions for our client. In addition to contributing code and tangible deliverables the role is expected to work as an adviser to help identify, educate, and foster best-in-class solutions. The role requires the applicant to create and maintain strong relationships with stakeholders and team members. Creating these relationships requires strong communication skills and some travel to the office.</p><p>As a Railroad19 employee, you will be part of a company that values your work and gives you the tools you need to succeed. Our headquarters is located in Saratoga Springs, New York, but this position is remote. &nbsp;Railroad19&nbsp;provides competitive compensation and excellent benefits~ Medical/Dental/Vision vacation and 401K.</p><p><strong>Core Responsibilities</strong></p><ul><li>Foster strong relationships with key stakeholders and provide expertise as well as customer service to meet a wide variety of requirements</li><li>Quickly provide insight and options to front-end challenges</li><li>Collaborate with Product Managers and business teams to create consumer-like, elegant, intuitive experience for enterprise users</li><li>Contribute both technically and in an advisory role to projects</li><li>Develop and manage extensible, stable code bases for a variety of applications</li><li>Provide front-end architecture and esthetic thought leadership</li><li>Stay current with the fast changing landscape of browser based application development</li><li>Evaluate frameworks, technology, platforms and tooling solutions</li><li>Support and troubleshoot issues (process &amp; system), identify root cause, and proactively implement sustainable corrective actions</li></ul><p><strong>Skills &amp; Experience&nbsp;Required</strong></p><ul><li>Bachelor's degree in Computer Science, Human Computer Interaction, (or equivalent relevant work experience)</li><li>Strong understanding of the DOM, HTML5, CSS3 and JavaScript</li><li>Significant experience with Angular 2+</li><li>3+ years of experience with additional web libraries and frameworks. Preferred: jQuery, Bootstrap, Underscore</li><li>Experience with preprocessors and front-end tooling workflows: Node.js (NPM), SASS, Grunt/Gulp, Web Pack, etc.</li><li>Strong understanding of debugging for the browser</li><li>Experience testing JavaScript code — Jasmine and Protractor preferred, but not required</li><li>Experience with Responsive Web Design (RWD) patterns</li><li>Ability to create non-functional wireframes rapidly in a vector tool of choice (Illustrator, Sketch, etc…)</li><li>Proven ability to create working prototypes (proof of concepts) at varying degrees of fidelity using HTML, CSS and JavaScript</li><li>Experience with immutable.js and/or unidirectional data flow patterns (i.e. Redux)</li><li>Experience with RxJS or other Reactive programming techniques/libraries</li><li>Experience using ES2015 (ES6) and TypeScript</li><li>FullStack awareness, but this role is front-end based</li><li>Experience rendering and working with large data payloads&nbsp;</li><li>Experience with data integration; understanding/experience with RESTful API design</li><li>Working in an Agile environment</li><li>Strong team-building, vendor and customer relations skills</li><li>GIT and GitHub</li><li>Strong communication skills (wireframes, rapid prototypes, PoC’s, white boarding)</li><li>Experience maintaining and extending a style guide for scalability and cross application usage</li></ul><p><strong>Nice to Have, but not Required</strong></p><ul><li>Web workers experience</li><li>Service workers experience</li><li>Angular 4/5&nbsp;experience</li></ul>                    </div>                            <h2>                About Railroad19            </h2>            <div><p>At Railroad19, we develop customized software solutions and provide software development services. &nbsp;As a Railroad19 employee, you will be part of a company that values your work and gives you the tools you need to succeed. &nbsp;Railroad19 provides competitive compensation, excellent benefits, 401k and a great culture.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Employer 401K match plan                            </div>                            <div>                                 Brand new, modern and open office space                            </div>                            <div>                                 Located in downtown Saratoga and close to a variety of restaurants                            </div>                            <div>                                 Very Friendly and Upbeat work environment                            </div>                            <div>                                 Great location with free parking garages in close proximity                            </div>                            <div>                                 Competitive health, dental and vision insurance plans                            </div>                            <div>                                 Work Remotely                            </div>                            <div>                                 Work life balance                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 15, 2018 2:07:51 AM",
    "tags": [
      "DBG:surround``OR(requir,need) 6W OR(travel,visit) 5W OR(offic,headquart,onsit)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:angular/frontend/16",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:frontend-developer/frontend/26",
      "DBG_TECH1:k/t/w:gruntjs/nodejs/5",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:javascript/frontend/5",
      "DBG_TECH1:k/t/w:javascript/nodejs/5",
      "DBG_TECH1:k/t/w:jquery/frontend/8",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:npm/nodejs/5",
      "DBG_TECH1:k/t/w:sass/frontend/5",
      "DBG_TECH1:k/t/w:twitter-bootstrap/frontend/8",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:k/t/w:underscore.js/nodejs/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=34, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=77}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "zXwOzLMJTmq4ReZDvW3rKg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/rebrandly/jobs/130493-brand-evangelist-growth-hacker",
    "title": "Brand Evangelist/Growth Hacker",
    "content": "<div><h2>Brand Evangelist/Growth Hacker at Rebrandly</h2><div>Dublin, San Francisco, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Facebook Advertising, Social Media Marketing, Public Relations, Advertising, Inbound Marketing, Customer Acquisition, Digital Marketing, Google Analytics, Video Conferencing, Web Content Management</div><div>Compensation</div><div>€30K–€50K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>We are looking for a talented Brand Evangelist/Growth Hacker to skyrocket our traction and increase free and paid subscriptions. You will work closely with marketing team and have direct contact with our founder to plan and execute innovative new projects, acting as the public face of Rebrandly from a PR perspective. You’ll collaborate with other departments, seeking to streamline our brand while contributing to increased user subscriptions and leads. The ideal candidate has a special gift for communication, is familiar with SaaS and freemium business models and should bring new ideas to the table for attracting a larger audience. We are looking for a smart, motivated and dynamic person with awesome work ethic and a forward-thinking mindset.</p><p>Responsibilities: <br>Create and execute growth communication projects in the form of events, videos, talks, webinars, special initiatives, conferences, seminars and non-traditional PR<br>Test and optimize marketing tactics for customer acquisition (online advertising, direct mail, out of home, affiliate) and conversion rate optimization<br>Propose creative new projects that attract prospects and convert leads, testing new approaches to capturing existing demand across multiple channels from social to SEO to paid media<br>Translate ideas into actionable items that deliver business results<br>Identify industry trends and insights </p><p>Requirements<br>At least 2 years working as a Brand Evangelist/Growth Hacker<br>Third level degree and relevant experience in a related field<br>Has experience in marketing/traction strategies   <br>Excellent analytical and problem-solving skills<br>Has driven, ambitious and a “roll up the sleeves” attitude towards work<br>Native English with outstanding communication skills </p><p>Nice to Have<br>Strong public speaking skills <br>Knowledge of HTML and CSS<br>Startup experience <br>SaaS experience<br>US-based</p><p>Location: Dublin or San Francisco or Remote USA<br>Duration: Full time, long term contract</p></div>",
    "urlFetchPending": false,
    "published": "Apr 13, 2018 1:53:03 AM",
    "tags": [
      "Advertising",
      "Customer Acquisition",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=3}",
      "Digital Marketing",
      "Dublin",
      "Facebook Advertising",
      "Full Time",
      "Google Analytics",
      "Growth Hacker",
      "Inbound Marketing",
      "Public Relations",
      "REMOTE1/100",
      "Remote OK",
      "San Francisco",
      "Social Media Marketing",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/America",
      "Video Conferencing",
      "Web Content Management"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "g55leL0fQlqQl7lfY83h2Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/67926/graphic-designer-madrid-office-at-geoblink/",
    "title": "Graphic Designer (Madrid Office)",
    "content": "*About Geoblink*<br />Geoblink was founded in March 2015 with the goal of revolutionising the world of Location Intelligence and the way businesses think about, and act upon location intelligence data. We’ve already made some huge waves in the industry, raised more than 6M Euros in investment from top venture capital firms so far and been named by Bloomberg as ‘one of the 50 most promising startups of the world’<br /><br />Everyone at Geoblink is passionate about what they do, whether it be increasing businesses ROI or building complex data systems. People join Geoblink not just for the flexible work schedule, unlimited vacations, and unlimited tea/coffee/beers/cokes but because we offer everyone the opportunity to have real impact in the business and collaborate with some off the best minds in the industry (think McKinsey, MIT, CERN or EA Games). <br /><br />*Who we’re looking to recruit*<br />A talented Illustrator who can take responsibility for maintaining and evolving our new brand’s visual identity. As a Graphic Designer you will be an integral part of our Marketing team so we are looking for someone you can easily fully understand the business in order to convey the value proposition of the company through your design. If you have a good eye for design and love being creative then Geoblink is the place to be. This position will offer you the opportunity to let your creative spirit run free and have a huge impact on our brand identity.<br /> <br />*Here are some other things we’re looking for:*<br />* A creative and entrepreneurial mindset with graphic design knowledge<br />* Proactive with the ability to quickly understand business needs<br />* Strong Illustration skills<br />* Video editing and motion graphic experience<br />* A great team player but with the ability to work well independently if needed<br />* Ability to communicate effectively with people at all levels in an organization<br /><br />*What you can expect from the job:*  <br />* Full ownership for maintaining and evolving our new brand’s visual identity.<br />* Creating illustrations to accompany all content created by your team (blog post, e-books, social media, online ads, offline content etc)<br />* Creating graphical pieces of content like infographics<br />* Editing and creating video content<br />* Working with the CRM Manager on the design of the emails<br /><br />*Perks of the job*<br />* Unlimited holidays, flexible work schedule or ability to work from home<br />* Unlimited coffee, tea, coke to keep you going<br />* Chillout space with ping-pong, table football, etc<br />* Attractive compensation package<br />* Lots of space for you to work in peace so you can produce your best work<br />* Opportunity to collaborate with some of the best people in the industry <br />* Great career progression <br />* Quarterly off sites to awesome destinations, language tandems<br />* And much much more!",
    "urlFetchPending": false,
    "published": "Apr 12, 2018 9:54:15 AM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/2",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "7GgYUIb8SeGB5pQLPUY5gQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/gmb-ux-ui-designer",
    "title": "GMB: UX / UI Designer",
    "content": "<div>  <div>    <h2>UX / UI Designer</h2>      <h4>Posted Apr 12</h4>    <h3>      <span>GMB</span><br>      <span>Headquarters: Remote! We are an online company.</span><br>        <a href='https://gmb.io/' rel='nofollow'>https://gmb.io/</a>      <br>      <a rel='nofollow'>View all GMB jobs →</a>    </h3>  </div>    </div>  <div>    <div>Hi, we’re GMB, and we teach people how to use their bodies better.&nbsp;</div><div><br></div><div>The word “fitness” has been perverted to mean doing things you hate to impress people you don’t like with a body that’s too tired and sore to do anything fun. We’re here to change that, and we need your help.</div><div><br></div><div></div><div><br></div><div>We started out in 2010 with an email subscription form, a YouTube account, and a lot of scrambling to figure things out. Even with over 40,000 clients in 80 countries, pretty much everything about how we’ve built our company and marketed our products has been bootstrapped by a small group of deeply invested people wearing a lot of hats and learning as we went along. Even with a team of over twenty people, that’s our DNA – learning and making it work.</div><div><br></div><div>This year, we’re making big changes to our product and we are looking for a UX / UI Designer to join GMB. You’ll be part of a team that is helping to imagine and build new products — as well as improve existing ones.</div><div><br></div><div><h3>What will be your responsibilities?</h3></div><ul><li>Design and take ownership for the user experience of our products — including creating user journeys, wireframes and interactive prototypes</li><li>Create high fidelity user interaction and interface designs</li><li>Work closely with our engineering team to ensure implementation aligns with designs</li><li>Develop standards and a unified style guide for your designs, to ensure a consistent user experience and to make it easy for others to implement</li><li>Present and communicate your ideas and designs to others in the company</li><li>Contribute to overall brand and design strategy</li><li>Be involved in various kinds of usability testing (User testing, Beta testing, A/B etc.)</li><li>Interact with our customers, to understand how they use our products, their goals and pain points.</li></ul><div><h4>To do this job, you will need:</h4></div><ul><li>Proven experience as a UX / UI Designer — backed up by a strong portfolio</li><li>Experience in designing high quality experiences for both mobile and desktop</li><li>Experience in user journey mapping, wire-framing and interactive prototypes</li><li>High attention to detail and a passion for keeping designs simple and efficient</li><li>Well rounded design skills that range from early wire frames, through to high fidelity designs</li><li>Proficient with design tools, such as Photoshop, Illustrator, Sketch, Adobe CC, InVision, Balsamic etc</li><li>Good knowledge of design trends and best practices across different devices and platforms</li></ul><div><h4>Other Requirements &amp; Competencies</h4></div><ul><li>Are clear on the value you’ll bring to the team.</li><li>Know how to follow instructions and how to be creative – and how to choose between them.</li><li>Speak and read/write perfect English.</li><li>Have a sense of humor.</li><li>Always work to develop a&nbsp;<a href='https://www.brainpickings.org/2014/01/29/carol-dweck-mindset/' rel='nofollow'>growth mindset</a>.</li><li>Good at self-managing.</li><li>A ‘Hands On’ attitude: You are naturally curious and want to understand how things work. You also aren’t afraid to get your hands dirty and take ownership when issues arise</li><li>Able to work in an agile environment. This means working iteratively and a willingness to change priorities based on changing business dynamics</li><li>Can make things happen. You are a doer/maker as well as a planner.</li><li>Can manage written communication with a lot of different people.</li></ul><div><h4>Not mandatory, but nice to have:</h4></div><ul><li>You’ve been following GMB for a while and understand what sets us apart from other fitness companies.</li><li>You’ve used one of our products</li><li>Worked within a distributed team environment</li><li>Experience with designing WordPress themes</li><li>Knowledge of front-end technologies – HTML, CSS, JavaScript, etc.</li></ul><div>Compensation is competitive and commensurate with experience, but you can get a pretty good sense of our&nbsp;<a href='https://gmb.io/hiring/' rel='nofollow'>benefits and such here</a>.</div><div><br></div><div><h3>What’s it like working at GMB?</h3></div><div>GMB is a kick-ass company.</div><div><br></div><div>GMB is about creating autonomy. We’re working to make the world a better place by teaching people to take control of what their bodies can do so they can contribute to their families and communities. We create options for exploration and self-expression.</div><div><br></div><div></div><div><br></div><div>And we work the way we practice. Like our idea of fitness and the way we deliver our programs, very little about the way we work is like what you’d find in a traditional company. Here’s how we exemplify autonomy at work:</div><div><br></div><div><span></span>&nbsp;<span>Work and Live Anywhere</span></div><div><br></div><div><span></span>&nbsp;<span>Set Your Own Schedule.</span></div><div><br></div><div><span></span>&nbsp;<span>Create Your Own Role.</span></div><div><br></div><div>We also take care of our people. Building a great team with full autonomy requires more than just freedom; we thrive in an environment that supports development and growth… and we bet you will too. Some of the things we value and encourage are:&nbsp;<span>continuous learning</span>,&nbsp;<span>travel &amp; facetime</span>, as well as&nbsp;<span>time off</span>. Learn more about all our&nbsp;<a href='https://gmb.io/hiring/' rel='nofollow'>benefits here</a>.</div><div><br></div><div>If you like what you’ve read so far, familiarize yourself with who we are and what we’re&nbsp;<a href='https://gmb.io/about/' rel='nofollow'>about</a>&nbsp;before going any further. You should also listen to this interview with Andy about&nbsp;<a href='https://mixergy.com/interviews/gmb-fitness-with-andy-fossett/' rel='nofollow'>how we grew GMB</a>&nbsp;and what’s important to us.</div><div><br></div><div>Want to learn more about the smart, fun people you’ll be working with? Check out our&nbsp;<a href='https://gmb.io/team/' rel='nofollow'>team</a>.</div><div><br></div><div><span><span><span></span>&nbsp;<span></span>&nbsp;<span></span></span></span></div><div><h3>How To Apply</h3></div><div>If you’re thinking, “I know how to use an APP; I’d be great at this,” you’re probably wrong. Please read everything above&nbsp;<em>carefully</em>&nbsp;and make sure you understand that there are some fairly complex and technical requirements.</div><div><br></div><div>If that all sounds like stuff you can handle, we’d love to hear from you. Please make a case for why you’ll be a great fit for the team in the application form&nbsp;<a href='https://gmb.io/hiring/ux-ui-design/' rel='nofollow'>here</a>.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>If you’re thinking, “I know how to use an APP; I’d be great at this,” you’re probably wrong. Please read everything above carefully and make sure you understand that there are some fairly complex and technical requirements.If that all sounds like stuff you can handle, we’d love to hear from you. Please make a case for why you’ll be a great fit for the team in the application form here: <a href='https://gmb.io/hiring/ux-ui-design/' rel='nofollow'>https://gmb.io/hiring/ux-ui-design/</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 12, 2018 7:56:58 AM",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=4}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "php"
    ]
  },
  {
    "id": "kY_K4NX_QSu_3XrhR2UNiA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/67720/web-designer-for-a-new-makeup-range-at-nyc-color/",
    "title": "Web designer for a new makeup range",
    "content": "We are building a platform to allow any woman to be colour-matched to the best products currently available on the market, in a brand agnostic manner. Additionally, it will also match women to content that is representative of their unique skin and allow them to achieve their perfect look.<br /><br /><br />This platform is geared largely to women of colour - we feel that the makeup market for this demographic hasn’t evolved much since the 1980s, with rare exceptions such as Fenty Beauty by Rihanna validating the need to have a more diverse makeup landscape.<br /><br /><br />We are working hard to build the tools to help users colour match utilising only their phone and are rapidly expanding our team to make our dream a reality.<br /><br /><br />We are at the beginning of the journey, having just raised our first round of funding, and inked a partnership deal with the world’s 3rd’s largest makeup manufacturer.<br /><br /><br />Key Responsibilities:<br /><br /><br />● Designing our mobile website - with a focus on delivering our MVP UI design<br /><br />● Participate in user research activities and usability studies to be able to iterate design solutions based on customer data.<br /><br />● Lead and facilitate brainstorming sessions and workshops with multi-disciplinary teams during early stages of product ideation.<br /><br />● Produce concept models, journey maps, interaction flows, wireframes, interactive prototypes and UI mock-ups.<br /><br />● Produce pixel-perfect production assets and specifications.<br /><br />● Align the company's brand and aesthetic in all the graphic aspects.<br /><br /><br />Requirements<br /><br /><br />Proven UI experience :slightly_smiling_face:<br /><br /><br />Benefits<br /><br /><br />Flexible working hours - we don’t mind when you work as long as you get the job done<br /><br />Ability to work from home - again, we don’t mind where you work as long as you get the job done<br /><br />Regular team events<br /><br />Large degree of autonomy<br /><br />Your birthday off<br /><br />Budget for ongoing training",
    "urlFetchPending": false,
    "published": "Apr 5, 2018 3:55:07 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "HKoVCzRDRPG378kcnNOctQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/171913/ux-designer-bilbayt?a=VEz5eQm5Sec",
    "title": "UX Designer at Bilbayt  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Designer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Catering, Customer Experience Management, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Bilbayt.com's software engineering team is&nbsp;looking for a&nbsp;talented&nbsp;UX designer to own and lead all of our design projects and tasks. We're currently planning and developing a new generation of our&nbsp;software products and services (mobile apps, public websites, private admin portals) and need a single designer to lead all of our design initiatives.</p><p><strong>What you'll do</strong></p><ul><li>Design the overall look and feel of our software products and services that integrate our new branding, existing design assets, and your new design vision</li><li>Establish UI/UX guidelines that&nbsp;our&nbsp;development team will incorporate into every feature&nbsp;we build</li><li>Collaborate with our management, marketing, and engineer teams to plan and design all new features</li><li>Create detailed user flows,&nbsp;wireframes, mockups, and working prototypes to help our teams&nbsp;plan new features</li><li>Work closely with the development team to&nbsp;evolve your prototypes into production code</li><li>Lead user experience research and testing processes</li></ul><p><strong>What it takes to catch our eye</strong></p><ul><li>A design portfolio (required) showing apps and websites that have beautiful modern designs and elegant user experiences</li><li>Experience designing for mobile including native applications and responsive web solutions</li><li>Working knowledge of the capabilities and constraints of web front-end technologies including HTML5, CSS, and JavaScript</li><li>Interest in both modern user experience trends and proven user experience designs for successful software</li><li>An entrepreneurial spirit and creativity that sparks your capacity for building and growing business. You’re encouraged to show us your side projects and design experiments</li></ul><p><strong>How you'll work</strong></p><p>You'll be our sole designer working very independently on all design projects and tasks. You'll be working completely remotely with periodic collaboration (Slack and Google Hangouts) with our small management, marketing, and engineering teams. You'll be sharing designs and ideas with our teams using&nbsp;the platforms and services&nbsp;you feel are most effective. You'll ultimately be our entire UX design team and will have the freedom and authority to work towards your objectives as you see fit.</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Remote work                            </div>                            <div>                                 Opportunity to work with modern technologies and frameworks                            </div>                            <div>                                 Opportunity to work on large-scale cloud-hosted solution                            </div>                            <div>                                 Freedom to help plan and lead system architecture decisions                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 7:00:46 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 4W OR(skype, slack)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=9}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "ke9lVEFIQHaZCGbqbb2BvQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/3665-mobile-product-designer-remote",
    "title": "Mobile Product Designer (Remote)",
    "content": "Mobile Product Designer&nbsp;(Remote) - Jobmote<div><div><h2>Mobile Product Designer&nbsp;(Remote)</h2><h5>Drops</h5></div></div><div><div><div><div></div></div><div><div><div><h3>DESCRIPTION</h3><p>Drops’ goal is to turn language learning into a delightful game while ensuring effective learning. Sounds fun? Our users say it is indeed! Our app is in the Appstore for 3 years, teaches 28 languages, was featured by both the App Store and Play Store multiple times - Editors’ Choice on the Play Store - and the company is still run by the founders. We are a small, super-capable remote team mainly spread across Europe. We communicate via Slack, Git and Trello and run iterative development cycles, daily releases and design optimisations at a fast pace. We want to be the no.1 app for vocabulary learning and we are getting there quickly with our current user base of 3.5 million, a monthly active of 500,000 and an average store rating of 4.7. We are a rapidly growing cashflow-positive bootstrapped company.</p><p>You can find us here:&nbsp;<a href='https://workable.com/nr?l=http%3A%2F%2Fdrops.app.link%2F' rel='nofollow'>http://drops.app.link/</a></p><p>&nbsp;</p><p>You, as a Mobile Product Designer will help us maintain and accelerate Drops, with fresh ideas and your hands on, day-to-day involvement. You have relevant UX and UI experience and are comfortable representing the whole spectrum of design competencies in a remote team.&nbsp;</p><p>This is a full-time and long-term position. You will be dedicated to this role only, hopefully in the years to come.</p><p>We value clear and honest communication and transparency, it’s the linchpin of our culture and current success and freedom.</p><p>You will be involved in both high and low level decision making and need to be available during European working hours (9AM - 6PM GMT)</p><p><strong>You will be:</strong></p><ul><li>Working on high-level UX problems as well as specific UI solutions and perhaps some simple graphic design bits.</li><li>Taking part in setting the product priorities, helping to guide the development of Drops.</li><li>Drawing design implications out of quickly moving business requirements, market movements and Slack.</li><li>Explaining and rationalising your design concepts to the team through annotations and remote presentations.</li><li>Working as part of an agile team owning key pieces of functionality and juggling priorities from one sprint to the other.</li><li>Drawing upon existing design standards and pattern libraries, as well as identifying opportunities to expand them where necessary.</li><li>Producing sketches, wireframes, flows or interactive prototypes to depict proposed functionality to the team or potential users.</li><li>Producing UI assets for growth and core product experiments.</li><li>Running casual hands-on user testing sessions.&nbsp;</li><li>Working with third-party user research partners to coordinate usability testing</li></ul><p>&nbsp;</p><h3>REQUIREMENTS</h3><ul><li>Available during European working hours: 9AM - 6PM GMT</li><li>Willing to dedicate yourself to long-term cooperation</li><li>Passionate about app design (both iOS and Android), motion and your craft.</li><li>Fluent in Adobe products and Sketch</li><li>Able to self organise and communicate clearly in English - both verbally and in text</li><li>Comfortable working alone, autonomously in a remote environment</li><li>Have experience working with development teams</li><li>Capable and have a degree or postgraduate design orientated qualification OR have equivalent work experience.</li><li>Active in seeking feedback and able to constantly challenge yourself and others.</li><li>Bonus points if you are able to demonstrate experience with one or more of the core landscape skills the team employes daily in the development and deployment of Drops be that marketing, search optimisation, coding, user testing, language learning, education, game creation/gamification, iconography etc…</li></ul><p>BENEFITS</p><ul><li>An awesomely compact 8 person team</li><li>Yearly educational allowance</li><li>All the perks of remote working</li><li>Holiday to meet local standards (usually above 20 days).</li><li>Annual team gathering somewhere in the world</li><li>Stock options from a high-growth, profitable company</li><li>Access to support and mentorship that will help you grow as a designer</li></ul></div></div><div></div></div></div></div><div><a href='http://statcounter.com/' title=&quot;web statistics&quot; rel='nofollow'></a></div>",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 4:22:13 PM",
    "tags": [
      "DBG:surround``2N( OR(employe,develop,engin,team,workmat), spread, OR(out,across) )",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:app-store/mobile/8",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=12, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=1, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/mobile",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile"
    ]
  },
  {
    "id": "vZHT73HUQgCpIDq7lu4i2Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/drops-mobile-product-designer-remote",
    "title": "Drops: Mobile Product Designer (Remote)",
    "content": "<div>  <div>    <h2>Mobile Product Designer (Remote)</h2>      <h4>Posted Apr  4</h4>    <h3>      <span>Drops</span><br>      <span>Headquarters: Budapest</span><br>        <a href='https://languagedrops.com' rel='nofollow'>https://languagedrops.com</a>      <br>      <a rel='nofollow'>View all Drops jobs →</a>    </h3>  </div>    </div>  <div>    <div><h3><span>We are looking for a Mobile Product Designer who will help us maintain and accelerate Drops with fresh ideas and hands on, day-to-day involvement.&nbsp;</span></h3></div><div></div><div>You have relevant UX and UI experience and are comfortable representing the whole spectrum of design competencies in a remote team.&nbsp;<span>This is a full-time and long-term position. You will be dedicated to this role only, hopefully in the years to come.&nbsp;</span><span>We value clear and honest communication and transparency, it’s the linchpin of our culture and current success and freedom.</span></div><div><span><br></span></div><div><span>You will be involved in both high and low level decision making and need to be available during European working hours (9AM - 6PM GMT)</span></div><div><span><br></span></div><div><h3>You will be:</h3></div><ul><li>Working on high-level UX problems as well as specific UI solutions and perhaps some simple graphic design bits.</li><li>Taking part in setting the product priorities, helping to guide the development of Drops.</li><li>Drawing design implications out of quickly moving business requirements, market movements and Slack.</li><li>Explaining and rationalising your design concepts to the team through annotations and remote presentations.</li><li>Working as part of an agile team owning key pieces of functionality and juggling priorities from one sprint to the other.</li><li>Drawing upon existing design standards and pattern libraries, as well as identifying opportunities to expand them where necessary.</li><li>Producing sketches, wireframes, flows or interactive prototypes to depict proposed functionality to the team or potential users.</li><li>Producing UI assets for growth and core product experiments.</li><li>Running casual hands-on user testing sessions.&nbsp;</li><li>Working with third-party user research partners to coordinate usability testing</li></ul><div><br></div><div><h3>REQUIREMENTS</h3></div><ul><li>Available during European working hours: 9AM - 6PM GMT</li><li>Willing to dedicate yourself to long-term cooperation</li><li>Passionate about app design (both iOS and Android), motion and your craft.</li><li>Fluent in Adobe products and Sketch</li><li>Able to self organise and communicate clearly in English - both verbally and in text</li><li>Comfortable working alone, autonomously in a remote environment</li><li>Have experience working with development teams</li><li>Capable and have a degree or postgraduate design orientated qualification OR have equivalent work experience.</li><li>Active in seeking feedback and able to constantly challenge yourself and others.</li><li>Bonus points if you are able to demonstrate experience with one or more of the core landscape skills the team employes daily in the development and deployment of Drops be that marketing, search optimisation, coding, user testing, language learning, education, game creation/gamification, iconography etc...</li></ul><div><h3>BENEFITS</h3></div><ul><li>An awesomely compact 8 person team</li><li>Yearly educational allowance</li><li>All the perks of remote working</li><li>Holiday to meet local standards (usually above 20 days).</li><li>Annual team gathering somewhere in the world</li><li>Stock options from a high-growth, profitable company</li><li>Access to support and mentorship that will help you grow as a designer</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send a resume to <a href='mailto:drops@jobs.workablemail.com' rel='nofollow'>drops@jobs.workablemail.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 3:54:36 PM",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=4, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=1, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/mobile",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile"
    ]
  },
  {
    "id": "50lVqfAfSdC68et2VgR3AA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30488?r=rss2",
    "title": "Drops: Mobile Product Designer (Remote)",
    "content": "<p>Full-time</p><p><strong>(Europe)</strong> </p><h2>DESCRIPTION</h2><p>Drops’ goal is to turn language learning into a delightful game while ensuring effective learning. Sounds fun? Our users say it is indeed! Our app is in the Appstore for 3 years, teaches 28 languages, was featured by both the App Store and Play Store multiple times - Editors' Choice on the Play Store - and the company is still run by the founders. We are a small, super-capable remote team mainly spread across Europe. We communicate via Slack, Git and Trello and run iterative development cycles, daily releases and design optimisations at a fast pace. We want to be the no.1 app for vocabulary learning and we are getting there quickly with our current user base of 3.5 million, a monthly active of 500,000 and an average store rating of 4.7. We are a rapidly growing cashflow-positive bootstrapped company.</p><p>You can find us here:&nbsp;<a href='https://workable.com/nr?l=http%3A%2F%2Fdrops.app.link%2F' rel='nofollow'>http://drops.app.link/</a></p><p>&nbsp;</p><p>You, as a Mobile Product Designer will help us maintain and accelerate Drops, with fresh ideas and your hands on, day-to-day involvement. You have relevant UX and UI experience and are comfortable representing the whole spectrum of design competencies in a remote team.&nbsp;</p><p>This is a full-time and long-term position. You will be dedicated to this role only, hopefully in the years to come.</p><p>We value clear and honest communication and transparency, it’s the linchpin of our culture and current success and freedom.</p><p>You will be involved in both high and low level decision making and need to be available during European working hours (9AM - 6PM GMT)</p><p><strong>You will be:</strong></p><ul><li>Working on high-level UX problems as well as specific UI solutions and perhaps some simple graphic design bits.</li><li>Taking part in setting the product priorities, helping to guide the development of Drops.</li><li>Drawing design implications out of quickly moving business requirements, market movements and Slack.</li><li>Explaining and rationalising your design concepts to the team through annotations and remote presentations.</li><li>Working as part of an agile team owning key pieces of functionality and juggling priorities from one sprint to the other.</li><li>Drawing upon existing design standards and pattern libraries, as well as identifying opportunities to expand them where necessary.</li><li>Producing sketches, wireframes, flows or interactive prototypes to depict proposed functionality to the team or potential users.</li><li>Producing UI assets for growth and core product experiments.</li><li>Running casual hands-on user testing sessions.&nbsp;</li><li>Working with third-party user research partners to coordinate usability testing</li></ul><p>&nbsp;</p><h2>REQUIREMENTS</h2><ul><li>Available during European working hours: 9AM - 6PM GMT</li><li>Willing to dedicate yourself to long-term cooperation</li><li>Passionate about app design (both iOS and Android), motion and your craft.</li><li>Fluent in Adobe products and Sketch</li><li>Able to self organise and communicate clearly in English - both verbally and in text</li><li>Comfortable working alone, autonomously in a remote environment</li><li>Have experience working with development teams</li><li>Capable and have a degree or postgraduate design orientated qualification OR have equivalent work experience.</li><li>Active in seeking feedback and able to constantly challenge yourself and others.</li><li>Bonus points if you are able to demonstrate experience with one or more of the core landscape skills the team employes daily in the development and deployment of Drops be that marketing, search optimisation, coding, user testing, language learning, education, game creation/gamification, iconography etc...</li></ul><h2><br><br>BENEFITS</h2><ul><li>An awesomely compact 8 person team</li><li>Yearly educational allowance</li><li>All the perks of remote working</li><li>Holiday to meet local standards (usually above 20 days).</li><li>Annual team gathering somewhere in the world</li><li>Stock options from a high-growth, profitable company</li><li>Access to support and mentorship that will help you grow as a designer</li></ul><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 3:40:37 PM",
    "tags": [
      "DBG:surround``2N( OR(employe,develop,engin,team,workmat), spread, OR(out,across) )",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:app-store/mobile/8",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=12, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=1, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/mobile",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile"
    ]
  },
  {
    "id": "HqDHLXGKRSW7FYFZ1pS6og",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/350170-design-facilitator",
    "title": "Design Facilitator",
    "content": "<div><h2>Design Facilitator at ConsenSys</h2><div>Europe, Greater London, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Design Thinking, Design Facillitation, Workshop Design and Facilitation</div><div>Compensation</div><div>$90K–$120K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ConsenSys is a venture production studio and the leading technology firm in blockchain globally. We deliver products, solutions and platforms built using blockchain technology to transform how business is done in complex network of buyers, suppliers and consumers.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, the music industry, security, and infrastructure, and more. To accomplish this we've built out a flat organizational structure which we call the ConsenSys Mesh: a network of individuals &amp; teams working autonomously and towards the same goal.  Our mission is to use these decentralized solutions to fundamentally reshape the economic, social, and political operating systems of the planet. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p> <br>About the role:</p><p>As a Design Facilitator you will work collaboratively, creatively, and flexibly with interdisciplinary teams and with our clients. The Design Facilitation practice at ConsenSys is primarily driven by our desire to help our teams and customers use Design Thinking to achieve outstanding, human-centered results. The Design Thinking team at ConsenSys currently consists of two facilitators and is projected to grow to four by July 2018. Future growth will depend on demand for Design Thinking from the wider organisation.</p><p>What gets us excited:</p><p>-You have a proven history of using design thinking in a variety of ways and in a variety of locations and cultures, at lots of different places from big to small companies, and start-ups.<br>-A strong point of view - you aren’t just along for the ride. Lots of blog posts and videos and podcasts (for example) where we can learn about what you care about and how you express yourself.<br>-Background in teaching and making your own courses and curriculum.<br>-References who will say lots of nice things about you and help us understand how you would fit in at ConsenSys.<br>-A passion for exploring the possibilities of blockchain technology.</p><p>Responsibilities:</p><p>-Run workshops in all forms — a facilitator needs to have a comprehensive grasp of design thinking at a sophisticated level, including methods and mindsets. You need to be able to effectively guide a team of people through the design thinking framework in person and remotely. Please note that we are not looking for theoretical trainers - you must be experienced at delivering hands-on facilitation services.<br>-Advocate, inspire, reflect—we’re going to be building the airplane as we fly it. The facilitator also needs to be a content creator and think about how to better apply design thinking in the venture accelerator model.<br>-Client facing — for ConsenSys to succeed, we will need to interact with potential customers and users in order to understand their worlds, needs, and aspirations. The facilitator needs to be comfortable working with people outside the organization. Typical client sessions will be for consulting engagements and for helping teams co-create with their users.<br>-Teaching and modeling — helping teams get better at design thinking so they can apply it on their own in-between facilitator-led workshops.<br>-Stay on your feet—a facilitator is always actively adapting to the environment they’re shaping. You need to know when to be flexible, when to hold firm, and how to calmly navigate ever-changing waters.<br>-Staying organized—tracking who is asking for workshops, when you are running workshops, when you are traveling, finding supplies, planes, and hotels. Being an independent facilitator has a lot of moving pieces and you’ll most be on your own to handle your schedule.</p><p>Requirements:</p><p>-You understand human-centered design philosophy and love sharing design methodologies.<br>-You really care about how process turns innovative ideas into awesome realities.<br>-You love to learn. Blockchain, design thinking, and software development are all young enough disciplines that there is an endless amount to discover and invent.<br>-Test and learn is part of your DNA.<br>-You restlessly reinvent yourself and your facilitation practice.<br>-You question everything! You regularly ask yourself “Why does it have to be this way and how can it be better?”<br>-Self starter— you won’t have a manager in this role.  No one will tell you what you have to do, and you work better that way.<br> </p><p>Some perspectives on facilitation to check out:</p><p><a href='https://medium.com/design-ibm/build-experiences-not-features-9ae0d2c0117a' rel='nofollow'>https://medium.com/design-ibm/build-experiences-not-features-9ae0d2c0117a</a></p><p><a href='https://medium.com/design-ibm/prototyping-ibm-design-thinking-method-cards-1328080da382' rel='nofollow'>https://medium.com/design-ibm/prototyping-ibm-design-thinking-method-cards-1328080da382</a></p><p><a href='https://medium.com/design-ibm/facilitator-unconference-2017-with-design-at-business-d20696ab6354' rel='nofollow'>https://medium.com/design-ibm/facilitator-unconference-2017-with-design-at-business-d20696ab6354</a></p><p> </p><p>Application instructions:</p><p>Cover letters and resumes are not required. Instead, please send us your LinkedIn profile, website or other places where you express your creativity (writing, photography, podcasts, etc).</p></div>",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 1:48:19 AM",
    "tags": [
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:express/nodejs/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=16, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "Design Facillitation",
      "Design Thinking",
      "Designer",
      "Europe",
      "Full Time",
      "Greater London",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/nodejs",
      "TITLE1/designer",
      "TZ/unknown",
      "Workshop Design and Facilitation"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "BWCbySEMTY2uZQ6ceeDpFQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/344960-product-designer-cellarius",
    "title": "Product Designer (Cellarius)",
    "content": "<div><h2>Product Designer (Cellarius) at ConsenSys</h2><div>Brooklyn, San Francisco, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Design Thinking, User Interface, Product Design</div><div>Compensation</div><div>$100K–$120K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ConsenSys is a venture production studio focused on building and scaling tools and enterprise software products powered by Ethereum. Our mission is to use these solutions to power the emerging economic, social, and political operating systems of the planet.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, security and infrastructure, and more. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p>The excitement surrounding the possibilities of blockchain technology are at an all time high—and rightly so. Designers at ConsenSys must balance passion for the technology while knowing when and how to focus the conversation on our users. ConsenSys designers enjoy an open and inclusive culture, competitive benefits, and the freedom to explore and experiment. We are always iterating and improving our work, the culture, and ourselves. </p><p>Cellarius is currently seeking a Product Designer with a passion for science fiction, media, and art applications. You have an interest and/or experience in content creation, digital rights, and software platforms—you are passionate about the needs of users in relation to these areas. As a Product Designer at ConsenSys, you will partner with the Design Lead to take products from ideation and rough prototypes to high fidelity designs, relentlessly validating and pushing for accessible, delightful design solutions. </p><p>As a Product Designer, you will:<br>-Partner with small, global teams of engineers, product managers, and researchers to identify user needs, define product strategy, and create roadmaps<br>-Develop storyboards, prototypes, and user research to effectively communicate interaction and design ideas<br>-Actively give and solicit feedback from other designers in order to continually raise the bar for quality<br>-Grow and iterate upon our design culture by  participating in design-team-wide initiatives such as recruiting, developing design principles, and improving design tools and process<br>-Evangelize design and product thinking methodology<br>-Fearlessly take on highly complex problem areas and then publish what you learn</p><p>What we ask for:<br>-You have 3+ years of experience working as a product designer on agile teams<br>-You’ve performed qualitative research and presented your findings<br>-You have solved complex problems with elegant, shipped product—evidenced in an online portfolio featuring end-to-end product design <br>-You demonstrate product vision and use data and experimentation to provide product direction <br>-While you may not have a branding or marketing background, you understand customer experience and the relationship between brand and product design<br>-You’re excellent at articulating design decisions, presenting to clients or stakeholders<br>-You’re effective at prototyping at varying levels of fidelity</p><p>Even better if:<br>-You’re interested in or have experience with decentralized applications and blockchain <br>-You have experience at both large organizations and start-ups<br>-You have experience in an arts-focused software platform<br>-You enjoy some amount of ambiguity and freedom to experiment<br>-You’ve built or worked with design systems<br>-You have front-end development experience</p></div>",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 1:48:19 AM",
    "tags": [
      "Brooklyn",
      "DBG:surround``fulltim 4N remot",
      "Design Thinking",
      "Designer",
      "Full Time",
      "Product Design",
      "REMOTE1/100",
      "Remote OK",
      "San Francisco",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown",
      "User Interface"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "QSvaL-PhRMGuawMQcO_cIw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16739305",
    "title": "SEEKING FREELANCER - Remote UI/UX Designer Relationship Hero [YC S17] is seeking an experienced UI/UX designer to help polish its ...",
    "content": "<div>                  <span>SEEKING FREELANCER - Remote UI/UX Designer<p>Relationship Hero [YC S17] is seeking an experienced UI/UX designer to help polish its mobile web UI. You should have portfolio links to mobile apps or web projects that showcase your skills.</p><p>Examples of screens we want polished: <a href='https://imgur.com/a/dvzUr' rel='nofollow'>https://imgur.com/a/dvzUr</a></p><p>Company website: <a href='https://relationshiphero.com' rel='nofollow'>https://relationshiphero.com</a></p><p>Email: steven@relationshiphero.com [please include direct portfolio links to mobile UI projects]<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 12:08:03 AM",
    "tags": [
      "DBG:surround``seek 2W freelancerescap 4W remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "82b24s23Quik0Gqb0cXJmA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16739159",
    "title": "Zulip | Designer | San Francisco | ONSITE (preferred) + REMOTE | Full time or part time",
    "content": "<div>                  <span>Zulip | Designer | San Francisco | ONSITE (preferred) + REMOTE | Full time or part time<p>Zulip is an open source team chat product, with dozens of weekly active contributors, and an experienced core leadership based in SF (<a href='https://zulipchat.com/team/' rel='nofollow'>https://zulipchat.com/team/</a>). You can check out the product at the Zulip community server, <a href='https://chat.zulip.org' rel='nofollow'>https://chat.zulip.org</a>.</p><p>We're looking for a strong UI/visual designer. The ideal candidate has strong CSS and visual design skills, and is comfortable doing the basics with javascript, html, and git. You would be Zulip's first full-time designer, responsible for moving the overall design of Zulip forward, including developing a style guide, implementing most of the design and CSS work for new features, and working closely with frontend and full-stack engineers.</p><p>Pay is competitive. One of the big perks of working for Zulip is that all of your work will be open sourced and available forever.</p><p>Email us at jobs@zulipchat.com with a resume/portfolio, and we'll take it from there. Women and minorities encouraged to apply.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 11:53:06 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG:surround``remot 9W 4N( OR(offic,onsit), time)",
      "DBG_TECH1:k/t/w:css/frontend/6",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=7}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "GDccLaqhQu27vwBxBAVLxw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16736384",
    "title": "Chartly | Designer | Austin, TX OR REMOTE | USA only Chartly is looking for a designer to help us design dashboards and other data ...",
    "content": "<div>                  <span>Chartly | Designer | Austin, TX OR REMOTE | USA only<p>Chartly is looking for a designer to help us design dashboards and other data visualization tooling.  To be successful in this role you need experience understanding data sets and translating them into visualizations that enable users to quickly see trends, metrics etc.</p><p>Proficiency in mockup/wireframing tools is essential.  Would also be very helpful to be well-versed in HTML/CSS.</p><p>Our first product is targeted at development managers and allows them to see progress over time, but we have multiple design projects we need help with.</p><p>Please email me at harris at chart.ly and send some links to your work and/or portfolio.  Also tell me your favorite wire-framing or mockup tool.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 7:57:06 PM",
    "tags": [
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=3}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "qgOym6N5Qey2k-RrezdfHA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/gamiker/jobs/77471-lead-ui-ux-designer-artist",
    "title": "Lead UI/UX Designer/Artist",
    "content": "<div><h2>Lead UI/UX Designer/Artist at Gamiker</h2><div>Los Angeles, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Graphic Design, User Experience Design, Art Direction, 3D Modeling / Animation, UI/UX Design, Illustration, Unity3D, Animation</div><div>Compensation</div><div>$60K–$70K<br>0.1%–0.25%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div>No description available.</div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 7:24:41 PM",
    "tags": [
      "3D Modeling / Animation",
      "Animation",
      "Art Direction",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:animation/gamedev/16",
      "DBG_TECH1:k/t/w:unity3d/gamedev/8",
      "DBG_TECH1:k/t/w:unity3d/mobile/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=5, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=24, php=0, embedded=0, frontend=0}",
      "Designer",
      "Full Time",
      "Graphic Design",
      "Illustration",
      "Los Angeles",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/gamedev",
      "TITLE1/designer",
      "TZ/unknown",
      "UI/UX Design",
      "Unity3D",
      "User Experience Design"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ]
  }
]
}
