{
 "items": [
  {
    "id": "QTsEQeDPTFGRNZmw9k9iMQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168495/engineer-integrations-auth0?a=UvuJX2uIsta",
    "title": "Engineer, Integrations at Auth0  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, IT Security, Software Development / Engineering</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Auth0 provides the simplest and most secure identity platform for developers to make the internet safer. We believe in crafted software, in end-to-end ownership of projects and hyper-fast iterations. The company continues to grow rapidly and services major startups and enterprise customers. We are processing hundreds of millions of logins for thousands of customers from startups to big organizations.</p><p>We are looking for an engineer to join our Integrations team to help us enhance our existing product and add new features. The Integrations Engineer is responsible for solving complex challenges related to communications between multiple systems, in an effort to provide customizability to the authentication pipeline and expand the existing feature set through third-party services. The role will act as a liaison between internal teams and external services.&nbsp;</p><p><strong>We:</strong></p><ul><ul><li>Are remote-by-design. Work from anywhere, your office is The Internet (but we also have physical locations around the world).</li><li>Are obsessed with delivering customer value. Everything we do assumes we only succeed if our customers do.</li><li>Trust and respect each other. Building a new product is like hacking a new path through the jungle. We’ve got your back. We expect the same from you. We respect our differences and use them to our advantage.</li><li>Hold ourselves to high standards. We take pride in work done well, and constantly push ourselves towards personal betterment.</li><li>Are collaborative in nature. We believe a team is bigger than the sum of its parts.</li><li>Innovate through experiments, failure, and learning. Failure is part of our process, no blame attached.</li><li>Are transparent. We are making an explicit effort to share all data relevant to the making of better decisions. No politics. &nbsp;</li><li>Are passionate. Our common driver is trying to accomplish something meaningful.</li></ul></ul><p><strong>You will:</strong></p><ul><ul><li>Design, build, and maintain extensibility solutions for internal and external services.</li><li>Debug production issues across multiple levels of our stack.</li><li>Collaborate with fellow engineers to build new features at large-scale.</li><li>Refine engineering practices, standards, and tooling.</li></ul></ul><p><strong>You might work on:</strong></p><ul><ul><li>Adding new extensibility points to our platform (think Rules, Hooks, and Extensions).</li><li>Creating new Auth0 Extensions that expand the capabilities of the product.</li><li>Distributed systems that need to communicate well and maintain high availability.</li></ul></ul><p><strong>You might be a good fit for this role if you:</strong></p><ul><ul><li>Have a history of developing and supporting intuitive and robust extensibility solutions.</li><li>Are familiar with the challenges and approaches for designing interconnected, scalable systems.</li><li>Take an iterative approach to development, dividing long-term goals into incremental milestones.</li><li>Thrive in a fast-paced and collaborative environment.</li><li>Have familiarity with the tools we currently use, such as NodeJS, React/Redux, and MongoDB. However, we always try to use the best tool for the job, therefore we care more about your general engineering skill than knowledge of a particular language or tool.</li><li>Have experience working in a remote-first organization.</li><li>Place a high value on security.</li></ul></ul><p>It’s not expected that a single candidate has expertise in all these areas. We’re looking for professional engineers, who can quickly learn and adapt as our systems and situation changes, rather than candidates with a rigid skill set.</p><p>You can learn more about our hiring process&nbsp;<a href='https://auth0.com/blog/how-we-hire-engineers/' rel='nofollow'>here</a>.</p><p>Auth0 is an Equal Employment Opportunity employer. Auth0 conducts all employment-related activities without regard to race, religion, color, national origin, age, sex, marital status, sexual orientation, disability, citizenship status, genetics, or status as a Vietnam-era special disabled and other covered veteran status, or any other characteristic protected by law. Auth0 participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.</p>                    </div>                            <h2>                About Auth0            </h2>            <div><p>Auth0 provides an enterprise-grade platform that secures billions of log-ins every year. The company makes it easy to implement even the most complex identity solutions for their web, mobile, IoT and internal applications, as well as sophisticated identity management for employees, customers and partners. Auth0 has raised over $54 million from Meritech Capital, NTT DoCoMo, Trinity Ventures, Bessemer Venture Partners, K9 Ventures, Silicon Valley Bank, Founders Co-Op, Portland Seed Fund and NXTP Labs.</p><p>Thousands of enterprises and millions of users worldwide depend on Auth0 for authentication and authorization of their most mission-critical apps, APIs and IoT devices. Auth0’s top priorities are availability and security.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Competitive Equity                            </div>                            <div>                                 Free Nespresso                            </div>                            <div>                                 Top-of-the-Line Macbooks and other great tools                            </div>                            <div>                                 Embrace Distributed Work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 18, 2018 11:18:35 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "2zeQevypSqq_5-WdkH2OlQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/164747/accounts-and-integration-developer-bigchange-apps-ltd?a=TfyYu300Ipy",
    "title": "Accounts and Integration Developer at BigChange Apps Ltd (Leeds, UK)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>CRM, SaaS, Vehicle Tracking</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Technologies</strong></p><p>.net&nbsp;c# AWS SQL Server</p><p><strong>Job Description</strong></p><p>We are looking for a skilled developer who wants to be part of a growing company where they can design and deliver great, high quality, innovative software. This doesn't mean you have been working on the industry for years and years - just that you're really good at your job.</p><p><strong>Profile</strong></p><ul><li>Loves writing code to solve problems</li><li>Interested in the latest developments in .NET and development in general</li><li>Flexible enough to get requirements from customers and see it all the way through to release</li><li>Open minded about approach or the technology to use for each problem</li><li>Wants to work with the latest cloud based solutions</li><li>Deep knowledge of C#, SQL,</li><li>Preferably experience of cloud solutions, mobile, Big Data (and probably lots more)</li><li>Eager to share knowledge with the rest of the small, dedicated but geographically diverse team</li><li>Accounting integration experience, preferably with Sage 50 / 200 / Xero / Quickbooks and more</li></ul><p><strong>Advantages</strong></p><ul><li>Flexible working hours</li><li>The convenience of working from home (but feel free to come to the office anytime you want)</li><li>Working with the latest releases&nbsp;</li><li>The chance to influence our next steps and build something really different</li><li>New diverse challenges&nbsp;regularly</li><li>Anything else: just ask!</li></ul><p><strong>About BigChange Apps Ltd</strong></p><ul><li>BigChange are a UK based technology company specialising in Mobile Resource Management Software. We have developed in-house a SAAS system that enables businesses to improve operational efficiency and all paperwork from field operations.</li><li>We are growing by 80% year on year and have plans to grow globally in 2018</li><li>Our Founder and CEO is an Entrepreneur who values providing excellent service to our customers</li><li>We have a fantastic product… No honestly it’s brilliant.</li><li>Our customers love us</li></ul>                    </div>                            <h2>                About BigChange Apps Ltd            </h2>            <div><p><strong>About BigChange Apps Ltd</strong></p><ul><li>BigChange are a UK based technology company specialising in Mobile Resource Management Software. We have developed in-house a SAAS system that enables businesses to improve operational efficiency and all paperwork from field operations.</li><li>We are growing by 80% year on year and have plans to grow globally in 2018</li><li>Our Founder and CEO is an Entrepreneur who values providing excellent service to our customers</li><li>We have a fantastic product… No honestly it’s brilliant.</li><li>Our customers love us</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from Home                            </div>                            <div>                                 Flexible time                            </div>                            <div>                                 Family culture                            </div>                            <div>                                 Latest technology                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "5yyoaXVTSF-nuzhZw5ZC2g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/162976/senior-build-and-release-engineer-bitnami?a=SEJSjBH9qp2",
    "title": "Senior Build and Release Engineer at Bitnami",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>QA/Test Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud Services, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Loved by Devs, trusted by Ops: Bitnami’s mission is to bring awesome software to everyone. Every month, 1MM+ developers come to our site to download and launch their favorite language runtimes and applications across all major public clouds and container platforms, including AWS, Google, Azure, VMware and Docker.</p><p>We’re looking for an experienced Build and Release Engineer. This role will be responsible for reducing build and release times by improving the automation of our current release pipeline and introducing continuous deployment best practices.</p><p>You will be joining a team focused on providing the largest catalog of cloud applications and frameworks to developers. Our offerings range from turnkey solutions for components such as multi-node deployment templates for databases, caching or message brokers; to trusted containers to base their applications from such as nodejs,php or python. The perfect person for this role comes from a process-automation background and has extensive experience in the complex art of continuously releasing software.</p><p><strong>Responsibilities</strong></p><ul><ul><li>Reduce build and release times by improving the automation of our current procedures.</li><li>Stabilize and improve releases of open source software by removing manual intervention and introducing continuous deployment best practices</li><li>Extend and maintain release metrics to fuel our data-driven improvement process</li><li>Establish monitoring of our release pipeline, introducing an early warning system</li><li>Deep-dive and refactor legacy code, as needed</li><li>Be actively involved and drive team-wide discussions about software best practices</li><li>Coach and train junior members of the team</li></ul></ul><p><strong>Our Ideal Addition to the Team</strong></p><ul><ul><li>Passionately believes in our mission to bring server applications to everyone</li><li>Is experienced with releasing a complex catalog of software products to cloud systems</li><li>Has delivered build, test and release automated pipelines that are fast, efficient and reliable</li><li>Is a champion for developers, learning their biggest pain points and providing automation tools to remove them</li><li>Has experience implementing robust integration tests for user interfaces (E.g. Selenium, CasperJS or others)</li><li>Has proven ability to navigate priorities in a distributed and fast-paced environment</li><li>Has strong expertise on Agile and code management best practices</li><li>Has experience with Artifact repositories such as Jfrog, Sonatype Nexus</li></ul></ul><p><strong>Requirements</strong></p><ul><ul><li>Bachelors or Masters degree in Computer Science preferred</li><li>At least 4 years of development and deployment experience</li><li>At least 4 years of creating build and release pipelines for continuous delivery (ideally with Jenkins, Circle CI, Docker and Kubernetes)</li><li>Excellent verbal and written communication skills (English)</li></ul></ul><p><strong>Benefits/Perks</strong></p><ul><ul><li>Competitive salary and stock options</li><li>Flexible time off policy; we believe everyone needs to recharge</li><li>Your choice of machine and hardware</li><li>Annual trips to Spain (if working remotely)</li><li>Benefits vary based on location&nbsp;</li></ul></ul><p><strong>** Please do not apply if your timezone does not fall between UTC -2 and UTC +4</strong></p>                    </div>                            <h2>                About Bitnami            </h2>            <div><p>Bitnami is a globally-distributed software company, headquartered in San Francisco with team members in over 10 countries. We are a bootstrapped, profitable, high-growth company with a high-energy and passionate team.&nbsp;</p><p>Learn more about us and what it's like to work at Bitnami by visiting the&nbsp;<a href='https://bitnami.com/about-us' rel='nofollow'>About Us</a>&nbsp;and&nbsp;<a href='https://bitnami.com/careers' rel='nofollow'>Careers</a>&nbsp;pages on our website.&nbsp;</p><p><em>Bitnami is an equal opportunity employer.</em></p>            </div>                                <h2>Benefits</h2>                            <div>                                 Your choice of computer and OS                            </div>                            <div>                                 Mmmm food                            </div>                            <div>                                 Stock options                            </div>                            <div>                                 We have fun                            </div>                            <div>                                 Annual All-Hands and Offsite trip                            </div>                            <div>                                 Opportunities to work remotely                            </div>                            <div>                                 Exciting and innovative work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 10:59:50 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "nodejs"
    ]
  }
]
}
