{
 "items": [
  {
    "id": "Pu46wttBTqm5dmsvhb1OIA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/157540/ui-ux-application-and-website-designer-for-16-action-verb?a=QPI0GJzByHC",
    "title": "UI/UX, Application, and Website Designer For 16-Person All-Remote SaaS Company at Action Verb () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Lead, Manager</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise Software, Security Software, Web Hosting</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Hi! We’re Action Verb.</p><p>We build two Infrastructure-as-a-Service Platforms that empower organizations worldwide.</p><p>Our products include&nbsp;<a href='https://brickftp.com/' rel='nofollow'>BrickFTP</a>, a hosted file sharing service for business, and&nbsp;<a href='https://vaeplatform.com/' rel='nofollow'>Vae Platform</a>, a unique web hosting platform with an integrated CMS system.</p><p>Our company consists of 15 (but growing to 19 by the end of the year) full time USA-based staff, as well as sales and support outposts in France, Germany, and Latin America.</p><p>Our infrastructure platforms are used by over 2,000 enterprises and SMBs, including Mozilla, Canonical, UPS, DirecTV, GoPro, Marriott, and more.</p><p><strong>Our Success Strategy</strong></p><p>We’ve been able to achieve the rare combination of high double-digit annual growth and industry leading profitability.</p><p>We do it by aggressively recruiting the absolute best and brightest people and structuring our company in a way that makes them want to work here forever.</p><p>It’s easy to say, but exceptionally hard to execute. Here’s how we do it.</p><p><strong>We Practice Holacracy</strong></p><p><strong>We are one of the early adopters of&nbsp;<a href='http://www.holacracy.org/' rel='nofollow'>Holacracy</a></strong>, a new style of running an organization in a self-organizing manner that draws inspiration from agile software development and lean manufacturing processes.</p><p>Rather than hiring people for exactly one job description, we instead look to find well rounded team members with skills in software engineering, design, marketing, sales, and our other needs who are interested in filling multiple roles within the organization.</p><p><strong>As a self-organizing team, our people have multiple roles and our role descriptions are regularly updated via small iterations.</strong>&nbsp;As their interests change and our needs change, the roles people fill change dynamically over time.</p><p><em>&quot;Most startups believe in iteration of their products. Now they need to apply the same thinking to their organizations.&quot;<br>– Adam Pisoni, Yammer co-founder &amp; CTO</em></p><p>Holacracy is not unstructured: you’ll have a clear understanding of your current roles and responsibilities, as well as a set of rules and processes for changing those roles and responsibilities in real time.</p><p>Even though Holacracy is a lot to learn, we have a great onboarding process and the rest of our team will guide you through your first few months. You’ll also have the opportunity to attend a weeklong official Holacracy training event at our expense.</p><p><a href='http://actionverb.com/holacracy' rel='nofollow'>MORE ABOUT OUR HOLACRACY PRACTICE<span>→</span></a></p><p>We also practice Open Book Management, meaning that we share the exact details of our Balance Sheet and P&amp;L Statement with our entire team in real-time, ensuring that&nbsp;<strong>our staff has the data they need to treat the business as if it were their own.</strong></p><p><a href='http://actionverb.com/open-book-management' rel='nofollow'>MORE ABOUT OPEN BOOK MANAGEMENT<span>→</span></a></p><p><strong>Our team members work from home and choose their own hours</strong>, allowing them to make time for family, recreation, vacations, or anything that is important to them.</p><p>Every full-time team member gets 10 company-wide holidays per year as well as 20 paid time off days intended to be used for vacations. Go have fun. Don’t work all the time.</p><p><strong>Our team members also work hard, are constantly learning, and accomplish a ton for the company in the time that they are working.</strong></p><p>Our team spends at least 12 days together face-to-face per year at four to six in-person meetings spread out through the year and hosted all over the country. We try to do these meetings in cities that are fun to visit. In the last few years, we’ve been to Austin, Orlando, Minneapolis, San Diego, Las Vegas, New York City, Detroit, and Fort Lauderdale.</p><p><strong>Design Skills We’re Looking For</strong></p><p>This position is designed to appeal to designers who are not afraid to get their hands dirty writing code. You will be working on web applications, mobile apps, desktop apps, marketing websites, and email.</p><p><strong>We are looking for candidates who bring the following skills to the table:</strong></p><ul><li>Experience with web application design, marketing website design, and offline (print) design</li><li>Comprehensive understanding of UI/UX principles</li><li>Solid web front-end development skills in HTML, CSS, and JavaScript. Even though we have a great team to help you integrate your designs with our applications, in order to be a great application designer, we expect that you can implement enough JavaScript to make your designs come to life (even in a basic way).</li><li>Experience and interest in both actual application design and marketing design. We want our designers to be able to work on both sides.</li><li>History designing and supporting actual applications that have seen production usage with a large userbase.</li></ul><p><strong>Our best applicants tend to have at least 5 years history</strong>&nbsp;of producing marketing websites and web or mobile applications.</p><p>We expect to see an extensive portfolio that includes both static websites and applications.</p><p><strong>Some of Our Core Beliefs</strong></p><p><strong>We believe that everyone in the company should have programming skills.</strong>&nbsp;We want everyone here to be able to take their ideas and bring them to life. For designers, that means you have to be able to write code. It doesn’t mean you have to be an expert, but you should at least be able to implement intermediate-level jQuery and also work with React.</p><p><strong>We believe that allowing and supporting 100% remote work gives us access to great people we wouldn’t otherwise be able to hire.</strong>&nbsp;We tend to hire folks who are later in their careers, which means they usually have their family established somewhere. By offering remote work, we can hire the best people, no matter where they’re located.</p><p><strong>We believe that the best way we can acquire top talent is by being an amazing place to work.</strong>&nbsp;Work from home, travel with the team, and surround yourself with top tier people at Action Verb.&nbsp;<a href='https://actionverb.com/working-at-action-verb' rel='nofollow'>Read about everything we’ve done to make working at Action Verb great.</a></p><p><strong>We believe that building great infrastructure and platform products requires a great internal infrastructure.</strong>&nbsp;We have Continuous Integration, a full staging environment, and considerable test coverage. We built our own application deployment system. We self-manage our server environment on Amazon Web Services and custom hardware.</p><p><strong>We believe that engineers should support what they build.</strong>&nbsp;We expect our teammates to take responsibilty for the engineering decisions they make. If there are performance problems in production, nobody should have to chase anyone down. All engineers participate in a 24/7 on-call rotation and all engineers speak to customers.</p><p><strong>We believe in building products that we actually use ourselves.</strong>&nbsp;We are our own toughest critics and we put all of our products through their paces every day.</p><p><a href='http://actionverb.com/core-beliefs' rel='nofollow'>READ THE REST OF OUR CORE BELIEFS<span>→</span></a></p><p><strong>Salary and Pay</strong></p><p>As you might expect from a company that is so open, we also post our salary information right here in the job post.&nbsp;<strong>We will pay you $100,000 in your first year, plus a great benefits package, and a $2,500 signing bonus to purchase a new computer.</strong></p><p>After your first year with Action Verb, we will update your salary based on the value that you have been able to demonstrate for the company. We continue to update salary levels every year. It is possible to reach a pay level of double the starting salary if you come in and absolutely crush it.</p><p>We fully pay for your health insurance (exact plan details depend on your state of residence), and we’ll pick up the tab for 50% of your spouse or family if they wish to also join the healthcare plan. We want your family to be healthy.</p><p>We recognize that other companies may offer higher initial salary offers or signing bonuses, but at Action Verb,&nbsp;<strong>we know that for our ideal candidate, the exact level of pay is just one criteria by which they choose where to work.</strong>&nbsp;Our goal is to offer the greatest work environment possible and pay people well enough to make it possible for them to join the team. Come learn our way of working, take on as many roles as you can, and establish yourself as a valuable asset to us. Then after your first year, we’ll re-evaluate your salary and make sure it’s more than fair, given the value you’ve been able to generate for the company.</p><p><strong>Plus, you can join Action Verb Risk Free because of our $7,500 Quitting Bonus Within Your First 90 Days.</strong></p><p>We get it. Holacracy is new. Working remote is hard. We love these things about our culture, but you might not be sure if you do. Or maybe you just don’t trust us that we really do embody the Core Beliefs on this webpage. To our prospects who may be on the fence about joining Action Verb, we want to make one more offer to push you over the edge and convince you to join us.</p><p>If you don’t like working at Action Verb for any reason, quit within the first 90 days and receive a $7,500 quitting bonus. That should be enough to keep you and your family afloat while you decide on your next path. We hope that you won’t take us up on the offer, but we want you to feel good knowing that it’s there.</p><p><strong>Ready To Apply?</strong></p><p>Working here isn’t for everyone, but if you think it might be for you,&nbsp;<strong>please apply</strong>.</p><p>We only read cover letters in our first screening round, so make sure yours counts. The following are topics we’d like to see addressed in your cover letter:</p><ul><li>Why does this opportunity specifically appeal to you?</li><li>How well do you align with Our Core Beliefs? Is there anything you would add or change?</li><li>Why would working remotely for Action Verb change your life for the better?</li><li>Are you familiar with Holacracy? Any questions or concerns?</li><li>What’s lacking in your current work arrangement that we could improve?</li><li>What are your philosophies on design?</li><li>What does designing great software look like?</li></ul><p>We look forward to reading your letter!</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Fully Remote Company! Work From Home, or Anywhere.                            </div>                            <div>                                 20 Vacation Days Per Year                            </div>                            <div>                                 $2,500 Signing Bonus To Purchase A New Computer                            </div>                            <div>                                 100% Employee Health Coverage, including Dental and Vision                            </div>                            <div>                                 50% Spouse and Family Health Coverage As Well                            </div>                            <div>                                 Salary Reviews Every Year With Raises                            </div>                            <div>                                 Flexible Scheduling: Choose Your Own Hours (Within Reason)                            </div>                            <div>                                 Paid Travel: In-Person Meetings Held In a Different City Every Quarter                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH2/css3",
      "TECH2/html5",
      "TECH2/reactjs",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "css3",
      "frontend",
      "html5",
      "reactjs"
    ]
  },
  {
    "id": "sQa_gsWpQj25dCoTdy9Wuw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165402/web-designer-remote-europe-c4media?a=TtbncNzNw64",
    "title": "Web Designer (Remote, Europe) at C4Media (Madrid, Spain) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Overview</p><p>A rare opportunity to leave your creative mark on a global, highly successful company. Help us design, shape and grow our industry-leading brands ranked 5252 of all global websites, and events on 4 continents serving over 6000 attendees a year.</p><p>C4Media is looking for an experienced Web Designer / Frontend Developer with a passion for user interfaces and frontend technologies.</p><p><br></p><p>You will work with stakeholders, product managers and engineers to bring web projects to life from the concept phase and to implement them using clean, performant HTML / CSS / JS.</p><p><br></p><p>Check out our Dev Team and learn about why they like working for C4Media <a href='http://workable.com/nr?l=http%3A%2F%2Fworkable.com%2Fnr%3Fl%3Dhttps%253A%252F%252Fvimeo.com%252F184862499' rel='nofollow'>https://vimeo.com/184862499</a></p>Responsibilities<ul> <li>Working closely with stakeholders, product managers and engineers in an iterative and feedback-driven process, to design and implement highly-polished, visual layouts and interfaces. </li> <li>Creating wireframes and concept designs and coming up with effective solutions to multiple User Experience issues</li> <li>Concept fresh ideas and turn them into brilliant design </li> <li>Develop responsive layouts by writing clean, semantic code frontend code (HTML, CSS, JS)</li> </ul><br><br><p><strong>Benefits</strong></p><br><ul> <li>An awesome team of highly motivated individuals with diverse skills and background.</li> <li>Operations in Canada, Romania, USA, China, Japan, Brazil, UK, Greece, and Argentina.</li> <li>A competitive salary and benefits package.</li> <li>Visit a new country every year while attending our company meeting</li> <li>A 100% remote - work from home - team spread across 3 continents and a great company culture!</li> </ul>                    </div>                            <h2>                About C4Media            </h2>            <div><p>Software is changing the world. C4Media -provider of InfoQ.com and QCon conferences - is dedicated to serving the world-wide enterprise software development community with a place to track and facilitate change and innovation. All content published on the website and presented at the conferences is authored by industry practitioners. Our mission is to facilitate the spread of knowledge and innovation in the software developer community (since 2005).</p><p>InfoQ is a practitioner-driven global community serving the information needs of development managers, technical team leads, software architects, and project managers. Every day we create and share content in 5 different languages by developers for developers. With a readership base of over 1,000,000 unique visitors per month reading content from 100 locally-based editors across the globe, we continue to build localized communities.</p><p>QCon is a practitioner-driven conference designed for technical team leads, architects, and project managers who influence software innovation in their teams. QCon coferences are organized by InfoQ and they run 8 times/year in San Francisco, New York, London, Beijing, Shanghai, Tokyo, Sao Paulo, and Rio.</p>            </div>        ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH2/javascript",
      "TECH2/sketch",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend",
      "javascript",
      "sketch"
    ]
  },
  {
    "id": "El3mz0BETLyCSq2x3Iz-lA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165095/web-designer-remote-europe-c4media?a=TmNBmGk47cs",
    "title": "Web Designer (Remote, Europe) at C4Media (Bucharest, Romania) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Overview</p><p>A rare opportunity to leave your creative mark on a global, highly successful company. Help us design, shape and grow our industry-leading brands ranked 5252 of all global websites, and events on 4 continents serving over 6000 attendees a year.</p><p>C4Media is looking for an experienced Web Designer / Frontend Developer with a passion for user interfaces and frontend technologies.</p><p><br></p><p>You will work with stakeholders, product managers and engineers to bring web projects to life from the concept phase and to implement them using clean, performant HTML / CSS / JS.</p><p><br></p><p>Check out our Dev Team and learn about why they like working for C4Media <a href='http://workable.com/nr?l=https%3A%2F%2Fvimeo.com%2F184862499' rel='nofollow'>https://vimeo.com/184862499</a></p>Responsibilities<ul> <li>Working closely with stakeholders, product managers and engineers in an iterative and feedback-driven process, to design and implement highly-polished, visual layouts and interfaces. </li> <li>Creating wireframes and concept designs and coming up with effective solutions to multiple User Experience issues</li> <li>Concept fresh ideas and turn them into brilliant design </li> <li>Develop responsive layouts by writing clean, semantic code frontend code (HTML, CSS, JS)</li> </ul><br><br><p><strong>Benefits</strong></p><br><ul> <li>An awesome team of highly motivated individuals with diverse skills and background.</li> <li>Operations in Canada, Romania, USA, China, Japan, Brazil, UK, Greece, and Argentina.</li> <li>A competitive salary and benefits package.</li> <li>Visit a new country every year while attending our company meeting</li> <li>A 100% remote - work from home - team spread across 3 continents and a great company culture!</li> </ul>                    </div>                            <h2>                About C4Media            </h2>            <div><p>Software is changing the world. C4Media -provider of InfoQ.com and QCon conferences - is dedicated to serving the world-wide enterprise software development community with a place to track and facilitate change and innovation. All content published on the website and presented at the conferences is authored by industry practitioners. Our mission is to facilitate the spread of knowledge and innovation in the software developer community (since 2005).</p><p>InfoQ is a practitioner-driven global community serving the information needs of development managers, technical team leads, software architects, and project managers. Every day we create and share content in 5 different languages by developers for developers. With a readership base of over 1,000,000 unique visitors per month reading content from 100 locally-based editors across the globe, we continue to build localized communities.</p><p>QCon is a practitioner-driven conference designed for technical team leads, architects, and project managers who influence software innovation in their teams. QCon coferences are organized by InfoQ and they run 8 times/year in San Francisco, New York, London, Beijing, Shanghai, Tokyo, Sao Paulo, and Rio.</p>            </div>        ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH2/javascript",
      "TECH2/sketch",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend",
      "javascript",
      "sketch"
    ]
  },
  {
    "id": "naIoI9fhRDWZJ_QZp0j6dw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/166585/engineering-brand-evangelist-invisionapp?a=TRMrOEmUrsI",
    "title": "Engineering Brand Evangelist at InVisionApp () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Collaboration Tools, Computer Software, Design</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>InVision is the Digital Product Design platform used to make the world’s best customer experiences. We provide design tools and educational resources for teams to navigate &nbsp;every stage of the product design process, from ideation to development.</p><p>Today, more than 3.5 million people use InVision to create a repeatable and streamlined design workflow; rapidly design and prototype products before writing code, and collaborate across their entire organization. That includes more than 80 percent of the Fortune 100, and organizations like Airbnb, Amazon, HBO, Netflix, Slack, Starbucks and Uber, who are now able to design better products, faster.</p><p>InVision is a fully distributed company with employees in 25 countries around the world. The company has raised more than $235 million in funding from leading investors including Accel, ICONIQ, FirstMark, Tiger Global, Battery Ventures, and Spark Capital. Visit us at<a href='https://www.invisionapp.com/' rel='nofollow'>&nbsp;InVisionApp.com</a>&nbsp;and<a href='https://www.invisionapp.com/blog' rel='nofollow'>InVisionApp.com/blog</a>.</p><p>We are looking for an Engineering Brand Evangelist who will help us promote the InVision Engineering team and build relationships with potential future InVision engineers. You’ll work to craft the InVision Engineering story, bring that story to the community, and develop a strong talent pool for recruiting. The position will report to our Chief People Officer.</p><p><strong>Who you are:</strong></p><p>This position requires strong communication skills, and a deep understanding of engineering culture and community. As a member of the Recruiting team, you’ll be responsible for finding opportunities for our engineers to share content externally, engage within the community on social media, and host or join speaking engagements, conferences, or events. You should have experience growing a social media presence, writing compelling content, finding and facilitating PR opportunities, and overseeing events. You’ll also be responsible for ensuring consistency with our InVision customer branding.</p><p>The Engineering Brand Evangelist should be comfortable collaborating with:</p><ul><li>Engineering</li><li>Recruiting</li><li>Marketing</li></ul><p>You are an active and passionate member of the engineering community, who thrives on building relationships and connecting with people. You’re capable of identifying and referring strong candidates to our recruiting team. You believe that talent sourcing has changed, and companies can no longer take a passive approach to building a talent pool.</p><p>You will find compelling ways to promote our engineering talent to the greater community, raising the external profile of the InVision Engineering team as a place where great engineers do amazing engineering work. As a fully distributed remote workforce, InVision has the opportunity to hire talent anywhere in the world, and you’ll be responsible for leveraging this advantage in addition to building the engineering brand.</p><p>You should have a demonstrated ability to attract future candidates by investing time in content, talks, and projects that appeal to exceptional engineers.</p><p><strong>What you’ll do:</strong></p><p>You will oversee the InVision Engineering team’s brand, story, and community engagement, which includes:</p><ul><li>Contributing to and managing our engineering blog</li><li>Managing our InVision Engineering social media accounts</li><li>Engaging with the engineering community on social media</li><li>Hosting engineering recruiting events or hackathons</li><li>Finding ways for our engineers to engage in the community, such as answering questions on sites like StackOverflow and Quora, guest-posting on well-known blogs, or speaking at events</li><li>Promoting our open source initiatives</li><li>Creating new and exciting strategies to promote our exceptional engineers</li></ul><p><strong>Benefits &amp; Perks:</strong></p><p>InVision offers an incredibly unique work environment. The company employs a diverse team all over the world. In the United States we have team members throughout 40+ states including New York, San Francisco, Austin, Portland, and Boston. Each InVision team member is given the freedom and tools to do their best work from wherever they choose. The benefits we offer in the United States include competitive health plans and a 401k plan.</p><p>Some InVision-wide benefits offered to all employees across the globe include a flexible vacation policy, monthly coffee shop stipends, annual allowances for books related to your profession, and home office setup &amp; wellness reimbursements. InVision is an international employer so some benefit offerings will vary from country to country. Please ask our recruiting team about the benefits and perks package available in your country.</p><p>InVision is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Premium Medical, Dental, Vision                            </div>                            <div>                                 Flexible time off policy                            </div>                            <div>                                 Remote, work from home                            </div>                            <div>                                 Gym memebership                            </div>                            <div>                                 unlimited Starbucks                            </div>                            <div>                                 unlimited Amazon books                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TECH2/design",
      "TECH2/user-interface",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "design",
      "frontend",
      "nodejs",
      "user-interface"
    ]
  },
  {
    "id": "qTXkwOv1TUCFb7J-yz7XMA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/165623/principal-graphics-rendering-engineer-invisionapp?a=TxMhfMxoeSA",
    "title": "Principal Graphics (Rendering) Engineer at InVisionApp () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Collaboration Tools, Computer Software, Design</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>InVision is the Digital Product Design platform used to make the world’s best customer experiences. We provide design tools and educational resources for teams to navigate &nbsp;every stage of the product design process, from ideation to development.</p><p>Today, more than 3.5 million people use InVision to create a repeatable and streamlined design workflow; rapidly design and prototype products before writing code, and collaborate across their entire organization. That includes more than 80 percent of the Fortune 100, and organizations like Airbnb, Amazon, HBO, Netflix, Nike, Slack, Starbucks and Uber, who are now able to design better products, faster.</p><p>InVision is a fully distributed company with employees in 25 countries around the world. The company has raised more than $235 million in funding from leading investors including Accel, ICONIQ, FirstMark, Tiger Global, Battery Ventures, and Spark Capital. Visit us at<a href='https://www.invisionapp.com/' rel='nofollow'>&nbsp;InVisionApp.com</a>&nbsp;and<a href='https://www.invisionapp.com/blog' rel='nofollow'>InVisionApp.com/blog</a>.</p><p>We are looking for a Staff Graphics Engineer to join our Studio Engine team. We work in WebGL and on the canvas, In the browser and on the phone. You will be part of a small team that operates like a mini-startup. You’ll lead efforts in developing robust rendering solutions that utilize Javascript, WebGL, Canvas 2D, and custom WebGL shaders.</p><p><strong>Who you are:</strong></p><p>You have a passion for cutting edge computer graphics. &nbsp;You know what it takes to build a performant rendering solution that works in the browser but goes all the way to the GPU. &nbsp;And you get a kick out of tweaking every last bit of performance from the system. You’re someone who loves math, keeps up on the latest algorithms, and understands how to leverage the underlying hardware. You read a lot of papers, but more importantly you love turning what you learn into real-world solutions and delivering them to customers.&nbsp;</p><p>Additionally, you have:</p><ul><li>Strong skills in JavaScript, Node.js, Go, React, MongoDB, Docker, Kubernetes</li><li>5-8 years experience working as a graphics engineer (preferably WebGl)</li><li>3+ years of experience as a technical lead&nbsp;</li></ul><p><strong>What you’ll do:</strong>&nbsp;</p><ul><li>Lead and develop innovative graphics techniques, algorithms, and tools to maximize graphics quality and performance.</li><li>Promote and foster innovation within the team to produce creative solutions!</li><li>Direct and manage projects that will be the foundation of future research projects</li><li>You will be responsible for building and shipping all components necessary for your product, and you will work with Product Managers and Designers to determine the functionality, look, and feel.</li><li>You’ll build and integrate rendering engines that allow for pixel-perfect representations of design files, prototypes, and animations that run at 60fps in the browser.</li><li>Every day offers a variety of work, an opportunity to contribute new ideas, and the ability to share your knowledge through blog posts and presentations.</li><li>Ability and desire to debug hard problems at every level; you’ll build out WebGL and Canvas solutions, write unit and functional tests, and verify before deploying.</li><li>Profiling skills and the proven ability to tune for performance.</li><li>Curiosity to iterate and improve on solutions; you view unknowns as challenges and enjoy them.</li><li>Motivation to understand the business and our users, their requirements, and deliver results.</li><li>Passion for continued learning and achieving personal goals through developer community involvement and contributions.</li></ul><p><strong>Want</strong>&nbsp;<strong>to</strong>&nbsp;<strong>join</strong>&nbsp;<strong>us?</strong>&nbsp;</p><p>If this sounds like your ideal next step, you will have the ability and desire to debug hard problems at every level; you’ll build out WebGL and Canvas solutions, write unit and functional tests, and verify before deploying.&nbsp;You should have a demonstrated ability to understand and discuss technical concepts applicable to our product and technical stack, and should have experience writing a variety of technical documentation.</p><p>You will need to be organized and comfortable managing multiple tasks and competing priorities efficiently, and will be able to resolve issues collaboratively and with a focus on delivery. &nbsp;Our culture is highly team-centered, and our teams have a strong sense of ownership, drive, and sense of urgency. You should, too.</p><p><strong>Benefits</strong></p><p>InVision offers an incredibly unique work environment. The company employs a diverse team all over the world. In the United States we have team members throughout 40+ states including New York, San Francisco, Austin, Portland, and Boston. Each InVision team member is given the freedom and tools to do their best work from wherever they choose. The benefits we offer in the United States include competitive health plans and a 401k plan.</p><p>Some InVision-wide benefits offered to all employees across the globe include a flexible vacation policy, monthly coffee shop stipends, annual allowances for books related to your profession, and home office setup &amp; wellness reimbursements. InVision is an international employer so some benefit offerings will vary from country to country. &nbsp;Please ask our recruiting team about the benefits and perks package available in your country.</p><p><br> <em>InVision is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.</em></p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 Premium Medical, Dental, Vision                            </div>                            <div>                                 Flexible time off policy                            </div>                            <div>                                 Remote, work from home                            </div>                            <div>                                 Gym memebership                            </div>                            <div>                                 unlimited Starbucks                            </div>                            <div>                                 unlimited Amazon books                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TECH2/javascript",
      "TECH2/kubernetes",
      "TECH2/mongodb",
      "TECH2/node.js",
      "TECH2/reactjs",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "javascript",
      "kubernetes",
      "mongodb",
      "node.js",
      "nodejs",
      "reactjs"
    ]
  },
  {
    "id": "bMkjejWySxCERzWnDjzWpw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/faaya-lifestyle/jobs/104702-3d-graphic-designer-and-simulator",
    "title": "3D Graphic Designer and Simulator",
    "content": "<div><h2>3D Graphic Designer and Simulator at Faaya Lifestyle</h2><div>Delhi, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Graphic Design, Game Design, 3D Modeling / Animation, Blender3d, Simulations, Blender, 3D Blender</div><div>Compensation</div><div>₹500K–₹1500K<br>1.0%–10.0%</div></div><h3>Job Description</h3><div><p>Looking for someone to virtually recreate outfits from difference collection using Photo Realism and creating image that can be rendered online or an application. Light. Quick. Detailed. And we are not just talking about the images.</p></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 10:04:14 PM",
    "tags": [
      "3D Blender",
      "3D Modeling / Animation",
      "Blender",
      "Blender3d",
      "Delhi",
      "Designer",
      "Frontend Developer",
      "Full Time",
      "Game Design",
      "Graphic Design",
      "REMOTE1/100",
      "Remote OK",
      "Simulations",
      "TECH1/gamedev",
      "TITLE1/designer",
      "TZ/unknown",
      "UI/UX Designer"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "gamedev"
    ]
  },
  {
    "id": "Qflw_lg0QS-NocUuN6mCWw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/314930-product-designer-blockchain-for-social-impact",
    "title": "Product Designer (Blockchain for Social Impact)",
    "content": "<div><h2>Product Designer (Blockchain for Social Impact) at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Wireframing, Agile, Prototyping, Product Design</div><div>Compensation</div><div>$90K–$120K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ConsenSys is a venture production studio focused on building and scaling tools and enterprise software products powered by Ethereum. Our mission is to use these solutions to power the emerging economic, social, and political operating systems of the planet.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, security and infrastructure, and more. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p>The excitement surrounding the possibilities of blockchain technology are at an all time high—and rightly so. Designers at ConsenSys must balance passion for the technology while knowing when and how to focus the conversation on our users. ConsenSys designers enjoy an open and inclusive culture, competitive benefits, and the freedom to explore and experiment. We are always iterating and improving our work, the culture, and ourselves. <br>We are currently seeking a Product Designer with a passion for incubating products that have social and environmental impact. You have an interest and/or experience in payment systems, identity, and service delivery platforms—you are passionate about the needs of users in relation to these areas. As a Product Designer at ConsenSys, you will take products from ideation and rough prototypes to high fidelity designs, relentlessly validating and pushing for accessible, delightful design solutions. </p><p>As a Lead Product Designer, you will:<br>-With a design lead, work in a collaborative design process from conception to launch: partner with small, global teams of engineers, product managers, and researchers to identify user needs, define product strategy, and create roadmaps<br>-Develop storyboards, prototypes, and high-fidelity visual design to effectively communicate interaction and design ideas<br>-Actively give and solicit feedback from other designers in order to continually raise the bar for quality<br>-Mentor junior designers or interns, growing and iterating on our design culture by  participating in design-team-wide initiatives such as recruiting, developing design principles, and improving design tools and process<br>-Evangelize design and product thinking methodology<br>-Fearlessly take on highly complex problem areas and then publish what you learn</p><p>What we ask for:<br>-You have 3+ years of experience working as a product designer on agile teams<br>-You have solved complex problems with elegant, shipped product—evidenced in an online portfolio featuring end-to-end product design <br>-You use data and experimentation to provide product direction. <br>-While you may not have a branding or marketing background, you understand customer experience and the relationship between brand and product design<br>-You’re excellent at articulating design decisions, presenting to clients or stakeholders<br>-You’re effective at prototyping at varying levels of fidelity</p><p>Even better if:<br>-You’re interested in or have experience with decentralized applications and blockchain <br>-You have experience at both large organizations and start-ups<br>-You have experience consulting or co-creating product with clients<br>-You have experience working with government agencies, NGOs, or philanthropic foundations<br>-You are able to facilitate design thinking workshops<br>-You enjoy some amount of ambiguity and freedom to experiment<br>-You’ve built or worked with design systems<br>-You have front-end development experience</p></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:40:39 PM",
    "tags": [
      "Agile",
      "Brooklyn",
      "Designer",
      "Full Time",
      "Product Design",
      "Prototyping",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown",
      "Wireframing"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "-Y7BVdHwSR2poaag2fZOoA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/304849-senior-product-designer-bounties",
    "title": "Senior Product Designer (Bounties)",
    "content": "<div><h2>Senior Product Designer (Bounties) at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Design Thinking, Product Design</div><div>Compensation</div><div>$100K–$140K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ConsenSys is a venture production studio focused on building and scaling tools and enterprise software products powered by Ethereum. Our mission is to use these solutions to power the emerging economic, social, and political operating systems of the planet.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, security and infrastructure, and more. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p>About the Bounties Network:</p><p>Bounties have existed for thousands of years as a tool to incentivize the completion of tasks; now the Bounties Network creates an open standard to manage bounties on all tasks, paying in any Ethereum token. We’re working to make it cheaper and easier to outsource work to the free market, so organizations can organize dynamically around what needs to get done. Visit <a href='https://bounties.network' rel='nofollow'>https://bounties.network</a> for more details.</p><p> <br>About the Role</p><p>As a designer at the Bounties Network, you will focus on our users, continuously iterating to understand how we can make their experiences as efficient as possible. How do we make it dead simple to describe the requirements of a task, even when you don’t understand the nuances of completing it? How do we minimize the time spent looking for bounties that users are capable of fulfilling, so they can spend all of their time working? These are the questions you will be asking on a continuous basis.</p><p>You should be passionate about bringing blockchain applications to the tourist users—  the mainstream. On the Bounties Network team, you’ll enjoy an inclusive and open culture, centred around constantly exchanging positive and negative feedback. We are always iterating and improving our work, our culture, and ourselves. As a designer at ConsenSys, you’ll work as part of the design circle, our collective of designers from across the various product ventures at ConsenSys. As a Product Design Lead at the Bounties Network, you will take products from ideation and rough prototypes to high fidelity designs, relentlessly validating and pushing for accessible, delightful design solutions.</p><p> <br>As a Lead Product Designer, you will:</p><p>-Lead a collaborative design process from conception to launch: partner with small, global teams of engineers, product managers, and researchers to identify user needs, define product strategy, and create roadmaps<br>-Develop storyboards, prototypes, and high-fidelity visual design to effectively communicate interaction and design ideas<br>-Actively give and solicit feedback from other designers in order to continually raise the bar for quality<br>-Mentor junior designers or interns, growing and iterating on our design culture by  participating in design-team-wide initiatives such as recruiting, developing design principles, and improving design tools and process<br>-Evangelize design and product thinking methodology<br>-Fearlessly take on highly complex problem areas and then publish what you learn<br>-Grow a design team as products mature</p><p>What we ask for:</p><p>-You have 5+ years of experience working as a product designer on agile teams<br>-You have solved complex problems with elegant, shipped product—evidenced in an online portfolio featuring end-to-end product design<br>-You demonstrate product vision and use data and experimentation to provide product direction.<br>-While you may not have a branding or marketing background, you understand customer experience and the relationship between brand and product design<br>-You’re excellent at articulating design decisions, presenting to clients or stakeholders<br>-You’re effective at prototyping at varying levels of fidelity<br>-You demonstrate solid leadership skills and an ability to develop strong partnerships with product managers and engineers<br>-You must be able to work autonomously and be self-motivated<br> </p><p>Even better if:</p><p>-You’re interested in or have experience with decentralized applications and blockchain<br>-You’re interested in or have experience designing for fintech and accounting<br>-You have experience at both large organizations and start-ups<br>-You are able to facilitate design thinking workshops<br>-You enjoy some amount of ambiguity and freedom to experiment<br>-You’ve built or worked with design systems<br>-You have front-end development experience</p></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:40:39 PM",
    "tags": [
      "Brooklyn",
      "Design Thinking",
      "Designer",
      "Full Time",
      "Product Design",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "vyxI7MohQxW_Xki8AJWnww",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4120-motion-designer-stn-digital",
    "title": "Motion Designer @ STN Digital",
    "content": "<h2>              Motion Designer<small> @ STN Digital</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-02 21:53</p></dd>          <dt><span>Description</span></dt>          <dd><p>Do you roll your eyes at motion that doesn’t haven’t proper keyframe easing? Have you ever wanted to animate in 360? Do you scream at terrible kerning? Do you get bored after working on 1 project for over a week? Have you ever thought, “I could design that meme better”? Do you love the sports and entertainment industry, especially creating content for it?</p><p>Well… STN Digital is looking for an experienced animator, illustrator, editor, designer and all around-magician extraordinaire!</p><p>You will be responsible for ideating, designing and creating video/motion graphics content for a wide range of brands from sports to entertainment. This is a fast-paced environment and you will be constantly switching from rigging/animating 2d characters, to rotoscoping a scene, to editing promo video, to sound design and color correction and so much more.</p><p>The ideal candidate must be up-to-date on all trends in the field of motion &amp; design, and have a hunger for jumping into and learning the latest tools or programs. </p><p>Due to sports and entertainment being a 24/7, 365 industry, this is not your normal 9-5.</p><p><strong><em>This position is considering remote candidates</em></strong> </p><p><strong>Requirements:</strong></p><ul><li>Expert in Adobe Suite: primarily Premiere, After Effects, &amp; Illustrator</li><li>Ability to create complex graphics, animation, and video content for a diverse array of platforms</li><li>Branding and design capabilities</li><li>Clean illustration capabilities</li><li>Fresh and high quality visual aesthetic</li><li>Knowledge of visual effects like compositing, motion tracking, and rotoscoping</li><li>Thirst for always raising the bar</li><li>Excellent communication skills and ability to collaborate in teams or independently </li><li>Ability to adapt, modify, and customize graphics packages and toolkits</li><li>Strong organization and verbal skills</li></ul><p><strong>Major Pluses:</strong></p><ul><li>HTML, CSS, and Javascript (big BIG plus)</li><li>Knowledge of 360 software</li><li>2d character animation and rigging</li></ul><p><strong>STN offers a competitive benefits package to all full-time employees, including…</strong></p><ul><li>Paid vacation time </li><li>Paid sick time </li><li>Paid company holidays</li><li>Health insurance with employer contribution </li><li>Free 24 Hour Fitness gym membership</li><li>Monthly off-site Team Building activities</li><li>Free healthy snacks and caffeinated drinks</li></ul></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 11:53:52 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "gamedev"
    ]
  },
  {
    "id": "n2awtZTNTjWantHgPI0JlA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/mozio/jobs/92966-intermediate-senior-designer",
    "title": "Intermediate/Senior Designer",
    "content": "<div><h2>Intermediate/Senior Designer at Mozio</h2><div>Earth, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$12K–$30K<br>0.02%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Requirements:<br>- 2 years of Graphic Design/Web Design studies or equivalent<br>- 5 years hands-on design experience in web and mobile app development<br>- Up-to-date on best practices for UI design and usability (UX)<br>- Experience in prototyping (Marvel, Proto.io or equivalent)<br>- Participate in all design stages from concept to final hand-off to engineering<br>- Interact with the team to share and discuss design ideas<br>- Experience in creating clear usecases/userflows<br>- Strong design patterns skills for reuse and consistency<br>- Fluent in Photoshop or Sketch, Powerpoint, Github<br>- An online portfolio that demonstrates strong design aesthetics and user experience skill-set.</p><p>Bonus Skills:<br>- Illustration<br>- Basic knowledge of HTML, CSS and JavaScript and design limitations</p></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 9:49:44 PM",
    "tags": [
      "Earth",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown",
      "UI/UX Designer"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "jRw8dt7kRyKTZLH-q5HpDQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Brand+Strategist&c=Crowd+Mobile&l=Remote&jk=da39eba667f606a8&rtk=1c5g89oku144k3lk&from=rss",
    "title": "Brand Strategist - Crowd Mobile - Remote",
    "content": "<div><b>Brand Strategist</b><br><span>Crowd Mobile</span>     -<span>Remote</span>    </div><span>As a key member of this recently launched division, the Creative Sales Director will assume a tactical growth role, building up the client portfolio and revenues of CROWD. UK, a globally operating, data-driven influencer marketing agency connecting brands with highly engaging digital influencers in order to meet client KPI’s and deliver ROI. The Creative Sales Director will also be responsible for creating strategies and proposals and pitching to clients to win new and repeat business.<br>CROWD. and its umbrella company Crowd Mobile have worked with over 6,000 influencers over the last few years, and currently execute 250+ campaigns per month. CROWD have developed a proprietary CRM that houses 1.2m influencers and the most granular follower insight data available – a massive USP!<br><br><b>Requirements:</b><br><ul><li>3+ years client-side agency sales manager/director experience, dealing with brands and agencies and a solid understanding of the fundamental drivers to agency success</li><li>2+ years experience dealing with social media influencers essential, preferably agency, talent or brand side.</li><li>Strong creative flair and a solid understanding of key influencer marketing platforms and networks in order to come up with compelling, unique and profitable solutions for clients</li><li>B2B experience, identifying, negotiating and closing leads and then managing the relationship to continuously introduce new initiatives to drive revenues</li><li>Targets and results orientated – sales experience essential.</li><li>Strong interpersonal and communications skills at all organisational levels</li><li>A strong network of brands / agency contacts a plus, not essential</li><li>Highly organized and able to set priorities, develop a work schedule, monitor progress towards goals, and track details, data, information and activities</li><li>Relationship Builder: Establish and maintain positive working relationships with others, both internally and externally, to achieve the goals of the organisation.</li><li>Open mindedness to change and the fact that we are a new, fast paced, dynamic division – things will constantly be evolving for the better of the organization</li><li>Able to work project based hours as opposed to 9-5 hours. Frequent travel around UK and to Amsterdam when required.</li><li>Fluent English essential, second/third language a plus</li></ul>How your day would look like?<br><br><ul><li>Along with the Sales Director, champion the new sales revenue and account management tactics for the UK market</li><li>Become an expert in our service offering and product portfolio and be able to competently pitch to brands and agencies (from either your own network or by using lead generation tactics) with the aim of building a revenue pipeline and closing leads aligned with team budgets</li><li>Take the lead in creating tailor made strategies and proposals for new and existing clients to win pitches and provide tailor made solutions to clients briefs</li><li>Identify, schedule, attend and pitch to an agreed amount of key brands/agencies per month (sometimes with the Sales Director and/or GM) with the aim of strengthening our key client portfolio and revenues</li><li>Ensure there is always an abundance of warm leads by using lead generation tactics such as cold calling, LinkedIn outreach, attending summits/conferences etc</li><li>Bridging the gap between Sales, Execution and Creative to ensure an efficient sales process from pitch to delivery.</li><li>You may be required to assist in executing campaigns where required.</li></ul>Live, breathe and champion our young, innovative, results orientated and winning company culture!<br><br><b>Benefits:</b><br><ul><li>Frequent travel to our Amsterdam office, which is in the heart of Amsterdam with waterfront view</li><li>At CROWD, we believe that successful people need to have a good work/life balance - work hard, play hard</li><li>Competitive salary and bonus opportunity</li><li>You’ll be part of our young, creative, dynamic and international team</li><li>Awesome team events... You can see all the pictures at the office : )</li><li>For more check out https://www.youtube.com/watch?v=rA2VHI4XMS8</li></ul></span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 7:54:49 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "2Esx07CZQlidvl209lcJZQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Brand+Strategist&c=Crowd+Mobile&l=Remote&jk=da39eba667f606a8&rtk=1c5gchuka92paene&from=rss",
    "title": "Brand Strategist - Crowd Mobile - Remote",
    "content": "<div><b>Brand Strategist</b><br><span>Crowd Mobile</span>     -<span>Remote</span>    </div><span>As a key member of this recently launched division, the Creative Sales Director will assume a tactical growth role, building up the client portfolio and revenues of CROWD. UK, a globally operating, data-driven influencer marketing agency connecting brands with highly engaging digital influencers in order to meet client KPI’s and deliver ROI. The Creative Sales Director will also be responsible for creating strategies and proposals and pitching to clients to win new and repeat business.<br>CROWD. and its umbrella company Crowd Mobile have worked with over 6,000 influencers over the last few years, and currently execute 250+ campaigns per month. CROWD have developed a proprietary CRM that houses 1.2m influencers and the most granular follower insight data available – a massive USP!<br><br><b>Requirements:</b><br><ul><li>3+ years client-side agency sales manager/director experience, dealing with brands and agencies and a solid understanding of the fundamental drivers to agency success</li><li>2+ years experience dealing with social media influencers essential, preferably agency, talent or brand side.</li><li>Strong creative flair and a solid understanding of key influencer marketing platforms and networks in order to come up with compelling, unique and profitable solutions for clients</li><li>B2B experience, identifying, negotiating and closing leads and then managing the relationship to continuously introduce new initiatives to drive revenues</li><li>Targets and results orientated – sales experience essential.</li><li>Strong interpersonal and communications skills at all organisational levels</li><li>A strong network of brands / agency contacts a plus, not essential</li><li>Highly organized and able to set priorities, develop a work schedule, monitor progress towards goals, and track details, data, information and activities</li><li>Relationship Builder: Establish and maintain positive working relationships with others, both internally and externally, to achieve the goals of the organisation.</li><li>Open mindedness to change and the fact that we are a new, fast paced, dynamic division – things will constantly be evolving for the better of the organization</li><li>Able to work project based hours as opposed to 9-5 hours. Frequent travel around UK and to Amsterdam when required.</li><li>Fluent English essential, second/third language a plus</li></ul>How your day would look like?<br><br><ul><li>Along with the Sales Director, champion the new sales revenue and account management tactics for the UK market</li><li>Become an expert in our service offering and product portfolio and be able to competently pitch to brands and agencies (from either your own network or by using lead generation tactics) with the aim of building a revenue pipeline and closing leads aligned with team budgets</li><li>Take the lead in creating tailor made strategies and proposals for new and existing clients to win pitches and provide tailor made solutions to clients briefs</li><li>Identify, schedule, attend and pitch to an agreed amount of key brands/agencies per month (sometimes with the Sales Director and/or GM) with the aim of strengthening our key client portfolio and revenues</li><li>Ensure there is always an abundance of warm leads by using lead generation tactics such as cold calling, LinkedIn outreach, attending summits/conferences etc</li><li>Bridging the gap between Sales, Execution and Creative to ensure an efficient sales process from pitch to delivery.</li><li>You may be required to assist in executing campaigns where required.</li></ul>Live, breathe and champion our young, innovative, results orientated and winning company culture!<br><br><b>Benefits:</b><br><ul><li>Frequent travel to our Amsterdam office, which is in the heart of Amsterdam with waterfront view</li><li>At CROWD, we believe that successful people need to have a good work/life balance - work hard, play hard</li><li>Competitive salary and bonus opportunity</li><li>You’ll be part of our young, creative, dynamic and international team</li><li>Awesome team events... You can see all the pictures at the office : )</li><li>For more check out https://www.youtube.com/watch?v=rA2VHI4XMS8</li></ul></span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 7:54:49 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "ujyIz1OCSWGbPAisWQQ8dg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Brand+Strategist&c=Crowd+Mobile&l=Remote&jk=da39eba667f606a8&rtk=1c5gm7ns49ma3ej6&from=rss",
    "title": "Brand Strategist - Crowd Mobile - Remote",
    "content": "<div><b>Brand Strategist</b><br><span>Crowd Mobile</span>     -<span>Remote</span>    </div><span>As a key member of this recently launched division, the Creative Sales Director will assume a tactical growth role, building up the client portfolio and revenues of CROWD. UK, a globally operating, data-driven influencer marketing agency connecting brands with highly engaging digital influencers in order to meet client KPI’s and deliver ROI. The Creative Sales Director will also be responsible for creating strategies and proposals and pitching to clients to win new and repeat business.<br>CROWD. and its umbrella company Crowd Mobile have worked with over 6,000 influencers over the last few years, and currently execute 250+ campaigns per month. CROWD have developed a proprietary CRM that houses 1.2m influencers and the most granular follower insight data available – a massive USP!<br><br><b>Requirements:</b><br><ul><li>3+ years client-side agency sales manager/director experience, dealing with brands and agencies and a solid understanding of the fundamental drivers to agency success</li><li>2+ years experience dealing with social media influencers essential, preferably agency, talent or brand side.</li><li>Strong creative flair and a solid understanding of key influencer marketing platforms and networks in order to come up with compelling, unique and profitable solutions for clients</li><li>B2B experience, identifying, negotiating and closing leads and then managing the relationship to continuously introduce new initiatives to drive revenues</li><li>Targets and results orientated – sales experience essential.</li><li>Strong interpersonal and communications skills at all organisational levels</li><li>A strong network of brands / agency contacts a plus, not essential</li><li>Highly organized and able to set priorities, develop a work schedule, monitor progress towards goals, and track details, data, information and activities</li><li>Relationship Builder: Establish and maintain positive working relationships with others, both internally and externally, to achieve the goals of the organisation.</li><li>Open mindedness to change and the fact that we are a new, fast paced, dynamic division – things will constantly be evolving for the better of the organization</li><li>Able to work project based hours as opposed to 9-5 hours. Frequent travel around UK and to Amsterdam when required.</li><li>Fluent English essential, second/third language a plus</li></ul>How your day would look like?<br><br><ul><li>Along with the Sales Director, champion the new sales revenue and account management tactics for the UK market</li><li>Become an expert in our service offering and product portfolio and be able to competently pitch to brands and agencies (from either your own network or by using lead generation tactics) with the aim of building a revenue pipeline and closing leads aligned with team budgets</li><li>Take the lead in creating tailor made strategies and proposals for new and existing clients to win pitches and provide tailor made solutions to clients briefs</li><li>Identify, schedule, attend and pitch to an agreed amount of key brands/agencies per month (sometimes with the Sales Director and/or GM) with the aim of strengthening our key client portfolio and revenues</li><li>Ensure there is always an abundance of warm leads by using lead generation tactics such as cold calling, LinkedIn outreach, attending summits/conferences etc</li><li>Bridging the gap between Sales, Execution and Creative to ensure an efficient sales process from pitch to delivery.</li><li>You may be required to assist in executing campaigns where required.</li></ul>Live, breathe and champion our young, innovative, results orientated and winning company culture!<br><br><b>Benefits:</b><br><ul><li>Frequent travel to our Amsterdam office, which is in the heart of Amsterdam with waterfront view</li><li>At CROWD, we believe that successful people need to have a good work/life balance - work hard, play hard</li><li>Competitive salary and bonus opportunity</li><li>You’ll be part of our young, creative, dynamic and international team</li><li>Awesome team events... You can see all the pictures at the office : )</li><li>For more check out https://www.youtube.com/watch?v=rA2VHI4XMS8</li></ul></span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 7:54:49 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "EJTEED7sQtiCmW2fcnjYmg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Brand+Strategist&c=Crowd+Mobile&l=Remote&jk=da39eba667f606a8&rtk=1c5gsus169tlkba1&from=rss",
    "title": "Brand Strategist - Crowd Mobile - Remote",
    "content": "<div><b>Brand Strategist</b><br><span>Crowd Mobile</span>     -<span>Remote</span>    </div><span>As a key member of this recently launched division, the Creative Sales Director will assume a tactical growth role, building up the client portfolio and revenues of CROWD. UK, a globally operating, data-driven influencer marketing agency connecting brands with highly engaging digital influencers in order to meet client KPI’s and deliver ROI. The Creative Sales Director will also be responsible for creating strategies and proposals and pitching to clients to win new and repeat business.<br>CROWD. and its umbrella company Crowd Mobile have worked with over 6,000 influencers over the last few years, and currently execute 250+ campaigns per month. CROWD have developed a proprietary CRM that houses 1.2m influencers and the most granular follower insight data available – a massive USP!<br><br><b>Requirements:</b><br><ul><li>3+ years client-side agency sales manager/director experience, dealing with brands and agencies and a solid understanding of the fundamental drivers to agency success</li><li>2+ years experience dealing with social media influencers essential, preferably agency, talent or brand side.</li><li>Strong creative flair and a solid understanding of key influencer marketing platforms and networks in order to come up with compelling, unique and profitable solutions for clients</li><li>B2B experience, identifying, negotiating and closing leads and then managing the relationship to continuously introduce new initiatives to drive revenues</li><li>Targets and results orientated – sales experience essential.</li><li>Strong interpersonal and communications skills at all organisational levels</li><li>A strong network of brands / agency contacts a plus, not essential</li><li>Highly organized and able to set priorities, develop a work schedule, monitor progress towards goals, and track details, data, information and activities</li><li>Relationship Builder: Establish and maintain positive working relationships with others, both internally and externally, to achieve the goals of the organisation.</li><li>Open mindedness to change and the fact that we are a new, fast paced, dynamic division – things will constantly be evolving for the better of the organization</li><li>Able to work project based hours as opposed to 9-5 hours. Frequent travel around UK and to Amsterdam when required.</li><li>Fluent English essential, second/third language a plus</li></ul>How your day would look like?<br><br><ul><li>Along with the Sales Director, champion the new sales revenue and account management tactics for the UK market</li><li>Become an expert in our service offering and product portfolio and be able to competently pitch to brands and agencies (from either your own network or by using lead generation tactics) with the aim of building a revenue pipeline and closing leads aligned with team budgets</li><li>Take the lead in creating tailor made strategies and proposals for new and existing clients to win pitches and provide tailor made solutions to clients briefs</li><li>Identify, schedule, attend and pitch to an agreed amount of key brands/agencies per month (sometimes with the Sales Director and/or GM) with the aim of strengthening our key client portfolio and revenues</li><li>Ensure there is always an abundance of warm leads by using lead generation tactics such as cold calling, LinkedIn outreach, attending summits/conferences etc</li><li>Bridging the gap between Sales, Execution and Creative to ensure an efficient sales process from pitch to delivery.</li><li>You may be required to assist in executing campaigns where required.</li></ul>Live, breathe and champion our young, innovative, results orientated and winning company culture!<br><br><b>Benefits:</b><br><ul><li>Frequent travel to our Amsterdam office, which is in the heart of Amsterdam with waterfront view</li><li>At CROWD, we believe that successful people need to have a good work/life balance - work hard, play hard</li><li>Competitive salary and bonus opportunity</li><li>You’ll be part of our young, creative, dynamic and international team</li><li>Awesome team events... You can see all the pictures at the office : )</li><li>For more check out https://www.youtube.com/watch?v=rA2VHI4XMS8</li></ul></span>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 7:54:49 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "tt2IoHKVRY6mYMb-riq02w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/prokure/jobs/87795-ui-ux-designer",
    "title": "UI / UX Designer",
    "content": "<div><h2>UI / UX Designer at Prokure</h2><div>New Delhi, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>User Experience Design, UI/UX Design</div><div>Compensation</div><div>₹800K–₹1700K<br>0.1%–1.0%</div></div><h3>Job Description</h3><div><p>We're hiring craftsman to design intuitive and delightful experiences for our customers both on mobile and web. We're trying to organize the unorganized retail in India. A core part of that is building systems that enable our users to conduct trade on our platform seamlessly and can scale effortlessly. We're looking for someone who saves products from the fate of unbreachable complexity. &nbsp;Who will transform difficulty and chaos to beauty and enchanting simplicity. &nbsp;It is you who will enable every retailer using Prokure to buy the goods they need with minimal effort. At Prokure we,</p><p>Launch Quickly-<br>Your projects will be your babies. No PMs or layers of management. Launch fast, fail fast, learn faster. </p><p>Change how retail works in India-<br>Unorganized retail accounts for over 80% of India’s total retail (8X of Flipkart+Amazon+Snapdeal et al. or Big Bazaar+Reliance Fresh et al.). Your work will be used by millions of unorganised retailers to buy goods for their shops and hence to increase their business.</p><p>Feel More Connected-<br>Your work will have a direct impact on making the millions of retail outlets across the country organized, efficient, and better. And you'll hear their gratitude!</p><p>Requirements:<br>* Intellectual curiosity<br>* Outstanding portfolio that shows a hands-on UX track record with a range of customer-focused or user-focused software design solutions<br>* Proven ability with both design oversight and hands-on creation of highly crafted user experience delivarable<br>* (bonus) UI and Visual Design experience</p></div>",
    "urlFetchPending": false,
    "published": "Jan 30, 2018 9:58:12 PM",
    "tags": [
      "Full Time",
      "New Delhi",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown",
      "UI/UX Design",
      "UI/UX Designer",
      "User Experience Design"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "HYrkaAfrR0GwM66X0RqPig",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30228?r=rss2",
    "title": "You Need A Budget (YNAB): Humbly Confident UI/UX Designer",
    "content": "<p>Full-time</p><p><strong>(Anywhere)</strong> </p><p><span>YNAB is growing, and so is our design team. We’re a software ecosystem that includes personal finance apps for web, iPhone, iPad, Apple Watch, and Android phones. If you’re the one we’re looking for, you have experience in designing for most of those platforms. More important, you’re a designer who views your job as that of problem solver. You come to the table not only with a knack for interaction design and love of logical UI patterns, but also with a deep empathy for people. We design our software to fit our users more than our fancy, and you love nothing more than digging through (or conducting!) research that leads the way in the design process. You’ve been around the block a few times and know what it means to design a mature, evolving product. </span><strong></strong></p><p>&nbsp;</p><p><span>Requirements (these are real, actual requirements): </span></p><ul><li><span>You must have at least 3 years of experience working in product design </span><span>at a software company.</span><span> Complex or data-rich applications are a plus.</span></li><li><span>Experience in designing applications for both web and mobile (in your cover letter, please include the platforms for which you have designed and your level of experience with them). </span></li><li><span>We are looking for a designer who has a strong background in UX and usability but who also can design UI independently. This is a truly mixed position where you will be responsible for activities traditionally held in the “UX” and “UI” wheelhouses. </span></li></ul><p><span>That’s a super-brief intro of what you’ll be working on. But first, you need to know if you’ll even like working with us. We think you will. </span></p><p>&nbsp;</p><h2><span>A Bit About Us</span></h2><p><span>We build the best budgeting software around, YNAB or “You Need a Budget” if you have a lot of extra time on your hands. For more than a decade, people have been buying YNAB and then telling their friends what a difference it has made in their lives. (</span><a href='https://www.google.com/search?q=ynab' rel='nofollow'><span>Google us</span></a><span>, or read some of our reviews on the app store, and you’ll see what we mean.) We love building something that has a huge positive impact on people’s lives.</span></p><p><span>We’re profitable, bootstrapped, and growing. YNAB started in 2004 and we haven’t taken any outside funding—we’re in it for the long haul. </span></p><p><span>We have one overarching requirement when it comes to joining our team: our</span><a href='https://docs.google.com/document/d/16hufsixsrv1j2jZkWUgQmeKpNfQRsacnnK2xTVwO0ew/edit?usp=sharing' rel='nofollow'> <span>Cultural Manifesto</span></a><span> has to really </span><span>click</span><span> with you. If you’re nodding emphatically while reading it, you’ll probably fit right in, in which case, we can’t wait to hear from you! </span></p><p><span>First, let’s talk about life at YNAB and then we’ll go into detail about what we’re looking for. </span></p><p><span>Who you’d be working with:</span></p><p><span>Todd, </span><span>our Chief Strategy Officer, obsesses about continuously improving our products and experiences our users have in them—and knows that process begins with design. He’ll have any conversation where he has the chance to learn something, and enjoys ideas for their own sake. He likes long gaps of silence </span><span>and </span><span>very loud music, running ultramarathons, and wants to disappear someday to make hand-crafted furniture.</span></p><p><span>Alan</span><span>, one of our UI/UX designers, can be seen wearing many hats—and loving every second of it. He could be interviewing users one day and programming a prototype in Framer the next. He loves exploring ideas with teammates and lives for that rush when the team discovers a novel solution to a difficult problem. When he’s not busy designing, he’s probably either at Crossfit or working to improve his culinary skills... or contemplating the conflicts that occasionally arise between the two.</span></p><p><span>Dylan </span><span>is the other UI/UX designer at YNAB. He loves organizing design systems, obsessing over typographic details, and everything in between. Above his desk (ahem, kitchen table, it's a small apartment after all) sits an inconspicuous letterpressed card with Dieter Rams' 10 principles of good design on it. He lives in Canada with his girlfriend and six-toed cat named Pawpaw. In his spare time he's probably taking photos or running—sometimes at the same time. </span></p><p><span>Lauren </span><span>is our illustrator/designer. She is single-handedly responsible for almost all of the illustrations you see on our blog/Facebook/Instagram posts, _and_ might be single-handedly responsible for all of the WoW achievement points mentioned on our </span><a href='https://www.youneedabudget.com/about/' rel='nofollow'><span>About Page</span></a><span>. We should also mention that she designed and illustrated that page. So yeah, her list of awesome just keeps going and going. Oh, and she writes fantasy novels. Seriously.</span></p><h3><span>How You’ll Work at YNAB</span></h3><p><span>We work really hard to make working at YNAB an amazing experience. We have a team full of truly exceptional people—the kind you’ll be excited to work with. Here’s how we operate:</span></p><p><span>Live Where You Want</span></p><p><span>We’re a distributed team, so you can live and work wherever you want. Proximity doesn’t influence productivity. As I write this, Taylor (our CTO) is in, London or Brazil, or maybe back in Austin? Not all of us travel so extensively, but the fact that he does is totally okay because we’re all adults. Just make sure you have a reliable internet connection.</span></p><p><span>No Crazy Hours</span></p><p><span>We rarely work more than 40 hours per week. There have been a few occasions where things got a little crazy and people had to log some extra hours. But then they took some extra time off, so it all balances out. We work hard and smart but we’re in this for the long haul, no need to go crazy on the hours.</span></p><p><span>Take Vacation (Seriously)</span></p><p><span>We want you to take vacation. In fact, we have a </span><span>minimum</span><span> vacation policy of three weeks per year (plus two extra weeks for Christmas break). It’s important to get out and do something. We’ll look forward to seeing pictures of your vacation in our internal chat room, creatively named #office_wall.</span></p><p><span>The YNAB Meetup</span></p><p><span>We get the teams together once a year to catch up on spreadsheets and powerpoints in a Best Western conference room. Just kidding. So far, we’ve done</span><a href='https://vimeo.com/youneedabudget/review/120084054/93e11d6343' rel='nofollow'><span> Costa Rica</span></a><span>, a </span><a href='https://www.youneedabudget.com/if-you-feel-guilty-spending-money-youre-doing-it-wrong/' rel='nofollow'><span>gigantic cabin</span></a><span> in the mountains, and a beach house in the Outer Banks. We do really fun things, but the highlight always seems to be just hanging out together and having a blast.</span></p><p><span>Up Your Game</span></p><p><span>We’re serious about helping you improve your craft. We budget for it (hey-o!). Think conferences, Lynda subscriptions, dedicated time away from work to learn something new... it’s really up to you and your manager. But we love to see our people growing. &nbsp;</span></p><p><span>International is Absolutely Okay</span></p><p><span>If you are Stateside, we’ll set you up as a W2 employee. If you’re international, you’ll be set up as a contractor. Employee or contractor, it’s all the same to us. You’re part of the team. (We are spread all over the world: Switzerland, Scotland, Mexico, Brazil, Canada, and all over the United States.)</span><strong></strong></p><p><span>If You’re Stateside…</span></p><p><span>YNAB offers fantastic health, dental, and vision insurance, where we cover 100% of the premium for you </span><span>and your family.</span><span> (No need to check your vision, you read that right, 100%. Although if you did need to check your vision, NBD, we’ve got you covered!)</span><strong></strong></p><p>&nbsp;</p><p><span>We also have a Traditional and Roth 401k option. YNAB contributes three percent whether you choose to throw any money in there or not. It vests immediately. (Are you a personal finance junkie like our founder Jesse? He set up YNAB’s 401k to have the lowest fee structure possible, where all plan costs are paid by YNAB, not </span><span>your retirement</span> <span>nest egg</span><span>. The investment funds available are fantastic, passively-managed, ultra low-cost index funds. You’re not a PF junkie? Why then, did you muddle through all of that awesomeness?)</span></p><p><span>Other Tidbits</span></p><ul><li><span>Once you start, we DEMAND (in a friendly, ALL CAPS IS YELLING way) that you fill out your “Bucket List” spreadsheet with 50 items. (That’s harder than it sounds!) </span></li><li><span>The bucket list really helps in deciding what we should give you for your birthday and Christmas: No gift cards here. We tried that. Super boring. </span></li><li><span>We have a bonus plan based on profitability. You’ll be in on that from day one. YNAB wins, you win. That kind of thing.</span></li><li><span>We’re all adults. There’s no need to punch a clock, or ask for permission to take off early one afternoon to go see the doctor (health insurance premium 100% covered!). We look at what you’re accomplishing, not how long you sit (have you tried </span><span>standing</span><span>?) in front of a computer.</span></li><li><span>We want you firing on all cylinders so we’ll set you up with a shiny new computer and replace it every three years.</span></li><li><span>Did I mention we make a huge, positive difference in people’s lives? You may not </span><span>think</span><span> that matters much, but then a few months down the road you’ll realize it’s made your job really, really enjoyable. Don’t underestimate this one!</span></li></ul><p><span>If this sounds like your ideal environment, read on because now I want to talk about you. </span><span>You will play a big, big part in helping YNAB customers achieve success.</span><span> You will change lives. I’ll only say that six more times.</span><strong></strong></p><h2><span>Now, back to you, our new UI/UX Designer...</span><strong></strong></h2><h3><span>What Success Looks Like: </span></h3><p><span>At YNAB, our goal is for our users to achieve life changing financial control. No small thing, right? In 2018, you’ll join our two product designers, working on both our web and mobile platforms. In 2018, we’ll focus intensely on making YNAB </span><span>effortless </span><span>and helping new budgeters get started effectively, from their very first experience. You will also help us develop systems and processes to more efficiently deliver top-notch, dare we say life-changing, experiences to our users.</span></p><p><span>You’ll need to: </span><strong></strong></p><ul><li><span>Learn the design system, UI patterns, and financial logic of our apps like the back of your hand. You have no problem designing a cross-platform feature for the web and mobile apps. You can clearly discern and navigate the relationship between the UI and the available data behind the scenes. </span></li><li><span>Solve design problems in a user-centric feedback loop. Research plays a big part in our design process so you’ll need to break down analytics and user feedback to make informed design decisions. You’ll also follow up on the data gathered after the feature is released and continue to iterate and improve your designs until the data confirms success. </span></li><li><span>Shepherd your work from ideation to release. You will document your work for review with fellow designers, developers, and stakeholders, make agreed upon refinements, and will work with the developers on the upcoming feature. Design reviews during the development process examine form and function and you will see the feature through to the end. </span></li><li><span>Be comfortable iterating with low-fidelity designs and prototypes while working in cross-functional teams made up of developers, marketers, and customer-facing team members (waterfalls are for rivers!), while continuing to pursue a meticulous and thorough design.</span></li><li><span>Communicate and document the styling, user flows, and the impact of your designs on other parts of the system. You’ll update this documentation as feedback comes in and the apps evolve. On the flip side, you’ll provide feedback in design reviews that is clear and helpful in moving our products forward.</span></li><li><span>Communicate, explain, persuade, explore and otherwise get all the things done </span><span>in writing. </span><span>Yes, we like talking to each other, but as a remote team, much of our collaboration is asynchronous and written.</span></li><li><span>Be comfortable writing a first pass at UI copy which is then refined with the help of your team in design reviews. There’s no lorem ipsum here. </span></li><li><span>You are comfortable speaking the language of software development. If you’re also comfortable diving into HTML and CSS (or even one of the programming languages in our development stack!) to help implement your design work, that’s a plus, but it’s not a requirement.</span></li><li><span>We use Sketch for the vast majority of design work and maintain a design system using version control in Abstract. You will aide in the expansion and maintenance of the design system and feel comfortable contributing new UI for our applications and website. If you have experience developing and maintaining design systems and can help us strike a balance between fighting for consistency and pushing the design system forward, that’s another plus.</span></li><li><span>Be comfortable talking to customers in user interviews and usability testing. You have a knack for summarizing research in a concise way to share with teammates. </span></li></ul><p><span>Finally, the success of a designer at YNAB hinges upon the ability to approach design as holistic problem solving for both user and business goals. We work collaboratively here and you’ll listen to ideas, questions, and critiques from teammates with grace and patience. That said, you know your stuff and can eloquently and logically explain design decisions. You see this type of exchange as critical to the success of yourself and our product: it is through sharing ideas and being open to the brilliance of others that we arrive at the best solutions. </span><strong></strong></p><p>&nbsp;</p><p><span>Starting salary will be between $85k and $102k, depending on experience.</span><strong></strong></p><p><span>How to Apply</span></p><p><span><a href='https://ynab.recruiterbox.com/jobs/fk0flxd' rel='nofollow'>Apply here*</a> by 11:59PM on </span><span>February 7th, 2018.</span> <span>Firm. It’s a real deadline.</span></p><p><span>*Note: Be sure to read and follow the instructions for applying on the bottom of that page. </span></p><p></p><p><strong>Job Perks:</strong> -Make a huge, positive difference in peoples lives.-Work collaboratively with an amazing group of passionate people.-Live where you want (we're fully remote)-Minimum paid vacation of 3 weeks (+2 weeks for Christmas)-100% covered health insurance for you and your family (U.S.). -3% 401k contribution (U.S.)</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Jan 23, 2018 11:30:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TECH1/mobile",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go",
      "mobile"
    ]
  },
  {
    "id": "-E2t9JWwQgGilcimzMWh0g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/mangoreader/jobs/19504-ios-developer-designer-to-craft-stories-for-kids",
    "title": "iOS developer, Designer to craft stories for kids",
    "content": "<div><h2>iOS developer, Designer to craft stories for kids at MangoReader</h2><div>Gurgaon, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Javascript, Android, iOS Development</div><div>Compensation</div><div>₹10K–₹30K<br>0.2%–2.0%</div></div><h3>Job Description</h3><div><p>You are an iOS developer who can create experiences for iphone/ipad and use the latest frameworks to make things amazing.<br>Or you are someone who owns a macbook and wants to learn and build the next storybook app for children to help them learn better.<br>either way, apply with examples of apps you have built and published</p></div>",
    "urlFetchPending": false,
    "published": "Jan 23, 2018 9:45:13 PM",
    "tags": [
      "Android",
      "Designer",
      "Full Time",
      "Full-Stack Developer",
      "Gurgaon",
      "Javascript",
      "Mobile Developer",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/designer",
      "TZ/unknown",
      "iOS Development"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ]
  },
  {
    "id": "MrO8ity7Sv20nvQNewRo3w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/clevertech-ux-ui-designer",
    "title": "CleverTech: UX/UI Designer",
    "content": "<div>  <div>    <h2>UX/UI Designer</h2>      <h4>Posted Jan 19</h4>    <h3>      <span>CleverTech</span><br>      <span>Headquarters: Remote</span><br>        clevertech.biz/careers    </h3>  </div>    </div>  <div>    <div><h4>DESCRIPTION</h4></div><div>Clevertech is looking for a UX/UI Designer to join our global team. We are looking for team members to help us develop world class software products for the most exclusive organizations in the world. We have been at this for seventeen years, and continue to grow off our best asset, our people.</div><div><br></div><div>In this role you will have significant responsibility in one of our project development teams to ensure client satisfaction by executing on the deliverables.</div><div><br></div><div><h4>REQUIREMENTS</h4></div><div>Clevertech looks for craftsmen developers who take ownership of their designs. You can deliver quickly while being clever to avoid missteps. You have an effective positive attitude that shines as you show your care about client and colleague concerns. You are always learning and are a transparent communicator even when it is challenging. You thrive on challenging yourself daily and seek to surround yourself with like minded individuals.</div><div><br></div><div>You understand good UX and good UI and what that means and love to create successful designs (that delight customers) and you can successfully bring a whole concept from idea to wireframe, to mockup/prototype and have the deliverables to prove it. You have worked in significant mobile projects and have participated in the full design cycle to deliver world class, pixel perfect designs.</div><div><br></div><div><h4>BENEFITS</h4><h5>Own Your Time</h5></div><div>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We are a collective of like minded people in over ten countries, and our global perspective shapes our every move.</div><div><br></div><div><h5>Focused Work</h5></div><div>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams. And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</div><div><br></div><div><h5>Learn at your edges</h5></div><div>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</div><div><br></div><div>And of course, if you speak at a tech conference, we cover all expenses.</div><div><br></div><div><h5>Recharge Time</h5></div><div>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</div><div><br></div><div>Want to learn more about Clevertech and the team? Check out&nbsp;<a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://clevertech.biz/careers/53d637deece32f542d110354' rel='nofollow'>https://clevertech.biz/careers/53d637deece32f542d110354</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 18, 2018 8:37:40 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "QJwgJG8nTUayNsSqVCcdhw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/65270/product-ux-designer-at-obby/",
    "title": "Product / UX designer",
    "content": "**About Obby**<br /><br />Obby - https://obby.co.uk - is London's leading education marketplace. We help independent teachers, makers and artists earn a living doing what they love - teaching, whilst providing Londoners with the best educational classes, courses and workshops.<br /><br />From painting to pottery and soon to include language lessons, music classes and more, Obby's mission is to provide incredible learning experiences, help people get offline and learn something you fall in love with.<br /><br />**What we are looking for**<br /><br />We’re looking for an experienced UX / UI Designer who can take over our design team and help us build a product that our users love. Our goal is to put design at the focus of our product &amp; brand and we are looking for the right person to take on that challenge.<br /><br />**How we work**<br /><br />The engineering team is led by Pedro. Pedro loves building things from scratch (especially electric Skateboards and lately, building a fully electric bus), cryptocurrencies, and tweeting about Elon Musk.<br /><br />The product team is led by our co-founder Max, who loves Bayern Munich football club, Pirate Metrics and listening to Pedro talk about Elon Musk.<br /><br />We work remotely across a shared timezone and are focused on building new products from scratch and running a continuous growth process.<br /><br />We are building a product-focused culture and despite working remotely, try to get together in Lisbon, or London, once a quarter to work together for a week (and also spend some time together listening to Pedro talk about Elon Musk - he really likes Elon).<br /><br />You will be working directly with Pedro and Max, speaking to users, redesigning existing features, running quick iterative tests and building new products. Additionally, you will take lead on owning and updating the brand &amp; messaging.<br /><br />**Who we are looking for**<br /><br />We are looking for someone with 2-3 years of experience in UX / UI design at a technology business. We focus on aptitude over skill - what we look for the most is that you are eager to learn and take on new challenges, and have a keen eye for beautiful products &amp; brands.<br /><br />Additionally, we are looking for team members who are excited about the Obby mission, providing independent teachers with a platform to share their skills and generate an income doing what they love.",
    "urlFetchPending": false,
    "published": "Jan 18, 2018 1:02:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "oV16EDCETqylp81Kx_hPng",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/hotjar-ux-ui-designer",
    "title": "Hotjar: UX / UI Designer",
    "content": "<div>  <div>    <h2>UX / UI Designer</h2>      <h4>Posted Jan 18</h4>    <h3>      <span>Hotjar</span><br>      <span>Headquarters: Malta</span><br>        <a href='https://careers.hotjar.com/o/ux-designer-malta/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/ux-designer-malta/?source=WeWorkRemotely</a>    </h3>  </div>    </div>  <div>    <div><strong>Note:</strong>&nbsp;Although this is a remote position, we are seeking candidates in the following timezones only: Europe (UTC+0 - UTC+4), US (EST or CST only).</div><div></div><div><br></div><div><strong>About Hotjar</strong></div><div><br></div><div>Hotjar is a 100% remote organization headquartered in the Mediterranean on the island of Malta. Our company vision is to change the way the web is built and improved by democratising user analytics and feedback. Our core product is free and available to anyone with an internet connection.</div><div><br></div><div>Hotjar is a rapidly growing startup which gives thousands of website owners, teams and professionals the tools needed to discover how their visitors are really using their sites. This is an excellent remote career opportunity in a key position in a fast growing startup that is actually making a difference in the marketing community and industry.</div><div></div><div><br></div><div><strong>About this role:</strong></div><div><br></div><div>Hotjar’s Marketing team is looking for an ambitious and driven UX/UI Designer who is passionate about creating simple and elegant solutions to complex problems. This position will play an integral role in a team ruthlessly focused on improving the user experience and product adoption by creating simple, engaging experiences that are validated through testing and iterating. We appreciate designers who think in systems, are eager to validate their work, can communicate effectively, and love collaboration and feedback.</div><div></div><div></div><div><br></div><div><strong>As a UX/UI Designer, you will:</strong></div><div><br></div><ul><li>Create thoughtful and appropriate solutions to design challenges of all sizes by translating research insights into simple and engaging web experiences.</li><li>Be a part of a multidisciplinary marketing team whose purpose is to meticulously test and improve the visitor to customer journey across the Hotjar website and product.</li><li>Produce web experiences that drive engagement aligned with project goals using design flows, sketches, prototypes, and the Hotjar product to iteratively improve experiences.</li><li>Translate wireframes and experiences into high-fidelity visual composites with attention to interaction design which follow style and brand guidelines.</li><li>Collaborate with Demand Generation, Content, Product Marketing, and Product Design Teams in an iterative, transparent and feedback driven process.</li></ul><div></div><div><br></div><div><strong>Compensation Range</strong></div><div><br></div><div>The budgeted compensation range for this role is €50,000 to €70,000 annually based on your experience and skill-level. Ranges are based on market research and are equitable to other roles within Hotjar. The actual compensation offered to a successful candidate will be based on relative experience and skills. At this time we are only able to provide official employment status to those located in Malta. All other candidates will join our team as full-time consultants and will be responsible for paying any taxes or applicable fees where they reside.</div><div><br></div><div><h4><b>Requirements</b></h4></div><ul><li>A minimum of 4 years experience designing digital experiences, products and systems.</li><li>Experience leading user research projects (including user testing sessions) and validating design efforts.</li><li>Demonstrated ability in the entire product development process, from research and problem solving through to detailed UI and visual design.</li><li>Ability to prototype ideas quickly and iterate as many times as needed using tools such as InVision, Framer, Principle, HTML/CSS/JS, etc.</li><li>Excellent self-starter who always thinks MVP first, collaborates effectively with marketers and developers, and has the ability to work in a fast-paced team.</li><li>Strong communicator and fluent in English with excellent written and verbal communication skills.</li><li>Must submit to a background check confidentially processed by our third party.</li><li>Assets: Experience using Photoshop, Sketch, HTML / CSS / JS development, experience working in a multidisciplinary marketing team and/or engineering team, experience working remotely.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply via <a href='https://careers.hotjar.com/o/ux-designer-malta/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/ux-designer-malta/?source=WeWorkRemotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 17, 2018 3:56:57 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "RM-zCns5RHGPcMAfDd5fBQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/hotjar-product-designer-europe",
    "title": "Hotjar: Product Designer (Europe)",
    "content": "<div>  <div>    <h2>Product Designer (Europe)</h2>      <h4>Posted Jan 18</h4>    <h3>      <span>Hotjar</span><br>      <span>Headquarters: Malta</span><br>        <a href='https://careers.hotjar.com/o/product-designer-europe/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/product-designer-europe/?source=WeWorkRemotely</a>    </h3>  </div>    </div>  <div>    <div><strong>Note:&nbsp;</strong>Although this is a remote position, we are currently&nbsp;only seeking candidates in Europe-aligned timezones&nbsp;between UTC-2 and UTC+4.&nbsp;</div><div><br></div><div>We are looking for an ambitious and driven Product Designer who is passionate about creating simple and elegant solutions to complex problems which will help design the future of Hotjar – a solution used by thousands of users worldwide. Product designers serve a vital role here by creating simple, engaging experiences, iteratively improving the user journey, and crafting every product detail. We appreciate designers who think in systems, are eager to validate their work, can communicate effectively, and love collaboration and feedback.</div><div><br></div><div>Hotjar is a rapidly growing startup which gives thousands of website owners, teams and professionals the tools needed to discover how their visitors are really using their sites. This is an excellent remote career opportunity in a key position where you can make a difference in the UX community and industry.</div><div></div><div><br></div><div><strong>As a Product Designer, you will:</strong></div><div><br></div><ul><li>Create thoughtful and appropriate solutions to design challenges of all sizes by translating research insights into simple and engaging user interfaces which satisfy user needs, business requirements and technical constraints.</li><li>Be a part of one of our multi­disciplinary product teams to lead the design process, facilitate design discussions and validate product/experience changes and improvements.</li><li>Produce engaging experiences using design flows, sketches, prototypes to collect feedback, and iteratively improve and support the design process.</li><li>Translate wireframes and experiences into high-fidelity visual composites with attention to interaction design which follow style and brand guidelines.</li><li>Collaborate with design leadership, stakeholders, and engineers in an iterative, transparent and feedback driven process.</li></ul><div></div><div><br></div><div><strong>Compensation Range</strong></div><div><br></div><div>The budgeted compensation range for this role is €50,000 to €70,000 annually based on your experience and skill-level. Ranges are based on market research and are equitable to other roles within Hotjar. The actual compensation offered to a successful candidate will be based on relative experience and skills. At this time we are only able to provide official employment status to those located in Malta. All other candidates will join our team as full-time consultants and will be responsible for paying any taxes or applicable fees where they reside.</div><div><br></div><div><h4><b>Requirements</b></h4></div><ul><li>A minimum of 4 years experience designing digital products and systems, not just websites. You have helped ship products.</li><li>Experience designing experiences for desktops, tablets and phones.</li><li>Experience leading user testing sessions and validating design efforts.</li><li>Demonstrated ability in the entire product development process, from research and problem solving through to detailed UI and visual design.</li><li>Ability to prototype ideas quickly and iterate as many times as needed using tools such as InVision, Framer, Principle, HTML/CSS/JS, etc.</li><li>Excellent self-starter who always thinks MVP first, collaborates effectively with engineers, and has the ability to work in an agile and fast-paced team.</li><li>Strong communicator and fluent in English with excellent written and verbal communication skills.</li><li>Must submit to a background check confidentially processed by our third party.</li><li>Assets: Experience using Sketch, HTML / CSS / JS development, experience working embedded in a team of developers, experience working remotely.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply via <a href='https://careers.hotjar.com/o/product-designer-europe/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/product-designer-europe/?source=WeWorkRemotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 17, 2018 3:15:35 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/embedded",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "embedded",
      "frontend"
    ]
  },
  {
    "id": "Z9txe1ngS0OhZrvoscutqA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/65207/senior-product-designer-at-patsnap/",
    "title": "Senior Product Designer",
    "content": "About Patsnap<br />PatSnap (backed by Sequoia) is the world's leading Intellectual Property Analytics and Management platform that empowers senior business leaders to accelerate growth through Innovation and R&amp;D. IP and patent strategy is now a major board level priority – our product solves a real and growing problem globally. Our differentiation is the reason behind the company’s exponential growth.<br /><br />Our market is limitless because patent strategy is relevant to all businesses ranging from NASA to PepsiCo.<br /><br />PatSnap now employs over 900 people worldwide with offices in London, China, Singapore, and Los Angeles, and is doubling year-on-year.<br /><br /><br />Patsnap's design approach<br /><br />User-centricity -- Design starts with research, not mockups.<br />The Double Diamond -- Problem before solution. Expand and narrow.<br />Collaborative design -- Design solutions come from everyone.<br /><br />Overview of the role<br />You will contribute strategic thinking around product direction and vision. Defining not just how things work, but what we should be building.<br />You will be a sounding board, and a mentor to other members of the design team.<br />You will be one of the three legs in the trifecta of a product team, utilizing your full range of product design, interaction design, and visual design skills:<br />Partner closely with engineering, product and business to become and expert of the product and find elegant and practical design solutions— whether from you, your team or otherwise, you will create the space to collaborate.<br />Let the users lead your decisions. Empower your team to be hands-on with user research. Be curious and thoughtful about users' needs and constantly look for user validation either through hands-on research, or by designing an A/B test.<br />Know when to optimize for quick-and-dirty, versus painstakingly delightful. Support the team in delivering their efforts into the hands of our customers.<br />Be a master at communicating your solutions, and the thinking behind them, in and outside of your team. But especially to your engineering team in China.<br />REQUIREMENTS<br />Minimum qualifications:<br /><br />You have 5+ years experience as a product designer<br />Ability to synthesise data and research to create user flows, wireframes, information architecture and polished UI screens. You are well versed in data-driven experimentation and validation.<br />Confident communication skills that empower you to present to stakeholders and articulate complex ideas and design decisions.<br />Previous experience mentoring and leading other designers to create their own delightful design solutions.<br />Have a solid understand of web frameworks, design systems and how to define design specs.<br />You’ve shipped many mature products and have a strong portfolio to demonstrate your impact as a designer which you can share with us online or via PDF.<br />Preferred qualifications:<br /><br />Experience designing B2B, enterprise or SaaS products.<br />Previous collaborations with remote/international/China teams.<br />Experience designing for groups of people (international audiences, multi-language localization etc)<br /><br />BENEFITS<br />What we offer<br /><br />The opportunity and autonomy to reinvent, and change the course of a successful, matured product. To shape PatSnap's future, and the future of how R&amp;D is done — a space that, ironically, hasn't seen much innovation.<br /><br />PatSnap's mission is to help companies accelerate innovation. We serve R&amp;D teams that work on everything from sending us to Mars, discovering life-saving drugs, thrilling us with F1 cars, and sustaining us with preserved foods.<br /><br />Besides being one of the fastest-growing SaaS companies (backed by Sequoia, Summit Partners, and Xiaomi’s founder), we're particularly proud of our multi-cultural, East-meets-West DNA.<br /><br />We're about diversity. We're also about providing opportunities for do-ers and learners, whilst at the same time, making sure we listen to the been-there-done-that's.<br /><br />We hold our values strongly:-<br /><br />Integrity without compromise<br />Self-learning &amp; practitioner mindset<br />Dare to dream big and make mistakes<br />Customer-centricity<br />Teamwork and sharing<br />Radical candor with courage",
    "urlFetchPending": false,
    "published": "Jan 17, 2018 10:10:22 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "yM-5I_jTQIa6l91_OPikYg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/harvest-product-designer",
    "title": "Harvest: Product Designer",
    "content": "<div>  <div>    <h2>Product Designer</h2>      <h4>Posted Jan 10</h4>    <h3>      <span>Harvest</span><br>      <span>Headquarters: NYC</span><br>        <a href='https://www.getHarvest.com/' rel='nofollow'>https://www.getHarvest.com/</a>    </h3>  </div>    </div>  <div>    <div><strong>Who We Are</strong></div><div><br></div><div>Harvest is an independent software company funded the old fashion way: paying customers. We provide products&nbsp;to help businesses work smarter. For the past 11 years, our customers have relied on our products as a critical part of their day-to-day operations. From small creative agencies to household brands, we are proud to serve over 50,000 businesses around the world.<br></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div>Harvest began as a team of 3 and grew slowly to today’s total of over 50 lovely faces. Though we have an office in NYC, we hire the right people for the job no matter where they call home. We’ve worked as a remote team since the beginning, and we work hard to make sure everyone feels included and heard.<br></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div>We are looking for an experienced Product Designer to join our small but growing product design team at Harvest.<br></div><div></div><div></div><div></div><div></div><div></div><div>Harvest is committed to building a more diverse and inclusive company.<br></div><div></div><div></div><div></div><div></div><div></div><div><strong><br></strong></div><div><strong>What You Will Do</strong><br></div><div></div><div></div><div></div><div></div><div></div><ul><li><strong>Lead projects from idea to production.</strong>&nbsp;Product Designers at Harvest lead the charge on customer-facing projects. You will work directly with small teams of developers to make ideas happen. You’ll support your team, oversee the timeline, and collaborate across teams in order to do your best work.</li><li><strong>Research customer needs.</strong>&nbsp;To make informed decisions, you’ll rely on a mix of data and customer conversations. You recognize that the most important thing in research is to ask ourselves (and our customers) the right questions.</li><li><strong>Clearly define and articulate problems and why they're worth solving.</strong>&nbsp;You know there’s no glory in coming up with the perfect solution to the wrong problem, so you’ll do the work to make sure the problem is properly framed and clearly defined for your teammates.</li><li><strong>Design interactions, workflows, and interface copy to solve real problems for the Harvest user.</strong>&nbsp;You’ll strike a balance between the ultimate solution and shipping quickly with smart scope management.</li><li><strong>Participate in product and design discussions.&nbsp;</strong>Your input will be sought by other Product Designers and Leadership on design solutions, ways to improve our work as a team, and ideas for product roadmaps.</li></ul><div><strong><br></strong></div><div><strong>Who You Are</strong><br></div><div></div><div></div><div></div><div></div><div></div><ul><li>You have 2+ years of experience in a similar role</li><li>You have excellent communication skills, with passion and ability to collaborate with your teammates through written communication. (This is especially important as most of your teammates will be working remotely)</li><li>You have a track record for crafting effective and compelling user experiences for desktop or mobile</li><li>You are known for your discipline, attention to detail, and exceptional organizational skills</li><li>You have a rough idea of the technical effort associated with your design solutions</li><li>You have experience prototyping solutions with design tools or HTML/Javascript/CSS</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please follow the directions found at the bottom of this link: <a href='https://harvest.workable.com/j/3A57F420A5' rel='nofollow'>https://harvest.workable.com/j/3A57F420A5</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 9, 2018 6:22:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "mGwbL-gnRS--dtQJ1gUnJA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/moveon-org-web-designer",
    "title": "MoveOn.org: Web Designer",
    "content": "<div>  <div>    <h2>Web Designer</h2>      <h4>Posted Jan  6</h4>    <h3>      <span>MoveOn.org</span><br>      <span>Headquarters: Anywhere</span><br>        <a href='https://front.moveon.org/' rel='nofollow'>https://front.moveon.org/</a>    </h3>  </div>    </div>  <div>    <div><span><br></span></div><div><b><span>Full-Time</span><span> •&nbsp;Starts ASAP and ends June 1 • Competitive Pay • Excellent Benefits &nbsp;• Work from Anywhere in the Continental U.S.</span></b></div><div><br></div><div><span>As a pillar of the current Resistance movement, MoveOn is mobilizing opposition to Donald Trump and the GOP’s toxic agenda, including helping to lead efforts to defend health care, to stop any new U.S. wars, fighting for a clean Dream Act, and opposing tax cuts for big corporations and the rich. We are determined to make the 2018 elections a turning point, helping Democrats win the House to create a roadblock to Trump &amp; Republicans’ ability to advance their toxic agenda, while electing new progressive champions who can help lead our country to a better future in races down-ballot races across the country. </span></div><div><br></div><div><span>In preparing for the opportunities and challenges ahead of us in 2018, MoveOn is investing deeply in building technology that mobilizes ordinary people’s voices in our democracy at scale. Excellent user experience and design across our digital tools and and websites will be critical to our success. </span></div><div><br></div><div><span>The Web Designer will work at the intersection of technical and political teams on projects that will lay the groundwork for and directly impact the success of our 2018 electoral work, mobilizing and amplifying the work of members and volunteer leaders. </span></div><div><br></div><div><span>Do you want to bring your vision of excellent user experience to MoveOn’s 2018 election program? Join our team! Work alongside MoveOn’s core team of strategists, organizers, data scientists, and software engineers on technical projects that lift up progressive values, defend vulnerable communities, and lead the Resistance movement.</span></div><div><br></div><div><span>Responsibilities:</span><br></div><div></div><div></div><div><span><br></span></div><ul><li><span>Lead the design implementation of an ongoing rebranding process that will modernize all MoveOn’s web properties, including our </span><a href='https://front.moveon.org' rel='nofollow'><span>blog</span></a><span>, our donation </span><a href='https://act.moveon.org/donate/pac-donation' rel='nofollow'><span>pages</span></a><span>, and our </span><a href='https://www.petitions.moveon.org' rel='nofollow'><span>petition</span></a><span> system</span><br></li><li><span>Design websites, layouts, interfaces and for new organizing tools built and used in 2018 our election program </span><br></li><li><span>Work with the field, election, and tech teams to conceptualize thoughtful, original ideas that bring simplicity and user friendliness to both new and existing organizing tools</span><br></li><li><span>Work with the ventures and petitions teams to assist in A/B testing new member experiences that drive member action at scale</span><br></li><li><span>Work with the tech team to define and test new design processes that make member experience a first-class priority while balancing against tight project timelines</span><br><br></li></ul><div><span>Required skills and experience:</span></div><div><br></div><div>Design skills</div><ul><li><span>Proven work experience as a web designer in a professional environment</span><br></li><li><span>Proficiency in visual design and wireframing tools</span><br></li><li><span>Empathy for users and ability to creatively solve problems through design</span></li></ul><div><br></div><div><span>Technical skills</span><br></div><div></div><div></div><ul><li><span>Enough HTML/CSS experience to efficiently facilitate the creation of your designs working with a team of software engineers</span><br></li><li><span>An interest in conversion rate optimization</span><br></li><li><span>An interest in/ability to quickly learn data analysis tools: Google Analytics, Segment, A/B testing</span></li></ul><div><br></div><div><span>Professional skills</span><br></div><div></div><div></div><ul><li><span>Effective time management skills and proven ability to juggle several projects at a time </span><br></li><li><span>Ability to be self-directed and to figure out what the design tasks are and how to get them done, including how they relate to development tasks</span><br></li><li><span>Ability to communicate fluently with both technical and campaign staff and communicate technical information to a diverse audience</span><br></li><li><span>Value and practice ownership over projects—determined and thorough, willing to see projects through from idea to implementation to launch</span><br></li><li><span>Ability to be effective in an organization whose team members all work remotely</span></li></ul><div><br></div><div><span>Reports to: </span><span>Chief Technology Officer (CTO)</span></div><div><br></div><div><span>Classification, Salary, and Benefits </span><span>Full-time; highly competitive salary, including benefits such as 100% employer-paid premiums for medical, dental, and vision insurance for all staff and their children; employer-paid premiums for life insurance for all staff; 13.32 hours accrued vacation per month, 6.66 hours accrued sick leave per month, floating holidays and all-staff holidays; and reimbursement of home office expenses. &nbsp;</span></div><div><span><br></span></div><div><em>MoveOn.org Civic Action and MoveOn.org Political Action provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran, in accordance with applicable federal, state, and local laws.</em></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>To submit your application and resume apply here: <a href='http://grnh.se/ga2m0u1' rel='nofollow'>http://grnh.se/ga2m0u1</a>Candidates will be reviewed on a rolling basis. Apply ASAP for consideration.</p>  </div>",
    "urlFetchPending": false,
    "published": "Jan 5, 2018 11:30:07 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "9lx_xVIQQa2xXjmzKQtANg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8716-user-experience-designer",
    "title": "User Experience Designer",
    "content": "User Experience&nbsp;Designer - Jobmote<div><div><h2>User Experience&nbsp;Designer</h2><h5>ConvertKit</h5></div></div><div><div><div><div><div><p>ConvertKit is looking for an experienced user experience designer. Come join our amazing, rapidly growing company!</p><h2>About ConvertKit</h2><ul><li>We are a fully remote team of 30, scattered across 8 states and 4 countries.</li><li>We are bootstrapped, profitable, and growing very quickly.</li><li>We put a high emphasis on work / life balance, and we value and strive for 40 hour work weeks. There aren’t set hours, but there’s a lot to get done!</li><li>We have a positive, vibrant, and genuine culture.</li><li>ConvertKit is used by 17,000+ bloggers, podcasters, authors, and creators!</li></ul><h2>About the role</h2><p>You’ll be part of our engineering and product team, helping to build our SaaS application. Our mission is to help creators earn a living by building and refining our product to meet the needs and solve relevant needs creators are facing.</p><p>You’ll spend your time designing new features for our SaaS application, coding new marketing initiatives, designing animations and interactions, and a lot more.</p><p>It will involve working closely with our team of two designers and eight engineers. We primarily use Sketch, Ruby on Rails, React, Sass, and MySQL to get the job done.</p><p>&nbsp;</p><h2>Requirements</h2><p>In order to be perfect for this role you’ll need to be a great designer with the ability to code your designs in HTML and CSS. Software design experience is required—not just graphic or web design. While we primarily design the ConvertKit web application, experience designing mobile apps is helpful as well.</p><p>You should also be experienced writing Sass that follows a set style guide and is easy to maintain. You should be quite familiar with using Github to share code and files.</p><p>Because everyone on the team is quite self-sufficient, we’d like you to have experience implementing your designs inside a Ruby on Rails app. If you don’t have that skill now, that’s fine, but you’d be expected to learn quickly.</p><p>We’re a 100% remote company, so you should be autonomous, self-driven, and remote-disciplined.</p><h2>Benefits</h2><ul><li>3 weeks paid vacation, 7 paid holidays, and 3 sick days / year. 4 weeks paid vacation after your first year.</li><li>The team gathers twice a year in-person for fantastic team retreats.</li><li>Excellent health benefits.</li><li>8 weeks paid maternity / 4 weeks paid paternity leave.</li><li>$2500 equipment allowance given every 2 years.</li><li>4% matching 401k.</li><li>Yearly conference credit.</li><li>$1,000 yearly vacation bonus.</li><li>Substantial profit sharing.</li></ul><p>&nbsp;</p><p>The application period for this job will close Friday January 26, 2018.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 3:00:41 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/ruby",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend",
      "ruby"
    ]
  },
  {
    "id": "Yrsx9BHRSmWwk_zQiaCUZQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30163?r=rss2",
    "title": "ConvertKit: User Experience Designer",
    "content": "<p>Full-time</p><p><strong>(Boise, Idaho)</strong> </p><p>ConvertKit is looking for an experienced user experience designer. Come join our amazing, rapidly growing company!</p><h2>About ConvertKit</h2><ul><li>We are a fully remote team of 30, scattered across 8 states and 4 countries.</li><li>We are bootstrapped, profitable, and growing very quickly.</li><li>We put a high emphasis on work / life balance, and we value and strive for 40 hour work weeks. There aren't set hours, but there's a lot to get done!</li><li>We have a positive, vibrant, and genuine culture.</li><li>ConvertKit is used by 17,000+ bloggers, podcasters, authors, and creators!</li></ul><h2>About the role</h2><p>You'll be part of our engineering and product team, helping to build our SaaS application. Our mission is to help creators earn a living by building and refining our product to meet the needs and solve relevant needs creators are facing.</p><p>You'll spend your time designing new features for our SaaS application, coding new marketing initiatives, designing animations and interactions, and a lot more.</p><p>It will involve working closely with our team of two designers and eight engineers. We primarily use Sketch, Ruby on Rails, React, Sass, and MySQL to get the job done.</p><p>&nbsp;</p><h2>Requirements</h2><p>In order to be perfect for this role you'll need to be a great designer with the ability to code your designs in HTML and CSS. Software design experience is required—not just graphic or web design. While we primarily design the ConvertKit web application, experience designing mobile apps is helpful as well.</p><p>You should also be experienced writing Sass that follows a set style guide and is easy to maintain. You should be quite familiar with using Github to share code and files.</p><p>Because everyone on the team is quite self-sufficient, we'd like you to have experience implementing your designs inside a Ruby on Rails app. If you don't have that skill now, that's fine, but you'd be expected to learn quickly.</p><p>We're a 100% remote company, so you should be autonomous, self-driven, and remote-disciplined.</p><h2>Benefits</h2><ul><li>3 weeks paid vacation, 7 paid holidays, and 3 sick days / year. 4 weeks paid vacation after your first year.</li><li>The team gathers twice a year in-person for fantastic team retreats.</li><li>Excellent health benefits.</li><li>8 weeks paid maternity / 4 weeks paid paternity leave.</li><li>$2500 equipment allowance given every 2 years.</li><li>4% matching 401k.</li><li>Yearly conference credit.</li><li>$1,000 yearly vacation bonus.</li><li>Substantial profit sharing.</li></ul><p>&nbsp;</p><p>The application period for this job will close Friday January 26, 2018.</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 2:46:17 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/ruby",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend",
      "ruby"
    ]
  },
  {
    "id": "sORjHSc1Qp2RZu9s2D3Okg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16056912",
    "title": "Loom Network | FULLTIME | REMOTE | loomx.io We make cryptozombies and ethfiddle. We are building tools to scale blockchains. Join ...",
    "content": "<div>                  <span>Loom Network | FULLTIME | REMOTE | loomx.ioWe make cryptozombies and ethfiddle. We are building tools to scale blockchains. Join us to make dApps scalable. We are making it easier to build solidity based software for the Ethereum blockchain<p>Looking for Senior Golang Engineers with 10+ years experience in server side development</p><p>Email hiring@loomx.io with your resume<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Jan 3, 2018 1:30:06 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "Tncpuh-SQc-nECXV3u1Bnw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/164081/technical-design-intern-wikimedia-foundation-inc?a=T1Ioywv72jC",
    "title": "Technical Design Intern at Wikimedia Foundation, Inc. (San Francisco, CA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Internship</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Education Technology, eLearning, Non-Profit</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div>Location: San Francisco, CA or Remote<p><strong>Hours:&nbsp;</strong>40 hours/week</p><p><strong>Duration:</strong>&nbsp;February 1st- March 31st, 2018</p><p><strong>Summary</strong></p><p>Over the past three years, different departments at the Wikimedia Foundation have developed learning resources to support Wikimedia communities all over the world advance their work, which includes: engaging new editors and education institutions on Wikipedia (through Wikimedia programs), supporting volunteer developers for MediaWiki (the software on which Wikipedia operates), advocating for law reforms or law enforcements, creating new institutional partnerships, giving direct support to guarantee the safety of Wikipedia users all over the world. Through a new hub, called “Wikimedia Resource Center”, we hope to better connect Wikimedia community members to these resources and one on one support. The Wikimedia Resource Center is a project that has 8 different stakeholders, with specific needs, across the organization.</p><p>We’re looking for someone who is comfortable in both a design and a technical role (mostly front-end). The technical design intern will work with the Learning and Evaluation team to flesh out designs, and &nbsp;use their technical expertise to make them into reality, using different technologies.</p><p><strong>We’d like you to do these things:</strong></p><p>As a Technical Intern with the Learning and Evaluation team you will be involved in supporting the development of the Wikimedia Resource Center.</p><ul><li>Work closely with the Communications and Outreach Coordinator on the redesign of the Evaluation Portal on Meta Wikimedia.</li><li>Migrate and archive L&amp;E portal pages from existing namespaces to new namespace</li><li>Create a set of templates that can be implemented by different portals informing the Wikimedia Resource Center.</li><li>Mapping the technical support needs and lending support as available to other teams working on portal redesign as part of the Wikimedia Resource Center project</li><li>Engage in dynamic working environments to connect with Wikimedia colleagues throughout the world.</li><li>Other duties as needed.</li></ul><p><strong>Deliverables</strong></p><ul><li>Regular coordination with the Communications &amp; Outreach Project Manager and Community Engagement team members.</li><li>Bi-weekly debriefs with team regarding progress and status of portals linked to the Wikimedia Resource Center.</li><li>Template design and technical integration for support in navigating online resources. The intern should be able to either (a) offer a design solution, which they will develop later on Meta Wikimedia; or (b) be able to work with wireframes and develop templates designed by others on Meta Wikimedia.</li><li>Guides for new template implementation for portals informing the Wikimedia Resource Center. (<a href='https://meta.wikimedia.org/wiki/Template:Collapse-mobile' rel='nofollow'>Example</a>&nbsp;of template documentation on Meta Wikimedia.)</li><li>Redesigned and migrated portal pages with up-to-date information and category links.</li></ul><p><strong>We’d like you to have these skills:</strong></p><p>The Learning and Evaluation Communications Intern should have the following experience and personal characteristics:</p><ul><li>Must be a current student or a recent graduate pursuing a degree in UX Design, Human-Computer interaction, Information Systems, Computer Science, Computer Engineering, or a closely related discipline, or have equivalent experience.</li><li>Skills in designing gadgets and scripts on wiki (e.g., LUA, JSON, Javascript, Python)</li><li>Familiarity with HTML and CSS.</li><li>Experience in mediawiki mark-up, especially&nbsp;for creating Wikimedia design templates and pages. (Read more about wiki templates&nbsp;<a href='https://meta.wikimedia.org/wiki/Help:Template' rel='nofollow'>here</a>.)&nbsp;&nbsp;&nbsp;</li><li>Interest in designing web content curation systems and user flow.</li><li>A strong interest in archival systems, searchability and usable portals on the Wikimedia projects.</li><li>Strong track record of positive and friendly communication with diverse cultural and language communities.</li><li>Proven ability to adhere to deadlines and to seek out learning &amp; support for collaborative projects.</li><li>Willingness to accommodate scheduling requirements of frequent interactions across time zones, with collaborators from around the world</li><li>Exceptional verbal and written communication skills and interpersonal skills</li><li>High energy for, and commitment to, the Wikimedia Foundation’s free knowledge mission.</li></ul><p><strong>And it would be even more awesome if you have this:</strong></p><ul><li>Understanding of the existing landscape of different Wikimedia programs (a plus)</li><li>Experience working with volunteers in open software projects (a plus)</li><li>Strong record of contributing to Wikimedia projects (a major plus)</li></ul><p>&nbsp;<strong>About the Wikimedia Foundation</strong></p>The Wikimedia Foundation is the non-profit organization that supports and hosts Wikipedia and several other Wikimedia free knowledge sites.&nbsp;Every month, the Wikimedia sites are accessed by more than a billion unique devices.&nbsp;Wikipedia consists of more than 40 million articles across hundreds of languages. Every month, more than 70,000 volunteer editors contribute to Wikipedia. Based in San Francisco, California, the Wikimedia Foundation is an audited, 501(c)(3) non-profit that is funded primarily through donations and grants. It currently employs over 240 staff members.<p>At the Foundation, we build technology to help people everywhere access Wikipedia, across devices and in nearly 300 languages. We engineer privacy for our readers and editors so they can safely and securely explore Wikipedia. We create&nbsp;programs&nbsp;and initiatives to make Wikipedia freely available to more people in more parts of the world. We build&nbsp;new tools&nbsp;for the community of editors so they can continue to improve and grow Wikipedia. Roughly a quarter of our budget goes to supporting the community that make the site possible, including through&nbsp;grantmaking programs&nbsp;that enable volunteers and enrich the information on the sites.</p><p>The Wikimedia Foundation is an equal opportunity employer, and we encourage people with a diverse range of backgrounds to apply.</p><p><strong>More Information</strong></p><p>https://wikimediafoundation.org</p><p>https://blog.wikimedia.org</p>                    </div>                            <h2>                About Wikimedia Foundation, Inc.            </h2>            <div><p><strong>About the Wikimedia Foundation</strong></p><p>The Wikimedia Foundation is the non-profit organization that supports and hosts Wikipedia and several other Wikimedia free knowledge sites.&nbsp;Every month, the Wikimedia sites are accessed by more than a billion unique devices.&nbsp;Wikipedia consists of more than 40 million articles across hundreds of languages. Every month, more than 250,000&nbsp;volunteer editors contribute to Wikipedia. Based in San Francisco, California, the Wikimedia Foundation is an audited, 501(c)(3) non-profit that is funded primarily through donations and grants. It currently employs over 300&nbsp;staff members.</p><p>At the Foundation, we build technology to help people everywhere access Wikipedia, across devices and in nearly 300 languages. We engineer privacy for our readers and editors so they can safely and securely explore Wikipedia. We create&nbsp;programs&nbsp;and initiatives to make Wikipedia freely available to more people in more parts of the world. We build&nbsp;new tools&nbsp;for the community of editors so they can continue to improve and grow Wikipedia. Roughly a quarter of our budget goes to supporting the community that make the site possible, including through&nbsp;grantmaking programs&nbsp;that enable volunteers and enrich the information on the sites.</p><p>The Wikimedia Foundation is an equal opportunity employer, and we encourage people with a diverse range of backgrounds to apply.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Fully paid premiums for medical, dental &amp; vision insurance premiums                            </div>                            <div>                                 401(k) with 4% matching contribution                            </div>                            <div>                                 7-12 weeks parental leave with 100% pay + lactation room                            </div>                            <div>                                 Wellness Program ($1800 annual) to promote wellness &amp; personal growth                            </div>                            <div>                                 Pre-tax savings plans for Transportation &amp; Parking                            </div>                            <div>                                 Flexible work schedules and remote working options                            </div>                            <div>                                 Pet Friendly office                            </div>                            <div>                                 Commitment to diversity &amp; inclusion throughout the employee lifecycle                            </div>                            <div>                                 12 days vacation, 19 days holiday, 2 days volunteer work and more!                            </div>                            <div>                                 Lean more at https://wikimediafoundation.org/wiki/Work_with_us                            </div>                    ",
    "urlFetchPending": false,
    "published": "Jan 1, 2018 5:18:39 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "hXgL-njGS3GRGQ9Dk-5Sug",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8692-brand-ambassador-coordinator",
    "title": "Brand Ambassador Coordinator",
    "content": "Brand Ambassador Coordinator - Jobmote<div><div><h2>Brand Ambassador Coordinator</h2><h5>Remote Year</h5></div></div><div><div><div><div><div><p>Remote Year</p><p>Remote Year curates communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend either 4 or 12 months together working, traveling, and exploring cities around the world. Programs spend one month in each location, connecting with local cultures and business ecosystems, while forming lifelong, personal and professional relationships along the way. Together we will shape the future of work.</p><p>Brand Ambassador Coordinator Description</p><p>Working closely with our Head of Experiential Marketing, our Brand Ambassador Coordinator will be responsible for managing all the moving pieces of our Ambassador program, ensuring the Remote Year brand is represented globally by our growing team of Remote Year Ambassadors. Our RY Ambassadors operate on-the-ground and across the world, helping future Remotes (customers) learn more about the Remote Year brand through event based marketing. The Brand Ambassador Coordinator will be responsible for recruiting, training, and onboarding our RY Ambassadors from around the world and supporting the growth of our marketing efforts on a global scale. In addition the Brand Ambassador Coordinator will manage strategic projects that are tied to the growth of the RY Ambassador program.</p><p>Responsibilities</p><p>Manage the recruitment, hiring, and training of future Remote Year Ambassadors including:</p><ul><li>Improve on our current sourcing strategy to find amazing Remote Year Ambassadors across the world.</li><li>Coordinate, schedule and conduct interviews with qualified candidates.</li><li>Manage all new Brand Ambassadors onboarding and training, providing onboarding support throughout their entire onboarding process.</li><li>Host Remote Year Ambassador kickoff calls.</li><li>Work with Ambassadors on drafting event plans</li><li><p>Manage internal access and tools (Academy, Slack, Facebook, and internal tools)</p></li><li><p>Support Ambassadors in the planning and promotion of local marketing events including:</p></li><li><p>Identifying key location partnerships in market.</p></li><li><p>Coordinating with local teams and managing event plans.</p></li><li><p>Driving event marketing initiatives.</p></li><li><p>Generate weekly status reports and provide strategic recommendations for Ambassador Program growth.</p></li><li><p>Manage our active roster of new Ambassadors. Make recommendations for improvements to tools and processes.</p></li><li><p>Share appropriate content for Ambassadors through social media channels.</p></li><li><p>Manage marketing content and collateral database for Ambassadors.</p></li><li><p>Research events for Ambassadors to attend in markets.</p></li></ul><p>What You Bring</p><ul><li>1-2 years experience of inbound or outbound sales; including SDR, Account Executive, or similar role.</li><li>An eye for detail and a love for execution -&nbsp;you’re extremely organized, habitual goal setter and take pride in your abilities to multitask and shift priorities when needed.</li><li>An extroverted fearlessness -&nbsp;you’ll keep our Ambassadors feeling energized, hyped, and motivated across time zones and multiple events.</li><li>1-2 years of project or people management.</li></ul><p>Nice to Have</p><ul><li>Salesforce or CRM knowledge</li><li>Recruiting experience interviewing and onboarding candidates.</li><li>Relevant marketing experience related to branding, events or content.</li><li>Previous startup experience</li></ul></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 30, 2017 11:00:25 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Me6WdF-VRwq9yZIpG-NcMw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/6018-brand-ambassador-coordinator",
    "title": "Remote Year: Brand Ambassador Coordinator",
    "content": "<div>  <div>    <h2>Brand Ambassador Coordinator</h2>      <h4>Posted Dec 30</h4>    <h3>      <span>Remote Year</span><br>      <span>Headquarters: New York, New York</span><br>        <a href='https://remote-year.breezy.hr/p/4494e38db8c6-brand-ambassador-coordinator?source=weworkremotely' rel='nofollow'>https://remote-year.breezy.hr/p/4494e38db8c6-brand-ambassador-coordinator?source=weworkremotely</a>    </h3>  </div>    </div>  <div>    <div><span>Remote Year</span></div><div><br></div><div>Remote Year curates communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend either 4 or 12 months together working, traveling, and exploring cities around the world. Programs spend one month in each location, connecting with local cultures and business ecosystems, while forming lifelong, personal and professional relationships along the way. Together we will shape the future of work.</div><div><br></div><div><span></span></div><div></div><div><br></div><div><span>Brand Ambassador Coordinator Description</span></div><div><br></div><div>Working closely with our Head of Experiential Marketing, our Brand Ambassador Coordinator will be responsible for managing all the moving pieces of our Ambassador program, ensuring the Remote Year brand is represented globally by our growing team of Remote Year Ambassadors. Our RY Ambassadors operate on-the-ground and across the world, helping future Remotes (customers) learn more about the Remote Year brand through event based marketing. The Brand Ambassador Coordinator will be responsible for recruiting, training, and onboarding our RY Ambassadors from around the world and supporting the growth of our marketing efforts on a global scale. In addition the Brand Ambassador Coordinator will manage strategic projects that are tied to the growth of the RY Ambassador program.</div><div><br></div><div><span></span></div><div></div><div><br></div><div><span>Responsibilities</span></div><div><br></div><div>Manage the recruitment, hiring, and training of future Remote Year Ambassadors including:</div><div><br></div><ul><li>Improve on our current sourcing strategy to find amazing Remote Year Ambassadors across the world.</li><li>Coordinate, schedule and conduct interviews with qualified candidates.</li><li>Manage all new Brand Ambassadors onboarding and training, providing onboarding support throughout their entire onboarding process.</li><li>Host Remote Year Ambassador kickoff calls.</li><li>Work with Ambassadors on drafting event plans</li><li>Manage internal access and tools (Academy, Slack, Facebook, and internal tools)</li></ul><ul><li>Support Ambassadors in the planning and promotion of local marketing events including:</li><li>Identifying key location partnerships in market.</li><li>Coordinating with local teams and managing event plans.</li><li>Driving event marketing initiatives.</li></ul><div><li>Generate weekly status reports and provide strategic recommendations for Ambassador Program growth.</li><li>Manage our active roster of new Ambassadors. Make recommendations for improvements to tools and processes.</li><li>Share appropriate content for Ambassadors through social media channels.</li><li>Manage marketing content and collateral database for Ambassadors.</li><li>Research events for Ambassadors to attend in markets.</li></div><div></div><div><br></div><div><span>What You Bring</span></div><div><br></div><ul><li><span>1-2 years experience of inbound or outbound sales</span>; including SDR, Account Executive, or similar role.</li><li><span>An eye for detail and a love for execution -&nbsp;</span>you’re extremely organized, habitual goal setter and take pride in your abilities to multitask and shift priorities when needed.</li><li><span>An extroverted fearlessness -&nbsp;</span>you’ll keep our Ambassadors feeling energized, hyped, and motivated across time zones and multiple events.</li><li><span>1-2 years of project or people management.</span></li></ul><div></div><div><br></div><div><span>Nice to Have</span></div><div><br></div><ul><li>Salesforce or CRM knowledge</li><li>Recruiting experience interviewing and onboarding candidates.</li><li>Relevant marketing experience related to branding, events or content.</li><li>Previous startup experience</li></ul><ul></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://remote-year.breezy.hr/p/4494e38db8c6-brand-ambassador-coordinator?source=weworkremotely' rel='nofollow'>https://remote-year.breezy.hr/p/4494e38db8c6-brand-ambassador-coordinator?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 30, 2017 10:32:27 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "UjAItPZkTsaT8zKz1EYChw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/64006",
    "title": "Brand Ambassador Coordinator",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div><span>Remote Year</span></div><div><br></div><div>Remote Year curates communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend either 4 or 12 months together working, traveling, and exploring cities around the world. Programs spend one month in each location, connecting with local cultures and business ecosystems, while forming lifelong, personal and professional relationships along the way. Together we will shape the future of work.</div><div><br></div><div><span></span></div><div></div><div><br></div><div><span>Brand Ambassador Coordinator Description</span></div><div><br></div><div>Working closely with our Head of Experiential Marketing, our Brand Ambassador Coordinator will be responsible for managing all the moving pieces of our Ambassador program, ensuring the Remote Year brand is represented globally by our growing team of Remote Year Ambassadors. Our RY Ambassadors operate on-the-ground and across the world, helping future Remotes (customers) learn more about the Remote Year brand through event based marketing. The Brand Ambassador Coordinator will be responsible for recruiting, training, and onboarding our RY Ambassadors from around the world and supporting the growth of our marketing efforts on a global scale. In addition the Brand Ambassador Coordinator will manage strategic projects that are tied to the growth of the RY Ambassador program.</div><div><br></div><div><span></span></div><div></div><div><br></div><div><span>Responsibilities</span></div><div><br></div><div>Manage the recruitment, hiring, and training of future Remote Year Ambassadors including:</div><div><br></div><ul><li>Improve on our current sourcing strategy to find amazing Remote Year Ambassadors across the world.</li><li>Coordinate, schedule and conduct interviews with qualified candidates.</li><li>Manage all new Brand Ambassadors onboarding and training, providing onboarding support throughout their entire onboarding process.</li><li>Host Remote Year Ambassador kickoff calls.</li><li>Work with Ambassadors on drafting event plans</li><li>Manage internal access and tools (Academy, Slack, Facebook, and internal tools)</li></ul><ul><li>Support Ambassadors in the planning and promotion of local marketing events including:</li><li>Identifying key location partnerships in market.</li><li>Coordinating with local teams and managing event plans.</li><li>Driving event marketing initiatives.</li></ul><div><li>Generate weekly status reports and provide strategic recommendations for Ambassador Program growth.</li><li>Manage our active roster of new Ambassadors. Make recommendations for improvements to tools and processes.</li><li>Share appropriate content for Ambassadors through social media channels.</li><li>Manage marketing content and collateral database for Ambassadors.</li><li>Research events for Ambassadors to attend in markets.</li></div><div></div><div><br></div><div><span>What You Bring</span></div><div><br></div><ul><li><span>1-2 years experience of inbound or outbound sales</span>; including SDR, Account Executive, or similar role.</li><li><span>An eye for detail and a love for execution -&nbsp;</span>you’re extremely organized, habitual goal setter and take pride in your abilities to multitask and shift priorities when needed.</li><li><span>An extroverted fearlessness -&nbsp;</span>you’ll keep our Ambassadors feeling energized, hyped, and motivated across time zones and multiple events.</li><li><span>1-2 years of project or people management.</span></li></ul><div></div><div><br></div><div><span>Nice to Have</span></div><div><br></div><ul><li>Salesforce or CRM knowledge</li><li>Recruiting experience interviewing and onboarding candidates.</li><li>Relevant marketing experience related to branding, events or content.</li><li>Previous startup experience</li></ul><ul></ul><p><strong>To apply:</strong> <a href='https://remote-year.breezy.hr/p/4494e38db8c6-brand-ambassador-coordinator?source=weworkremotely' rel='nofollow'>https://remote-year.breezy.hr/p/4494e38db8c6-brand-ambassador-coordinator?source=weworkremotely</a></p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 30, 2017 10:32:27 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "RO2hWPPlRJGwg7kPJFObBw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8688-product-designer",
    "title": "Product Designer",
    "content": "Product&nbsp;Designer - Jobmote<div><div><h2>Product&nbsp;Designer</h2><h5>Creative Market</h5></div></div><div><div><div><div><div><p><strong>Overview</strong></p><p>Creative Market is the platform where independent creators around the world buy and sell digital design assets. Our mission is to help creators around the world turn passion into opportunity. As a Product Designer, you will help make this mission a reality by building strategic growth initiatives within a cross-functional product team. You will collaborate with engineers, designers, researchers, and analysts on the entire product lifecycle. You will plan and design a range of small to large tests and features aimed at increasing our MoM growth rate and improving user experience.</p><p><strong>Design Team Purpose</strong></p><p>As a Product Designer, you are the embodiment of the design team’s mission, vision, and principles. These should be reflected in all aspects of your work. You live &amp; breathe brilliant product design thinking and execution. You’re passionate about a/b testing, conversion optimization, user experience design, and user research.</p><p>Our mission is to create a unique, cohesive experience for our community through one unified design system. Our vision is to balance and improve long-term growth with great user experience across our products and brand.</p><p><strong>Design Principles</strong></p><ol><li><p>Design For Everyone</p></li><li><p>People Over Pixels</p></li><li><p>One Brand To Rule Them All</p></li><li><p>The Details Are The Design</p></li><li><p>Design Is A Shared Responsibility</p></li><li><p>Creativity Fosters Community</p></li></ol><h4>Responsibilities</h4><ul><li>Work close with your cross-functional product team to produce fast, effective cycles of product design work.</li><li>Discover, research, and validate opportunities that can make a big impact for our business and users.</li><li>Design clear and simple product design solutions. Navigate complex product system dynamics and user behaviors.</li><li>Write detailed scopes for your design work. Produce realistic timelines for each design cycle required for the project to be completed and successful.</li><li>Build a/b tests that iterate on our existing features and craft new features that are optimized for activation and retention by device.</li><li>Balance using our product design system’s elements, patterns, and interactions with evolving them.</li><li>Recommend improvements to our design tools, process, and documentation.</li><li>Own your work. Work closely with the design director to ensure best results.</li></ul><h4>Who You Are</h4><ul><li>Communicative: You start with listening and empathy. You keep others updated on all aspects of your work. You proactively reach out before critical questions or roadblocks become an issue. You speak and write with clarity and brevity. You articulate your decisions clearly, explaining what problems they solve and why.</li><li>Collaborative: You honor and compliment the contributions of your peers. You value receiving and giving feedback. You believe great design is the result of good collaboration because design is a shared responsibility across the team.</li><li>Professional: You hold yourself to high standards of decorum. Your productive, perceptive, honest, supportive, transparent, compassionate and self-controlled. You lack ego and put the best interests of the company and team above your own.</li><li>Learner: You love learning and share what you discover with the team. You pursue tackling new challenges. You stay curious and open about what’s possible.</li><li>User-Focused: You always build things with the end-user in mind. You make sure the team is talking to the right users before, during, and after building product work. You take pride in removing friction at every point of the user journey in our product. You value the time and effort our users invest in our product.</li><li>Detail-Oriented: You sweat the details because you know that millions of people rely on what you’re designing. You balance big-picture thinking with polishing the tiny details. You ensure all details in the UX and UI design work are thorough before the build goes out the door.</li><li>Systematic Thinker: You understand how all components of the system fit together to create a unified experience. You see how new projects will impact the larger system and are able to clearly communicate these dynamics to the project team.</li><li>Passionate: You care about the creative and design communities. You take it to heart when you hear how your work helps our users achieve success or lessens their frustrations. It’s natural for you to over deliver because you want to elevate Creative Market to a highly competitive state in the industry.</li></ul><h4>Skills Required</h4><ul><li>You have a well-rounded knowledge of product systems, design thinking, and what’s possible to execute in code.</li><li>You set a very high bar for product design execution, process, and documentation. You hold the entire team to the same standard.</li><li>You deliver projects on time. You communicate well in advance if a due date needs to move and the reason. You are responsible for the efficiency and effectiveness of your work because the business depends on it.</li><li>You balance qualitative and quantitative data in order to identify and solve complex problems that benefit our business and users. You have experience and passion for using data to improve user experience.</li><li>You think deeply about product design decisions before delivering them to the team. You have a track record of being open to others solving design challenges alongside you. You mentor best practices in design thinking in the team.</li><li>You have a strong desire to grasp the entire site from all our users’ perspectives: shops, buyers, affiliates, and visitors. You’re committed to developing an acute understanding of their desires, motivations, and problems.</li><li>You thrive in a fast-faced, dynamic environment. You work well in remote and office settings.</li><li>You are comfortable in Adobe CC, Sketch, and various prototyping tools.</li><li>You actively build relationships across the team.</li></ul><h4>Experiences Desired</h4><ul><li>You have 2+ years working on web and digital product design work. eCommerce and responsive design experience is preferred.</li><li>You have a B.A. or B.F.A. in Design with a focus in one of the following areas: web, UI/UX, product design(or an equivalent level of education).</li><li>You have experience working on a marketplace or eCommerce business.</li><li>You have experience working in a startup environment.</li></ul><h4>We’re Offering</h4><ul><li>Location: San Francisco preferred. Remote(U.S. only) opportunities available in the following states: CA, TX, NC, CO, WA and NY.</li><li>Competitive compensation</li><li>Stock options</li><li>401(k) plan</li><li>Medical, dental, and vision benefits</li><li>Generous paid time off</li><li>New workstation</li></ul></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 29, 2017 9:00:37 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "WxmAcn2xQDek-uihrA6QOA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/6017-brand-ambassador",
    "title": "Remote Year: Brand Ambassador",
    "content": "<div>  <div>    <h2>Brand Ambassador</h2>      <h4>Posted Dec 29</h4>    <h3>      <span>Remote Year</span><br>      <span>Headquarters: New York, New York</span><br>        <a href='https://remote-year.breezy.hr/p/3f9cf07a08c3-brand-ambassador?source=weworkremotely' rel='nofollow'>https://remote-year.breezy.hr/p/3f9cf07a08c3-brand-ambassador?source=weworkremotely</a>    </h3>  </div></div>  <div>    <div><span>Remote Year curates communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend either 4 or 12 months together working, traveling, and exploring cities around the world. Programs spend one month in each location, connecting with local cultures and business ecosystems, while forming lifelong, personal and professional relationships along the way. Together we will shape the future of work.</span></div><div><br></div><div><span>Brand Ambassador Description</span></div><div><br></div><div>Remote Year Ambassadors operate on-the-ground and across the world, helping future Remotes (customers) learn more about the Remote Year brand. Our Ambassadors are self-starters with strong work ethic and the ability to work independently. We're looking for Remote Ambassadors with strong interpersonal skills who are hungry to launch their careers in sales and marketing.&nbsp;<span>Our Ambassadors work under flex schedules and operate entirely on commission.</span></div><div><br></div><div><span>We are seeking Remote Year Ambassadors in the following locations:</span></div><div><br></div><div><span>North America:</span></div><div><br></div><ul><li>Austin, TX</li><li>Boston, MA</li><li>Dallas, TX</li><li>Denver, CO</li><li>Los Angeles, CA</li><li>New York, NY</li><li>Philadelphia, PA</li><li>Phoenix, AZ</li><li>Portland, OR</li><li>San Francisco, CA</li><li>Seattle, WA</li><li>Toronto, ON</li><li>Vancouver, BC</li><li>Washington, DC</li></ul><div><span>EMEA:</span></div><div><br></div><ul><li>Amsterdam, NL</li><li>Berlin, DE</li><li>Cape Town, SA</li><li>Dublin, IE</li><li>London, UK</li><li>Lisbon, PT</li><li>Manchester, UK</li><li>Rome, IT</li><li>Tel Aviv, IL</li></ul><div><span>Australia:</span></div><div><br></div><ul><li>Brisbane, QLD</li><li>Melbourne, VIC</li><li>Perth, WA</li><li>Sydney, NSW</li></ul><div><span>Asia:</span></div><div><br></div><ul><li>Beijing, CN</li><li>Hong Kong</li><li>Kuala, Lumpur, MY</li><li>Seoul, SK</li><li>Singapore, SG</li><li>Shanghai, CN</li><li>Taipei, TW</li><li>Tokyo, JP</li></ul><div><span>What you'll do:</span></div><div><br></div><ul><li>Plan, promote and execute informational events every month to promote our culture and targeting future Remotes (customers).<br><br></li><li>Leverage local partnerships, vendors, and contacts to help successfully conduct brand events.<br><br></li><li>Work in conjunction with sales and marketing teams to capitalize on existing efforts and to ensure consistency of message across markets.<br><br></li><li>Connect in-person with potential Remotes to provide program information, answer questions, and accelerate Admissions application process.<br><br></li><li>Identify and develop new local customer acquisition channels most relevant to our brand and strategy.<br><br></li><li>Demonstrate excellent communication skills, especially in person and face to face.<br><br></li><li>Embrace a team orientation with an ability to fly solo when needed.<br><br></li><li>Utilize the ability to think on your feet and keep people engaged in conversation.<br><br></li></ul><div><span>What you bring:</span></div><div><br></div><ul><li>1 + years experience in related field (e.g., sales, lead generation or marketing)<br><br></li><li>Excellent event planning and management skills<br><br></li><li>Comfortable working in the remote environment<br><br></li><li>Fluent in English, with additional language skills an advantage.<br><br></li><li>Passion for travel, ideally with long periods of previous travel outside your home country.<br><br></li><li>Inspiration - you’ll thrive across a diverse audience, sharing our brand across and cultures<br><br></li><li>Organization - great time management and ability to prioritize tasks to achieve objectives.<br><br></li><li>Strong communication skills - you’ll deliver compelling, relatable and actionable conversations with each and every Remote.<br><br></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://remote-year.breezy.hr/p/3f9cf07a08c3-brand-ambassador?source=weworkremotely' rel='nofollow'>https://remote-year.breezy.hr/p/3f9cf07a08c3-brand-ambassador?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 29, 2017 8:55:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "769orO-zQKeYiBW7AapBVg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/remote-jobs/remote-year-brand-ambassador-remote-only",
    "title": "Remote Year: Brand Ambassador",
    "content": "<div>  <div>    <h2>Brand Ambassador</h2>      <h4>Posted Jan 29</h4>    <h3>      <span>Remote Year</span><br>      <span>Headquarters: New York, New York</span><br>        <a href='https://remote-year.breezy.hr/p/3f9cf07a08c3-brand-ambassador?source=weworkremotely' rel='nofollow'>https://remote-year.breezy.hr/p/3f9cf07a08c3-brand-ambassador?source=weworkremotely</a>    </h3>  </div></div>  <div>    <div><span>Remote Year curates communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend either 4 or 12 months together working, traveling, and exploring cities around the world. Programs spend one month in each location, connecting with local cultures and business ecosystems, while forming lifelong, personal and professional relationships along the way. Together we will shape the future of work.</span></div><div><br></div><div><span>Brand Ambassador Description</span></div><div><br></div><div>Remote Year Ambassadors operate on-the-ground and across the world, helping future Remotes (customers) learn more about the Remote Year brand. Our Ambassadors are self-starters with strong work ethic and the ability to work independently. We're looking for Remote Ambassadors with strong interpersonal skills who are hungry to launch their careers in sales and marketing.&nbsp;<span>Our Ambassadors work under flex schedules and operate entirely on commission.</span></div><div><br></div><div><span>We are seeking Remote Year Ambassadors in the following locations:</span></div><div><br></div><div><span>North America:</span></div><div><br></div><ul><li>Austin, TX</li><li>Boston, MA</li><li>Dallas, TX</li><li>Denver, CO</li><li>Los Angeles, CA</li><li>New York, NY</li><li>Philadelphia, PA</li><li>Phoenix, AZ</li><li>Portland, OR</li><li>San Francisco, CA</li><li>Seattle, WA</li><li>Toronto, ON</li><li>Vancouver, BC</li><li>Washington, DC</li></ul><div><span>EMEA:</span></div><div><br></div><ul><li>Amsterdam, NL</li><li>Berlin, DE</li><li>Cape Town, SA</li><li>Dublin, IE</li><li>London, UK</li><li>Lisbon, PT</li><li>Manchester, UK</li><li>Rome, IT</li><li>Tel Aviv, IL</li></ul><div><span>Australia:</span></div><div><br></div><ul><li>Brisbane, QLD</li><li>Melbourne, VIC</li><li>Perth, WA</li><li>Sydney, NSW</li></ul><div><span>Asia:</span></div><div><br></div><ul><li>Beijing, CN</li><li>Hong Kong</li><li>Kuala, Lumpur, MY</li><li>Seoul, SK</li><li>Singapore, SG</li><li>Shanghai, CN</li><li>Taipei, TW</li><li>Tokyo, JP</li></ul><div><span>What you'll do:</span></div><div><br></div><ul><li>Plan, promote and execute informational events every month to promote our culture and targeting future Remotes (customers).<br><br></li><li>Leverage local partnerships, vendors, and contacts to help successfully conduct brand events.<br><br></li><li>Work in conjunction with sales and marketing teams to capitalize on existing efforts and to ensure consistency of message across markets.<br><br></li><li>Connect in-person with potential Remotes to provide program information, answer questions, and accelerate Admissions application process.<br><br></li><li>Identify and develop new local customer acquisition channels most relevant to our brand and strategy.<br><br></li><li>Demonstrate excellent communication skills, especially in person and face to face.<br><br></li><li>Embrace a team orientation with an ability to fly solo when needed.<br><br></li><li>Utilize the ability to think on your feet and keep people engaged in conversation.<br><br></li></ul><div><span>What you bring:</span></div><div><br></div><ul><li>1 + years experience in related field (e.g., sales, lead generation or marketing)<br><br></li><li>Excellent event planning and management skills<br><br></li><li>Comfortable working in the remote environment<br><br></li><li>Fluent in English, with additional language skills an advantage.<br><br></li><li>Passion for travel, ideally with long periods of previous travel outside your home country.<br><br></li><li>Inspiration - you’ll thrive across a diverse audience, sharing our brand across and cultures<br><br></li><li>Organization - great time management and ability to prioritize tasks to achieve objectives.<br><br></li><li>Strong communication skills - you’ll deliver compelling, relatable and actionable conversations with each and every Remote.<br><br></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://remote-year.breezy.hr/p/3f9cf07a08c3-brand-ambassador?source=weworkremotely' rel='nofollow'>https://remote-year.breezy.hr/p/3f9cf07a08c3-brand-ambassador?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 29, 2017 8:55:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "Urr22g0WSImAchq9WJS3-A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63997",
    "title": "Product Designer San Francisco CA",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Creative Market is hiring a Product Designer in San Francisco, CA or Remote (U.S. only)</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 29, 2017 8:32:45 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "z86xEmMJQemSWDiNzIbphw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4060-ux-designer-western-hemisphere-preferred-modus-create",
    "title": "UX Designer - Western Hemisphere Preferred @ Modus Create",
    "content": "<h2>              UX Designer - Western Hemisphere Preferred<small> @ Modus Create</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-12-28 19:01</p></dd>          <dt><span>Description</span></dt>          <dd><p><strong>Hello Designer, does this sound like you?</strong> People describe you as a generalist, but you have your specialties. You could run a design project from start to finish, but you nerd out when it comes to a specific craft like visual design or ethnographic research. You also value soft skills. For you, over-communicating and project planning are essential to any project’s success. Selling your designs is second nature to you, because you design with intent. And pretty deliverables mean nothing to you unless you ship a product that moves the needle.</p><p><strong>You design fast</strong> — keyboard shortcuts are your poor fingers’ best friends. You know when to lean on existing patterns and when to create something fresh. And you understand the difference between innovating and copying. To you, perfectionism is a dirty 13 letter word that has no place in design.</p><p><strong>You accept that most companies follow a wonky design process, and that’s why they need your help.</strong> You believe that teaching is actually the perfect way to stay up to date on your craft. You preach that user experience is more than just what you see on the screen. The most frequent word in your vocabulary arsenal is “Why?” You’re as good at understanding problems as you are at solving them. </p><p>This contract role may be performed from a remote location and requires a level of effort estimated at 40 hours per week. Compensation for this role is between 20 to 35 USD / hour.</p><p><strong>Your Responsibilities</strong></p><ul><li>Own the end-to-end design process for your projects</li><li>Facilitate discovery sessions with clients and stakeholders to define success, requirements, and strategy</li><li>Actually interact with customers to research their tasks, pain points, and emotions </li><li>Use research to inform feature prioritization. Translate research data into digestible deliverableS</li><li>Create interaction design patterns in the form of user flows, wireframes, full color mockups, and interactive prototypes</li><li>Sell your work — tell compelling stories when presenting deliverables to customers</li><li>Be comfortable in formal design presentations and impromptu feedback meetings with clients</li></ul><p><strong>Required Experience</strong></p><ul><li>You have a portfolio showing your design process for multiple digital products across different industries</li><li>You have worked in an agile product development environment<strong>Let’s Talk About Us</strong></li></ul><p>Modus Create is a Product Studio offering consulting services and SaaS products for strategic planning, design and execution of web-based and mobile products. We work across multiple industries with Fortune 1000, ISVs, and startups to validate, plan and launch new products. Headquartered in Reston, VA, we are a bootstrapped team that has grown from 2 to 100 people in 26 countries in 6 years, committed to building the best product consulting firm on the planet. We offer a highly collaborative, autonomous and effective working environment. We love and believe in what we do. This is your chance to be part of building something great.</p><p><strong>Why Modus Create</strong></p><ul><li>Enjoy the independence to shape digital products </li><li>Never get bored. Work on different projects across different industries. Fitness, banking, corporate security, travel, real estate — you name it, we’ve been there</li><li>Build products that people will actually use. See your work in the app store, or in the hands of companies with thousands of employees</li></ul><p><strong>Collaborate with other bright user experience minds to shape a quickly growing user experience practice</strong></p><ul><li>Competitive compensation</li><li>Ability to work remotely / telecommute</li><li>Working side-by-side with thought leaders in emerging tech</li></ul><p><strong>Do you have what it takes to join the DC area's most awesome tech company? Let’s start a conversation.</strong></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Preference will be given to candidates located in the Western Hemisphere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Dec 28, 2017 6:35:27 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/mobile",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "mobile"
    ]
  },
  {
    "id": "j8DPVG9KS7q6fcbeOlqsrg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63976",
    "title": "UX Designer Western Hemisphere Preferred",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>Hello Designer, does this sound like you?</strong> People describe you as a generalist, but you have your specialties. You could run a design project from start to finish, but you nerd out when it comes to a specific craft like visual design or ethnographic research. You also value soft skills. For you, over-communicating and project planning are essential to any project’s success. Selling your designs is second nature to you, because you design with intent. And pretty deliverables mean nothing to you unless you ship a product that moves the needle.<br><br><strong>You design fast</strong> — keyboard shortcuts are your poor fingers’ best friends. You know when to lean on existing patterns and when to create something fresh. And you understand the difference between innovating and copying. To you, perfectionism is a dirty 13 letter word that has no place in design.<br><br><strong>You accept that most companies follow a wonky design process, and that’s why they need your help.</strong> You believe that teaching is actually the perfect way to stay up to date on your craft. You preach that user experience is more than just what you see on the screen. The most frequent word in your vocabulary arsenal is “Why?” You’re as good at understanding problems as you are at solving them. <br><br>This contract role may be performed from a remote location and requires a level of effort estimated at 40 hours per week. Compensation for this role is between 20 to 35 USD / hour.<br><br><strong>Your Responsibilities</strong><br><br></p><ul><li>Own the end-to-end design process for your projects<br></li><li>Facilitate discovery sessions with clients and stakeholders to define success, requirements, and strategy<br></li><li>Actually interact with customers to research their tasks, pain points, and emotions <br></li><li>Use research to inform feature prioritization. Translate research data into digestible deliverableS<br></li><li>Create interaction design patterns in the form of user flows, wireframes, full color mockups, and interactive prototypes<br></li><li>Sell your work — tell compelling stories when presenting deliverables to customers<br></li><li>Be comfortable in formal design presentations and impromptu feedback meetings with clients<br><br><strong>Required Experience</strong><br><br></li><li>You have a portfolio showing your design process for multiple digital products across different industries<br></li><li>You have worked in an agile product development environment<br><br><strong>Let’s Talk About Us</strong><br><br>Modus Create is a Product Studio offering consulting services and SaaS products for strategic planning, design and execution of web-based and mobile products. We work across multiple industries with Fortune 1000, ISVs, and startups to validate, plan and launch new products. Headquartered in Reston, VA, we are a bootstrapped team that has grown from 2 to 100 people in 26 countries in 6 years, committed to building the best product consulting firm on the planet. We offer a highly collaborative, autonomous and effective working environment. We love and believe in what we do. This is your chance to be part of building something great.<br><br><strong>Why Modus Create</strong><br><br></li><li>Enjoy the independence to shape digital products <br></li><li>Never get bored. Work on different projects across different industries. Fitness, banking, corporate security, travel, real estate — you name it, we’ve been there<br></li><li>Build products that people will actually use. See your work in the app store, or in the hands of companies with thousands of employees<br><br><strong>Collaborate with other bright user experience minds to shape a quickly growing user experience practice</strong><br><br></li><li>Competitive compensation<br></li><li>Ability to work remotely / telecommute<br></li><li>Working side-by-side with thought leaders in emerging tech<br><br><strong>Do you have what it takes to join the DC area's most awesome tech company? Let’s start a conversation.</strong></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 28, 2017 6:35:27 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/mobile",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "mobile"
    ]
  },
  {
    "id": "mYl9g8UJTWe2cXGGMqtDeA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30153?r=rss2",
    "title": "BriteCore: UI/UX Designer",
    "content": "<p>Full-time</p><p><strong>(Springfield, MO (Remote Work Encouraged))</strong> </p><p>Do you want want to make a difference solving interesting problems? Do you want to influence the direction of your career and play a key role in shaping an application’s design? Do you love good typography and are excited about creating a scalable design system?</p><p>If you answered &quot;Yes!&quot; to all of those questions, then you might be a great fit for BriteCore. As a member of our design team, you will work with an excellent group of engineers to solve complex problems with clear, effective design. Currently, we are looking for a UI/UX designer who is able to contribute to the entire design process at BriteCore. This includes:</p><ul><li>Creating initial design sketches and workflows</li><li>Coding up designs in HTML and CSS</li><li>Testing designs with real users.</li></ul><p><em>If you have expertise in these areas, please apply with us today!</em></p><p><strong>Benefits and Compensation</strong></p><ul><li>$40k-$60k based on experience and proven performance</li><li>Benefit from working alongside and observing a team of world-class engineers and designers</li><li>Comprehensive health insurance coverage including medical, dental, and vision</li><li>Flexible schedule</li><li>Relaxed work environment</li><li>Remote work</li><li>Flexible learning time — explore your ideas and new technologies on the clock</li></ul><p><strong>Technologies You Will Utilize</strong></p><ul><li>Sketch, Balsamiq, or other wire-framing tools</li><li>Adobe Creative Suite</li><li>HTML5</li><li>SCSS, PostCSS</li><li>Javascript experience a plus (our developers use jquery, <a href='http://vue.js/' rel='nofollow'>vue.js</a>)</li><li>GitHub</li><li>Command Line (previous experience a plus, but not required)</li></ul><p><strong>We’ll expect you to</strong></p><ul><li>Create usable designs around complex workflows</li><li>Inform design decisions with data, user testing</li><li>Communicate clearly</li><li>Welcome feedback and collaboration</li><li>Be friendly, confident, and patient with others</li><li>Self-direct</li><li>Have a keen sense for what makes an attractive UI</li><li>Stay up on industry best practices and trends</li></ul><p><strong>About the Company</strong></p><p>At BriteCore, we build gorgeous, scalable, and usable cloud-based insurance software. This is a company where design is deeply valued and has a seat at the table. We have created a team of top performers developing modern systems for the insurance industry. Our team enjoys working together, and takes tremendous pride and ownership in our platform. The environment is progressive – we are building a modular design system for use across all of our products. We love great technology and design and it shows in every aspect of our product. Our team enjoys a flexible, balanced, and stimulating environment. We promote a high quality of life for our employees by allowing them to choose their own schedule and location. Bring creativity, focus, and productivity to your job, and enjoy 40 hour work weeks, flexible paid time off, and remote work.</p><p></p><p><strong>Job Perks:</strong> - Flexible Hours- 3+ weeks Paid Time Off- Competitive Compensation- Comprehensive Health Insurance- Most employees work remotely- Relaxed Work Environment- Explore ideas, new technologies on the clock- Annually attend a conference of your choice- Work alongside talented designers &amp; developers</p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Dec 27, 2017 9:44:06 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "rBvaLfFnQpydNwPNqVc7OQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8667-ux-ui-designer",
    "title": "UX/UI Designer",
    "content": "UX/UI&nbsp;Designer - Jobmote<div><div><h2>UX/UI&nbsp;Designer</h2><h5>Clevertech</h5></div></div><div><div><div><div><div><h4>DESCRIPTION</h4><p>Clevertech is looking for a UX/UI Designer to join our global team. We are looking for team members to help us develop world class software products for the most exclusive organizations in the world. We have been at this for seventeen years, and continue to grow off our best asset, our people.</p><p>In this role you will have significant responsibility in one of our project development teams to ensure client satisfaction by executing on the deliverables.</p><h4>REQUIREMENTS</h4><p>Clevertech looks for craftsmen developers who take ownership of their designs. You can deliver quickly while being clever to avoid missteps. You have an effective positive attitude that shines as you show your care about client and colleague concerns. You are always learning and are a transparent communicator even when it is challenging. You thrive on challenging yourself daily and seek to surround yourself with like minded individuals.</p><p>You understand good UX and good UI and what that means and love to create successful designs (that delight customers) and you can successfully bring a whole concept from idea to wireframe, to mockup/prototype and have the deliverables to prove it. You have worked in significant mobile projects and have participated in the full design cycle to deliver world class, pixel perfect designs.</p><h4>BENEFITS</h4><h5>Own Your Time</h5><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We are a collective of like minded people in over ten countries, and our global perspective shapes our every move.</p><h5>Focused Work</h5><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams. And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p><h5>Learn at your edges</h5><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</p><p>And of course, if you speak at a tech conference, we cover all expenses.</p><h5>Recharge Time</h5><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p>Want to learn more about Clevertech and the team? Check out&nbsp;<a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 27, 2017 8:00:32 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "eirit3ylSA60pOMAWrxlFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30141?r=rss2",
    "title": "Clevertech: UX/UI Designer",
    "content": "<p>Full-time</p><p><strong>(New York)</strong> </p><h3>DESCRIPTION</h3><p>Clevertech is looking for a UX/UI Designer to join our global team. We are looking for team members to help us develop world class software products for the most exclusive organizations in the world. We have been at this for seventeen years, and continue to grow off our best asset, our people.</p><p>In this role you will have significant responsibility in one of our project development teams to ensure client satisfaction by executing on the deliverables.</p><h3>REQUIREMENTS</h3><p>Clevertech looks for craftsmen developers who take ownership of their designs. You can deliver quickly while being clever to avoid missteps. You have an effective positive attitude that shines as you show your care about client and colleague concerns. You are always learning and are a transparent communicator even when it is challenging. You thrive on challenging yourself daily and seek to surround yourself with like minded individuals.</p><p>You understand good UX and good UI and what that means and love to create successful designs (that delight customers) and you can successfully bring a whole concept from idea to wireframe, to mockup/prototype and have the deliverables to prove it. You have worked in significant mobile projects and have participated in the full design cycle to deliver world class, pixel perfect designs.</p><h3>BENEFITS</h3><h4>Own Your Time</h4><p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We are a collective of like minded people in over ten countries, and our global perspective shapes our every move.</p><h4>Focused Work</h4><p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams. And keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p><h4>Learn at your edges</h4><p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here.</p><p>And of course, if you speak at a tech conference, we cover all expenses.</p><h4>Recharge Time</h4><p>We insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p><p>Want to learn more about Clevertech and the team? Check out&nbsp;<a href='http://why.clevertech.biz/' rel='nofollow'>why.clevertech.biz</a>.</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Dec 27, 2017 7:46:29 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "7hbfNdGCTBae1UQAgnTeCA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/64594/graphic-designer-at-mama-marketing/",
    "title": "Graphic Designer",
    "content": "We are seeking a Freelance Designer to join the MAMA team. <br /><br />Responsibilities will include:<br /><br />- Social Media Content Creation<br /><br />- Print Design work <br /><br />- Branding Development <br /><br /><br />Work will be allocated when required by current MAMA projects and rates agreed prior to commencement of each project. <br /><br />Clear content briefs will be provided by our strategists but there is always scope of new ideas in our work. <br /><br />The role is remote but regular briefings and catch-ups will be required, mostly in South West England.<br /><br />This is an ideal position for a recent graduate or someone keen to utilise their design skills on a freelance basis with a fun team who are always looking for new exciting ways to achieve marketing success. <br /><br />We are working on some exciting and varied projects which the Designer will be thrown straight into and with plenty of work in the pipeline we are looking for someone to engage with how design can help achieve success for our clients from concept to delivery. <br /><br />There will be significant scope for growth within the role and as new projects/contracts are secured. <br /><br />To apply, please email your CV and some examples of your work.<br /><br />Please note this is not a full time position and work will be on an ad-hoc basis as and when required. <br /><br />We look forward to hearing from you!<br /><br />No agencies please.",
    "urlFetchPending": false,
    "published": "Dec 25, 2017 9:41:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "jUC3Oa7DQQyYdil18moHdg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4053-user-experience-designer-protocol-labs",
    "title": "User Experience Designer @ Protocol Labs",
    "content": "<h2>              User Experience Designer<small> @ Protocol Labs</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-12-23 01:48</p></dd>          <dt><span>Description</span></dt>          <dd><p><em>Hiring a passionate User Experience designer to design web and desktop interactions that bring the power of the decentralized web into people's lives and minds.</em></p><p><strong>Your Role at Protocol Labs</strong></p><p>Bring the power of the decentralized web into people's lives and minds.</p><p>As a User Experience designer at Protocol Labs you will get to apply your talents to a range of products and experiments. Our R&amp;D structure allows a lot of room to explore the UX possibilities that arise around the technologies we create. Some of your work will be very practical design, applied to software that's used by many thousands of people. Other work will be speculative and open-ended explorations that you carry out with product teams.</p><p>Some examples of software you might (re)design are the IPFS web-based UI that ships with all IPFS nodes, client software for the Filecoin storage network, completely new tools for storing and sharing files, and the Interactive documentation for the many APIs and protocols we publish.</p><p>We are looking for someone who can be a thought leader, undertaking explorations into new territories, while also delivering practical designs in a fast-moving product driven context.</p><p><strong>Responsibilities</strong></p><ul><li>Collaborate with Product Managers, End-Users and Software Engineers to design compelling experiences for our software products</li><li>Participate in product teams throughout the iterative design-development cycle, advocating for users and delivering designs in a dynamic work environment</li><li>Explore the UX implications of decentralized technologies, showing new possibilities to the world, and moving towards the establishment of UX conventions in this space</li></ul><p><strong>Requirements</strong></p><ul><li>A portfolio of designs and implemented software that shows an ability to create experiences that engineers can implement and end-users adore</li><li>Experience working on a software team, delivering designs in an iterative, agile work environment</li><li>Adept at applying and breaking the rules of web and desktop software interaction</li><li>Familiarity with software accessibility requirements for web and desktop</li></ul><p><strong>What’s it like to work at Protocol Labs?</strong></p><p>Protocol Labs mission is to improve humanity’s most important technology, the Internet. We build protocols, systems, and tools to improve how it works. Today, we are focused on how we store, locate, and move information. Our projects include IPFS, Filecoin, libp2p, and more.</p><p>As a distributed team, we hire anywhere in the world, and at various levels of experience (entry, senior, staff). We look for people with unique perspectives and diverse backgrounds.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Dec 23, 2017 3:48:15 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "HhkVRmwaTE6LycAQExQ6Sw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/cinemaloop/jobs/57781-ui-ux-designer-remote-founding-team-love-movie-culture-paid-in-equity",
    "title": "UI/UX Designer -*Remote* | *Founding-Team* | *Love Movie Culture*| Paid in Equity*",
    "content": "<div><h2>UI/UX Designer -*Remote* | *Founding-Team* | *Love Movie Culture*| Paid in Equity* at Cinemaloop</h2><div>United States, Europe, Canada, Remote · Cofounder</div><div></div></div><div><div>Skills</div><div>Graphic Design, Branding, Mobile Application Design, User Interface Design, Wireframing, Usability, Creative, Adobe Creative Suite, UI/UX Design, Typography, Adobe Photoshop, Adobe Illustrator, Usability Testing, Responsive Design, Icon Design, Iconography, Layout, 2D Art, Mobile User Interface Design, Mobile UI Design, Layout and Design, Wireframes and prototyping, InVision Prototyping, Creative and Artistic Direction</div><div>Compensation</div><div>No Salary<br>0.3%–0.7%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>***READ AD BEFORE APPLYING***<br>**NO SERVICES**<br>Do you love Movies, Moviegoing, Film, Cinema and have a passion for Startups?</p><p>We are looking for additional right fit entrepreneurial spirited graphics designer to join our great graphics team.</p><p>You should be excited about being a part of a startup that is helping to change the cinema-going experience world-wide. You love getting your hands dirty to contribute skills, passion, dedication and commitment working with a Startup from the ground-up; nothing is more exciting to you and makes you feel highly accomplished as being there in the beginning to help take a fledging startup into a successful company.</p><p>WHO WE ARE <br>At Cinemaloop, we love movies and the cinema-going experience. We’re on a mission to design new innovative platform experiences for the moviegoing-loving generation. We are cinemalovers, moviebuffs, filmnerds, cineasocialities, and cinephiles looking for other cofounding members to join us to help complete Cinemaloop MVP.</p><p>CINEMALOOP <br>The easiest way to connect to a movie buddy! <br>Cinemaloop is an engagement platform solving the issue of cinema attendance decline by focusing on global moviegoer (interest centric) connections through web and smartphone connectivity; helping to enhance moviegoing experiences as well as disrupt outdated industry and patronage relationship systems. <br>sion, dedication and time to help complete execution of Cinemaloop MVP.</p><p>YOU ARE: <br>- Understand this is equity paid (sweat equity).<br>- Looking for a startup to join 'on the side' from your normal day job.<br>- You have the part time availability of 15hrs a week. <br>- Remote - be within US, Canada, or Europe (or relative) Timezones.<br>- Excited to help change the face of the moviegoing experience. <br>- Entrepreneurial Spirited <br>- Help push the vision of Cinemaloop MVP to movie fans around the world <br>- Passion for connecting /interaction with people and sharing ideas <br>- Passionate strategic and critical thinker. <br>- Passion for Movies, Cinema and Movie culture <br>- Strong sense of responsibility and ownership <br>- Excellent writing and verbal communication skills ( in English) <br>- Excellent organization skills and the ability to multi-task <br>- Impeccable attention for detail, following protocol/policy and good judgment <br>- Commitment to seeing tasks through to completion <br>- Must be self-directed, confident and able to work in remote/co-working environments. <br>- Sense of humor, passion for your work and desire to grow yourself <br>- Experience with group + lean startup culture and what it takes</p><p>YOUR SKILLS <br>- Expert knowledge of Adobe Photoshop, Illustrator, InDesign, and other Adobe CS<br>- User Experience (UX) designer experience <br>- User Interface (UI) Designer experience<br>- Detailed understanding of web/mobile UI standards for interfaces<br>- Responsive Design<br>- Design for web and mobile platforms<br>- Strong knowledge of web/mobile usability &amp; layout demonstrated from inception to completion<br>- Icon, typographic etc assets<br>- Mockups and users flows<br>- Prototyping for live viewing<br>- Working to maintain design and brand consistency throughout implementation and between products<br>- Ability to solve all sorts of design challenges with creativity, efficiency and precision<br>- Illustrates concept by designing rough layout of art and copy regarding arrangement, size, type size and style, and related aesthetic concepts.<br>- Detail oriented, consistently delivering high quality designs.</p><p>BENEFITS <br>Phantom Equity/Shares 300,000 - 700,000 </p><p>HOURS<br>(20hr wk) </p><p>TEAM LOVE<br> Dynamic, friendly and remote</p><p>*** IMPORTANT when you reply start by typing the code words: &quot;Moviegoer&quot; <br>This way we know you took the time to read the complete description, understand the details, instead of just replying to all new submission like many people do. </p><p>If there is no &quot;Moviegoer&quot; in the reply we will ignore your message, no matter how attractive.</p><p>Thank you</p></div>",
    "urlFetchPending": false,
    "published": "Dec 15, 2017 6:58:31 PM",
    "tags": [
      "Adobe Creative Suite",
      "Branding",
      "Canada",
      "Cofounder",
      "Creative",
      "Designer",
      "Europe",
      "Graphic Design",
      "Mobile Application Design",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/Europe",
      "Typography",
      "UI/UX Design",
      "UI/UX Designer",
      "United States",
      "Usability",
      "User Interface Design",
      "User Researcher",
      "Wireframing"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "wNNBHYfaRly9tlaKxY6-dA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-designers",
    "url": "http://workinstartups.com/job-board/job/64367/freelance-ux-designer-at-monese/",
    "title": "Freelance UX Designer",
    "content": "About Us<br /><br />At Monese we believe that access to banking and financial services is a right that everybody should enjoy. We are on a mission to ensure that anyone in the world who needs a bank account can get one. By using leading edge technology via smartphones, we offer services that are easy to access, simple to use and cheap to run for anybody. Our fast growing team is located in London, United Kingdom and Tallinn, Estonia, and we know that what we’re building is bigger than anything on the market today. Join us!<br /><br />The role<br />We are looking for a freelance UX designer, who will mainly be working on the design of our website. You will be collaborating with our design team as well as with our marketing team in creating an exciting and meaningful project which directly influences the product and its success.<br /><br />REQUIREMENTS<br /><br />As a perfect candidate, you’ll have<br />•    The ability to collaborate in a multi-disciplinary team and create the future of banking.<br />•    An ability to turn complex functionality into an elegant and delightful experience.<br />•    Awareness of technology trends and experience of design across web platforms.<br />•    Experience in using various design and prototyping tools.<br />•    The ability to take charge of your time and meet deadlines.<br /><br />BENEFITS<br /><br />Benefits of working at Monese:<br />•    An opportunity for independent and self-reliant work<br />•    Knowing your contributions matter on every level in making our product the best it can be<br />•    International team and fun office environment with plenty of perks<br />•    An incredible team of open-minded people dedicated to creating the best banking product yet<br />•    Flexible working schedule and possibility to work remotely.<br /><br /><br />Excited?<br /><br />Send us a cover letter, CV, and an outstanding personal portfolio.<br />",
    "urlFetchPending": false,
    "published": "Dec 14, 2017 10:03:41 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/designer",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "HtZ978ZlQ_CexcD9eu7I4g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/spacious/jobs/85550-ui-designer",
    "title": "UI designer",
    "content": "<div><h2>UI designer at Spacious</h2><div>Earth, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$25K–$30K<br>0.25%–0.3%</div></div><h3>Job Description</h3><div><p>Company Description<br>At Spacious, we’re solving real-world problems that affect nearly every single person at some point in their life. Finding a great place to live in any city can be stressful at the best of times, a nightmare at worst. We’re making it easier than ever to do this. The property search process will never be the same. Come change peoples lives with us. Spacious.hk is an online marketplace connecting buyers and tenants with properties throughout Asia. Spacious.hk differentiates itself by combining a superior user experience with powerful analytical tools and relevant content to make the process of buying, renting or selling a property as simple and efficient as possible.</p><p>Your role and impact<br>The Spacious team is looking for a UX/UI Designer to create digital products with user-centered methods. We’re constantly refining our craft to create a wonderful user experience. You’ll join the product team to maintain and scale the product development process. <br>We expect you to solve design problems by thinking through various scenarios, finding reasonable solutions, mocking them up in detail and work with engineers to build them.</p><p>Responsibilities<br>Develop design ideas with understanding of product and business goals<br>Communicate and visualize the design ideas with wireframes, mockups, and prototypes<br>Constantly give and receive feedback to improve user experience with data and research<br>Work with the product team to develop and iterate products from ideas to implementation with understanding of the technical limitations and liberties behind your decisions<br>Maintain design consistency and develop Spacious style guides</p><p>Requirements<br>At least 2 years of UX/UI Designer experience for web and mobile<br>Experience working with engineers and product managers<br>A portfolio of relevant design work (*please attach samples as a cover letter, or provide a link to your portfolio)<br>Strong speaking and writing skills in English<br>Passionate about details and have pixel-perfect obsession<br>Proficiency in design tools: Adobe Creative Suite, Sketch, etc<br>You thrive in a startup environment</p></div>",
    "urlFetchPending": false,
    "published": "Dec 14, 2017 12:19:08 AM",
    "tags": [
      "Earth",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown",
      "UI/UX Designer"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "S04r-QMKSfSvGWu7ooB8XA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63691",
    "title": "UI UX Designer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Status is hiring an UI / UX Designer in Remote (Anywhere)</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 13, 2017 1:50:32 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "3hMzS4XCSL2xbVehDvgwnQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/josh-talks/jobs/120465-video-editor",
    "title": "Video Editor",
    "content": "<div><h2>Video Editor at Josh Talks</h2><div>Delhi, Gurgaon, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Video Editing, Adobe Photoshop, Adobe After Effects, Adobe Premiere, Video Editor</div><div>Compensation</div><div>₹350K–₹800K<br>No Equity</div></div><h3>Job Description</h3><div><p>Video Editor Responsibilities</p><p>Include:</p><p>Manipulating and editing content in a way that is invisible to the audience<br>Taking a brief to grasp production team’s needs and specifications<br>Reviewing shooting script and raw material to create a shot decision list based on scenes’ value and contribution to continuity<br>video editor job description</p><p>Job brief</p><p>We are looking for a talented video editor to assemble recorded footage into a finished project that matches director’s vision and is suitable for broadcasting.</p><p>Ultimately, as a film and video editor, you should be able to bring sight and sound together in order to tell a cohesive story</p><p>Responsibilities</p><p>Manipulate and edit film pieces in a way that is invisible to the audience<br>Take a brief to grasp production team’s needs and specifications<br>Review shooting script and raw material to create a shot decision list based on scenes’ value and contribution to continuity<br>Trim footage segments and put together the sequence of the film<br>Input music, dialogues, graphics and effects<br>Create rough and final cuts<br>Ensure logical sequencing and smooth running<br>Consult with stakeholders from production to post-production process<br>Continuously discover and implement new editing technologies and industry’s best practices to maximize efficiency.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 12, 2017 9:32:48 AM",
    "tags": [
      "Adobe After Effects",
      "Adobe Photoshop",
      "Adobe Premiere",
      "Delhi",
      "Full Time",
      "Gurgaon",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown",
      "Video Editing",
      "Video Editor",
      "Visual Designer"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "YSKBb8w-TwGN3iZreVfBmQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63652",
    "title": "UI UX Freelance Designer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Resolution Resources is hiring an UI/UX Freelance Designer in Remote, Anywhere</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 8:52:46 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "ghngpyNTRpWx6G59SF4CNQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63629",
    "title": "Design Curator San Francisco CA",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Creative Market is hiring a Design Curator in San Francisco, CA or Remote (U.S. only)</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 10, 2017 11:38:10 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "PJkn1A7cSsaPOul320pgNw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/160994/product-designer-ux-ui-jack-henry-associates-inc?a=RZwLnqOr7ri",
    "title": "Product Designer (UX/UI) at Jack Henry & Associates, Inc.® (Cedar Falls, IA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Designer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Banking, Financial Technology, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>5k-10k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Public</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>We’re looking for a Product Designer that has a passion for problem solving. Come join our small, but growing, team for the Banno Platform at Jack Henry. You will be working with a team of 4 other Product Designers that are distributed across various locations for Jack Henry &amp; Associates. As a Product Designer, you’ll get the chance to make a real, positive impact on people’s lives. Our mission is to give people the best possible experience they can have with their finances. We’re doing this by reimagining the online banking ecosystem and building products that empower and delight. As a Product Designer you will facilitate the design of consumer and enterprise user experiences that span across the web, mobile and beyond.</p>                    </div>                            <h2>                About Jack Henry &amp; Associates, Inc.®            </h2>            <div><p>We are committed to creativity, thoughtfulness, culture, and openness—the perfect place to make phenomenal products that have a meaningful impact. Our work environment echoes a modern tech startup but we have the security and benefits of a large, publicly traded company. With our small team of product designers, we place a high value on individuals who can work across the design disciplines of IA, UX, and visual design. <br><br>Our team is distributed and that means you can live and work wherever you want–as long as your work hours match US business hours. Travel will be up to 5% for professional development conferences, onsite user testing, and or company meetings.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Remote Work Opportunities                            </div>                            <div>                                 Competitive Salaries                            </div>                            <div>                                 Employee Stock Purchase Plan (ESPP)                            </div>                            <div>                                 Awesome Health Insurance                            </div>                            <div>                                 Excellent PTO &amp; Paid Holidays                            </div>                            <div>                                 Casual Business Attire                            </div>                            <div>                                 Paid Parental Leave                            </div>                            <div>                                 Forbes Top 100 Best Places to Work 2017 (#7 in IT)                            </div>                            <div>                                 Computerworld's Best Places to Work in IT 2017                            </div>                    ",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 11:13:54 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "MlPSngG1SbaiML-FuhFj4A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8422-web-designer",
    "title": "Web Designer",
    "content": "Web Designer - Jobmote<div><div><h2>Web Designer</h2><h5>Hubstaff</h5></div></div><div><div><div><div><div><ul><li>Must be willing to work during US business hours</li></ul><p>As a Web Designer you’ll craft beautiful, conversion-oriented webpages, graphics and designs for our marketing team. You’ll also designemail templates, guides, graphics and illustrations. You’ll influenceoverall brand design direction by collaborating with copywriters,marketers, and peers to help bring creative ideas to life. </p><p>The Role: </p><p>Design beautiful, conversion-oriented websites that will help expand and elevate our existing brand </p><p>Create amazing digital marketing materials with our marketing team (ads, social media graphics, eBooks) </p><p>Improve our brand through your market focus and fundamental understanding of what our customers want</p><p>Your background: </p><p>3+ years of web design experience </p><p>Understanding of HTML, CSS, Wordpress and Git </p><p>Advanced understanding of conversion principles in design. </p><p>Refined sense for incorporating composition, balance, symmetry, and white space into your design aesthetic. </p><p>You’ve helped shape and refine a brand's design style </p><p>Empathy for users and ability to creatively solve problems through design. </p><p>Attention to detail down to the last pixel. </p><p>You’re always learning and on top of the latest trends and tactics.</p><p>Bonus Points: </p><p>You’ve created illustrations for motion graphic videos </p><p>You’ve created and maintained style guides</p><p>This is us: </p><p>Hubstaff is a thriving startup with a fully distributed team. We are akind and transparent team with a bright future. You’ll work hard andface exciting challenges but our work comes with great advantages andfulfillment. Our wonderful team members can expect... </p><p>Competitive pay </p><p>Flexible schedule, work anywhere </p><p>Long term meaningful work </p><p>Annual Retreat </p><p>Opportunities for growth </p><p>We celebrate and value everyone’s individualities. We believe diversethought and perspective leads to collaboration, product innovation, and asuccessful business.</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 8, 2017 1:00:32 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "Tu7Bsq_QTSul0-ZuR6invA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/jobs/5912-web-designer",
    "title": "Hubstaff: Web Designer",
    "content": "<div>  <div>    <h2>Web Designer</h2>      <h4>Posted Dec  7</h4>    <h3>      <span>Hubstaff</span><br>      <span>Headquarters: Remote</span><br>        <a href='https://hubstaff.com/' rel='nofollow'>https://hubstaff.com/</a>    </h3>  </div>    </div>  <div>    <div>*Must be willing to work during US business hours</div><div><br></div><div></div><div>As a Web Designer you’ll craft beautiful, conversion-oriented web pages, graphics and designs for our marketing team. You’ll also design email templates, guides, graphics and illustrations. You’ll influence overall brand design direction by collaborating with copywriters, marketers, and peers to help bring creative ideas to life.<br></div><div>The Role:<br></div><div>Design beautiful, conversion-oriented websites that will help expand and elevate our existing brand<br></div><div>Create amazing digital marketing materials with our marketing team (ads, social media graphics, eBooks)<br></div><div>Improve our brand through your market focus and fundamental understanding of what our customers want</div><div><br></div><div></div><div>Your background:<br></div><div>3+ years of web design experience<br></div><div>Understanding of HTML, CSS, Wordpress and Git<br></div><div>Advanced understanding of conversion principles in design.<br></div><div>Refined sense for incorporating composition, balance, symmetry, and white space into your design aesthetic.<br></div><div>You’ve helped shape and refine a brand's design style<br></div><div>Empathy for users and ability to creatively solve problems through design.<br></div><div>Attention to detail down to the last pixel.<br></div><div>You’re always learning and on top of the latest trends and tactics.</div><div><br></div><div></div><div>Bonus Points:<br></div><div>You’ve created illustrations for motion graphic videos<br></div><div>You’ve created and maintained style guides</div><div><br></div><div></div><div>This is us:<br></div><div>Hubstaff is a thriving startup with a fully distributed team. We are a kind and transparent team with a bright future.  You’ll work hard and face exciting challenges but our work comes with great advantages and fulfillment. Our wonderful team members can expect...<br></div><div>Competitive pay<br></div><div>Flexible schedule, work anywhere<br></div><div>Long term meaningful work<br></div><div>Annual Retreat<br></div><div>Opportunities for growth<br></div><div>We celebrate and value everyone’s individualities. We believe diverse thought and perspective leads to collaboration, product innovation, and a successful business.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://talent.hubstaff.com/jobs/web-designer-9358a9' rel='nofollow'>https://talent.hubstaff.com/jobs/web-designer-9358a9</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 8, 2017 12:19:02 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "CeM0fVpaSu6ykyBC1Fk15g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63564",
    "title": "Web Designer",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div>*Must be willing to work during US business hours</div><div><br></div><div></div><div>As a Web Designer you’ll craft beautiful, conversion-oriented web pages, graphics and designs for our marketing team. You’ll also design email templates, guides, graphics and illustrations. You’ll influence overall brand design direction by collaborating with copywriters, marketers, and peers to help bring creative ideas to life.<br></div><div>The Role:<br></div><div>Design beautiful, conversion-oriented websites that will help expand and elevate our existing brand<br></div><div>Create amazing digital marketing materials with our marketing team (ads, social media graphics, eBooks)<br></div><div>Improve our brand through your market focus and fundamental understanding of what our customers want</div><div><br></div><div></div><div>Your background:<br></div><div>3+ years of web design experience<br></div><div>Understanding of HTML, CSS, Wordpress and Git<br></div><div>Advanced understanding of conversion principles in design.<br></div><div>Refined sense for incorporating composition, balance, symmetry, and white space into your design aesthetic.<br></div><div>You’ve helped shape and refine a brand's design style<br></div><div>Empathy for users and ability to creatively solve problems through design.<br></div><div>Attention to detail down to the last pixel.<br></div><div>You’re always learning and on top of the latest trends and tactics.</div><div><br></div><div></div><div>Bonus Points:<br></div><div>You’ve created illustrations for motion graphic videos<br></div><div>You’ve created and maintained style guides</div><div><br></div><div></div><div>This is us:<br></div><div>Hubstaff is a thriving startup with a fully distributed team. We are a kind and transparent team with a bright future. You’ll work hard and face exciting challenges but our work comes with great advantages and fulfillment. Our wonderful team members can expect...<br></div><div>Competitive pay<br></div><div>Flexible schedule, work anywhere<br></div><div>Long term meaningful work<br></div><div>Annual Retreat<br></div><div>Opportunities for growth<br></div><div>We celebrate and value everyone’s individualities. We believe diverse thought and perspective leads to collaboration, product innovation, and a successful business.</div><div><br></div><p><strong>To apply:</strong> <a href='https://talent.hubstaff.com/jobs/web-designer-9358a9' rel='nofollow'>https://talent.hubstaff.com/jobs/web-designer-9358a9</a></p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 8, 2017 12:19:02 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "Wcw_vLoWTUeKkbhuqGS1eA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/bobble-app/jobs/64955-ui-ux-designer",
    "title": "UI/UX Designer",
    "content": "<div><h2>UI/UX Designer at Bobble Keyboard</h2><div>Delhi, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>UI/UX Design</div><div>Compensation</div><div>₹1000K–₹20K<br>0.0%–0.1%</div></div><h3>Job Description</h3><div><p>We are looking for an experienced UI / UX engineer who is a perfectionist with detailing on design elements, aesthetics of the overall design and with a great sense on color and placements. A key player and one who can recommend design ideas with logical reasoning.</p><p>You must have:</p><p>• Enthusiasm to work in a start-up environment<br>• A solid portfolio demonstrating innovative design solutions<br>•&nbsp;1-5 years of experience in UI/UX for Mobile UI (Android&amp; iOS)<br>• Direct interaction with users to understand their behavior and expectations<br>•&nbsp;Conceptualizing, designing and prototyping new features for our core product<br>•&nbsp;Measuring the impact of design and iterating over it<br>•&nbsp;Following material design guidelines<br>•&nbsp;Working closely with the product team and brainstorming the ideas and execute them till the last level<br>• Must have good understanding of typography, layout and color theory<br>•&nbsp;Proficiency with several design tools (Sketch, Adobe Photoshop, Illustrator •etc.)</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 4:18:31 AM",
    "tags": [
      "Delhi",
      "Designer",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/frontend",
      "TECH1/mobile",
      "TITLE1/designer",
      "TZ/unknown",
      "UI/UX Design",
      "UI/UX Designer",
      "User Researcher"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend",
      "mobile"
    ]
  },
  {
    "id": "e5EJvLz8RDCRtTdibZje5Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/hostcopper/jobs/138249-web-design-sales",
    "title": "Web Design Sales",
    "content": "<div><h2>Web Design Sales at Hostcopper</h2><div>Houston, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$24K–$35K<br>30.0%–40.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Location : United States (located anywhere) <br>Position: Outside Sales <br>Full-Time or Part Time </p><p>Job Description<br>Hostcopper is a leading provider in the Web Hosting industry. We are looking for employees that want to grow long term with the company. We are a start up company that is expanding rapidly. We contribute to your success and being happy as a employee. This is a commission based position. </p><p>Candidate <br>A ideal candidate we are looking for can be part time or full time. That has retail or sales experience. </p><p>Function:<br>Development of new business within the web hosting and web design industry and run all business development activities.<br>This is a head hunting role business to business sales. </p><p>Responsibilities:<br>Increase customer base and develop customer contacts. <br>Sell and promote web design services and web hosting to provide maximum exposure of the companies image. <br>Manage the entire sales process involved with selling web design services to new clients (prospecting, territory management, meeting scheduling, product demonstrations, objection handling, contract negotiation).<br>Develop relationships with individual customers and sell to all types of industries. <br>Provides management with complete, current and accurate data on applicable customer activity.<br>Demonstrate effectiveness by consistently hitting (and exceeding) monthly, quarterly and yearly objectives.<br>Provides input to development of business goals and assess recommendations for new business areas and opportunities.<br>Drive penetration into assigned markets through various means including email, telephone. </p><p>Required Qualifications:<br>Minimum of 1 year business development in sales or retail sales experience. <br>Ability to recognize opportunities and utilize sales experience to successfully negotiate and close deals within the Web Hosting/Web Design Industry. <br>Ged or high school diploma required.<br>Strong leadership, behavior traits and a desire to succeed.<br>Excellent communication and organizational skills. <br>Compensation is based on your performance, so your efforts determine your rewards. We offer a great benefits package, 401k, room for advancement.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 10:22:34 PM",
    "tags": [
      "Full Time",
      "Houston",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "nEGW0phlR6u5qQbOsdN80Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/visualcv/jobs/102800-frontend-developer-with-ui-ux-design-experience",
    "title": "Frontend developer with UI/UX design experience",
    "content": "<div><h2>Frontend developer with UI/UX design experience at VisualCV</h2><div>Vancouver, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>HTML, CSS, MySQL, PostgreSQL, Ruby on Rails, Sketch, React.js, AWS</div><div>Compensation</div><div>$75K–$100K<br>0.0%–0.02%</div></div><h3>Job Description</h3><div><p>Why choose VisualCV?</p><p>Since launching in 2014, VisualCV has helped over 2 million people make a career move. We are a platform for individuals to create and manage beautiful resumes, portfolios, and personal websites.  After launching in June 2014, we have grown exponentially (both in revenue and users), and were recently named #28 on Canada's Fastest Growing Startups list by McLeans Magazine and Canadian Business. </p><p>VisualCV is the flagship product of Workstory Inc. As our second engineering hire, you will have the ability to make an impact in your first few weeks by helping people land their next job or make a career change. </p><p>We're a small team who doesn't buy into the typical tech startup hype. We are profitable, growing, and believe in a healthy balance of a great life &amp; great work. We're looking for the right person to join our tight team.  </p><p>About the role:</p><p>We are hiring a front-end developer / designer with strong grasp of javascript, front-end frameworks and UI/UX design. Strong knowledge of HTML, CSS and JS is a must and if you are familiar with Rails and React.js it’ll be an advantage. </p><p>We are a small and agile team -  you have a lot of responsibility to create products used by hundreds of thousands of people and see immediate impact from your work. We iterate fast and aim to push out product improvements every week. </p><p>Key Responsibilities:<br>- Improving our web and mobile experiences <br>- Product design and UX testing<br>- Designing and implementing new features</p><p>Skills:<br>- React.JS<br>- Photoshop, Illustrator, Indesign, Sketch<br>-  HTML, CSS<br>- Javascript </p><p>We focus on results, not hours. We are by in large a distributed team and while we are based in Vancouver we offer optional remote work. </p><p>To apply, send us your portfolio or resume. Better yet, try out visualcv.com and send us some feedback.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 4, 2017 10:24:58 PM",
    "tags": [
      "AWS",
      "CSS",
      "Frontend Developer",
      "Full Time",
      "HTML",
      "MySQL",
      "PostgreSQL",
      "REMOTE1/50",
      "React.js",
      "Remote OK",
      "Ruby on Rails",
      "Sketch",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown",
      "Vancouver"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "nsQisDCjRnC_H3tyfgp4Ww",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/gamiker/jobs/77471-lead-ui-ux-designer-artist",
    "title": "Lead UI/UX Designer/Artist",
    "content": "<div><h2>Lead UI/UX Designer/Artist at Gamiker</h2><div>Los Angeles, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Graphic Design, User Experience Design, Art Direction, 3D Modeling / Animation, UI/UX Design, Illustration, Unity3D, Animation</div><div>Compensation</div><div>$60K–$70K<br>0.1%–0.25%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div>No description available.</div>",
    "urlFetchPending": false,
    "published": "Dec 1, 2017 10:19:30 PM",
    "tags": [
      "3D Modeling / Animation",
      "Animation",
      "Art Direction",
      "Designer",
      "Full Time",
      "Graphic Design",
      "Illustration",
      "Los Angeles",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/gamedev",
      "TITLE1/designer",
      "TZ/unknown",
      "UI/UX Design",
      "Unity3D",
      "User Experience Design"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "gamedev"
    ]
  },
  {
    "id": "GmhGheVJSKiqSlzI-RvV6A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/direct-create/jobs/126387-cross-platform-ux-ui-developer",
    "title": "Cross Platform UX/Ui Developer",
    "content": "<div><h2>Cross Platform UX/Ui Developer at Direct Create</h2><div>Gurgaon, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Mobile Application Design, iOS Development, Social Media Marketing, Adobe Photoshop, Adobe Illustrator, Cross-Platform Development, Android Design, Cross-Browser Compatibility, Bootstrap, Sketch</div><div>Compensation</div><div>₹300K–₹700K<br>0.05%–0.25%</div></div><h3>Job Description</h3><div><p>We are building a hybrid Community Marketplace , seeking design led UX/UI developer with mobile first approach, Its a challenging assignment to develop a 60% Icon based UI and Multilingual platform. We are bootstrapped but with growing traction on ground and rapidly evolving [... in short a great place to be! ]</p></div>",
    "urlFetchPending": false,
    "published": "Dec 1, 2017 8:30:59 PM",
    "tags": [
      "Adobe Illustrator",
      "Adobe Photoshop",
      "Android Design",
      "Bootstrap",
      "Cross-Browser Compatibility",
      "Cross-Platform Development",
      "Frontend Developer",
      "Full Time",
      "Gurgaon",
      "Mobile Application Design",
      "REMOTE1/100",
      "Remote OK",
      "Sketch",
      "Social Media Marketing",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown",
      "iOS Development"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "mVX2pIoFQD-AVU4qmsRlhA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/spiceblue/jobs/89428-ux-ui-designer",
    "title": "UX / UI DESIGNER",
    "content": "<div><h2>UX / UI DESIGNER at Spiceblue</h2><div>Chennai, Remote · Full Time</div></div><div><div>Skills</div><div>Javascript, HTML5 &amp; CSS3</div><div>Compensation</div><div>₹120K–₹300K<br>No Equity</div></div><h3>Job Description</h3><div><p>* Minimum 3 years experience in user interface and user experience design.<br>* Mastery of Adobe Photoshop, Illustrator, HTML, CSS &amp; Javascript.<br>* Solid understanding of usability and limitations for both web and mobile.<br>* Recent experience in designing mobile apps.<br>* Proficient on all stages of the design process, from concepts to implementation.<br>* Obsessive about beautiful design, details and strong usability.<br>* Be a good team player, accept feedback and collaborate well with others.<br>* Be self-directed, self-motivated, organized and disciplined.<br>* Be able to multi-task and meet deadlines in a fast paced environment.<br>* Have an online portfolio that shows at least 3 completed projects.</p></div>",
    "urlFetchPending": false,
    "published": "Nov 30, 2017 10:26:31 PM",
    "tags": [
      "Chennai",
      "Designer",
      "Full Time",
      "HTML5 & CSS3",
      "Javascript",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "CHosJxEaTNuVLMOrG6NdPQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/biz-privy/jobs/132592-graphic-designer-content-creator",
    "title": "Graphic Designer/ Content Creator",
    "content": "<div><h2>Graphic Designer/ Content Creator at Biz Privy</h2><div>New York City, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Graphic Design, Online Marketing and Copywriting, Content Marketing, Adobe Photoshop, Adobe Illustrator</div><div>Compensation</div><div>$10K–$60K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div>No description available.</div>",
    "urlFetchPending": false,
    "published": "Nov 29, 2017 10:16:10 PM",
    "tags": [
      "Adobe Illustrator",
      "Adobe Photoshop",
      "Content Marketing",
      "Full Time",
      "Graphic Design",
      "New York City",
      "Online Marketing and Copywriting",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown",
      "Visual Designer"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "dBWe-4xDSFWqZXTb_qD00Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/remote-jobs/surveymonkey-senior-ux-product-designer-business-solutions",
    "title": "SurveyMonkey: Senior UX/Product Designer – Business Solutions",
    "content": "<div>  <div>    <h2>Senior UX/Product Designer – Business Solutions</h2>      <h4>Posted Jan 29</h4>    <h3>      <span>SurveyMonkey</span><br>      <span>Headquarters: Remote, San Mateo</span><br>        <a href='https://www.surveymonkey.com/mp/jobs/' rel='nofollow'>https://www.surveymonkey.com/mp/jobs/</a>    </h3>  </div>    </div>  <div>    <div><span><strong>About SurveyMonkey</strong></span></div><div><br></div><div></div><div>SurveyMonkey is the world's leading provider of web-based survey solutions, and we’re looking to transform the way people make decisions. We're a smart, passionate group of people who work hard to deliver the best survey experiences on the planet, period. We believe everyone deserves easy access to the information and insights they need to make great decisions.</div><div><br></div><div></div><div>We're also proud to admit that despite our incredible growth over the past 17 years, we refuse to grow up. We stay curious. We believe in good ol’ roll-up-your-sleeves scrappiness. Everyone plays an impactful role, because we’re here to make a difference. And when we say good ideas can come from anyone, we mean it.</div><div><br></div><div></div><div>SurveyMonkey is trusted by millions of customers, including 99% of the Fortune 500, as well as other businesses, academic institutions and organizations of all shapes and sizes. We collect over 3 million survey responses daily from people in all countries around the world.</div><div><br></div><div></div><div><span><strong>About SurveyMonkey Business Solutions</strong></span></div><div><br></div><div></div><div>SurveyMonkey is the world’s most popular survey platform. While it is a great general-purpose tool used by millions, there is ample opportunity for more specialized solutions. That’s where we come in. We build standalone, targeted SaaS products that bring great UX to solving more specific business problems.</div><div><br></div><div></div><div>To date, our 10-person team has shipped three products:</div><div><br></div><div></div><ul><li><a href='https://cx.surveymonkey.com/' rel='nofollow'>SurveyMonkey CX</a> - Measure and improve customer satisfaction</li><li><a href='https://engage.surveymonkey.com/' rel='nofollow'>SurveyMonkey Engage</a> - Understand and foster employee engagement </li><li><a href='https://www.techvalidate.com/' rel='nofollow'>TechValidate</a> - Source and publish 3rd-party verified customer proof</li></ul><div></div><div>We operate each solution as a small startup within the larger SurveyMonkey organization. This affords us flexibility to quickly try new ideas, but with the resources of larger company. Our goal -- and our track record -- is to build high growth, profitable businesses that leverage the enormous user base of SurveyMonkey.</div><div><br></div><div></div><div><span><strong>Who We’re Looking For</strong></span></div><div><br></div><div></div><div>We’re looking for a talented designer with demonstrable experience working on user-friendly SaaS applications. Your portfolio should demonstrate the ability to design for all screen sizes from mobile to desktop. You should also be comfortable writing clear, concise UI copy.</div><div><br></div><div></div><div>Strong visual design, product design, usability, and communication skills are essential. Technical skills such as CSS, Javascript, and familiarity with Ruby on Rails are also a strong plus, though not required. Experience mentoring and/or managing junior designers would also be a big plus. </div><div><br></div><div></div><div>If you like working closely with developers and other designers and love designing data-rich visualizations, we should talk. If you think of yourself as a product designer as much as a UX designer, we should definitely talk. If you have some Tufte books on your shelf and are the kind of person others look to to tease out subtle edge cases in an interface, we should <em>absolutely</em> talk.</div><div><br></div><div></div><div><span><strong>Why Work Here?</strong></span></div><div><br></div><div></div><div>We are a remote team. As long as your work day overlaps the Pacific timezone by at least four hours, where you live and work and up to you. We’re not strangers though -- in addition to a sane amount of video calls, we meet up quarterly to get to know each other better and have some fun. In the past year, we've been bowling in Phoenix, made sushi in San Francisco, and toured a brewery.</div><div><br></div><div></div><div>We are strong believers in work-life balance. We know world class work can be done in just forty hours a week when distractions are minimized and the pace is sustainable. As such, you will be expected to be a manager of one.</div><div><br></div><div></div><div>Naturally, we offer competitive salaries and annual bonuses, medical/dental benefits, generous PTO, 401k, paid holidays, and meaningful equity compensation. We also supply you with top of the line equipment for your home office.</div><div><br></div><div></div><div>Finally, in a world of clunky “enterprise” software, we consider great UX and visual design to be a strategic advantage, and we need you to help us keep improving. Our track record gives our team a lot of autonomy -- this is your chance to rethink how “business solutions” should look and function, and to have fun while doing it.</div><div><br></div><div></div><div><span><strong>The Team</strong></span></div><div><br></div><div></div><div>Our ten person team is responsible for building products from soup to nuts. We often wear many hats and work across both the technical stack and departments. You’ll have the opportunity to work with people who have successfully launched (and sold) products. </div><div><br></div><div></div><div>Most of us choose to focus on one solution at a time. We feel this allows us to fully embrace and understand our customer needs and develop a deep technical understanding of the problem domain. However, we are also committed to sharing our work - not just with each other, but via open source contributions to our code library, Pano.</div><div><br></div><div></div><div>Outside of work, we are well-rounded people with diverse interests from winemaking to music to sculpture. Several of us have kids (and we actually get to see them). </div><div><br></div><div></div><div>Join us.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='http://grnh.se/jd1fyr1' rel='nofollow'>http://grnh.se/jd1fyr1</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 28, 2017 11:43:59 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/ruby",
      "TITLE1/designer",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "100% remote",
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "ruby"
    ]
  },
  {
    "id": "bes2qOnkTmy49ZfRRrO6qQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/spiceblue/jobs/57903-graphic-designer",
    "title": "Graphic Designer",
    "content": "<div><h2>Graphic Designer at Spiceblue</h2><div>Chennai, Remote · Full Time</div></div><div><div>Skills</div><div>Adobe Photoshop, Adobe Illustrator, HTML/CSS/PHP/MYSQL, Photoshop, Illustrator, Flash, Maya, Max, Illustration</div><div>Compensation</div><div>₹120K–₹300K<br>No Equity</div></div><h3>Job Description</h3><div>No description available.</div>",
    "urlFetchPending": false,
    "published": "Nov 24, 2017 1:14:23 PM",
    "tags": [
      "Adobe Illustrator",
      "Adobe Photoshop",
      "Chennai",
      "Designer",
      "Full Time",
      "HTML/CSS/PHP/MYSQL",
      "Photoshop, Illustrator, Flash, Maya, Max, Illustration",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/frontend",
      "TITLE1/designer",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "Bc2F1FIoTH-HcHDtfZTiWg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/cartoonmango/jobs/113204-ux-designer",
    "title": "UX Designer",
    "content": "<div><h2>UX Designer at Cartoon Mango </h2><div>Bengaluru, Remote · Full Time</div></div><div><div>Skills</div><div>User Experience Design</div><div>Compensation</div><div>₹300K–₹800K<br>No Equity</div></div><h3>Job Description</h3><div><p>Experience : 1+ Years</p><p>Qualification : Should have certification/degree/diploma in Interaction design, User Experience Design, New media design, Communication Design or related design field·<br>Software Skills : Adept in the usage of Sketch, Illustrator, Photoshop or any other tool required to ship out wireframes, high fidelity mockups and User-centered design prototyping.<br>Portfolio to accompany resume </p><p>We are looking an an experience focused designer with the following qualities <br>Strong conceptual, creative and visual skills with the ability to explain design rationale <br>Skilled in User research, Collaborating on user experience planning with consumer focus groups and making understanding user flows<br>Exceptional production value and attention to detail for user experience and Designs <br>Empathy for products, applications and consumers/end users.<br>Overall responsibility for understanding the brief and converting that into appealing, highly usable user-centric design interfaces, task flows, screen designs and interaction models. <br>Develops understanding of the end users of the application through secondary and primary research (user interviews, research data) and thus capable of low fidelity prototypes. Presents high fidelity designs/mock-ups. <br>Prior UXD experience for Mobile and Web applications <br>Ability to collaborate with the development and UI team to evolve design<br>Understanding of web and mobile applications design patterns <br>Executing interaction design and contributing to  visual design as a part of a multi-disciplinary team <br>Flexible, versatile and able to lead and handle multiple projects and be able to take end to end responsibility for projects including interacting with the clients<br>Self driven and passionate about everything new happening in the design field globally, technology trends</p></div>",
    "urlFetchPending": false,
    "published": "Nov 23, 2017 10:22:51 PM",
    "tags": [
      "Bengaluru",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/designer",
      "TZ/unknown",
      "UI/UX Designer",
      "User Experience Design"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  }
]
}
