{
 "items": [
  {
    "id": "qhTiUNriQsGgVKfCqLDEjA",
    "url": "https://jobmote.com/job/91939/release-coordinator-remote/",
    "title": "Release Coordinator (Remote)",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG:surround``can 2W remot",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "DIVERSANT, LLC.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 17, 2019 10:08:12 PM",
    "validThrough": "Oct 20, 2019 10:08:12 PM",
    "crawled": "Oct 18, 2019 3:06:32 AM",
    "content": "<div><p>Diversant is looking for an experienced <strong>Release Coordinator</strong> to work with our Client in the Financial Services arena. This is a <strong>24-month contract and consultant can sit REMOTE</strong> (must be located in AZ as consultant may need to go into office from time-to-time). Qualified candidates are encouraged to apply immediately.<br><br>The Release Coordinator will expedite the planning and coordination of all phases and activities involved in the release of enterprise patches into the production environment. This role facilitates release meetings and develops the release recommendation and release deployment plan based on input from multiple stakeholders within various portfolio teams.Job Duties:</p> <ul><li>Consultant is comprehensively involved with coordinating and deployment of events, following enterprise application team to deploy code</li> <li>Duties include some hosting changes, automated deployments (mostly automated deployment), and some DNS rolls</li> <li>Ensures that issues and risks are identified, understood, and dealt with in a manner that mitigates risk to scope and schedule.</li> <li>Defines and documents the release recommendation for each release and/or change to production. Includes release scope, schedule, deliverables, and roll back plan. Review release recommendation with key stakeholders.</li> <li>Oversee release decisions and processes in terms of the big picture/cross-departmental impacts.</li> <li>Maintains release management schedule for specific (or assigned) system(s)</li> <li>Documents and communicates all changes for a release in release notes which are published to both the internal team and the client</li> <li>Identify priorities, conflicts, dependencies, and risks for the release.</li> <li>Ensure that plans are in place to mitigate risks.</li> <li>24/7 org (Will require some weekend work, no evenings)</li></ul><p> <strong>Nice to Have</strong>:</p> <ul><li>PAC2000</li> <li>AnthillPro</li> <li>Udeploy</li> <li>F5</li> <li>Wave deployment</li> <li>DMAN</li> <li>DNS rolls</li></ul><p>PLEASE APPLY ONLINE TODAY, OR FOR QUESTIONS OR CONSIDERATION, CONTACT DENNIS AT: </p> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "_7vipNe6RAmIi3e17sb5Tw",
    "url": "https://jobmote.com/job/90433/implementation-consultant-remote/",
    "title": "Implementation Consultant - REMOTE",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Allegis Global Solutions",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 14, 2019 10:08:18 PM",
    "validThrough": "Oct 17, 2019 10:08:18 PM",
    "crawled": "Oct 15, 2019 3:06:38 AM",
    "content": "<div><b>Company Description</b><br> Allegis Global Solutions is founded on a culture that is passionate about transforming the way the world acquires talent by delivering client-focused solutions that make a difference for businesses worldwide. From refining how you manage your contingent workforce to strengthening your employer brand to recruit top talent, our integrated talent solutions drive the business results you need.?<br> As an industry leader, we draw upon decades of experience to design innovative tools, products and processes. We develop competitive practices that position organizations for growth and we deliver the insight needed to succeed in today?s global marketplace.<br><br><b>Job Description</b><br> Implementation Consultants are business specialists and technology generalists. They are responsible for aligning technology solutions with business strategies and specific client needs. Those occupying this position partner with the functional groups within the Implementation organization to communicate and clarify business needs, lead the development of system plans/process flows, and ensure products and services are aligned with client needs. They conduct business process analysis, needs assessments, benefit measurements, and communicate trends and requirements to and from customers and management.<br>?<br><b>Responsibilities</b><ul><li>Provide strategic consultancy support to assigned customers in defining or designing business processes and researching and identifying enabling technologies based on customer requirements</li><li>Actively seek ways to apply technology to business processes, researching and providing information on technical trends and best practices relevant to the assigned client business</li><li>Assess near-term needs utilizing structured interview processes to establish business priorities; consult with technical subject matter experts and develop alternative technical solutions; advise on options, risks, costs versus benefits, and impact on other business processes and system priorities</li><li>Coordinate multi-system solutions to clarify interdependencies, so that systems appear seamless to customers</li><li>Ally with other functional areas to remain apprised of project status, and inform customer management of progress; conversely, keep management and technology partners aware of user issues and potential risks.</li><li>Proactively identifying opportunities to apply technologies and best practice processes to the client organization.</li><li>Inform and advise clients on the technologies? functionality, costs, benefits, and implementation requirements, and they provide services such as priority-setting facilitation.</li><li>Develop and maintain credibility and effective working relations with both customers and management in a way that demonstrates an understanding of business problems, as well as implementation strategies, issues, and priorities</li><li>Apply technology to improving business processes within strategic system goals</li></ul><b>Qualifications</b><ul><li>A degree in Business or equivalent work experience preferred</li><li>IT experience in business systems analysis, preferably across multiple hardware and software platforms</li><li>Business unit experience that includes working closely with IT in the development and implementation of systems</li><li>Previous experience in business process re-engineering or process improvement is desirable, involving broad-based information systems and utilizing tools and techniques to effect business change</li><li>Demonstrated competency in strategic thinking with strong abilities in relationship management</li><li>Experience in management of resources to meet goals and multiple projects<br>Participation on multidiscipline, high-performance work teams/groups, preferably in a leadership capacity ? demonstrated competency in developing efficient and effective solutions to diverse and complex business problems</li><li>Demonstrated competency in project management and execution</li><li>Knowledge of the company?s business practices and direction</li></ul><b>Additional Information</b><br> As a workplace, we focus on relationships ? with each other, our clients and our candidates - in fact serving others is one of our core values. We support open communication and recognize that giving constructive criticism can be even harder than receiving it. We appreciate the fearless and the passionate, who force us to be better. Everything we do sits on a pillar of diversity - diverse perspectives, backgrounds and ideas drive innovation and make us successful.<br> See what it?s like to work at AGS by searching #LifeAtAGS on any social network.<br> AGS is an Equal Opportunity/Affirmative Action Employer (M/F/Disability/Veterans). We will consider all applications without regard to race, gender, sexual orientation, gender identity, age, color, religion, national origin, veteran status, disability, genetic information or any other status protected by applicable law.<br> If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to disability, please call <br></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "_Hn8-ZbhSaqe9NCirfEkXw",
    "url": "https://stackoverflow.com/jobs/302257/workday-integration-developer-eteki-inc?a=1DmN8WOGmb6M&so_medium=Talent&so_source=TalentApi",
    "title": "Workday Integration Developer at eTeki, Inc.  ",
    "tags": [
      "DBG:surround``OR(no,no W central) W offic",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "eTeki, Inc.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 14, 2019 11:30:35 PM",
    "validThrough": "Oct 21, 2019 11:30:35 PM",
    "crawled": "Oct 14, 2019 11:30:35 PM",
    "content": "<h3><span>Workday Integration Developer</span>                </h3>                    <h4>About this job</h4>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Contract</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior, Lead, Manager</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Database Administrator</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Assessment, Human Resources, Technology Staffing</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>51–200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: eTeki, Inc. | No office location<br></div><h4>Technologies</h4><div></div><div>workday</div><div>xslt</div><div>xpath</div><div>integration</div><div>cloud</div>                <h4>Job description</h4>                <div><p>At eTeki, top freelance&nbsp;&quot;Workday Integration Developer&quot; professionals assess peers being considered for similar technical roles with the respect and courtesy of a face-to-face conversation. Your feedback helps recruiters and hiring managers focus their resources on the most qualified professionals in the hiring process.&nbsp;</p><p>With your proficiency in<strong>&nbsp;developing complex database solutions</strong>, you can make a difference to our clients across the globe. You’ll confirm interest on a per job basis and availability on a per candidate basis by using our platform and the support of a world-class team of product specialists. If you enjoy talking about technology and a desire to raise hiring standards for your profession (while making extra money), eTeki’s the right side-gig for you.&nbsp;</p><p>• At least 5 years of experience developing integrations on the Workday Platform (EIBs, Core Connectors and Studio)</p><p>• Strong Financial Workday background</p><p>• Worked on large scale Workday implementations</p><p>• Able to facilitate and lead design sessions with the business</p><p>• Capable of capturing business requirements and translating requirements into a Workday solution</p><p>• Expert in XSLT and XPath</p><p>• Experience integrating Workday with an enterprise middleware</p><p>eTeki, a technical interviews-as-a-service platform, helps every organization, big or small, hire top notch technical talent by matching technical interview experts with clients who need third-party screening expertise. More information online at&nbsp;<a href='http://www.eteki.com/it-freelancing' rel='nofollow'>www.eteki.com/it-freelancing</a>&nbsp;</p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/302257?reset=False&amp;ra=1DmN8WOGmb6M&amp;oqs=a%3D1DmN8WOGmb6M%26so_medium%3DTalent%26so_source%3DTalentApi' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h4>About eTeki, Inc.</h4>            <div><p>At eTeki, we help hiring teams pre-screen technical talent with human-led technical interviewing.</p><p>Here how it works :</p><ul><li>Create Your Interviewer Profile</li><li>Interviews In Your Inbox</li><li>Conduct Live Interviews and Tell Us What You Think</li><li>Get Paid</li></ul>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Flexible Hours - You own your schedule</span>                            </li>                            <li>                                <span></span>                                <span>Work from any location</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "cLJSvpLhQIaLSoRGacda7A",
    "url": "http://workinstartups.com/job-board/job/84962/implementation-manager-at-disperseio/",
    "title": "Implementation Manager",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=18, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/integration",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Disperse.io",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "GBP",
      "minValue": 52000,
      "maxValue": 60000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "GBP 52k - 60k /Year"
    },
    "employmentType": "UNSET",
    "published": "Sep 29, 2019 10:50:50 AM",
    "validThrough": "Oct 6, 2019 10:50:50 AM",
    "crawled": "Oct 14, 2019 8:30:46 PM",
    "content": "<section class=&quot;section section--text&quot;><br /><h3>ABOUT US</h3><br /><p>Disperse is a VC-backed artificial intelligence construction startup focused on improving on-site productivity with the help of computer vision. Our goal is to ultimately re-imagine the way building projects are planned, delivered and operated.</p><br /><p>We're currently working on some of the largest building projects in London (e.g. Renzo Piano&rsquo;s Shard Place, Wood Wharf) and have grown from 5 to 35 people over the past year. We have ambitions to expand significantly, which means that we are looking for passionate and enthusiastic talent to join the team.</p><br /><p>We move at a high speed, and will provide you with immense opportunities for initiative, creativity and leadership.&nbsp;<a class=&quot;external&quot; href='https://workable.com/nr?l=http%3A%2F%2Fwww.disperse.io%2Fteam%2F' rel='nofollow noreferrer noopener'>Our proudly diverse, international team is based in London, Sarajevo and Yereva</a><a class=&quot;external&quot; href='https://workable.com/nr?l=http%3A%2F%2Fwww.disperse.io%2Fteam%2F' rel='nofollow noreferrer noopener'>n</a>, and has a wealth of experience from construction management to computer vision and robotics.</p><br /><h3>ROLE DESCRIPTION</h3><br /><p>We are looking for an experienced Implementation Manager to drive the deployment of our solution with our customers, where the ideal candidate helps implement best practices and new methodologies and successfully drives the overall delivery excellence and customer success for our projects. You will be responsible for driving the delivery across our clients while working closely with cross-functional teams (including technical experts) to deliver defined outputs to time and quality criteria.</p><br /><p>As part of this role, you will:</p><br /><ul><br /><li>Drive the delivery and customer success across our customers</li><br /><li>Develop customer relationships that promote customer engagement and satisfaction</li><br /><li>Track and manage delivery output and performance against key KPIs (quality, time)</li><br /><li>Work closely with cross-functional teams to deliver outcomes in a highly-matrixed environment</li><br /><li>Ensure that our customers have the best Disperse experience possible, leading implementation sessions, organise training sessions, and drive the fast resolution of issues and inquiries</li><br /><li>Develop and implement best practices, new methodologies and process steps to drive overall delivery excellence</li><br /></ul><br /></section><br /><section class=&quot;section section--text&quot;><br /><h2 class=&quot;section__header&quot;>REQUIREMENTS</h2><br /><p>You should apply if:</p><br /><ul><br /><li>You have 3-5+ years of experience from consulting, project management, or related field (bonus points for engineering or manufacturing background)</li><br /><li>You have strong experience of working with cross-functional teams with a formalized methodology</li><br /><li>You have strong experience in managing issues, scope and quality</li><br /><li>You have excellent communication skills with strong customer-orientation</li><br /><li>You love to get involved in all areas of the business and get hands-on in day-to-day activities</li><br /><li>You are an avid team player and work to make everyone around you better</li><br /><li>You are proactive and hands-on, and relish taking on new challenges</li><br /></ul><br /></section><br /><section class=&quot;section section--text&quot;><br /><h2 class=&quot;section__header&quot;>BENEFITS</h2><br /><ul><br /><li>Pro rata salary of &pound;52,000 - &pound;60,000 per annum (depending on experience level)</li><br /><li>Friendly, open and transparent culture.</li><br /><li>You'll get to join a passionate startup with proven traction on its scaling journey.</li><br /><li>Flexible working hours / ability to work from home.</li><br /><li>Regular mentoring and feedback.</li><br /><li>Awesome startup office in&nbsp;<a class=&quot;external&quot; href='https://workable.com/nr?l=https%3A%2F%2Fwww.theofficegroup.co.uk%2Foffice%2F2-stephen-street%2F' rel='nofollow noreferrer noopener'>Central London, Fitzrovia</a>.</li><br /><li>25 days&rsquo; holiday plus all bank holidays.</li><br /><li>Free coffee.</li><br /><li>Regular socials, and team retreats to amazing destinations (Tbilisi, Sarajevo... Where next?)</li><br /></ul><br /></section>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "vcO0Px07QsG8e5GD36B6QA",
    "url": "https://jobmote.com/job/89243/senior-implementation-consultant-remote/",
    "title": "Senior Implementation Consultant - Remote",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Nigel Frank International US",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 13, 2019 10:08:25 PM",
    "validThrough": "Oct 16, 2019 10:08:25 PM",
    "crawled": "Oct 14, 2019 3:06:35 AM",
    "content": "<div><b> Senior Implementation Consultant-Remote </b><br> An experienced accounting and advisory firm is looking to hire a Senior Implementation Consultant experienced in Dynamics NAV. This position is fully remote and they are looking to bring in a skilled consultant to start making an immediate impact on projects.<br><b>The Company</b><br> This growing partner's core technology services are focused around clients technology needs for their businesses including cybersecurity, system infrastructure, technical support, IT remediation services and business software. This role is perfect for someone wanting to continue developing their own skills while offering exceptional customer service to fulfill customer needs. <br><b>The Role</b><br> Design, build, and launch new data models in production in a remote, entrepreneurial experience. You will be responsible for understanding the client, user, and system requirements and identify specific enhancement modules if necessary.<br><b>Responsibilities</b><ul><li>Keeping up with client demand</li><li>Proactively improve the solution and service</li><li>Analyze client's business process and recommend ways to improve or re-engineer for optimum performance</li></ul><b>Qualifications</b><ul><li>Senior level experience in Dynamics NAV, preferably with a partner</li><li>Experience with Business Central</li><li>CPA certification preferred</li><li>Working knowledge of accounting and finance</li><li>Fully remote role</li><li>SharePoint, Power BI experience a plus</li><li>Helpdesk, project work, new installs, implementation, customization</li></ul><b>Benefits</b><ul><li>Health/Dental/Vision/Prescription Plans</li><li>Matching 401(k) program</li><li>Bonus opportunities</li><li>Firm wide and office community events</li><li>Volunteer for Vacation program</li></ul> To apply, please contact Sedona Cottrell at [Click Here to Email Your Resum?] or call <br><br>*Senior level experience in Dynamics NAV, preferably with a partner<br>?Experience with Business Central<br>?CPA certification preferred<br>?Working knowledge of accounting and finance <br>?Fully remote role<br>?SharePoint, Power BI experience a plus<br>?Helpdesk, project work, new installs, implementation, customization</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "6nbOedAlTP2CH6CXb-_xoQ",
    "url": "https://jobmote.com/job/88090/senior-office-implementation-engineer-remote-options-available/",
    "title": "Senior Office Implementation Engineer (Remote options available!)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:sql-server/dotnet/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=1, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Full Stack Talent, LLC",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 11, 2019 10:07:56 PM",
    "validThrough": "Oct 14, 2019 10:07:56 PM",
    "crawled": "Oct 12, 2019 3:06:35 AM",
    "content": "<div>Full Stack Talent is hiring a Senior Office 365 Migration Engineer in the Clearwater area! <p> </p> Requirements3+ years: <ul><li>Performing multiple Office 365 enterprise migrations</li> <li>Strong Active Directory experience</li> <li>Good client coordination/communication skills. Not a project management role, but will be a point of contact regarding technical expertise</li></ul>Are a plus: <ul><li>SQL Server </li> <li>Azure AD</li> <li>Exchange Server</li> <li>SCCM</li> <li>Holding a security clearance</li></ul>  Education &amp; Certifications: (are preferred but not required) <ul><li>Bachelors in IT or other similar discipline</li> <li>MCSE / MCSA Certification</li></ul>  <p> </p> Benefits<ul><li>Competitive salary, personal performance bonus, and company performance bonus package </li> <li>Great health, dental, vision, life, and disability insurance offerings</li> <li>401k or Roth IRA with an impressive employer match %</li> <li>Partial remote and full remote (for out of Tampa Bay area) options available</li> <li>Huge room for growth</li> <li>Exciting work with a great team</li></ul>Travel: <ul><li>30-35%</li> <li>Typically only a couple of days at a time</li> <li>Large majority of travel is domestic but occasionally will involve international</li></ul> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "TlTT8bM0Ql2Bqo7dIs1idw",
    "url": "https://remote.co/job/release-manager-2/",
    "title": "Release Manager",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "GovernmentCIO",
      "sameAs": "https://www.governmentcio.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 11, 2019 5:34:10 PM",
    "validThrough": "Oct 18, 2019 5:34:10 PM",
    "crawled": "Oct 11, 2019 6:24:22 PM",
    "content": "<h3>Release Manager at <span>GovernmentCIO</span></h3><div><span><i></i> Remote</span>        </div><div>            <p><strong>Job Locations US-Remote</strong></p><p><strong>Job ID</strong> 2019-2169</p><p><strong># of Openings</strong> 1</p><p><strong>Category</strong> Information Technology</p><p><strong>Overview</strong></p><p><strong>GovernmentCIO is currently looking for a Release Manager to join our team supporting Enterprise Services PMO Data Access Services (DAS) Project. The candidate should have experience with the Veteran-Focused Integration Process (VIP) at the Veterans Affairs, a thorough understanding of the Software Development Lifecycle (SDLC) and software development using agile methodologies (Scrum, SAFe, DevOps) within large organizations. The candidate will also provide technical management, and consulting support functions within a fast-paced environment including Project Management Office (PMO) tasks. The candidate needs to be able to effectively collaborate with diverse teams and cross functional stakeholders in geographically disparate areas.</strong></p><p><strong>Responsibilities</strong></p><p>Responsible for managing all aspects of the software release process for five release trains. This includes coordinating with VA and contractor personnel (Service Line Managers) for implementing and managing release processes for code through development, test, and production environments. Must create, track, and maintain all documents related to the release process to ensure all the VA requirements for software releases are met. Assists with the documenting the project in Rational Tool Suite and assists the PM with other aspects of the project documentation as needed.</p><ul><li>Knowledge of agile development programs</li><li>Ability to work effectively with Government client in VA environment, preferable DAS.</li><li>Candidate should have experience with Requirements and SQA Testing in accordance with the SDLC lifecycle</li><li>Ability to mitigate conflicting requirements between organizations.</li><li>Support and follow the DAS Release process, pre-implementation activities, and provide all required VIP release documentation</li><li>Strong analytical, abstraction, and problem-solving skills.</li><li>Strong organizational skills with the ability to handle several tasks with various due dates.</li><li>Able to identify and engage the appropriate stakeholders to ensure tasks and activities are completed on schedule.</li><li>Experience with the VA software release process and DAS software releases, providing full traceability from requirements elaboration, development, testing, through final release review</li><li>Coordinate with the PMO, Quality Assurance, development teams, SLMs, Security analyst and other VA stakeholders</li><li>Facilitate and assist in Integrated Release Management meetings, and other supporting meetings (critical decisions, release preparation, etc.)</li><li>Provide data for populating and updating the calendaring process for each release and deployment</li><li>Prepare build for national release by following DAS SOP’s, including support of VIP Critical Decision 2 activities such as the Release Readiness Review</li><li>Provide release retrospectives to the client concerning the status of the team’s performance during the release process.</li><li>Consult in the coordination and validation of Memorandums of Understanding (MOUs) and Service Level Agreements (SLAs) for dependencies that highlight the commitment of partners to associated release</li><li>Design, apply and maintain pre-deployment checklists as necessary to assure that all DAS IT PMO activities are completed and all coordination dependencies with business deployment and training activities are completed on schedule</li><li>Provide weekly deployment reports that summarize all implementation activity, with emphasis on those activities that are falling behind schedule</li><li>Experience with Rational Tool Suite, Microsoft Office Suite, Jira</li></ul><p><strong>Qualifications</strong></p><ul><li>A bachelor’s degree with 10+ years of relevant experience.</li></ul><p><strong>Preferred:</strong></p><ul><li>VA experience preferred</li><li>Requirements experience preferred</li><li>SQA/Testing experience preferred</li><li>Ability to read and understand test scripts, test cases and test execution records and compare to requirements acceptance criteria for completeness</li></ul>        </div><div>        <a href='https://careers-governmentcio.icims.com/jobs/2169/release-manager/job' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "lKWHZjpKTdqLe_ykDnSrtQ",
    "url": "https://weworkremotely.com/remote-jobs/ibm-cloud-implementation-specialist",
    "title": "IBM: Cloud Implementation Specialist",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:backbone.js/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/integration",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "IBM",
      "sameAs": "http://ibm.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 10, 2019 11:12:12 PM",
    "validThrough": "Oct 17, 2019 11:12:12 PM",
    "crawled": "Oct 10, 2019 11:30:31 PM",
    "content": "<h3> Cloud Implementation Specialist </h3><div><div><strong>Introduction</strong><br>IBM Global Technology Services enables the backbone of the world economy by Designing, Building, and Run-Maintaining the critical Infrastructures and Systems across its Client’s Enterprise IT environments. Together with IBM Cloud, IBM Security, IBM Storage, IBM Resiliency, IBM Watson etc., GTS delivers outcomes that are essential for our Clients’ Businesses.<br><br><strong>Your Role and Responsibilities<br></strong><strong><em>Preferred location would be Austin, TX but open to remote work anywhere in the US</em></strong><br>Implementation Specialist is an exemplary subject matter expert to design and build leading-edge solutions for IBM’s clients.<br><br>This role is crucial to implementing cutting edge Hybrid Cloud Capabilities and Solutions for clients worldwide specially using Red Hat technologies.<br><br>The role would involve working with highly skilled cloud architects in taking up challenging internal IBM projects in order to develop and execute complex solutions for IBM clients worldwide.<br><br>The success of this role would be benchmarked globally with industry peers. Excellent practice and knowledge on Cloud based automation software/Script development and tools, consummate thought leadership, constant innovation and contribution to development of industry standards would be some of the key result areas in addition to meeting business metrics for the respective areas.<br><br><br><strong>Required Technical and Professional Expertise</strong></div><ul><li>Must have at least 1-year experience in one or more of Red Hat Cloud technologies (OpenStack, Openshift, Cloud Forms, Ansible, etc.) and hands-on experience in implementing cloud solutions using these technologies. Exposure and good understanding in core tenants to be considered when designing, developing &amp; deploying to a Cloud. Confident enough to leverage Cloud Platforms.</li><li>Bachelors degree (or above) in Computer Science or related fields.</li><li>Excellent written and verbal communication skills</li></ul><div><strong>Preferred Technical and Professional Expertise</strong></div><ul><li>More than 2 years of experience in one or more of Red Hat Cloud technologies (OpenStack, Openshift, Cloud Forms, Ansible, etc.) and hands-on experience in implementing cloud solutions using these technologies. Exposure and good understanding in core tenants to be considered when designing, developing &amp; deploying to a Cloud. Confident enough to leverage Cloud Platforms.</li><li>Knowledge of other Cloud Providers e.g. IBM, AWS, Azure, Google Cloud Platform, or VMware will be preferred.</li><li>Good understanding on Software Defined Environments and Pattern Based deployments (specially Ansible).</li><li>Strong skills on one or more of the above technologies with an ability to quickly build and demonstrate Proof of Concepts and Proof of Technologies and contribute to Technology Innovation and Automation projects</li></ul><div><br><strong>About Business Unit</strong><br>At Global Technology Services (GTS), we help our clients envision the future by offering end-to-end IT and technology support services, supported by an unmatched global delivery network.&nbsp; It's a unique blend of bold new ideas and client-first thinking. If you can restlessly reinvent yourself and solve problems in new ways, work on both technology and business projects, and ask, &quot;What else is possible?&quot; GTS is the place for you!<br><br><strong>Your Life @ IBM</strong><br>What matters to you when you’re looking for your next career challenge?<br><br>Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br><br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br><br><strong>About IBM</strong><br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br><br><strong>Location Statement</strong><br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br><br><strong>Being You @ IBM</strong><br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.</div><div><strong><br>Preferred Education:<br></strong>Master's Degree<br><br></div><div><strong>Commissionable:<br></strong>No<br><br><br></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3LPq1hJ3TdyHeCsQ4iaAtQ",
    "url": "https://jobmote.com/job/83240/senior-data-and-integration-engineer-remote/",
    "title": "Senior Data and Integration Engineer (REMOTE)",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``from 4W your 2W home",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:k/t/w:sql-server/dotnet/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=1, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/integration",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Magellan Health",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 2, 2019 10:08:23 PM",
    "validThrough": "Oct 5, 2019 10:08:23 PM",
    "crawled": "Oct 3, 2019 3:06:32 AM",
    "content": "<div>This position is a REMOTE opportunity for the right individual, allowing you to telecommute from the comfort of your own home from anywhere in the US.<br><br>Looking for a skilled Data and Integration Engineer with 5+ years of hands-on experience supporting, automating, and optimizing mission critical software and deployments on-premise and in AWS, leveraging advanced engineering practices, configuration management, CI/CD, enterprise Git &amp; GitHub branch management, and DevOps processes.<br><br>PREFERRED KNOWLEDGE, EXPERIENCE AND SKILL REQUIREMENTS:<br><br>- 5+ years of programming experience. Strong working knowledge of modern programming languages, ETL tools and solid experience in writing and tuning SQL, T-SQL and/or PL/SQL functions, procedures, and triggers.<br>- Some professional experience with SQL Server Enterprise 2016, Oracle 12c, MySQL 5.7 Enterprise, PostgreSQL, AWS RDS or some other RDBMS<br>- Develop highly scalable applications in AWS cloud-native, managed services not limited to AWS EC2, Lambda, API Gateway, Aurora, CloudFormation, and CodePipeline.<br>- Willing and able to quickly learn new technologies.<br>- Ability to mentor teams. Some ETL/data movement certifications a plus.<br>- Strong problem solving and analysis skills, self-motivated, and able to work in a team environment.<br><br>This position will analyze problems and is an expert in at least two or more Data Management tools. Role will understand and develop requirements for a system (mapping documents) by working with Business and Stakeholders, including visualization. Focus on the design with emphasis on reusability, scalability, optimization and parameterization. Develop, test and maintain canonical layouts and drives standardization. Is proficient at automated testing strategies, including TDD. Integrate systems to enterprise data governance tools. Perform data and service integration. Design data as a service (DaaS). Contribute to 24x7x365 days of on-call staff coverage.<p><b>ESSENTIAL DUTIES AND RESPONSIBILITIES:</b></p><ul><li><p>Develops, test and maintains code using software development methodology and appropriate technologies for the system<br>being used.</p></li><li><p>Works closely with Business Analysts to develop detail systems design and written test plans for online and report application<br>programs.</p></li><li><p>Performs analysis on projects and provides a project plan that shows the tasks needing to be completed and a time estimate<br>for each task.</p></li><li><p>Participates in design walkthroughs with appropriate focus groups and related users to verify accuracy of design in meeting<br>business needs.</p></li><li><p>Prepares installation instructions and coordinates installation procedures.</p></li><li><p>Supports and troubleshoots application code problems.</p></li><li><p>Provides status reports that give a detailed description of the current projects progress and indicates time devoted to each<br>task of the project.</p></li><li><p>Coordinates, guides and mentors programming efforts performed by in-house programmers or outside consultants to ensure<br>that all programming is completed according to the project plan.</p></li></ul><p></p><p></p><p> General Job Information </p><p><b>Title</b></p>Sr Data and Integration Engineer (REMOTE)<p></p><p><b>Grade</b></p>26<p></p><p><b>Job Family</b></p>Info Technology Group<p></p><p><b>Country</b></p>United States of America<p></p><p><b>FLSA Status</b></p>United States of America (Exempt)<p></p><p><b>Recruiting Start Date</b></p>9/7/2019<p></p><p><b>Date Requisition Created</b></p>8/22/2019<p></p><p></p><p><b>Work Experience</b></p>IT<p></p><p><b>Education</b></p>Bachelors: Computer and Information Science<p></p><p><b>License and Certifications - Required</b></p><p></p><p><b><b>License and Certifications - Preferred</b></b></p><p></p><p></p><p> Other Job Requirements </p><p></p><p><b>Responsibilities</b></p><ul><li>Strong working knowledge of modern programming languages, ETL tools and understanding of Cloud Concepts.</li><li>Agile and Design Thinking (Coursera).</li><li>Critical thinker.</li><li>Demonstrated problem solving techniques.</li><li>Strong verbal and written communication skills.</li><li>Team player.</li><li>Willing and able to quickly learn new technology.</li><li>Ability to mentor teams.</li><li>Some ETL/data movement certifications.</li></ul><p></p><p></p><p></p><p>Magellan Health Services is proud to be an Equal Opportunity Employer and a Tobacco-free workplace. EOE/M/F/Vet/Disabled. Every employee must understand, comply and attest to the security responsibilities and security controls unique to their position.</p><br></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "xXodhp9jQ16c2i7_qZeTTA",
    "url": "https://jobmote.com/job/83238/senior-data-and-integration-engineer-remote/",
    "title": "Senior Data and Integration Engineer (REMOTE)",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``from 4W your 2W home",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:k/t/w:sql-server/dotnet/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=1, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/integration",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Magellan Health",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 2, 2019 10:08:23 PM",
    "validThrough": "Oct 5, 2019 10:08:23 PM",
    "crawled": "Oct 3, 2019 3:06:32 AM",
    "content": "<div>This position is a REMOTE opportunity for the right individual, allowing you to telecommute from the comfort of your own home from anywhere in the US.<br><br>Looking for a skilled Data and Integration Engineer with 5+ years of hands-on experience supporting, automating, and optimizing mission critical software and deployments on-premise and in AWS, leveraging advanced engineering practices, configuration management, CI/CD, enterprise Git &amp; GitHub branch management, and DevOps processes.<br><br>PREFERRED KNOWLEDGE, EXPERIENCE AND SKILL REQUIREMENTS:<br><br>- 5+ years of programming experience. Strong working knowledge of modern programming languages, ETL tools and solid experience in writing and tuning SQL, T-SQL and/or PL/SQL functions, procedures, and triggers.<br>- Some professional experience with SQL Server Enterprise 2016, Oracle 12c, MySQL 5.7 Enterprise, PostgreSQL, AWS RDS or some other RDBMS<br>- Develop highly scalable applications in AWS cloud-native, managed services not limited to AWS EC2, Lambda, API Gateway, Aurora, CloudFormation, and CodePipeline.<br>- Willing and able to quickly learn new technologies.<br>- Ability to mentor teams. Some ETL/data movement certifications a plus.<br>- Strong problem solving and analysis skills, self-motivated, and able to work in a team environment.<br><br>This position will analyze problems and is an expert in at least two or more Data Management tools. Role will understand and develop requirements for a system (mapping documents) by working with Business and Stakeholders, including visualization. Focus on the design with emphasis on reusability, scalability, optimization and parameterization. Develop, test and maintain canonical layouts and drives standardization. Is proficient at automated testing strategies, including TDD. Integrate systems to enterprise data governance tools. Perform data and service integration. Design data as a service (DaaS). Contribute to 24x7x365 days of on-call staff coverage.<p><b>ESSENTIAL DUTIES AND RESPONSIBILITIES:</b></p><ul><li><p>Develops, test and maintains code using software development methodology and appropriate technologies for the system<br>being used.</p></li><li><p>Works closely with Business Analysts to develop detail systems design and written test plans for online and report application<br>programs.</p></li><li><p>Performs analysis on projects and provides a project plan that shows the tasks needing to be completed and a time estimate<br>for each task.</p></li><li><p>Participates in design walkthroughs with appropriate focus groups and related users to verify accuracy of design in meeting<br>business needs.</p></li><li><p>Prepares installation instructions and coordinates installation procedures.</p></li><li><p>Supports and troubleshoots application code problems.</p></li><li><p>Provides status reports that give a detailed description of the current projects progress and indicates time devoted to each<br>task of the project.</p></li><li><p>Coordinates, guides and mentors programming efforts performed by in-house programmers or outside consultants to ensure<br>that all programming is completed according to the project plan.</p></li></ul><p></p><p></p><p> General Job Information </p><p><b>Title</b></p>Sr Data and Integration Engineer (REMOTE)<p></p><p><b>Grade</b></p>26<p></p><p><b>Job Family</b></p>Info Technology Group<p></p><p><b>Country</b></p>United States of America<p></p><p><b>FLSA Status</b></p>United States of America (Exempt)<p></p><p><b>Recruiting Start Date</b></p>9/7/2019<p></p><p><b>Date Requisition Created</b></p>8/22/2019<p></p><p></p><p><b>Work Experience</b></p>IT<p></p><p><b>Education</b></p>Bachelors: Computer and Information Science<p></p><p><b>License and Certifications - Required</b></p><p></p><p><b><b>License and Certifications - Preferred</b></b></p><p></p><p></p><p> Other Job Requirements </p><p></p><p><b>Responsibilities</b></p><ul><li>Strong working knowledge of modern programming languages, ETL tools and understanding of Cloud Concepts.</li><li>Agile and Design Thinking (Coursera).</li><li>Critical thinker.</li><li>Demonstrated problem solving techniques.</li><li>Strong verbal and written communication skills.</li><li>Team player.</li><li>Willing and able to quickly learn new technology.</li><li>Ability to mentor teams.</li><li>Some ETL/data movement certifications.</li></ul><p></p><p></p><p></p><p>Magellan Health Services is proud to be an Equal Opportunity Employer and a Tobacco-free workplace. EOE/M/F/Vet/Disabled. Every employee must understand, comply and attest to the security responsibilities and security controls unique to their position.</p><br></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "62GAGGv5TlmIP-A4gx0SUA",
    "url": "https://jobmote.com/job/83213/automation-engineers-needed-100-remote-us-citizens-only/",
    "title": "Automation Engineers Needed-100% Remote (US CITIZENS ONLY)",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:c/c/10",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:perl/other/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:shell/other/2",
      "DBG_TECH1:k/t/w:velocity/java/8",
      "DBG_TECH1:techWeightMap:{python=2, other=7, dotnet=0, c=10, mobile=1, go=6, nodejs=0, bigdata-ml=0, ruby=2, apple=0, java=10, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/java",
      "TECH1/other",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "java",
      "other"
    ],
    "hiringOrganization": {
      "name": "Azzur Group",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 2, 2019 10:08:22 PM",
    "validThrough": "Oct 5, 2019 10:08:22 PM",
    "crawled": "Oct 3, 2019 3:06:32 AM",
    "content": "<div><p> <strong>Term: </strong>12-Months</p> <p> <strong>Location: </strong>Remote</p> <p> <strong> </strong></p> <p> <strong>Automation Engineer </strong></p> <p> <strong> </strong></p> <p>Automation Engineering ensures that client services, both internally and externally-visible systems, have reliability and uptime appropriate to customers needs in addition to a fast rate of improvement while maintaining an ever-watchful eye on security, capacity, and performance.</p> <p> </p> <p>Automation Engineers are also creators of engineering and systems development. Much of our work focuses on optimizing existing systems, building secure cloud infrastructure, and eliminating work through automation. As Automation Engineers are responsible for the broad picture of how our various SaaS and PaaS products relate to each other, we use a breadth of tools and approaches to solve a broad spectrum of problems. Post-mortem and proactive identification of potential issues factor into iterative improvement.</p> <p> </p> <p>Automation Engineering s culture of diversity, intellectual curiosity, problem solving, and openness is key to its success. Our organization brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while also creating an environment that provides support and mentorship to learn and grow.</p> <p> </p> <p>Behind everything our customers see, the systems built by the Automation Engineering team keep it running and keep their data safe. We make clients product portfolio possible. We re always trying to keep our services up and running while also ensuring our customers have the best and safest possible experience.</p> <p> </p> <p> <strong>Responsibilities:</strong></p> <p> <strong> </strong></p> <p>Engage in and improve the complete lifecycle of services inception and design, through deployment, operation, and refinement.</p> <p>Support services before they go live through the process of developing automation, developing security frameworks, and planning continuous delivery cycles.</p> <p>Maintain services that are live by helping to measure and monitor availability, security, and overall system health.</p> <p>Scale systems sustainably through mechanisms like automation and evolve systems by pushing for changes in reliability, security, and velocity.</p> <p>Practice sustainable incident response and blameless postmortems.</p> <p> </p> <p> <strong>Minimum qualifications:</strong></p> <p> <strong> </strong></p> <p> Bachelor s degree in Computer Science or equivalent practical experience.</p> <p>Experience with one or more of the following:</p> <p> C, C ++, Java, Python, Go, Perl, Ruby or shell scripting.</p> <p> Experience with Unix / Linux operating system internals and administration (e.g., filesystems, inodes, system calls, hardening) and networking (e.g., TCP / IP, routing, DNS, network topologies, SDN).</p> <p> </p> <p> <strong>Preferred qualifications:</strong></p> <p> <strong> </strong></p> <p>Expertise in designing, analyzing and troubleshooting large-scale distributed systems.</p> <p>Ability to debug and optimize code and automate routine tasks.</p> <p>Systematic problem-solving approach coupled with strong communication skills and a sense of ownership and drive.</p> <p> <strong> </strong></p> <p> </p> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "vr3L0A4UREq_AxOobxSFsQ",
    "url": "https://jobmote.com/job/83211/sr-data-and-integration-engineer-remote/",
    "title": "Sr Data and Integration Engineer (REMOTE)",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``from 4W your 2W home",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:k/t/w:sql-server/dotnet/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=1, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/integration",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Appcast",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 2, 2019 10:08:21 PM",
    "validThrough": "Oct 5, 2019 10:08:21 PM",
    "crawled": "Oct 3, 2019 3:06:32 AM",
    "content": "<div>This position is a REMOTE opportunity for the right individual, allowing you to telecommute from the comfort of your own home from anywhere in the US.<br><br>Looking for a skilled Data and Integration Engineer with 5+ years of hands-on experience supporting, automating, and optimizing mission critical software and deployments on-premise and in AWS, leveraging advanced engineering practices, configuration management, CI/CD, enterprise Git &amp; GitHub branch management, and DevOps processes.<br><br>PREFERRED KNOWLEDGE, EXPERIENCE AND SKILL REQUIREMENTS:<br>- 5+ years of programming experience. Strong working knowledge of modern programming languages, ETL tools and solid experience in writing and tuning SQL, T-SQL and/or PL/SQL functions, procedures, and triggers.<br>- Some professional experience with SQL Server Enterprise 2016, Oracle 12c, MySQL 5.7 Enterprise, PostgreSQL, AWS RDS or some other RDBMS<br>- Develop highly scalable applications in AWS cloud-native, managed services not limited to AWS EC2, Lambda, API Gateway, Aurora, CloudFormation, and CodePipeline.<br>- Willing and able to quickly learn new technologies.<br>- Ability to mentor teams. Some ETL/data movement certifications a plus.<br>- Strong problem solving and analysis skills, self-motivated, and able to work in a team environment.<br><br>This position will analyze problems and is an expert in at least two or more Data Management tools. Role will understand and develop requirements for a system (mapping documents) by working with Business and Stakeholders, including visualization. Focus on the design with emphasis on reusability, scalability, optimization and parameterization. Develop, test and maintain canonical layouts and drives standardization. Is proficient at automated testing strategies, including TDD. Integrate systems to enterprise data governance tools. Perform data and service integration. Design data as a service (DaaS). Contribute to 24x7x365 days of on-call staff coverage.<br><b>ESSENTIAL DUTIES AND RESPONSIBILITIES:</b><ul><li>Develops, test and maintains code using software development methodology and appropriate technologies for the system<br>being used.</li><li>Works closely with Business Analysts to develop detail systems design and written test plans for online and report application<br>programs.</li><li>Performs analysis on projects and provides a project plan that shows the tasks needing to be completed and a time estimate<br>for each task.</li><li>Participates in design walkthroughs with appropriate focus groups and related users to verify accuracy of design in meeting<br>business needs.</li><li>Prepares installation instructions and coordinates installation procedures.</li><li>Supports and troubleshoots application code problems.</li><li>Provides status reports that give a detailed description of the current projects progress and indicates time devoted to each<br>task of the project.</li><li>Coordinates, guides and mentors programming efforts performed by in-house programmers or outside consultants to ensure<br>that all programming is completed according to the project plan.<br></li></ul><br><br>General Job Information <br><br><b>Title</b><br>Sr Data and Integration Engineer (REMOTE)<br><br><b>Grade</b><br>26<br><br><b>Job Family</b><br>Info Technology Group<br><br><b>Country</b><br>United States of America<br><br><b>FLSA Status</b><br>United States of America (Exempt)<br><br><b>Recruiting Start Date</b><br>9/7/2019<br><br><b>Date Requisition Created</b><br>8/22/2019<br><br><b>Work Experience</b><br>IT<br><br><b>Education</b><br>Bachelors: Computer and Information Science<br><br><b>License and Certifications - Required</b><br><br><b><b>License and Certifications - Preferred</b></b><br><br>Other Job Requirements <br><br><b>Responsibilities</b><br><ul><li>Strong working knowledge of modern programming languages, ETL tools and understanding of Cloud Concepts.</li><li>Agile and Design Thinking (Coursera).</li><li>Critical thinker.</li><li>Demonstrated problem solving techniques.</li><li>Strong verbal and written communication skills.</li><li>Team player.</li><li>Willing and able to quickly learn new technology.</li><li>Ability to mentor teams.</li><li>Some ETL/data movement certifications.</li></ul><br><br>Magellan Health Services is proud to be an Equal Opportunity Employer and a Tobacco-free workplace. EOE/M/F/Vet/Disabled. Every employee must understand, comply and attest to the security responsibilities and security controls unique to their position.<br> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "GLpxtse2QXCNrdyvfY9vJA",
    "url": "https://news.ycombinator.com/item?id=21128963",
    "title": "Mirth Connect | Healthcare Data Integration Saga Healthcare IT | Location: Remote https://www ...",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Oct 1, 2019 8:32:45 PM",
    "validThrough": "Oct 8, 2019 8:32:45 PM",
    "crawled": "Oct 1, 2019 9:31:19 PM",
    "content": "Mirth Connect | Healthcare Data Integration<p>Saga Healthcare IT | Location: Remote</p><p><a href='https://www.saga-it.com/careers' rel='nofollow'>https://www.saga-it.com/careers</a></p><p>2+ years experience with software development and processes.</p><p>Core competencies:</p><p>Strong Mirth Connect experience</p><p>HL7, XML, FHIR and other RESTful web services Nice to have:</p><p>Code Systems: RxNorm, Snomed CT, ICD HIPAA Compliance</p><p>Experience with FHIR a big plus</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "NriD6NuVR5mBxB5RPEjVdg",
    "url": "https://jobmote.com/job/82112/e-commerce-integrations-developer-remote/",
    "title": "E-Commerce Integrations Developer - Remote",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:c#/c/4",
      "DBG_TECH1:k/t/w:c#/dotnet/10",
      "DBG_TECH1:k/t/w:sql-server/dotnet/1",
      "DBG_TECH1:k/t/w:visual-studio/dotnet/16",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=35, c=4, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Stott and May",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 29, 2019 10:07:49 PM",
    "validThrough": "Oct 2, 2019 10:07:49 PM",
    "crawled": "Sep 30, 2019 3:06:29 AM",
    "content": "<div>E-Commerce integrations developer required to support the development of systems used to process the flow of orders and returns between a B2C storefront platform and the backend ERP system. The full system stack includes service applications, web services, analytical/systems reporting and database management. <br> This role requires both development experience across various platforms as well as ongoing support of the operational team, including day-to-day troubleshooting. <br> Your responsibilities will include; <br> Designing software solutions using OOP in Windows Designing corresponding data components in SQL Server C# Services in Visual Studio SQL <br> On the support side you will be happy to assist day-today functions across the support team and to help troubleshoot issues as they arise. You will also be able to create clear and concise documentation that allows proper staging, quality assurance and training on new developments. You will also track your daily activity. <br> You will have strong C#, SQL, MS Visual Studio, OOP, XML or JSON. Any experience of Mulesoft would guarantee interview. <br> This role could be remote based for the right candidate, however you would be expected to visit Colorado 2 or 3 times per year. <br> US Citizens and GC Holders are encouraged to apply. Visa transfer/sponsorship is not available for this role.</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "_JKdd1yXQkKn6vBqfxujdA",
    "url": "https://jobmote.com/job/81885/digital-build-and-release-engineer-jacksonville-remote/",
    "title": "Digital Build and Release Engineer- Jacksonville / Remote",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:windows/dotnet/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=16, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Black Knight Financial Services",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 28, 2019 10:08:07 PM",
    "validThrough": "Oct 1, 2019 10:08:07 PM",
    "crawled": "Sep 29, 2019 3:06:32 AM",
    "content": "<div><br><br><p>Black Knight is the premier provider of integrated technology, services, data and analytics that lenders and servicers look to first to help successfully manage the entire loan life cycle. Our deep understanding of regulatory and compliance issues complements the knowledge, technology and solutions we offer to help our clients achieve their business goals. Black Knight offers leading software systems; data and analytics offerings; and information solutions that facilitate and automate many of the business processes across the mortgage life cycle.<br><br><strong>JOB FAMILY DESCRIPTION</strong><br><br>The Digital Build &amp; Release Engineer implements and supports best practices and tools in version control, software development lifecycle management, build management, application distribution and deployment management, and other software configuration management practices. Assists with setting up projects in the version control tool, creating and troubleshooting distributed builds/compiles, as well as training and providing consultation to development teams on how to use supporting tools. Participates in rotational on-call support.<br><br><strong>GENERAL DUTIES &amp; RESPONSIBILITIES</strong><br><br> Shares in developing effective configuration management strategies and solutions for existing and new products.<br><br> Coordinates, facilitates, manages, controls scheduled and approved change windows for product release and infrastructure maintenance windows.<br><br> Participates in change management reviews, confirmation of changes submitted by associates outside of assigned organization to ensure minimal disruption occurs.<br><br> Works with all parties to resolve change-related scheduling conflicts according to established practices.<br><br> Assesses risks and impacts to changes throughout the software development lifecycle ensuring minimal disruption to the organization and other Black Knight and client organizations.<br><br> Ensures proper archiving of software application releases.<br><br> Analyzes the software development lifecycle for process improvements and automation opportunities.<br><br> Works with development and release management teams to ensure business requirements are defined and solutions accurately designed to meet stated business needs.<br><br> Administers and supports third party source, version control, build, and distribution tools.<br><br> Administers and maintains source code repositories stored within software configuration management tools.<br><br> Performs software integration that includes building/compiling source code and documenting software build/compile process.<br><br> Troubleshoots internal software automation tools and utilities.<br><br> Assists with testing and implementation aspects of development projects including installation, configuration, and customization of internal software and utilities.<br><br> Assists with troubleshooting interfaces to change control and defect tracking systems.<br><br> Performs application conversion, configuration, and release deployment duties.<br><br> Maintains all internal documentation.<br><br> Provides assistance and training on source code management processes, procedures and tools.<br><br> Supports internal customers by responding to help desk calls, performing night on-call activities as requested, and completing service requests related to version control, software development lifecycle management, and build management, distribution and deploy management.<br><br> Other related duties are assigned as needed.<br><br><strong>EDUCATIONAL GUIDELINES</strong><br><br> Bachelor's Degree in Computer Science or the equivalent combination of education, training, or work experiences.<br><br><strong>GENERAL KNOWLEDGE, SKILLS &amp; ABILITIES</strong><br><br> Experience with Linux systems administration required<br><br> Experience with release and configuration management tools required. Experience with Team Foundation Server (TFS), Puppet highly preferred.<br><br> Experience with AWS, OpenShift, and Kubernetes a plus.<br><br> Experience with automated deployment technologies i.e. UrbanCode highly preferred.<br><br> Experience working with Continuous Integration (CI) tools i.e. Jenkins highly preferred.<br><br> Experience in DevOps environment in a large enterprise is desired.<br><br> Considerable knowledge of change and release management principles, procedures and techniques.<br><br> Demonstrated understanding of source code management concepts and/or software development lifecycles and methodologies (Agile, Waterfall, Hybrid).<br><br> Demonstrated technical aptitude and ability to think and solve problems creatively<br><br> Proficient troubleshooting skills<br><br> Knowledge of basic problem resolution and escalation practices<br><br> Ability to effectively collaborate and communicate with others<br><br> Ability to multitask, prioritize tasks, and quickly adjust in a rapidly changing environment<br><br> Ability to respond to requests under tight deadlines in a dynamic working environment<br><br> Proficient analytic, organization, and communication skills<br><br><strong>Configuration Release Analyst III</strong><br><br> Advanced professional role. Highly skilled and demonstrates extensive proficiency. Works under minimal supervision on complex projects with a wide latitude for independent judgment. Acts as a mentor to less experienced peers. This position is responsible for implementing and supporting best practices and procedures in Version control, software development lifecycle management, application build management, application distribution and deployment management, and other software configuration management activities. Sets up complex projects in the version control tool, creates and troubleshoots distributed builds/compiles, as well as trains and consults with development teams on how to use the tools. Requires some scripting or coding responsibilities. May be responsible for upgrading or installing new hardware and software components. Typically requires a minimum of seven (7) years of experience in information systems and technology. Specific knowledge of Black Knight products and environments preferred.<br><br>Black Knight is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, disability, age, and protected veteran or military family status. Our employees' diversity is our strength, and when we embrace our differences, it makes us better and brighter. Black Knight's commitment to inclusion is at the core of who we are, and motivates us in how we do business each and every day.<br></p> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "fLmofnceQoOA6cV6ErxtKw",
    "url": "https://jobmote.com/job/81881/forgerock-development-implementation-consultant-remote-telecommu/",
    "title": "ForgeRock Development / Implementation Consultant - Remote / Telecommu",
    "tags": [
      "DBG:surround``4N( OR(look, search),     4N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:java-ee/java/13",
      "DBG_TECH1:k/t/w:java/java/6",
      "DBG_TECH1:k/t/w:java/mobile/3",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:jboss/java/8",
      "DBG_TECH1:k/t/w:jquery/frontend/8",
      "DBG_TECH1:k/t/w:maven/java/13",
      "DBG_TECH1:k/t/w:spring-boot/java/8",
      "DBG_TECH1:k/t/w:spring/java/16",
      "DBG_TECH1:k/t/w:tomcat/java/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=3, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=80, gamedev=0, php=0, embedded=0, frontend=18}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "Cynet Systems",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 28, 2019 10:08:07 PM",
    "validThrough": "Oct 1, 2019 10:08:07 PM",
    "crawled": "Sep 29, 2019 3:06:32 AM",
    "content": "<div>We are looking for <strong>ForgeRock Development / Implementation Consultant - Remote / Telecommute </strong>for our client in <strong>Overland Park, KS / Reston, VA</strong>    <strong>Job Title: ForgeRock Development / Implementation Consultant - Remote / Telecommute</strong>    <strong>Job Location: Overland Park, KS / Reston, VA</strong>    <strong>Job Type: Contract</strong>     <strong>Job Description:</strong>  <ul><li>Looking for a self-starter comfortable working with minimal supervision.</li> <li>Able to learn and drive work across a large organization, establish key relationships, find answers, and resolve issues with minimal support.</li></ul>Demonstrated hands-on experience in a complex, large enterprise environment, including:<br><ul><li>4+ years of experience with JavaScript or Apache Groovy. (30%)</li> <li>4+ years of experience with Java/J2EE, Spring, Tiles, Spring Boot, HTML5, CSS3, jQuery, Oracle/RDBMS, JBoss, Apache Tomcat, SOAP and RESTful services.</li> <li>Access Management based product experience with one or more products - Forgerock AM, Okta, Oracle AM, TAM, SiteMinder. (30%)</li> <li>Maven, GitHub/bitbucket and bug tracking systems.</li> <li>Building JWT, SAML, OAuth, OIDC solutions.</li> <li>Consuming and building endpoints to produce JSON formatted output.</li> <li>Ability to use and build REST APIs with Java.</li> <li>Must demonstrate substantial knowledge and a thorough understanding of the Security Administration. </li></ul>Topics include:<br><ul><li>Auth/Authz standards Oauth, OIDC, SAML, SSO. (40%)</li> <li>Access Management and LDAP products.</li></ul>Responsibilities will include configuring, customizing, integrating, performance tuning, and troubleshooting ForgeRock in the environment described below:<br><ul><li>Forgerock AM 5.x/6.x, OpenIG 5.x/6.x using HTML, CSS, JavaScript, and building custom nodes with Java.</li> <li>Experience with OpenAM, OpenDJ installation, and configuration.</li> <li>Will lead and support the client s initial ForgeRock projects, including client interaction and coordination with vendor resources.</li> <li>Solid Experience working with Support SLAs, Incident Management, and Problem Management within the ITIL framework.</li></ul> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "0-79hk17SiyjELWxso7jkQ",
    "url": "https://jobmote.com/job/80689/remote-jenkins-build-engineer-python-jenkins/",
    "title": "Remote Jenkins Build Engineer - Python, Jenkins",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:python/python/16",
      "DBG_TECH1:k/t/w:windows/dotnet/32",
      "DBG_TECH1:techWeightMap:{python=16, other=0, dotnet=32, c=0, mobile=0, go=8, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "CyberCoders",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 27, 2019 10:08:00 PM",
    "validThrough": "Sep 30, 2019 10:08:00 PM",
    "crawled": "Sep 28, 2019 3:06:30 AM",
    "content": "<div>Minimum Required Skills:<br>Jenkins, Python, Amazon Web Services, Building / Compiling, debugging services, Linux Administration, Windows Administration, API Design, Writing / Signing Windows MSI packages, Working Remote<br><br>This position is 100% REMOTE / Work from home - required experience is Python + Jenkins while AWS, Bamboo + Security is a plus! <br><br>We are fast growing, extremely well funded and now established startup in the cloud security and data analysis space. We are backed by huge partners including significant investment by Google Ventures. <br><br>We are seeking a talented Build Engineer who is interested in pushing their boundaries and taking on a role that involves significant work in an environment that relies on extremely reliable build / release engineering. <br><br>Our team uses technologies that include Python, AWS (lots of services) and Bamboo / Jenkins for CI.<br><br>If you are a Software Engineer and you like solving problems, finding and fixing issues, improving application performance and contributing to high transaction, high availability applications and you're interested in a role that's responsible for Blue / Green Release Architecture, Continuous Integration and working with a modern open source stack that includes Python, Bamboo and Jenkins, please read on.<br><br>Top Reasons to Work with Us<br><br>- We are one of the fastest growing startups in america right now (for real)<br>- Work with modern technologies<br>- Leverage the performance, power, and scalability of modern cloud computing best practices<br>- A new product that is revolutionizing cloud data, cloud security and real time cloud processing<br>- Solve challenging problems for a platform that has incredibly high transactions and an absurd amount of data / big data and big data processing<br><br>What You Will Be Doing<br><br>- Working as part of a build team that will be working to build / release code written in Python and GoLang<br>- Working w/ Bamboo and Jenkins<br>- Participating in Blue / Green Architecture / Deployment / automated build / release and deployment engineering<br>- Work on complex Builds that communicated w/ AWS and are highly scalable<br><br>What You Need for this Position<br><br>Experience w/ the following:<br><br>- Python + Jenkins expertise is a MUST<br><br>The following are all nice to haves:<br>- Bamboo<br>- Strong knowledge of Continuous Integration<br>- AWS <br>- Windows MSI Packages<br>- Linux &amp; Windows Administration<br><br>What's In It for You<br><br>Super cool company culture - very well funded startup, proven industry executives, great company culture, bleeding edge technology stack<br>Work on extremely challenging and thought provoking problems<br>Great base salary + equity + bonus + PTO and great other benefits too!So, If you are a Build Engineer and you like solving problems, finding and fixing issues, improving application performance and contributing to high transaction, high availability applications and you're interested in a role that's responsible for Build Engineering w/ a modern open source stack that includes Python, Bamboo and Jenkins, please apply!<br><br>Applicants must be authorized to work in the U.S.Please apply directly to by clicking 'Click Here to Apply' with your Word resume!<br><br>Looking forward to receiving your resume and going over the position in more detail with you.<br><br>- Not a fit for this position? Click the link at the bottom of this email to search all of our open positions.<br><br>Looking forward to receiving your resume!<br><br>CyberCoders<br><br>CyberCoders, Inc is proud to be an Equal Opportunity Employer<br><br>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br>Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.<br><br>Copyright 1999 - 2019 . CyberCoders, Inc. All rights reserved.<br> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "qxBIUWY8QQmBKi_7HDt0aA",
    "url": "https://jobmote.com/job/80685/cloud-automation-engineer-remote-work/",
    "title": "Cloud Automation Engineer - Remote Work",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:windows/dotnet/16",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=16, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Apetan Consulting",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 27, 2019 10:08:00 PM",
    "validThrough": "Sep 30, 2019 10:08:00 PM",
    "crawled": "Sep 28, 2019 3:06:30 AM",
    "content": "<div><p> <strong>Role : Automation Engineer</strong></p> <p> <strong>Location : Remote Work</strong></p> <p> <strong>Duration : 3+ Months Contract</strong></p> <p> <strong>Interview Mode: Phone and Skype</strong></p> <p>Overview:</p> <ul><li>Design and deploy automation in the infrastructure supporting business platforms and continuously improve to meet the evolving needs of our business community.</li> <li>The Engineer will help drive the strategic initiatives and tactical activities and Cloud First direction of the company.</li> <li>Review existing scripts and share findings with other</li></ul><p>Responsibilities:</p> <ul><li>Automation Engineer will develop and apply the technological principles needed to control or monitor the processes in place.</li> <li>Will be involved in developing and designing the concept, testing, installation, and understand automation processes out there of automation processes.</li> <li>Work with senior leadership and Architecture to formulate and carry out the strategic plan for the automation and cloud directions.</li> <li>Establish and support technical policies and procedures to align with the automation and cloud directions, which includes compliance and security efforts related to systems managed by the Infrastructure teams</li> <li>Develop automation methodologies for infrastructure build and system management activities across platforms, network and storage systems</li> <li>Develop and maintain installation and configuration management procedures, and drive automation around these areas</li> <li>Identify and implement automation to improve infrastructure services, as well as self-healing measures, to 99.999% availability (i.e. Five 9s ) Continual improvement of IT infrastructure supporting agile model</li> <li>Coordinates cross functional projects and enterprise-wide programs to insure compliance with shared infrastructure strategies.</li> <li>Support the efforts for cross-training and collaboration, as well as mentoring other less-experienced members aiding in the automation and cloud directions</li> <li>Drive improved Time To Value using automated, consistent and self-documenting processes</li> <li>Aid in the communication collaboration with the Project Management teams, Architecture and Infrastructure Coordinators on project progress, issues and solutions </li></ul><p>Qualifications:</p> <ul><li>10 + years Infrastructure Engineering or Applications Architecture across multiple disciplines</li> <li>Expert level knowledge of Windows and Linux operating systems and technologies, including the automated provisioning and management of these environments</li> <li>Expert level knowledge and experience with infrastructure automation design and services, including, HA (High Availability), IaC (Infrastructure as Code), PaaS (Platform as a Service) and IaaS (Infrastructure as a Service)</li> <li>Expert level knowledge in the administration of storage/SAN, file, including forecasting, utilization, provisioning and redundancy</li> <li>Expert level knowledge and experience with the implementation, optimization, automation, high- availability and management of infrastructure services, including NOS (Network Operating Systems/Active Directory), DHCP and DNS</li> <li>Expert knowledge in the workings and operation of virtual environments, including application, server and storage</li> <li>Understanding of Cloud technologies, including administration, design and provisioning through the use of cloud management and broker services (e.g. vRealize, Cloudforms)</li> <li>Strong understanding of configuration management and software deployment principles, such as Puppet, Ansible and Chef</li> <li>Understanding of storage technologies, storage virtualization and principles of SANs</li> <li>Extensive experience with active scripting languages, including and especially PowerShell and Python. and the use to further automate environments</li> <li>Advance experience with source control, configuration management and deployment systems, such as Git Lab, Jenkins, Puppet, Ansible</li> <li>Experience with Windows and Linux middleware Experience working with databases (e.g. SQL, Oracle)</li> <li>Hands-on experience with virtualization tools and cloud computing, Microsoft Azure and multi cloud platforms</li> <li>Experience with network principles and design</li> <li>Experience in the administration of storage/SAN, file, including forecasting, utilization, provisioning and redundancy</li> <li>College degree in computer science or a related field preferred.</li></ul><p> </p> <p> </p> <p> </p> <p>Deepak Kumar | Sr Technical Recruiter| Apetan Consulting LLC</p> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "TZPBvtQUTtuQMXQ6rQR2aw",
    "url": "https://remoteok.io/jobs/75343",
    "title": "Implementation Professional Services Consultant",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=4}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Formstack",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 27, 2019 12:45:01 AM",
    "validThrough": "Oct 4, 2019 12:45:01 AM",
    "crawled": "Sep 27, 2019 1:06:38 AM",
    "content": "<span></span> <span><h4>Formstack</h4></span> <br> <h3>Implementation Professional Services Consultant</h3> <div>  <div>   Formstack, transforming the way you collect data and put it to work, is looking for an Implementation &amp; Professional Services Consultant&nbsp;to add to the team.\\nFormstack is a 13-year-old company with its roots in Indianapolis. Our customers span 110 different countries, and our employees live and work across the U.S. and the globe. We provide a work environment that is flexible and provides great freedom for those who can perform. We are seeking people who demonstrate an ability to work effectively with individuals from diverse cultures and backgrounds.\\nWho You Are:\\nYou have experience working with customers, solving complex problems, and are driven to keep learning. You are a great communicator, detail oriented, and can see a project through from start to finish. If that's you, you might be just what we need!\\nWhat You Will Do:\\nProfessional Services Consultants (PSCs) are responsible for client engagement during the post-sales process and working with merchants to provide an exceptional onboarding experience. PSCs leverage deep product and industry knowledge to project-manage the onboarding stage of the post-sale process. This is a customer-facing role that involves a combination of remote and onsite merchant interactions.\\nHow You Will Succeed:&nbsp;\\n* Provide an incredible onboarding experience for customers and partners\\n* Accelerate the sales and post-sales (retention &amp; upgrades) cycles by specializing onboarding and training\\n* Develop new efficiencies to shorten onboarding sales stage.\\n* Deliver creative and custom solutions leveraging multiple products and tech stacks.\\n* Be the directly responsible individual (DRI) for moving projects through to completion based on contracted agreements and providing onboarding assistance to applicable accounts.&nbsp;\\n\\n\\n* Identify unique solutions and approaches to solve complex business and/or technical problems.\\n* Execute against the onboarding process and training curriculum to hold customers accountable to a go-live timeline.\\n* Solve problems on the fly -- be flexible.\\n* Track all customer interaction in Salesforce.\\n\\n\\nWhat We Are Looking For:&nbsp;\\n* CSS, HTML, and/or Javascript knowledge\\n* Experience working with a SaaS product\\n* Understanding of RESTful web services\\n* Data management/Data modeling\\n* 1-2 years experience in a customer-facing role, preferably in Consulting, Implementation, Support, Success, or Sales\\n* Ability to work remote or with remote teams\\n* Excellent written and oral English communication skills\\n* Exceptional customer service skills\\n* Excellent attention to detail\\n* Ability to travel for team meetups, conferences, etc.\\n* Excellent time management, written &amp; verbal communication skills.\\n* Proven ability to learn quickly as new products are released.\\n\\n\\nWhat Formstack Offers:\\n* Free health plans, as well as company-paid Dental, Vision, Disability and Life Insurance Benefits for full-time employees.\\n* Unlimited PTO for all employees\\n* 401k with matching company contribution for full-time employees\\n* The most up-to-date technology, including company-issued Macs, the latest software and other tools needed to excel at your job\\n* Company-paid conferences and extended learning\\n* Yearly company gatherings\\n\\n\\nWant to learn more about who we are and what we value? CLICK HERE to hear from some current Formstackers about what matters most! \\nFormstack is proud to be an equal opportunity workplace dedicated to pursuing and hiring a diverse workforce.\\nAll data collected in our application process from resume collection to application questions is used for recruitment purposes only. We will store it in our applicant tracking system, JazzHR, and will not share this data with anyone else. We will keep your data until the role is filled and only continue to store it if we feel you may fit future roles.\\nThank you for your interest in Formstack!  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "L2-lqA98SzCnZggRDxOjzQ",
    "url": "https://jobmote.com/job/79063/implementation-specialist-remote-position-anywhere-in-the-us/",
    "title": "Implementation Specialist - Remote Position - Anywhere in the US",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:backbone.js/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/integration",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "IBM",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 25, 2019 12:53:38 PM",
    "validThrough": "Sep 28, 2019 12:53:38 PM",
    "crawled": "Sep 25, 2019 5:06:32 PM",
    "content": "<div>**Introduction** IBM Global Technology Services enables the backbone of the world economy by Designing, Building, and Run-Maintaining the critical Infrastructures and Systems across its Client's Enterprise IT environments. Together with IBM Cloud, IBM Security, IBM Storage, IBM Resiliency, IBM Watson etc., GTS delivers outcomes that are essential for our Clients' Businesses. **Your Role and Responsibilities** **_Preferred location would be Austin, TX but open to remote work anywhere in the US_** Implementation Specialist is an exemplary subject matter expert to design and build leading-edge solutions for IBM's clients. This role is crucial to implementing cutting edge Hybrid Cloud Capabilities and Solutions for clients worldwide specially using Red Hat technologies. The role would involve working with highly skilled cloud architects in taking up challenging internal IBM projects in order to develop and execute complex solutions for IBM clients worldwide. The success of this role would be benchmarked globally with industry peers. Excellent practice and knowledge on Cloud based automation software/Script development and tools, consummate thought leadership, constant innovation and contribution to development of industry standards would be some of the key result areas in addition to meeting business metrics for the respective areas. **Required Professional and Technical Expertise** + Must have at least 1-year experience in one or more of Red Hat Cloud technologies (OpenStack, Openshift, Cloud Forms, Ansible, etc.) and hands-on experience in implementing cloud solutions using these technologies. Exposure and good understanding in core tenants to be considered when designing, developing &amp; deploying to a Cloud. Confident enough to leverage Cloud Platforms. + Bachelors degree (or above) in Computer Science or related fields. + Excellent written and verbal communication skills **Preferred Professional and Technical Expertise** + More than 2 years of experience in one or more of Red Hat Cloud technologies (OpenStack, Openshift, Cloud Forms, Ansible, etc.) and hands-on experience in implementing cloud solutions using these technologies. Exposure and good understanding in core tenants to be considered when designing, developing &amp; deploying to a Cloud. Confident enough to leverage Cloud Platforms. + Knowledge of other Cloud Providers e.g. IBM, AWS, Azure, Google Cloud Platform, or VMware will be preferred. + Good understanding on Software Defined Environments and Pattern Based deployments (specially Ansible). + Strong skills on one or more of the above technologies with an ability to quickly build and demonstrate Proof of Concepts and Proof of Technologies and contribute to Technology Innovation and Automation projects **About Business Unit** At Global Technology Services (GTS), we help our clients envision the future by offering end-to-end IT and technology support services, supported by an unmatched global delivery network. It's a unique blend of bold new ideas and client-first thinking. If you can restlessly reinvent yourself and solve problems in new ways, work on both technology and business projects, and ask, \\&quot;What else is possible?\\&quot; GTS is the place for you! **Your Life @ IBM** What matters to you when you're looking for your next career challenge? Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities - where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust - where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible. Impact. Inclusion. Infinite Experiences. Do your best work ever. **About IBM** IBM's greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries. **Location Statement** For additional information about location requirements, please discuss with the recruiter following submission of your application. **Being You @ IBM** IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "HaGzQdavSR6a9SP-d2qv1Q",
    "url": "https://jobmote.com/job/77947/automation-engineer-vmware-100-remote-work-from-home/",
    "title": "Automation Engineer - VMWare --- 100% Remote - Work from Home",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "MatchPoint Solutions",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 23, 2019 10:07:46 PM",
    "validThrough": "Sep 26, 2019 10:07:46 PM",
    "crawled": "Sep 24, 2019 3:06:32 AM",
    "content": "<div><p> <strong>Title: Automation Engineer</strong></p> <p> <strong>Location: Branchville, NJ (100% remote)</strong></p> <p> <strong>Duration: 6 Months+ </strong></p> <p> </p> <p>Our client is looking for someone to automate scripts within the VMware environment</p> <ul><li>Powershell</li> <li>Vrealize- VRO</li> <li>Puppet</li> <li>Azure</li></ul><p> </p> <p>Mohd Arshad<br> Senior Talent Acquisition Manager</p> <p>MatchPoint Solutions<br>6690 Amador Plaza Rd, Suite 225, Dublin, CA 94568<br>Mobile: +1- | Email: </p> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "VI_HzGKpSyS-mX4Momzq4g",
    "url": "https://jobmote.com/job/76909/vmware-vrealize-automation-engineer-remote/",
    "title": "VMware vRealize Automation Engineer- Remote",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Pddn inc",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 22, 2019 10:07:41 PM",
    "validThrough": "Sep 25, 2019 10:07:41 PM",
    "crawled": "Sep 23, 2019 3:06:32 AM",
    "content": "<div><p><strong>Job Description:</strong></p><p>Must have experience in VMware vRealize automation and operations along with Windows.</p><p>Customize tenant branding. Manage tenant identity stores. Manage user and group roles. Create custom groups. Manage notification providers.</p><p>Enable notification scenarios for tenant users. Configure vRealize Orchestrator servers, plug-ins and workflows for XaaS.</p><p>Create and manage catalog services. Manage catalog items. Create and manage entitlements.</p><p>Create and manage approval policies. Monitor tenant machines and send reclamation requests.</p><p> </p> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "wUVwLanKTSSakpjkqLT0Tw",
    "url": "https://jobmote.com/job/76329/data-integration-solutions-consultant-fulltime-staff-remote/",
    "title": "Data Integration Solutions Consultant Fulltime Staff (Remote)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:sql-server/dotnet/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=1, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "ProSpring Technical Staffing",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 19, 2019 10:07:49 PM",
    "validThrough": "Sep 22, 2019 10:07:49 PM",
    "crawled": "Sep 20, 2019 3:06:33 AM",
    "content": "<div>A company in San Francisco on the leading edge of data integration and transform is looking for a Data Integration Solutions Consultant to join their Customer Success Team. In this position you will be responsible for providing implementation and consulting services for both new customers, OEM partners, and existing customers. This is a primarily remote position as a full-time employee with excellent benefits. Requirements: o. 5 years experience software solution development/deployment in data integration projects o. Experience in a broad range of database platforms and operation systems, including relational databases (Oracle, DB2, SQL Server), analytical data warehouses (Teradata, Redshift), and other data stores o. Experience with enterprise applications such as SAP, Salesforce, Oracle Application Suite, JD Edwards, Peoplesoft, Siebel o. Experience with ETL technologies Informatica, Snaplogic, Talend, Wherescape is a plus Notes: o. This is a full-time staff primarily remote position o. Some travel maybe required o. Authorized US workers only (the company cannot hold H1 or other visas) o. Questions? Call o. To be considered, email your resume to EN871ProspringStaffing.com with the best number at which to reach you and someone will call you to discuss - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "VbOeu1TfS1aUcZY5bocy5Q",
    "url": "https://jobmote.com/job/76322/integration-consulant-informatica-talend-remote-travel-role/",
    "title": "Integration Consulant (Informatica / Talend) - (Remote Travel role)",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Ztek Consulting",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 19, 2019 10:07:48 PM",
    "validThrough": "Sep 22, 2019 10:07:48 PM",
    "crawled": "Sep 20, 2019 3:06:33 AM",
    "content": "<div>Non-Sponsored candidate for this role. Role: Integration Consultant Location: Remote Travel (50-60% Travel) Fulltime Job Description: As an Integration Consultant you will provide expertise in integrating and configuring supply chain technology solutions to ensure client success. Typical responsibilities include: Meet with clients to brainstorm ideas and understand business requirements Work closely with Solution Architects and Consultants to help design solutions and project plans to meet client needs Configure solution analytics and data model according to the functionality of the customer s source systems (commonly known as MRP/ERP system) or implementing new analytics Map, load and validate client data Resolve complex data and analytic configurations to ensure that the solution is producing the expected results Integrate and customize supply chain solutions to satisfy client-specific processes and business requirements Provide high levels of client service Qualifications Bachelor s degree in engineering, computer science, supply chain management, management information systems, or other relevant technical degree; or equivalent work experience Thorough understanding of the software development life cycle, including business requirements definition, review of functional specifications, development of test plans, testing, user training, and deployment Experience with data modeling, query building and analytics Knowledge of functional supply chain and planning processes, including ERP/MRP, capacity planning, and managing planning activities with contract manufacturers Experience integrating to ERP systems such as SAP and Oracle Experience in systems integration and ETL tools such as Informatica, Talend, SSIS and SSRS strongly preferred Experience with data mapping and systems integration Functional knowledge of supply chain or after sales service operations a plus Experience with supply chain technology solutions such as RapidResponse, 09, Quintiq or similar a plus Exceptional drive, excellent interpersonal skills and the ability to communicate effectively, both verbally and in writing, and to immediately contribute in a team environment An ability to manage multiple priorities and perform well in a fast-paced environment, while maintaining a high level of client focus Strong work ethic and high attention to detail, with a desire to learn Thanks &amp; Regards Amir Chaudhary _________________________________________________ Ztek Consulting Inc. Phone: E-mail: Visit us at LinkedIN Profile: _________________________________________________ - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "cIwydhedRW-eYZvPs1HxdA",
    "url": "https://remote.co/job/systems-integration-engineer/",
    "title": "Systems Integration Engineer",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/integration",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "Articulate",
      "sameAs": "https://articulate.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 18, 2019 5:05:01 PM",
    "validThrough": "Sep 25, 2019 5:05:01 PM",
    "crawled": "Sep 18, 2019 5:07:30 PM",
    "content": "<h3>Systems Integration Engineer at <span>Articulate</span></h3><div><span><i></i> Remote</span>        </div><div>            <p><strong>ANYWHERE IN US</strong></p><p>ENGINEERING</p><p>FULL-TIME</p><p>The Systems Integration Engineer is a proven technology professional who has experience implementing advanced data and systems integrations between third-party SaaS platforms, in-house systems, and third-party IT systems. This hands-on role will interact with both the product and engineering teams to gather requirements, design solutions, and execute integrations.</p><p><strong>What you’ll do:</strong></p><ul><li>Build and expand our platform by integrating it with key third-party services.</li><li>Work with the product leadership team to create, prioritize, and manage long-term technology road maps for data and systems integrations.</li><li>Partner with external companies to understand how to leverage their technology.</li><li>Learn everything about the technologies and platforms that matter to our largest customers.</li><li>Be a subject matter expert and point of contact for customers on the implementation and adoption details of our integrations.</li><li>Provide quality, detailed explanations of third-party integration requirements to the product and support teams.</li><li>Create prototypes of integrations with various systems. Help transition integrations from prototype to production code.</li><li>Help lead documentation for integrations and best practices.</li></ul><p><strong>What you should have:</strong></p><ul><li>Integrations experience: You’ve designed and built integrations that allow for greater connections between services.</li><li>Experience with public APIs, external systems, and services.</li><li>The ability—and passion—to dive deep into APIs, SDKs of many different platforms, systems, and applications, even when that means experimenting due to poor documentation.</li><li>Programming experience with multiple languages and technical stacks, including JavaScript and Amazon Web Services.</li><li>Excellent written and verbal communication skills.</li><li>Experience communicating technical concepts to nontechnical audiences.</li></ul><p><strong>Bonus points:</strong></p><ul><li>Experience building integrations and apps for platforms such as Slack, Salesforce, CRMs, and HRIS systems.</li></ul><p><strong>About Articulate</strong></p><p>Articulate is a highly successful, fully remote software company that’s changing the way the world learns. Our award-winning e-learning tools are used by 78,000+ organizations across the globe to create engaging online and mobile courses. Our customers include 93 of the Fortune 100 and 19 of the top 20 U.S. universities. And our online community of 605,000+ members is the largest, fastest-growing community in the industry.</p><p>We empower employees to thrive by fostering a culture of autonomy, productivity, and respect. We’re all free to exercise our crafts the best way we know how to reach our goals as individuals and teams. Each and every one of us is focused on producing results that directly impact the company’s success. And we all strive to do what’s right by people, both internally and externally, instead of taking the shortest route to the highest profits.</p><p>We honor people’s humanity in all of our disparate experiences and social locations, accepting each person as an individual with a story worth listening to and honoring. We believe that honoring everyone’s humanity means being committed to equity and justice. We welcome different voices and viewpoints and do not discriminate on the basis of race, religion, color, national origin, ancestry, physical and/or mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, transgender status, age, sexual orientation, and military or veteran status, or any other basis protected by law. We are an equal opportunity employer and invite applicants to voluntarily disclose their race and gender on our application form to help us create a diverse company. This voluntarily disclosed information will not be shared with any hiring manager and will be kept in confidence by the Articulate human resources department and executives who are not hiring for this position.</p>        </div><div>        <a href='https://jobs.lever.co/articulate/e07687c3-d5b2-46ce-90a9-8482655aba51' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "zRqSXD32R62eQUFw31NRAg",
    "url": "https://jobmote.com/job/75085/dell-boomi-integration-developer-tampa-remote/",
    "title": "Dell Boomi Integration Developer (Tampa & Remote)",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "United Techno Solutions Inc",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 16, 2019 10:07:50 PM",
    "validThrough": "Sep 19, 2019 10:07:50 PM",
    "crawled": "Sep 17, 2019 3:06:26 AM",
    "content": "<div><p> <strong>United Techno is a Global IT Services firm specializing in niche services including Cloud Integration, Digital Transformation, Modernization and Data intelligence for Retail, Life Sciences and Supply chain customers. United Techno is a premium partner with Dell Boomi executing many integration projects globally.</strong></p> <p> <strong>We are hiring for a SENIOR DELL BOOMI Developer Consultant - Immediate Joining</strong></p> <p>LOCATION: Tampa, FL and Remote (for the rightly experienced candidates)</p> <p>Contract Role</p> <p>Requirements:</p> <p>Role : Senior Dell Boomi Integration Developer</p> <p>Role Description: Design, develop, architect Boomi integration processes</p> <p> <strong>Must have Skills:</strong> Dell Boomi. / Dell Boomi Certification / Netsuite &amp; Salesforce integration experience, EDI, API Management</p> <p>- Minimum 2 years of Experience in application integration using Dell Boomi. 8+ years Integration &amp; Architecture experience. <br>- Proficient in building, deploying and scheduling complex integration processes. <br>- Experience in building application integrations with solutions like Netsuite, Workday, Salesforce, SFCC, Shopify and others. EDI experience with Boomi will be an advantage.<br>- Strong presentation and communication skills, should be able to work on multiple integration projects along with a team of integration developers.</p> <p> Remote Fulltime option is available if you have a strong Boomi experience and able to directly work with clients. </p> <p>Apply with resume and availability</p> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "-Fkd20NZSwmehpG8xRdijw",
    "url": "https://jobmote.com/job/73846/epic-integration-developer-remote/",
    "title": "Epic Integration Developer - Remote",
    "tags": [
      "DBG:surround``4N( OR(look, search),     4N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "SA Technologies Inc",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 14, 2019 10:07:53 PM",
    "validThrough": "Sep 17, 2019 10:07:53 PM",
    "crawled": "Sep 15, 2019 3:06:26 AM",
    "content": "<div><p>We are looking for an Epic Integration Developer for a 1 year long contract opportunity with our client based in Indianapolis, IN. This is a remote opportunity other than the first 1-2 weeks of training onsite.<br><br>The Epic Integration Developer will be responsible for the following:<br><br>Support team in setting up and troubleshoot Epic/SMART on FHIR integration technical issues<br>Work on application testing<br>Participate in all Epic customer-facing meetings including Project Management and Epic TS teams<br>Work with 3rd party integration partner to maintain and support current document writeback/HL7 integration capabilities<br><br><strong>Required Skills:</strong> <br><br>Possesses a deep understanding of Epic systems and integration points/issues including but not limited to Interconnect, EpicCare Inpatient, Epic Ambulatory, and Data Courier<br>Highly competent in SMART/FHIR and related issues (e.g., FDI, CORS, SSL, Firewalls)<br>Experience with SQL &amp; reviewing log files to troubleshoot issues (e.g. analyzing log files if data exchange between application, partner, and customer is not working)<br><br><strong>Required Experience:</strong> <br><br>Bachelor s degree, Computer Science or Engineering preferred<br>3+ years Software Development experience</p> <p> <strong>Preferred Skills:</strong> <br><br>Strong troubleshooting and problem-solving skills<br>Interpersonal and communication skills, including managing multiple stakeholders<br>Desire and able to quickly learn new skills<br>Knowledge of web communication standards (I.e. REST, JSON) is a plus<br>Epic TS experience is a plus.<br><br></p> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "fNZ5cSoYQPKGKo9FYxEnDA",
    "url": "https://jobmote.com/job/72712/workday-integration-developer-100-remote/",
    "title": "Workday Integration Developer 100% Remote",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:eclipse/java/1",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:jersey/java/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=11, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "Apetan Consulting",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 13, 2019 10:07:38 PM",
    "validThrough": "Sep 16, 2019 10:07:38 PM",
    "crawled": "Sep 14, 2019 3:06:24 AM",
    "content": "<div><p> <strong>Location: Cleveland Clinic (HQ is in Cleveland, OH - EST) 100% Remote<br>Duration: 6 Month </strong></p> <p> </p> <p>Job Description:</p> <p>The main responsibilities are: </p> <ul><li>Monitors the systems for data quality, efficiency, operation and data integrity and appropriately escalates issues/problems.</li> <li>Provides production and enhancement support for workday integration.</li></ul><p> <strong>Experience, Skills, Knowledge</strong></p> <p> </p> <ul><li>Workday Integration Development</li> <li>Workday Studio</li> <li>Document Transform Benefit Connectors</li> <li>EIB/BI</li> <li>Oxygen</li> <li>SOAP UI</li> <li>Stylus Studio XML Editor</li> <li>Studio 2015 (Eclipse)</li> <li>Oracle JDK 1.7.0</li> <li>Web Services Tester</li> <li>Text Pad</li></ul><p> </p> <p> <strong>Rohit Gartan</strong></p> <p> <strong>Apetan Consulting LLC</strong></p> <p> <strong>Tel: * 140 | Fax: | </strong></p> <p> <strong>Email id :</strong> <strong> </strong></p> <p> <strong>72 Van Reipen Avenue # 255 Jersey City, NJ 07306 </strong></p> <p> </p> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "bjsI8dlARBCTufguKDJ21A",
    "url": "https://remote.co/job/integrations-developer/",
    "title": "Integrations Developer",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Sability",
      "sameAs": "https://sability.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 13, 2019 4:30:09 PM",
    "validThrough": "Sep 20, 2019 4:30:09 PM",
    "crawled": "Sep 13, 2019 5:07:08 PM",
    "content": "<h3>Integrations Developer at <span>Sability</span></h3><div><span><i></i> Remote</span>         | <span> Entry-level </span></div><div>            <p><strong>Remote, USA</strong></p><p><strong>Job Description: </strong><br>Sability is looking for a software developer to join our systems integrations team. Responsibilities will include designing, coding, testing and troubleshooting integrations between HR, Payroll, Timekeeping, Scheduling, Benefits, General Ledger, Insurance and other related IT systems. You must demonstrate strong general-purpose coding skills, an ability to interpret complex specification documents, and the ability to work effectively from home.<br>As an Integrations Developer, you will work closely with our HCM implementation consultants to understand the customer’s requirements and create solutions that meet our clients’ business needs. Direct communication with our partners and clients will be required so strong English language written and verbal communication skills are important.</p><p><strong>Responsibilities:</strong></p><ul><li>Deliver high-quality code that integrates IT systems in the most effective way</li><li>Work with multiple clients, projects and consultants at a time.</li><li>Work with the HCM consultants, clients and third party software vendors to understand requirements and business needs</li><li>Create and execute effective test plans to ensure the quality of the solutions delivered</li><li>Assisting client with solution deployment</li><li>Manage and resolve issues with delivered integrations</li></ul><p><strong>Requirements:</strong></p><ul><li>A demonstrated ability to create high-quality code in a general-purpose programming language</li><li>Dell Boomi and Datawatch experience an asset but not required</li><li>Familiarity with the HCM and/or benefits industries an asset but not required</li><li>Strong English language written and verbal communication skills</li><li>Creative problem solving</li><li>Strong analytical skills</li><li>Experience working independently without daily supervision</li><li>Ability to multitask between different projects and clients</li></ul><p><strong>Education: Bachelor’s degree or community college education in a coding-related discipline required</strong></p><p><strong>Compensation: </strong>Base Salary + Annual Bonus dependent upon qualifications and experience</p><p><strong>Location:</strong> <strong>U.S. &amp; Canada, Virtual – No relocation required</strong></p><p><strong>Employment: Full-time Salary</strong></p><strong></strong><p><strong>Travel: 10% or less</strong></p><p><strong>SABILTIY:</strong><br>Sability is a Human Capital Management strategy and software services Consultancy. We specialize in HCM and WFM System Selection, Design and Implementation of systems such as Kronos, Infor Workbrain, Ceridian Dayforce and Ultimate Software UltiPro. Experienced HCM consultants choose Sability for our flexible work environment and sense of pride and ownership in the success of our clients. We offer virtual fulltime employment opportunities across the US and Canada and are a five-time recipient of SHRM’s “When Work Works” award for workplace flexibility. As a high-growth company, we have also been recognized as a member of the Inc. 5000 and one of Inc. Magazine’s 2017 Best Workplaces.</p>        </div><div>        <a href='https://sability.catsone.com/careers/24453-Public/jobs/12652276-Integrations-Developer' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "uWiyDVdmT7KnydR45FpvtA",
    "url": "https://stackoverflow.com/jobs/288544/build-pipeline-engineer-balena?a=1yLEUL5awwbm&so_medium=Talent&so_source=TalentApi",
    "title": "Build Pipeline Engineer at Balena  ",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:electron/nodejs/8",
      "DBG_TECH1:k/t/w:embedded/c/2",
      "DBG_TECH1:k/t/w:embedded/embedded/16",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:macos/apple/2",
      "DBG_TECH1:k/t/w:node.js/nodejs/26",
      "DBG_TECH1:k/t/w:rust/other/5",
      "DBG_TECH1:k/t/w:shell/other/2",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=7, dotnet=8, c=2, mobile=0, go=0, nodejs=34, bigdata-ml=8, ruby=0, apple=2, java=0, gamedev=0, php=0, embedded=16, frontend=5}",
      "REMOTE1/50",
      "TECH1/nodejs",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "Balena",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 9, 2019 9:30:24 PM",
    "validThrough": "Sep 16, 2019 9:30:24 PM",
    "crawled": "Sep 9, 2019 9:30:24 PM",
    "content": "<h3><span>Build Pipeline Engineer</span>                </h3>                    <h4>About this job</h4>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>System Administrator</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>DevOps, Internet of Things, Software Development</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>11–50 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>VC Funded</span>                                    </div>                            </div>                    </div>                <div>Company: Balena | No office location<br></div><h4>Technologies</h4><div></div><div>linux</div><div>project-management</div><div>node.js</div>                <h4>Job description</h4>                <div><p><strong>ON BEING A BUILD PIPELINE ENGINEER AT BALENA</strong></p><p>We strongly believe that the state of the art in software development, testing, and deployment is light years behind what it could be. Balena engineers take pride on accomplishing more with less by exponentially increasing their productivity through automation and internal tooling, and we are never afraid to question established software development practices, and pioneer our own, to improve the way we work.</p><p>As a build pipeline engineer, you will be working on our cross-platform in-house continuous integration system; on internal tools that range from automatic versioning based on commit conventions, to automated project landing website generation; and on discussing and implementing innovative deployment tools and processes within the distributed systems world.</p><p>A successful build pipeline engineer is a well-rounded generalist and great communicator that take pride on maximizing the output of their team. They are eager to take responsibility for a project, and are able to make good decisions about the project because they have the context of what's important.</p><p>We don't require engineers to already be familiar with the technologies we use. We are happy to invest in people that showcase a strong understanding of the challenges of software development, testing, and deployment along with a willingness to learn and grow.</p><p><strong>RESPONSIBILITIES</strong></p><ul><li>Actively invest back into our own technology, libraries, and frameworks</li><li>Be highly motivated to produce great code</li><li>Maintain the health of our internal build and deployment systems</li><li>Implement and maintain internal tools to improve our in-house build and deploy pipeline</li><li>Identify parts of our development and deployment cycle that can be automated, and push to make that happen</li><li>Challenge orthodoxy when that will help the product evolve</li><li>Design, architect, and own the execution of your projects</li><li>Collaborate, brainstorm, and coordinate work with other teammates</li><li>Understand the high-level goals, and thus know how to prioritize your work</li></ul><p><strong>REQUIREMENTS</strong></p><p>Need to have:</p><ul><li>Desire to make yourself and others more effective. You'd be bothered by an inefficient process</li><li>Good understanding of software engineering practices and how to apply them</li><li>Excellent written communication skills, and fluency in English</li><li>Self-discipline to take on a project and push it to completion without too much management. You also know when to ask for help</li><li>Highly organized, able to handle many threads at once, and keep things moving</li><li>Strong problem-solving abilities. You know how to split a complex problem into incremental pieces</li><li>Strong programming and software engineering skills</li><li>Good understanding of git, Docker, and shell scripting</li></ul><p>Nice to have:</p><ul><li>A sample of your work (URL or attached sample)</li><li>Contributions to OSS projects (please include a URL)</li><li>Having worked remotely before</li><li>Experience with balena as a user</li><li>Experience with embedded GNU/Linux, anything ranging from personal projects with a Raspberry Pi to commercial or industrial scenarios with custom devices</li><li>Experience with the GitHub API and GitHub Apps Marketplace</li><li>Experience with cross-platform application development (macOS, Windows, and GNU/Linux)</li><li>Experience with Concourse CI and Kubernetes</li><li>Experience in the Node.js and Rust ecosystem</li></ul><p>Make sure to let us know if any of these items apply to you!</p><p><strong>BENEFITS</strong></p><ul><li>Work with an extremely talented, diverse team</li><li>Equipment of your choice</li><li>Remote-friendly</li><li>Flexible working hours</li><li>Generous vacation policy</li><li>Annual company gathering in an international location - this year, Barcelona in October</li><li>We send you hardware for side projects!</li></ul><p><strong>ABOUT WORKING AT BALENA</strong></p><p>We come from 15+ countries, and we embrace a remote culture with flexible hours. To us, this means being highly productive while still maintaining a healthy work-life balance. You need to be able to work remotely, and have a dependable internet access available so you can join video calls.</p><p>We are an equal opportunity employer and value diversity. We value knowledge and initiative more than educational and personal backgrounds, age, or location. We maintain a work environment in which team members are treated with respect at all times and in which thoughts and ideas can be shared openly.</p><p>We communicate proposals, discuss with others in the team and accept feedback if it makes the result better. We value the ability to learn, which is more important to us than knowledge of specific technologies. We know that learning fast means being outside our comfort zone, which is OK -- we'd rather learn than let our assumptions get in our way.</p><p><strong>TO APPLY</strong></p><p>We're delighted to hear about you! Send us your CV, with a focus on what you can bring to the team. Please include in your cover letter a paragraph about something you worked on that you found technically appealing or exciting.</p>                </div>            <div>        <a href='https://balena.workable.com/j/16DDFD64E1' rel='nofollow'>                        Apply now        </a></div>            <h4>About Balena</h4>            <div><p>Balena&nbsp;provides a software platform that helps developers build, deploy and manage code on connected devices. We brought Docker to embedded GNU/Linux devices in 2013 and have been building our IoT toolkit ever since. We also maintain a variety of successful open source projects including&nbsp;<a href='https://etcher.io/' rel='nofollow'>Etcher</a>, <a href='https://www.balena.io/open' rel='nofollow'>openBalena</a>,&nbsp;<a href='https://www.balena.io/engine' rel='nofollow'>balenaEngine</a>, and&nbsp;<a href='https://www.balena.io/os/' rel='nofollow'>balenaOS</a>, and made contributions to high-exposure projects such as&nbsp;<a href='https://www.docker.com/' rel='nofollow'>Docker</a>,&nbsp;<a href='https://electronjs.org/' rel='nofollow'>Electron</a>, and&nbsp;<a href='https://appimage.org/' rel='nofollow'>AppImage</a>.</p><p>Our technology is open, standards-based, and proven in production across a wide range of scenarios from drones, 3D printers, point-of-sale devices, tidal turbines, skyscrapers and more. Our investors include DFJ, Aspect Ventures, GE, and Ericsson.</p><p>Balena&nbsp;is a&nbsp;<a href='https://resin.io/team/' rel='nofollow'>highly distributed, remote-friendly company</a>&nbsp;with a pretty much flat hierarchy. Our organization is adaptive, getting feedback signals from our users and systems. Right now we organize ourselves by projects, which allow us to build complex features and solve big problems, while staying mutable. As a distributed group, we rely on clear communication and the rule of &quot;assume positive intent&quot; to help us work together across time zones, cultures and first languages. Our base of operations is nominally London, though really we are living all over the world: from Barcelona to Bulgaria, Argentina to Vietnam, and many more.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Work with extremely talented, distributed team</span>                            </li>                            <li>                                <span></span>                                <span>Work remotely</span>                            </li>                            <li>                                <span></span>                                <span>Flexible working hours</span>                            </li>                            <li>                                <span></span>                                <span>Equipment of your choice</span>                            </li>                            <li>                                <span></span>                                <span>Annual company gathering in an international location</span>                            </li>                            <li>                                <span></span>                                <span>We send you hardware for side projects!</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "I4vr7cMWSROBgZ8kTC4Sog",
    "url": "https://remoteok.io/jobs/74936",
    "title": "Software Engineer, Data (Product Integration)",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 3W OR(time,timezon)",
      "DBG_TECH1:k/t/w:bash/other/1",
      "DBG_TECH1:k/t/w:classification/bigdata-ml/1",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:techWeightMap:{python=4, other=1, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=1, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/integration",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "python"
    ],
    "hiringOrganization": {
      "name": "Doximity",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 6, 2019 11:46:33 PM",
    "validThrough": "Sep 13, 2019 11:46:33 PM",
    "crawled": "Sep 7, 2019 12:06:29 AM",
    "content": "<span></span> <span><h4>Doximity</h4></span> <br> <h3>Software Engineer, Data (product Integration)</h3> <span></span> <span>verified</span> <br> <span>North America</span> <div>  <div>   Doximity is transforming the healthcare industry. Our mission is to help doctors be more productive, informed, and connected. As a software engineer focused on our data stack, you'll work within cross-functional delivery teams alongside other engineers, designers, and product managers in building software to help improve healthcare.&nbsp;\\n\\nOur [team](https://www.doximity.com/about/company#theteam)&nbsp;brings a diverse set of technical and cultural backgrounds and we like to&nbsp;think pragmatically in choosing the tools most appropriate for the job at hand. &nbsp;\\n\\n**About Us**\\n* We rely heavily on Python, Airflow, Spark, MySQL and Snowflake for most of our data pipelines\\n* We have over 350 private repositories in Github containing our pipelines, our own internal multi-functional tools, and [open-source projects](https://github.com/doximity)\\n* We have worked as a distributed team for a long time; we're currently [about 65% distributed](https://blog.brunomiranda.com/building-a-distributed-engineering-team-85d281b9b1c)\\n* Find out more information on the [Doximity engineering blog](https://engineering.doximity.com/)\\n* Our [company core values](https://work.doximity.com/)\\n* Our [recruiting process](https://engineering.doximity.com/articles/engineering-recruitment-process-doximity)\\n* Our [product development cycle](https://engineering.doximity.com/articles/mofo-driven-product-development)\\n* Our [on-boarding &amp; mentorship process](https://engineering.doximity.com/articles/software-engineering-on-boarding-at-doximity)\\n\\n**Here's How You Will Make an Impact**\\n\\n* Collaborate with product managers, data analysts, and data scientists to develop pipelines and ETL tasks in order to facilitate the extraction of insights from data.\\n* Build, maintain, and scale data pipelines that empower Doximity’s products.\\n* Establish data architecture processes and practices that can be scheduled, automated, replicated and serve as standards for other teams to leverage.\\n* Spearhead, plan, and carry out the implementation of solutions while self-managing.\\n\\n**About you**\\n\\n* You have at least three years of professional experience developing data processing, enrichment, transformation, and integration solutions\\n* You are fluent in Python, an expert in SQL, and can script your way around Linux systems with bash\\n* You are no stranger to data warehousing and designing data models\\n* Bonus: You have experience building data pipelines with Apache Spark in a multi-database ecosystem\\n* You are foremost an engineer, making you passionate for high code quality, automated testing, and other engineering best practices\\n* You have the ability to self-manage, prioritize, and deliver functional solutions\\n* You possess advanced knowledge of Unix, Git, and AWS tooling\\n* You agree that concise and effective written and verbal communication is a must for a successful team\\n* You are able to maintain a minimum of 5 hours overlap with 9:30 to 5:30 PM Pacific time\\n* You can dedicate about 18 days per year for travel to company events\\n\\n**Benefits**\\n\\nDoximity has industry leading benefits. For an updated list, see our career page\\n\\n**More info on Doximity\\n**\\nWe’re thrilled to be named the Fastest Growing Company in the Bay Area, and one of Fast Company’s Most Innovative Companies. Joining Doximity means being part of an incredibly talented and humble team. We work on amazing products that over 70% of US doctors (and over one million healthcare professionals) use to make their busy lives a little easier. We’re driven by the goal of improving inefficiencies in our $3.5 trillion U.S. healthcare system and love creating technology that has a real, meaningful impact on people’s lives. To learn more about our team, culture, and users, check out our careers page, company blog, and engineering blog. We’re growing steadily, and there’s plenty of opportunities for you to make an impact.\\n\\n\\n*Doximity is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.* \\n\\n#Location\\n- North America   <br>  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Cnj7i9suRmaS4BOwkiSiCQ",
    "url": "https://weworkremotely.com/remote-jobs/doximity-software-engineer-data-product-integration",
    "title": "Doximity: Software Engineer, Data (Product Integration)",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 3W OR(time,timezon)",
      "DBG_TECH1:k/t/w:bash/other/1",
      "DBG_TECH1:k/t/w:classification/bigdata-ml/1",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:techWeightMap:{python=4, other=1, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=1, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/integration",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "python"
    ],
    "hiringOrganization": {
      "name": "Doximity",
      "sameAs": "http://www.doximity.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Sep 6, 2019 5:35:04 PM",
    "validThrough": "Sep 13, 2019 5:35:04 PM",
    "crawled": "Sep 6, 2019 6:23:00 PM",
    "content": "<h3> Software Engineer, Data (Product Integration) </h3><div><div>Doximity is transforming the healthcare industry. Our mission is to help doctors be more productive, informed, and connected. As a software engineer focused on our data stack, you'll work within cross-functional delivery teams alongside other engineers, designers, and product managers in building software to help improve healthcare.&nbsp;<br><br></div><div>Our <a href='https://www.doximity.com/about/company#theteam' rel='nofollow'>team </a>brings a diverse set of technical and cultural backgrounds and we like to think pragmatically in choosing the tools most appropriate for the job at hand. &nbsp;</div><div><strong><br>About Us</strong>&nbsp;</div><ul><li>We rely heavily on Python, Airflow, Spark, MySQL and Snowflake for most of our data pipelines</li><li>We have over 350 private repositories in Github containing our pipelines, our own internal multi-functional tools, and<a href='https://github.com/doximity' rel='nofollow'> open-source projects</a></li><li>We have worked as a distributed team for a long time;<a href='https://blog.brunomiranda.com/building-a-distributed-engineering-team-85d281b9b1c' rel='nofollow'> we're currently about 65% distributed</a></li><li>Find out more information on the<a href='https://engineering.doximity.com/' rel='nofollow'> Doximity engineering blog</a></li><li>Our<a href='https://work.doximity.com/' rel='nofollow'> company core values</a></li><li>Our<a href='https://engineering.doximity.com/articles/engineering-recruitment-process-doximity' rel='nofollow'> recruiting process</a></li><li>Our<a href='https://engineering.doximity.com/articles/mofo-driven-product-development' rel='nofollow'> product development cycle</a></li><li>Our<a href='https://engineering.doximity.com/articles/software-engineering-on-boarding-at-doximity' rel='nofollow'> on-boarding &amp; mentorship process</a></li></ul><div><strong><br>Here's How You Will Make an Impact</strong>&nbsp;</div><ul><li>Collaborate with product managers, data analysts, and data scientists to develop pipelines and ETL tasks in order to facilitate the extraction of insights from data.</li><li>Build, maintain, and scale data pipelines that empower Doximity’s products.</li><li>Establish data architecture processes and practices that can be scheduled, automated, replicated and serve as standards for other teams to leverage.&nbsp;</li><li>Spearhead, plan, and carry out the implementation of solutions while self-managing.</li></ul><div><strong><br>About you</strong>&nbsp;</div><ul><li>You have at least three years of professional experience developing data processing, enrichment, transformation, and integration solutions</li><li>You are fluent in Python, an expert in SQL, and can script your way around Linux systems with bash</li><li>You are no stranger to data warehousing and designing data models</li><li>Bonus: You have experience building data pipelines with Apache Spark in a multi-database ecosystem</li><li>You are foremost an engineer, making you passionate for high code quality, automated testing, and other engineering best practices</li><li>You have the ability to self-manage, prioritize, and deliver functional solutions</li><li>You possess advanced knowledge of Unix, Git, and AWS tooling</li><li>You agree that concise and effective written and verbal communication is a must for a successful team</li><li>You are able to maintain a minimum of 5 hours overlap with 9:30 to 5:30 PM Pacific time</li><li>You can dedicate about 18 days per year for travel to company events</li></ul><div><strong><br>Benefits</strong>&nbsp;</div><ul><li>Doximity has industry leading benefits. For an updated list, see our<a href='https://work.doximity.com/' rel='nofollow'> career page</a></li></ul><div><strong><br>More info on Doximity</strong>&nbsp;</div><div>&nbsp;</div><div>We’re thrilled to be named the<a href='http://www.prnewswire.com/news-releases/doximity-is-fastest-growing-company-in-bay-area-per-deloittes-2016-technology-fast-500-300367390.html' rel='nofollow'> Fastest Growing Company in the Bay Area,</a> and one of<a href='https://www.fastcompany.com/most-innovative-companies/2018/sectors/social-media' rel='nofollow'> Fast Company’s Most Innovative Companies</a>. Joining Doximity means being part of an incredibly talented and humble team. We work on amazing products that over 70% of US doctors (and over one million healthcare professionals) use to make their busy lives a little easier. We’re driven by the goal of improving inefficiencies in our $3.5 trillion U.S. healthcare system and love creating technology that has a real, meaningful impact on people’s lives. To learn more about our team, culture, and users, check out our<a href='https://workat.doximity.com/' rel='nofollow'> careers page</a>,<a href='https://blog.doximity.com/' rel='nofollow'> company blog</a>, and<a href='https://engineering.doximity.com/' rel='nofollow'> engineering blog</a>. We’re growing steadily, and there’s plenty of opportunities for you to make an impact.&nbsp;<br><br></div><div><em><br>Doximity is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.&nbsp;<br></em><br></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "J8FmPuwXRg-yhBzYNDEcLg",
    "url": "https://remote.co/job/senior-tag-implementation-specialist/",
    "title": "Senior Tag Implementation Specialist",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=4, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=2, java=1, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/mobile",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Hilton",
      "sameAs": "https://www.hilton.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 28, 2019 6:37:59 PM",
    "validThrough": "Sep 4, 2019 6:37:59 PM",
    "crawled": "Aug 28, 2019 7:31:18 PM",
    "content": "<h3>Senior Tag Implementation Specialist at <span>Hilton</span></h3><div><span><i></i> Remote</span>        </div><div>            <p><strong>Hilton Corporate</strong></p><p><strong>Job Summary</strong></p><p><strong>This position is remote based</strong></p><p>Hilton is creating a best-in-class data &amp; analytics department that will lead a connected ecosystem of data, technology, tools, techniques, people and processes. This innovative data &amp; analytics function will drive advanced analytics and actionable insights to help drive Hilton’s performance.</p><p><strong>What will I be doing?</strong></p><p>The Senior Tag Implementation Specialist will be an integral part of a large corporate Digital Analytics organization where data is at the forefront of its business success. You will be responsible for implementing Adobe’s digital analytics, marketing, and functional pixels via Adobe DTM/Launch for company websites and mobile applications (iOS and Android).</p><p><strong>More specifically, you will:</strong></p><ul><li>Manage the implementation and maintenance of client-side data collection and marketing tools using the company tag management solution (Adobe DTM/Launch)</li><li>Oversee, build, and maintain JavaScript within Adobe DTM/Launch including QA and UAT activities</li><li>Execute tag audits using ObservePoint to verify stability and accuracy of client-side data collection and marketing integrations and support organizational governance activities related to tag management</li><li>Update and/or migrate Tag Management software based on business requirements</li><li>Maintain robust documentation regarding the tag management architecture</li><li>Work with the Digital Analytics &amp; Marketing Architecture team to decipher business analytics requirements and deliver implementations which meet those requirements</li></ul><p><strong>What are we looking for?</strong></p><p><strong>We believe success in this role will demonstrate itself through the following attributes and skills:</strong></p><ul><li>Collaborative and interpersonal teammates, who build dynamic and positive relationships, exhibit tact and earn trust</li><li>Strong communicators, both verbally and in writing, who effectively communicate along various business channels and IT partners</li><li>Flexible and creative in finding solutions for hard problems and work well under pressure</li><li>Self-starters, who take initiative in leading goals, utilize analytical skills and possess adaptability to change</li><li>Accountable and focused individuals, who effectively communicate results and recommend improvements</li><li>Respectful teammates, who possess a good work ethic and high degree of integrity</li></ul><p><strong>To fulfill this role successfully, you must possess the following minimum qualifications and experience:</strong></p><ul><li>Three (3) years of experience implementing analytics via Adobe DTM/Launch for websites/mobile applications (tag implementation / tag migration)</li><li>JavaScript knowledge</li><li>Experience implementing tags within single-page app applications</li><li>Experience testing in multiple web/mobile environments to validate Tag Management Solutions (TMS) accuracy</li></ul><p><strong>It would be advantageous in this position for you to demonstrate the following capabilities and distinctions:</strong></p><ul><li>Five (5) years of experience implementing analytics via Adobe DTM/Launch for websites/mobile applications (tag implementation / tag migration)</li><li>Experience with ObservePoint</li><li>Experience with JIRA</li></ul><p><strong>What will it be like to work for Hilton?</strong></p><p>Hilton is the leading global hospitality company, spanning the lodging sector from luxurious full-service hotels and resorts to extended-stay suites and mid-priced hotels. For nearly a century, Hilton has offered business and leisure travelers the finest in accommodations, service, amenities and value. Hilton is dedicated to continuing its tradition of providing exceptional guest experiences across its global brands. Our vision to fill the earth with the light and warmth of hospitality unites us as a team to create remarkable hospitality experiences around the world every day. And, our amazing Team Members are at the heart of it all!</p><p>EOE/AA/Disabled/Veterans</p>        </div><div>        <a href='https://jobs.hilton.com/job/Senior-Tag-Implementation-Specialist/J3M7NG69XL1BL78538J' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "9a_n3Yu-Qf6G-z8hgO9LUA",
    "url": "https://jobmote.com/job/65004/implementation-coordinator-hl7-emr-100-remote/",
    "title": "Implementation Coordinator - HL7-EMR 100% Remote",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``from 4W your 2W home",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Ciber Global, LLC",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 25, 2019 10:07:29 PM",
    "validThrough": "Aug 28, 2019 10:07:29 PM",
    "crawled": "Aug 26, 2019 3:06:25 AM",
    "content": "<div><b><br></b><br><br><b> Live IT Up at Ciber Global </b><br><br>?<br><br>At Ciber Global, we believe the most inspired, innovative and industrious companies should win, regardless of size or legacy. We?re the small company that cares and the big company that can. We deliver breakthrough performances and powerful solutions that are anything but cookie cutter in order to give our clients the competitive advantage they deserve.<br><br>?<br><br><b> Work. </b><br><br><b> Are you looking for an opportunity that is 100% Remote from your home?? Are excellent benefits important to you?? If so, please keep reading, this could be that opportunity! </b><br><br>?<br><br><b>Purpose of Position:</b><ul><li>This position is responsible for the implementation and support of interfaces between Client?s systems and customer systems.</li></ul><b>This position requires previous experience with implementing applications and verifying HL7 messages are in compliance with HL7 Standards</b><br><br><b>Job Responsibilities :</b><ul><li><b>Performs and facilitates testing and support, provide overall project leadership to ensure hospital and Physician client interfaces conform to the client?s HL7 standards</b>.</li><li>Responsible for multiple implementations or conversion projects.</li><li>Participates for information gathering for interface requirements</li><li>Educates and directly interacts with the client to help them understand the benefits and limitations of their specific EMR/LIS-Interface during implementation.</li><li>Provides direct interaction with client and client?s vendor ?Designs and oversees interface implementation project plan.</li><li>Responsible for providing project status updates.</li><li>Will provide communications such as go-live notices, support documentation and operational checklists to our internal organization relative to any new or change to existing client interface.</li><li>Implementation of communication scripts and protocols to include VPN and frame and web services.</li><li>Provides 3rd tier support (as defined in the Support SOP) to EMR/LIS-Interface related problems.</li><li>Provides post implementation support</li><li>Responsible for escalating implementation and support issues to appropriate persons or groups for resolution.</li><li>Meets productivity requirements for this position</li><li>Other duties as assigned</li></ul><b>Working Conditions:</b><ul><li>Office Environment.</li><li>Home Office Environment.</li><li>This position may require some travel. Less than 10%</li></ul><b>Occupational Exposure:</b><ul><li>Subjected to limited amounts when working with technical users.</li><li>Physical Demands:</li><li>Typical and mixed amounts of standing, walking, and sitting.???</li><li>Heavy lifting is not expected.</li></ul><b>Education:?????</b><ul><li>College degree desirable or equivalent experience.</li></ul><b>Experience:</b><br><br>Required 2-5 years? experience in medical lab operations and/or IT functions.<ul><li>Experience in Hospital LIS system is ideal (Meditech, Cerner, Epic, etc)</li><li>Exposure to clinical healthcare environment.</li><li>Working knowledge of testing life cycle, including accessioning, resulting, and report compare.</li><li>Ability to manage projects with little or no supervision.</li><li>Excellent written and verbal communications skills.</li><li>Strong customer service skills.</li><li>Strong problem solving and analytical skills.</li><li>Strong organizational skills and ability to multitask.</li><li>Ability to understand HL7 standards and previous experience with message structure.</li><li>Proficiency in working with Microsoft office suite.??Must be familiar with Excel, Outlook, and MS Project. Familiarity with Access a plus.</li><li>Familiarity with a commercial Integration Engine Product a plus, including Cloverleaf and Rhapsody.</li></ul>Must be familiar with HL7 Standards<br><br>Solid Project Coordination skills<br><br>Excellent Customer Service phone skills<br><br>Excellent ability to multitask<br><br>Word<br><br>Excel<br><br>Powerpoint<br></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "facqSt79TVCLi9C6H-pKQg",
    "url": "https://jobmote.com/job/64926/100-remote-build-engineer/",
    "title": "100% remote Build Engineer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:bash/other/1",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=1, dotnet=0, c=0, mobile=1, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/python",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java",
      "python"
    ],
    "hiringOrganization": {
      "name": "TEKsystems, Inc",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2019 10:07:31 PM",
    "validThrough": "Aug 27, 2019 10:07:31 PM",
    "crawled": "Aug 25, 2019 3:06:24 AM",
    "content": "<div>100% remote DevOps Engineer<br><br>General Reqs:<br>* Git<br>* Bitbucket (Source Control)<br>* VSTS/Azure DevOps (Source Control)<br>* Build Orchestration Software e.g.:<br>o Bitbucket Pipelines<br>o Jenkins<br>o TeamCity<br>o Azure DevOps<br>o etc.<br>* Proficiency in a typical build automation scripting language i.e. Python, Bash, Javascript, PowerShell, Java, etc.<br><br>They are implementing Sitecore and Salesforce on cloud VM's using continuous delivery and continuous integration.<br><br><b>About TEKsystems:</b><br><b>We're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company.</b><br><br><b>The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.</b><br><br><b>If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please call -3411 or email .com for other accommodation options.</b><br></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "MBTnuOK4RAi9W1Ij0Wjz_Q",
    "url": "https://jobmote.com/job/64840/integration-engineer-remote/",
    "title": "Integration Engineer (Remote)",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "&quot;Confidential&quot;",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 23, 2019 10:07:37 PM",
    "validThrough": "Aug 26, 2019 10:07:37 PM",
    "crawled": "Aug 24, 2019 3:06:24 AM",
    "content": "<div>Position Details:Our team is looking to expand and add an Integration Engineer to support upcoming projects. This position is fully remote. You will work from your preferred location, however, your work schedule will be based on Eastern time. This is a contract role at 40 hours per week.<br>Responsibilities:<br>Under minimal supervision, you will be working closely with our clients to understand their technical needs. You will then work towards the design, implementation, and testing of client integrations to work with our system. The ideal candidate will also be comfortable being the point of contact for existing integrations, providing services such as technical support, documentation creation, and troubleshooting.<br>Skills Required:<br>JavaSpringApache CamelFluent English<br>Skills Desired:<br>.NetNode.JsSQL<br>Experience: 3-5 years as an Integration Engineer or similar role.</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "x49dqNSQSW6GEPc1hoz71g",
    "url": "https://jobmote.com/job/64830/remote-jenkins-build-engineer-python-jenkins/",
    "title": "Remote Jenkins Build Engineer - Python, Jenkins",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:python/python/16",
      "DBG_TECH1:k/t/w:windows/dotnet/32",
      "DBG_TECH1:techWeightMap:{python=16, other=0, dotnet=32, c=0, mobile=0, go=8, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "CyberCoders",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 23, 2019 10:07:37 PM",
    "validThrough": "Aug 26, 2019 10:07:37 PM",
    "crawled": "Aug 24, 2019 3:06:24 AM",
    "content": "<div>Minimum Required Skills:<br>Jenkins, Python, Amazon Web Services, Building / Compiling, debugging services, Linux Administration, Windows Administration, API Design, Writing / Signing Windows MSI packages, Working Remote<br><br>This position is 100% REMOTE / Work from home - required experience is Python + Jenkins while AWS, Bamboo + Security is a plus! <br><br>We are fast growing, extremely well funded and now established startup in the cloud security and data analysis space. We are backed by huge partners including significant investment by Google Ventures. <br><br>We are seeking a talented Build Engineer who is interested in pushing their boundaries and taking on a role that involves significant work in an environment that relies on extremely reliable build / release engineering. <br><br>Our team uses technologies that include Python, AWS (lots of services) and Bamboo / Jenkins for CI.<br><br>If you are a Software Engineer and you like solving problems, finding and fixing issues, improving application performance and contributing to high transaction, high availability applications and you're interested in a role that's responsible for Blue / Green Release Architecture, Continuous Integration and working with a modern open source stack that includes Python, Bamboo and Jenkins, please read on.<br><br>Top Reasons to Work with Us<br><br>- We are one of the fastest growing startups in america right now (for real)<br>- Work with modern technologies<br>- Leverage the performance, power, and scalability of modern cloud computing best practices<br>- A new product that is revolutionizing cloud data, cloud security and real time cloud processing<br>- Solve challenging problems for a platform that has incredibly high transactions and an absurd amount of data / big data and big data processing<br><br>What You Will Be Doing<br><br>- Working as part of a build team that will be working to build / release code written in Python and GoLang<br>- Working w/ Bamboo and Jenkins<br>- Participating in Blue / Green Architecture / Deployment / automated build / release and deployment engineering<br>- Work on complex Builds that communicated w/ AWS and are highly scalable<br><br>What You Need for this Position<br><br>Experience w/ the following:<br><br>- Python + Jenkins expertise is a MUST<br><br>The following are all nice to haves:<br>- Bamboo<br>- Strong knowledge of Continuous Integration<br>- AWS <br>- Windows MSI Packages<br>- Linux &amp; Windows Administration<br><br>What's In It for You<br><br>Super cool company culture - very well funded startup, proven industry executives, great company culture, bleeding edge technology stack<br>Work on extremely challenging and thought provoking problems<br>Great base salary + equity + bonus + PTO and great other benefits too!So, If you are a Build Engineer and you like solving problems, finding and fixing issues, improving application performance and contributing to high transaction, high availability applications and you're interested in a role that's responsible for Build Engineering w/ a modern open source stack that includes Python, Bamboo and Jenkins, please apply!<br><br>Applicants must be authorized to work in the U.S.Please apply directly to by clicking 'Click Here to Apply' with your Word resume!<br><br>Looking forward to receiving your resume and going over the position in more detail with you.<br><br>- Not a fit for this position? Click the link at the bottom of this email to search all of our open positions.<br><br>Looking forward to receiving your resume!<br><br>CyberCoders<br><br>CyberCoders, Inc is proud to be an Equal Opportunity Employer<br><br>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br>Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.<br><br>Copyright 1999 - 2019 . CyberCoders, Inc. All rights reserved.<br> - provided by Dice</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "l5m3LLcIS4m6t08kKQqjjw",
    "url": "https://jobmote.com/job/64504/100-remote-build-engineer/",
    "title": "100% remote Build Engineer",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:bash/other/1",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=1, dotnet=0, c=0, mobile=1, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/python",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java",
      "python"
    ],
    "hiringOrganization": {
      "name": "TEKsystems, Inc",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2019 10:07:32 PM",
    "validThrough": "Aug 25, 2019 10:07:32 PM",
    "crawled": "Aug 23, 2019 3:06:27 AM",
    "content": "<div>100% remote DevOps Engineer<br><br>General Reqs:<br>* Git<br>* Bitbucket (Source Control)<br>* VSTS/Azure DevOps (Source Control)<br>* Build Orchestration Software e.g.:<br>o Bitbucket Pipelines<br>o Jenkins<br>o TeamCity<br>o Azure DevOps<br>o etc.<br>* Proficiency in a typical build automation scripting language i.e. Python, Bash, Javascript, PowerShell, Java, etc.<br><br>They are implementing Sitecore and Salesforce on cloud VM's using continuous delivery and continuous integration.<br><br><b>About TEKsystems:</b><br><b>We're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company.</b><br><br><b>The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.</b><br><br><b>If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please call -3411 or email .com for other accommodation options.</b><br></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
