{
 "items": [
  {
    "id": "pCT1lLQJQC6iIfX-kPvFvQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/64589/management-consultant-software-project-delivery-munich-germany-at-mongoose-gray/",
    "title": "Management Consultant. Software Project Delivery | Munich, Germany",
    "content": "*HOW WILL A TYPICAL DAY BE SPENT?*<br /><br />* Engaging with developers, change professionals, business analysts and project managers.<br />* Executing proof of concepts before architecting and deploying appropriate technical solutions.<br />* Using your business acumen to ensure technical implementations are fit for purpose.<br />* Designing, implementing and testing component reusability models.<br />* Supporting clients, giving demos, training, mentoring, providing consultancy services.<br />* Showcasing solutions, outlining benefits, identifying potential future business opportunities.<br /><br />*WHAT'S THE WORKING CULTURE LIKE?*<br /><br />Passionate, driven, ambitious, collaborative. Personal career journeys are firmly aligned to the corporate roadmap. Big company ambitions with a small company feel. Consultants are fiercely loyal to the company and this is borne out by a very low attrition rate.<br /><br />*WHAT'S INTERESTING ABOUT THE ROLE?*<br /><br />In many ways you will feel like your own boss. You will need to be independent, flexible and able to travel extensively throughout Europe and across the globe. The role will bring lots of autonomy including a significant opportunity for remote working.<br /><br />*WHAT ARE THE CHALLENGES?*<br /><br />If you enjoy the formal structure of a corporate environment then this is not for you. You will need be self-motivated and versatile enough to wear multiple hats i.e. consultant, project manager, business analyst, technician, mentor, adviser. You will have a network of consultants to support you in the early days but thereafter you will be expected to stand on your own two feet.<br /><br />*WHAT'S MY BACKGROUND?*<br /><br />You come from a technical hands-on development (.NET, Java, C# or similar) environment and be looking to move (or have recently moved) into a more strategic, consultative, client-facing role such as business analysis or project management.<br /><br />*PROGRESSION?*<br /><br />This is a fantastic opportunity to be part of an exciting success story and to grow with a company that has world-class ambitions. In many ways progression will be what you make it.<br /><br />*WHAT ARE THE NUMBERS?*<br /><br />Up to EUR 85,000 + excellent benefits + share options.",
    "urlFetchPending": false,
    "published": "Dec 24, 2017 1:38:09 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=13, c=2, mobile=1, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "hQjcohWoQ66P-OBMCJODwQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/cartonomy/jobs/137724-social-media-intern",
    "title": "Social Media Intern",
    "content": "<div><h2>Social Media Intern at Cartonomy</h2><div>New York City, Remote · Internship</div><div></div></div><div><div>Skills</div><div>Graphic Design, Twitter, Content Strategy, Linkedin, Content Creation, Facebook</div><div>Compensation</div><div>$1K–$5K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Cartonomy is transforming the experience of shopping online with friends and family with our next generation shopping cart tools.</p><p>We are seeking a social media intern for Summer 2016 and possibly beyond to assist in the content creation for our company pages on Twitter, Facebook, and LinkedIn.</p><p>The internship is a part-time, paid position, open to students at any U.S. university.  The position is based in NYC but remote work arrangements are possible on a per case basis.</p><p>Please refer to our website, <a href='http://www.cartonomy.com' rel='nofollow'>www.cartonomy.com</a>, for more background on Cartonomy and to read our press coverage.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 21, 2017 9:54:44 PM",
    "tags": [
      "Content Creation",
      "Content Creator",
      "Content Strategy",
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "Facebook",
      "Graphic Design",
      "Internship",
      "Linkedin",
      "New York City",
      "REMOTE1/50",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown",
      "Twitter"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "bGjPYIlyTWaFzCwAhvKJFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-consultants",
    "url": "http://workinstartups.com/job-board/job/64543/creative-manager-director-paid-in-equity-at-clikd-limited/",
    "title": "Creative Manager/ Director (paid in Equity)",
    "content": "Creative Manager <br /><br />About us<br /><br />We are an award winning dating app, www.clikapp.com who cater for creatives.  We won an award at the UK DatinG Awards for Innovation, were listed as one of the best dating apps for men 2017 in the telegraph and have enjoyed some great traction.   We are now looking for a creative director / manager to help us keep on brand cool, creative and fun. We are a startup, so we want someone who is keen to join us on this journey.<br /><br />I should say that we are fundraising at the moment, and as such have limited funds, which is why we are keen to bring someone in who is keen to enter the world of startups and wants to grow with the company, payment will be in the form of equity within the company and we will cover expenses and travel to and from the office so you are not out of pocket. However this is for someone who is looking to the future or wants to gain some experience in startups. Please check out our website – www.clikdapp.com we have an incredibly strong team and are looking for someone who can join very quickly and muck in and get involved.<br /><br /><br />Ideal experience<br /><br /><br />You’ll be entrepreneurial by nature and have experience of being a creative leader, this could be in film/ photography/ graphic design or marketing.<br />Experience of working as a photographer and have links into the photographic community would be ideal.<br />You will understand how to interact with photographers and to judge good quality photography.<br />Be creative and clever and have a quick wit, we want someone who can bring some spark to our creative department.<br />Will be able to manage others well, and be willing to manage interns, assess work and give feedback.<br />The spirit and approach of an entrepreneur with very strong commercial acumen in order to deliver real value in a small business environment<br />Strong communication skills and the ability to build strong working relationships internally and with our marketing partners<br />Ideally but not essential direct experience of the UK dating or social networking environment.<br /><br /><br />The Role<br />Will be working alongside the founder and we want someone who will work 3-5 days a week, we will consider both fulltime and part time roles depending on the candidate and their skill set we may have flexibility for someone who has another role or is consulting.<br /><br /><br />Message from the founder.<br />We have a strong team and a great product, and we are looking for someone who wants to come on this exciting journey with us. We believe this company has what it takes to become a superstar so we want to surround ourselves with people who are willing to sacrifice to be part of it. We value hard work, entrepreneurial spirit and out the box thinking mentality. There will be a whole range of jobs for you to get involved in, some fun, some not so much but you want to work in startups so this is the game.. But if this sounds like you, drop us an email and lets grab a coffee and have a chat.",
    "urlFetchPending": false,
    "published": "Dec 21, 2017 1:32:59 PM",
    "tags": [
      "DBG:surround``OR(travel,visit) W to 4W OR(offic,headquart,onsit)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "DqaaRWtRTUKHmr_Of6d5Tw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/64435/business-development-manager-at-themovecom/",
    "title": "Business Development Manager",
    "content": "TheMove.com is a pre launch prop tech startup that provides lead generation services for brokers and developers in the real estate industry. Our lead generation model is ready to disrupt a $500bn market for the better and after successful trials in three continents we are ready to build a team to launch in New York.<br /><br /><br />The Position<br /><br />We are looking for a seasoned consultative salesperson with next-level interpersonal awareness and the ability to work with the founding team in developing our business in New York City.<br /><br />As the Business Development Manager in our NYC office, you will be responsible for implementing the onboarding process for new brokers and property developers and undertaking an account management role for current clients. Whether you’re meeting with Sales Associates or Directors, you must be comfortable pitching our idea and acting as an evangelist for TheMove! <br /><br />A previous background in real-estate or the property industry is highly desirable, however not essential. <br />The role will likely involve travel across the country and occasional remote working. <br /><br /><br />Role responsibilities<br /><br />Business Development: Developing and building out our commercial proposition to both customers and real estate agents, owning the adoption and onboarding process.<br /><br />Customer Experience: Developing our customer proposition and owning the customer experience, from customer service to the sales funnel<br /><br />Operational Execution: Playing a lead role in the operational execution within your area, from corporate development (presentations, finances, legals) to our city-by-city rollout activation strategy to highly challenging operational tasks such as overseeing the management of our cutting 24/7 Virtual Assistant function. <br /><br />KPI Focused: To work alongside the Country Manager to design key performance indicators that can be implemented across the NYC market. <br /><br />Passion for working in an exciting tech-startup and willingness to go the extra mile.<br /><br />Startups are challenging, hardworking and unstructured environments – they are not for everyone!<br /><br /><br />In return you will receive:<br /><br />A chance to make a direct impact to the success of the business from day one, we have global ambitions and success will be rewarded by rapid progression<br /><br />A competitive salary DOE<br /><br />A great coworking office in Williamsburg<br /><br />Please email a CV and cover letter to recruitment@themove.com<br />Please include within the letter your earliest start date.",
    "urlFetchPending": false,
    "published": "Dec 18, 2017 10:09:08 AM",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W remot",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "eZg8B6vBQgWHlyfT4TzsvQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/enki/jobs/106424-head-coach-chief-education-officer",
    "title": "Head Coach / Chief Education Officer",
    "content": "<div><h2>Head Coach / Chief Education Officer at Enki</h2><div>San Francisco, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$50K–$100K<br>0.25%–1.0%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>We are looking for an experienced developer to join the founding team of Enki as our head of teaching. This involves being responsible for what and how we teach our users to become the best developers they can be.</p><p>Summary:</p><p>We are a fast-growing early-stage company backed by top investors and with a founder who has built two $100m+ valuation companies before.</p><p>Our mission is to organize the world's professional knowledge, and in doing so reinvent how learning and employee development is done in the workplace.</p><p>Since our launch in Q1 2016, over over 200,000 software developers have downloaded our applications. We have a clear path to building the biggest community of developers, collaborating around learning and staying ahead of the tech curve.</p><p>Requirements:</p><p>- Experience in successfully coaching software developers in some capacity;<br>- Strong communication and technical writing skills;<br>- Broad knowledge of key modern technologies and major programming languages;<br>- Entrepreneurial mindset, taking initiative and actively contributing to the product and vision;<br>- Ideally, experience in a startup environment of building and growing consumer products.</p><p>Responsibilities:</p><p>- Complete ownership of the content and curriculum on Enki, and how it fits within the product;<br>- Hiring and working with expert contributors to ensure high quality content;<br>- Active iteration of current teaching methods and content formats;<br>- Measurement and assessment of Enki's impact on the skills and carriers of our users.</p><p>Key benefits:</p><p>- Huge impact potential: changing the way millions of people learn every day. <br>- Exceptional autonomy and decision power: you will be treated like a co-founder. <br>- Unique culture of experimentation and learning to fast-track your career. <br>- Equity included, since you'll be part of the founding team. <br>- Compensation and perks in line with high-end technology companies.</p><p>Thanks for your interest! Get in touch with the CEO (<a href='mailto:kirill@enki.com' rel='nofollow'>kirill@enki.com</a>) if you'd like to find out more.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 15, 2017 11:07:46 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Full-Stack Developer",
      "REMOTE1/100",
      "Remote OK",
      "San Francisco",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Km2bEtvETiWOoH5KJIbXTg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/planetary-emissions-management/jobs/14715-maine-forest-carbon-program-manager",
    "title": "Maine Forest Carbon Program Manager",
    "content": "<div><h2>Maine Forest Carbon Program Manager at Planetary Emissions Management</h2><div>Cambridge, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$80K–$90K<br>0.25%–0.25%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div>No description available.</div>",
    "urlFetchPending": false,
    "published": "Dec 11, 2017 6:14:23 AM",
    "tags": [
      "Cambridge",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Product Manager",
      "Program Manager",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "hutE-nTsQYik8FBdLHSGBQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/ufaber/jobs/125198-head-civil-engineering-course-research-training-development-part-time-full-time-opportunity",
    "title": "Head Civil Engineering Course - Research, Training & Development - Part time & Full Time Opportunity",
    "content": "<div><h2>Head Civil Engineering Course - Research, Training &amp; Development - Part time &amp; Full Time Opportunity at uFaber</h2><div>Mumbai, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>₹800K–₹1500K<br>0.5%–1.5%</div></div><h3>Job Description</h3><div><p>KRAs</p><p>In a growth stage start-up you would be often surprised to know how much and how fast you can work. This is how your initial days might look like </p><p>1. You are required to plan, design and develop high quality video based training programs for students spread pan India, specifically for GATE - Civil Engineering.  </p><p>2. You would be involved in conducting training on - innovative ways of teaching. </p><p>3. Developed curriculum and content for the training program </p><p>4. Conduct regular assessment of students progression.</p><p>5. Mentor trainees and helped them with regular feedbacks on their online teaching. </p><p>6. Design and execute interactive sessions. </p><p>Who we are looking at </p><p>1. Your are excellent in your grasp of adult training and take pride in the depth of your knowledge and understanding </p><p>2. You love act of educating others in your skill. You have an uncanny ability to simplify and decipher even the most complex of concepts, for a complete novice. </p><p>3. You have high standards of quality and you don- t settle with &quot;just good&quot;. </p><p>5. You have the fire and desire to do something new and challenging. </p><p>6. You get bored doing the same thing and like to explore newer domains. </p><p>7. You love what you do have and are brimming with an entrepreneurial spirit</p></div>",
    "urlFetchPending": false,
    "published": "Dec 10, 2017 8:37:19 PM",
    "tags": [
      "Business Development",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Mumbai",
      "Product Manager",
      "REMOTE1/100",
      "Remote OK",
      "Software Engineer",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "_SxCKPqrR2qFWFauQSvCUQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8444-program-consultant-program-placement-team",
    "title": "Program Consultant, Program Placement Team",
    "content": "Program Consultant, Program Placement Team - Jobmote<div><div><h2>Program Consultant, Program Placement Team</h2><h5>Remote Year</h5></div></div><div><div><div><div><div><p>Remote Year</p><p>Remote Year curates communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend either 4 or 12 months together working, traveling, and exploring cities around the world. Programs spend one month in each location, connecting with local cultures and business ecosystems, while forming lifelong, personal and professional relationships along the way. Together we will shape the future of work.</p><p>Role Description</p><p>Remote Year’s Program Placement team is searching for experienced consumer sales representatives, who we call Program Consultants, to match potential participants with the right Remote Year itinerary and community. Our Program Consultants act as the face of Remote Year to our customers, they are responsible for filling each community we launch. You will readily bring your drive, empathy, and consultative sales skills to this role. Ideally, you love being coached to succeed and working with your teammates to surpass all of your goals.</p><p>Responsibilities:</p><ul><li>By deploying our sales process, best practices, systems, and deep product knowledge you lead our customers through an inclusive consultative sales process.</li><li>Build strong relationships through clear honest communication with both our customers and the Program Placement Team.</li><li>Actively collect data on your performance to grow. Using Salesforce, you track every lead in your pipeline and know immediately which leads to prioritize.</li><li>As a salesperson, you are accountable to daily, weekly, monthly, and quarterly goals.</li><li>Undergo extensive sales development and coaching to perfect your performance at any point in the conversion process.</li><li>Use all of the sales tools given to you and provide consistent feedback to your managers on process functionality.</li></ul><p>What You Bring:</p><ul><li>Minimum 1-3 years experience&nbsp;in consumer sales.</li><li>Experience with Salesforce or another CRM.</li><li>Ability to perform at a high level, in a fast pace startup work environment.</li><li>Amazing communication skills and willingness to accept constructive feedback.</li><li>A coachable and adaptable mindset.</li></ul><p>Preferred Qualification:</p><ul><li>Bachelor's degree from an accredited institution.</li><li>Experience selling with a fully distributed team.</li><li>Experience in an inbound sales environment.</li></ul></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 1:00:34 AM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "3UWpfz9fREeaEi2UxOTooA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5921-program-consultant-program-placement-team",
    "title": "Remote Year: Program Consultant, Program Placement Team",
    "content": "<div>  <div>    <h2>Program Consultant, Program Placement Team</h2>      <h4>Posted Dec  8</h4>    <h3>      <span>Remote Year</span><br>      <span>Headquarters: Worldwide</span><br>        <a href='https://remote-year.breezy.hr' rel='nofollow'>https://remote-year.breezy.hr</a>    </h3>  </div>    </div>  <div>    <div><span>Remote Year</span></div><div><br></div><div>Remote Year curates communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend either 4 or 12 months together working, traveling, and exploring cities around the world. Programs spend one month in each location, connecting with local cultures and business ecosystems, while forming lifelong, personal and professional relationships along the way. Together we will shape the future of work.</div><div><br></div><div><span>Role Description</span></div><div><br></div><div>Remote Year’s Program Placement team is searching for experienced consumer sales representatives, who we call Program Consultants, to match potential participants with the right Remote Year itinerary and community. Our Program Consultants act as the face of Remote Year to our customers, they are responsible for filling each community we launch. You will readily bring your drive, empathy, and consultative sales skills to this role. Ideally, you love being coached to succeed and working with your teammates to surpass all of your goals.</div><div><br></div><div><span>Responsibilities:</span></div><div><br></div><ul><li>By deploying our sales process, best practices, systems, and deep product knowledge you lead our customers through an inclusive consultative sales process.</li><li>Build strong relationships through clear honest communication with both our customers and the Program Placement Team.</li><li>Actively collect data on your performance to grow. Using Salesforce, you track every lead in your pipeline and know immediately which leads to prioritize.</li><li>As a salesperson, you are accountable to daily, weekly, monthly, and quarterly goals.</li><li>Undergo extensive sales development and coaching to perfect your performance at any point in the conversion process.</li><li>Use all of the sales tools given to you and provide consistent feedback to your managers on process functionality.</li></ul><div><br></div><div><span>What You Bring:</span></div><div><br></div><ul><li><span>Minimum 1-3 years experience&nbsp;</span>in consumer sales.</li><li>Experience with Salesforce or another CRM.</li><li>Ability to perform at a high level, in a fast pace startup work environment.</li><li>Amazing communication skills and willingness to accept constructive feedback.</li><li>A coachable and adaptable mindset.</li></ul><div><span></span></div><div></div><div><br></div><div><span>Preferred Qualification:</span></div><div><br></div><ul><li>Bachelor's degree from an accredited institution.</li><li>Experience selling with a fully distributed team.</li><li>Experience in an inbound sales environment.</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://remote-year.breezy.hr/p/55eb7a4be931-program-consultant-program-placement-team' rel='nofollow'>https://remote-year.breezy.hr/p/55eb7a4be931-program-consultant-program-placement-team</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 12:08:39 AM",
    "tags": [
      "DBG:surround``headquart 3N remot",
      "DBG:surround``remot 3N OR(role, employment)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "IEP1oZ3-TqC9NT8vAzL7vA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63604",
    "title": "Program Consultant, Program Placement Team",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div><span>Remote Year</span></div><div><br></div><div>Remote Year curates communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend either 4 or 12 months together working, traveling, and exploring cities around the world. Programs spend one month in each location, connecting with local cultures and business ecosystems, while forming lifelong, personal and professional relationships along the way. Together we will shape the future of work.</div><div><br></div><div><span>Role Description</span></div><div><br></div><div>Remote Year’s Program Placement team is searching for experienced consumer sales representatives, who we call Program Consultants, to match potential participants with the right Remote Year itinerary and community. Our Program Consultants act as the face of Remote Year to our customers, they are responsible for filling each community we launch. You will readily bring your drive, empathy, and consultative sales skills to this role. Ideally, you love being coached to succeed and working with your teammates to surpass all of your goals.</div><div><br></div><div><span>Responsibilities:</span></div><div><br></div><ul><li>By deploying our sales process, best practices, systems, and deep product knowledge you lead our customers through an inclusive consultative sales process.</li><li>Build strong relationships through clear honest communication with both our customers and the Program Placement Team.</li><li>Actively collect data on your performance to grow. Using Salesforce, you track every lead in your pipeline and know immediately which leads to prioritize.</li><li>As a salesperson, you are accountable to daily, weekly, monthly, and quarterly goals.</li><li>Undergo extensive sales development and coaching to perfect your performance at any point in the conversion process.</li><li>Use all of the sales tools given to you and provide consistent feedback to your managers on process functionality.</li></ul><div><br></div><div><span>What You Bring:</span></div><div><br></div><ul><li><span>Minimum 1-3 years experience&nbsp;</span>in consumer sales.</li><li>Experience with Salesforce or another CRM.</li><li>Ability to perform at a high level, in a fast pace startup work environment.</li><li>Amazing communication skills and willingness to accept constructive feedback.</li><li>A coachable and adaptable mindset.</li></ul><div><span></span></div><div></div><div><br></div><div><span>Preferred Qualification:</span></div><div><br></div><ul><li>Bachelor's degree from an accredited institution.</li><li>Experience selling with a fully distributed team.</li><li>Experience in an inbound sales environment.</li></ul><p><strong>To apply:</strong> <a href='https://remote-year.breezy.hr/p/55eb7a4be931-program-consultant-program-placement-team' rel='nofollow'>https://remote-year.breezy.hr/p/55eb7a4be931-program-consultant-program-placement-team</a></p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 9, 2017 12:08:39 AM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "hdpIXi4ZQj-2gQsAsG-GtA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63599",
    "title": "Product Development Manager",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>We are seeking a veteran, process-oriented Product Manager to become a key member of our product leadership team. Working with existing product team, you will help act as the interface between a globally dispersed team of developers, QA professionals and members of a remote, sales-driven organization. <br><br>You will be responsible for balancing needs between infrastructure and product development requirements. You will work with stakeholders and product team members to collect, understand, and translate the business needs of our internal and external clients into technical language for your development team. You will share ownership over the product roadmap and be responsible for forecasting and maintaining on-time delivery of roadmap items. <br><br>You will work with a team that is charged with helping to increase the profitability of existing products and to develop new products for the company. You will build products from existing ideas, and help to develop new ideas based on your industry experience and your contact with customers, prospects, and internal clients. You must possess a unique blend of business and technical savvy; have big-picture vision, and the drive to make that vision a reality. You must enjoy spending time in the market to understand its problems and find innovative solutions. <br><br>You must be able to communicate efficiently and effectively up, down, and laterally within and without our organization. You will work with an engineering counterpart to define product release requirements and with the company marketing team to define the go-to-market strategy, and help them understand the product positioning, key benefits, and target customers. You will also serve as the internal and external evangelist for your product offering, often working with the sales team and key customers/partners.<br>Responsibilities:<br><br>Gain a deep understanding of customer experience to identify and fill product gaps<br>Generate new ideas that grow market share, improve customer experience, and drive growth<br>Work with all stakeholders to prioritize and define features and tasks, aligned with strategic initiatives and business drivers<br>Evaluate competitor and technology landscape and identify niche opportunities that leverage our product line’s strengths and other weaknesses<br>Assess market competition by comparing the company's product to competitors' products.<br>Provide information for management by preparing short-term and long-term product success forecasts, special reports and analyses, and answer questions and requests.<br>Drive a solution set across development teams (primarily Development/Engineering and Marketing) through market requirements, product contracts, and positioning.<br>Propel product launches forward by working with the public relations team, executives, and other members of the management team <br>Translate product strategy into detailed requirements<br>Identify and provide solutions for unique client requirements without completely diverging from the roadmap and product vision<br>Brainstorm with the management team and contribute to the creation and maintenance of a product-line strategy and roadmap<br>Work closely with engineering teams to deliver quick time-to-market solutions<br><br>Skills and Experience<br>6+ years of Product Management/Project Management experience<br>Experience in a technology driven product environment, preferably SaaS product, B2B or B2C<br>Experience building SaSS based business models within the product; onboarding, billing, plan management, etc.<br>Technology background in SQL and Ruby on Rails<br>Experience working with API’s and integrating with third party API’s<br>Able to quickly learn new technological environments and keep updated on industry trends<br>Experience working with remote teams – a plus<br>Proven track record of managing all aspects of a successful product throughout its lifecycle<br>Proven ability to align/develop product and marketing strategies and effectively communicate recommendations to executive management<br>Strong problem solving skills<br>Excellent written and verbal communication skills<br>Product management experience in a SaaS, cloud, or marketing software environment<br>Clear and precise communications skills, and ability to work with remotely distributed teams<br>Solid technical background with understanding and/or hands-on experience in software development and web technologies<br>BS/BA required in Computer Science or a related technical field, MBA a plus<br>Strong background in analyzing multiple data sets, demonstrating the ability to understand key performance drivers and ability to execute against findings<br>Strong technical architectural understanding of mobile and web products <br>Must have experience working with design and engineering teams to deliver end to end products<br>Strong understanding of UX best practices and ability to craft well thought out wireframes to communicate ideas effectively to development team as well as stakeholders.<br>A team-player attitude with willingness to get all hands on deck and roll up sleeves to achieve the best result<br><br><br><br><br><br></p></span></td><td></td><td></td><td><a href='mailto:cljobs%40regroup.com?subject=Application%20for%20Product%20Development%20Manager%20at%20Regroup&amp;body=Hi%21%0A%0AI%27d%20like%20to%20apply%20for%20your%20position%20for%20a%20Product%20Development%20Manager%20at%20Regroup' rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Dec 8, 2017 10:49:21 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:sass/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=10, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/50",
      "TECH1/ruby",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "ruby"
    ]
  },
  {
    "id": "eLCyNK0JS1-FEOo7H2xHdg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122197-general-manager-seattle",
    "title": "General Manager - Seattle",
    "content": "<div><h2>General Manager - Seattle at Forkable</h2><div>Seattle, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Attorney",
      "DBG:surround``fulltim 4N remot",
      "Finance/Accounting",
      "Full Time",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "Seattle",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "T1aneWsWTwWo16CyNIXMGg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122194-general-manager-los-angeles",
    "title": "General Manager - Los Angeles",
    "content": "<div><h2>General Manager - Los Angeles at Forkable</h2><div>Los Angeles, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Attorney",
      "DBG:surround``fulltim 4N remot",
      "Finance/Accounting",
      "Full Time",
      "Los Angeles",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "nuf75n5pROOCCv9pPT7JKw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122196-general-manager-chicago",
    "title": "General Manager - Chicago",
    "content": "<div><h2>General Manager - Chicago at Forkable</h2><div>Chicago, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Attorney",
      "Chicago",
      "DBG:surround``fulltim 4N remot",
      "Finance/Accounting",
      "Full Time",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "2Cu_IHBAR7W5I_O3hIFxIw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122195-general-manager-boston",
    "title": "General Manager - Boston",
    "content": "<div><h2>General Manager - Boston at Forkable</h2><div>Boston, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Attorney",
      "Boston",
      "DBG:surround``fulltim 4N remot",
      "Finance/Accounting",
      "Full Time",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Z71GxSjfSOSSvNjDcX6XGw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122193-general-manager-new-york-city",
    "title": "General Manager - New York City",
    "content": "<div><h2>General Manager - New York City at Forkable</h2><div>New York City, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Attorney",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "New York City",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown",
      "User Researcher"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "pASIBiOAT8a_lrpe9qLKtQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122198-general-manager-denver",
    "title": "General Manager - Denver",
    "content": "<div><h2>General Manager - Denver at Forkable</h2><div>Denver, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Denver",
      "Full Time",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "1_pPOMX_THqddLMMf6vI_A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122199-general-manager-washington-d-c",
    "title": "General Manager - Washington D.C.",
    "content": "<div><h2>General Manager - Washington D.C. at Forkable</h2><div>Washington DC, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:20:30 PM",
    "tags": [
      "Attorney",
      "DBG:surround``fulltim 4N remot",
      "Finance/Accounting",
      "Full Time",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown",
      "Washington DC"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Bzphrf9ORaKeOBlYz-w3Rg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/lobster/jobs/55654-head-of-sales-agency-growth",
    "title": "Head of Sales & Agency Growth",
    "content": "<div><h2>Head of Sales &amp; Agency Growth at Lobster</h2><div>London, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Business Development, Digital Media, Social Media, Networking, Sales, Ad Agency, Sales Strategy and Management, Social Media Marketing, Advertising, Twitter, Sales and Marketing, Communication Skills, Revenue Growth, Blogger Relations, Knowledge Management, Subscription Models, Agency Management, Growth Hacking, Love for Creativity, Account Management, Fluent in English</div><div>Compensation</div><div>£24K–£40K<br>1.0%–3.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>This is a business development role working with the digital media agency &amp; publishers industry. Meaning you need to talk great and write great, and most importantly, make agencies, media and publishers subscribe for Lobster.</p><p>Lobster is looking for a person experienced in working with (or better off within!) digital media, advertising agencies and creatives of all sorts. This is a very important role for us great dedication and a share option in the company, it is almost a co-founder role.</p><p>We have developed an outstanding tool for the agencies and publishers to find exactly right social media visual content and license it for work from the authors. Now we are turning it into the whole world’s honest place to access real people’s content and it’s your turn to come on stage and reach all the agencies that need it.</p><p>Launched on TechCrunch Disrupt Battlefield Europe 2014, Graduate of Wayra UK accelerator 2014, raised £1m in 2017, reached 6 million photos and videos immediately available with the help of AI, first great agency subscribers and brands – waiting for you to grow the global customer side!</p><p>We can only consider people in London and settled in the UK to join the team at this time, even though you may be in office only occasionally.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 6, 2017 9:02:48 PM",
    "tags": [
      "Ad Agency",
      "Advertising",
      "Business Development",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=2, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "Digital Media",
      "Full Time",
      "Growth Hacker",
      "London",
      "Networking",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Sales Strategy and Management",
      "Social Media",
      "Social Media Marketing",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown",
      "Twitter"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "QOch3ieeQcWH3BTrN6ftyQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/novanet/jobs/102569-business-development-manager",
    "title": "Business Development Manager",
    "content": "<div><h2>Business Development Manager at Novanet</h2><div>Mumbai, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Sales, Lead Generation, Consultative Selling, Technology Selling</div><div>Compensation</div><div>₹300K–₹500K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Novanet is seeking full-time business development professionals for its domestic and international sales organisation in five cities i.e. Mumbai, Bangalore, Hyderabad, Delhi and Chennai.</p><p>Sales at Novanet is about consistently meeting customer requirements. We firmly believe in enriching customer experience by ensuring the quick deployment and easy-adoption of our products. The team is responsible for establishing and nurturing customer relationships.</p><p>PREFERRED WORK EXPERIENCE</p><p>0-2 Years</p><p>KEY RESPONSIBILITIES</p><p>- You will be responsible for finding out key contacts from your region, networking and initiating dialogues with seasoned IT professionals. </p><p>- As a sales professional, you will be expected to conduct meetings with such decision makers and generate interest by providing value propositions for our amazing product lineup. </p><p>-Your role as an account executive will extend to customer success management as well. You will be involved in various cross-sell/up-sell opportunities and ensure timely collection of revenue.</p><p>-You will get to work closely with the Marketing Team to define lead generation campaigns, customer profiling and market surveys.</p><p>WHY NOVANET SALES?</p><p>- Novanet has an amazing incentive structure that makes sure that you collect your incentives as long the customer generates revenue for Novanet.</p><p>- We place no restriction targeting potential customers across the globe.</p><p>- We offer an above-average industry standard compensation and domestic/international travel opportunities.</p><p>WHAT DO YOU NEED?</p><p>- Although, a passion for sales overcomes every educational qualification, but for academic purposes we will be accepting graduates with 0-2 yrs experience.</p><p>- Candidates with technical background or interest in latest technologies shall also be preferred</p><p>- Excellent communication and inter-personal Skills.</p><p>- Having personal conveyance is encouraged for intra-city travelling.</p></div>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 10:17:54 PM",
    "tags": [
      "BD Manager",
      "Business Development",
      "Consultative Selling",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Lead Generation",
      "Mumbai",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown",
      "Technology Selling"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "pNpVS33_QAKRbAtpftGt2g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15851570",
    "title": "ZDEV | London, UK | Full-time, Remote | Engineer / Manager | $80-130k",
    "content": "<div>                  <span>ZDEV | London, UK | Full-time, Remote | Engineer / Manager | $80-130k<p>We're a startup software consultancy / agency that trains people to code and puts them to work building high-quality software (apps and websites). Our stack is Javascript / React / React-Native.</p><p>We're looking for someone who's a solid engineer to come onboard and look after a team of junior developers and help manage their projects (speaking to clients, estimating timelines, helping them with technical challenges).</p><p>You need to have a good timezone overlap with London.</p><p>Please read our blog post for more info:</p><p><a href='https://medium.com/zdev-engineering/help-us-teach-people-to-code-7cc75cd5ed44' rel='nofollow'>https://medium.com/zdev-engineering/help-us-teach-people-to-...</a><span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 3:35:05 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=9}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "RGiubWb5RliASC5bIZcuYg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15851169",
    "title": "Head of Digital Product | NewsNow.co.uk | London, UK | Full-time, permanent Designer/Developer | NewsNow.co.uk | London, UK | Full-time, permanent Web Developers / Full ...",
    "content": "<div>                  <span>Head of Digital Product | NewsNow.co.uk | London, UK  | Full-time, permanentDesigner/Developer | NewsNow.co.uk | London, UK  | Full-time, permanentWeb Developers / Full Stack Developers / News Algorithm Developers / Back End Software Engineers | NewsNow.co.uk | 100% remote (UK residents only) | Full-time, permanent<p>We are a top ten UK media publisher, with a website loved by millions: a technology company at heart with industry-leading success metrics propelled by a highly experienced multi-disciplinary engineering team that can afford to run lean. Which means today, we offer all the excitement and agility of a start-up, but with the stability and benefits of an established business — we’re still a company where everyone gets to make a massive impact!</p><p>Our mission: to democratise and disrupt the market for news. Today, we have major plans for growth, both here in the UK and abroad, and to create even more social capital out of what has been an extremely successful platform: through increased editorial direction, curating credible but independent journalism, as well as through computational approaches to identifying the best news to show our users.</p><p>We currently have these opportunities:</p><p>- As a /Head of Digital Product/, you’ll take over from our CEO in keeping all our development efforts incredibly well organised and delivering the vision. You’ll grasp our strategic vision, consult with stakeholders to prioritise and specify desired developments, and co-ordinate the work of our agile development team to balance our editorial, development and commercial goals and deliver them with maximum efficiency.</p><p>- As a /Designer/Developer/, you’ll be responsible for designing all aspects of the website UI and brand, and work closely with Head of Digital Product and senior management on the biggest redesign of our homepage in 20 years. You will be working with Adobe Creative Suite, JavaScript, CSS3, SASS, HTML5, Responsive Web Design, progressive enhancement and feature detection.</p><p>- As a /Fully Remote Web Developer/, you’ll write the logic that drives the UI, and integrate new UI with back-end data. You’ll also work on a wide array of other UI/UX, SEO, and content integration challenges.</p><p>- As a /Fully Remote Full Stack Developer/, you’ll be expected to contribute authoritatively towards product development projects throughout the entire software stack: from database and infrastructure installation and configuration, through writing business logic and prototyping website presentation, to developing our bespoke programmatic advertising technologies.</p><p>- As a /Fully Remote News Algorithm Developer/, you’ll develop automated curation algorithms that will produce the content for a new homepage format.</p><p>- As a /Fully Remote Back End Software Engineer/, your projects will largely be server-side. You will bring a sophisticated approach to problem solving, finding ways to achieve objectives while addressing scalability challenges and security concerns.</p><p>All London positions are based at our centrally-located head office.All fully remote roles are open to UK residents only.</p><p>If you think you’re a fit for any of these roles, please apply online. <a href='http://www.NewsNow.co.uk/careers/' rel='nofollow'>http://www.NewsNow.co.uk/careers/</a><span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Dec 5, 2017 2:00:07 PM",
    "tags": [
      "DBG:surround``2W(100, remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:feature-detection/bigdata-ml/8",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:sass/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=11}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "frontend"
    ]
  },
  {
    "id": "6NpA4CN3RKu3YjNxU5eUNw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/lingo-live/jobs/135680-head-of-strategic-accounts",
    "title": "Head of Strategic Accounts",
    "content": "<div><h2>Head of Strategic Accounts at Lingo Live</h2><div>San Francisco, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$120K–$200K<br>0.0%–0.2%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Develop relationships and close deals with some of the most innovative companies in the world. The Head of Strategic Accounts is a critical team member that will help drive new customer acquisition targeting named accounts with seven-figure annual revenue potential. Out of 100 target accounts, we already have 9 as customers with an average ACV of $550k. You'll be helping us go after the rest and will be rewarded handsomely for your success in doing so ;) </p><p>In this role, you would be working closely with our CEO as well as our Marketing, Sales, and Customer Success teams. A bit about you:<br>   + You are a hustler and feed off the same energy in others;<br>   + You value relationship-building through value creation for your customers;<br>   + You can intelligently articulate our value proposition in a way that gets prospective customers to understand this problem (rather than just selling our solution as an alternative to a competitive product for a problem customers already know they have);<br>   + You are revenue-driven, and are comfortable owning a quota for new customer acquisition;<br>   + You have B2B marketing experience, ideally in an ABM capacity;<br>   + Your sweet spot is a startup that has already achieved product/market fit with an outstanding product and is seeking to scale revenue to over $10 million;<br>   + You are passionate about learning, and want to transform the way education is delivered in the 21st century;</p><p>What we can give you:<br>   + A dedicated, hungry team of 30 people that bring passion and hard work to the office every single day;<br>   + A BDR working underneath you and qualifying accounts for you to have sales discussions with;<br>   + A highly-targeted and highly-valuable niche of less than 100 named accounts with clear guidelines of success for you to build a strategy around;<br>   + Several Fortune 500 customers that fit that same niche and are strong advocates for our platform, committing to 3x contract expansions year-over-year since 2014;<br>   + Great base salary + extraordinary upside potential with uncapped commissions for exceeding growth targets;<br>   +  Full health benefits + all the other perks and benefits a VC-backed startup affords;</p></div>",
    "urlFetchPending": false,
    "published": "Dec 4, 2017 8:35:50 PM",
    "tags": [
      "DBG:surround``10W(work, offic, dai)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "Full Time",
      "REMOTE1/50",
      "Remote OK",
      "Sales",
      "San Francisco",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "A1kFe8-uSAKH_X7N2wPJUQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/64025/agile-delivery-manager-at-dm-companies/",
    "title": "Agile Delivery Manager",
    "content": "Job Title: Delivery Manager<br />Reports to: CTO<br />Hours: Full time<br />Location: Piccadilly Circus<br />Contract type: Full Time<br /><br />Job description:<br /><br />DM-Companies have an exciting opportunity to join as a Delivery Manager working within one of our emerging delivery teams.<br />As this is the start of our journey towards autonomous delivery teams you will play a big part in leading the agile delivery process and working with the team to provide them support in their agile journey.<br />You will be confident building and maintaining motivation within the team and making sure that there is an iterative plan to work towards.<br />A big part of your role will be to demonstrate how teams should collaborate, communicate and focus by actually getting your hands dirty with the team.<br />Initially taking ownership within the team to ensure that we are focused on delivering value to business you will lead the way in how the team should work and act. Overtime this ownership will be shared amongst the team creating a high performing autonomous team<br />You will be experienced at facing evolving challenges head-on, hardworking, creative and solutions focused, whilst being comfortable working in a start-up culture.<br /><br />Key Responsibilities:<br />●      Establish and own communication channels<br />●      Coordination and creation of iterative delivery plan<br />●      Maintaining a motivated team<br />●      Proactively manage risks, dependencies, obstacles and constraints<br />●      Protect the team and ensure the team are focused<br />●      Take ownership of delivery within the team<br />●      Ensure team ceremonies are in place and executed well<br />●      Own and champion agile within the team<br /><br />Personality Profile:<br />●      A confident leader of people who is able to inspire and drive the team<br />●      A friendly, positive and enthusiastic person who can work as part of a diverse team.<br />●      Strong communication skills both verbal and written<br />●      Remaining positive and approachable at all times.<br />●      Willing to take on a new intellectual challenge with a positive attitude.<br />●      Able to prioritize and meet deadlines.<br />●      Team player.<br />●      Thrives in a dynamic and rapidly changing environment.<br /><br /><br />Required Skills:<br />●        Very organised<br />●        Great communication skills<br />●        Management of development teams<br />●        Comfortable communicating with technical and non-technical colleagues<br />●        Experience and understanding of agile principles<br />●        Project Management experience of multiple projects simultaneously<br />●        Experience and understanding of agile principles<br />●        Knowledge of development process<br />●        Ability to influence key stakeholders<br /><br />Desired Skills &amp;amp; Experience:<br />●        Technical background<br />●        High traffic application experience<br />●        Coaching experience<br />●        Working with local and remote teams<br />●        JIRA Administration<br /><br />About us:<br /><br />DM-Companies is a privately owned entrepreneurial company; practicality and innovation are at the forefront of what we do.<br />Our Aim is to provide easy to use online platforms to offer useful local services. Our office in the UK is located in the heart of Soho in central London and has an exciting vibrant atmosphere. Joining us means joining a multicultural team of 18 nationalities.<br />Vivastreet is a free classifieds website with more than 35 million users monthly across 13 countries, our aim is to offer our users a simple and sociable shopping and selling experience through its extensive choice of adverts ranging from buy and sell services, properties, cars, events, pets, friendships, love and much more, all in their local area.<br />Easyroommate is the world's leading flatshare website, we have sites in 25 countries globally and 2.5 million users monthly, with our added first-class customer service team and a growing community of users, Easyroommate is the easiest way for people to rent a spare room and showcase it to an audience of millions.<br /><br />We look after everyone who works for us, in exchange for your dedication we offer:<br />•           Regular training and development programs<br />•           Social events<br />•           Company lunch every other Friday<br /><br />We are a vibrant business full of creative and passionate people who enjoy sharing ideas and working on exciting new projects.<br /><br />All candidates must be eligible to work in the UK on a permanent basis.<br /><br />Please note due to the volume of applications received for this position we are only able to contact successful candidates<br /><br />Additional Information:<br />All your information will be kept confidential according to EEO guidelines.",
    "urlFetchPending": false,
    "published": "Dec 4, 2017 3:17:03 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "r9KJtgdDTeiTKXzkfdqJ7w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/64010/head-of-engineering-at-tallysticksio/",
    "title": "Head of Engineering",
    "content": "At Tallysticks, we believe that international trade brings the global community together. We’re opening up growth for independent businesses, building trust with their trading partners and confidence in their trade potential. We’ve simplified the end-to-end trade process by creating a single online tool for documentation, communications and payments. Tallysticks reduces the effort, cost and risk of trade management for independent businesses. Our aim is to help SMEs around the world grow their business.<br /><br />What is Tallysticks?<br />Tallysticks is a solution that helps customers create, negotiate, and agree international (containerised) trade contracts with ease. The solution is comprised of two key products:<br /><br />   1) a trade book - an application enabling importers and exporters to draft and sign legally binding trade contracts<br />   2) a payments mechanism - a framework that allows buyers and sellers to confidently exchange payment in a protected manner<br /><br />We have a number of different products and applications envisaged over the coming years, but the above two are the focus for 2018.<br /><br />Head of Engineering<br />As the Head of Engineering, you will be working closely with the CTO to devise how we will execute the tech vision.<br /><br />The role:<br />You will be working with the Head of Product to manage the sprints, ensure that the backlog is being met and is understood but everyone in the engineering team. You will also work closely with the COO to manage our hiring pipeline.<br /><br />You will also be expected to think critically and intelligently about how engineering and its challenges fits into the company’s wider strategic vision and to take part in tech planning and architectural discussions.<br /><br />Successful candidate profile<br />The successful candidate will want to build a successful engineering culture with the company and should have a proven track record of delivering successful software products and growing high-performance teams.<br /><br />   - Able to intelligently assess the trade-offs with different technology choices such as databases, cloud services, languages and approaches to development<br />   - Experience of managing development teams in an agile environment<br />   - Strong prioritisation and estimation skills<br />   - Strongly familiar with cloud computing concepts (we use AWS)<br />   - Understanding of security and basic cryptography concepts<br />   - Must understand continuous delivery and its importance<br />   - Has experience of web paradigms such as Microservices, REST, WebSockets, Authentication<br />   - Able to create a winning hiring-strategy for our developers<br /><br />When does the position start?<br />We only accept the best candidates and as such are in no rush. We hope to have the right person through the door by February 2018 but we will wait for the right person.<br /><br />Application process<br />   1) Send CV and Cover Letter<br />   2) Phone Screening Interview with competency based questions<br />   3) Take-home test<br />   4) Face-to-Face interview<br /><br />Remuneration and package<br />We offer a competitive package including salary and equity. We are a meritocracy and reward good work.<br /><br />Tallysticks leadership team<br />   - CEO: ex JP-Morgan Emerging Markets Analyst, ex US Diplomat and previous SME owner<br />   - CTO: ex CTO of CarThrottle<br />   - COO: ex KPMG Machine Learning Product Manager, ex Berlin Tech Accelerator<br />   - Head of Product: ex TechStars Mentor and B2B and B2C Product Manager",
    "urlFetchPending": false,
    "published": "Dec 4, 2017 11:07:48 AM",
    "tags": [
      "DBG:surround``OR(home,remot,telecommut) 3W OR(meet, face, person)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:devise/ruby/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=10, ruby=8, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH1/ruby",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "ruby"
    ]
  },
  {
    "id": "VBuEQPXZTv6nvkaCOC3AUA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15830016",
    "title": "Origin (http://www.originprotocol.com) is a blockchain project focused on building the sharing economy without intermediaries. We're creating ...",
    "content": "<div>                  <span>Origin (<a href='http://www.originprotocol.com' rel='nofollow'>http://www.originprotocol.com</a>) is a blockchain project focused on building the sharing economy without intermediaries. We're creating protocols to allow buyers and sellers of fractional usage assets and services (think Airbnb, Getaround, Fiverr, Taskrabbit) to transact without paying middlemen 20-30%.<p>We're experienced founders who have built and sold multiple businesses in the past. Origin is the most ambitious idea we've tackled to date (hopefully on the right side of crazy).We currently have a working MVP built on Ethereum and IPFS. We're looking for all sorts of people to join our team, whether you code in react, python or solidity. We're a distributed team and open to remote.</p><p>Ping us at founders@originprotocol.com if you're interested.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Dec 2, 2017 3:00:06 PM",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "eAQHwtW7SumfXmgkT0eP3Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15824944",
    "title": "Enhance | Head of Sales, QA Lead, Software Developer | Sacramento, CA | ONSITE/REMOTE | Full Time",
    "content": "<div>                  <span>Enhance | Head of Sales, QA Lead, Software Developer | Sacramento, CA | ONSITE/REMOTE | Full Time<p>Enhance is an exciting new startup in the Mobile App space. Our tech allows mobile app developers and publishers to use third party services without having to integrate or update their code (SDKs).</p><p>We're always looking for great people to join our team (currently 17 team members). Our central office is in Sacramento, California. We're primarily a remote company.</p><p>Email us: jobs@enhance.co</p><p><a href='https://enhance.co/' rel='nofollow'>https://enhance.co/</a> | <a href='https://enhance.co/jobs' rel='nofollow'>https://enhance.co/jobs</a><span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Dec 1, 2017 6:36:09 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "W1_Ryau3TFqa96zcaKLDiw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/easy-skillz/jobs/134435-german-language-intern",
    "title": "German language intern",
    "content": "<div><h2>German language intern at Easy Skillz</h2><div>Delhi, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>German, German Native Speaker, Fluent in German, German Language</div><div>Compensation</div><div>₹60K–₹120K<br>No Equity</div></div><h3>Job Description</h3><div><p>You will learn to interact with CXOs of German Companies<br>Researching on German University programs &amp; German Companies<br>Establishing alliances with German Companies through calls and &amp; emails<br>Maintaining MIS reports</p><p>Attractive incentives</p></div>",
    "urlFetchPending": false,
    "published": "Nov 30, 2017 10:00:38 PM",
    "tags": [
      "Business Development",
      "DBG:surround``fulltim 4N remot",
      "Delhi",
      "Fluent in German",
      "Full Time",
      "German",
      "German Language",
      "German Native Speaker",
      "Marketing",
      "Marketing Manager",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "UH8S6PeoQsqozNDqdiv7BA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/ship2myid/jobs/14170-vp-ecommerce-channel",
    "title": "VP Ecommerce - Channel",
    "content": "<div><h2>VP Ecommerce - Channel at Ship2MyID</h2><div>Santa Clara, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Business Development, Sales and Marketing, E-Commerce, Channel Development</div><div>Compensation</div><div>$120K–$200K<br>0.1%–0.3%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Responsible for partnering-&nbsp;</p><p>Ecommerce Platforms<br>Shipping Platforms</p><p>Prior background in selling eCommerce Solutions is mandatory.&nbsp;</p></div>",
    "urlFetchPending": false,
    "published": "Nov 30, 2017 8:31:07 PM",
    "tags": [
      "Business Development",
      "Channel Development",
      "DBG:surround``fulltim 4N remot",
      "E-Commerce",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Sales and Marketing",
      "Santa Clara",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "gBueIQuYSzSHiFafzzDEVQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Ecm&c=Inspired&l=Remote&jk=c23775fa8695098a&rtk=1c168qlbf0kh20f7&from=rss",
    "title": "ECM / DAM Project Manager (Remote/Travel/ProfSvcs) - Inspired - Remote",
    "content": "<div><b>ECM / DAM Project Manager (Remote/Travel/ProfSvcs)</b><br><span>Inspired</span>     -<span>Remote</span>    <div>        <span>                $125,000 - $150,000 a year</span>        </div></div><span><p><b>Job Summary</b></p><p>Professional Services Division of an established technology firm is looking to add a client-facing Project Manager to their team. Position is remote but will require a good bit of travel so, if you enjoy being in front of customers and delivering cutting-edge solutions (Open Source technologies + Java, J2EE, JavaScript, MongoDB, etc.), this may be for you!! Experience with Digital Asset Mgmt Systems (DAMs), Enterprise Content Mgmt (ECM), Marketing Relationship Mgmt (MRM), or Case Mgmt (CM) solutions is a big plus.</p><p>Well-funded, 10 years of business success, established - and GROWING! - client base. This is a phenomenal opportunity to MAKE AN IMPACT, not only with client customers, but on the company itself! Bonus Plan and benefits!!</p><p>Job Type: Full-time</p><p>Salary: $125,000.00 to $150,000.00 /year</p><p>Required experience:</p><ul><li>Project Management: 10 years</li><li>Scrum: 4 years</li><li>Agile: 4 years</li><li>ECM/CMS or DAMS: 3 years</li><li>Application Development Leadership: 5 years</li></ul><p>Required license or certification:</p><ul><li>PMP</li></ul></span>",
    "urlFetchPending": false,
    "published": "Nov 29, 2017 12:55:13 AM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:java-ee/java/13",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=15, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "java"
    ]
  },
  {
    "id": "pZsgJTO_Tfq7ZkonnnnVQg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/jobs/5816-product-manager-with-project-management",
    "title": "Lean Startup Co: Product Manager with Project Management Experience (Lean Startup practitioner required)",
    "content": "<div>  <div>    <h2>Product Manager with Project Management Experience (Lean Startup practitioner required)</h2>      <h4>Posted Nov 24</h4>    <h3>      <span>Lean Startup Co</span><br>      <span>Headquarters: San Francisco, CA</span><br>        <a href='https://lean-startup-co.breezy.hr/p/a5458172dce001-product-manager-with-project-management-experience-lean-startup-practitioner-required?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/a5458172dce001-product-manager-with-project-management-experience-lean-startup-practitioner-required?source=weworkremotely</a>    </h3>  </div></div>  <div>    <div>Lean Startup Company offers the most exciting education solutions available today in modern management. We are a startup with&nbsp;<span>global brand recognition</span>&nbsp;headquartered in San Francisco, CA. We bring the entrepreneurial spirit to large organizations through cutting-edge education and modern management techniques. Lean Startup methodology provides a scientific approach and&nbsp;<span>framework for innovation,</span>&nbsp;so you can learn what your customers really want. It’s about testing your vision continuously, so you can effectively adapt and adjust before it’s too late.</div><div><br></div><div><span></span></div><div></div><div><br></div><div><span>ABOUT THE POSITION</span></div><div><br></div><div><span>We're seeking a part-time Product Manager with Project Management experience for</span>&nbsp;<a href='http://www.leanstartup.co/education' rel='nofollow'><span>The Lean Startup Co. Education Program</span></a>&nbsp;to lead the execution of an important initiative that will set the stage for an extraordinary transformation at a large, national organization.</div><div><br></div><div>In this role, your project management expertise and uncanny ability to obtain buy-in at all levels will serve you well. You’ll lead a group of subject matter experts, client stakeholders and creatives to help build and scale a program that will empower its participants to innovate and adapt to market changes using Lean Startup methodology.</div><div><br></div><div>You will make a massive impact in this initiative by leading the team towards the same objective, while managing and prioritizing resources to ensure client needs are met.</div><div></div><div></div><div><br></div><div><span>You’ll Work on Projects Like</span></div><div><br></div><ul><li>Scaling the adoption of Lean Startup methodology across a large organization</li><li>Working with subject matter experts and content creators to develop unique program training materials. Think playbooks and field guides, coach-the-coach curriculum and marketing collateral</li></ul><div></div><div><br></div><div><span>You’ll excel in (and enjoy!) this role if</span></div><div><br></div><ul><li>You have a track record of:</li><li><span>Working with Lean Startup methodology at an intermediate (required)&nbsp;</span>or higher level</li><li>Scaling a methodology (i.e. Lean Startup, Agile, Design Thinking) across a large organization</li><li>Creating a program that embeds a mindset and mechanics of a cultural shift across the organization</li><li>Coordinating, planning, executing, and tracking large scale implementation or organization change projects from beginning to end</li><li>Proactively working with stakeholders to drive initiatives forward, and ensure on time delivery of deliverables</li><li>Facilitating meetings and ensuring alignment across stakeholder groups</li><li>Demonstrating a proactive focus on meeting client and project requirements in a timely and cost effective manner</li><li>Operating under conditions of uncertainty and with minimal guidance</li><li>Maintaining accurate documentation, including timelines, budget updates, meeting notes, and timeframes</li><li>Managing competing priorities and ensuring stakeholders are clear on the path forward</li></ul><div><li>Overseeing stakeholder and team metrics dashboard data</li><li>You are an incredible communicator in virtual video meetings and in writing. People respond quickly to your email requests with the information you need.</li><li>You pride yourself on being proactive, responsive and exceptional at managing expectations.</li><li>You enjoy working collaboratively (yay, for google docs!) and thrive in a fast-paced environment where we love challenging ourselves (in Lean Startup fashion) to build, measure, and learn.</li><li>You are open to feedback, take ownership of your mistakes, and love applying your lessons learned to get 10x better.</li><li>You are familiar with remote working tools such as Slack, Zoom, Google apps</li><li>And finally, you get brownie points if you:</li></div><ul><li>Have remote work experience</li><li>Have experience working with a government client</li></ul><div></div><div><br></div><div><span>You’ll ensure the success of the initiative by</span></div><div><br></div><ul><li><em>Translating vision into execution.</em>&nbsp;You’ll ensure that the stakeholders and everyone involved is crystal clear on what the desired outcome is and you know how to get there with the resources you have available</li><li>Effectively utilizing subject matter experts and specialists to efficiently&nbsp;<em>move projects forward</em>.</li><li><em>Proactively managing people and expectations.</em>&nbsp;You’ll be awesome at ensuring that the right people are in the loop on the various stages of the project and there won’t be any surprises.</li><li><em>Being customer focused</em>. Learn the needs of the client and proactively test and advise the client on best path forward.</li><li><em>Being metrics oriented and business-driven.</em>&nbsp;Sharing your knowledge from past experience scaling programs across organizations to provide guidance on the best path forward.</li><li><em>Clearly communicating scope changes and impact</em>&nbsp;they have on budget and strategy.</li><li><em>Connecting and prioritizing</em>&nbsp;individual initiatives to the overall strategy.</li></ul><div></div><div><br></div><div><span>Why You’ll Love Working With Us</span></div><div><br></div><ul><li>We’re a 100% remote team using fun collaborative tools.</li><li>We encourage unplugging and prefer you don’t check email while you’re away.</li><li>Our clients are some of the largest companies in the world and you get a front row seat to the challenges they’re facing around innovation. Better yet, you get to help them solve their problems.</li><li>The work we do will go down in history as powerfully-transformative.</li><li>Experience the thrill and challenge of working in a fast-paced, growing startup.</li></ul><div></div><div><br></div><div>This is a contract-based, freelance role. The&nbsp;<span>position is remote</span>, but we ask that you’re 1) located in&nbsp;<span>the U.S</span><span>.</span>&nbsp;and 2) available to communicate during Pacific Time business hours.</div><div><br></div><div>*<span>Note</span>&nbsp;- We understand that you are eager to hear back from us. We receive a lot of applications and cannot respond to all of them. Please do not reach out to us regarding your application. If there is a mutual fit, we will contact you to move forward with the next steps in the process.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://lean-startup-co.breezy.hr/p/a5458172dce001-product-manager-with-project-management-experience-lean-startup-practitioner-required?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/a5458172dce001-product-manager-with-project-management-experience-lean-startup-practitioner-required?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 24, 2017 4:10:57 PM",
    "tags": [
      "DBG:surround``2W(100, remot)",
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 3W OR(time,timezon)",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/manager",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "100% remote",
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "qgzZhfPKQYyTZZiTNvWTrQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/genie-bazaar/jobs/90363-business-development-manager",
    "title": "Business Development Manager",
    "content": "<div><h2>Business Development Manager at Genie Bazaar</h2><div>Mumbai, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Business Development, Negotiation, Sales and Marketing, Communication Skills, Cold Calling, Vendor Management, Microsoft Excel, Account Management, Fluent in English</div><div>Compensation</div><div>₹350K–₹750K<br>0.1%–0.3%</div></div><h3>Job Description</h3><div><p>Core Responsibilities<br>Our environment is very fast-paced, and requires someone who is highly enthusiastic, flexible, detail-oriented, analytical, and comfortable working with multiple teams and management. The Business Development Manager is an effective listener, communicator and problem-solver, and is able to balance the needs and requirements of both Genie Bazaar and strategic vendors. He or she must be able to effectively engage with customer to pitch Genie Bazaar’s value proposition, convince them to use our platform and provide tailored on-boarding support.<br>. Presenting our platform clients<br>. Create list of potential clients. Qualify leads to customers and sales<br>. Effectively communicate with leaders of customer's organization. Be fast paced and roll up sleeves for closing the client.</p><p>Qualifications<br>· Bachelor’s degree required<br>- Top notch customer sales skills required<br>· 3+ years of relevant experience in sales, buying, account management, financial analysis and/or marketing preferably in eCommerce, retail or technology industries<br>· Exceptional interpersonal and communication skills; strong writing and speaking skills<br>· Demonstrated ability to manage multiple projects - prioritization, planning and time management<br>· Proficient in Excel<br>· Proactive attitude, detail oriented, and a team player<br>· Proven analytical skills – ability to analyze large data sets to make strategic decisions</p><p>Preferred Qualifications<br>· Track record of taking ownership and driving results<br>· Proven negotiating skills and influencing abilities</p></div>",
    "urlFetchPending": false,
    "published": "Nov 20, 2017 12:48:37 AM",
    "tags": [
      "Account Management",
      "BD Manager",
      "Business Development",
      "Cold Calling",
      "Communication Skills",
      "DBG:surround``fulltim 4N remot",
      "Fluent in English",
      "Full Time",
      "Microsoft Excel",
      "Mumbai",
      "Negotiation",
      "REMOTE1/100",
      "Remote OK",
      "Sales Manager",
      "Sales and Marketing",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown",
      "Vendor Management"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "0cYejTF6TS-wcwz8vy7qVw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/161012/director-of-engineering-python-docker-graphql-finetune-learning?a=RZTY4SvabVC",
    "title": "Director of Engineering (Python, Docker, GraphQL, Ansible, AWS) at FineTune Learning (Boston, MA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Assessment, Education Technology, Human Resources</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>FineTune is seeking a director of engineering to lead a team of 13 developers. The director of engineering will be the expert in residence around infrastructure scaling, python, docker, database performance and microservices. S/he must have experience working with at least 3 production released software projects/products. S/he should be hands on tech and comfortable solving complex system problems while making sure software team understands clearly what they are building, while refactoring/architecting new and existing services to scale to support 5 million users.</p><p><br> S/he should also be comfortable interacting with customer and provide guidance on the technical feasibility and scope of engineering/rearchitecting needed to solve problems and deliver features. <br> If the director of engineering desires, one could also manage, mentor, performance review engineers in the team. Director of engineering will also work with 3 tech leads and QA team to find best ways to increase the performance of the development team and enhance software quality and development speed.</p><p>S/he will interface with CTO to continuously drive innovation and new product development while promoting and advancing the scalability and modularization of current platform we are working on with Collegeboard. S/he will be essential member of the leadership team to drive company vision and mission while scaling the software for larger audience.</p>                    </div>                            <h2>                About FineTune Learning            </h2>            <div><p>We are working on a variety of projects from componentizing and enhancing front end reactjs to optimize user experience and reusability of components.&nbsp; We are constantly collecting data on users to help recommend better resources for their learning.&nbsp; We build interesting but simple dashboards that may help teachers become more data driven.&nbsp; We work on behavioral experiments via randomized control trial through our software. Our backend is mostly python/sqlalchemy and supports graphql and diverse set of databases depending on the application.&nbsp; Continuous integration and continuous deployment are next in our pipeline. We are facing challenges in scalability and automation which we plan to tackle in 2018 and refactor code to&nbsp;increase the software performance and support 5 million users.&nbsp; We work with our design team to make this experience engaging&nbsp;for effective learning. We practice agile and scrum and&nbsp;strive to continuously improve.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Responsible time off                            </div>                            <div>                                 100% remote work/work from anywhere                            </div>                            <div>                                 401k                            </div>                            <div>                                 Health/dental                            </div>                            <div>                                 Profit sharing                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 18, 2017 10:29:16 PM",
    "tags": [
      "DBG:surround``2W(100, remot)",
      "DBG_TECH1:k/t/w:python/python/6",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:sqlalchemy/python/8",
      "DBG_TECH1:techWeightMap:{python=14, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/python",
      "TECH2/graphql",
      "TECH2/react-apollo",
      "TECH2/reactjs",
      "TECH2/redux",
      "TECH2/responsive",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "graphql",
      "python",
      "react-apollo",
      "reactjs",
      "redux",
      "responsive"
    ]
  },
  {
    "id": "TsjepgdRQPuwuPdT9FymTg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/advancing-women-executives/jobs/53765-regional-director",
    "title": "Regional Director",
    "content": "<div><h2>Regional Director at Advancing Women Executives </h2><div>San Francisco, San Francisco Bay Area, Silicon Valley, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$90K–$100K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>What does it feel like working for a company where clients every day say to you, &quot;Thank you for doing what you do!&quot;?<br>What does it feel like working for a company where you're impacting positive change in the world?<br>What does it feel like working for a company where you are constantly learning?<br>What does it feel like working for a company where you're stimulated intellectually by your peers while, at the same time, laughing and not taking yourself too seriously?<br>It feels great and this is what working at AWE feels like every day.</p><p>Advancing Women Executives (AWE) is a start-up with the mission to accelerate the careers of women in business to improve the global economy, by providing VP-level and above corporate executive women the opportunity to build cross-functional and cross-industry relationships in a safe, locally-based environment. AWE membership services include events, training, and executive coaching. AWE currently has memberships in San Francisco, Los Angeles, Silicon Valley, New York and Chicago. AWE is based in Los Angeles, CA, but has staff in all other membership cities. <br> <br>AWE is seeking a highly qualified Regional Director to join our team to be based in the Bay Area and report to the Founder and CEO.  The primary responsibility of this role is to sell AWE services to VP-level and above corporate executive women for the purposes of furthering AWE’s mission and generating business revenue.<br> <br>Responsibilities:<br>Prospecting and closing new AWE memberships in San Francisco, Silicon Valley, and  Los Angeles;<br>Network and build relationships with the top influencers in corporate America, private equity, venture capital and service industries;<br>Lead and develop a team of sales and client relations associates; <br>Executing a sales methodology with an average sales cycle of 6 weeks or less;<br>Partner with Associate Director of Member Relations to ensure AWE leaders are active and engaged in membership through a consultative sales approach;<br>Sales forecasting and new business pipeline management; <br>Strategize about sales and client relations process and services;<br>Conduct Training Sessions across California locations;<br>Host bi-annual events and monthly dinners with AWE leaders.</p><p>Qualifications<br> A successful candidate will possess:</p><p>True belief in AWE’s mission to significantly improve the number of women in senior management and on board seats;<br>The spirit to “Be Bold” and fearless in representing AWE, even during its start-up phase; <br>Spirit of generosity and service;<br>Intellectual curiosity and drive to problem solve;<br>Natural ability to connect with people and to be a connector for people; <br>6+ years transactional sales experience with success negotiating and closing business;<br>Exceptional ability to immediately establish one's credibility with senior executives;<br>Willingness to work outside strict job description parameters, thinking creatively about how to provide the highest level of customer/member service and overall business growth;<br>Excellent written and oral communication skills; <br>Strong public speaking skills and experience presenting to large groups;<br>Great sense of humor;<br>Excellent meeting facilitation skills; ability to conduct 100% phone-based meetings;<br>Solid understanding of business concepts and ability to quickly learn content terrain;<br>Ability to diagnose prospect needs and identify relevant resources;<br>Ability to meet personal and team weekly, monthly, quarterly, and annual financial goals;<br>Solid understanding of business concepts &amp; dynamics for large national and international corporations;<br>Superior time management, detail orientation and organization skills;<br>Bachelor's Degree required, MBA preferred.</p><p>AWE is an Equal Opportunity Employer.</p></div>",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 10:19:47 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "San Francisco",
      "San Francisco Bay Area",
      "Silicon Valley",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "kUWv1i29Qo6WkRYirHyy4Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/studysoup/jobs/57489-head-of-growth-marketing",
    "title": "Head of Growth Marketing",
    "content": "<div><h2>Head of Growth Marketing at StudySoup </h2><div>Oregon, California, Toronto, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Marketing, SEO/SEM, Google Analytics</div><div>Compensation</div><div>$60K–$75K<br>0.1%–1.0%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>You can hear the chanting in your head everywhere you go: Grow, Grow, Grow!</p><p>StudySoup has grown 400% in just the last 12 months at universities nationwide, and we're looking for a hard working, analytics driven, full stack marketing expert to take this growth to new heights.</p><p>We're helping students save money, while driving better learning opportunities so you can feel great about every new user you acquire.</p><p>We want you to establish a systematic approach to growth strategies in the company, and then build a growth team around yourself. </p><p>You'll need experience building attribution models across different products that feed into each other, and setting up funnels to help make data driven acquisition decisions.</p><p>WHAT YOU GET</p><p>* A top notch, highly curated team of individuals who are driven by their passion for success and shaping the future of education <br>* The unique opportunity to strategize and implement your own initiatives end to end <br>* An extremely fast growth early stage venture funded company <br>* Fun, learning experiences, good times and smiles <br>* Work from home</p><p>WHO YOU ARE</p><p>- You've probably run your own agency (or company), and currently have your hands in 5-10 new marketing initiatives.<br>- You live and breathe Google Analytics; or similar tools<br>- You want to create, and own our growth strategy while working closely with the operations, development and design team<br>- You have deep understanding of content, SEO/SEM and other paid user acquisition channels<br>- You love creating funnels and running tests until you find that perfect acquisition mix<br>- You can bring creative ideas to the table and execute on new untapped strategies</p><p>what you would do </p><p>- You will be the driving force behind everything we do at StudySoup; every new feature and initiative will stem from you<br>- You will ideate new tests, create a hypothesis, goals and execute the test from start to finish, measuring every step of the process</p></div>",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 10:19:01 PM",
    "tags": [
      "California",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "Full Time",
      "Google Analytics",
      "Marketing",
      "Oregon",
      "REMOTE1/100",
      "Remote OK",
      "SEO/SEM",
      "TECH1/go",
      "TITLE1/manager",
      "TZ/unknown",
      "Toronto"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "l5QI3UW3TGSQaox6TU2X_g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/studysoup/jobs/61626-head-of-us-operations",
    "title": "Head of US Operations",
    "content": "<div><h2>Head of US Operations at StudySoup </h2><div>San Francisco, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Business Operations, Operations Management</div><div>Compensation</div><div>$60K–$70K<br>0.05%–1.0%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>StudySoup is hiring a passionate, driven leader who wants to transform the future of a quickly growing organization.</p><p>This is your opportunity to grab hold of a company that has been growing 400% each quarter and set-up the processes and systems that will enable us to grow even faster.</p><p>You are:</p><p>-a self-starter</p><p>-a passionate leader who loves motivating people</p><p>-process-driven, with a passion for diving into analytics</p><p>-kick-ass and have a positive attitude (seriously, no negative people)</p><p>Somewhere in your bio you were most likely a dedicated athlete, have served in the military or the Peace Corps, or have seen your own projects from start to finish, or any similar activity that requires complete focus and an ability to perform above and beyond the capacity of ordinary people.</p><p>REQUIREMENTS</p><p>3-8 years of Operations and/or Leadership experience</p><p>Must have managed teams of 10+</p><p>WHAT WE CAN DO FOR YOU</p><p>-&gt; We will empower you with the responsibility and individuality you need to drive your own destiny and see your contributions take life on a daily basis.</p><p>-&gt; We will give you equity in the company so you have shared involvement in grand slamming this opportunity.</p><p>-&gt; We will surround you with the hardest working, brightest minds in the industry to help you become the best person you can be</p><p>RESPONSIBILITIES </p><p>- You will ideate, implement, and manage the complete scope of StudySoup’s campus growth operations. We have Big Hairy Goals (BHGs) and the support of leading investors around the U.S. to change the face of how we look at learning today. Your #1 priority will be to help us create systems and empower our employees (and campus ambassadors) to reach those goals.</p><p>- You will establish processes to scale our growth systems from 10 to thousands of campuses worldwide</p><p>- You will build an A-Z playbook to successfully launch campuses</p><p>If you’re awesome and excited to contribute 150% of your efforts to this opportunity then you should DEFINITELY APPLY!!!!</p></div>",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 9:03:28 PM",
    "tags": [
      "Business Operations",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Operations",
      "Operations Management",
      "REMOTE1/100",
      "Remote OK",
      "San Francisco",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "CWpaCARDTpqy8sFlt3KaTw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/studysoup/jobs/92676-head-of-content-journalist",
    "title": "Head of Content / Journalist",
    "content": "<div><h2>Head of Content / Journalist at StudySoup </h2><div>San Francisco, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>SEO, Writing, Content Management, Journalism, Content Strategy, Creative Writing, Sense of Humor</div><div>Compensation</div><div>$30K–$45K<br>0.05%–0.2%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Over 100,000 college students use and LOVE our site, StudySoup.com</p><p>Now, it's time we show them some love with some great content to brighten their day.</p><p>That's why we're looking for a full time writer to craft irresistible content that our users love.</p><p>Do you have a great attitude with a fun writing style? </p><p>Are you down to help?</p><p>Then this is for you. </p><p>You should apply if your writing is funny, unique, and different. Why? Because:</p><p>1) being a student is hard</p><p>2) education can be boring (see Chegg)</p><p>3) we want to make education fun and accessible</p><p>4) doing Keg stands makes us dizzy</p><p>Who you are:</p><p>-&gt; You're looking for a creative outlet where Millions of people can see your amazing talent</p><p>-&gt; You have a fun/easy going tone and personality</p><p>HOW TO APPLY</p><p>Send me the following:</p><p>- 3 AWESOME Ideas for articles</p><p>- Pick one of those ideas and write MAX 300 words of the intro</p></div>",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 9:03:28 PM",
    "tags": [
      "Content Management",
      "Content Strategy",
      "Creative Writing",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Journalism",
      "Marketing",
      "REMOTE1/100",
      "Remote OK",
      "SEO",
      "San Francisco",
      "Sense of Humor",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown",
      "Writing"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "ekkFE4doR7G1QU52lAVO6A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/studysoup/jobs/73551-regional-director",
    "title": "Regional Director",
    "content": "<div><h2>Regional Director at StudySoup </h2><div>San Francisco, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Sales Strategy and Management, Leadership, Sales Operations, Campus Relations, Campus Recruitment</div><div>Compensation</div><div>$25K–$32K<br>No Equity</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>StudySoup is looking for recent grads with strong leadership experience to lead our field operations as a Regional Director. </p><p>Regional Managers are recent grads with no more than three (3) years of experience, and strong leadership backgrounds. Regional Managers have a good understanding of the regions they manage and are responsible for the developing and executing strategies that will help to build StudySoup’s presence. They are advocates for the concerns of their Campus Managers, and are liaisons from HQ. As full-time employees they have a long­-term commitment to ensuring the long-term success of the company. </p><p>Qualifications:<br>Bachelor’s degree required. <br>0-3 years of experience. Recent college grads strongly encouraged to apply.<br>Strong leadership background. Comfortable with comprehensive management role. <br>Willing to work remote.</p></div>",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 9:03:28 PM",
    "tags": [
      "Campus Recruitment",
      "Campus Relations",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Leadership",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Sales Operations",
      "Sales Strategy and Management",
      "San Francisco",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "CG6QQi3rTC-gMNtK_moxAA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/160789/project-management-engineer-european-timezone-platformsh?a=RVguaQsP7YQ",
    "title": "Project Management Engineer - European timezone at Platform.sh () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Continuous Delivery, PaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong><strong>Job description:</strong></strong></p><p>Platform.sh is a groundbreaking hosting and development tool for web applications. We’re a European VC-Backed startup with a host of blue-chip Enterprise clients and a string of awards and grants (including €2m from the EU Horizon 2020 program). To reinforce our technical prowess, we are looking to grow our engineering team with an engineer that also enjoys project management. If you’re looking for an exciting, high-growth opportunity with an award-winning, cutting-edge company, this could be just the job for you</p><p>For its groundbreaking PaaS solution <a href='https://platform.sh/' rel='nofollow'>https://platform.sh</a> is looking for a Project Manager with a taste for Go, good Linux system understanding, and a real hunger for the challenges of building robust, distributed systems.</p><p>Platform.sh is a PaaS shrouded in a lot of black magic (we can consistently clone a whole running cluster, with its state, databases, indexes in a matter of seconds). We want to get this down to the hundreds of milliseconds domain. Interested? There is more...</p><p>Our external API is pure Hypermedia REST + oAuth on top of Pyramid. It mechanizes the Git layer and needs more features.</p><p>We can consistently generate from the same manifest a Docker container, an LXC one, or VM disk images (AWS, Azure, OpenStack), we want more targets.</p><p>We probably have the highest industry container density. We need to get it higher.</p><p>We support any Python, Ruby, NodeJS or PHP application, it’s time to roll-out Java and .NET, and Elixir, of course Elixir.</p><p>We need to have more auto-healing on the high-availability clusters. We need more performance out of our multi-protocol ssh proxy. We need work on our Ceph Implementation; We need to get the Debian package generation streamlined and faster. We need… great ideas on how to make Platform.sh even better. Interested? Join us!</p><p><strong>Mission :</strong></p><p>Directly reporting to our VP of Engineering, your roles will include:</p><ul><li>Engineering teams coordination for the flawless execution of ambitious, time constrained development projects</li></ul><ul><li>Work with CPO and CTO to ensure alignment between roadmap goals and short-term goals. Communication with all company stakeholders to give an incredibly clear project of both &nbsp;advancement and roadblocks</li></ul><ul><li>Backlog grooming. Making it pretty. Actionable. Sublime</li></ul><ul><li>Sprint planning, estimation, critical path analysis</li></ul><ul><li>Knowing all the things ; where each skeleton is buried</li></ul><ul><li>Making projects delivery predictable. Measurable. Finding impediments and helping remove them</li></ul><ul><li>Managing with brio changes to backlog. Informing stakeholders when an injected task will cause some other story to be rejected from current sprint or be late</li></ul><ul><li>Project scopes and objectives, involving all relevant stakeholders and ensuring technical feasibility</li></ul><ul><li>Review resource availability and allocation</li></ul><ul><li>Tooling around project plan and progress tracking</li></ul><ul><li>Reporting and escalation when necessary</li></ul><ul><li>Quality management. Managing the “Definition of Done” hand in hand with QA</li></ul><ul><li>Delivery management (release planning, QA follow-up) coordination with the Partner Delivery Manager</li></ul><p><strong>Must have :</strong></p><p>The ideal candidate:</p><ul><li>Is a true software engineer with enough low level chops. They know their system. Uses Linux. Codes. This is not a job for anyone who does not like coding. It is not a coding job. But extreme empathy with developers is absolutely required. So the candidate should be one</li></ul><ul><li>Is focused. Organized. Mature. Handles pressure. Handles multi-tasking. (Don’t worry we are nice and try to make a really nice stress-free working environment. But when the PM is panicky... well this is when stress-free disappears: PM should be the rock)</li></ul><ul><li>Has proven successful experience in project management</li></ul><ul><li>Has comprehensive knowledge of agile development. They know they Kanban from their Scrum. Know thy artifacts PM</li></ul><ul><li>Has had exposure to cloud services (AWS, Azure etc..)</li></ul><ul><li>Understands how an OS works, knows networking, how git works, and the constraints of a distributed system</li></ul><ul><li>Is proficient in at least one modern programming language (and proficient in troll deflection about what “modern programming languages” are and are not)</li></ul><p><strong>Nice to have :</strong></p><ul><li>Knowledge of some PHP stuff. Magento, Symfony, Drupal, eZ Platform, or Typo3. No expertise required</li></ul><ul><li>Mad Jira skillz</li></ul><ul><li>Public speaking experience</li></ul><ul><li>Proficiency in Rust or Ponylang grants you bonus points</li></ul>                    </div>                            <h2>                About Platform.sh            </h2>            <div><p>We’re a venture capital funded, award-winning team of hard-core hackers who want to revolutionize the way that developers and agencies build and deploy web applications. We’re mostly distributed, but we meet up daily in cyberspace, and occasionally in Paris, France. &nbsp;We value enthusiasm, team spirit, and a constant desire to expand personal knowledge and contribute to the community. We provide a multi-cultural, casual and balanced work environment. We recently helped launch&nbsp;Magento Enterprise Cloud Edition and the Sensio Cloud on Platform.sh technology.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from home, wherever you are                            </div>                            <div>                                 Safe and friendly working environment                            </div>                            <div>                                 Stock options for everyone                            </div>                            <div>                                 Rest and recovery are essential to health and happiness; we get that                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``OR(europ, european, europeanunion) 3W OR(timezon,time)",
      "DBG:surround``work 2W from 2W wherev",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:k/t/w:drupal/php/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:magento/php/24",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:php/php/10",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:symfony/php/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=8, c=0, mobile=1, go=3, nodejs=13, bigdata-ml=0, ruby=2, apple=0, java=2, gamedev=0, php=47, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TECH2/amazon-web-services",
      "TECH2/linux",
      "TECH2/project-management",
      "TECH2/python",
      "TITLE1/manager",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "linux",
      "php",
      "project-management",
      "python"
    ]
  },
  {
    "id": "GMAdYfGiSYC-EFZA63tTMg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/160721/lead-software-developer-technical-project-maplarge?a=RTQP59Rpwm4",
    "title": "Lead Software Developer / Technical Project Manager at MapLarge () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Product Manager</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Business Intelligence, Data &amp; Analytics, Developer APIs</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>100% Remote:&nbsp;</strong>This role allows working remotely 100% of the time from anywhere in the US.&nbsp; Workers must be authorized to work in the US (No Non US Applicants Please).&nbsp;</p><p><strong>Who We Need: </strong>We are looking for talented software developers to act as lead developers in a customer facing, technical project manager role. &nbsp;Applicants should have a strong history as a lead software developer (no non-technical project managers, please) and should be a top notch C# and JavaScript programmer. &nbsp;We are looking for sophisticated team members who are passionate about not only how UI is used, but also how the APIs, ontology, data structures, documentation, and examples come together to make both the UI components and technical APIs a pleasure for customers to use.</p><p><strong>Typical Tasks: </strong>Typical Tasks include both writing code and leading planning activities. &nbsp;You will often be acting as the lead technical point of contact on customer engagements, running internal and external planning meetings, helping to wireframe user interfaces, creating specs for the public facing APIs that drive them, doing deep dive code reviews with developers, and writing code for key portions of the deployed application.</p><p><strong>Skills:</strong> While we hire all kinds of people and invent roles to fit them, these are the key traits we prefer for this role:</p><ol><li><strong>Smart &amp; High Energy Engineer</strong> - We work at a very fast pace on cutting edge hard problems and we need people who can keep up. &nbsp;&nbsp;We need people who really love producing results for customers and who enjoy programming and exhibit the energy and creativity that comes from being fully engaged in the technical side of what we do.</li><li><strong>Strong Software Development background</strong> - This job is definitely NOT for non technical project managers. Recent, hands-on experience coding both server side (C#) and client side (JavaScript) are strongly suggested, and 5+ years work experience as a professional programmer is required. &nbsp;</li><li><strong>Experience Wireframing UI &amp; Designing APIs -</strong> You do not have to have strong artistic skills, but you should be comfortable not only spec-ing out UI wireframes but also designing the supporting technical web service API’s and/or client side component API’s.</li><li><strong>Technical Project Management</strong>: &nbsp;You should be highly organized with a strong history in either technical project management or as the lead developer for complex software development projects.&nbsp;&nbsp;</li><li><strong>Customer Facing</strong>: comfortable meeting with sophisticated customers and managing expectations on large high value projects.</li></ol>                    </div>                            <h2>                About MapLarge            </h2>            <div><p>MapLarge provides Big Data Analytics and Visualization to make&nbsp;the world safer, more productive, and more efficient.&nbsp; The MapLarge API provides real time geospatial and predictive analytics for over 15 billion location events per day and trillions of historical events. Analysts using our geospatial visualization capability can instantly query and visualize data on any desktop, mobile or tablet device. &nbsp;All of our UI components are re-usable, data driven, event driven, API powered (client and server side), scriptable, re-configurable, savable, deep linkable, shareable etc. &nbsp;We also have editor components, and data visualization wizards that allow non-technical users to import, automatically visualize data patterns (with sensible defaults that “just work”), conduct predictive analysis and also re-configure more advanced detailed settings with “what you see is what you get” editor tools.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Hours (work whenever you like)                            </div>                            <div>                                 No Commute (work from home 100%)                            </div>                            <div>                                 Technically Excellent A+ Team solving very hard interesting problems                            </div>                            <div>                                 Friendly People - Postitive attitude is our #1 criteria                            </div>                            <div>                                 401k                            </div>                            <div>                                 We like all kinds of people                            </div>                            <div>                                 Unlimited Vacation                            </div>                            <div>                                 Family Friendly                            </div>                            <div>                                 Top Notch Health Care                            </div>                            <div>                                 Cutting Edge Tech                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``2W(100, remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG:surround``remot 3N OR(role, employment)",
      "DBG_TECH1:k/t/w:c#/c/4",
      "DBG_TECH1:k/t/w:c#/dotnet/10",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=10, c=4, mobile=0, go=0, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH2/amazon-web-services",
      "TECH2/api",
      "TECH2/c#",
      "TECH2/geolocation",
      "TECH2/typescript",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "amazon-web-services",
      "api",
      "c#",
      "dotnet",
      "geolocation",
      "typescript"
    ]
  },
  {
    "id": "Ef1tWzrwTlqvOBt1WbGFfQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/160040/software-development-manager-must-be-based-in-bybox?a=RFGUeLhUhwc",
    "title": "Software Development Manager - Must be based in the UK at ByBox () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior, Lead, Manager</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, Logistics &amp; Distribution, Technical Services</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Job Title: &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; <strong>Software Development Manager</strong></p><p>Location: &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; <strong>Home-working, although frequent travel is required (UK and international).</strong></p><p>Hours of work:&nbsp; <strong>37.5 hours per week</strong>&nbsp;</p><p>Reporting to:<strong>Head of R&amp;D</strong></p><p>At ByBox, our software solutions and smart locker technologies are keeping our UK distribution, warehousing and technical services divisions working 24/7, 365 days a year, minimising delivery times and inventory levels. As the market leader for field service supply chain solutions in the UK, we rely on our software team to innovate and build new solutions, as well as developing our existing systems, keeping ByBox ahead of the competition and reinforcing our position as a successful innovator within UK field support.</p><p>We are also successfully re-positioning ourselves as a global technology provider for locker delivery solutions, predominantly focussing on the field service supply chain. This is an exciting departure from the previous market position as a distribution company with a strong technology capability. This change of position is allowing us to operate a different revenue model, through software subscriptions and licensing, rather than through logistics services.</p><p>To support this, the software development department must deliver the correct short and long-term projects to enable that re-positioning.</p><p><strong>The Position</strong></p><p>As a Software Development Manager at ByBox your duties include:</p><p>Leadership. Lead, motivate and influence a team of expert software developers to deliver value for ByBox while ensuring software quality. Ensure the developers have all the tools they need, be it hardware, software, or training, to do their job to the required level.</p><p>Relationships. Work closely with colleagues in the software development department to ensure the development team are aligned to business priorities and strategy. Develop strong relationships with internal customers to understand their perspectives and to positively influence the reputation of software development.</p><p>Recruitment. Take a highly pro-active role in the recruitment of software developers. Work with the ByBox recruitment team to ensure the highest-quality candidates are identified and engaged effectively. Also, engage with external organisations to seek the right talent and to promote ByBox as a forward-thinking employer of software developers.</p><p>Resourcing. Work closely with the Business Interface Manager and Project Managers to ensure the right developers are available at the right time for delivering the Software Development Pipeline. Where necessary, own the relationship with outsourced-development teams and the process for bringing on additional software developers on a temporary-contract basis. Ensure the software developers are appropriately assigned to projects, and given opportunities to work on other projects as required and fairly. Respond to business needs through the appropriate deployment of developers, while protecting long-term contingency in capacity so we can quickly respond to opportunities.</p><p>People development. Develop and retain our people by fostering a positive environment for personal and professional development through continuously engaging with developers, appraisals, objectives and training plans. Provide a platform for developers to raise concerns or offer new ideas, support one another, and resolve conflict, and where necessary manage performance or disciplinary concerns. Promote and develop the key values from our Ways of Working, including innovation, trust and openness.</p><p>Continuous improvement. Drive continuous improvement and adoption of best practices within the software development team to optimize the performance of the team. By pragmatically weighing the business need for delivery with the need to keeping technology current, help to ensure the team is producing the right solution at the right time.</p><p>Documentation. Define and own the good practice for technical documentation, demos, and handovers amongst the team for the benefit of colleagues, and customers requiring technical API documentation.</p><p>Technology. Support your team in ensuring they are abreast of the latest developments in technologies, and they have the tools they need to adopt appropriate technology. Be familiar with the current technologies in your team, and be aware of upcoming technologies. You do not need to be the technology expert within your team, but must be able to articulate the pros and cons of competing technologies and justify investment to senior management.</p><p>Quality Assurance. Work very closely with the Quality Assurance Manager to ensure QA practices are aligned across the department, particularly in the adoption of Test Automation and the Test Automation Engineers reporting to the QA Manager.</p><p>Workload. Manage your own objectives and priorities effectively and without close supervision. Although you won't be directly managing the work of your direct reports (this will be done by Software Project Managers), a good awareness of their current work will be crucial in making good decisions. You will be able to escalate issues to the Head of R&amp;D and will also be required to make recommendations. You will also be involved in the technology strategy by supporting the Head of R&amp;D with departmental planning activities as required.</p><p><strong>The Person</strong></p><p>The Software Development manager does not need to be currently active in writing code, and the role does not entail any code-writing, but there is room for a successful candidate to define the level of their technical involvement, based on their knowledge. The ideal candidate will:</p><ul><li>Have a passion for Technology and good understanding of trends in Software Development.</li><li>Have a strong technical foundation in Software Development.</li><li>Embrace a cross-functional approach to team management and appreciate the challenges therein.</li><li>Foster an open, collaborative environment, and balance people's needs with company objectives.</li><li>Appreciate the challenges of managing a team of home-workers, and home-working yourself.</li><li>Understand how to lead and manage a team of highly talented, distributed Software Developers.</li></ul><p><strong>Essential qualifications and experience:</strong></p><ul><li>Team Leadership or Management, particularly teams of Software Developers</li><li>Technical background.</li><li>Worked with home-working or distributed teams.</li><li>Management of outsourced development partners.</li><li>Excellent command of written and spoken English.</li></ul><p><strong>Desirable qualifications and experience:</strong></p><ul><li>Experience working in a team of primarily .Net &amp; JavaScript developers.</li><li>Experience in the logistics industry.</li><li>Knowledge of the ByBox domain</li></ul>                    </div>                            <h2>                About ByBox            </h2>            <div><p>ByBox is leading the way in box-based logistics. Electronic box networks are doing to distribution what ATM's did to retail banking: Increased service, reduced cost.<br> <br> ByBox uses its World-beating electronic box technology as a platform for the most sophisticated field service solution in the UK. ByBox is also the only UK supplier of box-based consumer solutions to the global postal market.<br> <br> As one of the fastest growing technology companies in the UK, ByBox boasts an impressive software development team. Their current suite of mobile, client and web-based applications cover:</p><p>·Mobile Apps</p><p>·Bluetooth &amp; Electronic lock-box integration</p><p>·Customer-facing web applications</p><p>·EDI &amp; Customer integration</p><p>·Transport &amp; distribution management</p><p>·Warehouse management</p><p>·Label and barcode generation</p><p>·Administrative services</p><p>·…and much more</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Home-based working for most of the Technology team                            </div>                            <div>                                 Flexible working hours                            </div>                            <div>                                 High-end kit provided including all software tools required                            </div>                            <div>                                 Training and development budget provided                            </div>                            <div>                                 25 days leave a year rising to 30 days                            </div>                            <div>                                 Several offices in UK and travel expenses covered                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 8:18:19 PM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG:surround``home W base",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH2/development-environment",
      "TITLE1/manager",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "100% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "development-environment",
      "dotnet"
    ]
  },
  {
    "id": "wIVzTG7ATcmRZR2HUwvtsQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/spacetimepartners/jobs/97172-head-of-product",
    "title": "Head of Product",
    "content": "<div><h2>Head of Product at Spacetime Partners</h2><div>Monterrey, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Web Development, User Interface Design, Linux</div><div>Compensation</div><div>$10K–$55K<br>1.0%–5.0%</div></div><h3>Job Description</h3><div><p>Spacetime Partners is looking for a head of product to lead the development of our business services product portfolio; continue developing new and improved features as a result of customer feedback.</p><p>+Highly independent and motivated person<br>+100% client focus to develop and maintain great product line<br>+Ability to lead product management team<br>+Deep knowledge of web based business services industry including business intelligence, communications, productivity and collaboration tools<br>+Proficiency in design &amp; engineering of software &amp; hardware<br>+Ability to respond to customers and loop feedback to engineering and design teams</p><p>RESPONSIBILITIES<br>+New product development<br>+Strategic planning for business services line of products<br>+Analyze current competition and deploy relevant strategies<br>+Coordinate with engineering and design teams to achieve top performance</p></div>",
    "urlFetchPending": false,
    "published": "Nov 17, 2017 1:05:18 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Linux",
      "Monterrey",
      "Product Manager",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown",
      "User Interface Design",
      "Web Development"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "yyt_qGyaS6GWLZml4CaACA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "https://jobmote.com/jobs/8100-lead-software-developer-technical-project-manager",
    "title": "Lead Software Developer / Technical Project Manager",
    "content": "Lead Software Developer / Technical Project Manager - Jobmote<div><div><h2>Lead Software Developer / Technical Project Manager</h2><h5>MapLarge</h5></div></div><div><div><div><div><div><p><strong>100% Remote:&nbsp;</strong> This role allows working remotely 100% of the time from anywhere in the US.&nbsp; Workers must be authorized to work in the US (No Non US Applicants Please).&nbsp;</p><p><strong>Who We Need:</strong> We are looking for talented software developers to act as lead developers in a customer facing, technical project manager role. &nbsp;Applicants should have a strong history as a lead software developer (no non-technical project managers, please) and should be a top notch C# and JavaScript programmer. &nbsp;We are looking for sophisticated team members who are passionate about not only how UI is used, but also how the APIs, ontology, data structures, documentation, and examples come together to make both the UI components and technical APIs a pleasure for customers to use.</p><p><strong>Typical Tasks:</strong> Typical Tasks include both writing code and leading planning activities. &nbsp;You will often be acting as the lead technical point of contact on customer engagements, running internal and external planning meetings, helping to wireframe user interfaces, creating specs for the public facing APIs that drive them, doing deep dive code reviews with developers, and writing code for key portions of the deployed application.</p><p><strong>Skills:</strong> While we hire all kinds of people and invent roles to fit them, these are the key traits we prefer for this role:</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Nov 16, 2017 8:00:33 AM",
    "tags": [
      "DBG:surround``2W(100, remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG:surround``remot 3N OR(role, employment)",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=5, c=2, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "ovxFsi_KSKWes3rXferCzQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63095",
    "title": "Lead Software Developer Technical Project Manager",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p><strong>100% Remote:&nbsp;</strong>This role allows working remotely 100% of the time from anywhere in the US.&nbsp; Workers must be authorized to work in the US (No Non US Applicants Please).&nbsp;</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 16, 2017 3:42:36 AM",
    "tags": [
      "DBG:surround``2W(100, remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG:surround``remot 3N OR(role, employment)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "yIOAMSqZRX2SWlXQwXVmKA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/63444/head-of-growth-at-find-my-larp/",
    "title": "Head of Growth",
    "content": "About Find My Larp<br /><br />Find My Larp is a global online marketplace for Live Action Role Playing (Larp) events. <br /><br />The global Larp event market is estimated to be worth £500m per year in ticket sales alone, and we are on a mission to create the first Marketplace of it’s kind for this industry. We launched our MVP in late October 2017 and have already sold tickets and got early traction. We’ve also managed to attracted a good number of users on both the supply & demand side. <br /><br />Our small founding team is made of Larp industry experts and experienced tech industry founders. The team is spread out between London and Stockholm and we mostly work remotely.  <br /><br />Learn more at www.findmylarp.com<br /><br />Role Objectives<br /><br />We are looking for a Head of Growth who will be responsible for developing and executing marketing & business development plans. In practice, the role will be a hybrid of a marketer and business development. <br /><br />The Head of Growth will, first and foremost, be a growth hacker, able to think strategically about approaches, methodologies, indicators, and metrics, and define the relevant growth KPIs, on the one hand; and, on the other, personally deploying all available tools and techniques, using whatever tactics are suitable – and with minimal budget – to drive product adoption and usage. This will include ongoing experimentation and continuous optimisation through testing and tuning.<br /><br />Effective growth hacking will necessitate a deep understanding of the drivers of engagement and virality within products, and the Head of Growth will work closely with the rest of the team to optimise the end-to-end user/customer experience.<br /><br />The role will also be responsible for the management and utilisation of user/customer data across all touch points, ensuring that the right infrastructure, systems and people are in place to support effective data-driven decision making. <br />The role is absolutely critical for Find My Larp – and you will be able to significantly influence whether or not Find My Larp is able to reach it’s full potential in the quickest time possible.. This is a career-defining opportunity to; help build a brand new business from the ground up in an industry which is on the cusp of becoming mainstream and hugely popular. <br /><br />Profile Overview<br /><br />The ideal candidate will be…<br /><br />…an experienced growth hacker with a stellar track record of driving exponential growth in usage and engagement, across multiple markets, for a new internet businesses.<br /><br />…intelligent, creative, bold and daring, but at the same time highly data-driven and analytical. They will be highly commercial, with a good understanding of growth metrics and KPIs, and strong instincts for where the greatest gains, at the fastest speed, may be made. They will be an expert in the use of social media and features to drive virality and growth.<br /><br />…equally comfortable with high-level, strategic thinking, and hands-on implementation, with close attention to detail. He or she will have a strong bias to action, able to work at a very fast pace, and comfortable making quick decisions.<br /><br />…naturally intellectually curious and unafraid to take risks, willing to try non-traditional approaches to achieve goals relish new challenges and learning new things; and enjoy conducting experiments and testing hypotheses.<br /><br />…a bold, ambitious and creative individual who genuinely wants to challenge the status quo. They will have no tolerance for mediocrity and will constantly be raising the bar. They will have a collaborative, open style that fosters participation and widespread contribution of ideas.<br /><br />Summary of Required Experience & Attributes:<br /><br />GROWTH MARKETING EXPERIENCE – Will be an accomplished and experienced growth hacker, with a track record of driving user/customer growth and engagement for online businesses. It is expected that this person will be hands-on familiar with paid search and social marketing (Google & Facebook in particular).<br /><br />PRODUCT SENSIBILITY / APPRECIATION FOR ENGAGING CONSUMER PRODUCTS – Will have a good understanding of UX, and experience of working hand-in glove with product management. Will understand drivers of engagement and virality.<br /><br />BOTH STRATEGIC AND EXECUTION-FOCUSED – Will be able to think ‘big picture’ and take a strategic perspective, but have a strong bias to action, with a hands-on, implementation-oriented approach.<br /><br />RELATIONSHIP AND COMMUNICATION SKILLS – Will be capable of operating successfully with small teams and able to scale them as needed. Will be an inspiring and engaging communicator and colleague, able to build positive working relationships with ease.<br /><br />CULTURE FIT – Entrepreneurial, passionate, friendly, low-ego, collaborative, fast-paced, transparent, creative, challenging, high integrity, down to earth.<br /><br />Benefits<br /><br />Find My Larp is a very early stage (pre-funding) start up and as such the perks on offer are limited. The biggest benefit we can current offer is opportunity to take a fledgling company (with huge potential) to it’s full potential. <br /><br />As the Head of Growth you will have the ability to shape the direction of the company and if successful will reap the rewards along the way. For the right candidate we can offer an attractive equity package of between 10-20% as well as performance related bonuses and profit sharing opportunities. <br /><br />Flexible working conditions come as part of the package, so you can pick when and where you work from. <br /><br /><br />Application Method<br /><br />Send us an email (via work-in-startups) with your CV and a short letter outlining why you feel you're the right person for the job and will get back to you within 3 business days. <br /><br />*We are not working with any staffing firms or agencies and will not be accepting resumes from them.<br />",
    "urlFetchPending": false,
    "published": "Nov 15, 2017 3:38:20 PM",
    "tags": [
      "DBG:surround``2N(team, spread, out)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "HxkGPFlbRwOvqyoNEZzzVg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-design",
    "url": "https://weworkremotely.com/jobs/5750-program-associate-program-placement-team",
    "title": "Remote Year: Program Associate, Program Placement Team",
    "content": "<div>  <div>    <h2>Program Associate, Program Placement Team</h2>      <h4>Posted Nov 14</h4>    <h3>      <span>Remote Year</span><br>      <span>Headquarters: Remote </span><br>        <a href='https://remote-year.breezy.hr/p/7179e03b059c' rel='nofollow'>https://remote-year.breezy.hr/p/7179e03b059c</a>    </h3>  </div></div>  <div>    <div><span>Remote Year brings together communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend a year working, traveling, and exploring 12 cities around the world. &nbsp;Spending one month in each location, communities connect with local cultures and business ecosystems, forming lifelong, borderless personal and professional relationships along the way. &nbsp;Together we will shape the future of work.</span><br></div><div><span><br></span></div><div><strong>Role:</strong></div><div><br></div><div>Remote Year is looking for personable and intelligent sale focused Program Associates to join our Program Placement Team. Our Program Associates are the first touch in our consultative sales process. They are the responsible for qualifying applicants and helping them decide if Remote Year is the right match for them. Working alongside our team of Program Associates you will critically support our Program Consultants by helping potential Remotes through the early stages of our program placement process.</div><div><br></div><div><strong>What You Bring:</strong></div><div><br></div><ul><li>1-2 years of experience exceeding quota in Sales Development, Lead Generation, Sales, Recruiting, or Marketing, with preference to consumer sales.<br><br></li><li>Ability to work in a high-energy and distributed sales team environment.<br><br></li><li>Highly coachable, self-directed, positive, motivated, and resourceful.<br><br></li><li>Incredible customer service, excellent listening skills, and strong writing skills.<br><br></li><li>Passion for learning and working within the travel space.<br><br></li><li>Proficient in using Salesforce, LinkedIn, and other leading sales automation tools.<br><br></li><li>A willingness and excitement to spend 1-2 weeks in Mexico City for sales training.<br><br></li></ul><div><strong>Nice-to-have:</strong></div><div><br></div><ul><li>Previous startup experience<br><br></li><li>Bachelor's degree from accredited college or university.<br><br></li><li>Experience traveling for long periods of time.<br><br></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send a cover letter and your resume to us via our Jobs Page: <a href='https://remote-year.breezy.hr/p/7179e03b059c' rel='nofollow'>https://remote-year.breezy.hr/p/7179e03b059c</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 14, 2017 3:52:12 PM",
    "tags": [
      "DBG:surround``headquart 3N remot",
      "DBG:surround``remot 3N OR(role, employment)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Eze0fxsNT-2b8gEjeM-i6Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/63037",
    "title": "Program Associate, Program Placement Team",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><div><span>Remote Year brings together communities of interesting professionals, entrepreneurs, and freelancers from across the globe to spend a year working, traveling, and exploring 12 cities around the world. &nbsp;Spending one month in each location, communities connect with local cultures and business ecosystems, forming lifelong, borderless personal and professional relationships along the way. &nbsp;Together we will shape the future of work.</span><br></div></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 14, 2017 3:52:12 PM",
    "tags": [
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "kirwh5dOR4eJZroiSeMAig",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/forkable/jobs/122200-general-manager-san-diego",
    "title": "General Manager - San Diego",
    "content": "<div><h2>General Manager - San Diego at Forkable</h2><div>San Diego, Remote · Full Time</div></div><div><div>Compensation</div><div>$40K–$80K<br>0.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>The GM is the CEO of the market. You are responsible for all local operations, partnerships and growth. Can you handle it?</p></div>",
    "urlFetchPending": false,
    "published": "Nov 14, 2017 1:09:20 PM",
    "tags": [
      "Attorney",
      "DBG:surround``fulltim 4N remot",
      "Finance/Accounting",
      "Full Time",
      "Operations",
      "REMOTE1/100",
      "Remote OK",
      "San Diego",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "slrJcWapT8utW4NSGgLA3g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30013?r=rss2",
    "title": "Cables & Sensors: IT Project Manager, Background in Web Development, APIs or Shopify",
    "content": "<p>Full-time</p><p><strong>(Anywhere - Work will be done remotely)</strong> </p><p><span>Who We Are</span></p><p><span>Cables &amp; Sensors is a highly efficient, fast-growing company that manufactures and distributes accessories for the medical industry in the US and Europe. Although being a small company, we have been awarded with the prestigious Inc 500 Fastest Growing Private Companies in America, ranking at number 377. We are a group of young, smart, perfectionists who love what we do and are proud of being very different from other companies in our industry. We are a high-tech, e-commerce company with a distributed workforce allowing us to work remotely, from our homes of where we most enjoy spending our time. Because we have built an incredibly efficient and organized business, we are very selective about who we hire. If you make it in, we promise you will love working with us.</span></p><p><span>Summary/Objective </span></p><p><span>This position will assist the IT Director with daily activities including managing web development teams for current and future projects as well as managing our API-based workflow automation running multiple web applications including Shopify. This role will be responsible for maintaining and writing software specification documents, documenting processes, managing projects and basic coding. This position requires a high level of organization, creativity and excellent communication with a wide variety of people. It also requires the ability to properly manage time and prioritize as well as making many decisions and/or know when to consult others on them. This person must have prior experience managing development projects be very comfortable with web technologies such as API connections and the Shopify platform.</span></p><p><span>Essential Functions</span></p><ol><li><p><span>Interacting with external development teams who are developing Cables and Sensors’ IT projects, answering questions and resolving requests</span></p></li><li><p><span>Writing detailed, high-quality specification documentation for new developments</span></p></li><li><p><span>Writing low to mid-level code to maintain current developments, perhaps adding new basic features that can be done in-house</span></p></li><li><p><span>Exploring and identifying new tools and solutions for existing problems or improving current technology</span></p></li><li><p><span>QA testing</span></p></li><li><p><span>Managing timelines for various projects and keeping the teams well informed, coordinated and on schedule</span></p></li></ol><p><span>Competencies</span></p><ol><li><p><span>Technical capacity to understand complex web developments involving APIs, front end technologies and databases.</span></p></li><li><p><span>Capability to understand and write API documentation</span></p></li><li><p><span>Thoroughness, the candidate must be detailed oriented and capable of following complex projects until their completion.</span></p></li><li><p><span>Time management, capability to prioritize important tasks and manage large volumes of data.</span></p></li><li><p><span>Communication proficiency, capability to easily communicate with remote teams by phone and email.</span></p></li><li><p><span>Self-driven, motivated and capable of managing his or her own time and work.</span></p></li></ol><p><span>Supervisory Responsibility</span></p><p><span>This position will supervise external, remote development teams.</span></p><p><span>Work Environment</span></p><p><span>This job is a remote position. All office and computer equipment required to perform its duties will be provided by C&amp;S. A dedicated, quiet location with a strong internet connection at home will be required for this position. </span></p><p><span>Our team’s management style is very hands off. Each team member knows their responsibilities and has lots of freedom to do the job how they consider best. Because of this (and our remote style of working), excellent communication is very important within the team. With the high level of freedom comes an equal dose of responsibility.</span><strong></strong></p><p>&nbsp;</p><p><span>Position Type/Expected Hours of Work</span></p><p><span>This is a full-time position, and hours of work and days are Monday through Friday, 8:30AM to 5PM EST. Occasional evening and weekend work may be required as job duties demand. If working from a timezone different of US Eastern Standard Time, after a few months of training, independence of working hours can be achieved.</span></p><p><span>Pace of work is regularly quite high. This does not mean we expect the candidate to be overworked, but rather focused and productive during working hours. We believe that an employee produces best when they have a healthy balance of work and rest (social life, hobbies, family, free time). There will be times when deadlines are at hand and working long hours and weekends will be necessary, as there will also be slow periods when time can be taken off to compensate and take care of self.</span></p><p><span>Travel</span></p><p><span>A couple yearly trips might be required to train or work on-site with other team members.</span></p><p><span>Required Experience</span></p><p><span>Pre-requisites:</span></p><ol><li><p><span>3+ years experience in development such as Javascript, Ruby on Rails, Shopify or API development</span></p></li><li><p><span>2+ years experience managing web development projects</span></p></li><li><p><span>Experience with time management tools such as Trello, Bugherd, Asana, Slack, Google Docs</span></p></li><li><p><span>Experience managing multiple, complex, continuous IT projects</span></p></li><li><p><span>Experience writing software documentation</span></p></li></ol><p><span>Nice-to-haves:</span></p><ol><li><p><span>Basic to medium experience developing APIs and Shopify</span></p></li><li><p><span>Experience managing various IT consultants</span></p></li><li><p><span>Medium to advanced experience with databases</span></p></li><li><p><span>Familiarity with agile project management techniques</span><span><br><br></span></p></li></ol><p><span>Other Duties</span></p><p><span>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. Because C&amp;S is a small, young company, it will be expected, from time to time, for every position in the company to perform tasks that are beyond their job description.</span></p><p><span>Reports to</span></p><p><span>Andres Orjuela, IT Director</span></p><p>&nbsp;</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Nov 14, 2017 12:09:25 AM",
    "tags": [
      "DBG:surround``4N(fulltim, anywher)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG:surround``usa 3W OR(time,timezon)",
      "DBG_TECH1:k/t/w:c/c/10",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=10, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=10, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/ruby",
      "TITLE1/manager",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "c",
      "ruby"
    ]
  },
  {
    "id": "UiEC5W41Q4OdC5tZqr9DQA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/intellasphere-1/jobs/101755-chief-revenue-officer-or-vp-of-sales",
    "title": "Chief Revenue Officer or VP of Sales",
    "content": "<div><h2>Chief Revenue Officer or VP of Sales at IntellaSphere</h2><div>Bellevue, Remote · Full Time</div></div><div><div>Compensation</div><div>$120K–$200K<br>1.0%–3.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>We are seeking an experienced sales leader to effectively drive IntellaSphere’s sales activities in order to maximize customer/subscriber acquisition.  We’re looking for a highly motivated, hands-on sales rock star, who has broad experience growing sales with B2B SaaS-based software and/or a Digital Marketing Agency (preferably experience with both).<br>  <br>Our business is ready to take flight – so we are looking for someone who moves fast, is nimble, comfortable with digital marketing solutions, and has a strong desire to drive revenue and sales to the next level and be part of a winning team.</p><p>Job description</p><p>• Quickly learn, understand and be able to pitch IntellaSphere’s Integrated Marketing System.<br>• Create, communicate and execute on an effective sales approach and sales plan.<br>• Close sales of our full service marketing offering and help drive trial signups of our DIY SaaS-service offering.<br>• Manage all steps of the sales process / sales pipeline, from lead generation to nurturing to closing. <br>• Sell consultatively, assessing the prospective client’s needs and tapping into how our a multi-channel product suite can help them quickly grow their business.<br>• Conceptualize breakthrough sales strategies and programs that drive sales, as well as differentiate and advantage IntellaSphere.  <br>• Serve as an sales ambassador / evangelist for the company.  Instill confidence in and loyalty to our brand.<br>• Determine and optimize cost effective sales initiatives / programs.<br>• Build or better yet, leverage existing relationships at all levels, including small-to-mid-size businesses, digital marketers, marketing agencies and key industry influencers</p></div>",
    "urlFetchPending": false,
    "published": "Nov 13, 2017 10:19:01 PM",
    "tags": [
      "Bellevue",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "269BXMBOTgGZKUsFYHrzWQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-programming",
    "url": "https://weworkremotely.com/jobs/5731-internal-tools-manager",
    "title": "InVisionApp: Internal Tools Manager",
    "content": "<div>  <div>    <h2>Internal Tools Manager</h2>      <h4>Posted Nov 10</h4>    <h3>      <span>InVisionApp</span><br>      <span>Headquarters: New York, NY</span><br>        <a href='https://www.invisionapp.com' rel='nofollow'>https://www.invisionapp.com</a>    </h3>  </div>    </div>  <div>    <div><a href='http://www.invisionapp.com/' rel='nofollow'>InVision</a>&nbsp;is the world’s leading design collaboration platform.</div><div><br></div><div>&nbsp;</div><div><br></div><div>We enable companies of all sizes to discover the power of design-driven product development. That’s why more than 2,000,000 designers, product managers, marketers and other stakeholders at so many of the world's most loved<a href='http://www.invisionapp.com/customers' rel='nofollow'>&nbsp;startups, agencies, &amp; corporations</a>&nbsp;use InVision every day, including Uber, Evernote, Twitter, Adobe, Salesforce and many more.</div><div><br></div><div>&nbsp;</div><div><br></div><div>Our Internal Tooling team strives to develop and maintain high quality, scalable tools and integrations, leveraged by User Enablement, Support, Sales, Training, and other teams. Candidates should be excited at the prospect of serving those teams who so faithfully serve our customers everyday.</div><div><br></div><div><h3><strong>Requirements</strong></h3></div><ul><li>THE CHOPS: You describe yourself as a jack-of-all-trades, thoroughly experienced and excited by modern technologies and services. You are a leader who manages through example and prides themselves on organization and results.</li><li>PASSIONATE ABOUT DESIGN: You understand that design makes everything possible. You are able to distinguish ‘great’ design from ‘pretty’ design. You see the difference design thinking can make in the lives of users. And you understand that even something as historically unpolished as internal tools deserve topnotch UX.</li><li>PROBLEM SOLVER: You enjoy learning how to solve problems in the most efficient way possible. Complexity doesn’t scare you. The challenge of distilling something complex into something simple invigorates and excites you.</li><li>BIASED TOWARD ACTION: You are a self-motivated, action-oriented person. You don’t sit on your hands and wait for someone else to fix a problem. If there is something you can do to make a situation better, you do it.</li><li>FOLLOWS THROUGH: From support staff, to product designers, to engineering – you speak the language of each of these archetypes. You are empathetic, concise, and consistent in your communication and follow-through. You ensure that the team own their commitments, collectively and personally.</li><li>PLAYS WELL WITH OTHERS: You recognize the strengths of your teammates and understand that we will only get where we want to go if we work together. You work with leadership to place team members on projects appropriate to their skill level and team needs.</li></ul><div><h3><strong>Your Experience</strong></h3></div><ul><li>5+ years of experience in Product or Engineering Management (or a similar) role.</li><li>Experience as the direct manager of software engineers in an agile, startup environment.</li><li>Strong problem solving and decision-making ability, with a breadth of experience in both client-side and server-side technologies.</li><li>Strong proficiency preferably in Node.js; solid professional experience in one of the following backend languages: Java, Ruby, Python, PHP also preferred.</li><li>Preference for working in rapid development cycles (2-4 weeks).</li><li>Familiarity with common tools like Git, Jira, Confluence, Jenkins/CI.</li><li>Experience with Continuous Integration/Continuous Delivery environments.</li><li>A proven track record of success in working with product managers, engineers, and various stakeholders to accomplish great things.</li><li>Familiar with modern security best practices, solutions, and technologies.</li><li>Understanding of the technical implications of complex and highly scalable applications.</li><li>The ability to dive right into a big project and manage it from start to finish.</li><li>Ability to thrive in a variable and demanding startup environment.</li><li>Comfortable in a native design environment (Sketch, Photoshop, etc.) and have a good grasp on the tools that are representative of the industry.</li></ul><div><h3><strong>Responsibilities</strong></h3></div><ul><li>You will manage a small -- yet very talented! -- team of engineers to deliver and maintain your products. Leadership responsibilities will aim to consume 20% of your time, with the remainder (80%) dedicated to frontline development.</li><li>You will be the internal subject matter expert and product owner for our Internal Tooling team, responsible for designing, developing, and sustaining a suite of tools and systems integrations.</li><li>You will manage the roadmap, refining feature ideas and maintaining existing features to drive business goals and ensure that the needs of your internal customers are being met.</li><li>Engage stakeholders in leadership, data, support, sales, and engineering and translate their needs into requirements for the various projects you'll oversee.</li><li>Coordinate across teams to maintain product and strategy alignment.</li><li>Invest in team growth and morale to build not just a product, but a team.</li><li>Adjust role specializations, process definitions, and other factors to improve scope control, quality, and velocity.</li></ul><div>&nbsp;</div><div><br></div><div><h3><strong>Benefits</strong></h3></div><div>InVision offers an incredibly unique work environment. The company employs a diverse team all over the world. In the United States we have teams including hubs in New York, San Francisco, Austin, Portland, and Boston. Each InVision team member is given the freedom and tools to do their best work from wherever they choose. Among our benefits we offer competitive health plans, 401k, a flexible vacation policy, unlimited Starbucks cards for each employee, and unlimited books related to your profession.</div><div><br></div><div>&nbsp;</div><div><br></div><div>InVision is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.</div><div></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://boards.greenhouse.io/invision/jobs/906166#.WgXqcBNSx-U' rel='nofollow'>https://boards.greenhouse.io/invision/jobs/906166#.WgXqcBNSx-U</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 10, 2017 9:47:22 PM",
    "tags": [
      "DBG:surround``work 2W from 2W wherev",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:velocity/java/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=1, go=3, nodejs=13, bigdata-ml=0, ruby=2, apple=0, java=10, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/nodejs",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "java",
      "nodejs"
    ]
  },
  {
    "id": "-rWf7_-nSJaOiJmp0txgog",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/open-health-network/jobs/140140-technical-senior-project-manager",
    "title": "Technical Senior Project Manager",
    "content": "<div><h2>Technical Senior Project Manager at Open Health Network</h2><div>Earth, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Project Management, Technical Project Management, Account Management</div><div>Compensation</div><div>$90K–$120K<br>0.1%–0.5%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>We need an experienced technical project manager to manage deployments with our F100 customers. Strong client management skills, technical expertise, super organizational skills required.</p></div>",
    "urlFetchPending": false,
    "published": "Nov 9, 2017 1:09:37 PM",
    "tags": [
      "Account Management",
      "Account Manager",
      "DBG:surround``fulltim 4N remot",
      "Earth",
      "Full Time",
      "Project Management",
      "Project Manager",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown",
      "Technical Project Management"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "iTuxM-EjQgqmQNbbsoiQUw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3974-senior-engineering-manager-npm",
    "title": "Senior Engineering Manager @ npm",
    "content": "<h2>              Senior Engineering Manager<small> @ npm</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-11-09 03:47</p></dd>          <dt><span>Description</span></dt>          <dd><p>npm is the world's largest software repository, with over 10 million users and over 13 billion downloads every month. Our engineering team builds software and services that have become essential to modern JavaScript development, and are used by every company that builds websites.</p><p>We are looking for someone who has worked with teams at startups before. You'll make sure your team members are supported, and aid communication both within your team and with other teams. You'll understand the company's business goals and pro-actively align your team's tasks and priorities to match. You'll have experience hiring engineers, and helping them grow in experience and responsibility as a company evolves.</p><p>You have a background as an experienced engineer who exemplifies our engineering culture: flexible, pragmatic, communicative, and empathetic. You won't be writing production code, but we'll expect you to understand the software your team is building to a degree where you can meaningfully assist in architectural and implementation decisions, both by drawing on your own experience and providing the broader perspective on company goals that your position will give you.</p><p>Leaders at npm are evaluated based on the success of their team.  Your success in this role means pushing authority to information, mentoring your team to continually improve their skill, building trust for each other and for their colleagues, and adapting processes as necessary to execute on our mission.  We believe that having to tell people exactly what to do indicates a failure mode.</p><p>Our team is distributed across locations and timezones, so you must be comfortable with remote work and asynchronous communication patterns. Slack is the hub of all of our workflows, so your skill with textual communication is essential.</p><p>npm is an engineering-centric company and its engineering practices and culture are important to us. In this position you’ll have a chance to influence that culture and help us live up to our values. We emphasize collaboration and thoughtful iteration on our processes as well as our code. We feel that people do their best work when in emotionally safe environments and in their best physical health, and our management team is tasked with creating the culture that makes this possible. Our wish is that we can enable everyone at npm to do the best work of their careers thus far, and set them up to do even better work after npm.</p><p>The work your team will be doing is vital to all of npm’s product plans. It will affect the daily work of millions of JavaScript developers worldwide. If you want to lead an engineering team at the company that has revolutionized web development, this is the job for you.</p><p><strong><em>We will be accepting applicants for this position through Monday, Nov 27, 2017.</em></strong></p><h5>About working here</h5><p>You will most likely be working out of our headquarters in Oakland, California. While many of our team members are spread out around the globe, we will have a preference for local applicants, as this job will be easier with direct real-time communication with a majority of our team. We are open to considering experienced remote candidates, however! We cannot currently sponsor new work visas other than TN-1s, but we can transfer existing H-1Bs.</p><p>npm is not a typical early-stage “work hard/play hard” startup. We are responsible adults with diverse backgrounds and interests, who take our careers and our lives seriously. The best way to iterate towards success is by taking care of ourselves, our families, our users, and one another.</p><p>We aim for a sustainable approach to work and life, because that is the best way to maximize long-term speed, while retaining clarity of vision. Compassion is our strategy.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Nov 9, 2017 5:47:30 AM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG:surround``2N( OR(feasibl,OR(consid,consider),occas,possibl), remot)",
      "DBG:surround``OR(work, countri, locat,contract) 2W anywher",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:npm/nodejs/45",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=47, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "WGalDvWOSYG0ASo85MZP3A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62945",
    "title": "Senior Engineering Manager",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>npm is the world's largest software repository, with over 10 million users and over 13 billion downloads every month. Our engineering team builds software and services that have become essential to modern JavaScript development, and are used by every company that builds websites.<br><br>We are looking for someone who has worked with teams at startups before. You'll make sure your team members are supported, and aid communication both within your team and with other teams. You'll understand the company's business goals and pro-actively align your team's tasks and priorities to match. You'll have experience hiring engineers, and helping them grow in experience and responsibility as a company evolves.<br><br>You have a background as an experienced engineer who exemplifies our engineering culture: flexible, pragmatic, communicative, and empathetic. You won't be writing production code, but we'll expect you to understand the software your team is building to a degree where you can meaningfully assist in architectural and implementation decisions, both by drawing on your own experience and providing the broader perspective on company goals that your position will give you.<br><br>Leaders at npm are evaluated based on the success of their team. Your success in this role means pushing authority to information, mentoring your team to continually improve their skill, building trust for each other and for their colleagues, and adapting processes as necessary to execute on our mission. We believe that having to tell people exactly what to do indicates a failure mode.<br><br>Our team is distributed across locations and timezones, so you must be comfortable with remote work and asynchronous communication patterns. Slack is the hub of all of our workflows, so your skill with textual communication is essential.<br><br>npm is an engineering-centric company and its engineering practices and culture are important to us. In this position you’ll have a chance to influence that culture and help us live up to our values. We emphasize collaboration and thoughtful iteration on our processes as well as our code. We feel that people do their best work when in emotionally safe environments and in their best physical health, and our management team is tasked with creating the culture that makes this possible. Our wish is that we can enable everyone at npm to do the best work of their careers thus far, and set them up to do even better work after npm.<br><br>The work your team will be doing is vital to all of npm’s product plans. It will affect the daily work of millions of JavaScript developers worldwide. If you want to lead an engineering team at the company that has revolutionized web development, this is the job for you.<br><br><strong><em>We will be accepting applicants for this position through Monday, Nov 27, 2017.</em></strong><br><br></p><h4>About working here<br></h4><p><br>You will most likely be working out of our headquarters in Oakland, California. While many of our team members are spread out around the globe, we will have a preference for local applicants, as this job will be easier with direct real-time communication with a majority of our team. We are open to considering experienced remote candidates, however! We cannot currently sponsor new work visas other than TN-1s, but we can transfer existing H-1Bs.<br><br>npm is not a typical early-stage “work hard/play hard” startup. We are responsible adults with diverse backgrounds and interests, who take our careers and our lives seriously. The best way to iterate towards success is by taking care of ourselves, our families, our users, and one another.<br><br>We aim for a sustainable approach to work and life, because that is the best way to maximize long-term speed, while retaining clarity of vision. Compassion is our strategy.</p></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Nov 9, 2017 5:47:30 AM",
    "tags": [
      "DBG:surround``2N( OR(feasibl,OR(consid,consider),occas,possibl), remot)",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:npm/nodejs/35",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=37, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/50",
      "TECH1/nodejs",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "7ZAadz9fSPSUiOdUD5OoFw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/63241/exciting-business-development-manager-opportunity-at-trail-app/",
    "title": "Exciting Business Development Manager Opportunity",
    "content": "About us<br />At Trail, we're on a mission to make operations effortless for everyone.<br /><br /><br />Most of us use hospitality, retail and other service-sector businesses every day. Many of us will have had a job working in these sectors at some point. It’s about long hours, tough work and is run on old-fashioned admin tools. At Trail (trailapp.com), we're trying to change that.<br /><br />We’re a passionate team of 15 with a Moorgate office. After 2 years achieving product-market fit, we're now looking for enthusiastic, charismatic and passionate people ready to take us into the next stage of growth.<br /><br />Overview<br />As Business Development Manager you will work with the Head of Business Development prospecting, qualifying and generating new sales leads. You should be a highly motivated, self-starter. Able to identify and develop new business prospects from multiple sources including inbound marketing leads, prospect lists, discovery and individual research. <br /><br /><br />The Business Development Manager is expected to:<br />Develop new business via telephone, email and social media to introduce Trail to prospective clients/partners and identify appropriate buyers within the target market.<br />Follow up on leads and conduct research to identify potential prospects.<br />Conduct a needs analysis and determine pain points to build a solid business case<br />Identify key buying influencers within these prospects to determine budget and timeline.<br />Build and cultivate prospect relationships by initiating communications, meeting clients and conducting follow-up communications in order to move opportunities through the sales funnel. <br />Work with the Head of Business Development to develop and grow the sales<br />pipeline to consistently meet company goals.<br />Manage data for new and prospective clients in Trail’s CRM tool, ensuring all communications are logged, information is accurate and documents are attached.<br /><br />Requirements<br />Experience in hospitality, retail or leisure industry preferred<br />Excellent written and verbal communication skills<br />London based but we do offer remote working at least one day per week<br /><br /><br />Technical Experience<br />Understanding of Cloud-based technology<br />Experience with CRM Software preferred.<br /><br />Package<br />Competitive salary<br />33 days holiday per annum<br />Equity in company<br />MacBook and Phone<br />Great career progression opportunities<br />A great working culture, remote work, trips abroad, work outings and fun!<br /><br />Due to the high volume of applicants we have received for this role we are unable to respond to all applications, if you have not heard back from us within 14 days then unfortunately your application has been unsuccessful on this occasion. ",
    "urlFetchPending": false,
    "published": "Nov 8, 2017 1:04:06 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) )",
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "fmlJ8hJqQVyG-Guhe9agig",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5685-manager-internal-tools",
    "title": "InVision App: Manager, Internal Tools",
    "content": "<div>  <div>    <h2>Manager, Internal Tools</h2>      <h4>Posted Nov  6</h4>    <h3>      <span>InVision App</span><br>      <span>Headquarters: New York, NY</span><br>        <a href='https://boards.greenhouse.io/invision/jobs/906166#.WgDe9EyZO1s' rel='nofollow'>https://boards.greenhouse.io/invision/jobs/906166#.WgDe9EyZO1s</a>    </h3>  </div>    </div>  <div>    <div><a href='http://www.invisionapp.com/' rel='nofollow'>InVision</a> is the world’s leading design collaboration platform.</div><div></div><div>&nbsp;</div><div><br></div><div></div><div>We enable companies of all sizes to discover the power of design-driven product development. That’s why more than 2,000,000 designers, product managers, marketers and other stakeholders at so many of the world's most loved<a href='http://www.invisionapp.com/customers' rel='nofollow'> startups, agencies, &amp; corporations</a> use InVision every day, including Uber, Evernote, Twitter, Adobe, Salesforce and many more.</div><div><br></div><div></div><div>&nbsp;</div><div><br></div><div></div><div>Our Internal Tooling team strives to develop and maintain high quality, scalable tools and integrations, leveraged by User Enablement, Support, Sales, Training, and other teams. Candidates should be excited at the prospect of serving those teams who so faithfully serve our customers everyday.</div><div><br></div><div><h3><strong>Requirements</strong></h3></div><ul><li>THE CHOPS: You describe yourself as a jack-of-all-trades, thoroughly experienced and excited by modern technologies and services. You are a leader who manages through example and prides themselves on organization and results.</li><li>PASSIONATE ABOUT DESIGN: You understand that design makes everything possible. You are able to distinguish ‘great’ design from ‘pretty’ design. You see the difference design thinking can make in the lives of users. And you understand that even something as historically unpolished as internal tools deserve topnotch UX.</li><li>PROBLEM SOLVER: You enjoy learning how to solve problems in the most efficient way possible. Complexity doesn’t scare you. The challenge of distilling something complex into something simple invigorates and excites you.</li><li>BIASED TOWARD ACTION: You are a self-motivated, action-oriented person. You don’t sit on your hands and wait for someone else to fix a problem. If there is something you can do to make a situation better, you do it.</li><li>FOLLOWS THROUGH: From support staff, to product designers, to engineering – you speak the language of each of these archetypes. You are empathetic, concise, and consistent in your communication and follow-through. You ensure that the team own their commitments, collectively and personally.</li><li>PLAYS WELL WITH OTHERS: You recognize the strengths of your teammates and understand that we will only get where we want to go if we work together. You work with leadership to place team members on projects appropriate to their skill level and team needs.</li></ul><div><h3><strong>Your Experience</strong></h3></div><ul><li>5+ years of experience in Product or Engineering Management (or a similar) role.</li><li>Experience as the direct manager of software engineers in an agile, startup environment.</li><li>Strong problem solving and decision-making ability, with a breadth of experience in both client-side and server-side technologies.</li><li>Strong proficiency preferably in Node.js; solid professional experience in one of the following backend languages: Java, Ruby, Python, PHP also preferred.</li><li>Preference for working in rapid development cycles (2-4 weeks).</li><li>Familiarity with common tools like Git, Jira, Confluence, Jenkins/CI.</li><li>Experience with Continuous Integration/Continuous Delivery environments.</li><li>A proven track record of success in working with product managers, engineers, and various stakeholders to accomplish great things.</li><li>Familiar with modern security best practices, solutions, and technologies.</li><li>Understanding of the technical implications of complex and highly scalable applications.</li><li>The ability to dive right into a big project and manage it from start to finish.</li><li>Ability to thrive in a variable and demanding startup environment.</li><li>Comfortable in a native design environment (Sketch, Photoshop, etc.) and have a good grasp on the tools that are representative of the industry.</li></ul><div><h3><strong>Responsibilities</strong></h3></div><ul><li>You will manage a small -- yet very talented! -- team of engineers to deliver and maintain your products. Leadership responsibilities will aim to consume 20% of your time, with the remainder (80%) dedicated to frontline development.</li><li>You will be the internal subject matter expert and product owner for our Internal Tooling team, responsible for designing, developing, and sustaining a suite of tools and systems integrations.</li><li>You will manage the roadmap, refining feature ideas and maintaining existing features to drive business goals and ensure that the needs of your internal customers are being met.</li><li>Engage stakeholders in leadership, data, support, sales, and engineering and translate their needs into requirements for the various projects you'll oversee.</li><li>Coordinate across teams to maintain product and strategy alignment.</li><li>Invest in team growth and morale to build not just a product, but a team.</li><li>Adjust role specializations, process definitions, and other factors to improve scope control, quality, and velocity.</li></ul><div></div><div>&nbsp;</div><div><br></div><div><h3><strong>Benefits</strong></h3></div><div>InVision offers an incredibly unique work environment. The company employs a diverse team all over the world. In the United States we have teams including hubs in New York, San Francisco, Austin, Portland, and Boston. Each InVision team member is given the freedom and tools to do their best work from wherever they choose. Among our benefits we offer competitive health plans, 401k, a flexible vacation policy, unlimited Starbucks cards for each employee, and unlimited books related to your profession.</div><div><br></div><div></div><div>&nbsp;</div><div><br></div><div></div><div>InVision is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.</div><div><br></div><div></div><div>&nbsp;</div><div><br></div><div></div><div>&nbsp;</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply here: <a href='https://boards.greenhouse.io/invision/jobs/906166#.WgDe9EyZO1s' rel='nofollow'>https://boards.greenhouse.io/invision/jobs/906166#.WgDe9EyZO1s</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 7, 2017 12:22:44 AM",
    "tags": [
      "DBG:surround``work 2W from 2W wherev",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:velocity/java/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=1, go=3, nodejs=13, bigdata-ml=0, ruby=2, apple=0, java=10, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/java",
      "TECH1/nodejs",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "java",
      "nodejs"
    ]
  },
  {
    "id": "WjlRJ3gZS9CDezjn8oNLzA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/chenope/jobs/123108-vp-of-sales",
    "title": "VP of Sales",
    "content": "<div><h2>VP of Sales at Chenope</h2><div>United States, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$60K–$70K<br>2.0%–10.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>We are a bootstrap looking for an experienced VP of Sales, someone who has real startup or small business experience carrying the bag. We are NOT looking for an order taker.   Evangelical selling - and clear evidence of ability to do so - required.  Prior experience in selling to global investment entities such as banks, hedge funds or brokerages required. Proven ability to operate in other markets (or at least the ability to hire and manage salespeople in other markets) highly desired. International experience desirable, but not strictly necessary.</p><p>At our CEO's prior company, Cataphora, the top salespeople had W-2's of $700K+ in a good year.   Because we too are a bootstrap, we offer the unusual combination of real commissions and much higher than average equity cut for the right person. For the same reason, we have a very sales-oriented culture.  If you are a top-notch salesperson who has always wanted to work in a startup but at the same time need to work in the context of a &quot;real business&quot; we are likely the place for you. </p><p>The ideal candidate will be in NYC or London, but other locations would be considered for the right person.    In the US, we offer premium medical insurance as well as dental and vision.</p></div>",
    "urlFetchPending": false,
    "published": "Nov 6, 2017 10:22:38 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:twitter-bootstrap/frontend/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=16}",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/unknown",
      "United States"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "IJ-u5eg-SeyZnBgSvcDKfw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/159519/100-remote-migrations-manager-filevine-llc?a=RuRfQkQclUY",
    "title": "100% Remote Migrations Manager at Filevine LLC (Provo, UT) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Enterprise Software, Law Firms</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>The problem that I want you to solve...</strong></p><p>We are a fast growing software company building highly customizable SaaS products.&nbsp; When we close new customers, those customer have legacy systems full of data of varying quality that they want moved to our system.&nbsp; Since our system is highly customizable, some of that is repeatable and some are one off migrations.</p><p>I need a person that could manage a staff of technical people, but also can make the customer experience good one.&nbsp;&nbsp;Setting customer expectations, creating repeatable processes, dealing with internal and external people.&nbsp; That will require a firm hand and the ability to say &quot;no.&quot;.&nbsp; We currently have a backlog of customers not yet onboarded and sales are ramping up.&nbsp; This is currently a weak point in our operation and we need a person that can make this into a strength.&nbsp;&nbsp;</p><p>Challenges include varying data quality in legacy system, varying cooperation from new customer, commitments are important because new customers often have to cease operations on legacy systems and start on Filevine, creating a relatively small window, managing late process requests for changes - all of the usual migration issues.&nbsp; Key is finding the balance in all of this.&nbsp; No customer wants or will pay for perfect data but we want them happy at the end.&nbsp; That can be a moving target.</p><p>Sk<strong>ills &amp; Requirements</strong></p><p>Ability to manage a technical operation and staff - this often means a technical background</p><p>Ability to navigate the balance between pleasing customers and letting them take advantage</p><p>Ability to setup processes that are reliable</p><p>Ability to set and meet&nbsp;commitments</p><p>Ability to properly set expectations properly</p>                    </div>                            <h2>                About Filevine LLC            </h2>            <div><p>Filevine is a private software company with a product that helps law firms manage their practices. &nbsp;Filevine has two physical locations in Provo, UT and Las Vegas, NV for sales and support.&nbsp; &nbsp;&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 100% Remote Work                            </div>                            <div>                                 Jerk-free Environment                            </div>                            <div>                                 Normal stuff like Health Insurance, Paid Time Off and 401K                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``2W(100, remot)",
      "DBG:surround``benefit 2N 2N(remot,work)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TECH2/database",
      "TECH2/etl",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "database",
      "etl",
      "unknown"
    ]
  },
  {
    "id": "QO95OdaeSy25gzLvhQQDdQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156126/ui-engineering-manager-leading-open-source-elastic?a=Qmj8KEracJa",
    "title": "UI Engineering Manager- Leading Open Source Company at Elastic () (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Lead, Manager</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Data &amp; Analytics, Search, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>501-1k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>With Elastic's continued growth, we are looking for a talented, attentive Engineering Manager to propel and guide our team. Do you feel at home nurturing the success of dynamic, wold class engineers? Are you a top Software Engineering Managers who want to support and lead engineers on Kibana and X-Pack, robust tools which allow visual exploration, real-time data analysis in addition to other powerful features, all while working on core frontend applications? Than we want to meet you.</p><p>If you read this far and think, “that's me!” then you probably won't need to read any further and we should have a conversation. But if you are in any doubt the type of experiences we expect you to have then the following should help clarify;</p><p><em><strong>Please include a short note as to wire you are a fit for Elastic and this role </strong></em></p><p><strong>Kibana is the window into the Stack</strong></p><p>Kibana lets users visualize their Elasticsearch data and navigate the Elastic Stack, so they can do anything from learning why they’re getting paged at 2:00 a.m. to understanding the impact rain might have on their quarterly numbers. Kibana gives users the freedom to select the way they give craft to their data. And they don’t always have to know what they’re looking for. With its interactive visualizations, users start with one question and see where it leads them. Kibana core ships with the classics: histograms, line graphs, pie charts, sunbursts, and more. They demonstrate the full aggregation capabilities of Elasticsearch.</p><p><strong>Engineering Philosophy</strong></p><p>Engineering a highly complex distributed system that is easy to operate via elegantly designed APIs is a non-trivial effort. It requires solid software development skills, and more importantly, a sharp mind and the ability to think like a user. We also care deeply about giving you full ownership of what you’re working on. Our company fundamentally believes great minds achieve greatness when they are set free and are surrounded and challenged by their peers, which is clearly visible in our organization. At Elastic, we effectively don’t have a hierarchy to speak of. We feel that anyone needs to be in the position to comment on absolutely anything, regardless of his or her role within the company.</p><p><strong>What you will be doing:</strong></p><ul><li>Day to day management of 10-15 engineers</li><li>Hiring and recruiting of new staff</li><li>Performance management, reviews and quarterly feedback for the team</li><li>Expense management and approval</li><li>Vacation and time off management and approval</li><li>Project management and prioritization support for the team</li><li>Management of roadmaps and requirements against release targets</li></ul><p><strong>What you've done:</strong></p><ul><li>3+ years of software engineering management</li><li>Recent experience leading teams producing complex interactive web experiences</li><li>An engineering background with a B.S. or equivalent in a Software Engineering related domain</li><li>Experience leading distributed teams</li><li>Experience leading an open source product team</li><li>Familiarity with JavaScript and one or more UI framework: AngularJS, React, Node.js etc...</li></ul>                    </div>                            <h2>                About Elastic            </h2>            <div><p>Elastic is the world's leading software provider for making structured and unstructured data usable in real time for search, logging, security, and analytics use cases. Founded in 2012 by the people behind the Elasticsearch, Kibana, Beats, and Logstash open source projects, Elastic's global community has more than 80,000 members across 45 countries, and since its initial release. Elastic's products have achieved more than 100 million cumulative downloads. Today thousands of organizations, including Cisco, eBay, Dell, Goldman Sachs, Groupon, HP, Microsoft, Netflix, <em>The New York Times</em>, Uber, Verizon, Yelp, and Wikipedia, use the Elastic Stack, X-Pack, and Elastic Cloud to power mission-critical systems that drive new revenue opportunities and massive cost savings. Elastic is backed by more than $104 million in funding from Benchmark Capital, Index Ventures, and NEA; has headquarters in Amsterdam, the Netherlands, and Mountain View, California; and has over 400 employees in more than 30 countries around the world.</p><p><strong>Additional Information</strong></p><ul><li>Competitive pay and benefits</li><li>Stock options</li><li>Catered lunches, snacks, and beverages in most offices</li><li>An environment in which you can balance great work with a great life</li><li>Passionate people building great products</li><li>Employees with a wide variety of interests</li><li>Your age is only a number. It doesn't matter if you're just out of college or your children are; we need you for what you can do.</li></ul><p>Elastic is an Equal Employment employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status or any other basis protected by federal, state or local law, ordinance or regulation. Elastic also makes reasonable accommodations for disabled employees consistent with applicable law.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 401k Matching Up to 6 % in US and Pensions in some other countries                            </div>                            <div>                                 Health Care Insurance                            </div>                            <div>                                 Vacation Time Determined By Location                            </div>                            <div>                                 Lunch and Breakfast in Most Offices                            </div>                            <div>                                 100% Remote work possible                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, avail, allow, abl, possibl, permit)",
      "DBG:surround``2W(100, remot)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG_TECH1:k/t/w:angularjs/frontend/8",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=14, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=17}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TECH2/elasticsearch",
      "TECH2/javascript",
      "TECH2/node.js",
      "TECH2/reactjs",
      "TECH2/user-interface",
      "TITLE1/manager",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "100% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "elasticsearch",
      "frontend",
      "javascript",
      "node.js",
      "nodejs",
      "reactjs",
      "user-interface"
    ]
  },
  {
    "id": "mw4vT7L5RtCYMI9h6WZQ2Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156831/engineering-manager-formstack?a=QAXZRDVDxy8",
    "title": "Engineering Manager at Formstack (Indianapolis, IN) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, SaaS, Web Technology</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span>Formstack, the most flexible and powerful form building application, is looking for an </span><span><strong>Engineering Manager</strong>&nbsp;to add to its already awesome Dev team!</span></p><p>Formstack&nbsp;is an 11&nbsp;year old company with its roots in Indianapolis. Our customers span 110 different countries, and our employees live and work across the U.S. and the globe. We provide a remote work environment that is flexible and provides great freedom for those who can perform.</p><p><strong>What You Will Do:</strong></p><p>You will work directly with the product managers and product design leads to help scope and hand off product features to the development team. Responsibilities include tracking team performance, setting and meeting goals, managing expectations, and delivering software on a deadline.</p><p>The majority of this role will be to manage people, projects and timelines. You should have an understanding of software development and be comfortable helping out when needed.</p><p><strong>Who You Are:</strong></p><p>You are a great leader, listener, decision maker, and can think on your feet. You believe people should lead by example. You have great attention to detail and enjoy keeping track of the who, what, when, where, and why. Constantly thinking about how to improve the development process keeps you up at night. You put your team ahead of yourself and try to do what's best for all parties involved. You aren't scared to make mistakes and try new things to achieve your objectives. You are comfortable not always knowing the answer and without a doubt a great communicator.</p><p><strong>Who We Are:</strong></p><p>We are a group of people who care about our customers and our teammates. We love what we do and what it means to our clients. Relationships are very important to us and we strive to create an environment where you can solve problems creatively and be yourself. We enjoy posting gifs (hard G) to Slack, playing Overwatch, eating lunch on camera (remote lunch get-togethers) and supporting each other. We believe strongly in a work/life balance and letting teams make their own decisions.</p><p><strong>Requirements</strong></p><ul><li>Demonstrated success &nbsp;working in a development environment</li><li>Proven success as a team lead or similar position</li><li>Comfortable managing a team of up to 6-8 developers and QA Analysts (we work in x-functional teams)</li><li>Excellent written and oral communication skills</li><li>Comfortable with agile methodologies &amp; scrum</li><li>Proven ability to manage a remote team of software developers</li><li>Strong experience with PHP, Python, MySQL, Angular and JavaScript</li><li>Passion for quality. Code coverage with unit tests should be as complete as possible. Strive for performance and correctness.</li></ul><p><strong>Extra Credit</strong></p><ul><li>Experience working and managing teams over multiple time zones</li><li>Experience using JIRA or similar software</li></ul><p><strong>What Formstack Offers:</strong></p><ul><li>Remote environment</li><li>Medical, Dental, Vision as well as company-paid Disability and Life Insurance Benefits.</li><li>401k with matching company contribution</li><li>Friday Lunch (Indianapolis Office)</li><li>The most up-to-date technology, including company-issued Macs, the latest software and other tools needed to excel at your job</li><li>Company-paid conferences and extended learning</li><li>Yearly company gatherings</li><li>Generous PTO</li></ul><p>Want to learn more about who we are and what we value?&nbsp;<a href='http://fast.wistia.net/embed/iframe/18hybe1npy?canonicalUrl=https%3A%2F%2Fwww.formstack.com%2Fabout&amp;canonicalTitle=About%20Our%20Team%20%C2%B7%20Formstack' rel='nofollow'>Check out this Video</a>&nbsp;and apply if you want to jump into the next great chapter of your life!</p>                    </div>                                        <h2>Benefits</h2>                            <div>                                 The most up-to-date software                            </div>                            <div>                                 401k Safe Harbor Match                            </div>                            <div>                                 Lunch everyday paid for by Formstack (for employees in Indianapolis)                            </div>                            <div>                                 Generous PTO policy                            </div>                            <div>                                 Remote working office                            </div>                            <div>                                 All the snacks you can handle                            </div>                            <div>                                 Company-contributions to HSA                            </div>                            <div>                                 Monthly company &quot;fun&quot;                            </div>                            <div>                                 Yearly team-building event for the whole company                            </div>                            <div>                                 All the pings and pongs you can handle!                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``OR(home,remot,telecommut) 3W OR(role,work) 4W OR(offic,headquart,onsit)",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:angular/frontend/8",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=9}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TECH2/lead",
      "TECH2/php",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend",
      "lead",
      "php"
    ]
  },
  {
    "id": "UURZqNGGSOKrPGBaljOHng",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/154313/director-data-science-insights-achievement-network?a=PKBTCawBKfe",
    "title": "Director, Data Science & Insights at Achievement Network (Boston, MA) (allows remote)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Data Scientist</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Education, Non-Profit</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><em>Location: &nbsp;Flexible (Boston, MA or New England region preferred)</em></p><p><em>Position available: November 2017</em></p><p><strong><strong>THE OPPORTUNITY</strong></strong></p><p>We are seeking a Director to join the Organizational &nbsp;Effectiveness (OE) team. &nbsp;The OE team ensures that ANet has the right goals that motivate and drive us to achieve our mission, spearheads our shared organizational focus on improving our core service model, and builds a research mindset and capability across ANet’s internal teams. This role reports to the Vice President, Org Effectiveness and is the ideal position for someone who has a passion for growing an organization’s confident use of data in order to shape strategic decisions and to deepen its long-term impact.</p><p>ANet is flexible to remote working, with occasional travel to ANet’s National Office in Boston. Therefore, proximity to the New England area and/or eastern time zone is preferable.</p><p><strong>WHAT YOU’LL DO</strong></p><p><strong>Examine our organizational impact on school performance and hone our organizational focus on impacting school practice</strong></p><ul><li><strong><strong>Lead organization-wide school and student learning impact reporting against annual goals &nbsp;</strong></strong></li></ul><ul><ul><ul><li>Manage complex analyses to extract new insights and year-over-year data patterns that convey a clear, compelling picture of ANet’s national impact over time</li><li>Convey results on goals in a way that is user-friendly and compelling for internal teams &nbsp;and that can be used for external generalist audiences (i.e. impact statements)</li><li>Leverage strong visualizations and presentations to boost end user (primarily senior leadership &amp; marketing/business development teams) comprehension of national impact results</li></ul></ul></ul><ul><li><strong><strong>Lead impact analyses that test and improve ANet’s core service model</strong></strong></li></ul><ul><ul><li>Execute organization-wide annual analyses that identify the relationships between state assessment outcomes (student and school performance) and internal practice with inputs data sources (school demographic data, school practice data, partner school survey data, etc.)</li><li>Conduct complex analyses to &nbsp;extract relevant findings/insights and year-over-year data patterns to share with senior leadership tied to 2020 strategic plan and impact vision</li><li>Partner closely with key business leads to identify annual prioritized research questions, drawing from prior years’ results, annual strategic goals, and ongoing learning agenda priorities</li></ul></ul><ul><li><strong>Lead reporting and analysis of ANet’s evolving non-core service model offerings to assess impact</strong></li></ul><p><strong>Lead long-cycle learning on ANet’s core service model, primarily via mix of data collection and analytic improvement strategies</strong></p><ul><li><strong><strong>Lead data characterization and analyses of newer ANet data sources to deepen ANet’s ability to test and improve its core service model</strong></strong></li></ul><ul><ul><li>Lead exploratory analyses of school partner data to produce new, actionable findings that accelerate improving ANet’s core service model and other service offerings</li><li>In collaboration with other OE team members and internal clients, set key research questions</li><li>Partner with key internal product and program teams to finalize use cases and baseline set definitions, metrics, and modes of analyses</li><li>Define reporting requirements for Engineering team</li><li>Examine and conduct feasibility checks of data in Google Analytics and identify and establish business and analytic rules for using tools such as unSampler</li><li>Explore opportunities with the Engineering team to identify longer-term data storage and cloud solutions</li></ul></ul><p><strong><strong>WHO YOU ARE &amp; WHAT YOU BRING</strong></strong></p><p>Must Have:</p><ul><li>You have prior experience and success designing and leading internal program evaluations and/or business intelligence projects for scaling organizations.</li><li>You bring proficiency and versatility with Excel and at least one statistical analysis software package (R, SAS, Stata, or SPSS) and are confident in advising others on matching the right analytic tool to the analytic task at hand.</li><li>You are optimistic that all of our schools can be successful if we learn together and that comes through in your facility with analyzing information and communicating complex findings to both technical and non-technical audiences.</li></ul><ul><li>You bring proficiency with data visualization software (i.e. Tableau) and website usage analytics and software tools (Google Analytics).</li><li>You are motivated by working in an environment where we live out our core values daily and are eager to examine personal archetypes and biases while discussing topics related to race, class, and privilege which relate to ANet’s Advance Equity and People Matter values</li></ul><p>Nice to Have:</p><ul><li>Prior experience in a school, education, or non-profit setting</li><li>Degree in quantitative field, program evaluation, analytics, or statistics</li><li>Proficiency with unSampler</li><li>SQL proficiency</li></ul><p><strong><em>ANet is committed to maximizing the diversity of our organization. We are an equal opportunity employer and encourage individuals of all ethnic and racial backgrounds and gender identities to apply to our positions.</em></strong></p>                    </div>                            <h2>                About Achievement Network            </h2>            <div><p>Achievement Network (ANet) is a nonprofit dedicated to educational equity. We help schools boost student learning with great teaching that’s grounded in standards, informed by data, and built on the successful practices of educators around the country.</p><p>Founded in 2005, ANet now serves over 700 schools educating over 230,000 students in California, Colorado, Connecticut, District of Columbia, Illinois, Louisiana, Massachusetts, Michigan, New Jersey, New York, Ohio, and Tennessee. Our support has consistently helped our partner schools—both district and charter—achieve breakthrough results for their students. ANet has received multiple awards and recognitions, including a prestigious Investing In Innovation (i3) grant from the federal government in 2010, New Schools Venture Fund’s “Organization of the Year” in 2011, and The NonProfit Time’s “Best Nonprofits to Work For” in 2015 and 2016.</p><p>ANet is a dynamic, values driven, team-oriented organization that is committed to the growth and development of all staff members. Individuals who join ANet have the opportunity to join an exceptional team of colleagues committed to helping schools drive excellent teaching and learning by investing in each other and learning together.</p><p><strong>WHAT WE OFFER</strong></p><p>ANet offers highly competitive compensation based on prior experience and qualifications as well as comprehensive benefits in order to best support our people. Benefits we offer include: health, dental and vision insurance where ANet pays 80% of the cost of these benefits for employees and their families/domestic partner; 3 weeks of vacation (4 weeks after two years with ANet); 10 paid holidays with paid days off between the Christmas and New Year’s holidays; a paid floating holiday; paid sick &amp; personal days; paid parental leave; retirement plan options; commuter benefits; tuition reimbursement; &nbsp;flexible spending accounts; short and long-term disability coverage; and basic life and personal accident insurance.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 80% Health, Dental, Vision                            </div>                            <div>                                 3 Weeks Vacation                            </div>                            <div>                                 10 Paid Holidays                            </div>                            <div>                                 Paid Parental Leave                            </div>                            <div>                                 Retirement Plan Options                            </div>                            <div>                                 Flexible Spending Accounts                            </div>                            <div>                                 Short and Long-Term Disability Coverage                            </div>                            <div>                                 Basic Life and Personal Accident Insurance                            </div>                            <div>                                 Tuition Reimbursement                            </div>                            <div>                                 Commuter Benefits                            </div>                    ",
    "urlFetchPending": false,
    "published": "Nov 4, 2017 2:06:33 PM",
    "tags": [
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``OR(travel,visit) W to 4W OR(offic,headquart,onsit)",
      "DBG_TECH1:k/t/w:boost/c/16",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/16",
      "DBG_TECH1:k/t/w:jersey/java/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=16, mobile=0, go=0, nodejs=0, bigdata-ml=16, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TECH1/c",
      "TECH2/business-intelligence",
      "TECH2/google-analytics",
      "TECH2/r",
      "TECH2/sql",
      "TECH2/tableau",
      "TITLE1/manager",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "50% remote",
      "US East time zone"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "business-intelligence",
      "c",
      "google-analytics",
      "r",
      "sql",
      "tableau"
    ]
  },
  {
    "id": "-Dcgn-gdTz-v02rK28Sp1w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-remote",
    "url": "https://weworkremotely.com/jobs/5650-sales-executive",
    "title": "Productive Power: Sales Executive",
    "content": "<div>  <div>    <h2>Sales Executive</h2>      <h4>Posted Nov  2</h4>    <h3>      <span>Productive Power</span><br>      <span>Headquarters: Miami Beach</span><br>        <a href='http://productivepower.applytojob.com/apply/WNMnJ26eRX/Sales-Executive?source=We+Work+Remotely' rel='nofollow'>http://productivepower.applytojob.com/apply/WNMnJ26eRX/Sales-Executive?source=We+Work+Remotely</a>    </h3>  </div>    </div>  <div>    <div>Are you a self-motivated person with a strong sales background? Do you have a passion for technology and productivity? If so, you could be a perfect sales executive for Productive Power.</div><div><br></div><div>Productive Power helps professionals maximize their productivity through digital training that transforms the way they work. Our Digital Productivity Essentials™ program teaches participants a series of innovative, easy-to-implement best practices that significantly increase organization and productivity. Participants&nbsp;report life-changing results, including the ability to accomplish more, beat deadlines and enjoy peace of mind in and out of the office.</div><div><br></div><div>We are looking for personable and tenacious sales professionals to generate clients across the country. Because our service genuinely solves a need for prospects, they must be effective using a consultative sales approach. Sales executives will follow up on incoming leads, attend&nbsp;networking events, reach&nbsp;out to&nbsp;existing networks and conduct&nbsp;in-person and online presentations. They will work from home and travel locally on a weekly basis.</div><div><br></div><div><strong>Requirements</strong><br></div><ul><li>Bachelor's degree<br></li><li>Successful sales track record<br></li><li>Very adept with technology<br></li><li>Ability to interact comfortably with executives<br></li><li>Exceptional communication skills<br></li><li>Strong organizational skills<br></li><li>Proficient in Microsoft Outlook<br></li><li>Sincere interest in helping people<br></li><li>Ability to work remotely and travel locally<br></li><li>Live in the United States<br></li><li>Be able to commute to a major city within 30 minutes<br></li></ul><div><b><br></b></div><div><b>Compensation Plan</b><br></div><ul><li>Guaranteed $50,000 base salary<br></li><li>Uncapped 10% commission<br></li><li>Paid time off (vacation, personal and sick)<br></li><li>Paid holidays<br></li><li>Employer funded Health Reimbursement Account (HRA)<br></li><li>401(k) plan with company match<br></li></ul><div><span><br></span></div><div>Join our growing team of professionals selling an exciting new service with vast market potential. Reap the financial and intrinsic rewards resulting from selling a service that helps professionals increase the quality of their lives.</div><div><br></div><div>In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.</div><div></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='http://productivepower.applytojob.com/apply/WNMnJ26eRX/Sales-Executive?source=We+Work+Remotely' rel='nofollow'>http://productivepower.applytojob.com/apply/WNMnJ26eRX/Sales-Executive?source=We+Work+Remotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Nov 2, 2017 3:56:04 PM",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "mNAimrB-TMeMrdaD96ePIw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=15604681",
    "title": "BlockSchool | JavaScript Intern (Age 16 or under) | Remote, 5-10 hours per week",
    "content": "<div>                  <span>BlockSchool | JavaScript Intern (Age 16 or under) | Remote, 5-10 hours per week<p>BlockSchool is looking for an intern age 16 or under to help us build an online coding school for kids ages 6-13.</p><p>This once-in-a-lifetime internship opportunity is available to any student anywhere. Work remote for $100 per hour toward college (or a coding bootcamp!) and get professional-level mentorship whenever you need it.</p><p>Responsibilities include:</p><p>- Coding exercises and projects using our JavaScript editor</p><p>- Reviewing and strategizing curriculum content</p><p>- Conducting user testing</p><p>To apply, we request a 1-minute video introducing yourself and any links to projects you have created.</p><p>Apply here: <a href='https://under16.block.school/' rel='nofollow'>https://under16.block.school/</a></p><p>About our kids online coding school: <a href='https://block.school' rel='nofollow'>https://block.school</a><span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Nov 1, 2017 9:27:05 PM",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG_TECH1:k/t/w:javascript/frontend/3",
      "DBG_TECH1:k/t/w:javascript/nodejs/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=3, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=3}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "Dea1MZ9hTNyL5nlSI_I6xw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62379",
    "title": "Head of Support",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><p>Hiya! We’re SkyVerge and we love eCommerce. Our products help merchants manage and grow their online stores, all the way from boutique corner shops to Fortune 500 retailers. We’re looking for a Head of Support to join our fully-distributed team who will improve our support team and processes across our entire suite of products.<br><br><strong>Role</strong><br><br>You’ll be focused on ensuring that our customer support across our products and the platforms we work with continues to meet our high standards, and is constantly improving. You’ll be coaching support and engineering team members on tone and process, doing everything from reviewing drafts, spot-reading replies, assisting in de-escalating difficult threads, to tracking and improving team metrics on replies, response times, and response quality.<br><br>We know that the best learning and understanding comes from hands-on experience, so you’ll also be rolling up your sleeves to assist with support and pre-sales questions across our product suite. We have over 70 different products, so you’re excited that there’s always something new to learn.<br><br>You’ll have the opportunity to dive in and question everything: is what we’re doing effective? How are we measuring success? What standards are we setting? How can we improve and unify process across all products we support? Are our tools supporting our goals?<br><br>We expect that our head of support will be pushing our team forward on customer service best-practices, impeccable tone and voice, accuracy in replies, great supporting documentation, maintaining an internal knowledge base, and overall ensuring that our organization’s support runs as efficiently and seamlessly as a Swiss watch. We have several amazing team members already supporting our customers every day; you’ll be working directly with them to take our support to new heights.<br><br>We expect you to work closely with our product and development teams to ensure we’re building great products, have solid feedback loops in place for further improvements, and that customers get the help they need while running their businesses.<br><br><strong>You</strong><br><br>You have a remarkable knack for understanding our customers’ problems, and working together with them to understand our products and resolve issues. You know good customer service comes from a place full of empathy, helpfulness, and friendliness. Your written communication is crystal-clear and representative of the standards our team should work towards.<br><br>You’re solutions-oriented, self-directed, curious, and love solving problems. No question is too difficult for you to research, critically evaluate current best-practices, then develop your own path forward for an optimal solution or potential improvements. You can do this on your own, or work with a team to drive a project forward. You question existing practices and seek out the “best” way to do things.<br><br>To succeed in this role, you’ll have:<br><br></p><ul><li>excellent written communication and native-level English fluency. (Do you have proficiency in other languages? Tell us! We love being able to support customers in their native language.)<br></li><li>ability to thrive in a remote environment (along with a reliable internet connection).<br></li><li>above-average skills for reporting on and evaluating data &amp; support metrics.<br></li><li>boundless curiosity and inquisitiveness for our products and how we can do things better.<br></li><li>high technical competency, such as ability to use FTP, launch a website from scratch, and understand software development in general.<br></li><li>proficiency with HTML / CSS.<br></li><li>experience writing technical documentation or guides.<br></li><li>experience in previous team captain or leadership roles.<br></li><li>experience in supporting software (downloadable or SaaS, we do both!).<br><br>It’s helpful if you have:<br><br></li><li>experience with eCommerce, or with platforms we work with in particular (Shopify, WooCommerce, Easy Digital Downloads).<br></li><li>experience in building, fixing, or maintaining software (if you have PHP, JavaScript, Ruby, etc., skills, let us know).<br></li><li>previous experience working remotely.<br></li><li>are US or CA-based for maximum overlap with our existing support team.<br><br>Our team is fully-remote and we communicate primarily through Slack, GitHub, Help Scout, and weekly stand-ups on Monday via Zoom (a few short meetings on Monday) — we believe the best work happens when given lots of uninterrupted time that’s free of distractions. That said, we believe face time is valuable — availability for 1-2 company-paid team trips (<a href='https://www.skyverge.com/blog/skytrip-2017-recap/' rel='nofollow'>SkyTrip!</a>) per year is necessary.<br>This is a full-time, salaried position, but hours are flexible. We know your work will speak for itself with support metric improvements, documentation added, and wiki edits.<br><br><strong>Process</strong><br><br>Qualified candidates will get an email with a few questions to answer via email. Following that, you’ll have a few 30-minute phone chats with different people on our team to learn more about you and answer any questions you have about the position and company. <br><br>If this goes well, we’ll invite you to join our team and start your 4-week trial. During this period, you’ll work full-time as a contractor, or part-time on nights/weekends if you already have a full-time position. This gives you an opportunity to make sure you enjoy the work and the team, and it gives us an opportunity to evaluate your work. We’ll have regular chats each week to share feedback and make sure we’re on the same page. At the end of the 4 weeks, you’ll be offered a permanent position  <br><br><strong>Benefits</strong><br><br>Here are some benefits we're excited to offer to our team members:<br><br></li><li>Competitive salary<br></li><li>Annual incentive for meeting team and company goals<br></li><li>25 days of paid time-off, in addition to 2 company holidays (SkyVerge Day in March, Founders Day in June )<br></li><li>Medical, Dental, and Vision insurance for US and Canadian residents and their families (reimbursements for comparable care for non-US/Canadian residents)<br></li><li>401k/RRSP Retirement plan with 4% company match for US/Canadian residents (contributions to comparable plans for non-US/Canadian residents)<br></li><li>Work from anywhere that has a reliable internet connection<br></li><li>The tools (hardware/software) you need to be productive<br></li><li>Allowance for professional growth (books, courses, conferences)<br></li><li>Home office or co-working allowance<br></li><li>A Kindle to help you keep learning<br><br><em>We support workplace diversity and do not discriminate on any protected class. We believe when we work together as a team of different views, experiences, and ideas, we can build amazing things.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 6:20:34 AM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work, countri, locat,contract) 2W anywher",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:woocommerce/php/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=13, embedded=0, frontend=4}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "R-qCENOMS_O2H9dhBy6Dtg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/jobs/5634-head-of-support",
    "title": "SkyVerge: Head of Support",
    "content": "<div>  <div>    <h2>Head of Support</h2>      <h4>Posted Oct 31</h4>    <h3>      <span>SkyVerge</span><br>      <span>Headquarters: Remote</span><br>        <a href='http://www.skyverge.com' rel='nofollow'>www.skyverge.com</a>    </h3>  </div>    </div>  <div>    <div>Hiya! We’re SkyVerge and we love eCommerce. Our products help merchants manage and grow their online stores, all the way from boutique corner shops to Fortune 500 retailers. We’re looking for a Head of Support to join our fully-distributed team who will improve our support team and processes across our entire suite of products.</div><div><br></div><div></div><div><span><b>Role</b></span></div><div><br></div><div></div><div><span>You’ll be focused on ensuring that our customer support across our products and the platforms we work with continues to meet our high standards, and is constantly improving. You’ll be coaching support and engineering team members on tone and process, doing everything from reviewing drafts, spot-reading replies, assisting in de-escalating difficult threads, to tracking and improving team metrics on replies, response times, and response quality.</span></div><div><br></div><div></div><div><span>We know that the best learning and understanding comes from hands-on experience, so you’ll also be rolling up your sleeves to assist with support and pre-sales questions across our product suite. We have over 70 different products, so you’re excited that there’s always something new to learn.</span></div><div><br></div><div></div><div><span>You’ll have the opportunity to dive in and question everything: is what we’re doing effective? How are we measuring success? What standards are we setting? How can we improve and unify process across all products we support? Are our tools supporting our goals?</span></div><div><br></div><div></div><div><span>We expect that our head of support will be pushing our team forward on customer service best-practices, impeccable tone and voice, accuracy in replies, great supporting documentation, maintaining an internal knowledge base, and overall ensuring that our organization’s support runs as efficiently and seamlessly as a Swiss watch. We have several amazing team members already supporting our customers every day; you’ll be working directly with them to take our support to new heights.</span></div><div><br></div><div></div><div><span>We expect you to work closely with our product and development teams to ensure we’re building great products, have solid feedback loops in place for further improvements, and that customers get the help they need while running their businesses.</span></div><div><br></div><div></div><div><span><b>You</b></span></div><div><br></div><div></div><div><span>You have a remarkable knack for understanding our customers’ problems, and working together with them to understand our products and resolve issues. You know good customer service comes from a place full of empathy, helpfulness, and friendliness. Your written communication is crystal-clear and representative of the standards our team should work towards.</span></div><div><br></div><div></div><div><span>You’re solutions-oriented, self-directed, curious, and love solving problems. No question is too difficult for you to research, critically evaluate current best-practices, then develop your own path forward for an optimal solution or potential improvements. You can do this on your own, or work with a team to drive a project forward. You question existing practices and seek out the “best” way to do things.</span></div><div><br></div><div></div><div><span>To succeed in this role, you’ll have:</span></div><div><br></div><div></div><ul><li><span>excellent written communication and native-level English fluency. (Do you have proficiency in other languages? Tell us! We love being able to support customers in their native language.)</span></li><li><span>ability to thrive in a remote environment (along with a reliable internet connection).</span></li><li><span>above-average skills for reporting on and evaluating data &amp; support metrics.</span></li><li><span>boundless curiosity and inquisitiveness for our products and how we can do things better.</span></li><li><span>high technical competency, such as ability to use FTP, launch a website from scratch, and understand software development in general.</span></li><li><span>proficiency with HTML / CSS.</span></li><li><span>experience writing technical documentation or guides.</span></li><li><span>experience in previous team captain or leadership roles.</span></li><li><span>experience in supporting software (downloadable or SaaS, we do both!).</span></li></ul><div><span><br></span></div><div></div><div><span>It’s helpful if you have:</span></div><div><br></div><div></div><ul><li><span>experience with eCommerce, or with platforms we work with in particular (Shopify, WooCommerce, Easy Digital Downloads).</span></li><li><span>experience in building, fixing, or maintaining software (if you have PHP, JavaScript, Ruby, etc., skills, let us know).</span></li><li><span>previous experience working remotely.</span></li><li><span>are US or CA-based for maximum overlap with our existing support team.</span></li></ul><div><span><br></span></div><div></div><div><span>Our team is fully-remote and we communicate primarily through Slack, GitHub, Help Scout, and weekly stand-ups on Monday via Zoom (a few short meetings on Monday) — we believe the best work happens when given lots of uninterrupted time that’s free of distractions. That said, we believe face time is valuable — availability for 1-2 company-paid team trips (<a href='https://www.skyverge.com/blog/skytrip-2017-recap/' rel='nofollow'><span>SkyTrip!</span></a>) per year is necessary.</span></div><div><br></div><div></div><div><span>This is a full-time, salaried position, but hours are flexible. We know your work will speak for itself with support metric improvements, documentation added, and wiki edits.</span></div><div><br></div><div></div><div><span><b>Process</b></span></div><div><br></div><div></div><div><span>Qualified candidates will get an email with a few questions to answer via email. Following that, you’ll have a few 30-minute phone chats with different people on our team to learn more about you and answer any questions you have about the position and company.</span></div><div><br></div><div></div><div><span>If this goes well, we’ll invite you to join our team and start your 4-week trial. During this period, you’ll work full-time as a contractor, or part-time on nights/weekends if you already have a full-time position. This gives you an opportunity to make sure you enjoy the work and the team, and it gives us an opportunity to evaluate your work. We’ll have regular chats each week to share feedback and make sure we’re on the same page. At the end of the 4 weeks, you’ll be offered a permanent position </span></div><div><br></div><div></div><div><span><b>Benefits</b></span></div><div><br></div><div></div><div><span>Here are some benefits we're excited to offer to our team members:</span></div><div><br></div><div></div><ul><li><span>Competitive salary</span></li><li><span>Annual incentive for meeting team and company goals</span></li><li><span>25 days of paid time-off, in addition to 2 company holidays (SkyVerge Day in March, Founders Day in June )</span></li><li><span>Medical, Dental, and Vision insurance for US and Canadian residents and their families (reimbursements for comparable care for non-US/Canadian residents)</span></li><li><span>401k/RRSP Retirement plan with 4% company match for US/Canadian residents (contributions to comparable plans for non-US/Canadian residents)</span></li><li><span>Work from anywhere that has a reliable internet connection</span></li><li><span>The tools (hardware/software) you need to be productive</span></li><li><span>Allowance for professional growth (books, courses, conferences)</span></li><li><span>Home office or co-working allowance</span></li><li><span>A Kindle to help you keep learning</span></li></ul><div><span><br></span></div><div></div><div><span><i>We support workplace diversity and do not discriminate on any protected class. We believe when we work together as a team of different views, experiences, and ideas, we can build amazing things.</i></span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply directly via this link: <a href='https://skyverge.workable.com/jobs/600766' rel='nofollow'>https://skyverge.workable.com/jobs/600766</a>. Applications accepted until November 17th.</p>  </div>",
    "urlFetchPending": false,
    "published": "Oct 31, 2017 6:00:59 AM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work, countri, locat,contract) 2W anywher",
      "DBG:surround``headquart 3N remot",
      "DBG:surround``remot 3N (team OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:k/t/w:woocommerce/php/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=2, apple=0, java=0, gamedev=0, php=13, embedded=0, frontend=4}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "04L6GCc2QTqeYN242Bc3PA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/29963?r=rss2",
    "title": "e9digital: Project Manager/Website Producer",
    "content": "<p>Part-time</p><p><strong>(Midtown Manhattan)</strong> </p><p><strong>e9digital</strong> is one of the top rated digital agencies in Manhattan and NYC.</p><p>We have over 200 clients under management and produce 10+ projects at any one time.</p><p>We're seeking an experienced project manager to interface with our clients and manage our development teams to deliver on-time, on-budget projects.</p><p><strong>Experience:<br></strong>We are looking for a candidate that has a minimum of 3+ years experience and proven track record on dozens of website proejcts.</p><p>You must have great written and verbal communication skills, and have that soft touch that clients love.</p><p><strong>Location:<br></strong>Bacause of our banking clients' security requirements <strong>you must be a US Citizen located in the USA.</strong> You can work remotely since most of our meetings with clients and team are done via uberconference, but if you are in the NYC area, you can work at our Midtown studio if you want.&nbsp;</p><p><strong>Compensation:</strong><br>We will pay an hourly rate commensurate with experience, so tell us what your rate is.</p><p>We pay staff and freelancers twice per month, so you'll never wait for your compensation with us.</p><p>We expect that you will have 20 to 30 hours per week at the start, and that could quickly grow to 40 hours per week.</p><p><strong>Job Responsibilities:</strong><br>1) Reports directly to the Creative Director and CEO<br>2) Serves as Leader of organizational processes, protocols, practices<br>3) Serves as point of contact for clients with new website/marketing projects as well as websites/projects in maintenance and/or maintenance requests.<br>4) Schedules, coordinates, and enforces all phases (from inception to completion) of new project/maintenance tasks with Creative Director, Production Team<br>5) Request/Source/Manage resources; measures the profitability of using resources. Management will approve or deny requested resources.<br>6) Leads regularly staff &quot;stand-up&quot; meetings/events covering &quot;big picture&quot; + production/scheduling details<br>7) Maintain/cultivate Expert level knowledge of web technology/best practices, digital industry developments<br>8) Provides ad hoc administrative support to designers, engineers, sales as schedule permits<br>9) Analyzes Internal Processes on ongoing basis to look for ways to improve efficiency, quality, team spirit<br>10) Documents all ongoing project/process intelligence for future reference<br><br><strong>-- FOR NEW website/creative projects:</strong><br>1) Gathers all Project Summary, other client background info from Sales<br>2) Creates Project Kickoff documentation containing all necessary, relevant background info<br>3) Schedules, co-leads (with Creative Director) Project Kickoff Meeting with Client + other pertinent personnel<br>4) Documents all meeting interactions, follows through with summary to client, CD; collects all assets necessary from client<br>5) Initiates internal Creative/Production brief document to be shared with Production Team<br>6) Creates Project schedule with checkpoints, Coordinates with CD to properly staff assigned production team<br>7) Schedules, co-leads (with Creative Director) Creative Presentation Meeting (follows through per #4)<br>8) Communicates regularly with Client, CD/Production Team to ensure scheduling milestones met<br>9) Facilitates content + tech production if skills/schedule permits<br>10) Manages website QA + site launch process; print production proof/fulfillment process, plus all other media fulfillment process<br>11) Trains clients on basic WordPress editing/content management<br><br><strong>-- FOR MAINTENANCE tasks/requests:</strong><br>1) Documents, analyzes, parses all client's new projects and maintenance requests before assigning to production team.<br>2) For simple WordPress updates, offers advice and/or assistance to the client.<br>3) For more complex tasks, confers with CD and/or engineer to evaluate best approach (may mean pushing back on client request)<br>4) Manages QA, task fulfillment</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Oct 29, 2017 5:12:07 PM",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``can 2W remot",
      "DBG_TECH1:k/t/w:wordpress/php/10",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=10, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "i8fghqR8RkSuT6ifnOVapw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/swiggy/jobs/59331-intern",
    "title": "Intern",
    "content": "<div><h2>Intern at Swiggy</h2><div>Bengaluru, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>₹120K–₹180K<br>No Equity</div></div><h3>Job Description</h3><div><p>We’re looking for people ...</p><p>who are:  good at problem solving and believe in Fire-n-Motion way of approaching solutions.</p><p>who can help with tasks related to: restaurant discovery and delivery logistics back-end and related automation</p><p>who enjoy/want to work on:<br>Fulltext Search Platforms<br>Optimization Algorithms (On-demand Assignment Problem)<br>RESTful APIs<br>Architectural backend tuning for scale</p><p>who've got hands-on on a few of the following:<br>LAMP stack (don't judge, we use HHVM)<br>HTML, JS/CSS<br>Java, Python, PHP</p><p>and lastly who believe in writing indented, modular code if not strictly object-based programming.</p></div>",
    "urlFetchPending": false,
    "published": "Oct 27, 2017 1:14:31 PM",
    "tags": [
      "Bengaluru",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:lamp/php/13",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=2, gamedev=0, php=18, embedded=0, frontend=4}",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Software Engineer",
      "TECH1/php",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "E8BsWNYdThe6TpHTweH3Ug",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/3944-engineering-manager-observability-team-etsy",
    "title": "Engineering Manager, Observability Team @ Etsy",
    "content": "<h2>              Engineering Manager, Observability Team<small> @ Etsy</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2017-10-23 03:21</p></dd>          <dt><span>Description</span></dt>          <dd><h4>Etsy is seeking an Engineering Manager to join our team.</h4><p>As Etsy grows, the technical infrastructure and platforms need to continue to enable Etsy's growth while providing innovative ways to improve our systems. The Observability team is tasked with making that happen for all metrics, logging and alerting needs and we're looking for someone to manage this team.</p><p>Etsy is actively preparing to move systems to a cloud provider, and this team play a key role in this work. This is an exciting and revolutionary time to join Etsy as engineering embarks on its next generation work, offering an opportunity to be part of the teams that run the infrastructure that connects millions of sellers and customers</p><p>This is a full-time position based in Etsy’s Brooklyn office or remote in a US timezone.</p><p><strong>About the Teams</strong></p><p>The Observability team is a fluid and dynamic group. We work across Engineering to provide teams with tools, platforms and insights into how their systems are performing. The team strives for situational awareness; we know that failure happens, and sometimes we even cause them to happen on purpose. Being nice is a requirement. You will likely learn more about collaboration at Etsy than you have anywhere else.</p><p><strong>About the Role</strong></p><ul><li>Manage the career development of a team of highly collaborative systems engineers</li><li>Contribute to technical discussions within your team to help increase the efficiency, stability, deliverability, and maintainability of everything your team produces</li><li>Participate in the greater company discussions to help set the direction for Etsy’s engineering team</li><li>Offer strategic direction, provide space for the team to create solutions</li><li>Work asynchronously with people spread geographically between Europe, East Coast and the West Coast</li><li>Regular 1:1s with team members, team meetings, representing the team within Systems Engineering and across the wider Engineering org</li><li>Curiosity regarding what makes people tick</li></ul><p><strong>About You</strong></p><ul><li>Have prior experience managing teams</li><li>Understand the importance of authenticity and mindfulness in leadership</li><li>Have excellent written and verbal communication skills</li><li>Are as excited by the challenges of nurturing a team as you are by the technical challenges of building systems</li><li>Help those around you grow as engineers and be successful</li><li>Enjoy learning about and interacting with the people who use your systems</li><li>What is nice to have, but not essential</li><li>Relevant domain experience</li><li>Experience with bare metal and cloud environments</li></ul><p><strong>Why Etsy</strong></p><ul><li>We are very open about how we build things and the tools we have created to get things done. Read more on our technical blog, <a href='https://codeascraft.com/' rel='nofollow'>CodeAsCraft</a></li><li>We open source a lot of <a href='https://github.com/etsy' rel='nofollow'>code</a></li><li>We have amazing offices in the heart of Dublin city and Brooklyn, and ensure our remote employees don’t miss out either!</li><li>We genuinely care about our talented teams and offer a fantastic <a href='https://blog.etsy.com/ca/news/2016/strong-families-strong-business-a-step-forward-in-parental-leave-at-etsy/' rel='nofollow'>parental leave policy</a>, Health Care, Dental Care, Sabbatical leave and many more exciting benefits</li><li>Most importantly we’re a social bunch with global offices full of fun, innovation, awesome people and all kinds of interesting events and we are continuously growing!</li></ul><p><strong>What’s Next</strong></p><p>Interested in joining the team? Send us a cover letter and your resume explaining why you’d be great for the job. We value individuality and variety, so make sure to tell us what you’re all about. If you have an online presence (blog, Twitter, Facebook), send it along. And if you write, draw, craft, or contribute to something you’re proud of, we’d love to hear about it. </p><p><em>Etsy is proud to be an equal opportunity employer and will consider all qualified applicants regardless of color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital or family status, disability, gender identity or expression, veteran status, actual or presumed belonging to an ethnic group, or any other legally protected status. If you have a disability or special need that requires accommodation, please let us know.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:21:51 AM",
    "tags": [
      "DBG:surround``(work OR countri OR locat OR contract) 2W anywher",
      "DBG:surround``OR(work, countri, locat,contract) 2W anywher",
      "DBG:surround``remot 16W timezon",
      "DBG:surround``usa 3W OR(time,timezon)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "ST2pzLrySG2tEiq2SFsORA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "remoteok.io",
    "url": "https://remoteok.io/jobs/62240",
    "title": "Engineering Manager Observability Team",
    "content": "<td><a rel='nofollow'><div></div></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><a rel='nofollow'></a><a rel='nofollow'></a></td><td><span><h3>Etsy is seeking an Engineering Manager to join our team.<br></h3><p><br>As Etsy grows, the technical infrastructure and platforms need to continue to enable Etsy's growth while providing innovative ways to improve our systems. The Observability team is tasked with making that happen for all metrics, logging and alerting needs and we're looking for someone to manage this team.<br><br>Etsy is actively preparing to move systems to a cloud provider, and this team play a key role in this work. This is an exciting and revolutionary time to join Etsy as engineering embarks on its next generation work, offering an opportunity to be part of the teams that run the infrastructure that connects millions of sellers and customers<br><br>This is a full-time position based in Etsy’s Brooklyn office or remote in a US timezone.<br><br><strong>About the Teams</strong><br><br>The Observability team is a fluid and dynamic group. We work across Engineering to provide teams with tools, platforms and insights into how their systems are performing. The team strives for situational awareness; we know that failure happens, and sometimes we even cause them to happen on purpose. Being nice is a requirement. You will likely learn more about collaboration at Etsy than you have anywhere else.<br><br><strong>About the Role</strong><br><br></p><ul><li>Manage the career development of a team of highly collaborative systems engineers<br></li><li>Contribute to technical discussions within your team to help increase the efficiency, stability, deliverability, and maintainability of everything your team produces<br></li><li>Participate in the greater company discussions to help set the direction for Etsy’s engineering team<br></li><li>Offer strategic direction, provide space for the team to create solutions<br></li><li>Work asynchronously with people spread geographically between Europe, East Coast and the West Coast<br></li><li>Regular 1:1s with team members, team meetings, representing the team within Systems Engineering and across the wider Engineering org<br></li><li>Curiosity regarding what makes people tick<br><br><strong>About You</strong><br><br></li><li>Have prior experience managing teams<br></li><li>Understand the importance of authenticity and mindfulness in leadership<br></li><li>Have excellent written and verbal communication skills<br></li><li>Are as excited by the challenges of nurturing a team as you are by the technical challenges of building systems<br></li><li>Help those around you grow as engineers and be successful<br></li><li>Enjoy learning about and interacting with the people who use your systems<br></li><li>What is nice to have, but not essential<br></li><li>Relevant domain experience<br></li><li>Experience with bare metal and cloud environments<br><br><strong>Why Etsy</strong><br><br></li><li>We are very open about how we build things and the tools we have created to get things done. Read more on our technical blog, <a href='https://codeascraft.com/' rel='nofollow'>CodeAsCraft</a></li><li>We open source a lot of <a href='https://github.com/etsy' rel='nofollow'>code</a></li><li>We have amazing offices in the heart of Dublin city and Brooklyn, and ensure our remote employees don’t miss out either!<br></li><li>We genuinely care about our talented teams and offer a fantastic <a href='https://blog.etsy.com/ca/news/2016/strong-families-strong-business-a-step-forward-in-parental-leave-at-etsy/' rel='nofollow'>parental leave policy</a>, Health Care, Dental Care, Sabbatical leave and many more exciting benefits</li><li>Most importantly we’re a social bunch with global offices full of fun, innovation, awesome people and all kinds of interesting events and we are continuously growing!<br><br><strong>What’s Next</strong><br><br>Interested in joining the team? Send us a cover letter and your resume explaining why you’d be great for the job. We value individuality and variety, so make sure to tell us what you’re all about. If you have an online presence (blog, Twitter, Facebook), send it along. And if you write, draw, craft, or contribute to something you’re proud of, we’d love to hear about it. <br><br><em>Etsy is proud to be an equal opportunity employer and will consider all qualified applicants regardless of color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital or family status, disability, gender identity or expression, veteran status, actual or presumed belonging to an ethnic group, or any other legally protected status. If you have a disability or special need that requires accommodation, please let us know.</em></li></ul></span></td><td></td><td></td><td><a rel='nofollow'><div></div></a></td>",
    "urlFetchPending": false,
    "published": "Oct 23, 2017 6:21:51 AM",
    "tags": [
      "DBG:surround``remot 16W timezon",
      "DBG:surround``usa 3W OR(time,timezon)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "100% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "8rwxmmI7T8KgA1_CkLhy2A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/footprintchat/jobs/104261-vp-product",
    "title": "VP Product",
    "content": "<div><h2>VP Product at Footprint</h2><div>San Francisco, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Javascript, Software Development, Product Management, Android, iOS Development, Programming: 3P APIs &amp; Libraries, Product Development, Leadership, Enterprise Software, CTO, Cross-Functional Team Leadership, Cross Platform Mobile Development, Enterprise Architecture, Sales/Marketing and Strategic Partnerships, Leadership and Team Inspiration, Engineering Leadership, Engineering, Product Design, Start-Up CTO, React.js, Instrumentation, Go</div><div>Compensation</div><div>$100K–$175K<br>1.0%–4.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>As the VP Product at Footprint Labs, you'll be the leader of our product and engineering teams.  </p><p>Working directly with our CEO (head of product), your mission is to achieve product parity across all platforms: Android, iPhone, iPad, mobile web, and desktop web--in parallel. </p><p>This means any action you can take on Footprint can be performed on every platform.</p><p>This means our production releases across all platforms are synced, too. </p><p>This means you're the captain, now. </p><p>About You: You're a missionary at heart and a proven technology leader both in your head and in practice. </p><p>You can execute software across multiple platforms, in parallel. You can build and manage a backlog, deploy resources accordingly, manage product managers and designers, and keep the backlog and other instrumentation devices updated weekly. Engineers, Product Managers, and Product Designers like working with you and for you. You play well with marketing and sales. You believe in an innovation-first approach but are well grounded in serving customer needs. When making decisions, you're skilled at making sense of gut vs. data. You've worked with distributed engineering teams. You understand and believe in Continuous Integration and Continuous Delivery. You don't believe in process for process' sake, however, and can distinguish between tasks that need to be fully automated and those that need a lighter touch.</p><p>You want to help build a world-class company.</p><p>Responsibilities <br>- Manage product delivery across web (cross-browser), mobile web, iPhone, iPad, Android, and desktop apps<br>- Manage product design across web (cross-browser), mobile web, iPhone, iPad, Android, and desktop apps<br>- Manage design, product, and engineering communication<br>- Work closely with the CEO to define product<br>- Write software specs and manage the writing of specs<br>- Prepare product presentations to the CEO and board<br>- Recruit, train, and expand the entire product team at Footprint<br>- Instrument everything<br>- Talk to customers</p></div>",
    "urlFetchPending": false,
    "published": "Oct 12, 2017 8:45:35 PM",
    "tags": [
      "Android",
      "CTO",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:android/java/4",
      "DBG_TECH1:k/t/w:android/mobile/8",
      "DBG_TECH1:k/t/w:cross-browser/frontend/26",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:iphone/apple/6",
      "DBG_TECH1:k/t/w:iphone/mobile/6",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=16, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=8, java=4, gamedev=0, php=0, embedded=0, frontend=27}",
      "Enterprise Software",
      "Full Time",
      "Javascript",
      "Leadership",
      "Product Development",
      "Product Management",
      "Programming: 3P APIs & Libraries",
      "REMOTE1/100",
      "Remote OK",
      "San Francisco",
      "Software Development",
      "Software Engineer",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/unknown",
      "iOS Development"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "zxv0_uHJQQaV6SkbrRihXQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/appzilo-3/jobs/134958-it-assistant-project-manager",
    "title": "IT Assistant Project Manager",
    "content": "<div><h2>IT Assistant Project Manager at AppZilo</h2><div>Malaysia, Remote · Full Time</div></div><div><div>Skills</div><div>Javascript, HTML, CSS, ActionScript, Flash, UI/UX Design, SCRUM, HTML5 &amp; CSS3, JSON / XML / HTML / Javascript / JQuery, Jave Programming</div><div>Compensation</div><div>$5K–$14K<br>No Equity</div></div><h3>Job Description</h3><div><p>Responsibilities</p><p>Work with remote team<br>Responsible for project and resource scheduling, project tracking, risk management and quality assurance<br>Oversee the implementation of the projects. Track all project phases &amp; activities and monitor progress and dependencies<br>Able to effectively lead and work closely with project team and solve problems, cultivate team cohesiveness &amp; teamwork<br>Strong in driving project implementation and delivery</p><p>Requirements</p><p>Possess at least Diploma , Advance / Higher / Graduate Diploma , Bachelor's Degree or Master 's Degree in Computer Science / Information Technology , Engineering ( Computer / Telecommunication) or equivalent.<br>Have a minimum of 5 years' experience , with at least 3 years' in project management and solutioning.<br>Good knowledge of scrum and agile methodlogy<br>Experience with PHP, MYSQL, HTML/CSS, Javascript(jQuery), Flash, Actionscript, AJAX, Testing Methodology, UI Design<br>Required Language(s): English and Chinese . Both oral and written is preffered<br>Willing to travel and work in overseas project<br>Applicants should be Malaysian citizen or hold relevant residence status<br>Full-Time position available</p></div>",
    "urlFetchPending": false,
    "published": "Oct 10, 2017 10:02:04 PM",
    "tags": [
      "ActionScript",
      "Backend Developer",
      "CSS",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:ajax/frontend/3",
      "DBG_TECH1:k/t/w:css/frontend/6",
      "DBG_TECH1:k/t/w:flash/frontend/16",
      "DBG_TECH1:k/t/w:html5/frontend/5",
      "DBG_TECH1:k/t/w:javascript/frontend/5",
      "DBG_TECH1:k/t/w:javascript/nodejs/5",
      "DBG_TECH1:k/t/w:jquery/frontend/16",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=5, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=51}",
      "Flash",
      "Frontend Developer",
      "Full Time",
      "HTML",
      "HTML5 & CSS3",
      "JSON / XML / HTML / Javascript / JQuery",
      "Javascript",
      "Jave Programming",
      "Malaysia",
      "Mobile Developer",
      "REMOTE1/100",
      "Remote OK",
      "SCRUM",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/unknown",
      "UI/UX Design"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "Du2MKdFST9W6gGBqkpFUCw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/promethean-energy/jobs/122596-technical-sales-executive",
    "title": "Technical Sales Executive",
    "content": "<div><h2>Technical Sales Executive at Promethean Energy</h2><div>Mumbai, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Technical Sales</div><div>Compensation</div><div>₹400K–₹500K<br>No Equity</div></div><h3>Job Description</h3><div><p>Qualifications : Either B.Tech in Food technology/Dairy Technology/ Mechanical engineering/ Chemical engineering or diploma in similar fields. However, willing to look at other candidates with great communication skills and hunger to grow as a business development professional.<br>Preferably should have 2-4 years of technical sales experience selling to dairies/food &amp; beverages or similar sector. Must have sold some equipment in the above spaces.</p><p>Job Roles :<br>a)    Prospecting potential customers, identifying leads, setting up initial discussions.<br>b)    Meeting potential clients at client site, concept-selling the product and first level discussions.<br>c)    Meeting technical decision makers, including operators, plant managers at client site and discussing product features and value to the client.<br>d)    Documenting the entire sales process with clients, including time of engagement, nature of response, time to follow-up, sizing the client potential, etc<br>e)    Follow up with leads on regular basis, and continuous engagement with client to identify sales purchase process.<br>f)    Execute against sales strategy defined by company and give constant feedback on effectiveness of strategy.<br>g)    Regular updates with top management on progress.<br>Job will involve 15% of desk job (for prospecting, reporting, analysis etc), and 85% on the field interacting with clients.</p><p>Requirements in ideal candidate:<br>a)    Must enjoy talking to new people and need to solve client problems.<br>b)    Job is primarily on the field so candidate must be willing to travel.<br>c)    Good communication skills – good command over English and Hindi (knowing the local language is a bonus)</p></div>",
    "urlFetchPending": false,
    "published": "Oct 7, 2017 10:24:23 PM",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:c/c/10",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=10, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "Full Time",
      "Mumbai",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/c",
      "TITLE1/manager",
      "TZ/unknown",
      "Technical Sales"
    ],
    "tagsNames1": [
      "100% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  }
]
}
