{
 "items": [
  {
    "id": "8I-SsP9DRXG9XwfeWf9GSg",
    "url": "http://jobmote.com/jobs/24826-technical-recruiter-remote",
    "title": "Technical Recruiter - Remote",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=5, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ],
    "hiringOrganization": {
      "name": "Atrilogy Solutions Group, Inc.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 80000,
      "maxValue": 100000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 6, 2018 11:20:45 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p>Atrilogy Solutions Group is a national consulting firm specializing in providing functional and technical Information Technology (IT) consultants to our external clients on either a contract or direct hire basis. In this role, you will join a team of seasoned IT Sales &amp; Recruiting professionals who have an average of 7-10 years of industry experience. We deliver results to our customers by leveraging the depth of industry &amp; technical knowledge from our staff along with long-standing relationships that position us partners with our customers. </p><p>We are seeking a Technical Recruiter to work remotely. This is a full-time, salary plus commission role. We are specifically targeting someone who lives in Phoenix as our book of business in Phoenix is growing. This is purely a recruiting role - no sales or business development duties. We're looking for someone who has a minimum of 3 years previous experience recruiting functional and technical IT consultants in the areas of: Enterprise Resource Planning Applications (SAP, Oracle (PeopleSoft and JDE), Lawson), Customer Relationship Management Applications, Database Administration (Oracle, Microsoft, IBM), System Administration, Network Administration, Project Management and Application Development (C/S &amp; Web-based). </p><p>The position requires the ability to interact successfully with company sales reps, create detailed job requisitions, post job descriptions on the Internet, conduct candidate research on our internal database and the Internet, source candidates from non-Internet venues, screen candidate resumes for relevant technology and functional/industry experience, conduct technical phone interviews, schedule and participate in interviews with hiring managers, gather interview feedback, extend offers to high-quality candidates, and close candidates. </p><p>The ability to source, screen, and close top-notch IT candidates is critical. Candidates should be detailed and process-oriented with great documentation skills. General computer proficiency with MS Office (Word, Outlook) and previous experience with Applicant Tracking Systems is required. Excellent verbal and written communication skills are a must as well. </p><p>Base salary + lucrative commission plan. Total compensation targeted at $80 to $100k+, with many successful Recruiters earning well over six-figures. </p><p>For immediate consideration please submit your resume in Word format. </p><p><strong>LOCAL CANDIDATES ONLY PLEASE</strong> unless you are willing to relocate yourself at your own expense. All submittals will be treated confidentially. Selected candidate must successfully pass a comprehensive background screening. Principals only, no third parties please.</p><p>Established in 2000, Atrilogy Solutions Group, Inc. provides organizations of all sizes with high-quality, cost effective information technology (IT), business process and health care consulting and staffing services. Our industry-leading service model combines experienced project managers with seasoned technical and functional consultants to eliminate client uncertainty and deliver superior value and results. </p><p>Clients turn to Atrilogy for expertise in:</p><ul><li>IT staffing and placement (Project Managers, Business Analysts, DBA's, Developers, Quality Assurance and Testing, Software Configuration Management, etc.)</li><li>All major Enterprise Resource Planning packages (including Oracle, PeopleSoft, JD Edwards, SAP, Microsoft, Lawson)</li><li>Health care consulting resources and services (including ICD-10)</li><li>Customer Relationship Management (CRM)</li><li>Creative (Interactive Project Manager/Art Director, Information Architect, UI/UX Designer, Web/Graphic Design)</li></ul><p>Atrilogy has been recognized by <em>CRN</em> magazine as one of the nation's fastest-growing IT solution providers and by <em>Inc.</em> magazine as one of the nation's fastest-growing, privately-held companies. Based in Irvine, California, Atrilogy also has offices in Denver, Phoenix, and Atlanta.</p><ul><li>provided by Dice Technical Recruiter, staffing, headhunter, recruiting </li></ul></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "OCpZ4soAROyvLAhsN0H1OA",
    "url": "https://vuejobs.com/jobs/481-vue-js-developer-20-hrs-a-week",
    "title": "Vue.js Developer (20 hrs a week +)",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:vue.js/frontend/40",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=41}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "EverythingFood.com",
      "sameAs": "https://www.everythingfood.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 5, 2018 7:17:16 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h3>Vue.js Developer (20 hrs a week +)</h3><div>Company: EverythingFood.com<br></div> Location: Orange, California, USA, Remote Allowed<br>Job type: Freelance<br>Salary: USD 75-90<br>Skills: <li>Github</li><li>Netlify</li><li>Nuxt</li><li>vue</li><li>vue js</li><div>                        <h3>Company description</h3>                        Online eCommerce Grocery Retailer                    </div><div>                    <h2>Job description</h2>                    <p>This is a cushy job for someone who REALLY know Vue.js, GitHub, Nuxt, Netlify, and reusable components.</p><p>The design team generate a Design Spec. The API Team delivers functioning API endpoints. And all you have to do is stitch everything together.</p>                </div><a href='mailto:ddoble@everythingfood.com' rel='nofollow'>Apply now!</a>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ds9lGeJmQdigFDvnyciOuA",
    "url": "https://remote.co/job/talent-recruitment-director/",
    "title": "Talent Recruitment Director",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Teach For America",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 3, 2018 5:09:51 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Talent Recruitment Director at <span>Teach For America</span></h2><div><span><i></i> Remote</span>        </div><div>            <p><strong>Job Description:TEAM</strong>: Human Assets<br><strong>REPORTS TO</strong>: Managing Director, Regional Talent Recruitment<br><strong>LOCATION</strong>:&nbsp;<strong>Flexible</strong></p><p><strong>THE ROLE</strong></p><p>As a Director of Talent Recruitment (DTR), you will help identify and hire curious, conscious leaders and change agents who will work toward Teach For America’s shared vision of ensuring educational opportunity for all children. In this effort, you will collaborate with senior leaders to design and execute efficient and strategic hiring campaigns that bring the right people to the right seats at the right time!</p><p>We are currently hiring a DTR for our Regional Talent Recruitment (RTR) team, part of the Talent Acquisition Team. As a DTR on this team, you would work with several different TFA regions across the country, engaging directly with Executive Directors and other senior level staff to recruit and hire for a variety of roles.</p><p><strong>Are you excited about this work yet?</strong></p><strong></strong><p><strong>As a DTR, your work will fall into two main categories:</strong></p><ul><li>As a full-cycle recruiter, you will partner with client teams to hire highly qualified and diverse individuals for open roles within the organization. You will understand the profile of the role to develop and execute on a comprehensive search plan, including sourcing prospects, reviewing candidate applications, conducting initial interviews, and coaching hiring managers to implement efficient, effective, and inclusive hiring processes.</li><li>As a strategic talent advisor to hiring teams, you will advise teams on long-term talent strategy including talent planning, networking, diverse bench and pipeline building, culturally competent hiring, and trends in the external market. As a steward of candidates for open and future roles, you will cultivate relationships with staff prospects to help them find the right position. You will ensure that candidates experience a fair and inclusive interview process and receive communication in a timely fashion.</li></ul><p><strong>THE ORGANIZATION</strong></p><p>There are more than 16 million children growing up in poverty in the U.S., and less than 10 percent of them will graduate from college. These statistics are not a reflection of our children’s potential; we know that children growing up in poverty can and do achieve at the highest levels. Rather, these statistics reflect the systemic lack of access and opportunity for children in low-income communities.</p><p>Teach For America’s (TFA) mission is to find, develop, and support a diverse network of leaders committed to expanding opportunity for children from classrooms, schools, and every sector and field that shapes the broader systems in which schools operate. We are seeking individuals who align with our mission, core values and commitment to Diversity Equity &amp; Inclusiveness and are ready to join us in this global movement.Qualifications:<strong>THE</strong></p><p><strong>PERSON</strong></p><p><em>These percentages are reflective of a typical DTR role, but fluctuate based upon strengths and experiences of the individual DTR as well as the unique hiring needs of the client.</em></p><p><strong>Recruit a highly qualified and diverse pipeline of talent for TFA’s current and future positions (60%)</strong></p><ul><li>Create strong sourcing plans designed to attract top-notch, diverse and mission-aligned talent, including but not limited to<ul><li>Sourcing for candidates using our client relationship management and applicant tracking systems (Salesforce), LinkedIn Recruiter, social media, etc.</li><li>Generating referrals via the professional networks of senior leaders across the organization</li></ul></li><li>Build a deep understanding of position profiles and leverage that understanding to identify top talent across roles</li><li>Design recruitment and hiring plans that secure talent for immediate openings and long-term pipelines</li></ul><p><strong>Understand and respond strategically to client team hiring needs (30%)</strong></p><ul><li>Build strong, trusting partnerships with hiring managers and team leaders by sharing progress to goals and holding them accountable for our aspirations towards fair and equitable hiring practices</li><li>Provide strategic hiring consultation to hiring managers and team leaders</li><li>Support regions in crafting strong job descriptions (akin to this one!) and designing an efficient and thoughtful interview process (interview scripts, activities, etc.)</li></ul><p><strong>Ensure candidates have a positive experience (10%):</strong></p><ul><li>Ensure candidates move through the interview process and have a positive experience</li><li>Manage matriculation efforts to ensure that offered candidates accept their offers</li></ul><p><strong>THE MUST HAVES</strong></p><p><strong>Prior experience</strong></p><ul><li>3+ years of Teach For America staff experience or 3+ years of staffing experience at other organizations required</li></ul><p><strong>Skills</strong></p><p><strong>This job may be for you if:</strong></p><ul><li>You are a relationship-building powerhouse!<ul><li>You build rapport quickly, get your energy from seeking to understand the perspectives of your partners and prospects and leverage those insights to connect them to people and experiences aligned with their interests and needs.</li><li>You communicate clearly.</li><li>You are comfortable working across lines of difference and are excited about the opportunity to build the positive relationships necessary to get work done.</li></ul></li><li>You want to learn how to become an expert in online networking and sourcing strategies.</li><li>You are an exceptional project manager and excel at adapting existing systems and/or creating new ones.</li><li>You are a curious problem solver. You are comfortable and nimble in backwards planning, assessing progress and course correcting as the road map changes.</li><li>You are hungry to learn and grow. You’re excited by the opportunity to navigate a new recruitment space and changing hiring landscapes. You seek strategic opportunities for your own professional development and encourage others to do the same.</li><li>You exemplify our core values, especially Achieve Impact, Strengthen Community and Pursue Equity. You know better work is done when informed by a range of perspectives, take personal responsibility for your work, and are solutions-oriented.</li><li>You are motivated to provide great customer service to prospects, applicants, and hiring managers.</li><li>You have set and reached ambitious goals in your current role.</li><li>You have exceptional judgment and integrity in your work with all of your current stakeholders.</li><li>You are an innovator<strong>&nbsp;</strong>who anticipates and seizes opportunities to refine strategies and processes.</li></ul><p><strong>Work Demands</strong></p><ul><li><strong>Travel 3-6 times per year required</strong></li><li>Attendance at some weekend and evening events may be necessary during peak season</li></ul><p><strong>THE TEAM</strong></p><p>Teach For America is a great place to work and much of that is due to the great people who work here. Our team gets to recruit and hire talented, diverse staff members and foster an organizational culture of leadership, innovation, respect, and teamwork. We ensure processes such as benefits and payroll run smoothly, and create ample opportunities for staff professional development.</p><p>RTR is a passionate, smart and fun team actively working to shift hiring practices and set expectations for thoughtful, timely processes that fully invest our hiring managers and enable us to build a robust, diverse, and exceptional network of professional talent. Even though we are a virtual team (the role is 100% location flexible), the culture is steeped in trust, joy and personal connection to one another and our mission.</p><p><strong>THE PERKS</strong></p><p>By joining staff, you join a network of individuals committed to pursuing equity for all students and developing themselves as professionals in the process. We as an organization value the longevity of our employees and offer a full benefit plan that has proven to be pretty competitive. The salary for this position is also competitive and depends on your prior work experience. Please be advised, you will have an opportunity to discuss salary in more detail after you begin the application process.</p><p><strong>WE ARE DEEPLY COMMITTED TO DIVERSITY, EQUITY &amp; INCLUSION</strong></p><p>Teach For America encourages individuals of all ethnic, racial, and socioeconomic backgrounds to apply for this position. We are committed to maximizing the diversity of our organization, as we want to engage all those who can contribute to this effort.</p><p>Teach For America is committed to providing equal employment opportunities to all qualified individuals and does not discriminate on the basis of race, color, ethnicity, religion, sex, gender, gender identity and expression, sexual orientation, national origin, disability, age, marital status, veteran status, pregnancy, parental status, genetic information or characteristics (or those of a family member) or any other basis prohibited by applicable law.</p><p><em>*This job description reflects Teach For America’s assignment of essential functions and qualifications of the role. Nothing in this herein restricts management’s right to assign, reassign or eliminate duties and responsibilities to this role at any time</em></p>        </div><div>        <a href='https://teachforamerica.secure.force.com/ts2__JobDetails?jobId=a0x0V0000074YViQAM&amp;tSource=' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "_ERKQV7pS9K-SspxDGtahA",
    "url": "https://jobspresso.co/job/associate-director-talent-acquisition/",
    "title": "Associate Director, Talent Acquisition",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Wayfair",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 25, 2018 2:38:45 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Associate Director, Talent Acquisition</h2><div>Various<br></div><div>Anywhere in US<br></div><div>Company: Wayfair<br></div><div>Full Time<br></div><h3>Overview</h3><p>Wayfair is seeking a highly motivated, Associate Director for Customer Service &amp; Sales Talent Acquisition.&nbsp; We are experiencing rapid and dynamic growth across a variety of areas. As our employee base and geographic area expands, we are focused on ensuring that we have the right leadership, teams and infrastructure in place to support this larger, more complex organization. Our Talent teams help support and shape growth across large functional areas. Our people are the biggest factor in our success and the key driver of our revenue growth; the Talent teams have a unique opportunity to help drive this growth through exceptional talent acquisition programs and strategy.</p><p>Your team will be responsible for hiring Customer Service and Sales Consultants across North America.&nbsp; &nbsp;In addition to driving a culture of continual improvement and development, the Associate Director will inspire a large team to lead Talent Acquisition projects and initiatives that allow us to go from good to great, and deliver flawless execution to the business.</p><p></p><strong>The Way You’ll Work</strong><ul></ul><li>Partner with Site Directors and Senior Leadership to understand hiring needs in 6+ locations across the US</li><li>Enable a large Talent Acquisition team by managing, mentoring, coaching and developing performance.</li><li>Work closely to improve performance and reduce turnover with improved hiring techniques and candidate selection tools.</li><li>Deliver a best-in-the-world hiring experience to the following stakeholders:</li><ul></ul><li>Candidates</li><li>Hiring Managers</li><li>Business Stakeholders</li><li>Recruiters</li><li>Contribute to and lead various Talent Acquisition strategies and best practices that contribute to the overall achievement of our vision and enable global scale, long-term success.</li><p></p><strong>The Way You’ll Win:</strong><ul></ul><li>Establish credibility based on your knowledge of Wayfair and your subject matter expertise.</li><li>Leverage data to make decisions, respond to changing business demands, and scale our talent acquisition program.</li><li>Drive a culture within your team that inspires recruiters to strive to become business partners who influence stakeholders and drive outcomes.</li><li>Coach and develop your team through day-to-day needs as well as long term developmental areas.</li><p></p><strong>Who You Are:</strong><ul></ul><li>A&nbsp;&nbsp;with 10+ years of demonstrated success in environments that require significant influencing and partnership to accomplish talent acquisition and</li><strong>champion</strong><li>A&nbsp;&nbsp;with 5+ years’ experience managing multi-level teams, managing teams of recruiters in various off site locations</li><strong>leader</strong><li>An&nbsp;&nbsp;with experience implementing a wide range of creative and thoughtful talent acquisition strategies and programs.</li><strong>innovator</strong><li>An&nbsp;with a proven ability to develop strong internal client relationships, leveraging strong consultative skills.</li><strong>influencer&nbsp;</strong><li>An&nbsp;&nbsp;with a data-centric approach to identifying areas of opportunity and quantitative skills to manage business outcomes.</li><strong>analyst</strong><li>An excellent&nbsp;&nbsp;with an innate ability to motivate and inspire people with your words.</li><strong>communicator</strong><p></p><strong>&nbsp;About Wayfair Inc.</strong><p>Wayfair believes everyone should live in a home they love. Through technology and innovation, Wayfair makes it possible for shoppers to quickly and easily find exactly what they want from a selection of more than 10 million items across home furnishings, décor, home improvement, housewares and more. Committed to delighting its customers every step of the way, Wayfair is reinventing the way people shop for their homes – from product discovery to final delivery.</p><p>The&nbsp;Wayfair&nbsp;family of sites includes:</p><ul></ul><li>, an online destination for all things home</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.wayfair.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=Wayfair&amp;index=6&amp;md5=7ff2d781b9a5f7830b6b03f9b6e23578' rel='nofollow'>Wayfair</a><li>, where beautiful furniture and finds meet irresistible savings</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.jossandmain.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=Joss+%26+Main&amp;index=7&amp;md5=858573d4005bcbf2bcf1753109b4f731' rel='nofollow'>Joss &amp; Main</a><li>, unbelievable prices on everything modern</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.allmodern.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=AllModern&amp;index=8&amp;md5=1623432ea9e10ed33771fef0c7f7ac86' rel='nofollow'>AllModern</a><li>, a collection of classic furnishings and timeless home décor</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.birchlane.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=Birch+Lane&amp;index=9&amp;md5=fae47b06ccc3dd67bd45be7e171d6438' rel='nofollow'>Birch Lane</a><li>, unparalleled access to the finest home décor and furnishings</li><a href='http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.perigold.com%2F&amp;esheet=51722902&amp;newsitemid=20171201005091&amp;lan=en-US&amp;anchor=Perigold&amp;index=10&amp;md5=423afe98da4795b56959330d82bbf2c6' rel='nofollow'>Perigold</a><p>Wayfair generated $5.2 billion in net revenue for the twelve months ended March 31, 2018. Headquartered in Boston, Massachusetts with operations throughout North America and Europe, the company employs more than 8,700 people.</p><div> <div><div><p>To apply for this job please visit the following URL: <a href='http://jobs.jobvite.com/wayfair/job/otUI7fwW' rel='nofollow'>http://jobs.jobvite.com/wayfair/job/otUI7fwW →</a></p></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "W-p0u1_xR5airPKzqGthKQ",
    "url": "https://angel.co/consensys/jobs/231931-human-resources-and-recruiting-coordinator",
    "title": "Human Resources and Recruiting Coordinator",
    "tags": [
      "Brooklyn",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "H.R.",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "ConsenSys",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 50000,
      "maxValue": 55000,
      "info": "0.01% – 0.01%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 14, 2018 6:49:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Human Resources and Recruiting Coordinator at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$50K–$55K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Apply Here: </p><p>ConsenSys is a venture production studio focused on building and scaling tools and enterprise software products powered by Ethereum. Our mission is to use these solutions to power the emerging economic, social, and political operating systems of the planet.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, the music industry, security and infrastructure, and more. To accomplish this, we’ve built out a flat organizational structure which we call the ConsenSys Mesh; a network of individuals &amp; teams working autonomously and towards the same goal. The MeshOps team is responsible for designing and implementing “Meshocracy”, our own operational &amp; company structure loosely based on the principles of holacracy. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p>The Role</p><p>The Human Resources and Recruiting Coordinator is an integral member of our team!  We need help telling our story around the world!  In this role you will develop a solid foundation of knowledge and experience as part of a greater global team serving countless internal customers and projects on 6 continents. You will have the opportunity to build candidate relationships, and partner with recruiters, human resources and hiring managers. The ideal candidate seeks career growth within Recruiting and/or Human Resources and will provide support in many different areas.  This is truly a choose your own destiny situation, and a chance for ownership.  This role will grow and evolve as ConsenSys grows and incolves</p><p>Build excellent relationships across our organization<br>Create welcome packages and kits for new hires<br>Coordinate interview activities on-campus and in-house including, but not limited to, scheduling and calendar invites; interview confirmation emails; reserving interview rooms and telephone/video conference (when necessary); and candidate debrief calls/meetings<br>Schedule and coordinate logistics for all campus recruiting events, e.g. RSVPs, payment/check requests, calendar invites, etc.<br>Manage inventory for all recruiting swag and ensure all swag is readily available.<br>Coordinate offer letter process and as well as onboarding set-up<br>Provide support on special projects and initiatives<br>Assist with the internship program and internal events<br>Assist with wellness endeavors<br>Required Skills:</p><p>Meticulous attention to detail and strong organizational skills with proven ability to prioritize and complete projects within deadlines<br>Self-starter who loves taking initiative<br>Creative problem solver<br>Discreet and able to manage sensitive information<br>Flexibility, high energy and a positive attitude<br>Prior experience in a Recruiting or Human Resources department is preferred<br>Familiarity with applicant tracking systems, HR systems and social media is preferred<br>Ability to focus on the details, but also understand the bigger picture<br>Bonus Points:</p><p>Interest in new technology, Blockchain, and/or Ethereum<br>Humble, kind, and doesn't take themselves too seriously</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "j_SbjA4sTgSzVrODjcmcUw",
    "url": "http://www.indeed.co.uk/viewjob?t=Unity+Developer+Remote+Working&jk=623ec00a9d3ade90&",
    "title": "Unity Developer 80% REMOTE WORKING - IT Talent - Cardiff",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:unity3d/gamedev/8",
      "DBG_TECH1:k/t/w:unity3d/mobile/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=5, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=8, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/gamedev",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "gamedev"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "£",
      "minValue": 200,
      "maxValue": 250,
      "info": "Contract",
      "unit": "DAY",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 13, 2018 6:47:47 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "YL40TZbMTyaLE38LwomUyg",
    "url": "https://news.ycombinator.com/item?id=17663098",
    "title": "SEEKING FREELANCER Worldwide, REMOTE, near-total flexibility on hours. $70-100/hr. Expert Interviewer at Karat  ...",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``seek 2W freelancerescap 4W remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 70,
      "maxValue": 100,
      "info": "",
      "unit": "HOUR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2018 5:04:03 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<span>SEEKING FREELANCER<p>Worldwide, REMOTE, near-total flexibility on hours. $70-100/hr. Expert Interviewer at Karat (<a href='https://karat.io' rel='nofollow'>https://karat.io</a>)</p><p>Work from anywhere in the world that has a solid internet connection. Work as much or as little as you want. Work any day, any time of day, any number of hours -- you can do 0 one week, 50 the next week, and back to 0 the next week. Only requirement there is that we want you to roughly average at least 10 hours a week, or else the training/time investment doesn't make as much sense from your end or ours.</p><p>I know the above might sound a little strange, so a bit about the company for context: Karat is a Seattle-based startup that does software engineering interviews on behalf of other companies -- primarily first-round phone screens. Quickly-growing companies can spend a significant fraction of their engineers' time interviewing; we help take the load off. We've done a lot to make the interview experience better for all stakeholders that I could write whole essays about, but suffice it to say that candidates love working with us, clients love working with us, and we're well-funded and growing quickly as a result.</p><p>Because of this quickly-growing demand, we're looking to hire more Expert Interviewers. The ideal candidate is a software engineer with strong written and verbal English skills with at least a few years of professional experience. Interviewing experience would be great, but we spend 25 hours (paid) training you before you even start, so if you're strong technically and love working with people we can usually make it work :) Interviews are conducted over video chat, using a collaborative code editor.</p><p>Some of our interviewers are freelancers who use our scheduling model to backfill hours; others are full timers at top tech companies looking to make some extra cash; others have quit their jobs to work with us full time; some are digital nomads; one of our interviewers is road tripping around North America for a year and a half, doing anywhere from zero to 40 interviews each week depending on where he is and what the weather's like.</p><p>The application form is here: <a href='https://jobs.lever.co/karat/d44ab283-c7c0-4bbd-b8c3-4dc0ced64c86?lever-origin=applied&amp;lever-source=HNWHFL' rel='nofollow'>https://jobs.lever.co/karat/d44ab283-c7c0-4bbd-b8c3-4dc0ced6...</a></p><p>I know it's a pretty unique job, so if you have any questions reply here or email me at josh@karat.io and I'm happy to talk through any of it.<span>              </span></p><div>        <p>                        </p></div></span>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
