{
 "items": [
  {
    "id": "IYoPQezFSRC2QignufC3KA",
    "url": "https://www.indeed.co.uk/viewjob?t=Development+Manager&jk=484e4a863a65cabb&",
    "title": "Development Manager, Solutions Factory, Risk Advisory, Cardiff - Deloitte - Cardiff",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:angular/frontend/8",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:django/python/8",
      "DBG_TECH1:k/t/w:flask/python/8",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:vue.js/frontend/8",
      "DBG_TECH1:techWeightMap:{python=18, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=27}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Deloitte",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jan 10, 2020 3:46:44 PM",
    "validThrough": "Jan 17, 2020 3:46:44 PM",
    "crawled": "Apr 25, 2020 12:05:14 AM",
    "content": "<div>Your opportunity<br>Deloitte Solutions Factory is looking for a developer team manager who is passionate about building cloud based applications. You will have a background in the design, automation, deployment of applications, and team leading.<br>In this role you will be based in our Cardiff delivery centre and work on projects with our business and supporting functions. You will architect and build cloud-based solutions using a wide range of technologies such as AWS and Azure, working alongside people with a diverse range of skillsets. You will serve as an expert in own discipline.<br><br>We encourage consideration of flexible ways of working, both formal and informal arrangements that allow for the best outcomes for our people and our clients. If this opportunity is of interest to you with some flexibility, please do discuss with us.<br><br>Are you looking to return to the workplace after an extended career break?<br>For this role we can offer coaching and support designed for returners to refresh your knowledge and skills, and help your transition back into the workplace after a career break of 2 years or more. If this is relevant for you, just let your recruiter know when you make your application.<br><br>Your role<br><br><b>Your role will have multiple responsibilities including:</b><br>Oversee the team in building and developing solutions to meet project requirementsFull line management responsibility of developers in your teamDefining projects gates, versions or sprints to regulate work flowDemonstrate solid understanding of software development best practices, with the ability to drive the team to embrace and apply these principlesGuide the team in resolving complex issues in specialised areas based on existing solutions and proceduresManage and fix identified security vulnerabilitiesHands on full stack development at a Lead levelIdentify new tools and technologies to improve processes or implement additional functionalities on applicationsProvide 3rd line support and specialist advice to Ops and Project teamsLeading the Development team; Be a leader on projects, assign projects to different team members; Training and growth of the team members; define training path and team direction.Work closely with the Leadership team, providing regular progress reports and escalation of issues where necessary.Help implement new processes to meet strategic goals and directionEngage in relations with other development, architectural and networking/engineering teams including those in Member Firms.Work effectively in diverse teams within an inclusive team culture where people are recognised for their contributionYour work, your choice<br>At Deloitte we believe the best impact is the value we add, not the hours we sit at our desk. We carefully consider agile ways of working, both formal and informal, that allow for the best impact for our people and our clients. Please speak to your recruiter about the working pattern that works best for you.<br><br><b>Location:</b><br>Cardiff<br><br><b>Work pattern:</b><br>This is a permanent opportunity. The role can be worked on a full time basis.<br>Your professional experience<br><br><b>Requirements:</b><br>Full stack development experience building cloud applications and solutions using Python, Django/Flask, HTML, CSS, React/Angular/Vue etcProven experience in team leading, including remote/offshore team membersIn depth knowledge of agile devops software development tools and methodologies (CI/CD, Git, Jenkins, AWS, CloudFormation, Terraform etc.)Experience in developing and working with APIsStrong database/data structures knowledge and experienceAbility to adapt to new technologies, learn quickly and pass on this knowledge to other team membersStrong problem solving and troubleshooting skillsStrong communicator and decision makerOccasional travel to other Deloitte sitesExperience in the following is desirable:<br>OutSystems DevelopmentExperience of agile project management approaches and tools (eg Atlassian Jira/Confluence)Your service line: Risk Advisory<br>In Risk Advisory, our thinking and actions give clients, our people and society the confidence to succeed responsibly in a rapidly changing world. We don’t just work with our clients to manage risk, we help them understand and grab the opportunities it presents too, helping them gain a competitive advantage. Our expertise and industry knowledge run deep here. At Deloitte, you’ll find yourself working with some of the most inspiring and experienced colleagues and with clients who trust you to lead the way to smart choices, better control frameworks, and new systems, including bespoke solutions that have a direct impact on their bottom line.<br>Personal independence<br>Regulation and controls are standard practice in our industry and Deloitte is no exception. These controls provide important legal protection for both you and the firm. We are subject to a number of audit regulations, one of which requires that certain colleagues abide by specific personal independence constraints. This can mean that you and your &quot;Immediate Family Members&quot; are not permitted to hold certain financial interests (shares, funds, bonds etc.) with audit clients of the firm. The recruitment team will provide further detail as you progress through the recruitment process.<br>About Deloitte<br><br>Our Purpose &amp; Strategy<br>To make an impact that matters for our clients, our people and society - defines who we are and what we stand for. Our purpose provides the foundation for our strategy and our aspiration to be the undisputed leader in professional services: this is not about size, it's about being the first choice. The first choice for the largest and most influential clients, and the first choice for the best talent.<br>What do we do?<br>Deloitte offers global integrated professional services that include Audit &amp; Assurance, Consulting, Financial Advisory, Legal, Risk Advisory and Tax Consulting. Our approach combines intellectual leadership, industrial expertise, insight, consulting &amp; problem solving capabilities whatever the role, technology revolutions and innovation from multiple disciplines to help our clients excel anywhere in the world.<br><b>Beyond the UK:</b> Deloitte North and South Europe<br>The UK is part of Deloitte North and South Europe (NSE), the second largest member firm in the Deloitte network. Deloitte NSE combines operations in Belgium, Greece, Ireland, Italy, Malta, the Netherlands, the Nordics (Denmark, Finland, Iceland, Norway and Sweden), Switzerland and the UK. Deloitte NSE brings together 2,500 partners and over 40,000 people, combining our unmatched breadth and depth of capabilities in audit and assurance, consulting, financial advisory, risk advisory, and tax and legal across the region. Being part of Deloitte NSE supports our aspiration to be the undisputed leader in professional services and will create more opportunity and growth for our people.<br>What do we value?<br>What brings us all together at Deloitte? It’s how we approach the thousands of decisions we make every day. How we behave, our beliefs and our attitudes. In other words: our values. Whatever we do, wherever we are in the world, we lead the way, serve with integrity, take care of each other, foster inclusion, and collaborate for maximum impact. These five shared values lead every decision we make and action we take, guiding us to deliver impact how and where it matters most.<br>Being a Leader at Deloitte<br>Cultural fit and purpose-led leadership is crucial for Deloitte. Our leaders always set the example and inspire their colleagues. They make quality time for people and take an interest in them. They know what matters to people - both inside and outside work – and value them as individuals; always finding opportunities to develop them while showing respect and appreciation.<br>We expect colleagues at all levels to embrace and live our purpose and our leadership culture by challenging themselves to identify issues that are most important for our clients, our people, and for society and make an impact that matters. We know leadership comes in all shapes and sizes, but our Leadership Charter helps all of our people understand what we’re looking for:<br><b>We live our purpose:</b> we act as a role model, embracing and living our purpose and values, and recognising others for the impact they makeWe develop talent: we develop high-performing people and teams through challenging and meaningful opportunitiesWe drive performance: we deliver exceptional client service; maximise results and drive high performance from people while fostering collaboration across businesses and bordersWe believe positive influence can make an impact that matters: we influence clients, teams, and individuals positively, leading by example and establishing confident relationships with increasingly senior peopleWe move, together, towards a strategic direction: we understand key objectives for clients and Deloitte, aligning people to objectives and setting priorities and direction.RTWPROGBACADC<br><br>Deloitte LLP is a limited liability partnership registered in England and Wales with registered number OC303675 and its registered office at 1 New Street Square, London EC4A 3HQ, United Kingdom.Deloitte LLP is the United Kingdom affiliate of Deloitte NSE LLP, a member firm of Deloitte Touche Tohmatsu Limited, a UK private company limited by guarantee (&quot;DTTL&quot;). DTTL and each of its member firms are legally separate and independent entities. DTTL and Deloitte NSE LLP do not provide services to clients. Please see www.deloitte.com/about to learn more about our global network of member firms.<br>© 2020 Deloitte LLP. All rights reserved.<br><br><b>Requisition code:</b> 175658</div><div><div><div><span></span></div><span>Cardiff</span></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "zAldBqftTwyeQUzH_oHCEg",
    "url": "https://unicornhunt.io/jobs/r-d-claims-manager-at-claimer-tech-ltd",
    "title": "R&D Claims Manager",
    "tags": [
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:nose/python/8",
      "DBG_TECH1:techWeightMap:{python=8, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/python",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "python"
    ],
    "hiringOrganization": {
      "name": "Claimer Tech Ltd",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 20, 2020 2:02:18 AM",
    "validThrough": "Apr 27, 2020 2:02:18 AM",
    "crawled": "Apr 24, 2020 8:10:07 PM",
    "content": "<p><strong>Got a nose for numbers and an eye for detail? Do you have some experience in finance, software development, or even managing R&amp;D claims? Do you want to be a crucial part of scaling a business with a talented team? Then we're looking for you!</strong></p><p>R&amp;D tax credits are a fantastic way to claim back costs and help startups grow, but the process is stuck in the dark ages. Claimer is a fast-growing start-up that’s using tech to shake up the R&amp;D tax credit space, with a product that users love.</p><p>We’re looking for someone to take ownership over the day-to-day management of the R&amp;D claims process. The role is varied, but you’ll spend a lot of time speaking with startup founders, getting to grips with the details of the latest breakthroughs, translating those advances into R&amp;D reports, and identifying opportunities for new product features.</p><h3><strong>What we're looking for</strong></h3><ul><li>At least 6 months experience in preparing R&amp;D Tax Credit claims</li><li><i>Ideally</i>&nbsp;some experience in software development or product management (whether a software engineering or equivalent degree, or within a job or hobbyist realm)</li><li>A genuine passion for innovation</li><li>Detail orientated with phenomenal verbal and written communication skills</li><li>You are a fast learner and looking to join a high growth startup, able to excel in a fast paced environment</li></ul><h3><strong>The role</strong></h3><ul><li>Working closely with Claimer’s wide variety of SME clients including some of the most innovative startups in the UK</li><li>Guiding clients through the Claimer platform including assistance in maximising qualifying expenditure</li><li>Finalising technical narratives and preparing tax computations</li><li>Representing Claimer at workshops, talks, and events</li><li>Working with the team in developing our product</li></ul><h3><strong>Life at Claimer</strong></h3><ul><li>You'll have a lot of autonomy and responsibility</li><li>Study support - if you’re studying towards a professional qualification</li><li>Flexible annual leave policy - minimum of 28 days</li><li>Contributory pension</li><li>Team lunches every month, outings every quarter.</li><li>Initially remote-working only due to Coronavirus, after that ideally you'll be based in our offices in Croydon or Central London once or more per week.</li></ul><h3><strong>Next Steps</strong></h3><ul><li>Send us your CV/LinkedIn profile and any additional info you feel we’ll enjoy knowing about you to <a href='mailto:jobs@claimer.io' rel='nofollow'>jobs@claimer.io</a></li><li>Please also send us a short summary (100-200 words) of a technological innovation undertaken by an exciting UK startup in the last 12 months. It should focus on the details of the actual technological innovation, how it’s advancing an industry, rather than the commercial features of the product or service.</li><li>We’ll be in touch to organise an informal conversation</li><li>If you like us we’ll then organise a more in-depth follow-up meeting</li><li>If all goes well, we can be in a position to get you started immediately!</li></ul><p><br></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "r6IjyogOTiOaq2K6yoz3YA",
    "url": "https://www.remotepython.com/jobs/5c778686074941b1b2052b081a56a219/",
    "title": "Software Development Manager, Platform Services at ReCharge",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot W OR(career,first)",
      "DBG_TECH1:k/t/w:flask/python/16",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:techWeightMap:{python=20, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ],
    "hiringOrganization": {
      "name": "ReCharge",
      "sameAs": "https://rechargepayments.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 19, 2020 9:20:06 PM",
    "validThrough": "Apr 26, 2020 9:20:06 PM",
    "crawled": "Apr 24, 2020 8:10:07 PM",
    "content": "<h3>Software Development Manager, Platform Services</h3>Santa Monica, California, United States<br>Company: ReCharge<br>Posted: April 19, 2020&nbsp;Full-time<div>                              <div>                      </div>                    <p></p><p>With over 10,000 online merchants launching subscriptions and over 1,000,000 subscribers powered by ReCharge, we have a lot of store owners to support. Our mission to make repeat orders easier began five years ago as a bootstrapped startup and today we're at the forefront of recurring billing software with over 150 remote-first employees around the globe processing tens of millions of dollars in sales every week.<br><br>We're looking for a Software Development Manager to lead our Platform Services team. This team builds business critical platforms and services that allow ReCharge to run applications reliably at scale and provides ReCharge Engineering with forward-looking tech stack components that take advantage of the cloud (tech stack 2.0).<br><br>Our stack includes: Python, Flask, Jinja, Docker, GCP, Terraform, Ansible, Memcached, Nginx, Snowflake, Looker, Matillion<br><br><strong>What You’ll Do</strong></p><ul>    <li>Live by and champion our values: #ownership, #empathy, #simple-solutions.</li>    <li>Build and manage a first-class engineering team that will scale as the company and business grows, identifying and filling any team gaps.</li>    <li>Develop a team-oriented, supportive culture with a strong focus on creating a working environment that fosters collaboration, open communication and delivering outcomes.</li>    <li>Be responsible for Platform Services team output and hands on day-to-day writing and reviewing code.</li>    <li>Constantly improve team productivity, refine agile processes, and create methods to increase efficiency.</li>    <li>Investigate, analyze, and evangelize programming methodologies such as test-driven development, pair programming, etc.</li>    <li>Perform personnel management tasks for a team of developers, including performance reviews, compliance with company policies, mentoring, and helping plan career growth.</li>    <li>Train new software engineers on our best practices, standards, culture, and policies.</li>    <li>Collaborate with the VP of Engineering in setting roadmap and priorities to ensure deliverables are met as well as raising concerns identified early on.</li>    <li>Champion good habits (development techniques, security, tech debt balance, TDD, and agile habits) within your team; improve engineering standards, tooling, and processes.</li>    <li>Encourage active participation in all phases of the project lifecycle, and work with project management to remove impediments and provide visibility to stakeholders.</li></ul><p><strong>What You’ll Bring</strong></p><ul>    <li>Typically, 10+ years of relevant engineering experience in fast paced environments</li>    <li>4+ years experience managing distributed agile development teams&nbsp;</li>    <li>3+ years prior experience programming in at least one OO language (python preferred)</li>    <li>2+ years experience in cloud-native environments such as GCP, AWS, or Azure</li>    <li>Track record of meeting schedules on time; clearly defining deliverables and timetables, with demonstrated ability to balance multiple priorities in complex environments and manage teams to successful project completion</li>    <li>Demonstrated ability as an effective mentor and coach who understands how to successfully integrate into a team of talented developers</li>    <li>Exceptional analytical, communication and interpersonal skills</li>    <li>Ability to work remote-first in a rapidly scaling organization</li>    <li>Bachelor’s degree or equivalent experience desired</li></ul><p></p>                      <h4>Desired Skills</h4>            <ul>                              <li><span>Ansible</span></li>                              <li><span>Docker</span></li>                              <li><span>Flask</span></li>                              <li><span>Google Cloud Platform</span></li>                              <li><span>Memcached</span></li>                              <li><span>Nginx</span></li>                              <li><span>Terraform</span></li>                          </ul>                                          <h4>Contact Info</h4>            <ul>                                          <li><strong>Company Website:</strong> <a href='https://rechargepayments.com' rel='nofollow'>https://rechargepayments.com</a></li>            </ul>                  </div><a href='https://weworkremotely.com/remote-jobs/recharge-payments-software-development-manager-platform-services' rel='nofollow'>Apply</a>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Oe2SyQHYRfySLIPgV7E3Pw",
    "url": "https://news.ycombinator.com/item?id=22752082",
    "title": "Canonical | www.canonical.com | Remote (work from home) | Full Time | Developer, Project ...",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 1, 2020 8:36:41 PM",
    "validThrough": "Apr 8, 2020 8:36:41 PM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "Canonical | www.canonical.com | Remote (work from home) | Full Time |  Developer, Project Manager, Design/UX, ProductCanonical and Ubuntu are at the forefront of cloud and IoT computing, helping customers master the challenge of operations on hybrid cloud, bare metal, and container-based systems.<p>We’re recruiting people that love Linux, automation, operations, and are interested in cracking some of the world’s toughest problems at scale, with a twist: we’re bringing the scale economics and flexible automation that you’d find in a FAANG company to the wider enterprise ecosystem. We work on open source tools, in an open, distributed environment with Tier 1 organisations.If you're looking to work with some of the smartest people in the industry across the globe while designing and delivering bleeding edge open source solutions, apply below.</p><p>Americas:</p><p>Associate Field Engineer - <a href='https://grnh.se/995a78ec1us' rel='nofollow'>https://grnh.se/995a78ec1us</a></p><p>Software Field Engineer - <a href='https://grnh.se/0251b74f1us' rel='nofollow'>https://grnh.se/0251b74f1us</a></p><p>Europe:</p><p>Developer Advocate - <a href='https://grnh.se/2c4767941us' rel='nofollow'>https://grnh.se/2c4767941us</a></p><p>Charm Tech Core Developer - <a href='https://grnh.se/970c92f01us' rel='nofollow'>https://grnh.se/970c92f01us</a></p><p>Asia / Pacific:</p><p>Technical Support Engineer - <a href='https://grnh.se/a957f5e21us' rel='nofollow'>https://grnh.se/a957f5e21us</a></p><p>Devices Field Software Engineer - <a href='https://grnh.se/dc9623191us' rel='nofollow'>https://grnh.se/dc9623191us</a></p><p>-----------------------------------------</p><p>Canonical is hiring for 70+ roles - learn more and apply here |  <a href='https://grnh.se/e29603601us' rel='nofollow'>https://grnh.se/e29603601us</a></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "bF1wsMCFTRqiJ45YPbd8DA",
    "url": "https://news.ycombinator.com/item?id=22859125",
    "title": "Revel (YC S19) | SF or Remote | Full Time, US work auth | VP of Engineering I'm working with an ...",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:express/nodejs/8",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:twitter-bootstrap/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=9, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=25}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 13, 2020 9:25:40 PM",
    "validThrough": "Apr 20, 2020 9:25:40 PM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "Revel (YC S19) | SF or Remote | Full Time, US work auth | VP of Engineering<p>I'm working with an extremely talented founding team at Revel (hellorevel.com; recent ~$3M seed) to hire for their first VP of Engineering. Revel is changing the way women of 50+ years find and build community -- they are strongly rooted in their mission to increase connectedness.</p><p>About the environment: Team Revel is particularly oriented towards growth in business and career. The role requires a high level of autonomy, curiosity, and a prototype-driven mentality. You'll be entrusted with architecting the technical direction of the product, while managing a small team of driven go-getters that look to you for structure while providing space for thoughtfulness. Plus, &quot;Revel&quot; is also descriptive of their approach to their work (&quot;reveling in our own day to day experiences&quot;).</p><p>Stack: This is much less important than finding the right individual for the role. That said, they currently operate in: React, JavaScript, CSS, Bootstrap, Node/Express. Big early wins will be leadership on developing best practices around testing as well as executing the migration from Heroku to AWS.</p><p>Please reach out to patty@managerie.io to get started on the application and referral process!</p><p>Full JD: <a href='https://www.notion.so/VP-of-Engineering-6ffef3f6b4084ce1896ffe8eb0dc8c47' rel='nofollow'>https://www.notion.so/VP-of-Engineering-6ffef3f6b4084ce1896f...</a></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "VTOG2niZTymvcKP7e1rb2w",
    "url": "https://news.ycombinator.com/item?id=22749851",
    "title": "CodeWeavers | St Paul, MN, USA | Full Time | REMOTE | Wine, 3D Graphics, and General Open ...",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:opengl/c/5",
      "DBG_TECH1:k/t/w:windows/dotnet/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=10, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/dotnet",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 1, 2020 5:43:39 PM",
    "validThrough": "Apr 8, 2020 5:43:39 PM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "CodeWeavers | St Paul, MN, USA | Full Time | REMOTE | Wine, 3D Graphics, and General Open Source Developers | C-language systems programming<p><a href='https://www.codeweavers.com/about/jobs' rel='nofollow'>https://www.codeweavers.com/about/jobs</a></p><p>CodeWeavers is hiring skilled C programmers to work on the open source Wine project and other related open source projects, including several 3D graphics projects (Vulkan, OpenGL, and Direct3D). CodeWeavers partnered with Valve Software to integrate Wine into the Steam for Linux client as a part of the Steam Play (Proton) initiative. This allows Linux gamers to play Windows games on Linux more easily. We need new, full-time developers to improve Wine's ability to run games.</p><p>We are hiring remote programmers, US or international, as well as workers local to Saint Paul, Minnesota. We will consider relocation, if desired, on a case-by-case basis. Please see link above for information, benefits, requirements, and how to apply.</p><p>Please direct any questions to the email address on our Jobs page.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "yDaX5Z0wRg-2cBsZlIhXFw",
    "url": "https://news.ycombinator.com/item?id=22753424",
    "title": "Swoop, Inc | Software Engineer, DevOps, VP of Engineering, FE Architects | Full-time (Remote, ...",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:com/dotnet/8",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/16",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=18, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=16}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/ruby",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "ruby"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 1, 2020 10:59:11 PM",
    "validThrough": "Apr 8, 2020 10:59:11 PM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "Swoop, Inc | Software Engineer, DevOps, VP of Engineering, FE Architects | Full-time (Remote, San Francisco, CA or Boston, MA on-site) | <a href='https://boards.greenhouse.io/joinswoop' rel='nofollow'>https://boards.greenhouse.io/joinswoop</a>Referral: Paul Wanless :-)<p>Looking for Rails, React developers along with DevOps roles.  We're a SaaS platform for Roadside Services intake and dispatching.</p><p><a href='https://boards.greenhouse.io/joinswoop' rel='nofollow'>https://boards.greenhouse.io/joinswoop</a></p><p>Tech Stack - Ruby/Rails, GraphQL, React, Redis, Looker, ElasticSearch, Docker +more I probably don't know of</p><p>If you have questions - feel free to chat me at pwanless at joinswoop dot com</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "KZup3-bZTkOYnHt7K_063A",
    "url": "https://news.ycombinator.com/item?id=22752832",
    "title": "Chainlink - https://chain.link Smart contracts are on track to revolutionize how all agreements ...",
    "tags": [
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:swift/apple/5",
      "DBG_TECH1:k/t/w:swift/mobile/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=8, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=5, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/mobile",
      "TITLE1/manager",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "mobile"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 1, 2020 9:45:39 PM",
    "validThrough": "Apr 8, 2020 9:45:39 PM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "Chainlink - <a href='https://chain.link' rel='nofollow'>https://chain.link</a><p>Smart contracts are on track to revolutionize how all agreements work, through an entirely new system of technologically enforced contract guarantees. We are well recognized for providing highly secure and reliable blockchain connectivity to the world's largest enterprises such as Google, Oracle, SWIFT, and many more. This is a unique opportunity to join one of the top companies developing cutting-edge blockchain technology while working closely together with a team of experienced senior executives.</p><p>These roles are location agnostic anywhere in the world. Though we ask that you overlap some working hours with Eastern Standard Time (EST).</p><p>* Senior Security Engineer | Full-Time | REMOTE | <a href='https://careers.chain.link/o/senior-security-engineer' rel='nofollow'>https://careers.chain.link/o/senior-security-engineer</a>======================================================================================================You will work directly with our engineers to improve the security of our open-source code base. You will partner closely with our leadership team as well as communicate and collaborate across the organization to design and implement company-wide security processes. In this role you will work on our risk program, coordinate response plans, drive the security council, and be in charge of fostering security culture at chainlink.</p><p>* Senior Developer in Test | Full-Time | REMOTE | <a href='https://careers.chain.link/o/senior-developer-in-test' rel='nofollow'>https://careers.chain.link/o/senior-developer-in-test</a>=======================================================================================================</p><p>You will be leading our efforts in designing and developing our test automation framework. You will play a key role on our Core team building out an integral part of our project and managing scalable best practices as it relates to testing. You will have the opportunity to work closely with our founders and ensure we are creating plans and tests that will lead us to the next phase of growth.</p><p>* Site Reliability Engineer | Full-Time | REMOTE | <a href='https://careers.chain.link/o/site-reliability-engineer-global' rel='nofollow'>https://careers.chain.link/o/site-reliability-engineer-globa...</a>================================================================================================================</p><p>You’ll work directly with the company’s CTO, CEO and a technical team of other senior engineers. You’ll develop and build highly scalable, secure, and reliable software that will change the way smart contracts function at a fundamental level. You’ll have the opportunity to learn and master the latest research concerning cryptography, blockchains, game theory, consensus algorithms, and decentralized applications.You'll join us in enabling the future architecture of Chainlink.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "YNm0Zj4qQ0-ehpElquRXUw",
    "url": "https://news.ycombinator.com/item?id=22750232",
    "title": "SEEKING FREELANCER | Philadelphia & New York | Local & Remote US We are a development shop that ...",
    "tags": [
      "DBG:surround``seek 2W freelancerescap 4W remot",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/4",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:elixir/other/10",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:k/t/w:reactjs/frontend/16",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:k/t/w:ruby/ruby/4",
      "DBG_TECH1:k/t/w:typescript/frontend/1",
      "DBG_TECH1:k/t/w:typescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=4, other=10, dotnet=0, c=0, mobile=2, go=0, nodejs=2, bigdata-ml=12, ruby=12, apple=0, java=1, gamedev=0, php=0, embedded=0, frontend=18}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 1, 2020 6:10:00 PM",
    "validThrough": "Apr 8, 2020 6:10:00 PM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "SEEKING FREELANCER | Philadelphia &amp; New York | Local &amp; Remote USWe are a development shop that focuses on software craftsmanship. Our calling is to help companies create amazing, intuitive web &amp; mobile applications, APIs, products, and services. Pair programming, continuous integration &amp; delivery, kaizen, and TDD/BDD aren't just ideas we pay lip service to, but core practices of our day-to-day work.<p>We love polyglots. We use lots of Ruby, Python, Elixir, and JavaScript (mostly TypeScript, React and React-Native).</p><p>Local only:</p><p></p><pre><code>    • Ruby &amp; Rails    • Python    • iOS</code></pre>Local &amp; Remote:<p></p><pre><code>    • React Native    • Android    • Elixir &amp; Phoenix     • Azure, especially with Kubernetes &amp; Terraform    • ML, AI, &amp; Data Science    • Kafka</code></pre>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ONh1dlKZQJ6eZWuoZ-gUeg",
    "url": "https://news.ycombinator.com/item?id=22752998",
    "title": "Elucidate AI (Stealth)| Head of Engineering | San Francisco, CA | Onsite preferred, can discuss ...",
    "tags": [
      "DBG:surround``can 2W remot",
      "DBG_TECH1:k/t/w:angular/frontend/8",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/6",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:vue.js/frontend/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=14, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=24}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 1, 2020 10:04:34 PM",
    "validThrough": "Apr 8, 2020 10:04:34 PM",
    "crawled": "Apr 24, 2020 8:10:03 PM",
    "content": "Elucidate AI (Stealth)| Head of Engineering | San Francisco, CA | Onsite preferred, can discuss remote<p>In a time of economic uncertainty, it’s critical that companies fire their limited bullets wisely. Yet, even in the best times, smart companies consistently focus on goals that are predictably bad (e.g. 1x levers instead of 100x levers). Why do companies pursue predictably bad goals? The root causes are that companies are complex, the world is uncertain, and current tools don’t do a great job helping leaders understand how the pieces fit together to generate growth. As a result, teams operate via a combination of heuristics and siloed local optimizations, all of which are subject to error and obfuscate what’s really important. This creates hundreds of billions of dollars in waste since goal quality is a multiplier on efforts.</p><p>Our technology helps reveal the right goals. We enable companies to simulate the future so they can find better unit economics, drive growth, and innovate more effectively.</p><p>Our small, high powered team is backed by the A-list investors behind Palantir, Addepar, Flexport, Oculus, and others.</p><p>---</p><p>We're looking for</p><p>- You are an expert in at least one backend language like Go or Python.</p><p>- You are passionate about building beautiful frontend user experiences, and you are experienced with React, Angular, or Vue.</p><p>- You have experience with data engineering involving large data sets; Some experience with ML/ DS is also nice-to-have but not a must.</p><p>- You are product-focused and can be an active thought partner in solving user problems simply.</p><p>- You have recruited and managed world class outsourced and in-house eng teams.</p><p>- You (ideally) have some experience at the early stage or have been a founder and understand how to think through trade-offs between scrappiness and perfection.</p><p>- You (ideally) also have a track record scaling large applications so you understand engineering best practices and how to make smart technical decisions that prepare us for the future.</p><p>---</p><p>Sound like you? email isaac at elucidateai.com</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "t_Z6jXazTMe6FUhE2D_eAA",
    "url": "http://workinstartups.com/job-board/job/91381/vp-marketing-at-impala/",
    "title": "VP Marketing",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot W OR(career,first)",
      "DBG:surround``work 2W home 2W orescap W remot",
      "DBG_TECH1:k/t/w:boost/c/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=8, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/c",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c"
    ],
    "hiringOrganization": {
      "name": "Impala",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 23, 2020 7:41:33 AM",
    "validThrough": "Apr 30, 2020 7:41:33 AM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p><em>Application Link: <a href='https://grnh.se/fc11a0a22us' target=&quot;_blank&quot; rel='noopener'>https://grnh.se/fc11a0a22us</a></em></p><br /><p>Hello!</p><br /><p>Thanks for checking out our job description for a&nbsp;<strong>VP Marketing&nbsp;</strong>at Impala. We felt a little bit impersonal just throwing you right in there with words like &ldquo;revolutionising&rdquo; and &ldquo;disrupting&rdquo;.</p><br /><p>As such, we want you to know that the person that wrote this job description apologises in advance for any clich&eacute;s, tropes or sudden-insecurity-driven-panic-attacks that you might find in the description below.</p><br /><p><strong>What is Impala?</strong></p><br /><p>Impala is making the process of booking hotel rooms ridiculously easy. We&rsquo;re providing hotels with a powerful data distribution infrastructure that transforms the way hotel guests across the world browse, book, stay and pay.&nbsp;<strong>Think Twilio for Travel.</strong></p><br /><p>We launched our original API product in January 2019 and since then have grown at - quite frankly - a ridiculous old clip. Our technology is already installed in hundreds of hotels worldwide, on six continents and categorises more than 1 billion data points. This has allowed us to bring forward our&nbsp;<strong>ambition to revolutionise the hotel distribution market and help empower millions of people across the globe</strong>.</p><br /><p>We are a growing remote-first team of exceptional people split across engineering, product and commercial that have built a thriving, active, supportive community.</p><br /><p><strong>Where is Impala going?</strong></p><br /><p>We&rsquo;re supported by some of the best investors in the business, the early-stage backers behind Deliveroo, PillPack, SecretEscapes, Zoopla, Trivago, Monzo, Travelperk, Transferwise, Airbnb, GetYourGuide, Omio, Spotify and more!&nbsp;</p><br /><p>They&rsquo;re on board because of the opportunity that lies before us -&nbsp;<strong>revolutionising a 1.6 trillion dollar market that&rsquo;s been out-of-date for 20 years.</strong></p><br /><p>They also share our vision of a future in which<strong>&nbsp;travel is seamlessly connected and relentlessly inventive.</strong></p><br /><p>Our vision is that within the next two years 10% of hotel bookings worldwide will flow through Impala technology, and the product that we&rsquo;re building will support the entire ecosystem of travel technology (we already have over a thousand companies signed up).</p><br /><p>Anyone travelling anywhere will interact with products powered by Impala and to achieve this we&rsquo;re growing the team extensively within the next year. Now is the most exciting time to be joining Impala as we go through a large push to scale up!</p><br /><p><strong>A brief overview of what you will be doing here:</strong></p><br /><ul><br /><li>Running the marketing function at Impala, initially&nbsp;<strong>taking direct responsibility for the execution of all marketing activities</strong>&nbsp;and&nbsp;<strong>creating and managing a team</strong>&nbsp;over the course of the year.</li><br /><li>Ensuring that our&nbsp;<strong>products are correctly positioned within the market</strong>&nbsp;and that they&rsquo;re additionally correctly messaged.</li><br /><li>Making sure the&nbsp;<strong>right people have the right perception of Impala</strong>&nbsp;and its products at the right time.</li><br /><li>Architecting and executing&nbsp;<strong>exceptional customer acquisition strategies</strong>&nbsp;for our various products.</li><br /></ul><br /><p><strong>You should join us if:</strong></p><br /><ul><br /><li>You have been in charge of architecting and executing Go-To-Market customer acquisition strategies for new products (not just existing products in new regions).</li><br /><li>You have been responsible for recruiting and running at least a small team (3-4 people).</li><br /><li>You have experience marketing B2B products.</li><br /><li>You want to run the marketing function in the defining company of the most exciting industry in the world.</li><br /><li>You are thoughtful, not arrogant.</li><br /><li>You are relentlessly focused on delivery.</li><br /></ul><br /><p><strong>What you will get in return?&nbsp;</strong></p><br /><ul><br /><li>We reward Impalans with super competitive salaries and regular reviews. Whether you're an individual contributor or you want to manage people, there's plenty of opportunity to develop your skills and boost your earning potential. We offer&nbsp;<strong>3.5x the average annual raise</strong>&nbsp;in the UK, even if you remain within the same role.</li><br /><li>We&rsquo;re in the top 14% of companies in the UK for the amount of holiday that we offer, at&nbsp;<strong>36 days</strong>.</li><br /><li><strong>One</strong><a href='https://unsickday.com/'><strong>&nbsp;Unsick</strong></a><strong>&nbsp;day</strong>&nbsp;off per year, to keep up with proactive health admin - so you can finally sort that trip to the dentist and get those health screens that you never have time to do.</li><br /><li>Ability to work from home or remotely for three days of the week.</li><br /><li><strong>Truly flexible working</strong>. With extended lunch break options,&nbsp;<a href='https://www.urbandictionary.com/define.php?term=recess'>Recess Hour</a>, and loads more.</li><br /><li>We invest in your development with a generous&nbsp;<strong>&pound;1,000</strong>&nbsp;<strong>Professional Development budget per year</strong>, and we will support you to realise your potential.&nbsp;</li><br /><li>Fun and inclusive&nbsp;<strong>monthly social events</strong>, from go-karting to mini golf to karaoke.</li><br /><li>Access to&nbsp;<strong>Perkbox</strong>.&nbsp;</li><br /><li>A super strong and proactive&nbsp;<strong>focus on mental and physical wellbeing</strong>. From Vitality health insurance, to Sanctus, to a monthly gym membership reimbursement, plus heaps more.</li><br /><li>A generous&nbsp;<strong>Loved Ones Budget</strong>&nbsp;- &pound;750 annually to get your friends &amp; family over to visit you once a year, no matter how near or far from home you are based.</li><br /><li>Weekly<a href='https://en.wikipedia.org/wiki/20%25_Project'>&nbsp;<strong>20% Time</strong></a>.</li><br /></ul><br /><p><strong>Sound interesting?&nbsp;</strong></p><br /><p>If your answer is &lsquo;yes&rsquo; and you are really excited to learn more then please check out our<a href='https://medium.com/getimpala'>&nbsp;Medium page</a>&nbsp;which includes more information about who we are, what we do, what matters to us, and our culture.</p><br /><p>Want to know more about our CEO, or want a deeper understanding of our what and why? Watch this video.<a href='https://www.youtube.com/watch?v=nxBZuoxCbKM'>&nbsp;https://www.youtube.com/watch?v=nxBZuoxCbKM</a></p><br /><p>For more information about what it's like working here, check out our<a href='https://www.glassdoor.co.uk/Overview/Working-at-Impala-UK-EI_IE3048163.11,20.htm'>&nbsp;Glassdoor page.</a></p><br /><p><em><strong>Application Link: <a href='https://grnh.se/fc11a0a22us' target=&quot;_blank&quot; rel='noopener'>https://grnh.se/fc11a0a22us</a></strong></em></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "AhPM3m88RAS8rGn9mInauw",
    "url": "http://workinstartups.com/job-board/job/91210/head-of-marketing-at-you-intrapreneur/",
    "title": "Head of Marketing",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "you intrapreneur",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 18, 2020 12:45:47 PM",
    "validThrough": "Apr 25, 2020 12:45:47 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>At You Intrapreneur (<a href='https://www.youintrapreneur.com/'>https://www.youintrapreneur.com/</a>)we teach people how to become corporate entrepreneurs to advance their career within their organization or outside their organization.</p><br /><p>We want to build the workforce of the future raising CEO alike profiles who can lead at every level of their company, who have a broad range of competences, and can go deep and/or broad to solve problems and build solutions.&nbsp;</p><br /><p>Our students' motto is: &quot;you don't need to be a CEO to work as a CEO!&quot;.</p><br /><p>Role:</p><br /><p>The Head of Marketing will help the CEO building and executing the phase-1 marketing strategy to build a community of intrapreneurs and reach enough people to test our MPV.</p><br /><p>Responsabilities:</p><br /><ul><br /><li>identify viable marketing campaigns</li><br /><li>drive traffic to our social media channels (LinkedIn and Facebook)</li><br /><li>contribute to our webinars planning</li><br /><li>identify additional resources skillset and requirements</li><br /></ul><br /><p>Idea candidate:</p><br /><ul><br /><li>passioned about entrepreneurship, innovation and change</li><br /><li>experienced in B2C marketing</li><br /><li>with a hands-on and start-up mentality</li><br /></ul><br /><p>What you'll have back:</p><br /><ul><br /><li>the possibility to contribute developing future leaders and &quot;give back&quot; with your knowledge</li><br /><li>you'll be part of a team, virtually meet other experts to expand your network</li><br /><li>add a new experience on your CV and join our community of Advisers once everything goes back to normal</li><br /><li>access coaching sessions for free</li><br /><li>potential to become co-founder if interested</li><br /></ul><br /><p><em>Please note this is a volunteer role for people in furlougth.</em></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "lQ-RAk1fQ8mKan0CpcVaAw",
    "url": "http://workinstartups.com/job-board/job/91083/rd-claims-manager-at-claimer/",
    "title": "R&D Claims Manager",
    "tags": [
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:nose/python/8",
      "DBG_TECH1:techWeightMap:{python=8, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/python",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "python"
    ],
    "hiringOrganization": {
      "name": "Claimer",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 15, 2020 12:32:22 PM",
    "validThrough": "Apr 22, 2020 12:32:22 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>Got a nose for numbers and an eye for detail? Do you have some experience in finance, software development, or even managing R&amp;D claims? Do you want to be a crucial part of scaling a business with a talented team? Then we're looking for you!</p><br /><p>R&amp;D tax credits are a fantastic way to claim back costs and help startups grow, but the process is stuck in the dark ages. <a href='https://www.claimer.io'>Claimer</a> is a fast-growing start-up that&rsquo;s using tech to shake up the R&amp;D tax credit space, with a product that<a href='https://uk.trustpilot.com/review/claimer.io'> users love</a>.</p><br /><p>We&rsquo;re looking for someone to take ownership over the day-to-day management of the R&amp;D claims process. The role is varied, but you&rsquo;ll spend a lot of time speaking with startup founders, getting to grips with the details of the latest breakthroughs, translating those advances into R&amp;D reports, and identifying opportunities for new product features.</p><br /><h2>What we&rsquo;re looking for:</h2><br /><ul><br /><li>At least 6 months experience in preparing R&amp;D Tax Credit claims</li><br /><li><em>Ideally</em> some experience in software development or product management (whether a software engineering or equivalent degree, or within a job or hobbyist realm)</li><br /><li>A genuine passion for innovation</li><br /><li>Detail orientated with phenomenal verbal and written communication skills</li><br /><li>You are a fast learner and looking to join a high growth startup, able to excel in a fast paced environment</li><br /></ul><br /><h2>The Role:</h2><br /><ul><br /><li>Working closely with Claimer&rsquo;s wide variety of SME clients including some of the most innovative startups in the UK</li><br /><li>Guiding clients through the Claimer platform including assistance in maximising qualifying expenditure</li><br /><li>Finalising technical narratives and preparing tax computations</li><br /><li>Representing Claimer at workshops, talks, and events</li><br /><li>Working with the team in developing our product</li><br /></ul><br /><h2>Life at Claimer</h2><br /><p>You&rsquo;ll have:</p><br /><ul><br /><li>Autonomy and responsibility</li><br /><li>Study support - if you&rsquo;re studying towards a professional qualification</li><br /><li>Flexible annual leave policy - minimum of 28 days</li><br /><li>Contributory pension</li><br /><li>Team lunches every month, outings every quarter.</li><br /><li>Initially remote-working only due to Coronavirus, after that ideally you'll be based in our offices in Croydon or Central London once or more per week.</li><br /></ul><br /><h2>What are the next steps?</h2><br /><ul><br /><li>Apply with your CV/LinkedIn profile and any additional info you feel we&rsquo;ll enjoy knowing about you</li><br /><li>Please also send us a short summary (100-200 words) of a technological innovation undertaken by an exciting UK startup in the last 12 months. It should focus on the details of the actual technological innovation, how it&rsquo;s advancing an industry, rather than the commercial features of the product or service.</li><br /><li>We&rsquo;ll be in touch to organise an informal conversation</li><br /><li>If you like us we&rsquo;ll then organise a more in-depth follow-up meeting</li><br /><li>If all goes well, we can be in a position to get you started immediately!</li><br /></ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "JPD5zJH6Sr2uF5sT85KtWg",
    "url": "http://workinstartups.com/job-board/job/90922/technical-account-manager-at-adzuna/",
    "title": "Technical Account Manager",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Adzuna",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 2, 2020 2:45:27 PM",
    "validThrough": "Apr 9, 2020 2:45:27 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<div class=&quot;job-preview-styles__description--2BkR3&quot; data-ui=&quot;job-description&quot;><br /><div><br /><p><strong>About us:</strong></p><br /><p>Adzuna is a job search engine that lists every job, everywhere. From launch in the UK in 2011, we now have more than 10 million visitors a month and are busy conquering the world from our office in West London, helping millions of people find better, more fulfilling jobs.</p><br /><p><br /><strong>The role:</strong><br />Adzuna&rsquo;s success to date has been down to the skills, hard work and determination of the brilliant people we have hired. Right now, we're seeking a Technical Account Manager to act as a key connecting point between the sales and tech areas of the business making sure we have every high-quality job, everywhere listed in our search engine; and account managing a set list of our existing UK job advertising clients and delighting them. This is an incredible opportunity to take our job content to the next level, making a difference by hunting down new sources of jobs, managing and prioritising the integration of job feeds and scrapes and ensuring they are maintained to the highest level.</p><br /><p>You&rsquo;ll be joining a growing team working with the Heads of Product, Sales and International and their respective teams. You will be seen as a product expert and use this knowledge to help the business to delight our customers and grow accounts. The Product team will benefit from your experience to date, but even more important is the passion you bring to work every day. You will strive for excellence, try new things, inspire and engage those around you and feel ownership of overall company success as well as pride in doing your bit.</p><br /><p><strong>What&rsquo;s in it for you?</strong><br />Adzuna is a growing scale-up, championing real change in the job market globally - using the power of tech to match people to better, more fulfilling jobs. We&rsquo;re at a really pivotal time in our journey and it&rsquo;s an exciting moment to join.</p><br /><p>Like everyone here, you will act like an owner, be a team player and make a difference. It&rsquo;s an opportunity to work with a smart team led by experienced management and dedicated and passionate Founders. You have the chance to own your and the company&rsquo;s growth in terms of:</p><br /><ul><br /><li>Prioritising work for the technical team, including requests for new feeds of job adverts, changes to existing feeds and identifying and fixing issues</li><br /><li>Working with the sales and international teams to actively seek out new sources of high quality job content as well as maintaining our existing content to a high standard</li><br /><li>Driving improvements in the feed integration process by identifying and clearing bottlenecks and increasing the team&rsquo;s throughput</li><br /><li>Having a broad understanding of Adzuna&rsquo;s proposition, products and services to enable different customer needs to be serviced</li><br /><li>Account Managing a set list of existing UK job advertising clients and delighting them</li><br /><li>Proven ability to grow and maintain a balanced portfolio of clients through new customer acquisition and developing existing accounts</li><br /><li>Build effective working relationships with current client base to enable smooth transition from new business to an account managed service</li><br /><li>Proactively review clients feeds and campaigns to suggest ways for more efficient delivery and help them get better return on their spend based on their motivations for success</li><br /></ul><br /><p>We want to realise the next level of success and you will utilise your own skills and experience to meet our goals. It&rsquo;s not an easy feat, but our aim is to create a business of which we are all proud and an environment where you will love to be, where you can be yourself to do what you do best.</p><br /></div><br /></div><br /><div class=&quot;job-preview-styles__requirements--2kg4_&quot; data-ui=&quot;job-requirements&quot;><br /><h4>Requirements</h4><br /><div><br /><p>We don&rsquo;t like to put people in boxes, but you&rsquo;re likely to be able to demonstrate experience of, or aptitude for much of the below:</p><br /><ul><br /><li>Graduate with 1-2 years work experience in an operations or account management role or with similar experience</li><br /><li>Highly numerate, organised, able to analyse data make quick decisions and communicate clearly</li><br /><li>Excellent rapport builder and communicator, with excellent people skills and can work across teams to align around common goals, and not afraid to talk to anyone externally including technical conversations with developers</li><br /><li>Technically adept, with experience using Google Suite, Microsoft Office and/or CRM applications</li><br /><li>Enjoy working to tight deadlines, targets and service levels with a flexible, positive attitude and able to put detailed work into a wider business context</li><br /><li>Ambitious, energetic, action-oriented and smart person, enjoys building strong relationships, taking ownership of customer problem, working on solving them and making decisions</li><br /></ul><br /><p><strong>It&rsquo;s a bonus if you have:</strong></p><br /><ul><br /><li>Good understanding of online advertising including performance based pricing models</li><br /><li>History of achieving financial targets and successful negotiation</li><br /><li>Experience of working with Jira or a similar ticketing system</li><br /><li>Experience working with developers and remote teams</li><br /></ul><br /></div><br /></div><br /><div class=&quot;job-preview-styles__benefits--21mG1&quot; data-ui=&quot;job-benefits&quot;><br /><h4>Benefits</h4><br /><div><br /><ul><br /><li><strong>Reward:</strong>&nbsp;We offer a competitive financial package which includes competitive salary, stock options, a contributory pension scheme and Perks at Work.</li><br /><li><strong>Wellbeing:</strong>&nbsp;We take the wellbeing of our employees seriously by providing healthcare through Babylon Health, wellbeing workshops, cycle to work scheme, access to free counselling, endless supply of drinks and fruit. We have a positive attitude to flexible working and families with enhanced maternity and paternity leave as well as 25 days paid holiday.</li><br /><li><strong>Training</strong>: Through our Adzuna Academy training programme, attending conferences, team training budgets, individual development plans and coaching from experienced and supportive peers and managers.</li><br /><li><strong>Fun stuff:</strong>&nbsp;An environment that is thoughtfully designed to allow for work and play including a roof terrace, bar and table tennis. We have a packed social calendar, Summer and Christmas global team get-togethers and an enviable culture thanks to the amazing and smart people who make Adzuna a great place to work.</li><br /></ul><br /><p><strong>More about Adzuna:</strong></p><br /><p>Adzuna is a search engine for job ads used by over 10 million visitors per month that aims to list every job, everywhere. We search thousands of websites so our users don't have to, bringing together millions of ads in one place. By providing smarter search options and powerful data about the job market, we give jobseekers the information they need to take control of their careers.</p><br /><p>Adzuna.co.uk was founded in 2011 by Andrew Hunter and Doug Monro, formerly of eBay, Gumtree, Qype and Zoopla and is backed by leading Venture Capital firms Passion Capital, LocalGlobe, Index Ventures and Smedvig Capital.</p><br /><p>We also supply real-time data to the Number 10 Dashboard and Office for National Statistics labour market indices. In 2018, Adzuna won the contract to run &lsquo;Find a job&rsquo;, one of the British government&rsquo;s most used online services.</p><br /><p>Adzuna&rsquo;s mission is to be the best place to start looking for a job. We love using the awesome power of technology to help match people to better, more fulfilling jobs.</p><br /><p>You can read more here:&nbsp;<a class=&quot;external&quot; href='http://www.adzuna.co.uk/about-us.html' target=&quot;_blank&quot; rel='nofollow noreferrer noopener'>http://www.adzuna.co.uk/about-us.html</a></p><br /></div><br /></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "SrzYezWHSN-HUSsqQT37Dw",
    "url": "http://workinstartups.com/job-board/job/90808/managing-director-at-uk-car-glass/",
    "title": "Managing Director",
    "tags": [
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UK Car Glass",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 26, 2020 4:42:35 PM",
    "validThrough": "Apr 2, 2020 4:42:35 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>&quot;Managing Director&quot;</p><br /><p>Salary Performance based salary + equity in the company</p><br /><p>Workload: Full-time</p><br /><p>Location: Anywhere but ideally in London</p><br /><p>When: Starting by agreement</p><br /><p>WE ARE...</p><br /><p>UK Car Glass&nbsp; is a young, passionate web startup operating in London and Copenhagen. Our mission is to make it super simple to replace car glass and windscreens with unmatched customer care.</p><br /><p>The platform provides a &ldquo;on location&rdquo; car glass replacement service in the UK.</p><br /><p>Our goal is to provide instant and easy online service with a fast reaction time.</p><br /><p>Our Goal is to deliver a five star service through a simple ordering process and high level of service in client management and communications. Together with a delivery of high quality products.</p><br /><p>&nbsp;</p><br /><p>YOU ARE...</p><br /><p>We&rsquo;re looking for a multi-talented all-rounder in administration, marketing, business operation and some SEO (we will invest in teaching you that if needed). You have an entrepreneurial mindset, excellent communication skills, an eye for detail, at least 5y + experience in the workforce and you are hands on and keen to make our combined vision a reality.</p><br /><p>&nbsp;</p><br /><p>Required</p><br /><ul><br /><li>A passion for building business</li><br /><li>Entrepreneurial mindset and keen to work in a small team of an early stage company</li><br /><li>Incorporate knowledge of dynamic and complex marketplace and business trends</li><br /><li>Ensure all products are readily available and achieve targeted margins</li><br /><li>Deep and relevant experience with contract and partnership management</li><br /><li>Strong collaboration with the board of directors for establishing best practices</li><br /><li>Develop and execute innovative market access strategies as well as traditional strategies while assessing customer capabilities.</li><br /><li>Develop and execute Strategic Account Plans in cooperation with relevant functions</li><br /><li>Conduct quarterly business reviews with key account personnel</li><br /><li>Establish strong relationships with suppliers and provide on-going clear communication</li><br /><li>Operate consistent with UK Compliance guidelines</li><br /><li>Expanding our network of suppliers</li><br /><li>Content marketing planning</li><br /><li>Bookkeeping and keeping a financial overview&nbsp;</li><br /><li>Optimisation of processes such as bookkeeping, Client support etc</li><br /><li>Excellent communication skills both spoken and written English&nbsp;</li><br /><li>Self-driven and visionary - and very keen to bring your vision alive</li><br /><li>Have the right to work in the UK</li><br /></ul><br /><p><br /><br /></p><br /><p>Great to have</p><br /><ul><br /><li>Interested and understanding new technology - ideally with experience and knowledge in these fields</li><br /><li>Knowledge of SEO and paid marketing</li><br /><li>Communication Skills in other languages such as German, French and Spanish</li><br /><li>A good sense of humour, curious and in love with live</li><br /></ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "S3WMgAiBQoqWcr2NOU3YhQ",
    "url": "http://workinstartups.com/job-board/job/90760/lab-manager-senior-quantum-engineer-at-oqc/",
    "title": "Lab Manager & Senior Quantum Engineer",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "OQC",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 23, 2020 1:58:07 PM",
    "validThrough": "Mar 30, 2020 1:58:07 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>At Oxford Quantum Circuits (OQC) we&rsquo;re putting quantum in the hands of humanity to solve some of the world&rsquo;s greatest problems. It&rsquo;s our mission to accelerate and enable the world&rsquo;s transition to a quantum future;&nbsp; and to be at the core of this revolution by building truly scalable quantum capabilities with simple &amp; flexible systems. At their core, these processors are based on superconducting circuit technology.&nbsp;</p><br /><p><strong>ROLE OVERVIEW:</strong></p><br /><p>This role is a joint role as a Senior Quantum Engineer and Laboratory Manager. The role will require flexible distribution across both role responsibilities. As OQC is currently in the process of setting up a new quantum laboratory facility, we expect that the Laboratory Manager role will initially be a key responsibility, requiring 70% of your time for the first 6 months. As the laboratory operations move to regular operation procedures, and responsibilities are distributed across the team this is expected to reduce to around 30% of your time.&nbsp;</p><br /><p><strong>LAB MANAGER:</strong></p><br /><p>As a Laboratory Manager, you&rsquo;ll be drawing on your previous experience being responsible with the day to day operation and running of a quantum laboratory.&nbsp;</p><br /><p>You&rsquo;ll have the opportunity to set up, shape and develop processes to ensure an effective, efficient and safe day-to-day laboratory operation. You&rsquo;ll work closely with external contractors, partners, suppliers, OQC&rsquo;s quantum engineers, and operations team to achieve this. You will have the opportunity to grow and develop an internal team to support you in this.&nbsp;</p><br /><p><strong><em>Responsibilities</em></strong></p><br /><p>The laboratory management piece would include responsibility for the day to day laboratory management including:</p><br /><ul><br /><li>Overseeing stock/lab procurement and laboratory budget responsibility</li><br /><li>Organisation and execution of laboratory housekeeping and maintenance duties</li><br /><li>Development and implementation of laboratory operations best practices and procedures</li><br /><li>Development and implementation of 24/7 laboratory operation and monitoring&nbsp;</li><br /><li>Out of hours on-call point of contact&nbsp;</li><br /><li>Responsible for ensuring day-to-day safety compliance&nbsp;</li><br /></ul><br /><p><strong><em>Skills required</em></strong></p><br /><ul><br /><li>Strong teamwork and communication</li><br /><li>Previous experience running a quantum (or similar) laboratory facility</li><br /><li>Flexibility to operate in a dynamic environment&nbsp;</li><br /><li>Experienced with laboratory work and operation and associated requirements; either in an academic or commercial setting</li><br /></ul><br /><p><strong>SENIOR QUANTUM ENGINEER:</strong></p><br /><p>As a Quantum Engineer, you&rsquo;ll be drawing on your previous experience in superconducting circuits during your PhD, post-doctoral or commercial work in this field to develop commercial quantum processors.&nbsp;</p><br /><p>You&rsquo;ll have the opportunity to build from our current processes that already produce devices with competitive quantum coherence, and you will have access to a network of state-of-the-art facilities in the area. You&rsquo;ll work closely on multiple and varied projects within our multi-disciplinary team of physicists, nanotechnologists, electrical engineers, software developers, architects and programme managers &ndash; performing the research and development and delivering commercial projects.&nbsp;</p><br /><p><strong>Responsibilities (depending on skills and projects)</strong></p><br /><p>We work in multi-disciplinary, cross-functional teams to develop and deliver OQC&rsquo;s R&amp;D Projects. This means that responsibilities can be varied depending on skills across:</p><br /><ul><br /><li>Design, simulation and measurement of novel superconducting components for quantum processing or quantum processing support infrastructure</li><br /><li>Scientific analysis of design &amp; device limitations</li><br /><li>Contribution to tool development for design, simulation, measurement, analysis and optimisation of superconducting devices</li><br /><li>Regular input into OQC&rsquo;s evolving technology development roadmap</li><br /><li>Creation and maintenance of process documentation, project plans and reports.</li><br /><li>Representing OQC in scientific settings such as conferences, as part of collaborative consortia, and through the authorship of publications</li><br /></ul><br /><p><strong>Skills required:</strong></p><br /><ul><br /><li>A Post-doc and/or 6+ years experience involving design, fabrication, and test of superconducting quantum circuits, or a related area</li><br /><li>Experienced with laboratory work and associated requirements; either in an academic or commercial setting</li><br /><li>Strong teamwork and communication</li><br /><li>Ability to distil and communicate scientific information effectively with the wider team</li><br /><li>Flexibility to operate in a dynamic environment&nbsp;</li><br /></ul><br /><p><strong>Skills / Experience desirable:</strong></p><br /><ul><br /><li>Understanding of multiple elements of superconducting circuit theory and previously evidenced ability to apply in practice, with up-to-date knowledge on recent research in the area</li><br /><li>Experience with optimisation of control of superconducting circuits for quantum processing at the logical or physical level, in theory or in practice</li><br /><li>Previous work in cyclic development of superconducting device characteristics for specific applications, including<br /><ul><br /><li>ideation/design</li><br /><li>research/development</li><br /><li>build/delivery</li><br /><li>test/evaluation</li><br /><li>Simulation of superconducting circuits or other systems in finite element simulation tools such as Ansys HFSS</li><br /></ul><br /></li><br /><li>Software development experience, particularly in python (or similar languages) for automation of tasks required for research.</li><br /><li>Experience in the use and/or development of classical microwave frequency hardware and/or low latency digital processing systems</li><br /><li>Familiar with safe working practices with both cryogenic and high-vacuum systems</li><br /><li>Scientific publication/presentation of results, whether in person or in writing, especially within the field of superconducting circuits.</li><br /></ul><br /><p><strong>LOCATION</strong></p><br /><p>OQC is currently based in Oxford but plans to relocate its office and establish a laboratory facility in a nearby area.&nbsp; The company also has access to a research facility at Royal Holloway, Egham.</p><br /><p><strong>PACKAGE</strong></p><br /><p>Competitive salary and company benefits.</p><br /><p>At OQC we&rsquo;re not just hoping you&rsquo;ll fit in our culture. We aspire to thrive, as a company and as people, thanks to your diversity of thought and background. We are proud to be an equal opportunity employer and we are committed to providing our team members with a work environment free from discrimination, where everyone is treated with respect. Our employment decisions are based on business needs, talent and merit.</p><br /><p><strong>Send your CV and a cover letter to&nbsp;<span class=&quot;qu&quot; tabindex=&quot;-1&quot; role=&quot;gridcell&quot;><span class=&quot;go&quot;>careers@oxfordquantumcircuits.com</span></span></strong></p><br /><p>We look forward to hearing from you.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "B3iw61GERsiQ6Q0_kOODUw",
    "url": "http://workinstartups.com/job-board/job/90736/business-development-manager-director-remote-at-cognisenz/",
    "title": "Business Development Manager / Director (Remote)",
    "tags": [
      "DBG:surround``4N( OR(look, search),     4N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "CogniSenz",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 20, 2020 7:20:56 PM",
    "validThrough": "Mar 27, 2020 7:20:56 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>I am looking for Business Development Manager / Director for an innovative fast growing IT consultancy startup. With our unique model we are going to hit significant revenue within first year of operation. This is a completely remote position.&nbsp;</p><br /><p>The Business Development Director position is a key sales role responsible for executing national and global sales and business development strategies.</p><br /><p>What you will be in charge of:</p><br /><ul><br /><li>Developing an outstanding strategy to nurture and engage with prospective customers</li><br /><li>Building strong customers' pipeline, prioritise leads and report all information into CRM tracker</li><br /><li>Turning CRM data into exceptionable insights to approach existing/new leads</li><br /><li>Identifying and leveraging new tech tools to increase lead generations</li><br /><li>Source leads through advertisement, cold-calling, attending events &amp; trade shows, networking &amp; social media.</li><br /><li>Responsible for generating / updating content on companies landing page.</li><br /><li>Provide support to customers during the initial phases of an engagement. Follow up and ensure total client satisfaction through the lifecycle of the relationship.</li><br /><li>Keeping the company CRM system updated with phone calls, leads &amp; appointments.</li><br /><li>Work in close collaboration with other team members &amp; delivery teams to ensure that proposed offerings and services fully meet customers' business and technology needs.</li><br /><li>Manage the end-to-end sales process for all opportunities including initial client communication, on-site presentations, RFI response, multi-day client workshops, RFP response creation and submission, negotiation and deal signing. The candidate is the focal point for all communication and sales activities with prospects and customers.</li><br /></ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "0LYZHgTkQSK6wxt_eZrKyg",
    "url": "http://workinstartups.com/job-board/job/90722/head-of-people-at-farewill/",
    "title": "Head of People",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Farewill",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 20, 2020 10:16:59 AM",
    "validThrough": "Mar 27, 2020 10:16:59 AM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<div class=&quot;job-preview-styles__description--2BkR3&quot; data-ui=&quot;job-description&quot;><br /><div><br /><p>We&rsquo;re looking for a&nbsp;<strong>Head of People&nbsp;</strong>to join our team of 65 (and growing fast!)</p><br /><p>This is an incredible opportunity for an experienced People professional to join the Leadership Team of the UK&rsquo;s most exciting startups. You&rsquo;ll nurture our unique culture and support our managers at every level to lead their teams - thinking not just about how to help people perform productively, but also about how to keep them engaged and happy at work.<br /><br /><strong>Who you are:</strong></p><br /><p>You feel confident coaching line managers, providing consistent, fair advice about employee relations, and flexing your approach depending on business needs. You&rsquo;re a seasoned, knowledgeable expert when it comes to HR policies and procedures, and adept at process and budget management. You&rsquo;re an experienced manager of Talent functions, with an impressive track record of hiring successfully and at speed. You&rsquo;re motivated to own the growth of our high-performing, varied team across a wide range of functions and products.<br /><br />Beyond all this though, you&rsquo;re up for generating ideas and initiatives that will help the Farewill team thrive. With sound instincts about what individuals and groups need to work together sustainably, your people skills are second to none. You&rsquo;ve got a natural style, a big heart and a can do attitude. You&rsquo;re keen to develop top talent, reward and recognise people who go the extra mile, foster collaboration, and drive change. You&rsquo;re a team-player - passionate about organisational culture and committed to preserving and propelling ours as we gear up to help more people deal with death.<br /><br /><strong>As our Head of People, over the next 12 months, you&rsquo;ll:</strong></p><br /><ul><br /><li>Report to our COO and work with the leadership team to develop our people strategy, supporting a high-performance culture that gets the best out of every team member</li><br /><li>Manage our Talent team, with responsibility for our hiring plan, onboarding and offboarding strategy, and reporting on KPIs</li><br /><li>Support functional heads with their teams&rsquo; learning &amp; development including building on our current training programmes and progression frameworks</li><br /><li>Define processes for reviews, performance management and pay negotiations</li><br /><li>Guide managers and employees through performance improvement, sickness absence, disciplinary, grievance and appeal processes, being hands-on where necessary</li><br /><li>Draft internal comms on significant or sensitive topics</li><br /><li>Have input around team rituals, office environment and other culture development</li><br /><li>Advocate for company behaviours and diversity/inclusion, and proactively raise concerns with leadership</li><br /><li>Check team morale via regular surveys and check-ins, as well as by being the go-to person for staff to talk to regarding culture and HR questions</li><br /></ul><br /></div><br /></div><br /><div class=&quot;job-preview-styles__requirements--2kg4_&quot; data-ui=&quot;job-requirements&quot;><br /><h4>Requirements</h4><br /><div><br /><p><strong>Essential:</strong></p><br /><ul><br /><li>Previous senior HR generalist role, partnering with business leaders</li><br /><li>Managed Talent teams in the past</li><br /><li>Experience in a fast-paced organisation with constant change</li><br /><li>Exceptional communication and relationship-building skills</li><br /><li>Commercially minded and comfortable with using data to inform decision-making</li><br /><li>Team player, but also unafraid to challenge others&rsquo; ways of thinking</li><br /><li>Creative thinker and problem solver, who develops innovative ideas and solutions to business problems</li><br /><li>Open to new ideas, knowledge and feedback as well as resilient and calm</li><br /></ul><br /><p>Desirable:</p><br /><ul><br /><li>Experience of working in a consumer services organisation</li><br /><li>Experience of opening new office locations</li><br /><li>CIPD qualified</li><br /></ul><br /><p><em>If this sounds like what you&rsquo;d love to be doing, we can&rsquo;t wait to hear from you. If you love the role but don&rsquo;t know if you&rsquo;re a 100% match, please still get in touch. We value attitude and propensity to learn above what&rsquo;s on a CV!</em></p><br /></div><br /></div><br /><div class=&quot;job-preview-styles__benefits--21mG1&quot; data-ui=&quot;job-benefits&quot;><br /><h4>Benefits</h4><br /><div><br /><p><strong>What we offer in return:</strong></p><br /><ul><br /><li>Competitive salary and generous stock options</li><br /><li>28 days of annual leave plus the usual public holidays</li><br /><li>Work from home on Wednesdays, flexible start and end to your day</li><br /><li>Regular off-site days and team lunches</li><br /><li>Santander cycles membership!</li><br /><li>A chance to make a meaningful contribution to people's lives and deaths</li><br /><li>And much&nbsp;<a class=&quot;external&quot; href='https://farewill.workable.com/' target=&quot;_blank&quot; rel='nofollow noreferrer noopener'>more</a>!</li><br /></ul><br /><p><strong>Please note - In light of the coronavirus (COVID-19) outbreak, all Farewill employees are working remotely and we will be conducting all interviews virtually for the foreseeable future. We will continue hiring as usual.</strong></p><br /></div><br /></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Dppmz3XeQ9a8ooD3I7aVNQ",
    "url": "http://workinstartups.com/job-board/job/90628/e-commerce-manager-flexible-hours-2-days-per-week-to-increase-over-time-at-kdv-growth/",
    "title": "E-Commerce Manager - flexible hours, 2 days per week (to increase over time)",
    "tags": [
      "DBG:surround``OR(abl,will,challeng,flexibl,experi,get,prefer) 2W 2N(work,remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "KDV Growth",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 12, 2020 6:18:03 PM",
    "validThrough": "Mar 19, 2020 6:18:03 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>About us:</p><br /><p>KDV Growth is a marketing consultancy working with DTC challenger brands as a 'marketing team on demand'. We work with ambitious companies who want to grow fast and need expert support in order to achieve this on limited budgets and resource set up.</p><br /><p>We're a team of senior marketing executives who get a kick out of seeing our clients succeed. We work hard, and we value kindness, generosity and flexibility in the way we do everything.</p><br /><p>&nbsp;</p><br /><p>About the role:</p><br /><p>We're looking for an ambitious marketing executive to join our growing team and support us in helping our clients grow fast.</p><br /><p>We're looking for someone to join us for 2 days/week with a view to increase it over time. We believe in working flexibly, and for work to fit around life, so we'd be happy for the 2 days to be spread across the week for it to accomodate your hobby, kids, other commitments.</p><br /><p>&nbsp;</p><br /><p>Responsibilities:</p><br /><p>- complete weekly e-commerce performance reports</p><br /><p>- research and make recommendations on best practice in Conversion Rate Optimisation, Email Marketing and Content Marketing</p><br /><p>- research market sectors and report on competition activity</p><br /><p>- perform in-depth reports using customer data, Google Analytics and other sources</p><br /><p>- assist in client calls, take minutes and write follow up communication</p><br /><p>- laise with agency partners - digital marketing agencies, web development partners, PR agencies etc - to coordinate their work on behalf of clients</p><br /><p>- assist in developing strategies and tactics for clients</p><br /><p>&nbsp;</p><br /><p>Requirements:</p><br /><p>- minimum 2-3 years experience in a fast paced, e-commerce business</p><br /><p>- experience in using Google Analytics, Mailchimp and other email guns, Social Media scheduling tools and other marktech</p><br /><p>- good understanding of best practice Email Marketing, Website UX, Social Media Marketing, PPC and Paid social media</p><br /><p>&nbsp;</p><br /><p>Benefits:</p><br /><p>- flexible working - core hours are 10am - 3pm - and it's up to you when you work the rest of the time. What's most important is that the work is done, it's good and our clients' businesses are growing!</p><br /><p>- competitive salary based on experience</p><br /><p>- remote working - we tend to meet once/twice per week, however most work is done remotely</p><br /><p>&nbsp;</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ODrkSlxwTtOV_ZEyYyRaOw",
    "url": "http://workinstartups.com/job-board/job/91278/finance-manager-at-disperseio/",
    "title": "Finance Manager",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/4",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=12, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Disperse.io",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 20, 2020 5:50:09 PM",
    "validThrough": "Apr 27, 2020 5:50:09 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<div class=&quot;layout-styles__content--2Kv6p&quot; data-ui=&quot;careers-page-content&quot;><br /><div class=&quot;job-preview-styles__preview--2d3Fz&quot;><br /><div class=&quot;job-preview-styles__description--2BkR3&quot; data-ui=&quot;job-description&quot;><br /><div><br /><p>Ever wondered how skyscrapers like The Shard get built? It takes a heroic effort across a huge team of designers, builders, and managers to name a few. But we know that the process isn&rsquo;t ideal - 69% of projects run more than 10% over budget and 75% are completed significantly late. Disperse is overcoming these challenges by putting digital tools in the hands of the construction industry. We use AI and computer vision to revolutionise the way buildings are built around the world.</p><br /><p>Over the past year, our four offices (London (HQ), New York, Sarajevo, and Yerevan) have joined forces to build a product and service that our customers love. Having just raised a Series A funding round, we&rsquo;re kickstarting a new stage of global growth and are looking to build a team to help drive the next phase of our journey.</p><br /><p>Come join Disperse -- a creative, conscientious, and proudly diverse community of AI researchers, software engineers, architects, and designers dedicated to helping build the skylines of tomorrow!</p><br /><p>&nbsp;</p><br /><p><strong>THE ROLE</strong></p><br /><p>We are looking for our first Finance Manager, for someone to build out our finance capability and to provide financial advisory on strategic company decisions as we progress on our international expansion and for Series B.</p><br /><p>As Finance Manager, you will have the opportunity to model and forecast business scenarios, build and track performance metrics, price and evaluate new opportunities, and manage our accounting responsibilities and budgets. Analytical and hands-on, you are a problem-solver at heart and always on the look-out for business opportunities and process improvements. An avid team player, you work to make others around you better as you position yourself to support the strategic and financial planning processes of our global teams.</p><br /><p>&nbsp;</p><br /><p><strong>Responsibilities:</strong></p><br /><ul><br /><li>Define and track critical success metrics; identify key opportunities and challenges and collaborate with the business to address them</li><br /><li>Develop and manage our accounting and reporting processes, and oversee our responsibilities with month-end and quarter-end closes</li><br /><li>Drive the development and management of our financial modelling and forecasting; manage and track the budgets and performance of assigned P&amp;L accounts</li><br /><li>Model out business scenarios for initiatives and opportunities, including these for financial planning</li><br /><li>Run regular in-depth analysis on our financials to gain key insights and to ensure the accuracy and integrity of our records</li><br /><li>Find and drive process improvement opportunities across each of our global teams and process areas</li><br /><li>Work closely with the leadership team on strategy, roadmap and targets for the business, and advise on hiring, market opportunities and prioritisation decisions</li><br /><li>Liaise with our investors, vendors and business partners on investment round collateral, key financial deliverables and other ad hoc requests</li><br /></ul><br /></div><br /></div><br /><div class=&quot;job-preview-styles__requirements--2kg4_&quot; data-ui=&quot;job-requirements&quot;><br /><h4>Requirements</h4><br /><div><br /><p><strong>You should apply if:</strong></p><br /><ul><br /><li>You have at least 2+ years of experience in FP&amp;A, commercial or corporate finance roles</li><br /><li>You have experience of working in a fast-growth environment</li><br /><li>You have experience from a company with best-in-class reporting practices</li><br /><li>You have excellent verbal and written communication skills</li><br /><li>You have a proven ability to build and manage financial models</li><br /><li>You think analytically; you thrive working with data and extracting insights to make strong business cases</li><br /><li>You love Excel and financial modelling, and have experience from financial and strategic planning</li><br /><li>You are proactive and hands-on, and relish taking on new challenges</li><br /></ul><br /><p>&nbsp;</p><br /><p><strong>Plus:</strong></p><br /><ul><br /><li>If you have previous experience of working in the technology or construction</li><br /><li>ACA/CIMA/ACCA qualified</li><br /></ul><br /></div><br /></div><br /><div class=&quot;job-preview-styles__benefits--21mG1&quot; data-ui=&quot;job-benefits&quot;><br /><h4>Benefits</h4><br /><div><br /><ul><br /><li>Competitive package</li><br /><li>Private health insurance</li><br /><li>25 days&rsquo; holiday plus all bank holidays</li><br /><li>Friendly, open and transparent culture</li><br /><li>Choose your work equipment / devices: your local office will provide you with options to choose from to help you set up the systems and work environment that will keep you happy and productive</li><br /><li>Flexible working hours / ability to work from home</li><br /><li>Central London location (Tottenham Court Road)</li><br /><li>Unlimited coffee, tea (and nearly unlimited cinnamon loaf from Ole and Steen!)</li><br /><li>Regular socials, and team retreats to amazing destinations (Tbilisi, Kiev... Where next?)</li><br /></ul><br /><p>&nbsp;</p><br /><p>Disperse welcomes applications from all sections of society. We are committed to equal employment opportunity regardless of race, religion or belief, ethnic or national origin, disability, age, citizenship, marital, domestic or civil partnership status, sexual orientation, gender identity or any other basis as protected by applicable law. If you have a disability or additional need that requires accommodation, please do not hesitate to let us know.</p><br /></div><br /></div><br /><div class=&quot;job-preview-styles__buttons--2z_5t&quot;><br /><div class=&quot;job-preview-styles__applyButton--35QFH&quot;>&nbsp;</div><br /><div class=&quot;job-preview-styles__applyIndeed--1E_FM&quot;>&nbsp;</div><br /></div><br /></div><br /></div><br /><div class=&quot;layout-footer-styles__footer--2E7h8&quot; data-id=&quot;footer&quot;><br /><div class=&quot;layout-footer-styles__disclaimers--21ABn&quot;>&nbsp;</div><br /></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "uh2D6zv7SoOVusFoUzTdjw",
    "url": "http://workinstartups.com/job-board/job/90987/fundraising-strategist-at-yellownest-education/",
    "title": "Fundraising Strategist",
    "tags": [
      "DBG:surround``OR(home,remot,telecommut) 3W OR(meet, face, person)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "YellowNest Education",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 7, 2020 12:08:32 PM",
    "validThrough": "Apr 14, 2020 12:08:32 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<p>YellowNest Education is an innovative social impact start-up designed to deliver outstanding, affordable early years education in the United Kingdom.</p><br /><p>www.yellownesteducation.com</p><br /><p>We are recruiting for a Fundraising Strategist for this breakthrough project. As a social impact project our impact will be deep and lasting: child development, gender diversity and better economic prosperity are three outcomes that we will facilitate.</p><br /><p>Time commitment: estimated between 60-80 hours to be completed within 3 months of start date.</p><br /><p>Flexible weekly hours around your schedule.&nbsp;</p><br /><p>Project Description: YellowNest is a UK based social impact start-up no development staff. The organization seeks to build a development strategy and plan that can be executed. The plan will inform YellowNest&rsquo;s 2020 strategic plan and provide realistic projections for hiring development staff.</p><br /><p>Key Deliverables:</p><br /><ul><br /><li>Establish fundraising strategies.</li><br /><li>Provide guidance on case statement / template for grant applications</li><br /><li>Provide recommendations on marketing materials and campaigns directly related to development.</li><br /><li>Develop a fundraising plan that includes strategic recommendations for increasing and cultivating, corporate sponsors and foundation giving; accessing workplace giving Pounds (Apprenticeship Levy);&nbsp;</li><br /><li>Grant seeking and writing for an emerging for-profit</li><br /><li>Based on your evaluation, provide recommendations on a development staffing model.</li><br /></ul><br /><p>Knowledge, Skills, Abilities Required:</p><br /><ul><br /><li>Demonstrated successful development experience and fundraising planning</li><br /><li>Business Development</li><br /><li>Strategic Planning</li><br /><li>Communications</li><br /><li>Grant Writing</li><br /><li>Individual Giving Campaigns</li><br /><li>Corporate Fundraising</li><br /><li>CRM systems such as Salesforce etc.</li><br /></ul><br /><p>Education/Experience: fundraising and development work, experience with small boards and startups, knowledge of current fundraising trends.</p><br /><p>Work Environment/Location: Work from home. Meet with leadership team remotely.</p><br /><p>Visit www.yellownesteducation.com.&nbsp;&nbsp;</p><br /><p>&nbsp;</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "_1_dWtQXQ6yNYqqZ8dD08Q",
    "url": "http://workinstartups.com/job-board/job/90353/head-of-finance-at-disperseio/",
    "title": "Head of Finance",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/4",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=12, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Disperse.io",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "GBP",
      "minValue": 70000,
      "maxValue": 90000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "GBP 70k - 90k /Year"
    },
    "employmentType": "UNSET",
    "published": "Mar 2, 2020 6:39:34 PM",
    "validThrough": "Mar 9, 2020 6:39:34 PM",
    "crawled": "Apr 24, 2020 8:09:14 PM",
    "content": "<div class=&quot;job-preview-styles__description--2BkR3&quot; data-ui=&quot;job-description&quot;><br /><div><br /><p>Ever wondered how skyscrapers like The Shard get built? It takes a heroic effort across a huge team of designers, builders, and managers to name a few. But we know that the process isn&rsquo;t ideal - 69% of projects run more than 10% over budget and 75% are completed significantly late. Disperse is overcoming these challenges by putting digital tools in the hands of the construction industry. We use AI and computer vision to revolutionise the way buildings are built around the world.</p><br /><p>Over the past year, our four offices (London (HQ), New York, Sarajevo, and Yerevan) have joined forces to build a product and service that our customers love. Having just raised a Series A funding round, we&rsquo;re kickstarting a new stage of global growth and are looking to build a team to help drive the next phase of our journey.</p><br /><p>Come join Disperse -- a creative, conscientious, and proudly diverse community of AI researchers, software engineers, architects, and designers dedicated to helping build the skylines of tomorrow!</p><br /><p>&nbsp;</p><br /><p><strong>THE ROLE</strong></p><br /><p>The role we're looking to fill is Head of Finance, and someone to build out our finance capability and to provide financial leadership and advisory on strategic company decisions as we set out on international expansion and for Series B.</p><br /><p>As Head of Finance, you will be acting in concert with the leadership team to model out and forecast business scenarios, build and track performance metrics, price and evaluate new opportunities, and manage our accounting responsibilities and budgets. Analytical and hands-on, you're a problem-solver at heart and always on the look-out for business opportunities and process improvements. An avid team player, you work to make others around you better as you position yourself to support the strategic and financial planning processes of our global teams.</p><br /><p>&nbsp;</p><br /><p><strong>Responsibilities:</strong></p><br /><ul><br /><li>Define and track critical success metrics; identify key opportunities and challenges and collaborate with the business to address them</li><br /><li>Develop and manage our accounting and reporting processes, and oversee our responsibilities with month-end and quarter-end closes</li><br /><li>Drive the development and management of our financial modelling and forecasting; manage and track the budgets and performance of assigned P&amp;L accounts</li><br /><li>Model out business scenarios for initiatives and opportunities, including these for financial planning</li><br /><li>Run regular in-depth analysis on our financials to gain key insights and to ensure the accuracy and integrity of our records</li><br /><li>Find and drive process improvement opportunities across each of our global teams and process areas</li><br /><li>Work closely with the leadership team on strategy, roadmap and targets for the business, and advise on hiring, market opportunities and prioritisation decisions</li><br /><li>Liaise with our investors, vendors and business partners on investment round collateral, key financial deliverables and other ad hoc requests</li><br /></ul><br /></div><br /></div><br /><div class=&quot;job-preview-styles__requirements--2kg4_&quot; data-ui=&quot;job-requirements&quot;><br /><h4>Requirements</h4><br /><div><br /><p><strong>You should apply if:</strong></p><br /><ul><br /><li>You have at least 3-5+ years of experience in FP&amp;A, commercial or corporate finance roles</li><br /><li>You have experience of working in a fast-growth environment</li><br /><li>You have experience from a company with best-in-class reporting practices</li><br /><li>You have excellent verbal and written communication skills</li><br /><li>You have a proven ability to build and manage financial models</li><br /><li>You think analytically; you thrive working with data and extracting insights to make strong business cases</li><br /><li>You love Excel and financial modelling, and have experience from financial and strategic planning</li><br /><li>You are proactive and hands-on, and relish taking on new challenges</li><br /></ul><br /><p>&nbsp;</p><br /><p><strong>Plus:</strong></p><br /><ul><br /><li>If you have previous experience of working in the technology or construction</li><br /><li>ACA/CIMA/ACCA qualified</li><br /></ul><br /></div><br /></div><br /><div class=&quot;job-preview-styles__benefits--21mG1&quot; data-ui=&quot;job-benefits&quot;><br /><h4>Benefits</h4><br /><div><br /><ul><br /><li>Salary of &pound;70,000-&pound;90,000 per annum plus stock options</li><br /><li>Equity - own a part of Disperse, and gain as we grow</li><br /><li>Private health insurance</li><br /><li>25 days&rsquo; holiday plus all bank holidays</li><br /><li>Friendly, open and transparent culture</li><br /><li>Choose your work equipment / devices: your local office will provide you with options to choose from to help you set up the systems and work environment that will keep you happy and productive</li><br /><li>Flexible working hours / ability to work from home</li><br /><li>Central London location (Tottenham Court Road)</li><br /><li>Unlimited coffee, tea (and nearly unlimited cinnamon loaf from Ole and Steen!)</li><br /><li>Regular socials, and team retreats to amazing destinations (Tbilisi, Kiev... Where next?)</li><br /></ul><br /><p>&nbsp;</p><br /><p>Disperse welcomes applications from all sections of society. We are committed to equal employment opportunity regardless of race, religion or belief, ethnic or national origin, disability, age, citizenship, marital, domestic or civil partnership status, sexual orientation, gender identity or any other basis as protected by applicable law. If you have a disability or additional need that requires accommodation, please do not hesitate to let us know.</p><br /></div><br /></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "cXWycl6uROywTzvO1LRQqA",
    "url": "https://remoteok.io/jobs/84553",
    "title": "Software Development Manager Platform Services",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot W OR(career,first)",
      "DBG_TECH1:k/t/w:flask/python/8",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:techWeightMap:{python=12, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ],
    "hiringOrganization": {
      "name": "ReCharge Payments ",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 10, 2020 2:44:25 AM",
    "validThrough": "Apr 17, 2020 2:44:25 AM",
    "crawled": "Apr 24, 2020 8:09:12 PM",
    "content": "<span></span> <span><h4>ReCharge Payments</h4>&nbsp;</span> <br> <h3>Software Development Manager Platform Services</h3> <div>  <div>   \\nOverview\\n\\nWith over 10,000 online merchants launching subscriptions and over 1,000,000 subscribers powered by ReCharge, we have a lot of store owners to support. Our mission to make repeat orders easier began five years ago as a bootstrapped startup and today we're at the forefront of recurring billing software with over 150 remote-first employees around the globe processing tens of millions of dollars in sales every week.\\n\\nWe're looking for a Software Development Manager to lead our Platform Services team. This team&nbsp;builds business critical platforms and services that allow ReCharge to run applications reliably at scale and provides ReCharge Engineering with forward-looking tech stack components that take advantage of the cloud (tech stack 2.0).\\n\\nOur stack includes: Python, Flask, Jinja, Docker, GCP, Terraform, Ansible, Memcached, Nginx, Snowflake, Looker, Matillion\\n\\nWhat You’ll Do\\n\\n\\n* Live by and champion our values: #ownership, #empathy, #simple-solutions.\\n\\n* Build and manage a first-class engineering team that will scale as the company and business grows, identifying and filling any team gaps.\\n\\n* Develop a team-oriented, supportive culture with a strong focus on creating a working environment that fosters collaboration, open communication and delivering outcomes.\\n\\n* Be responsible for Platform Services team output and hands on day-to-day writing and reviewing code.\\n\\n* Constantly improve team productivity, refine agile processes, and create methods to increase efficiency.\\n\\n* Investigate, analyze, and evangelize programming methodologies such as test-driven development, pair programming, etc.\\n\\n* Perform personnel management tasks for a team of developers, including performance reviews, compliance with company policies, mentoring, and helping plan career growth.\\n\\n* Train new software engineers on our best practices, standards, culture, and policies.\\n\\n* Collaborate with the VP of Engineering in setting roadmap and priorities to ensure deliverables are met as well as raising concerns identified early on.\\n\\n* Champion good habits (development techniques, security, tech debt balance, TDD, and agile habits) within your team; improve engineering standards, tooling, and processes.\\n\\n* Encourage active participation in all phases of the project lifecycle, and work with project management to remove impediments and provide visibility to stakeholders.\\n\\n\\n\\n\\nWhat You’ll Bring\\n\\n\\n* Typically, 10+ years of relevant engineering experience in fast paced environments\\n\\n* 4+ years experience managing distributed agile development teams&nbsp;\\n\\n* 3+ years prior experience programming in at least one OO language (python preferred)\\n\\n* 2+ years experience in cloud-native environments such as GCP, AWS, or Azure\\n\\n* Track record of meeting schedules on time; clearly defining deliverables and timetables, with demonstrated ability to balance multiple priorities in complex environments and manage teams to successful project completion\\n\\n* Demonstrated ability as an effective mentor and coach who understands how to successfully integrate into a team of talented developers\\n\\n* Exceptional analytical, communication and interpersonal skills\\n\\n* Ability to work remote-first in a rapidly scaling organization\\n\\n* Bachelor’s degree or equivalent experience desired\\n\\n\\n  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "5xQQOVv_SJW61m--7wKfBQ",
    "url": "https://remoteok.io/jobs/84540",
    "title": "Head of Customer Success",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG_TECH1:k/t/w:backbone.js/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/manager",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Filestage ",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 9, 2020 5:51:45 PM",
    "validThrough": "Apr 16, 2020 5:51:45 PM",
    "crawled": "Apr 24, 2020 8:09:12 PM",
    "content": "<span></span> <span><h4>Filestage</h4>&nbsp;</span> <br> <h3>Head of Customer Success</h3> <span></span> <span>verified</span> <br> <span>Worldwide</span> <div>  <div>   # About Us\\nAt [Filestage](https://filestage.io/) we believe that the workplace should be free from the poison of miscommunication, friction, and frustration. Our mission is to free teams from chaotic file review and proofing workflows, with a simple, flexible, and effective asset review management system. With everything we do, we lead people towards being happier and more successful at work.\\n\\nOver 500 companies (and growing!) all over the world like Lufthansa, Canadian Tire or Rabobank benefit from happier and more productive employees with Filestage. \\n\\n# Your mission\\n**This is an opportunity to shape our company’s future.**&nbsp;We believe that a strong customer success team is the backbone of healthy company growth. Join us on our mission!\\n\\n**You set the strategy for customer success, define goals, run experiments and measure outcomes**&nbsp;to increase value for our customers, drive business results and fuel our company growth.\\n\\n**You lead, grow and mentor our customer success team.**&nbsp;Our team is still small, but we have big plans. You inspire our team and create a vibrant, inclusive culture. (Our total team size is 22, our CS team size is 3)\\n\\n**You are the architect of our customer success operations.**&nbsp;You lay the foundation to scale and constantly improve our high-touch and low-touch customer journeys.\\n\\n**You inspire customer success across the company**, represent the voice of the customer and promote a customer-centric mindset across our growing organization\\n\\n# You’re good at\\n**You are passionate about customer success.**&nbsp;You have already led a customer success team and demonstrated a deep understanding of value drivers in recurring revenue business models.\\n\\n**You work well with lots of questions and few answers.**&nbsp;No problem is too big or too difficult. You take ownership and are able to bring things to completion in strong collaboration with your teammates. \\n\\n**You’re hungry to learn**&nbsp;and strive to continuously improve, iterate, and integrate what you learn. \\n\\n**You’re a strong communicator**&nbsp;and have experience collaborating with a distributed team.\\n\\n**You have empathy and resilience.**&nbsp;You have empathy for our customers, to create an experience they’ll love. You have empathy for our coworkers, to build a workplace we’ll love. And resilience to be able to take feedback from anywhere, consider it gracefully, and fold it into your thinking and your work.\\n\\n# This is what you get\\n**Work from where you are happiest and enjoy a flexible day schedule.**&nbsp;We are a fully distributed team, working from different locations and time zones, each individual following their personal daily schedule.\\n\\n* To collaborate successfully with your European team, you’ll need to ensure a&nbsp;**3 hours work overlap from 2 pm to 5 pm CET**.\\n* To serve our US-based customers, you’ll need to&nbsp;**adjust to US working hours**&nbsp;now and then.\\n\\n**Work with teammates across the world.**&nbsp;At Filestage, you broaden your horizons and build relationships with teammates around the world.\\n\\n**We meet up in real life.**&nbsp;We all travel together at least once a year at our team retreat to have fun and get to know each other.\\n\\n**We build and maintain a strong team culture.**&nbsp;Our working culture is based on our three core values: We are keen to learn, we take ownership and we play fair.\\n\\n**Your opinion matters.**&nbsp;We trust our team members to make the best decisions to achieve their goals. We don’t micromanage.\\n\\n**You learn and grow continuously**&nbsp;by solving complex problems together with highly talented minds.\\n\\n**Are you tired of useless meetings and slow decision making?**&nbsp;We have flat hierarchies, no bullshit meetings and iterate quickly.\\n \\n\\n#Location\\n- Worldwide   <br>  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "oGE3xrdQQ5K5QXbyW_BMXA",
    "url": "https://remoteok.io/jobs/84436",
    "title": "Vice President (VP) of Marketing",
    "tags": [
      "DBG:surround``2N( OR(employe,develop,engin,team,workmat), spread, OR(out,across) )",
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(europ, european, europeanunion)",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:app-store/mobile/8",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=12, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=1, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/mobile",
      "TITLE1/manager",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Drops ",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Apr 3, 2020 11:06:51 PM",
    "validThrough": "Apr 10, 2020 11:06:51 PM",
    "crawled": "Apr 24, 2020 8:09:12 PM",
    "content": "<span></span> <span><h4>Drops</h4>&nbsp;</span> <br> <h3>Vice President (VP) of Marketing</h3> <span></span> <br> <span>EU-only</span> <div>  <div>   **Description**\\n\\nIf you live somewhere in Europe and have a soft spot for bootstrapped, profitable tech startups with a meaningful mission and a global reach, and you would like to develop a small, super-capable marketing team in a fully remote work environment, you may like this extremely rare executive position at Drops.\\n\\n**Company**\\n\\nDrops’ goal is to revolutionise language learning. We are one of the top10 most innovative education companies according to FastCompany. Our flagship app has been in the Appstore for 3+ years, teaches 37 languages, was featured by both the App Store and Play Store multiple times - App of the Year in 2018 on the Play Store. We are a small, founder-led, remote team spread primarily across Europe. Though remote, we work synchronously, communicating via Slack, the G Suite, Github, and Monday. We want to be the no.1 app for vocabulary learning and we are getting there quickly with our current user base of 20* million, a monthly active of &gt;1,500,000 and an average store rating of 4.7.\\n\\n\\nWebsite: http://languagedrops.com \\n\\n**✨ What makes us different**\\n* We’re a small team. We optimise for impact, not headcount. \\n* We carefully consider tradeoffs in product, technology and processes that could lead to increased complexity.\\n* We use React Native on the frontend, hence we have no separate Android, iOS and Web team.\\n* We don’t believe in hierarchy. Autonomy, ownership and passion are the secret ingredients behind Drops. Clear, honest communication is the linchpin of our culture, success and independence.\\n\\n\\n# Responsibilities\\n * You’ll be a key member of a 4-person executive team working together to develop the overarching company and product strategies\\n* You’ll directly influence these strategies via your acute awareness of the competitive landscape, the EdTech industry, and adjacent industries important to Drops platform: gaming, productivity sw, corporated ed and edu B2B\\n* Based on these strategies and the company / product history, you’ll evolve the company ’s overarching narrative and develop a marketing strategy to bring that narrative to life.\\n* You’ll surface and champion business / marketing opportunities through a deep understanding of our products and their usage patterns.\\n* You’ll lead, mentor, manage the marketing team. You’ll be responsible for their effectiveness, well-being and development, and ensure that the team’s efforts align with our business’s and our users’ needs.\\n* You’ll recruit and onboard top talent as needed (contractors, agencies, and employees)\\n* You’ll make sure that the marketing aspects of the projects are getting done on schedule, that we’re making appropriate trade-offs.\\n* You’ll be in charge of developing our marketing culture and ensuring that it is effectively represented and integrated into broader company culture.\\n* Drops is an extremely collaborative company without the product / marketing divide that exists in many companies.You’ll be responsible for ensuring this collaboration continues between the marketing team and the rest of the company. \\n\\n# Requirements\\n**Skills and experience. You have:**\\n\\nBeen a marketing leader in a global EdTech, productivity, or gaming B2C startup\\nExperience marketing both mobile apps and sw platforms\\nHands-on core marketing skills: digital mkt, marcom, product mkt, brand development / storytelling, PR\\nGreat people management skills\\nGreat project management skills\\nGreat negotiation and agency management skills\\nHyper-growth start-up experience\\nHaven't spent your entire career in marketing (or if you have, you have earned a reputation as a bridge builder, working effectively across key functional orgs)\\nWorked effectively in a fully remote position and have managed fully remote employees\\nAccomplished big things with a small team\\n\\n**Additionally skills a plus:**\\n\\nB2B marketing\\nBD / partnership experience\\nSpecific industry experience relevant to Drops\\nKids B2C tech marketing experience\\nEDU industry experience\\n\\n**Benefits**\\n\\n*  All the perks of remote working\\n*  An awesomely compact 22 person team\\n*  Yearly educational allowance\\n*  Fitness allowance\\n*  High-end Apple hardware and ergonomic accessories\\n*  30 days of holiday per year (including Christmas and other holidays)\\n* ✈️ Quarterly team gathering somewhere in the world (Amsterdam, Iceland, Lisbon and Budapest were previous locations) \\n\\n#Location\\n- EU-only   <br>  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "pt2sfAcgTwyBgnYx963kaQ",
    "url": "https://remoteok.io/jobs/84289",
    "title": "Director Of Engineering",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:angularjs/frontend/8",
      "DBG_TECH1:k/t/w:asp.net/dotnet/8",
      "DBG_TECH1:k/t/w:c#/c/2",
      "DBG_TECH1:k/t/w:c#/dotnet/5",
      "DBG_TECH1:k/t/w:dotnet/dotnet/24",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:vb.net/dotnet/8",
      "DBG_TECH1:k/t/w:vue.js/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=45, c=2, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=25}",
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Kukui ",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Mar 28, 2020 3:00:59 AM",
    "validThrough": "Apr 4, 2020 3:00:59 AM",
    "crawled": "Apr 24, 2020 8:09:12 PM",
    "content": "<span></span> <span><h4>Kukui</h4>&nbsp;</span> <br> <h3>Director Of Engineering</h3> <div>  <div>   \\nKukui is looking for a Director of Engineering to lead our distributed teams of engineers.&nbsp; This role will oversee and lead the team in implementing modern best engineering practices including Agile, DevOps, and Quality Control.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\\n\\nResponsibilities &amp; Duties:\\n\\n\\n* Oversee and contribute to the planning and design of software and web applications.\\n\\n* Review existing platform and technologies and work with Production Management in creating a technology roadmap that aligns to Kukui’s business strategy and vision.\\n\\n* Organizes and implements best practices for development pipeline from dev environments through production.\\n\\n\\n* Including: coding standards, code reviews, unit tests, source control management/branching strategy, build processes, testing and operations.\\n\\n\\n\\n\\n\\n* Ensures engineers and process are current with modern engineering practices.\\n\\n* Manages exempt and non-exempt employees within the United States and Bulgaria.\\n\\n* Hires, mentors and trains staff.\\n\\n* Flexible schedule to adapt to time zone differences.&nbsp;\\n\\n* Oversee implementation of automated testing approach and practices.&nbsp;\\n\\n* Contribute to and oversee architectural design and execution.\\n\\n* Some travel including international to overseas offices.\\n\\n* Other duties and responsibilities as assigned.\\n\\n\\n\\n\\nQualifications &amp; Skills:\\n\\n\\n* Strong understanding of Object-Oriented principles.\\n\\n* Extensive experience as a fullstack .NET Developer (ASP.NET, C#, VB.NET, .Net Core, etc).\\n\\n* Experience with Javascript technologies (ReactJS, AngularJS, VueJS).\\n\\n* Management experience with distributed, international teams/offices.\\n\\n* Experience with Source Control Management tools including Git and Subversion.\\n\\n* Experience creating and executing build pipelines with Jenkins.\\n\\n* Experience with agile frameworks, including Scrum and Kanban.\\n\\n* Understanding of SQL – database structure and stored procedures.\\n\\n* Willingness to extend technical knowledge beyond .NET.\\n\\n* Experience with unit testing frameworks, code coverage and static code analysis tools.\\n\\n* Experience with architectural design patterns.\\n\\n\\n\\n\\nNice to Have:\\n\\n\\n* Experience architecting and building cloud-based multi-tenant applications.\\n\\n* Experience building Microservices.\\n\\n* Experience with tools like Docker or Kubernetes are a plus.&nbsp;\\n\\n* Experience implementing Agile with non-Agile teams.\\n\\n* Experience with building applications for online marketing – including SEO, Adwords, Campaigns).\\n\\n* Familiarity with Atlassian tools (Confluence, Jira).\\n\\n* Experience developing or extending Open Source or custom CMS’.\\n\\n\\n\\n\\nWorking Experience:\\n\\n\\n* 6+ years as a developer.\\n\\n* 3+ years contributing to the architecture of large-scale web-based systems.\\n\\n* 3+ years in a management role (dev lead, manager).\\n\\n\\n\\n\\nEducation:\\n\\n\\n* Bachelor’s Degree or equivalent work experience.\\n\\n\\n\\n\\nKukui Perks:\\n\\n\\n* Health Benefits and Company Perks\\n\\n* Remote opportunity – work from home\\n\\n* Partial reimbursement for gym memberships and races/marathons\\n\\n* Generous PTO policy\\n\\n\\n\\n\\nKukui Corporation is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: Kukui Corporation is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment.&nbsp; All employment decisions at Kukui Corporation are based on business needs, job requirements and individual qualifications, without regard to race, color, citizenship status, religion, creed, gender, sexual orientation, national origin, ancestry, age, physical or mental disability, marital status, veteran status, political affiliations, or any other characteristic protected by law where we operate.&nbsp; Kukui Corporation will not tolerate discrimination or harassment based on any of these characteristics.&nbsp; Kukui Corporation encourages applicants of all ages.&nbsp;  </div> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "BJ2ciyw5SMa7zKIPdY-ltQ",
    "url": "https://jobs.github.com/positions/0b183e14-9064-44cb-afa1-52585b124ed2",
    "title": "Vice President of Engineering",
    "tags": [
      "DBG:surround``2N( OR(employe,develop,engin,team,workmat), spread, OR(out,across) )",
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:velocity/java/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/java",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "java"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 180000,
      "maxValue": 200000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 180k - 200k /Year"
    },
    "employmentType": "UNSET",
    "published": "Mar 31, 2020 9:05:41 PM",
    "validThrough": "Apr 7, 2020 9:05:41 PM",
    "crawled": "Apr 24, 2020 8:09:10 PM",
    "content": "GetThru is hiring a Vice President of Engineering to define and drive the technical strategy, architectural vision, and development methodology for our software-as-a-service products. The VP of Engineering will instill the structure and processes necessary to build high quality software while maintaining the flexibility needed for a rapidly growing, entrepreneurial enterprise. In addition to managing our Software Development Life Cycle, maintenance schedules, and optimization efforts, the VP of Engineering will work closely with the product and design teams to guide and implement product decisions. The VP of Engineering will be a part of the company’s Leadership Team and will report directly to the CEO. About the Company GetThru’s mission is to empower organizations to connect authentically with their audiences at scale while building a sustainable company committed to progressive social change. Our tools have been used by more than 2,000 organizations to send over 250 million text messages (ThruText) and make more than 100 million phone calls (ThruTalk) for event recruitment, voter and volunteer engagement, fundraising, polling, and more. We are an all-remote company with 32 full time staff spread across 14 states. We have a once yearly all staff retreat, and hold semi-annual in-person team meetings (e.g., sales, support, development). And while our roots are in progressive politics, we love partnering with organizations of all kinds that share our passion for creating a better world. Job Responsibilities - Oversee our technology operation including planning, tasking, process improvements, and release management.- Lead and mentor GetThru’s 13 person engineering and devops/security teams, facilitating professional development, recruiting new team members, and overseeing annual reviews.  - Work with the engineering team to set and meet deadlines, increasing production velocity without sacrificing stability. - Collaborate with the Head of Product to develop and maintain technology and product roadmaps, ensuring that key concerns of the engineering team are incorporated into the product development process.- Work with the VP of Sales + Success and the CEO to understand business requirements and communicate to the engineering team how individual work facilitates end goals. Represent the engineering team to large customers. Qualifications The ideal candidate will have: - Experience leading engineering at an established software-as-a-service company.- Experience managing and optimizing a cloud-based environment   - Experience managing engineers (i.e., supervision, mentorship, supporting professional development). - Experience managing a department (i.e., goal setting, metrics, meeting facilitation, managing budgets)  - Excellent written and verbal communication skills, especially meeting facilitation and process documentation.- Experience driving successful software delivery and operations with an all-remote domestic team.- Ability to anticipate and react quickly to changing development needs and requirements.- Ability to summarize issues, business impact and strategy to non-technical audiences.- A commitment to / interest in progressive causes Location - GetThru is an all-remote company with employees spread out across the country. Work from anywhere in the U.S. as long as there is good internet. Compensation- $180K - $200K base salary, depending on experience - Additional compensation via bonuses and participation in profit-sharing pool- Participation in employee stock option pool- 401K + employer match- Health / dental / vision benefits competitive with similarly situated companies- 3 weeks of vacation time in year 1 and 2, with increases thereafter- Additional benefits: ergonomic stipend, monthly wellness stipend, parental leave, charitable giving matchEqual Opportunity GetThru provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, national origin, age, disability, or genetics. As our company grows, we strive to make space for all kinds of people to do amazing work with us. We especially encourage applications from women, people of color, LGBTQ+ people, people with disabilities, immigrants, and other communities underrepresented in technology startups. We believe that a team with a wide range of backgrounds and experiences will be more creative, more adaptable, and more effective. And we strive to build a team that reflects the communities we are working to support. ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "tdnxrrrAQoW-PP-EpWCa0g",
    "url": "https://stackoverflow.com/jobs/373810/head-of-engineering-web-scraping-corsearch?a=21mAidCEcuVq&so_medium=Talent&so_source=TalentApi",
    "title": "Head of Engineering, Web Scraping at Corsearch  ",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=1, bigdata-ml=2, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/manager",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Corsearch – No office location",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "EUR",
      "minValue": 65000,
      "maxValue": 90000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "EUR 65k - 90k /Year"
    },
    "employmentType": "UNSET",
    "published": "Apr 24, 2020 8:09:06 PM",
    "validThrough": "May 1, 2020 8:09:06 PM",
    "crawled": "Apr 24, 2020 8:09:07 PM",
    "content": "<h3><span>Head of Engineering, Web Scraping</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Lead, Manager</span>                                </div>                                <div>                                    <span>Industry: </span>                                    <span>Brand Protection, Information Services, Legal Technology</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Company size: </span>                                    <span>201–500 people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>Private</span>                                </div>                        </div>                </div>            <div>Company: Corsearch – No office location<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT+01:00) Amsterdam </span>                            </div>                                                                                            </div>                </div>            <h4>Technologies</h4><div>go</div><div>web-scraping</div><div>amazon-web-services</div><div>mongodb</div><div>apache-kafka</div>            <h4>Job description</h4>            <div><p><strong>Why work a</strong><strong>t&nbsp;</strong><strong>Pointer Brand Protection/</strong><strong>Corsearch</strong><strong>?</strong></p><p>Our team analyzes millions of listings per day, ingesting data at a tera-scale rate. If that is not challenging enough, our overarching goal is to spot detrimental online activity for our customers and coordinate investigation activities in near real-time with advanced data-streaming and data-classification techniques. We run machine learning, image recognition, risk analysis and fraud detection algorithms in parallel to help clean the internet.</p><p><strong>What do we ask of you?</strong></p><p>There are a few skills you should master, but don’t be afraid; we strongly believe it is your character that determines whether you are a good fit for our team or not. Besides your experience and expertise, we would like you to bring excitement, speed, creativity and a moonshot attitude to the team. We thrive in a fast-paced, FUN startup environment, taking on many challenges at once. That is what we would like to see with you as well: a passion, a fire within.</p><p><strong>Technical Requirements:</strong></p><p><strong>-&nbsp;</strong>Solid experience in Go and multithreading programming;</p><p>- Proven experience in designing and implementing large data crawling architectures;</p><p>- Strong knowledge of crawling concepts such as page levels, web performance metrics, W3C standards and scraping tools;</p><p>- Familiar with common anti-scraping strategies (dynamic data loading, Reverse JS, IP proxy, cookie pool, authentication code, etc.);</p><p>- Proficient with Linux/Unix.</p><p><strong>Non-technical requirements:</strong></p><p><strong>-&nbsp;</strong>5+ years of experience leading and managing technical teams and software projects;</p><p>- You are a pragmatic programmer who understands what is needed to get things done;</p><p>- Fluent communication skills in English;</p><p>- Focus on details and quality;&nbsp;</p><p>-&nbsp;Proactive and goal-oriented;</p><p>- Strong problem-solving skills;</p><p>- Customer focus: You have the ability to understand what the customer challenge is, and drive backwards to reliable and effective technical solutions;</p><p>- Raise the bar: Your solutions and technical advice are founded on your solid technical experience. You have managed one or more teams into continued success and your leadership prevails even in ambiguous scenarios;</p><p>- Lead and build: We grow. You grow. Your team grows. You take responsibility for the growth and development of your team and help everyone around you improve every day.</p><p><strong>Useful to have:</strong></p><p><strong>-&nbsp;</strong>Familiar with Amazon Web Services and its core products;</p><p>- Familiar with data streaming platforms such as Kafka or Kinesis.</p><p><strong>What’s in it for you?</strong></p><p><strong>-&nbsp;</strong>25 vacation days to recharge your batteries;</p><p>- Full time remote working;</p><p>- A laptop provided.</p>            </div>        <div>        <a href='https://corsearch.recruitee.com/o/head-of-engineering-web-scraping/c/new?source=StackOverflow' rel='nofollow'>            Apply        </a>                            </div>            <h4>About Corsearch</h4>            <div><p><strong>Why join Corsearch?</strong></p><p>In the seedy, greedy world of online crime, there are tens of thousands of counterfeit products placed for sale on the internet at any given moment.&nbsp;Corsearch&nbsp;Brand Protection has developed an advanced software solution that allows our legal analysts to easily detect and act against online IP infringements on behalf of brands who are looking to eliminate knock-off items.</p><p>Do you feel intrigued when hearing about trademarks and brand protection? YES?! So do we! At Corsearch, our teams live and breathe trademarks. As funny as that sounds, there’s no pushing brand establishment and protection from our thoughts. We’re thinking about coined trademarks in the car, a detailed design search over lunch, Common Law while sitting with the in-laws, and transportation trademarks on the treadmill. It’s what we do. And people come to Corsearch to be challenged, developed, supported, and valued.</p><p><strong>Our Tech team</strong></p><p>We have a very flat, non-hierarchical and friendly team approach. You’ll be working with an experienced team who also has technical experience, including seasoned technology folks who love the work we do and has excellent complementary skills. Over time the infrastructure and development team will grow and you’ll be central to their growth.</p><p>Technical decisions are made with careful and quick consideration at Corsearch, so you can utilize the latest, most innovative technology; allowing you to always learn and progress.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>25 vacation days to recharge your batteries</span>                            </li>                            <li>                                <span></span>                                <span>Pension plan to support you at a later stage of your life</span>                            </li>                            <li>                                <span></span>                                <span>We’ll reimburse you for home-work commuting</span>                            </li>                            <li>                                <span></span>                                <span>Flexible working hours</span>                            </li>                            <li>                                <span></span>                                <span>Possibility of working from home</span>                            </li>                            <li>                                <span></span>                                <span>Out-of-office activities to participate in (football team, bootcamp)</span>                            </li>                            <li>                                <span></span>                                <span>A supply of snacks and drinks to power you throughout the day</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "-HuXdMJwQoGBPoL08jJX0g",
    "url": "https://stackoverflow.com/jobs/308218/director-of-data-platform-engineering-remote-noom?a=1FmJOGdp6EJW&so_medium=Talent&so_source=TalentApi",
    "title": "Director of Data & Platform Engineering (Remote or NYC) at Noom (New York, NY) ",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 9W 4N( OR(offic,onsit), time)",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:golang/go/8",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:techWeightMap:{python=2, other=0, dotnet=0, c=0, mobile=1, go=8, nodejs=0, bigdata-ml=8, ruby=8, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/go",
      "TECH1/ruby",
      "TITLE1/manager",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "go",
      "ruby"
    ],
    "hiringOrganization": {
      "name": "Noom – New York, NY",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 160000,
      "maxValue": 220000,
      "info": "Equity",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false,
      "formatted": "USD 160k - 220k /Year | Equity"
    },
    "employmentType": "UNSET",
    "published": "Apr 24, 2020 8:09:07 PM",
    "validThrough": "May 1, 2020 8:09:07 PM",
    "crawled": "Apr 24, 2020 8:09:07 PM",
    "content": "<h3><span>Director of Data &amp; Platform Engineering (Remote or NYC)</span>            </h3>                <h4>About this job</h4>                <div>                        <div>                                <div>                                    <span>Job type: </span>                                    <span>Full-time</span>                                </div>                                <div>                                    <span>Experience level: </span>                                    <span>Senior, Manager</span>                                </div>                                <div>                                    <span>Industry: </span>                                    <span>Digital Health, Mobile Application</span>                                </div>                        </div>                        <div>                                <div>                                    <span>Company size: </span>                                    <span>1k–5k people</span>                                </div>                                <div>                                    <span>Company type: </span>                                    <span>VC Funded</span>                                </div>                        </div>                </div>            <div>Company: Noom – New York, NY<br></div>                <h4>Remote details</h4>                <div>                    <div>                                                    <div>                                <span>Preferred Timezone:</span>                                <span>(GMT-05:00) Eastern Time +/- 6 hours</span>                            </div>                                                    <div>                                <span>Office Location:</span>                                <span>New York, NY.</span>                                    <span>Employees can also work full time from this office.</span>                            </div>                                                                            <div>                                <span>Relocation Assistance:</span>                                <span>Yes</span>                            </div>                    </div>                </div>            <h4>Technologies</h4><div>ruby-on-rails</div><div>java</div><div>golang</div><div>python</div><div>aws</div>            <h4>Job description</h4>            <div><p><strong><strong>Job posting</strong></strong></p><p>At Noom, we use scientifically proven methods to help our users create healthier lifestyles, and manage important conditions like Type-II Diabetes, Obesity, and Hypertension. Our Engineering team is at the forefront of this challenge, solving complex technical problems that center around habits, behavior, and lifestyle.</p><p>We are looking for a&nbsp;<strong><em>Director of Data &amp; Platform Engineering</em></strong>&nbsp;to help us shape and maintain the teams in charge of all our data engineering, science, and analysis, our API, and all Engineering Support services. This senior management position reports directly to our VP of Engineering and exerts a significant amount of impact on the overall success of our team.</p><p><strong>What You’ll Like About Us</strong></p><ul><li>We work on problems that affect the lives of real people. Our users depend on us to make positive changes to their health and their lives.</li><li>We base our work on scientifically-proven, peer-reviewed methodologies that are designed by medical professionals</li><li>We’re a respectful, diverse, and dynamic environment in which Engineering is a first-class citizen, and where you’ll be able to work on a variety of interesting problems that affect the lives of real people.</li><li>We offer a generous budget for personal development expenses like training courses, conferences, and books.</li><li>You’ll get three weeks’ paid vacation and a flexible work policy that is&nbsp;<strong>remote</strong>- and family-friendly (about 50% of our engineering team is fully remote). We worry about results, not time spent in seats.</li><li>Delicious (and nutritious) daily lunches and snacks prepared by Sam, our NYC office on-site chef.</li></ul><p><strong>What We’ll Like About You</strong></p><ul><li>You have&nbsp;<strong>at least 6 years</strong>&nbsp;of experience</li><li>You have held a senior leadership role in a team of 50–80 engineers (or slightly larger), with direct and indirect responsibility over at least 20–30, with a significant remote component. You must currently be managing no less than 10 engineers minimum. You will also be overseeing Tech Leads.</li><li>You possess excellent communication skills and the ability to clearly explain technical concepts to a non-technical audience</li><li>You have experience dealing with APIs, services, and data at scale, processing and transforming hundreds of millions of transactions and data points on any given day.</li><li>You enjoy managing each team and project at the right level of detail, providing support and guidance&nbsp;<strong>without being afraid to get your hands dirty from time to time&nbsp;</strong>(you can still code if you need to).</li><li>You have a proven track record of growing engineering teams through great hires, fostering the creation of a harmonious culture, and finding the right intersection between expediency and best practice.</li><li>You’re a great mentor, and enjoy helping other engineers grow and realize their full potential.</li><li>You take your job very seriously, but you don’t take yourself too seriously!</li></ul>            </div>        <div>        <a href='https://grnh.se/350caa9f1us' rel='nofollow'>            Apply        </a>                            </div>            <h4>About Noom</h4>            <div><p>Noom Inc., a leader in mobile health coaching, combines the power of technology with the empathy of real human coaches to deliver successful behavior change at scale. Our direct-to-consumer weight loss and exercise tracking mobile applications have reached more than 40 million users worldwide. Leveraging the success of our ground-breaking health and fitness programs, we have developed a behavior change platform to treat chronic and pre-chronic conditions, beginning with the CDC’s Diabetes Prevention Program (DPP). On the first day the CDC began recognizing mobile and online DPP providers, we were there. Since then, we’ve expanded our curricula across the acuity spectrum and now feature programs for pre-hypertension, hypertension and diabetes management, in addition to our flagship weight loss and diabetes prevention programs.</p>            </div>                            <h4>Benefits</h4>                    <ul>                            <li>                                <span></span>                                <span>Home cooked, Healthy, and Tasty Lunch Everyday</span>                            </li>                            <li>                                <span></span>                                <span>Monthly Wellness Reimbursement</span>                            </li>                            <li>                                <span></span>                                <span>Flexible Work Schedules</span>                            </li>                            <li>                                <span></span>                                <span>Conference &amp; Education Budget</span>                            </li>                            <li>                                <span></span>                                <span>Collaborative, Fun Work Environment</span>                            </li>                            <li>                                <span></span>                                <span>Whatever Hardware You Need</span>                            </li>                            <li>                                <span></span>                                <span>Learn and Work Across the Entire Stack</span>                            </li>                            <li>                                <span></span>                                <span>Offsites Galore!</span>                            </li>                            <li>                                <span></span>                                <span>Great Benefits</span>                            </li>                            <li>                                <span></span>                                <span>Remote based wfh</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
