{
 "items": [
  {
    "id": "GjwXittsQAGKofHlWpsqCw",
    "url": "https://problogger.com/jobs/job/romance-writers-wanted-now-long-term-work-hiring-now/",
    "title": "ROMANCE WRITERS WANTED NOW! | LONG-TERM WORK | HIRING NOW",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``from 4W your 2W home",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=3}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "HotGhostWriter Ltd.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 8, 2019 2:00:00 AM",
    "validThrough": "Aug 15, 2019 2:00:00 AM",
    "crawled": "Aug 8, 2019 5:07:22 AM",
    "content": "<h3>ROMANCE WRITERS WANTED NOW! | LONG-TERM WORK | HIRING NOW</h3><div>Company: HotGhostWriter Ltd.</div>Location: Work Remotely<br>Job Type: Contract<div>  <h5>Description</h5>  <div>                    <p><strong>Are you looking to earn a consistent income writing high-quality novels in your favorite Romance subgenres and themes?</strong></p><p>Then this could well be your next paid writing gig!</p><p>&nbsp;</p><p><strong>Job Overview</strong></p><p>We are currently looking to expand our fiction team with amazing and experienced romance writers (<strong>based in the US or Canada</strong>) in all romance subgenres. We are a fast-paced, growing ghostwriting service that can provide you with <strong>consistent and exciting projects week after week!</strong> Regardless of your romance subgenre preferences, we may have a job for you.</p><p>If you are someone that takes pride in their work and is looking to <strong>earn a consistent income doing something you enjoy</strong>, working from the comfort of your home or office, and doing so alongside an excited and brilliant team, then you may just fit our criteria and land yourself an exciting new gig with us.</p><p>&nbsp;</p><p><strong>The Company</strong></p><p>As a company, our brand is synonymous with the highest quality writing and great customer experience. Our online reviews are a testament to that. We are thrilled about this and continue to strive for more.</p><p>However, our focus is not just on our clients, but also on the team that makes it happen. <strong>We love our team and focus on creating an enjoyable working process</strong> and keeping their pipelines full with great projects, bringing them a steady income.</p><p>In return, our writers ensure that every client that walks through our virtual doors receives an outstanding experience and walks away happy with their product. <strong>As a collective, we are always looking to improve</strong> and this as allowed our company to grow.</p><p>We also focus on helping our writers grow- we do this via a number of development programs we run such as our book club, mastermind groups, editor feedback, writing discussions, and more. This ensures that every writer that passes through HotGhostWriter grows and takes their craft to a higher level. Keep reading if this resonates with you.</p><p>&nbsp;</p><p><strong>Pay Rate</strong></p><p>Our current rate is $15 USD per 1,000 words. Our projects range from 20k up to 150k words.</p><p>Some of our busier writers are earning<strong> $2,000+ a month</strong> writing a few hours a day around their studies or other gigs. We offer consistent work without having to apply for jobs, work comes to you. Plus, you'll love the team and process!</p><p>&nbsp;</p><p><strong>Our Requirements</strong></p><p>We are looking for romance writers with at least a good basic skill level and a good understanding of the conventions of the romance subgenre as a whole, and of your preferred romance themes. Here's what's required to be part of our team:</p><p>- You write amazing romance stories. With a lot of tension, suspense, great dialogue, and good character development and characterization.<br>- You are US/CAN based, or US/CAN citizen living outside the country.<br>- You can work with deadlines. We typically deliver 15k words in 1 week/ week and a half.<br>- You are knowledgeable in your preferred romance subgenres, themes/tropes. You understand the readers, you understand basic conventions that make a subgenre/theme/etc and you can write to market.<br>- You take pride in your writing and can consistently deliver high-quality novels. You focus on delivering what the reader and client want.<br>- You are looking for a long-term gig and are eager &amp; available to start.<br>- You are available throughout the day to respond to team and client messages on our platform.<br>- You are reliable, well-spoken, open to constructive criticism and a good communicator.</p><p>&nbsp;</p><p><strong>Few things to consider before applying</strong></p><p><strong>Important</strong>: When applying you will be asked to select up to 3 of your best subgenres. Choose the subgenres you most enjoy and know most about (conventions, typical characters, etc). <span>Please submit a sample for each subgenre you select</span>. If you are successful, we will hire you for 1, 2 or all 3 of your chosen subgenres based on your ability to write and your understanding of each subgenre's conventions. We put a lot of emphasis on this as it's vital to understand what the reader wants.</p><p>We will also prioritize you that can commit for at least 3-6 months. This is because we love to establish long-term relationships with our team and also because our clients love to create a series of projects with the same writer. Once expectations are clear with a client, you can expect awesome projects to keep flowing your way. This requires a basic commitment of 3 months or so.</p><p>Also, you must be able to sit down and write in order to meet deadlines. Good planning should make this easier. Again, availability throughout the day to respond to messages on our platform is essential.</p><p>Finally, you must be okay with not getting official credit for your writing as this is a ghostwriting position.</p><p>&nbsp;</p><p><strong>How To Apply?</strong></p><p>So if read what the position entails and you're excited to test your luck and apply? That's amazing and we look forward to getting your application. <strong>To apply, click the link below</strong> to complete our form where you will have to answer a number of questions and also provide your writing samples. If you're a little reluctant based on your professional experience, don't let that stop you. As long as you have some samples and you understand romance, we'd love to consider you.</p><p>&nbsp;</p><p><strong>Application Form</strong></p><p><a href='https://airtable.com/shrk4Ug4RngCp1fC3' rel='nofollow'>https://airtable.com/shrk4Ug4RngCp1fC3</a></p><p>Please remember to provide at least 1 sample per subgenre you select (Choose no more than 3 subgenres). Each sample must be at least 1,000 words.</p><p>We do get numerous applications on a daily basis, so do bear with us and allow us at least 2 weeks to get to your application.</p><p>&nbsp;</p><p><strong>Best of luck!</strong></p><p>Hotghostwriter Recruitment Department</p><p>Hotghostwriter.com</p><p>P.S. Have any questions?</p><p>Contact us: <span>[email&nbsp;protected]</span></p><p>(Please do not attempt to apply via email, you will be referred to the application form above)</p><div><div></div><div><div><ul><li><ul>&lt;!-- it is important not to have any white space between     <li> as it is styles as inline block --&gt;</li></ul></li></ul><ul><li><span>Style</span></li><li><span>Grammar</span></li><li><span>Overused</span></li><li><span>Clichés</span></li><li><span>Sticky</span></li><li><span>Diction</span></li><li><span>Repeats</span></li><li><span>Combo</span></li><li><span>Length</span></li><li><span>Pronoun</span></li><li><span>Alliteration</span></li><li><span>Homonym</span></li><li><span>Transition</span></li><li><span>Thesaurus</span></li><li><span>House</span></li><li><span>Plagiarism</span></li></ul><ul><p></p><li><span>More<i></i></span></li><li><span>Settings</span></li></ul></div><div><ul><li><span>Writing Style Check</span></li><li><span>Grammar Check</span></li><li><span>Overused Words Check</span></li><li><span>Cliches and Redundancies</span></li><li><span>Sticky Sentences Check</span></li><li><span>Diction and Vague Words</span></li><li><span>Repeats Check</span></li><li><span>Combo Check</span></li><li><span>Sentence Length Check</span></li><li><span>Pronoun Report</span></li><li><span>Alliteration Report</span></li><li><span>Homonym Report</span></li><li><span>Transition Report</span></li><li><span>Thesaurus Report</span></li><li><span>House Style Check</span></li><li><span>Plagiarism Report</span></li></ul></div></div><div><div><span>open options</span></div></div><div>The last attempt to connect to our servers failed. Please check your internet connection.</div></div>          </div>          </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "dyMKPpl0SKO96BRpnBIUhQ",
    "url": "http://workinstartups.com/job-board/job/83157/hr-intern-at-eatfirst/",
    "title": "HR Intern",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/HR",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "EatFirst",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 7, 2019 2:17:19 PM",
    "validThrough": "Aug 14, 2019 2:17:19 PM",
    "crawled": "Aug 7, 2019 4:06:31 PM",
    "content": "<div id=&quot;job-description&quot; class=&quot;border-bottom&quot;><strong>Who are we?<br /></strong>We are EatFirst, an online food brand designed for delivery. Our team of Michelin-star trained chefs produces small batch, handcrafted meals using unique ingredients to make you feel good. We do not use any colourings, flavourings, additives or preservatives and we use only eco-friendly plastic-free packaging. We are based in London and deliver food to individual and corporate customers all across the UK. <br /><br /><strong>What do we offer?</strong><br />You will become part of a star team of international, experienced foodies, with the opportunity to learn from the best talent in hospitality. EatFirst has a fast paced, dynamic work environment where creativity and talent is encouraged and nurtured. <br />Free lunch every day and free coffee and tea in our office.<br /><br /><strong>What does the role involve?</strong><br />You will be actively involved in the company&rsquo;s recruitment process and all things HR-related. This is the perfect opportunity to get in-depth, hands-on experience in start-up HR. The role offers wide exposure to all departments within EatFirst as well as dealing with recruiters and service providers. <br />Tasks include recruiting talent for different positions within EatFirst (above all for our production kitchen), defining and improving processes from profile scanning to onboarding to performance reviews, maintaining employment contracts, assisting with the payroll process. <br /><br /><strong>Requirements<br /></strong>We are looking for a motivated individual to join the team who is looking to pursue a career in HR with some pre-existing experience or knowledge required. In terms of personal attributes, the role requires someone who is intelligent, capable of acquiring new skills and passionate about their work. In addition, should have excellent interpersonal skills and a very good level of English. <br />At the end of the Internship this role could evolve into a full-time position. <br />Applications from both graduates and undergraduates will be considered.<br /><br />Interested? Contact us!</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "CfGNs3EhRIGSA1FzMs0wSg",
    "url": "https://weworkremotely.com/remote-jobs/tutuka-people-pro",
    "title": "Tutuka: People Pro",
    "tags": [
      "DBG:surround``OR(work,oper,anywher,remot) 3W OR(feel,creativ)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Tutuka",
      "sameAs": "https://tutuka.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 7, 2019 1:32:45 PM",
    "validThrough": "Aug 14, 2019 1:32:45 PM",
    "crawled": "Aug 7, 2019 2:06:24 PM",
    "content": "<h3> People Pro </h3><div><div><i>Are you looking for the freedom to define an amazing remote people career?</i></div><div><br></div><div>The People team at Tutuka is actively shaping the future of the company and communities we work with. The team is looking for two dynamic, creative, and thoughtful individuals to contribute to our global success. Both roles report into the Head of People.</div><div><br></div><div><b>1)&nbsp; &nbsp; &nbsp;Development &amp; Success (remote)</b></div><div><br></div><div><i>How you will make an impact:</i> You will help lead the operational engine, helping the Head of People anticipate people needs, innovate processes and scale across the organisation.</div><div><br></div><div>This role will be intimately involved with the learning and development of the people, requiring you to drive projects and dialogue around development, goals, and meaningful feedback solutions. You will also be required to successfully develop and implement people projects.</div><div><br></div><div><b>2)&nbsp; &nbsp; &nbsp;Talent &amp; Culture (remote)</b></div><div><br></div><div><i>How you will make an impact:</i> You will have the responsibility to help create and deliver a seamless and positive employee experience across all dimensions. As you help grow the team, you will lead and promote a high performing, innovative, and supportive culture that aligns with our history as well as its progressive vision of an agile, remote future.</div><div><br></div><div>You thrive in an international team and have great experience with the various aspects of compensation &amp; bench-marking, recruiting, contracting etc. across various markets – the more the merrier.&nbsp;</div><div><br></div><div>Both roles provide the opportunity to travel and spend time with our teams in Johannesburg, Dubai and Bangkok <i>(up to 15% of your time)</i>.</div><div><br></div><div><b>What we look for:</b></div><ul><li><i>Action-oriented: </i>You know how to get things done. You operate with urgency and efficiency. You know how to identify problems and love to develop plans to deliver and solve them.</li><li><i>People champion:</i> You love working with people from around the world and know how to excite them. You understand that people are the core of who we are and place a premium on customer service.</li><li><i>Team player:</i> You love collaborating and sharing ideas. You like learning from your peers. You’re ready to roll up your sleeves and support as needed.</li><li><i>Detail-oriented: </i>You have an eye for detail and sweat the small stuff.</li><li><i>Clear communicator: </i>You communicate clearly and concisely. You’re great at getting and giving respectful and productive feedback.</li><li><i>Professional: </i>You are mature and reliable. You strive to learn and grow your skills.</li><li><i>Highly organised:</i> You know how to manage multiple projects and prioritise appropriately. You create clear and logical systems and processes to support your work.</li><li><i>Passionate:</i> You care about financial inclusion. You want to work remotely and feel inspired every day. You want to change the world.</li><li><i>Enjoy:</i> The work we do is serious but that doesn’t mean we don’t know how to have fun. We know how to have a good time and you should too.</li></ul><div><br></div><div><b>Your Education &amp; Experience:</b></div><ul><li>Bachelor’s degree or higher</li><li>Fluency in English and one other language is required</li><li>5 years of experience in (fin)tech start-up, operational management and/or people operations environment.</li></ul><div><br></div><div><b>Additional Information</b><br></div><div>If you have already made a move into a non-traditional people role and you are ready for the challenge of one of these remote roles, then please get in touch and apply.</div><div><br></div><div><i>We focus on building strong, diverse teams built from different backgrounds, experiences and identities.</i></div><div><br></div><div><b>(Please note that we will start the selection process for these roles after the summer holidays in the beginning of September)&nbsp;</b></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "E3Ct2WS4TzOOV8woHkm69w",
    "url": "https://weworkremotely.com/remote-jobs/onthegosystems-hr-assistant",
    "title": "OnTheGoSystems: HR Assistant",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(work,oper) 2N 2N( OR(independ,fulli), remot)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "OnTheGoSystems",
      "sameAs": "https://www.onthegosystems.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 6, 2019 11:55:28 PM",
    "validThrough": "Aug 13, 2019 11:55:28 PM",
    "crawled": "Aug 7, 2019 12:06:23 AM",
    "content": "<h3> HR Assistant </h3><div><div><span></span></div><div><span>Are you into HR, want a stable job and be part of an amazing multicultural remote-work experience?</span></div><div><br></div><div><span>OnTheGoSystems is looking for an HR assistant that’s a good team player, passionate about their work and has excellent organization skills</span></div><div><br></div><div><span>We need help with all our HR activities, related to posting job ads, help with interviews and recruiting-related admin tasks, maintaining our employee database, stats, helping with processes and documentation, among other tasks.&nbsp;</span></div><div><br></div><div><span>Here you will also have the chance to be creative. We are open to new ideas that will allow us to keep improving our daily work with our most valuable asset, our people.&nbsp;</span></div><div><br></div><div><span>You can be an important part of our company’s success. Ultimately, you’ll help our HR Manager ensure our HR department is organized and operates smoothly to attract, hire and retain our employees.</span></div><div><br></div><div><span>The HR assistant will help with the following:</span></div><div><br></div><ul><li><span>Assist with day to day operations of the HR functions and duties</span><br><br></li><li><span>Provide administrative support where needed</span><br><br></li><li><span>Compile and update employee records, and help track and keep records of performance, among others</span><br><br></li><li><span>Process documentation and prepare reports relating to personnel activities (staffing, recruitment, training, performance evaluations etc)</span><br><br></li><li><span>Coordinate HR projects (meetings, training, surveys etc)&nbsp;</span><br><br></li><li><span>Assist with recruitment and onboarding process&nbsp; (Posting job openings, gathering information on new applicants, assisting in screening and rating of applicants, testing the skills and abilities of potential candidates, running background checks on potential candidates as well as verifying their references, etc)</span><br><br></li><li><span>Help with travelling arrangements</span><br></li></ul><div><br></div><div><h6><span>Benefits</span></h6><br></div><div><span>Working with OnTheGoSystems comes with a number of benefits:</span></div><div><br></div><ul><li><span>Work in a global team, fully remote</span><br><br></li><li><span>Work from any place you like, as long as you have a good Internet connection&nbsp;</span><br><br></li><li><span>Face challenges together and collaborate with international team members</span><br><br></li><li><span>Be part of a flat organization, where your voice is always heard</span><br><br></li><li><span>Get a steady income and other benefits such as paid vacations, scholarships, and more</span><br></li></ul><div><br></div><div><span>If you meet these requirements below, we’d like to meet you:</span></div><div><br></div><ul><li><span>Proven experience as an HR assistant, staff assistant or relevant human resources/administrative position.</span><br><br></li><li><span>BSc degree in Human Resources or relevant field&nbsp;</span><br><br></li><li><span>Familiarity with HR software&nbsp;</span><br><br></li><li><span>Excellent organizational skills</span><br><br></li><li><span>Experience organizing company retreats</span><br><br></li><li><span>Strong verbal and written English communication skills (If you’re also a good writer, let us know)</span><br><br></li><li><span>Demonstrated ability to work independently, to follow through on instructions, and meet deadlines.</span><br><br></li><li><span>Be an independent, reliable and resourceful person&nbsp;</span><br><br></li></ul><div>&nbsp;<br></div><div><span>Our preferred time zone is European, or similar. Also, </span><span>experience working with distributed teams is an advantage.</span><br></div><div>&nbsp;</div><div><br></div><div><span>If you think you’re the right fit for us, please apply.</span></div><div></div><div></div><div><br></div><div>&nbsp;</div><div><br></div><div>&nbsp;</div><div></div><div><br></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3zHJ7miaQv2Ql8IO5xeIng",
    "url": "https://remote.co/job/talent-manager/",
    "title": "Talent Manager",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot W OR(career,first)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Grafana Labs",
      "sameAs": "https://grafana.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 4, 2019 6:15:07 PM",
    "validThrough": "Aug 11, 2019 6:15:07 PM",
    "crawled": "Aug 4, 2019 6:23:52 PM",
    "content": "<h3>Talent Manager at <span>Grafana Labs</span></h3><div><span><i></i> Remote</span>        </div><div>            <p><strong>REMOTE</strong>&nbsp;· United States · G&amp;A</p><p><strong>DESCRIPTION</strong></p><p><strong>Location</strong>:&nbsp;<strong>East coast USA preferred/other locations considered</strong></p><p>We are looking for a Talent Manager to join our People Ops team to take responsibility for delivering our ambitious global headcount plans. The People Ops mission is to ensure we deliver a highly skilled, committed, successful and happy team and this role will play an integral part in the delivery of that work as we grow. One of our core values is ‘built better together’ and you will apply this to the growth of our team helping to ensure we maintain our strong culture and values as we grow.</p><p>This is a fantastic opportunity to help an ambitious tech startup meet our growth plans whilst also getting to work on some really interesting projects. You will take responsibility for the full lifecycle of both technical and non-technical international recruitment. In addition you will have the opportunity to partner with the VP People Ops to contribute to the delivery of projects focussed on recruitment processes, candidate experience, diversity and internal stakeholder recruitment training programs.</p><p>If you are an experienced recruiter, ready for a new challenge and enjoy making an impact, we’d love to hear from you!</p><p><strong>REQUIREMENTS</strong></p><ul><li>You will work alongside our Leadership team to deeply understand hiring requirements, hiring challenges, organisational structure and individual team dynamics</li><li>You will be responsible for the end to end recruitment process covering the entire candidate experience from sourcing and headhunting through to offer stage</li><li>You will be confident engaging passive candidates and utilising the team’s networks and technical experience to engage with candidates appropriately. You will be tasked with direct sourcing and keeping agency spend to a minimum.</li><li>You will be required to work with a mix of both technical and commercial international teams</li><li>You will have experience putting together role specific hiring and sourcing strategies using a broad range of channels including LinkedIn, Stack Overflow, Github, job boards, networking etc</li><li>You will quickly be able to understand our key requirements and good cultural fit and help to screen candidates based on your strong understanding of what we value and our company culture</li><li>You will help to champion diversity through our recruitment and work with the VP People Ops to build out a diversity hiring strategy for 2019 and beyond</li><li>You will work closely with the VP People Ops to review and enhance our recruitment process and to develop and deliver a recruitment best practice training program to the internal team</li></ul><p><strong>What would make you a good fit for this role?</strong></p><p>We’re a startup so your job duties will be varied and complex and will require strong judgement, collaboration and leadership. Initially this will be a standalone role and you will need to have the experience, drive and energy to hit the ground running working proactively and independently to deliver a first class recruitment service to the business and to candidates.</p><p>To be successful in this role you will have experience working in a dynamic, fast-paced global start-up. You will need excellent sourcing/research skills and have an ability to discover candidates for hard to fill requisitions through creative sourcing. It is essential that you have experience recruiting internationally in both Europe and the US.</p><p>You will have strong people and communication skills and will be adept at interacting with a variety of people at different levels and from different cultures and backgrounds.</p><p><strong>BENEFITS</strong></p><p>At our core Grafana Labs is an open company. We believe that open source is the superior way to build and deliver software. We also believe in being open and transparent with our employees. We believe that transparency breeds trust and that trust is the foundation of great teamwork. We actively seek to break down silos, empower employees with information and allow people to “see the whole picture”. This transparency extends to our strategy, our financials, our successes and failures. We empower our team to make their own decisions and trust that they will try to do the right thing.</p><p>We are a remote first team. Our three founders are on three different continents and our team of 70+ global employees are based in 15+ different countries. Hiring remotely unlocks the broadest, most diverse, most talented pool of potential employees. It also means that we have built our culture around a flexible and autonomous work environment based on trust.</p><p><strong>Equal Opportunity Employer</strong></p><p>At Grafana Labs we’re building a company where a diverse mix of talented people want to come, to stay, and to do their best work. We know that our company runs on the hard work and the dedication of our passionate and creative employees. We will recruit, train, compensate and promote regardless of race, religion, colour, national origin, gender, disability, age, veteran status and all the other fascinating characteristics that make us different and unique. We believe that equality and diversity builds a strong organisation and we’re working hard to make sure that’s the foundation of our organisation as we grow.</p>        </div><div>        <a href='https://grafana-labs.workable.com/j/54130CA504?viewed=true' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "FXIk7maxRDS6M6Kpj0zJhg",
    "url": "https://news.ycombinator.com/item?id=20587634",
    "title": "Muck Rack is looking for talented people to join our fast-growing New York (but remote-friendly ...",
    "tags": [
      "DBG:surround``OR(abl,will,challeng,flexibl,experi,get,prefer) 2W 2N(work,remot)",
      "DBG_TECH1:k/t/w:django/python/16",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:python/python/2",
      "DBG_TECH1:k/t/w:webpack/frontend/5",
      "DBG_TECH1:techWeightMap:{python=18, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=6}",
      "REMOTE1/100",
      "TECH1/python",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "python"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2019 9:53:20 PM",
    "validThrough": "Aug 8, 2019 9:53:20 PM",
    "crawled": "Aug 1, 2019 10:32:05 PM",
    "content": "Muck Rack is looking for talented people to join our fast-growing New York (but remote-friendly) SaaS startup. Our mission is to make journalists, PR pros and marketers more successful. Muck Rack offers tools that help media professionals find and contact the most relevant journalists for their stories, and monitor how their stories perform.<p>Muck Rack offers a very flexible remote working policy. We strongly believe if you let responsible people handle their own work on their own priorities and timeline, not only will you produce better work, but you will be a happier employee!</p><p>We are devoted to our wonderful customers, transparent with one another, take ownership over our work, and remain resilient when presented with challenges.</p><p>We offer eligible employees access to quality health insurance and 401(k) plans, your choice of equipment, a generous vacation policy, personal development, and more.</p><p>Our tech stack includes Python, Django, Celery, Redis, Elasticsearch, Nginx, Gunicorn, ES6 and Webpack on the front-end, Varnish, and Ansible. If you enjoy Django, scraping, textual analysis, information extraction, and _data_, this is your place. Our engineers are not siloed to any particular part of the application - everyone contributes everywhere. Bonus points if you are familiar with browser performance profiling, search relevancy tuning, security, DevOps interest and experience, or have a demonstrated empathy for design.</p><p>We would love to talk to you! Here's what we're hiring for now:</p><p>- Senior Software Engineer <a href='https://boards.greenhouse.io/muckrack/jobs/4250275002' rel='nofollow'>https://boards.greenhouse.io/muckrack/jobs/4250275002</a>- Front End Developer <a href='https://boards.greenhouse.io/muckrack/jobs/4376802002' rel='nofollow'>https://boards.greenhouse.io/muckrack/jobs/4376802002</a></p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "IQvpwSYkQtGHJuh_Lzio3A",
    "url": "https://remote.co/job/recruiter-60/",
    "title": "Recruiter",
    "tags": [
      "DBG:surround``remot W OR(contractor,assist,ok)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Side Real Estate",
      "sameAs": "https://www.sideinc.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 31, 2019 5:50:26 PM",
    "validThrough": "Aug 7, 2019 5:50:26 PM",
    "crawled": "Jul 31, 2019 6:26:48 PM",
    "content": "<h3>Recruiter at <span>Side Real Estate</span></h3><div><span><i></i> Remote</span>         | <span> Freelance </span></div><div>            <p><strong>GENERAL AREA</strong></p><p><strong>PEOPLE OPERATIONS – TALENT</strong></p><p><strong>1099 (CONTRACT)</strong></p><p><strong>ABOUT SIDE</strong></p><p>At Side, we believe everyone should own their path.</p><p>As the first company to design an end to end modern brokerage solution, Side is re-imagining the real estate industry from the ground up by combining innovative technology, creative branding expertise, and an experienced leadership team with a mission to empower the world’s leading real estate professionals to own their brand and better serve home buyers and sellers.</p><p>In the past two years, with an exceptional team of inSiders, we’ve processed $1B in transactions and raised over $30M in funding from top tier investors like Matrix Partners, Trinity Ventures, and 8VC.</p><p>At Side, you’ll have the opportunity to collaborate and innovate your way to success. Becoming an inSider means that you’ll be empowering business leaders to become business owners, all while forging your own path with like-minded entrepreneurs. Join us at Side and own your career, your impact, and your life.</p><p><strong>ABOUT THE ROLE</strong></p><p>We’re looking for a full-cycle (<strong>remote contractor</strong>) Recruiter to own a mixture of business and technical hiring. As a full-cycle recruiter, you’ll be responsible for developing and implementing a candidate recruitment strategy. This includes advertising and passive candidate sourcing, acting as the gatekeeper to our culture and screening candidates thoroughly before passing them onto the next round, and creating a superb candidate experience that promotes our employer brand. You’ll own the recruitment of 8-10 roles at a time and manage the relationships with each candidate.</p><p><strong>WHAT YOU’LL BE DOING</strong></p><ul><li>Lead intake discussions with hiring managers, gathering the role requirements and supporting hiring managers in defining the interview process</li><li>Develop and implement advertising strategies to attract candidates to each role that you own</li><li>Source potential candidates on major and niche platforms by crafting personalized recruiting emails</li><li>Phone screen candidates and assess for cultural and role fit, make recommendations to hiring managers on which candidates to move forward with</li><li>Own candidate relationships and maintain a high close rate per requisition</li></ul><p><strong>WHAT WOULD MAKE YOU A STRONG FIT FOR THE ROLE?</strong></p><ul><li>5+ years of experience in the recruiting industry with at least 3 years as a full-cycle recruiter</li><li>Hands-on experience recruiting for Engineering talent (e.g. Tech Leads and Software Engineers)</li><li>Strong writing skills and can succinctly develop a pitch</li><li>Critical eye for identifying top talent for specific roles</li><li>Strong prioritization skills</li><li>Successful track record of achieving targets</li><li>Candidate-first mentality</li><li>Familiarity with Applicant Tracking Systems (specifically Lever)</li><li>Self-starter with an incredible work ethic</li></ul><p><strong>COMPENSATION/PERKS</strong></p><ul><li>Competitive salary</li><li>Stock options</li><li>Best-in-class benefits, including 100% healthcare coverage (medical, vision and dental)</li><li>Flexible PTO</li><li>Learning and development credit</li><li>Pet friendly environment</li></ul><p><em>Side is committed to creating a diverse environment and is an equal opportunity employer. Side does not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, parental status, veteran status, or disability status.</em></p><p><em>Side uses the E-Verify employment verification program.</em></p><p><em>Our stewardship of the data of many of our customers means that a background and DRE license check is required to join Side. We will, nonetheless, consider qualified applicants with arrest and conviction records in accord with applicable law, including the San Francisco Fair Chance Ordinance. </em></p>        </div><div>        <a href='https://jobs.lever.co/sideinc/f3c8ef88-0ea2-440e-b0ad-9a90ba62ea7f' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "gz8EnsI5QI2wgQcu2d29QQ",
    "url": "https://remote.co/job/recruiting-coordinator-8/",
    "title": "Recruiting Coordinator",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Gatsby",
      "sameAs": "https://www.gatsbyjs.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 29, 2019 6:58:59 PM",
    "validThrough": "Aug 5, 2019 6:58:59 PM",
    "crawled": "Jul 29, 2019 7:31:13 PM",
    "content": "<h3>Recruiting Coordinator at <span>Gatsby</span></h3><div><span><i></i> Remote</span>         | <span> Entry-level </span> | <span> Freelance </span> | <span> Part-time </span></div><div>            <ul><li><strong>Remote</strong></li><li><strong>Contracted</strong></li><li><strong>Human Resources</strong></li><li><strong>Entry Level</strong></li></ul><p>Join us on our mission to help our customers create blazing fast, compelling websites and apps. We are looking for an organized, personable, and quick-learner to help keep the recruiting process moving.</p><p><strong>Details of the Role</strong></p><ul><li><strong>Type of Work: Part-time contract (10-15 hours/week). Potential for contract-to-hire.</strong></li><li><strong>Location: Remote (US preferred)</strong></li></ul><p><strong>What You Will Do</strong></p><ul><li>Act as a point of contact for candidates</li><li>Conduct resumé and phone screens</li><li>Schedule interviews</li><li>Collect candidate feedback</li><li>Ensure that all applicants are moving through the process in a timely manner</li><li>Communicate and plan with hiring managers</li></ul><p><strong>Traits We Are Seeking</strong></p><ul><li>Personable and kind to others</li><li>High attention to detail</li><li>Takes initiative – does things before asked</li><li>Can write well-crafted emails</li><li>Able to learn new systems quickly</li><li>Works well as part of a team</li><li>Understands that diversity is an asset</li></ul><p><strong>About Us</strong></p><p>GatsbyJS was born in May 2015 as a simple way to build a website with React. Over the last three years, tens of thousands of developers have used Gatsby to build websites from blogs and portfolio pages to company homepages and e-commerce applications.</p><p>In early 2018, GatsbyJS core contributors, including creator &amp; lead maintainer Kyle Mathews, formed Gatsby Inc to help website development teams build CMS-powered websites with modern tooling.</p><p>Our core values include transparency (we work in public most of the time); creating a safe, high-trust team; building incredible developer experiences; fostering diverse perspectives; maintaining a healthy working environment; and helping deliver web experiences that feel amazing to use on every device and connection type.</p>        </div><div>        <a href='https://gatsbyjs.applytojob.com/apply/EXG4EqnZ27/Recruiting-Coordinator' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "NnFaEsbsQSOkrtIE8h-qog",
    "url": "https://remote.co/job/technical-sourcing-specialist-2/",
    "title": "Technical Sourcing Specialist",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG_TECH1:k/t/w:data-science/bigdata-ml/8",
      "DBG_TECH1:k/t/w:facet/nodejs/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=8, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/nodejs",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "Randstad Sourceright",
      "sameAs": "https://www.randstadsourceright.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 25, 2019 5:40:03 PM",
    "validThrough": "Aug 1, 2019 5:40:03 PM",
    "crawled": "Jul 25, 2019 6:25:43 PM",
    "content": "<h3>Technical Sourcing Specialist at <span>Randstad Sourceright</span></h3>\n<div>\n <span><i></i> Remote</span> | \n <span> Freelance </span>\n</div>\n<div> \n <p><strong>Location: United States, US</strong></p>\n <p><strong>Job Number </strong>30059</p>\n <p><strong>United States, US</strong></p>\n <p><strong>Contract</strong></p>\n <p><strong>About Randstad Sourceright</strong></p>\n <p>Randstad Sourceright is a global talent leader, providing solutions and expertise that help companies position for growth, execute on strategy, and improve business agility. Sourceright’s experience encompasses all facets of the talent acquisition of permanent employees and the contingent and contractor workforce. Key offerings include Managed Services Provider (MSP) programs, Recruitment Process Outsourcing (RPO) and Blended Workforce Solutions.</p>\n <p>The<strong>&nbsp;Technical Sourcing Specialist&nbsp;</strong>will promote sourcing and recruitment excellence for Randstad Sourceright (RSR) client recruitment initiatives. Successful candidates will be resourceful, consultative, process driven, and a relationship builder. They will have industry knowledge as well as expert level compliance knowledge in order to reach the best possible outcome for the candidate and our client partner.</p>\n <p><strong>Responsibilities include:</strong></p>\n <ul>\n  <li>Sourcing efforts for multiple disciplines</li>\n  <li>Consultative approach to candidate engagement and retention</li>\n  <li>Candidate, client &amp; Recruiter relationship building</li>\n  <li>Participates in Intake calls/requisition reviews</li>\n  <li>Ability to understand a variety of job descriptions as well as strong industry knowledge</li>\n  <li>Creation and marketing of compelling job postings</li>\n  <li>Candidate assessment and selection techniques</li>\n  <li>Collaborate on sourcing framework</li>\n  <li>Executes various sourcing strategies</li>\n </ul>\n <p><strong>Essential Competencies</strong></p>\n <p>We are looking for a creative thinkers and innovators with a drive to promote the discovery and development of highly effective sourcing processes and business practices.</p>\n <p><strong>Basic Qualifications</strong></p>\n <ul>\n  <li>5-7 years of experience in a talent acquisition (Information Technology – specifically in Data Science and SWE)</li>\n  <li>3 years of experience in a Sourcing capacity</li>\n  <li><strong>High School Diploma or GED</strong></li>\n </ul>\n <p><strong>Additional Qualifications</strong></p>\n <ul>\n  <li><strong>College degree strongly preferred</strong></li>\n  <li>Strong grasp of candidate source and channel analytics.</li>\n  <li>Strong grasp of diversity recruitment concepts. Understanding of SEO, keywords, and social listening tools.</li>\n  <li>Ability to connect and communicate with individuals at all levels of the organization, from entry-level to executives.</li>\n </ul>\n <p>Randstad Sourceright is an Equal Opportunity Employer and makes all employment decisions based solely on the basis of qualifications and without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, disability, protected veteran status or any other legally protected group status.</p> \n</div>\n<div> \n <a href='https://randstadus.gr8people.com/index.gp?method=cappportal.showJob&amp;syslayoutid=122&amp;opportunityid=30059' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "QCLWnAVORTWseIzedRnmnQ",
    "url": "https://remote.co/job/senior-talent-sourcer-recruiter/",
    "title": "Senior Talent Sourcer – Recruiter",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "GeoLogics",
      "sameAs": "https://www.geologics.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 23, 2019 5:05:52 PM",
    "validThrough": "Jul 30, 2019 5:05:52 PM",
    "crawled": "Jul 23, 2019 5:09:19 PM",
    "content": "<h3>Senior Talent Sourcer – Recruiter at <span>GeoLogics</span></h3>\n<div>\n <span><i></i> Remote</span> \n</div>\n<div> \n <p>We have an opening with a major aerospace company in McLean, VA for a Sr. Talent Sourcer – Recruiter. NOTE: <strong>This is a REMOTE job and is a long term stable role (No end date anticipated). </strong>US Citizenship is required.</p>\n <p><strong>Contractor’s Work Location: Remote</strong></p>\n <p><strong>Manager’s Location</strong><strong>:</strong> McLean, VA</p>\n <p>As a member of our team, a Sourcer works closely with our recruiters and hiring managers to develop strategies to find candidates for our IT, Engineering, and Intelligence Analysis organizations. We conceive practical and creative ways to surface leading talent, and we invest a lot of time activating passive candidates through a highly engaged approach. We’re passionate about delivering an awesome candidate experience, and that starts with the first conversation a candidate has with us, which is more often than not with a member of our Sourcing team. We’re seeking a dynamic Sourcer who brings a level of motivation, curiosity and technical capability to our team</p>\n <ul>\n  <li>Work closely with Recruiters and hiring managers to deeply understand requirements of the role, the function and how it fits into the organization</li>\n  <li>Team with Recruiters and hiring managers to manage an efficient model of operation</li>\n  <li>Strategize different ways to build talent pipelines and execute on tactical research, referral generation, events and sourcing campaigns</li>\n  <li>Find, engage and activate passive candidates through the use of Boolean, LinkedIn and alternative search techniques</li>\n  <li>Screen resumes and interview candidates to determine fit</li>\n  <li>Regularly track pipeline activity to share with internal stakeholders</li>\n  <li>Recommend and drive improvements that impact local pipeline areas</li>\n </ul>\n <p><strong>Skills Required:</strong></p>\n <ul>\n  <li>5+ years of technical sourcing experience with a search firm or in-house recruiting team</li>\n  <li>Excellent research/sourcing skills with the ability to dive deep into searches for hard-to-fill reqs</li>\n  <li>Sound candidate engagement approach with ability to activate passive candidates</li>\n  <li>Sharp interview skills with the ability to screen for both technical and cultural qualities</li>\n  <li>Strong interpersonal skills with the ability to communicate well</li>\n </ul>\n <p><strong>Skills Preferred</strong></p>\n <p>Prior staffing agency experience. Sourcing certification (AIRS, ERE/Sourcecon, Boolean Blackbelt, etc.) Involved in networking groups, social media, and has genuine interest in new and emerging sourcing methods and technologies.</p>\n <p><strong>Experience Required</strong></p>\n <ul>\n  <li>5+ years technical sourcing experience with a search firm or in-house recruiting team</li>\n  <li><strong>Education Required- High School Diploma</strong></li>\n  <li><strong>Education Preferred- BS or MS Degree plus professional certifications</strong></li>\n </ul>\n <p>Career consultants and candidates with lots of short assignments will not be considered. Work ethic, competitiveness, type-a personality trumps having prior experience with the Defense/Intelligence Community. No end date anticipated. This is a long-term stable role for which we are seeking a career-long match ideally.</p> \n</div>\n<div> \n <a href='https://www.jobs.net/jobs/corporateweb-geologics/en-us/job/United-States/Sr-Talent-Sourcer-Recruiter/J3P54W6DH0HY93VLW5L/' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "8Y5VgfjuT2ulZmNmmfMsbw",
    "url": "http://workinstartups.com/job-board/job/82602/people-office-manager-at-tech-nation/",
    "title": "People + Office Manager",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:layout/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Tech Nation",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 22, 2019 3:08:44 PM",
    "validThrough": "Jul 29, 2019 3:08:44 PM",
    "crawled": "Jul 22, 2019 5:06:34 PM",
    "content": "People + Office Manager\n<br>\n<br>Who we are\n<br>\n<br>We are Tech Nation, the UK Network for ambitious tech entrepreneurs. Our mission is to empower ambitious tech entrepreneurs to grow faster through knowledge and connections. We want to make the UK the best place to imagine, start and grow a digital business to build an economy fit for the next generation. As a high growth startup ourselves, we are a neutral player sitting right at the heart of the ecosystem of high growth digital businesses, policy-makers and corporations.\n<br>\n<br>We empower tech founders to grow faster through our various growth programmes such as Founders’ Network, Upscale, Future Fifty, and Fintech. But not only that, we also offer end-to-end data, insights, stories &amp; resources, a UK wide community that shares the same entrepreneurial culture, and we are the only approved organisation for the Tech Nation Visa scheme rolled out for exceptional talent.\n<br>\n<br>Our Culture:\n<br>\n<br>We are a small but fast growing, high-performance team with high standards and big ambitions. We strive for excellence in everything we do. Our aim is to be transformative and collaborative in our work. We focus on speed, scale, smart resourcefulness and unbounded optimism. We never start with ‘no.’ We’re solution oriented and focus on the outcome and the impact of any project or priority. We’re a curious bunch, creative and a little quirky. We debate things passionately in team meetings and stand-ups. We agree and disagree on how the world should work, but we all agree on making a big difference through our work at Tech Nation. Which is why we love it here and never take it for granted.\n<br>\n<br>Our values are: originality, meaningful collaboration and real impact.\n<br>\n<br>The Role \n<br>\n<br>We are looking for an amazing People and Office Manager to organise and coordinate admin duties and office procedures. This dual role will report into the People Lead and lend support to the various people activities at Tech Nation. Your role is to create and maintain a pleasant work environment, ensuring high levels of organisational effectiveness, communication and safety.\n<br>\n<br>A Day in the Life of a Tech Nation People + Office Manager might look something like this:\n<br>\n<br>The office management side of the role\n<br>\n<br>Serve as the point person for office manager duties including:\n<br>Maintenance\n<br>Mailing\n<br>Supplies\n<br>Equipment\n<br>Bills\n<br>Errands\n<br>Shopping\n<br>Schedule meetings and appointments\n<br>Organise the office layout and order stationery and equipment\n<br>Maintain the office condition and arrange necessary repairs\n<br>Organise office operations and procedures\n<br>Manage contract and price negotiations with office vendors, service providers and office lease\n<br>Manage office G&amp;A budget, ensure accurate and timely reporting\n<br>Provide general support to visitors\n<br>Address employees queries regarding office management issues (e.g. stationery, Hardware and travel arrangements)\n<br>Liaise with facility management vendors, including cleaning, catering and security services\n<br>Work closely with the Manchester team as well remote workers to ensure they have all they need. \n<br>\n<br>The People side of the role\n<br>\n<br>Support the People Lead to plan in-house or off-site activities, like parties, celebrations and conferences\n<br>Own the on-boarding process for new hires\n<br>Organise and maintain personnel records\n<br>Update our HR system where needed \n<br>Participate and support with HR projects \n<br>As well as sharing our ambitions and values, you will\n<br>Proven work experience as an office manager\n<br>Knowledge of office administrator responsibilities, systems and procedures\n<br>Proficiency in MS Office (MS Excel and MS Outlook, in particular)\n<br>Excellent time management skills and ability to multi-task and prioritize work\n<br>Attention to detail and problem-solving skills\n<br>Excellent written and verbal communication skills\n<br>Strong organisational and planning skills in a fast-paced environment\n<br>A creative mind with an ability to suggest improvements\n<br>Experience of working closely with the HR team \n<br>\n<br>What’s in it for you?\n<br>\n<br>Untangl, which include access to a cash plan that covers health, protection and well being.\n<br>Perkbox\n<br>A shiny new macbook\n<br>A 4% employer pension\n<br>A flexible work environment\n<br>Cycle to work scheme (up to £1,000)\n<br>Season ticket loan (up to £5,000)\n<br>Quarterly team away days\n<br>\n<br>WHERE TO FROM HERE?\n<br>\n<br>We welcome those with alternative identities, backgrounds, and experiences. Our team includes women, men, mothers, fathers, the self-taught, the university-educated, and people of a wide variety of nationalities, ages, and socio-economic backgrounds.\n<br>\n<br>Obviously, we’re looking to ensure it’s a solid fit from both sides: we want you to step into a role you love, and we want to offer you a place you’re proud to come to every day. \n<br>\n<br>Now that you’re done reading, apply!\n<br>\n<br>* We know that diverse teams are strong teams, and welcome those with alternative identities, backgrounds, and experiences to apply to life at Tech Nation. We are committed to a fair and accessible recruitment process for all candidates. We would be happy to meet any accommodation requests during the application or interview process, please just let us know*.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "22gAaJQcRj64UXNnuc6lDQ",
    "url": "https://remote.co/job/senior-hr-generalist/",
    "title": "Senior HR Generalist",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "TeamSnap",
      "sameAs": "https://www.teamsnap.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 14, 2019 5:53:24 PM",
    "validThrough": "Jul 21, 2019 5:53:24 PM",
    "crawled": "Jul 14, 2019 6:23:49 PM",
    "content": "<h3>Senior HR Generalist at <span>TeamSnap</span></h3>\n<div>\n <span><i></i> Remote</span> \n</div>\n<div> \n <ul>\n  <li><strong>United States</strong></li>\n  <li><strong>Full Time</strong></li>\n  <li><strong>Experienced</strong></li>\n </ul>\n <p>Here at TeamSnap we believe that who you work with is just as important as the work you do. We know that culture matters and to build and sustain a strong culture means we need a strong and dedicated team to support these efforts. To continue building our strong culture, we are expanding our people team as we seek to add an experienced and driven Senior HR Generalist (we call it a Sr. People Experience Generalist) to help identify, develop and retain top talent here at TeamSnap. The Senior HR Generalist will be tasked with being the internal champion of TeamSnap recruiting efforts, building and nurturing relationships with team members and managers alike, and identifying where human resources practices can be leveraged to support the business strategies and challenges.</p>\n <p><strong>About us</strong><br>TeamSnap is an award-winning communication and management service for recreational and competitive sports teams, tournaments and organizations. With over 20 million enthusiastic customers in 195 countries, TeamSnap is indispensable for teams, clubs and leagues worldwide.</p>\n <p>We value trust, communication and fun more than big company policies and rules, and we thrive on empowering our people instead of controlling them. TeamSnap has been named to Outside Magazine’s list of Best Places to Work three consecutive years.</p>\n <p><strong>What you’ll be doing</strong><br>Here at TeamSnap we’re building a PX team that meets the needs of all employees from top to bottom and across every function. Our goal is to not only recruit the best talent possible, but to nurture and develop them throughout the entire employee life cycle. This role will:</p>\n <ul>\n  <li>Function as our recruiting champion recruiting process from sourcing, screening, interviewing, negotiating offers, and coordinating with contractors and/or consultants who support our recruiting efforts.</li>\n  <li>Ensure the appropriate HR processes are in place to meet compliance requirements and continually strive to improve processes to better streamline operational efficiencies.</li>\n  <li>Partner and advise people leaders and team members on HR related policies, programs, and procedures.</li>\n  <li>Recommends HR approaches and strategies to continually improve departmental efficiency.</li>\n  <li>Support HR programs such as benefits, performance reviews, compensation, and learning &amp; development.</li>\n  <li>Investigate, resolve and coach managers on employee relations issues.</li>\n  <li>Assist with offboarding and other responsibilities related to terminations.</li>\n  <li>Conduct exit interviews and assist in creating effective retention strategies.</li>\n  <li>Maintain employee files and compile reports concerning data such as hires, transfers, performance, etc.</li>\n  <li>Perform presentations on HR compliance topics to ensure the company is in adherence to HR policies, procedures, and programs.</li>\n  <li>Assist with identifying and arranging training needs for employee development.</li>\n  <li>Understands and ensures compliance with federal, state and local HR requirements; communicating potential changes, and advising leadership on needed actions.</li>\n </ul>\n <p><strong>Some things that are important:</strong></p>\n <ul>\n  <li>5+ years of progressive experience in human resources</li>\n  <li>Effective team player and multi-tasker with the ability to prioritize multiple streams of work from multiple sources without sacrificing quality</li>\n  <li>Progressive recruiting experience is a must</li>\n  <li>Has the balance of owning the work, but also playing as a team</li>\n  <li>Well versed in federal, state, and local laws and guidelines relating to employment practices</li>\n  <li>Developed knowledge of HR policies and processes</li>\n  <li>Sense of humor is essential, we work hard so we make sure we have fun doing it</li>\n  <li>Appreciates and facilitates the link between HR and business strategy</li>\n  <li>Ability to identify needs within the business that require HR support</li>\n  <li>Experience building and scaling a rapidly growing team</li>\n  <li>Comfortable providing coaching and feedback to all levels</li>\n  <li>Strong customer service, communication and interpersonal communication skills</li>\n </ul>\n <p><strong>Other things that would be nice to have:</strong></p>\n <ul>\n  <li><strong>Bachelor’s degree in Human Resources or related field</strong></li>\n  <li>Professional certification in HR (SHRM or HCI)</li>\n  <li>Experience working for a fully remote organization</li>\n  <li>Past work with rapidly scaling SaaS startups</li>\n  <li>Experience working with remote and distributed teams</li>\n  <li>Be a TeamSnap user (sign up for a free trial to see what we’re about)</li>\n  <li>Ability to talk to animals, Doctor Doolittle-style</li>\n </ul>\n <p><strong>Location</strong><br><strong>REMOTE POSITION: We are headquartered in Boulder, Colorado, but this job is remote (unless you happen to live near Boulder, in which case you’re welcome to come to the office).&nbsp;</strong>TeamSnap is a mostly-distributed company, so you must be very comfortable working with people who aren’t in the same physical location as you or each other. While we love all parts of the world,&nbsp;<strong>we can only hire US-based citizens at this time.</strong></p>\n <p><strong>Why TeamSnap?</strong></p>\n <ul>\n  <li>Work on a product that people use and love</li>\n  <li>While we’re still relatively small, we’re not a fly-by-night startup; we’re the leader in a massive market</li>\n  <li>We have a proven revenue model, an experienced executive team, solid funding, and a strong strategic plan</li>\n  <li>We have fantastic benefits, and you’ll have a stake in the company</li>\n </ul>\n <p>If you’re looking for an opportunity to show off the very best of your skills, in an environment of trust, respect and flexibility, this might very well be the best job you’ll ever have. We’re passionate about helping our customers spend less time organizing and more time playing.</p>\n <p><strong>Benefits and Perks</strong><br>We offer competitive salary and benefits, lots of opportunity to develop professionally, and the ability to demonstrate what you can achieve. TeamSnap is still small enough that your actions will help drive our success.</p>\n <p><strong>Benefits include:</strong></p>\n <ul>\n  <li>Competitive salary</li>\n  <li>Stock options</li>\n  <li>Medical/dental/vision for you and your family</li>\n  <li>Education reimbursement up to $1,500/yr</li>\n  <li>Wellness stipend of $50/mo</li>\n  <li>401K</li>\n  <li>Free TeamSnap service for your family and friends</li>\n  <li>Free TeamSnap swag.</li>\n  <li>Flexible PTO and vacation policy</li>\n </ul> \n</div>\n<div> \n <a href='https://teamsnap.applytojob.com/apply/8LGf80jzyd/Senior-HR-Generalist' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "5n20BU1uRSSqhUHN1cLWbw",
    "url": "https://remote.co/job/therapy-recruiter/",
    "title": "Therapy Recruiter",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Reliant Rehabilitation",
      "sameAs": "https://www.reliant-rehab.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 12, 2019 5:34:10 PM",
    "validThrough": "Jul 19, 2019 5:34:10 PM",
    "crawled": "Jul 12, 2019 6:23:52 PM",
    "content": "<h3>Therapy Recruiter at <span>Reliant Rehabilitation</span></h3>\n<div>\n <span><i></i> Remote</span> \n</div>\n<div> \n <p><strong>Corporate TALEN05189</strong></p>\n <p><strong>Full-Time</strong></p>\n <p><strong>Plano, TX, USA</strong></p>\n <p><strong>Job Details</strong></p>\n <p><strong>Description</strong></p>\n <p>The Recruiter (Therapy) will be based out of our<strong>&nbsp;Plano, Texas office or remote</strong>&nbsp;and will be responsible for reviewing, screening, and referring applicants for therapy-based positions (physical, occupational, and speech) throughout the company’s facilities. The recruiter will also work with hiring managers in the field to develop recruiting plans to support business need. Considerable skills in interviewing techniques, a good knowledge of healthcare, a basic understanding of the company’s organizational structure as well as an extensive knowledge of personnel policy and procedure and federal and state laws regarding employment practices are essential.</p>\n <p><strong>RESPONSIBILITIES:</strong></p>\n <ul>\n  <li>Responsible for full life cycle recruiting, including sourcing, interviewing, and on-boarding</li>\n  <li>Development of recruiting plans, in conjunction with hiring managers.</li>\n  <li>Develops relationships with allied health education providers, and professional associations.</li>\n  <li>Provide consultative support to hiring managers.</li>\n  <li>Responsible for identifying, interviewing, evaluating, and assisting in selection of talent to ensure organizational goals are achieved.</li>\n  <li>Ensure all applicant / new employee documents are received, complete and accurately entered into HRIS system.</li>\n  <li>Act as liaison with area employment agencies, prepare and liaison with advertising agencies, and temporary agencies.</li>\n  <li>Develop and maintain job postings on various recruitment sites (Indeed, LinkedIn, etc).</li>\n  <li>Coordinate attendance at career fairs, job fairs, professional conferences, educational conferences.</li>\n  <li>Complete weekly, monthly and annual reports on recruitment / employment activity.</li>\n  <li>Notify all departments of employee’s hire and start date.</li>\n  <li>Provide all new hire documents to payroll and benefits.</li>\n  <li>Ensure all job postings are posted internally and track internal applicants.</li>\n  <li>Data Entry of HR documents.</li>\n  <li>And other duties as requested.</li>\n </ul>\n <p><strong>REQUIREMENTS AND QUALIFICATIONS:</strong></p>\n <ul>\n  <li><strong>Bachelor’s Degree</strong>&nbsp;or equivalent experience.</li>\n  <li>At least 3 years of experience as an agency/staffing recruiter or corporate recruiter, preferably in healthcare.</li>\n </ul>\n <p><strong>The following are personal qualities that will characterize the successful applicant:</strong></p>\n <ul>\n  <li>Excellent presentation skills</li>\n  <li>Superb communication proficiency – both verbal and written.</li>\n  <li>Customer/Client focused.</li>\n  <li>Negotiation and problem-solving skills.</li>\n  <li>Time management and prioritization skills.</li>\n  <li>Thoroughness.</li>\n  <li>Detail orientated.</li>\n  <li>Ability to file, sort, and maintain company/employee data.</li>\n  <li>Ability to create and provide reports and departmental communications.</li>\n </ul> \n</div>\n<div> \n <a href='https://ars2.equest.com/?response_id=34009d02770edbd5f5f3deda5aa5a8cd' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "CvbLBV-1QnCYlyIoztOqDg",
    "url": "https://weworkremotely.com/remote-jobs/teamsnap-sr-hr-generalist",
    "title": "TeamSnap: Sr. HR Generalist",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "TeamSnap",
      "sameAs": "http://www.teamsnap.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 12, 2019 4:02:34 PM",
    "validThrough": "Jul 19, 2019 4:02:34 PM",
    "crawled": "Jul 12, 2019 4:06:23 PM",
    "content": "<h3> Sr. HR Generalist </h3>\n<div>\n <div>\n  Here at TeamSnap we believe that who you work with is just as important as the work you do.&nbsp; We know that culture matters and to build and sustain a strong culture means we need a strong and dedicated team to support these efforts.&nbsp; To continue building our strong culture, we are expanding our people team as we seek to add an experienced and driven Senior HR Generalist (we call it a Sr. People Experience Generalist) to help identify, develop and retain top talent here at TeamSnap.&nbsp; The Senior HR Generalist will be tasked with being the internal champion of TeamSnap recruiting efforts, building and nurturing relationships with team members and managers alike, and identifying where human resources practices can be leveraged to support the business strategies and challenges.&nbsp;\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>About us</b></span>\n </div>\n <div>\n  <span>TeamSnap is an award-winning communication and management service for recreational and competitive sports teams, tournaments and organizations. With over 20 million enthusiastic customers in 195 countries, TeamSnap is indispensable for teams, clubs and leagues worldwide.</span>\n </div>\n <div>\n  <span><br></span>\n </div>\n <div>\n  We value trust, communication and fun more than big company policies and rules, and we thrive on empowering our people instead of controlling them. TeamSnap has been named to Outside Magazine’s list of Best Places to Work three consecutive years.\n  <span><br></span>\n </div>\n <div></div>\n <div>\n  <br>\n </div>\n <div>\n  <b>What you’ll be doing</b>\n  <br>\n </div>\n <div></div>\n <div>\n  Here at TeamSnap we’re building a PX team that meets the needs of all employees from top to bottom and across every function.&nbsp; Our goal is to not only recruit the best talent possible, but to nurture and develop them throughout the entire employee life cycle.&nbsp; This role will:&nbsp;\n  <br>\n </div>\n <div></div>\n <ul>\n  <li>Function as our recruiting champion recruiting process from sourcing, screening, interviewing, negotiating offers, and coordinating with contractors and/or consultants who support our recruiting efforts.</li>\n  <li>Ensure the appropriate HR processes are in place to meet compliance requirements and continually strive to improve processes to better streamline operational efficiencies.</li>\n  <li>Partner and advise people leaders and team members on HR related policies, programs, and procedures.</li>\n  <li>Recommends HR approaches and strategies to continually improve departmental efficiency.</li>\n  <li>Support HR programs such as benefits, performance reviews, compensation, and learning &amp; development.</li>\n  <li>Investigate, resolve and coach managers on employee relations issues.</li>\n  <li>Assist with offboarding and other responsibilities related to terminations.</li>\n  <li>Conduct exit interviews and assist in creating effective retention strategies.</li>\n  <li>Maintain employee files and compile reports concerning data such as hires, transfers, performance, etc.</li>\n  <li>Perform presentations on HR compliance topics to ensure the company is in adherence to HR policies, procedures, and programs.</li>\n  <li>Assist with identifying and arranging training needs for employee development.</li>\n  <li>Understands and ensures compliance with federal, state and local HR requirements; communicating potential changes, and advising leadership on needed actions.</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <b><strong>Some things that are important:</strong>&nbsp;</b>\n </div>\n <ul>\n  <li>5+ years of progressive experience in human resources</li>\n  <li>Effective team player and multi-tasker with the ability to prioritize multiple streams of work from multiple sources without sacrificing quality</li>\n  <li>Progressive recruiting experience is a must</li>\n  <li>Has the balance of owning the work, but also playing as a team</li>\n  <li>Well versed in federal, state, and local laws and guidelines&nbsp; relating to employment practices</li>\n  <li>Developed knowledge of HR policies and processes</li>\n  <li>Sense of humor is essential, we work hard so we make sure we have fun doing it</li>\n  <li>Appreciates and facilitates the link between HR and business strategy</li>\n  <li>Ability to identify needs&nbsp; within the business that require HR support</li>\n  <li>Experience building and scaling a rapidly growing team</li>\n  <li>Comfortable providing coaching and feedback to all levels</li>\n  <li>Strong customer service, communication and interpersonal communication skills</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Other things that would be nice to have:&nbsp;</b></span>\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li>Bachelor’s degree in Human Resources or related field</li>\n  <li>Professional certification in HR (SHRM or HCI)</li>\n  <li>Experience working for a fully remote organization</li>\n  <li>Past work with rapidly scaling SaaS startups</li>\n  <li>Experience working with remote and distributed teams</li>\n  <li>Be a TeamSnap user (sign up for a free trial to see what we’re about)</li>\n  <li>Ability to talk to animals, Doctor Doolittle-style</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Location</b></span>\n  <br>\n </div>\n <div></div>\n <div>\n  REMOTE POSITION: We are headquartered in Boulder, Colorado, but this job is remote (unless you happen to live near Boulder, in which case you’re welcome to come to the office). TeamSnap is a mostly-distributed company, so you must be very comfortable working with people who aren’t in the same physical location as you or each other. While we love all parts of the world, we can only hire US-based citizens at this time.\n  <br>\n </div>\n <div></div>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Why TeamSnap?</b></span>\n  <br>\n </div>\n <div></div>\n <ul>\n  <li>Work on a product that people use and love</li>\n  <li>While we’re still relatively small, we’re not a fly-by-night startup; we’re the leader in a massive market</li>\n  <li>We have a proven revenue model, an experienced executive team, solid funding, and a strong strategic plan</li>\n  <li>We have fantastic benefits, and you’ll have a stake in the company</li>\n  <li><br></li>\n </ul>\n <div>\n  If you’re looking for an opportunity to show off the very best of your skills, in an environment of trust, respect and flexibility, this might very well be the best job you’ll ever have. We’re passionate about helping our customers spend less time organizing and more time playing.&nbsp;\n  <br>\n </div>\n <div></div>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Benefits and Perks</b></span>\n  <br>\n </div>\n <div></div>\n <div>\n  We offer competitive salary and benefits, lots of opportunity to develop professionally, and the ability to demonstrate what you can achieve. TeamSnap is still small enough that your actions will help drive our success.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <b>Benefits include:</b>\n  <br>\n </div>\n <div></div>\n <ul>\n  <li>Competitive salary</li>\n  <li>Stock options</li>\n  <li>Medical/dental/vision for you and your family</li>\n  <li>Education reimbursement up to $1,500/yr</li>\n  <li>Wellness stipend of $50/mo</li>\n  <li>401K</li>\n  <li>Free TeamSnap service for your family and friends</li>\n  <li>Free TeamSnap swag.</li>\n  <li>Flexible PTO and vacation policy</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Diversity and Inclusion</b></span>\n  <br>\n </div>\n <div></div>\n <div>\n  TeamSnap is a company built around trust, kindness and collaboration, where diverse backgrounds, experiences and viewpoints are celebrated and valued. This is a place where everybody belongs.\n  <br>\n </div>\n <div></div>\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "RCAjBZYwQ1W4oaOUvRONwg",
    "url": "http://workinstartups.com/job-board/job/82131/hr-and-operations-manager-based-in-the-philippines-remote-at-hopla-online/",
    "title": "HR and Operations Manager based in the Philippines (remote)",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Hopla Online",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 8, 2019 12:37:03 PM",
    "validThrough": "Jul 15, 2019 12:37:03 PM",
    "crawled": "Jul 10, 2019 11:01:10 PM",
    "content": "We are looking for an Operations Manager with strong HR skills to lead our HR team, staff and clients. You will take ownership of all HR matters and related operational processes across the company i.e. from recruitment to performance reviews, contracting &amp; onboarding, wage reviews, disciplinary action, and learning &amp; development. To perform well in this role you should have experience as an HR Manager, or other senior roles in the HR &amp; Ops team, and knowledge around all legal requirements in this role.\n<br>\n<br>Responsibilities:\n<br>- Consistently recruiting for excellent staff, anticipate future hiring needs and maintain a consistent pipeline of profiles in demand.\n<br>- Attracting suitable candidates through job boards, remote professionals platforms, social media, etc.\n<br>- Conducting interviews and sorting through applicants to fill open positions.\n<br>- Assessing applicants' knowledge, skills, and experience to best suit open positions.\n<br>- Research, create and update skills test task for every position for a smoother recruitment process. \n<br>- Promoting the company's reputation and attractiveness as a great company to work for.\n<br>- Maintaining a smooth onboarding process, training, counseling and coaching of our staff.\n<br>- Resolving conflicts through positive and professional mediation.\n<br>- Carrying out necessary administrative duties, conducting performance and wage reviews including the creation of the necessary documentation\n<br>- Developing clear policies and ensuring policy awareness.\n<br>- Creating clear and concise staff, process and client reports.\n<br>- Giving helpful and engaging presentations and explanations of internal processes and best practices.\n<br>- Handling disciplinary investigations and contract termination procedures.\n<br>- Design user-friendly processes, workflows, guidelines, and documentation\n<br>- Team payroll and weekly/monthly hours check\n<br>- Supervision of the HR budget and advising the management team on possible optimization\n<br>- Work alongside the IT department to perform regular assessments and improvements to the HRIS.\n<br>- Leading a team of human resource associates, managers and recruiters.\n<br>- Participation in the meetings &amp; discussions with the Clients to identify the best talents fitting the requirements\n<br>- Clients onboarding and support throughout the first month of working with HOPLA\n<br>- Regular feedback sessions with Clients &amp; their staff to provision and facilitate possible challenges in their remote journey.\n<br>- Clients invoicing and other operational support of the positive client experience.\n<br>- Thorough understanding of company services, identifying client needs and recommending/upselling adequate solutions.\n<br>\n<br>Requirements:\n<br>- Bachelor’s degree in Human Resources Management or equivalent.\n<br>- Experience in Human Resources or related fields.\n<br>- Ability to build and maintain positive relationships with colleagues.\n<br>- Experience in training and coaching staff.\n<br>- Experience in conflict resolution, disciplinary processes and workplace investigations.\n<br>- Experience in following and maintaining privacy policy and procedures in handling confidential documents, and understanding data protection.\n<br>- Understanding of the general labor law rules &amp; processes\n<br>- Experience in creating HR documentation, i.e. contracts, additional agreements, policies, etc\n<br>- Ability to give presentations, webinars and live video calls with clients and staff.\n<br>- Experienced &amp; competent with modern web-based systems, such as Wordpress, Google Suite, ATS systems, Slack, Trello, Hubstaff, etc.\n<br>- Great communication skills. We’re a distributed team, so frequent, proactive and clear communication is a must.\n<br>- Self-driven work ethics. You need to be a starter who loves taking initiative and seeing things through to completion. Hardworking and highly transparent in your work.\n<br>- Ability to analyze situations from different angles and come up with effective solutions\n<br>- Exceptional verbal and written communication skills in English\n<br>\n<br>About our Company\n<br>We are pioneers in remote hiring. All our staff works from home, and we continuously develop and invest in optimizing the online hiring process with proprietary in-house tools and automation. If you like to be ahead of the curve, be part of a young, dynamic and fast-growing company, then we are looking for you.\n<br>\n<br>Among the perks of working remotely, you will enjoy working with a global team, directly work with owners and executives, deal with various global clients, interact with a variety of different cultures, and you get plenty of space to show your worth &amp; ideas and help the organization grow. So, if you are up for an entrepreneur challenge &amp; and new journey then this might just be that next role for you.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "L9gEzHqpR0-bM52A_dtxFw",
    "url": "http://workinstartups.com/job-board/job/82131/hr-amp-operations-manager-remote-at-hopla-online/",
    "title": "HR &amp; Operations Manager (remote)",
    "tags": [
      "DBG:surround``OR(oper,collabor) 2W remot",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Hopla Online",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 8, 2019 12:37:03 PM",
    "validThrough": "Jul 15, 2019 12:37:03 PM",
    "crawled": "Jul 8, 2019 4:06:33 PM",
    "content": "We are looking for an Operations Manager with strong HR skills to lead our HR team, staff and clients. You will take ownership of all HR matters and related operational processes across the company i.e. from recruitment to performance reviews, contracting &amp; onboarding, wage reviews, disciplinary action, and learning &amp; development. To perform well in this role you should have experience as an HR Manager, or other senior roles in the HR &amp; Ops team, and knowledge around all legal requirements in this role.\n<br>\n<br>Responsibilities:\n<br>- Consistently recruiting for excellent staff, anticipate future hiring needs and maintain a consistent pipeline of profiles in demand.\n<br>- Attracting suitable candidates through job boards, remote professionals platforms, social media, etc.\n<br>- Conducting interviews and sorting through applicants to fill open positions.\n<br>- Assessing applicants' knowledge, skills, and experience to best suit open positions.\n<br>- Research, create and update skills test task for every position for a smoother recruitment process. \n<br>- Promoting the company's reputation and attractiveness as a great company to work for.\n<br>- Maintaining a smooth onboarding process, training, counseling and coaching of our staff.\n<br>- Resolving conflicts through positive and professional mediation.\n<br>- Carrying out necessary administrative duties, conducting performance and wage reviews including the creation of the necessary documentation\n<br>- Developing clear policies and ensuring policy awareness.\n<br>- Creating clear and concise staff, process and client reports.\n<br>- Giving helpful and engaging presentations and explanations of internal processes and best practices.\n<br>- Handling disciplinary investigations and contract termination procedures.\n<br>- Design user-friendly processes, workflows, guidelines, and documentation\n<br>- Team payroll and weekly/monthly hours check\n<br>- Supervision of the HR budget and advising the management team on possible optimization\n<br>- Work alongside the IT department to perform regular assessments and improvements to the HRIS.\n<br>- Leading a team of human resource associates, managers and recruiters.\n<br>- Participation in the meetings &amp; discussions with the Clients to identify the best talents fitting the requirements\n<br>- Clients onboarding and support throughout the first month of working with HOPLA\n<br>- Regular feedback sessions with Clients &amp; their staff to provision and facilitate possible challenges in their remote journey.\n<br>- Clients invoicing and other operational support of the positive client experience.\n<br>- Thorough understanding of company services, identifying client needs and recommending/upselling adequate solutions.\n<br>\n<br>Requirements:\n<br>- Bachelor’s degree in Human Resources Management or equivalent.\n<br>- Experience in Human Resources or related fields.\n<br>- Ability to build and maintain positive relationships with colleagues.\n<br>- Experience in training and coaching staff.\n<br>- Experience in conflict resolution, disciplinary processes and workplace investigations.\n<br>- Experience in following and maintaining privacy policy and procedures in handling confidential documents, and understanding data protection.\n<br>- Understanding of the general labor law rules &amp; processes\n<br>- Experience in creating HR documentation, i.e. contracts, additional agreements, policies, etc\n<br>- Ability to give presentations, webinars and live video calls with clients and staff.\n<br>- Experienced &amp; competent with modern web-based systems, such as Wordpress, Google Suite, ATS systems, Slack, Trello, Hubstaff, etc.\n<br>- Great communication skills. We’re a distributed team, so frequent, proactive and clear communication is a must.\n<br>- Self-driven work ethics. You need to be a starter who loves taking initiative and seeing things through to completion. Hardworking and highly transparent in your work.\n<br>- Ability to analyze situations from different angles and come up with effective solutions\n<br>- Exceptional verbal and written communication skills in English\n<br>\n<br>About our Company\n<br>We are pioneers in remote hiring. All our staff works from home, and we continuously develop and invest in optimizing the online hiring process with proprietary in-house tools and automation. If you like to be ahead of the curve, be part of a young, dynamic and fast-growing company, then we are looking for you.\n<br>\n<br>Among the perks of working remotely, you will enjoy working with a global team, directly work with owners and executives, deal with various global clients, interact with a variety of different cultures, and you get plenty of space to show your worth &amp; ideas and help the organization grow. So, if you are up for an entrepreneur challenge &amp; and new journey then this might just be that next role for you.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Dr3QNuleSPK3BOGf0grf0Q",
    "url": "https://jobmote.com/job/47575/senior-auditor-remote-telecommute-direct-hire-fulltime-perm/",
    "title": "Senior Auditor - Remote / Telecommute- Direct Hire /FullTime/ Perm",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG:surround``fulltim 4N telecommut",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Cynet Systems",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 6, 2019 10:07:13 PM",
    "validThrough": "Jul 9, 2019 10:07:13 PM",
    "crawled": "Jul 7, 2019 3:06:27 AM",
    "content": "<div>\n <strong>Job Title: Senior Auditor - Remote / Telecommute - Direct Hire / Full Time / Perm</strong> \n <strong>Job Location: Chantilly, VA</strong> \n <strong>Job Type: Full Time / Perm / Direct Hire + Benefits</strong> \n <strong> W2 candidates are encouraged to apply. We are unable to sponsor H1b or work with third party candidates at this time </strong> \n <strong>Job Description:</strong> Responsibilities: \n <ul>\n  <li>Performs major components of assurance, advisory, and project engagements of diverse, moderately complex business processes and system implementations.</li> \n  <li>Assesses control design of moderately complex business processes and operations.</li> \n  <li>Executes internal control testing of moderately complex operations, including identifying control issues and collecting and analyzing audit evidence.</li> \n  <li>Understands in the broader context and implications of events affecting diverse, high-risk business processes and system implementations and identifies changes to those risk environments.</li> \n  <li>Effectively communicates and manages relationships among audit and operational staff.</li> \n  <li>Develops specialized knowledge and skills to offer insight on risk management and control issues.</li> \n  <li>Executes work assignments.</li> \n  <li>Demonstrates flexibility and agility during engagements, adapting to changes with a moderate level of supervision.</li>\n </ul> Knowledge And Skills: \n <ul>\n  <li>Possesses some experience in the following knowledge areas and skills and proactively seeks assistance through peers, coaching, and other resources and reference material to perform roles and responsibilities:</li>\n </ul> Business Acumen: \n <ul>\n  <li>Demonstrates awareness of industry, strategic, organizational, and regulatory compliance risks and applies them to engagements and organizational projects. </li>\n </ul> Risk Identification and Assessment: \n <ul>\n  <li>Applies risk concepts to identify risk events to business objectives, identifies business improvements and opportunities, and effectively analyzes cause-and-effect of relationships.</li>\n </ul> Project Management: \n <ul>\n  <li>Manages the completion of engagements within agreed upon timeframes while maintaining expected quality standards across each stage of the engagement lifecycle.</li>\n </ul> Communication: \n <ul>\n  <li>Expresses clearly ideas, thoughts, and concepts in oral and written communications by structuring information in an organized manner to meet the needs of the intended audience. </li>\n </ul> Relationship Management: \n <ul>\n  <li>Projects credibility by providing clear direction, motivation, empowerment, and/or opportunity to others and develops solutions to resolve conflicts, to gain the clear agreement of own ideas and those of others, and to sustain working relationships.</li>\n </ul> Audit and Control Knowledge: \n <ul>\n  <li>Applies COSO/COBIT frameworks, department methodologies, governance frameworks, data management techniques, general IT controls, and fraud prevention and detection controls to engagements.</li>\n </ul> IT Knowledge (for positions requiring specialized IT skills): \n <ul>\n  <li>Applies information systems, security, service delivery, operating systems, change controls, and business continuity and disaster recovery knowledge to engagements.</li>\n </ul> Education/Experience: \n <ul>\n  <li>Five or more years of experience in auditing, accounting, information systems and/or other related fields.</li> \n  <li>Bachelor s degree from an accredited university.</li> \n  <li>Certified or progress towards a professional certification or license, such as CIA, CPA, or CISA.</li> \n  <li>General proficiency in Microsoft Office products and audit management and data analysis software.</li>\n </ul> - provided by Dice\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "GppLVLiPQAGUcagM_HN_Kg",
    "url": "https://landing.jobs/at/landing-jobs/talent-advocate-freelancer?utm_campaign=landing+rss&utm_content=Talent+Advocate+%28Freelancer%29&utm_medium=referral&utm_source=rss",
    "title": "Talent Advocate (Freelancer)",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 4, 2019 4:56:52 PM",
    "validThrough": "Jul 11, 2019 4:56:52 PM",
    "crawled": "Jul 4, 2019 5:07:23 PM",
    "content": "<div>\n <h3>Talent Advocate (Freelancer)</h3>\n</div>\n<div>\n Company: Landing.jobs\n</div>\n<div>\n Location: Lisbon, PT\n</div>\n<div>\n Remote location: Fully remote\n</div>Level: Intermediate\n<br>Language: English \n<div>\n Product/Project Management\n <br>Skills:\n</div>\n<li>English </li>\n<li>Recruitment </li>\n<li>Sourcing </li>\n<li>Tech Recruitment </li>\n<h3>Intro</h3>\n<p><a href='https://landing.jobs/' rel='nofollow'>Landing.jobs</a> is a tech recruitment marketplace dedicated to matchmaking top tech talent with top tech employers.<br><br></p>\n<p>We are based in <strong>Lisbon</strong> but we have our team spread across <strong>Germany, Spain</strong> and <strong>UK</strong> and we are planning to soon take over a new market and increase our pool of 90K+ users and 200+ active companies!<br><br></p>\n<p><strong>“To provide the best human experience when looking for a tech job in Europe&quot;<br></strong><br></p>\n<p>This is the mission of our <strong>Talent Development Team</strong> and we are looking for someone who's looking to make an impact in the lives of real people to join this team.<br><br></p>\n<p>As one of our users said: &quot;Landing.jobs is trying to put Human in Human Resources again.&quot;<br><br></p>\n<p>Being part of this team means you are going to help people land jobs and to make better career decisions. You will also support our Business Development to guarantee that we achieve our monthly goals.<br><br></p>\n<p><strong>Your Role<br></strong><br></p>\n<p>As Talent Advocate you will be dedicated to help our users achieve the goal of getting a job. You will become an expert in tech recruitment market to guide our community.</p>\n<p><br></p>\n<p><strong>What you will be doing</strong><br></p>\n<ul>\n <li>Research for candidates who qualify for the existing job openings<br></li>\n <li>Funnel Analysis to create awareness to numbers and ratios and find solutions to improve</li>\n <li>Understand what are our talents’ interests and career goals</li>\n <li>Share useful information about companies and job openings<br></li>\n <li>Share market insights (countries, visa, relocation, etc.) and the salary conditions our Talent deserves</li>\n <li>Help improving things like CV and Landing.jobs’ profile</li>\n <li>Give support during the hiring process, including help with decision-making regarding salary negotiations and relocation processes<br></li>\n</ul>\n<p><strong>This is a freelance position which means that you can work from wherever you want and when you want. But with freedom comes responsibility! This means your work will be measured by the results you present.</strong></p>\n<h4>Main requirements</h4>\n<ul>\n <li>1-2 years of experience working within recruiting, preferably in tech&nbsp;recruitment</li>\n <li>Experience in sourcing</li>\n <li>Accountability and ownership of your own&nbsp;responsibilities</li>\n <li>You must be a people’s person and someone really communicative</li>\n <li>Data-driven mindset and solution oriented</li>\n <li>Positive and proactive attitude, always aiming for more</li>\n <li>Fluent in English so you can talk with our users that come from all over the world</li>\n</ul>\n<h4>Perks</h4>\n<ul>\n <li>You can work from wherever you want</li>\n <li>You can work when you want</li>\n <li>Training and resources available so you continuously improve yourself</li>\n <li>A commission model that is designed to ignite you<br></li>\n</ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "vd7RLCkOR3CS5fz6RJzPCw",
    "url": "http://workinstartups.com/job-board/job/82067/talent-entrepreneur-at-create-adapt/",
    "title": "Talent Entrepreneur",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG:surround``remot 3W right",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Create + Adapt",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 4, 2019 3:24:27 PM",
    "validThrough": "Jul 11, 2019 3:24:27 PM",
    "crawled": "Jul 4, 2019 5:06:33 PM",
    "content": "*A bit about us...*\n<br>\n<br>Create + Adapt are your first subscription based talent acquisition and employer brand partner. With a curiosity to break things, we're a tribe of doers determined to reinvent recruitment. Together, we help transformational brands scale sustainably through building a culture-first approach to recruitment.\n<br>\n<br>Our team has experienced the world of sales-driven recruitment and have always begged the question - there’s got to be another way? We wanted to make partners out of clients and friends out of our candidates. We couldn’t find one, so we built it. Now we’re in a world we love and we’re here to stay. We’re not working in recruitment; we’re working on it. Our model provides scaling businesses, like ourselves, with the unique support they need to develop their rapidly growing team. Our ongoing collabs include Trouva, Hello Fresh, Tech Nation, Feast It, Chip, flatfair and many more... \n<br>\n<br>Think of us as the Spotify for hiring; you can start, pause or stop at any time.\n<br>\n<br> \n<br>*About the role...*\n<br>\n<br>This is a unique opportunity for a motivated and driven individual with an interest (read: obsessive passion) in people to help us build and positively impact our portfolio of start-up through great hiring. Supporting a team of recruitment pro’s, you will be responsible for targeting and engaging the right candidates, and for building a growing talent community for each customer.\n<br>\n<br>As our next *Talent Entrepreneur*, you’ll be trained on the latest sourcing techniques to find top talent, manage candidate communication and develop yourself to be a true ambassador for Create + Adapt and our partners. You’ll be building relationships with plenty of inspiring people and attending lots of events to keep that network growing.\n<br>\n<br>\n<br>*About you...*\n<br>\n<br>* You’re an entrepreneur in the making. You’re ready to run, and build something great for yourself. You’ll love all things people; you’ll know what it takes to get things done in a busy environment.\n<br>* You’re a lover of technology. We’re talking the latest apps and services that make your life easier.\n<br>* Resilience and a strong worth ethic are non-negotiable.\n<br>* Super smart - we want you to teach us things we don’t know.\n<br>* Curious, you want to continually learn and develop.\n<br>* A grafter, you’re a hard worker who wants to progress and develop.\n<br>* A sense of humour is essential, we don’t compromise on this.\n<br>\n<br>\n<br>*What's in it for you...* \n<br>\n<br>* The opportunity to shape your role and grow as fast as we do\n<br>* From day one all team members have a wide remit and are responsible for different aspects of the business\n<br>* 30 days holiday from day one.\n<br>* Plenty of team outings!\n<br>* Our customers, you get to work onsite with them, in our London office or remote. We work remotely, yes that's right no trudging into the office on a stormy Monday morning (unless you want to)!\n<br>* Our team; we may be compact but what we lack in numbers we makeup for in personality!\n<br>* Your opinion matters. Every member of the team is listened to, and all ideas are welcome! We are all equal here.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "uI2OYcFkTKy6x4dOWoMIXA",
    "url": "https://unicornhunt.io/jobs/hr-officer-at-wave",
    "title": "HR Officer",
    "tags": [
      "DBG:surround``12N(work, OR(home,remot), 5N(OR(offic,headquart,onsit), OR(dai,daili,week,weekli,month,monthli)) )",
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Wave",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "GBP",
      "minValue": 41000,
      "maxValue": 48000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "GBP 41k - 48k /Year"
    },
    "employmentType": "UNSET",
    "published": "Jul 4, 2019 12:24:18 PM",
    "validThrough": "Jul 11, 2019 12:24:18 PM",
    "crawled": "Jul 4, 2019 1:07:17 PM",
    "content": "Our mission \n<p><u>The problem:</u> In 2017, nearly 60% of adults in sub-Saharan Africa had no bank account. That's for good reason—the fees are too high, the closest branch can be miles away, and nobody takes cards. Without access to financial institutions, people are forced to keep their savings under the mattress. Small business owners rely on lenders who charge extortionate rates. Parents spend hours waiting in line to pay school fees in cash.</p>\n<p><u>How we're solving it:</u> We're building financial services to work <i>as they</i> <i>should</i>: no account fees, instantly available and accepted everywhere. In places where electricity, water and roads don't always function, we're creating financial infrastructure that &quot;just works.&quot; In fall 2017, we launched a mobile app in Senegal for cash deposit, withdrawal, and peer-to-peer and business payments; we're now processing over 200k payments every month. Our goal is to make Africa the first cashless continent.<br><br>Our team has doubled in size in the past six months and we are looking to scale team processes to enable even faster growth. That's where you come in...<br></p> How you'll help us achieve it \n<p>In this role, you will be part of Wave's People Operations team and responsible for carrying out HR and administrative tasks needed to support the team. <br><br>Your responsibilities may include:<br></p>\n<ul>\n <li>Paying employees on a monthly basis;</li>\n <li>Coordinating benefits for team members and answering questions about them;</li>\n <li>Booking travel for team members and candidates who are interviewing at Wave;</li>\n <li>Preparing visa applications for team members;</li>\n <li>Planning quarterly retreat logistics and other team activities;</li>\n <li>Setting up payroll in various countries as we expand;</li>\n <li>Ensuring that we comply with local employment law in the countries in which we employ team members;</li>\n <li>Onboarding new hires.<b> </b>You will ensure new team members have the equipment they need and introduce them to our tools and policies;</li>\n <li>Working with our Finance team to process reimbursements and pay invoices; and</li>\n <li>Responding to software related queries from team members.</li>\n</ul> Key details \n<ul>\n <li>Location: We are a remote company and you can be based anywhere between UTC -5 and +4 in Belgium, Canada, France, Germany, Ghana, Nigeria, Senegal, the UK or US.</li>\n <li>Compensation: £41,000-£48,000 GBP (or local equivalent) per year depending on experience, plus equity.</li>\n <li>Travel requirement: You will be expected to spend one week in Africa for company retreats every two months. </li>\n <li>This is a permanent position.</li>\n <li>Major benefits:</li>\n <ul>\n  <li>Subsidized health insurance for you and your dependents and retirement contributions (both vary from country-to-country)</li>\n  <li>26 weeks fully paid parental leave and subsidized fertility assistance</li>\n  <li>Unlimited vacation with a 20-day <i>minimum</i> requirement</li>\n  <li>Wave will cover all costs associated with travel to and from Senegal</li>\n  <li>$10,000 annual charitable donation matching</li>\n </ul>\n</ul> Requirements \n<ul>\n <li>Native or fluent English.</li>\n <li>Local work authorization (wherever it is you'd like to be based).</li>\n <li>3+ years of HR experience.</li>\n</ul> Bonus points if \n<ul>\n <li>You speak French. </li>\n</ul> You might be a good fit if you \n<ul>\n <li>Are very organized and detail-oriented - you like to roll up your sleeves and get into the nitty-gritty.</li>\n <li>Tolerance - dare we say enthusiasm! - for repetitive tasks.</li>\n <li>Are driven to face tasks head on, complete them efficiently, and move on to the next ones.</li>\n <li>Are eager to think outside of the box when faced with potential roadblocks.</li>\n <li>Are tech-savvy [familiar with MS Office, Slack, Google Suite] and feel comfortable troubleshooting tech issues.</li>\n <li>Have previously worked for a remote company and enjoy working independently.</li>\n</ul> Our team \n<ul>\n <li>We're a distributed HQ team of ~28 people who are deeply passionate about our mission of bringing great financial services to the people who need them most. Our team works remotely across North America, Europe and Africa. </li>\n <li>Every two months our HQ team goes on a five-day retreat together in Africa. </li>\n <li>We’re backed by world-class investors including Khosla Ventures, Founders Fund, Y Combinator, and the cofounders of PayPal.</li>\n</ul>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "MffIPs2wSPqrz18tL3Diag",
    "url": "http://workinstartups.com/job-board/job/82048/hr-officer-remote-at-wave/",
    "title": "HR Officer - Remote",
    "tags": [
      "DBG:surround``12N(work, OR(home,remot), 5N(OR(offic,headquart,onsit), OR(dai,daili,week,weekli,month,monthli)) )",
      "DBG:surround``3N( 2N(work,remot), OR(us,across,globe,world,planet,100,set 3W hour) )",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Wave",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "GBP",
      "minValue": 41000,
      "maxValue": 48000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "GBP 41k - 48k /Year"
    },
    "employmentType": "UNSET",
    "published": "Jul 4, 2019 11:13:44 AM",
    "validThrough": "Jul 11, 2019 11:13:44 AM",
    "crawled": "Jul 4, 2019 1:06:33 PM",
    "content": "Our mission\n<br>\n<br>The problem: In 2017, nearly 60% of adults in sub-Saharan Africa had no bank account. That's for good reason—the fees are too high, the closest branch can be miles away, and nobody takes cards. Without access to financial institutions, people are forced to keep their savings under the mattress. Small business owners rely on lenders who charge extortionate rates. Parents spend hours waiting in line to pay school fees in cash.\n<br>\n<br>How we're solving it: We're building financial services to work as they should: no account fees, instantly available and accepted everywhere. In places where electricity, water and roads don't always function, we're creating financial infrastructure that &quot;just works.&quot; In fall 2017, we launched a mobile app in Senegal for cash deposit, withdrawal, and peer-to-peer and business payments; we're now processing over 200k payments every month. Our goal is to make Africa the first cashless continent.\n<br>\n<br>Our team has doubled in size in the past six months and we are looking to scale team processes to enable even faster growth. That's where you come in...\n<br>\n<br>How you'll help us achieve it\n<br>\n<br>In this role, you will be part of Wave's People Operations team and responsible for carrying out HR and administrative tasks needed to support the team. \n<br>\n<br>Your responsibilities may include:\n<br>\n<br>* Paying employees on a monthly basis;\n<br>* Coordinating benefits for team members and answering questions about them;\n<br>* Booking travel for team members and candidates who are interviewing at Wave;\n<br>* Preparing visa applications for team members;\n<br>* Planning quarterly retreat logistics and other team activities;\n<br>* Setting up payroll in various countries as we expand;\n<br>* Ensuring that we comply with local employment law in the countries in which we employ team members;\n<br>* Onboarding new hires.* *You will ensure new team members have the equipment they need and introduce them to our tools and policies;\n<br>* Working with our Finance team to process reimbursements and pay invoices; and\n<br>* Responding to software related queries from team members.\n<br>\n<br>Key details\n<br>\n<br>* Location: We are a remote company and you can be based anywhere between UTC -5 and +4 in Belgium, Canada, France, Germany, Ghana, Nigeria, Senegal, the UK or US.\n<br>* Compensation: £41,000-£48,000 GBP (or local equivalent) per year depending on experience, plus equity.\n<br>* Travel requirement: You will be expected to spend one week in Africa for company retreats every two months. \n<br>* This is a permanent position.\n<br>* Major benefits:\n<br> * Subsidized health insurance for you and your dependents and retirement contributions (both vary from country-to-country)\n<br> * 26 weeks fully paid parental leave and subsidized fertility assistance\n<br> * Unlimited vacation with a 20-day minimum requirement\n<br> * Wave will cover all costs associated with travel to and from Senegal\n<br> * $10,000 annual charitable donation matching\n<br>\n<br>Requirements\n<br>\n<br>* Native or fluent English.\n<br>* Local work authorization (wherever it is you'd like to be based).\n<br>* 3+ years of HR experience.\n<br>\n<br>Bonus points if\n<br>\n<br>* You speak French. \n<br>\n<br>You might be a good fit if you\n<br>\n<br>* Are very organized and detail-oriented - you like to roll up your sleeves and get into the nitty-gritty.\n<br>* Tolerance - dare we say enthusiasm! - for repetitive tasks.\n<br>* Are driven to face tasks head on, complete them efficiently, and move on to the next ones.\n<br>* Are eager to think outside of the box when faced with potential roadblocks.\n<br>* Are tech-savvy [familiar with MS Office, Slack, Google Suite] and feel comfortable troubleshooting tech issues.\n<br>* Have previously worked for a remote company and enjoy working independently.\n<br>\n<br>Our team\n<br>\n<br>* We're a distributed HQ team of ~28 people who are deeply passionate about our mission of bringing great financial services to the people who need them most. Our team works remotely across North America, Europe and Africa. \n<br>* Every two months our HQ team goes on a five-day retreat together in Africa. \n<br>* We’re backed by world-class investors including Khosla Ventures, Founders Fund, Y Combinator, and the cofounders of PayPal.\n<br>\n<br>How to apply\n<br>\n<br>If interested, please submit a resume as well as a cover letter describing your interest in Wave and the role. Applications will be reviewed on a rolling basis. \n<br> \n<br>Wave is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. Confidence can sometimes hold us back from applying for a job. But we'll let you in on a secret: there's no such thing as a 'perfect' candidate. Wave is a place where everyone can thrive. So however you identify and whatever background you bring with you, please apply if this is a role that would make you excited to wake up everyday.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Q9YCZHHNQNG4qQrGZqEgxA",
    "url": "https://weworkremotely.com/remote-jobs/wave-hr-officer",
    "title": "Wave: HR Officer",
    "tags": [
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Qkids EnglishContractNorth America OnlyTruckersReport.comFull-TimeUSA",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 45000,
      "maxValue": 65000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 45k - 65k /Year"
    },
    "employmentType": "UNSET",
    "published": "Jul 4, 2019 12:30:17 PM",
    "validThrough": "Jul 11, 2019 12:30:17 PM",
    "crawled": "Jul 4, 2019 1:06:24 PM",
    "content": "<h3> HR Officer </h3>\n<div>\n <div>\n  Our team has doubled in size in the past six months and we are looking to scale team processes to enable even faster growth. In this role, you will be part of Wave's People Operations team and responsible for carrying out HR and administrative tasks needed to support the team. \n  <br>\n </div>\n <div>\n  <br>\n </div>\n <div>\n   Your responsibilities may include:\n  <br>\n </div>\n <div></div>\n <ul>\n  <li>Paying employees on a monthly basis;</li>\n  <li>Coordinating benefits for team members and answering questions about them;</li>\n  <li>Booking travel for team members and candidates who are interviewing at Wave;</li>\n  <li>Preparing visa applications for team members;</li>\n  <li>Planning quarterly retreat logistics and other team activities;</li>\n  <li>Setting up payroll in various countries as we expand;</li>\n  <li>Ensuring that we comply with local employment law in the countries in which we employ team members;</li>\n  <li>Onboarding new hires.<b></b>You will ensure new team members have the equipment they need and introduce them to our tools and policies;</li>\n  <li>Working with our Finance team to process reimbursements and pay invoices; and</li>\n  <li>Responding to software related queries from team members.</li>\n </ul>\n <div>\n  <h4><br></h4>\n </div>\n <div>\n  <h4>Key details</h4>\n </div>\n <ul>\n  <li>Location: We are a remote company and you can be based anywhere between UTC -5 and +4 in Belgium, Canada, France, Germany, Ghana, Nigeria, Senegal, the UK or US.</li>\n  <li>Compensation: $45,000-$65,000 USD (or local equivalent) per year depending on experience, plus equity.</li>\n  <li>Travel requirement: You will be expected to spend one week in Africa for company retreats every two months. </li>\n  <li>This is a permanent position.</li>\n  <li>Major benefits:</li>\n  <li>Subsidized health insurance for you and your dependents and retirement contributions (both vary from country-to-country)</li>\n  <li>26 weeks fully paid parental leave and subsidized fertility assistance</li>\n  <li>Unlimited vacation with a 20-day <i>minimum</i> requirement</li>\n  <li>Wave will cover all costs associated with travel to and from Senegal</li>\n  <li>$10,000 annual charitable donation matching</li>\n </ul>\n <div>\n  <h4><br></h4>\n </div>\n <div>\n  <h4>Requirements</h4>\n </div>\n <ul>\n  <li>Native or fluent English.</li>\n  <li>Local work authorization (wherever it is you'd like to be based).</li>\n  <li>3+ years of HR experience.</li>\n </ul>\n <div>\n  <h4><br></h4>\n </div>\n <div>\n  <h4>Bonus points if</h4>\n </div>\n <ul>\n  <li>You speak French. </li>\n </ul>\n <div>\n  <h4><br></h4>\n </div>\n <div>\n  <h4>You might be a good fit if you</h4>\n </div>\n <ul>\n  <li>Are very organized and detail-oriented - you like to roll up your sleeves and get into the nitty-gritty.</li>\n  <li>Tolerance - dare we say enthusiasm! - for repetitive tasks.</li>\n  <li>Are driven to face tasks head on, complete them efficiently, and move on to the next ones.</li>\n  <li>Are eager to think outside of the box when faced with potential roadblocks.</li>\n  <li>Are tech-savvy [familiar with MS Office, Slack, Google Suite] and feel comfortable troubleshooting tech issues.</li>\n  <li>Have previously worked for a remote company and enjoy working independently.</li>\n </ul>\n</div>\n<div>\n <h4> Related Jobs <span><a rel='nofollow'> See more All Other jobs<span>→</span></a></span></h4>\n <ul>\n  <li><span>New</span>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>Qkids English</span><br><span>Part Time English Teacher, work from home</span><span>featured</span><br><span>Contract</span><span>/</span><span>North America Only</span></a></li>\n  <li>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>TruckersReport.com</span><br><span>Employment Adviser - Truck Driver Recruiting</span><span>featured</span><br><span>Full-Time</span><span>/</span><span>USA</span></a></li>\n </ul>\n <br>\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "tVpm5Ak0SH-u0YkVCqqJKw",
    "url": "https://news.ycombinator.com/item?id=20353026",
    "title": "Wave (YC 12) | HR Officer | Remote | Full-time | Apply here: https://grnh.se/55935b0f2 The ...",
    "tags": [
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "USD",
      "minValue": 45000,
      "maxValue": 65000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false,
      "formatted": "USD 45k - 65k /Year"
    },
    "employmentType": "UNSET",
    "published": "Jul 4, 2019 11:38:18 AM",
    "validThrough": "Jul 11, 2019 11:38:18 AM",
    "crawled": "Jul 4, 2019 12:07:17 PM",
    "content": "Wave (YC 12) | HR Officer | Remote | Full-time | Apply here: \n<a href='https://grnh.se/55935b0f2' rel='nofollow'>https://grnh.se/55935b0f2</a>\n<p>The problem: In 2017, nearly 60% of adults in sub-Saharan Africa had no bank account. That's for good reason—the fees are too high, the closest branch can be miles away, and nobody takes cards.</p>\n<p>How we're solving it: We're building financial services to work as they should: no account fees, instantly available and accepted everywhere. In fall 2017, we launched a mobile app in Senegal for cash deposit, withdrawal, and peer-to-peer and business payments; we're now processing over 200k payments every month.</p>\n<p>In this role, you will be part of Wave's People Operations team and responsible for carrying out HR and administrative tasks needed to support the team.</p>\n<p>Key details:* Location: We are a remote company and you can be based anywhere between UTC -5 and +4 in Belgium, Canada, France, Germany, Ghana, Nigeria, Senegal, the UK or US.* Compensation: $45,000-$65,000 USD (or local equivalent) per year depending on experience, plus equity.* Travel requirement: You will be expected to spend one week in Africa for company retreats every two months.</p>\n<p>Requirements: 3+ years of HR experience; native or fluent English; and local work authorization (wherever it is you'd like to be based).</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "lHGC1D8mTOiFEPIjlllzqQ",
    "url": "http://workinstartups.com/job-board/job/82039/talent-partner-at-fundapps/",
    "title": "Talent Partner",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=6}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "FundApps",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 3, 2019 6:03:08 PM",
    "validThrough": "Jul 10, 2019 6:03:08 PM",
    "crawled": "Jul 3, 2019 8:30:31 PM",
    "content": "FundApps is a startup that helps investment managers stay in compliance with global regulations. Our competition is stuck in the dark ages with slow, clunky, complicated user interfaces and installed software. We're shaking up the industry - providing a beautiful &amp; intuitive web-based service which takes away our clients' pains and lets them get on with what they do best.\n<br>\n<br>We've won multiple accolades from organisations such as Wired, World Economic Forum, Deloitte amongst others.\n<br>\n<br>*About Us*\n<br>We're a small team (currently 60 people) of smart, friendly people with amazing diversity - 26 nationalities at last count. Our HQ is in London, we have growing offices in New York and Singapore, and remote team members in Copenhagen, Amsterdam and Darlington. We collaborate very closely and take pride in delivering an amazing service to our clients, who are some of the world's largest asset managers, hedge funds and pension funds.\n<br>\n<br>We've successfully bootstrapped our way to profitability, so have an incredible amount of freedom when it comes to creating our own destiny.\n<br>\n<br>Despite the heavyweight clients, we pride ourselves on not taking ourselves too seriously, on doing good by our people, our communities and the environment (we became a B-Corp in 2018) and having bucket-loads of fun along the way!\n<br>\n<br>*The Team*\n<br>People Operations (nicknamed POPS internally) was introduced in late 2017 to help smooth the next phase in growth of FundApps as we scale. We’re a two person team currently and take culture super seriously like any growing company worth its salt.\n<br>\n<br>*Rohan* is currently our Talent Partner in London and will soon be focusing on our Learning &amp; Development initiatives including our leadership development, career conversations, early careers, onboarding and general learning content. When Rohan is not at FundApps you’ll find him at a rugby game or training for his next trail marathon.\n<br>\n<br>*Pat* is our Head of People based in New York, and covers a generalist remit including supporting our leadership team, growth planning, reward &amp; payroll and employee relations. Outside of FundApps, you’ll likely find Pat exploring the city, drinking coffee, or planning a return to the tennis court.\n<br>\n<br>Then there’s *YOU!* As our third member of POPS, you’ll be responsible for all recruitment activities across FundApps, including sourcing, branding, recruitment and employer/agency partnerships. We’ve invested heavily in recruitment early in our journey - We have a scalable ATS, an event calendar and university &amp; agency partnerships in place to help source amazing people. Nonetheless, we’re growing quickly and need to continue to raise the bar and deliver a punchy and world-class recruitment and talent process that supports our growth ambitions.\n<br>\n<br>Simply put, your remit will be - *Find the world's most talented people and bring them to FundApps.*\n<br>\n<br>Outside of work, we don’t mind what your interests are, provided you have something you’re passionate about that’s not FundApps! :)\n<br>\n<br>*Responsibilities*\n<br>* Talent Sourcing (50%): Partner with team leaders to understand and anticipate hiring needs, build sourcing strategies and scout talent globally across job platforms.\n<br>* Recruiting (40%): Build a world-class candidate experience and manage the end to end recruitment cycle. Analyse talent metrics to find scalable improvements in how we recruit the top tech and business talent globally. Deliver at pace, but never at the expense of a personable and authentic experience.\n<br>* Employer Branding (10%): Be an ambassador to the FundApps employer brand and active player in industry and recruitment events and meetups and across social media.\n<br>\n<br>\n<br>*REQUIREMENTS*\n<br>* Ideally 2+ years demonstrable experience in an in-house generalist HR, recruitment or talent agency role requiring partnership with hiring managers.\n<br>* Flawless written and verbal communication skills and be comfortable talking with people at all levels\n<br>* An expert relationship-builder - with hiring managers, agencies, industry reps and candidates.\n<br>* Ability to analyse data and metrics of success with an eye for detail\n<br>\n<br>Bonus Points\n<br>* Experience in recruiting technical roles, including developers\n<br>* Experience managing agency relationships and using hiring platforms\n<br>* Master of GIFs, emojis and HR/recruitment puns\n<br>\n<br>*VALUES FIT*\n<br>\n<br>* Raise the Bar - Creative mindset and commitment to continuously raising the bar on how we approach recruitment\n<br>* Do More with Less - Without the deep pockets of a VC we have to make smart decisions and everyone at FundApps has an agile &amp; lean mindset.\n<br>* Have Courage - Not afraid to roll sleeves up, build fluency in our service and have the tough conversations when they arise\n<br>* Be Transparent - We default to transparency within our company, when it comes to our recruitment performance and our high/low points along the way. If this makes you feel uncomfortable, we may not be the right company for you.\n<br>* Work with Purpose - We take on average 2 days to evaluate a new job application, and maintain an average of 25 days from application to offer stage. We wouldn’t have achieved this without laser sharp focus and a comfort prioritising lower value work.\n<br>\n<br>*LIFE AT FUNDAPPS*\n<br>\n<br>* £1,000 learning budget each year and unlimited professional development leave\n<br>* Peer micro-bonuses through Bonusly\n<br>* Flexible working - 90% of our team do it regularly\n<br>* 25 days holiday leave + an extra day next year if you use it all\n<br>* Birthday off\n<br>* Unlimited volunteering leave\n<br>* 26 weeks paid leave for all new parents regardless of gender, location or family structure\n<br>* Unlimited sick and compassionate leave\n<br>* Monthly team outings, including crazy golf, karaoke and escape rooms\n<br>* Peer-led ‘Brown-bag lunch’ learning sessions\n<br>* Matched pension contribution up to 10%\n<br>* Flexible wellbeing allowance\n<br>\n<br>We are proud of the diversity of all FundAppers - it makes us strong. You will find flexibility around religious observances, our national flags all around the office, a monthly ‘Laydeez who lunch’ and a Pride celebration with some epic Cher and RuPaul playlists! If you’re looking for a workplace where you can just be yourself, you’re in the right place.\n<br>\n<br>*Your privacy*\n<br>Any information you submit through our job application process will be used for the purposes of assessing your fit for a role at FundApps. We may also retrieve and store information from your public social media profiles for the same purpose. You can find out more about how your data is used and your rights in our privacy policy.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "m9bx3fyxQoK__hqXh801Zg",
    "url": "https://berlinstartupjobs.com/hr-recruiting/senior-talent-acquisition-manager-amazon-saas-sellics/",
    "title": "Senior Talent Acquisition Manager (Amazon SaaS) // Sellics",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:generics/java/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/java",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "java"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 3, 2019 2:16:54 PM",
    "validThrough": "Jul 10, 2019 2:16:54 PM",
    "crawled": "Jul 3, 2019 3:08:46 PM",
    "content": "<h3>Senior Talent Acquisition Manager (Amazon SaaS) // Sellics</h3>\n<div>\n  Company: Sellics \n <br> \n <br>\n</div>\n<div>\n  Tags:\n</div>\n<li>Recruiting</li>\n<li>HR</li>\n<li>Amazon</li>\n<div> \n <div> \n </div> \n <p>As a profitable, global and rapidly expanding SaaS start-up from Berlin, Sellics is revolutionizing commerce on the world’s biggest online marketplace:&nbsp;Amazon.</p> \n <p>We have developed an&nbsp;All-in-One solution for sellers and vendors, including everything they need to be successful on Amazon. Our integrated toolbox offers features for all aspects of business: Amazon SEO, Profit Analysis, PPC Campaign Management, Product Research, Review and Inventory Management and Competitor Tracking. And with more exciting features to be added in the future, we continue to shape this fast-growing industry with cutting edge software innovation.</p> \n <p>As a&nbsp;bootstrapped company, Sellics values ownership and agility. As such, we are able to listen to customers and incorporate their feedback, and also pay close attention to the well-being of our employees. As a result, staff members not only enjoy working with us, but are actively involved in the development and success of the company.</p> \n <p><strong>Tasks and requirements:</strong></p> \n <ul> \n  <li>You own and optimize the entire recruitment process for business and tech positions</li> \n  <li>You are responsible for the whole application funnel from CV to offer and for our headhunting strategy</li> \n  <li>You work closely with our hiring managers and our hiring teams to build effective sourcing, assessment, and closing solutions</li> \n  <li>You help us strengthen our employer branding image as a software company by representing Sellics at job fairs, tech events and organizing in-house meetups</li> \n  <li>You come up with outside the box recruiting ideas to make sure we get the best people on the market</li> \n  <li>You will work closely with our Head of People to improve the whole recruiting process</li> \n </ul> \n <ul> \n  <li>You have 2+ years experience in setting up processes for recruiting and you are very familiar with headhunting strategies</li> \n  <li>You understand that recruiting is speed but more importantly quality game – we only want A-players</li> \n  <li>You have a good understanding of tech and know how to make Developers interested in our company</li> \n  <li>You are an excellent communicator, with the ability to take initiative and build trust with hiring managers and candidates</li> \n  <li>You speak fluently English, German is a big plus</li> \n  <li>You are interested in e-commerce, especially in Amazon</li> \n </ul> \n <p><strong>Benefits:</strong></p> \n <ul> \n  <li>A very well located office in the heart of Berlin Mitte incl. a rooftop terrace with pool</li> \n </ul> \n <ul> \n  <li>Flexible office hours</li> \n  <li>Remote working budget</li> \n  <li>Flat hierarchies with open communication</li> \n  <li>High level of responsibility and space to develop</li> \n  <li>Free food and drinks, regular team events</li> \n  <li>Urban Sports Club membership</li> \n  <li>Self Improvement Grant</li> \n  <li>Relocation benefits and visa assistance for non-EU citizens</li> \n </ul> \n <ul> \n  <li>Participation in our annual company trip – this year, we’ve been to Miami!</li> \n </ul> \n <p><em>What have you done before? What are you interested in? What motivates you? Please don’t send a generic cover letter. We’d rather hear your short intro in the summary section!</em></p> \n</div>\n<a href='https://workable.com/j/BF72975BE1' rel='nofollow'>Apply for this position</a>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "or_hHO_bTbyRbIq6nJ-v2Q",
    "url": "https://berlinstartupjobs.com/hr-recruiting/hr-people-operations-manager-amazon-saas-sellics/",
    "title": "HR People Operations Manager (Amazon SaaS) // Sellics",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:generics/java/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 3, 2019 1:56:52 PM",
    "validThrough": "Jul 10, 2019 1:56:52 PM",
    "crawled": "Jul 3, 2019 2:07:32 PM",
    "content": "<h3>HR People Operations Manager (Amazon SaaS) // Sellics</h3>\n<div>\n  Company: Sellics \n <br> \n <br>\n</div>\n<div>\n  Tags:\n</div>\n<li>HR</li>\n<li>Amazon</li>\n<div> \n <p>Sellics is a profitable, global and rapidly expanding SaaS start-up from Berlin that is revolutionizing commerce on the world’s biggest online marketplace:&nbsp;<strong>Amazon</strong>.</p> \n <p>We have developed an&nbsp;<strong>All-in-One solution</strong>&nbsp;for sellers and vendors, that provides everything they need to be successful on Amazon. The integrated toolbox offers features for all aspects of business: Amazon SEO, Profit Analysis, PPC Campaign Management, Product Research, Review and Inventory Management and Competitor Tracking. With more exciting features in development, we continue to shape this fast-growing industry with cutting edge software innovation.</p> \n <p>As a<strong>&nbsp;bootstrapped</strong>&nbsp;company, Sellics values ownership and agility. We pride ourselves on the ability to listen to customers and incorporate their feedback as well as build a dynamic company culture where every team member has an impact, striving to create an environment where people not only enjoy coming to work every day, but are actively involved in the development and success of the company.</p> \n <p>Tasks and requirements:</p> \n <ul> \n  <li>You are responsible for all HR admin tasks for our team in Berlin with currently 80+ employees</li> \n  <li>You are leading the HR Operations and might be able to grow a team around this in the near future</li> \n  <li>You prepare and process payroll as well as post-payroll tasks in close collaboration with internal and external stakeholders, e.g. delivering correct payroll data, performing monthly quality checks, posting to finance</li> \n  <li>You prepare and control figures regarding mass salary increases, individual increases, benefit changes, absences, leaves, etc.</li> \n  <li>You are responsible for setting up contracts for new employees and implementing necessary guidelines as we grow</li> \n  <li>You will help new employees with settling in Germany (Visa, registration, flat…)</li> \n  <li>You will help to research and implement tools to improve the efficiency &amp; scalability of our operations</li> \n  <li>You have 2x years experiences in a similar role (HR Operations, HR Admin)</li> \n  <li>You have a good understanding of German employment law and Visa processes</li> \n  <li>You have good analytical skills and a hands-on mentality to ensure accurate and reliable results</li> \n  <li>You are interested in bringing in your own ideas and you want to improve current processes</li> \n  <li>You are fluent in English, German is a very big plus in this position</li> \n </ul> \n <p>Benefits:</p> \n <ul> \n  <li>A very well located office in the heart of Berlin (with rooftop and pool!)</li> \n </ul> \n <ul> \n  <li>Flexible office hours</li> \n  <li>Remote working budget</li> \n  <li>Flat hierarchies with open communication</li> \n  <li>High level of responsibility and space to develop</li> \n  <li>Free food and drinks, regular team events</li> \n  <li>Urban Sports Club membership</li> \n  <li>Self Improvement Grant</li> \n  <li>Relocation benefits and visa assistance for non-EU citizens</li> \n </ul> \n <ul> \n  <li>Participation in our annual company trip – this year, we’ve been to Lisbon!</li> \n </ul> \n <p><em>What have you done before? What are you interested in? What motivates you? Please don’t send a generic cover letter. We’d rather hear your short intro in the summary section.</em></p> \n</div>\n<a href='https://workable.com/j/E26DE47CA6' rel='nofollow'>Apply for this position</a>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "GetkT7SYQjuDjcz1ect1YQ",
    "url": "https://news.ycombinator.com/item?id=20337213",
    "title": "SpotHero | Chicago, IL | https://spothero.com | SpotHero is on a mission to empower people to ...",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=2, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 2, 2019 7:17:51 PM",
    "validThrough": "Jul 9, 2019 7:17:51 PM",
    "crawled": "Jul 2, 2019 11:45:44 PM",
    "content": "SpotHero | Chicago, IL | \n<a href='https://spothero.com' rel='nofollow'>https://spothero.com</a> | SpotHero is on a mission to empower people to get everywhere, easier! With over 20 million cars parked, fast growth, and solid funding (\n<a href='https://angel.co/spothero' rel='nofollow'>https://angel.co/spothero</a>), SpotHero offers countless ways to make an impact on the company and your career.\n<p>* Director of Engineering, Operator - <a href='https://spothero.com/careers/1698992' rel='nofollow'>https://spothero.com/careers/1698992</a> (Chicago)</p>\n<p>* Staff Software Developer in Test - <a href='https://spothero.com/careers/1283388' rel='nofollow'>https://spothero.com/careers/1283388</a> (Chicago)</p>\n<p>* Staff Engineer, Front End - <a href='https://spothero.com/careers/1444463' rel='nofollow'>https://spothero.com/careers/1444463</a> (Chicago or Remote)</p>\n<p>* Senior Engineer, Front End - <a href='https://spothero.com/careers/1120188' rel='nofollow'>https://spothero.com/careers/1120188</a> (Chicago or Remote)</p>\n<p>* Staff Engineer, iOS - <a href='https://spothero.com/careers/1735405' rel='nofollow'>https://spothero.com/careers/1735405</a> (Chicago or Remote)</p>\n<p>* Staff Engineer, Backend - <a href='https://spothero.com/careers/1753476' rel='nofollow'>https://spothero.com/careers/1753476</a> (Chicago or Remote)</p>\n<p>* Senior Engineer, Backend - <a href='https://spothero.com/careers/1135073' rel='nofollow'>https://spothero.com/careers/1135073</a> (Chicago or Remote)</p>\n<p>* Senior Engineer, Operator - <a href='https://spothero.com/careers/1135073' rel='nofollow'>https://spothero.com/careers/1135073</a> (Chicago or Remote)</p>\n<p>* Engineer, Developer Tools - <a href='https://spothero.com/careers/1698957' rel='nofollow'>https://spothero.com/careers/1698957</a> (Chicago or Remote)</p>\n<p>* Agile Leader - <a href='https://spothero.com/careers/1737142' rel='nofollow'>https://spothero.com/careers/1737142</a> (Chicago)</p>\n<p>* Senior Technical Writer - <a href='https://spothero.com/careers/1753476' rel='nofollow'>https://spothero.com/careers/1753476</a> (Chicago)</p>\n<p>* Senior Technical Product Manager, API (Chicago or Remote)</p>\n<p>* Senior Product Manager - <a href='https://spothero.com/careers/1584498' rel='nofollow'>https://spothero.com/careers/1584498</a> (Chicago)</p>\n<p>To apply, please email your resume to jobs@spothero.com. Include any GitHub account, LinkedIn profile, and any project that you’re particularly proud of. We love seeing work that others loved working on.</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "lc9G8x1ER1GlDiAWKbQLJg",
    "url": "https://remote.co/job/recruiting-specialist-the-strategist-3/",
    "title": "Recruiting Specialist: The Strategist",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "AVRA Talent Partners",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jul 2, 2019 12:05:46 AM",
    "validThrough": "Jul 9, 2019 12:05:46 AM",
    "crawled": "Jul 2, 2019 12:09:09 AM",
    "content": "<h3>Recruiting Specialist: The Strategist at <span>AVRA Talent Partners</span></h3>\n<div>\n <span><i></i> Remote</span> \n</div>\n<div> \n <p><strong>Location</strong>: Remote (based in North American time zone)</p>\n <p><strong>Comp</strong>: 30 USD/hr</p>\n <p><strong>Job Title</strong>: Recruiting Specialist: The Strategist</p>\n <p><strong>The Company’s mission</strong>: <a href='http://avratalent.com/' rel='nofollow'>Avra Talent Partners</a> is focused on disrupting the traditional recruitment industry through the decentralizing of expertise. This means instead of one recruiter running the full lifecycle on every open role assigned to them, Avra has dedicated recruiting teams that consist of Coordinators, Interviewers, Headhunters, Domain Experts, all led by a kick-ass Strategist.</p>\n <p><strong>Why this role exists</strong>: Part-project manager, part-account manager, one hundred percent – extreme-ownership-taker, the Strategist is a key part of what makes Avra stand out from traditional recruiting firms. The Strategist leads a team of 3-5 specialists, each who specialize in one of the <a href='https://blog.avratalent.com/the-five-disciplines-of-hiring/' rel='nofollow'>five disciplines of hiring</a>.</p>\n <p><strong>What’s in it for you?</strong> Contribute to the growth of an early stage startup and learn the ins and outs of the recruiting space. Enjoy lots of freedom, flexibility and ownership in a remote work environment. Work closely with and learn from a seasoned entrepreneur in an exciting field, with lots of potential!</p>\n <h5><strong>Required experience:</strong></h5>\n <ul>\n  <li>Minimum 5 years progressive work experience within the startup world</li>\n  <li>Minimum 2 years operational, project or account management background.</li>\n  <li>Some HR experience a plus</li>\n </ul>\n <h5><strong>Outcomes:</strong></h5>\n <ol>\n  <li>You will take extreme ownership of your team’s results, interfacing with the Client and the Leadership team at Avra with the object of finding the best person for each open role.</li>\n  <li>You will work hand in hand with the Interviewer(s) to build out acquisition strategies for open roles and to craft Job Descriptions based on the client needs.</li>\n  <li>You will manage your team’s budget, and ensure that each client team stays within budget.</li>\n  <li>You brainstorm, research and get curious about ways we can attract the right talent for each open role. You update the recruiting strategy as real-world data comes back and work with your team to build the most effective and efficient plan.</li>\n </ol>\n <h5><strong>Core competencies&nbsp;</strong></h5>\n <ul>\n  <li>Client-facing account management (warm conversationalist with the ability to probe without being offensive and read between the lines)</li>\n  <li>Project management</li>\n  <li>Strategic thinking and planning</li>\n  <li>Hyper-vigilant communicator</li>\n  <li>Solid understanding of technology, technology startups and the startup landscape</li>\n  <li>Problem-solver, puzzle-lover: the Strategist lives by the ideal that the right person is out there; it is our job to find them.</li>\n </ul>\n <h5><strong>Hard skills</strong></h5>\n <ul>\n  <li>Proficient in “the Google Stack” (e.g. Google Drive, Sheets, Docs, Forms, etc.)</li>\n  <li>Familiar with recruiting job boards: ZipRecruiter, AngelList, Indeed, Monster, etc.</li>\n  <li>Excellent written and verbal communication skills</li>\n  <li>Creative writing and editing abilities</li>\n  <li>Solid people skills</li>\n </ul>\n <h5><strong>Personal + Professional Attributes</strong></h5>\n <ul>\n  <li>Hyper-reliable</li>\n  <li>Stong, compassionate leader who will support each team member as they grow.</li>\n  <li>Creative and very curious, constantly learning and evolving</li>\n  <li>Analytical: Systems, process and data driven</li>\n </ul>\n <h5><strong>To Note:</strong></h5>\n <ul>\n  <li>This role requires good availability. You’re online or at least available throughout most business days, and can be responsive to your team on North American time zones.</li>\n  <li>This is a contract position, starting with 10-20 hours a week, but dependent on our clients and demand. For the right person, after a few months this role could become full time.</li>\n </ul>\n <p><strong>*We are currently not hiring contractors in CA, or NY*</strong></p>\n <p><strong>How to Apply: **Please apply directly through this link: <a href='https://recruit-66c441c05fde.breezy.hr/p/180450410ffb-recruiting-specialist-the-strategist' rel='nofollow'>https://recruit-66c441c05fde.breezy.hr/p/180450410ffb-recruiting-specialist-the-strategist</a>. Please be advised we do not view any applications unless they go through our portal.**</strong></p>\n <p>Location: <strong>North American Time Zones</strong></p> \n</div>\n<div> \n <a href='https://recruit-66c441c05fde.breezy.hr/p/180450410ffb-recruiting-specialist-the-strategist?state=published' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "_iiAcfdoTROOXnlj7bgUBw",
    "url": "https://weworkremotely.com/remote-jobs/truckersreport-com-employment-adviser-truck-driver-recruiting",
    "title": "TruckersReport.com: Employment Adviser - Truck Driver Recruiting",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "BlingABCContractOnlineCloseFull-TimeNorth America",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 28, 2019 11:57:25 PM",
    "validThrough": "Jul 5, 2019 11:57:25 PM",
    "crawled": "Jun 29, 2019 12:06:23 AM",
    "content": "<h3> Employment Adviser - Truck Driver Recruiting </h3>\n<div>\n <div>\n  TruckersReport.com is the largest online community of professional truck drivers. More than 1 million users visit each month to read reviews, post in our forums, and look for new truck driving job opportunities. While still small, our business has grown significantly over the past several years due to a great user base, a high-demand service, and a talented team of coworkers.&nbsp;\n </div>\n <div>\n  <br>\n </div>\n <div>\n  We are currently growing our newest service for drivers with a team of Job Advisers (JAs). JAs field calls and messages from drivers interested in learning about new job opportunities and then help to connect them directly to companies looking to hire truck drivers. You will be helping great people connect with great jobs!&nbsp;\n </div>\n <div>\n  <br>\n </div>\n <div>\n  TruckersReport is a fully remote company and this is a full time, remote role for experienced telecommuters living in the Americas working East Coast business hours.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span>Responsibilities:</span>\n </div>\n <div>\n  <em>Day-to-day&nbsp;</em>\n </div>\n <div>\n  &nbsp;- Responds to 50-100 inbound messages and calls from drivers looking for assistance\n </div>\n <div>\n  &nbsp;- Completes survey with driver over the telephone ensuring that we have complete profile information on each driver we speak to\n </div>\n <div>\n  &nbsp;- Use our matching engine to identify potential employers for each driver and connect via online application or directly transfer the call.&nbsp;\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span>Requirements:</span>\n </div>\n <ul>\n  <li>Understanding of recruiting</li>\n  <li>Understanding of the employer/candidate relationship</li>\n  <li>Excellent phone skills&nbsp;</li>\n  <li>Excellent writing and communication skills</li>\n  <li>Flexibility with schedule</li>\n  <li>Detail orientation</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <span>Pay and Benefits:</span>\n </div>\n <ul>\n  <li>$45,000 - $65,000 base pay depending on experience, opportunity to earn bonuses based on achieving team milestones</li>\n  <li>Company-paid health insurance after 30 days and HRA, dental, vision</li>\n  <li>Work from your home office</li>\n  <li>Work directly with senior executives at a growing company, a great opportunity for career advancement</li>\n </ul>\n</div>\n<div>\n <h4> Related Jobs <span><a rel='nofollow'> See more All Other jobs<span>→</span></a></span></h4>\n <ul>\n  <li>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>BlingABC</span><br><span>Up to $38/hr for Online English Teacher</span><span>featured</span><br><span>Contract</span><span>/</span><span>Online</span></a></li>\n  <li>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>Close</span><br><span>Customer Success Associate</span><span>featured</span><br><span>Full-Time</span><span>/</span><span>North America</span></a></li>\n </ul>\n <br>\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Rk8vdvPlTkWllamsQp_1XQ",
    "url": "https://remote.co/job/recruiting-and-talent-lead/",
    "title": "Recruiting and Talent Lead",
    "tags": [
      "DBG:surround``can 2W remot",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Tidelift",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 26, 2019 5:01:12 PM",
    "validThrough": "Jul 3, 2019 5:01:12 PM",
    "crawled": "Jun 26, 2019 5:08:10 PM",
    "content": "<h3>Recruiting and Talent Lead at <span>Tidelift</span></h3>\n<div>\n <span><i></i> Remote</span> | \n <span> Entry-level </span>\n</div>\n<div> \n <ul>\n  <li>People Operations</li>\n  <li>Boston, MA <strong>or remote</strong></li>\n </ul>\n <p><strong>What were building</strong><br>At Tidelift, our mission is making open source software work betterfor everyone. We see a world where open source creators can get paid for doing work they love, and software development teams get software they can depend on. Were already supporting many of the most important projects in open source, and adding more all the time.</p>\n <p>We’re still small, but well-funded and growing. You will be able to play a large role in tackling challenging problems and helping build the company, while learning alongside our experienced team.</p>\n <p><strong>How you can help</strong></p>\n <p>We’re looking for a Recruiting and Talent Lead to build the recruiting programs for Tidelift. As our first dedicated People Operations team member, you will help build an effective, diverse, values-driven team.</p>\n <p><strong>You will own our recruiting efforts from beginning to end, including:</strong></p>\n <ul>\n  <li>Work with teams and hiring managers to define roles, and build structured interview materials that help us identify the best candidates (not just the ones who mirror our own biases)</li>\n  <li>Refine and implement our recruiting process, including finding diverse candidates, scheduling interviews, and managing evaluations (screening, internal, and references), and ensuring were using appropriate tooling. (We currently use Google Hire but are open to candidates with other preferences/experience.)</li>\n  <li>Drive the candidate and new employee experience. We consider user experience critical to everything we do, including how we bring people into the company, from the first time they read our job description to the time theyre fully onboarded. Youll help us make that happen in partnership with internal and external resources.</li>\n  <li>Support culture in a time of growth: we plan to more than double in size in 2019. This role will advise and support the leadership team to ensure our culture stays healthy and supportive through that transition.</li>\n </ul>\n <p>Prior experience with people operations at a growing startup is a plus, but were open to a candidate who is excited to recruit and can grow into a broader people operations role.</p>\n <p><strong>This team</strong></p>\n <p>You will be the first hire in our People Ops team. You will collaborate with an experienced leadership team that has seen and managed explosive growth at HubSpot, Red Hat, Wikipedia, and a wide variety of other startups. The role will report to a co-founder, and will also work closely with our head of marketing, who led Red Hats efforts to ensure that the brand and culture were closely intertwined.</p>\n <p><strong>Our values</strong></p>\n <p><strong>Were</strong><strong> trying to build a healthy, values-driven culture. We want to be:</strong></p>\n <ul>\n  <li>Optimistic: We see an amazing future ahead, and want to inspire others to share in it. This is both internalbuilding each other up and looking for the best in peopleand externalwe know open source is awesome, and we want to make it even better.</li>\n  <li>Practical: We know words and ideas alone wont change lives. We help people most by creating a pragmatic, viable, and sustainable business that works for everyone. So we care about usability, design, and honest assessment of costs and benefits.</li>\n  <li>Additive: We want an environment that encourages and inspires growth, both for individuals and for the open source community as a whole. That means embracing a growth mindset, and valuing culture add over culture fit.</li>\n  <li>Inclusive: We believe technology will be stronger when it better reflects the voices and ideas of society as a whole. So we want people from different backgrounds and experiences to not just be represented, but to be heard, valued, and flourish. We do not tolerate discrimination or harassment.</li>\n </ul>\n <p><strong>How we work</strong></p>\n <ul>\n  <li>In this role, <strong>you can work remotely (within the US) or from our office in downtown Boston</strong>. About half of our team, including two of our founders, are remote, and we take employee experience seriously wherever you are based.</li>\n  <li>We believe in the urgency of our mission, and the importance of doing good work, but also know this is a marathon and not a sprint. Hours can be flexible within reason if necessary to meet personal needs (like child, medical, or elder care).</li>\n </ul>\n <p><strong>Compensation, benefits, and career</strong></p>\n <ul>\n  <li>Compensation is competitive with other Boston-area startups, including key benefits like health insurance, flexible vacation, 401(k), parental leave, and equity.</li>\n  <li>We are invested in every employees growth, and support professional development that aligns with your goals and how you learn best.</li>\n </ul>\n <p><strong>How to apply</strong></p>\n <ul>\n  <li>Fill out the form below. We’d love it if you add a thoughtful note about your goals and your background. Well get back to you promptly!</li>\n  <li>Please note that we are <em>not </em>looking to hire contractors or outsourced development teams.</li>\n </ul> \n</div>\n<div> \n <a href='https://hire.withgoogle.com/public/jobs/tideliftcom/view/P_AAAAAACAAKxIGguz3B9P9L' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "86OTYUpUTASkkokh9z3SsQ",
    "url": "https://weworkremotely.com/remote-jobs/taxjar-recruiter",
    "title": "TaxJar: Recruiter",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 3W onli",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "TutukaFull-TimeEurope, Middle East, South East Asia",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 25, 2019 11:26:50 PM",
    "validThrough": "Jul 2, 2019 11:26:50 PM",
    "crawled": "Jun 25, 2019 11:30:23 PM",
    "content": "<h3> Recruiter </h3>\n<div>\n <div>\n  <a href='https://workable.com/nr?l=https%3A%2F%2Fwww.taxjar.com%2F' rel='nofollow'>TaxJar</a>&nbsp;is the leading technology solution for busy eCommerce sellers to manage sales tax and is trusted by more than 15,000 businesses. Our mission is to make ecommerce easier for everyone.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  Our core values:\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li>We do the right thing for our customers.</li>\n  <li>We're a team, built on trust.</li>\n  <li>We're proud to be remote.</li>\n  <li>We're in control of our own destiny.</li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  TaxJar’s remote-only team of 90+ people is growing fast. Our team has an immediate full-time opening for an enthusiastic and experienced Recruiter who wants to make a difference on a growing, experienced team of entrepreneurs.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  *This is a full-time remote position based in the US only.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  As a Recruiter at TaxJar you will:\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li>Collaborate with hiring managers on a regular basis and proactively identify future hiring needs.</li>\n  <li>Attract candidates using various sources, such as social media networks and other creative ways to attract new talent!</li>\n  <li>Ideally hold an academic HR background combined with work experience in screening, interviewing and assessing candidates.</li>\n </ul>\n <div>\n  <span><br></span>\n </div>\n <div>\n  You will join our Employee Experience team. Your role will be to help shape the future of TaxJar by working with our Lead Recruiter to assist within the full-lifecycle recruiting process. You will be responsible for attracting top talent, evaluating resumes, scheduling interviews, and conducting interviews.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  Responsibilities\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li>Develop and update job descriptions and job specifications</li>\n  <li>Perform job and task analysis to document job requirements and objectives</li>\n  <li>Prepare recruitment materials and post jobs to appropriate job boards/newspapers/colleges etc</li>\n  <li>Source and recruit candidates by utilizing databases, social media etc</li>\n  <li>Screen candidates’ resumes and job applications</li>\n  <li>Conduct interviews using various reliable recruiting and selection tools/methods to filter candidates</li>\n  <li>Apply and monitor HR recruiting best practices</li>\n  <li>Provide analytical and well-documented recruiting reports to the rest of the team</li>\n  <li>Act as a point of contact and build influential candidate relationships during the selection process</li>\n </ul>\n <div>\n  <h4>REQUIREMENTS</h4>\n </div>\n <ul>\n  <li>3 + years with proven work experience as a Recruiter (either in-house or an agency)</li>\n  <li>Solid ability to conduct different types of interviews with technical roles including software developers, product managers, QA Engineers, etc.</li>\n  <li>Familiarity with HR databases, Applicant Tracking Systems (ATS) and Candidate Management Systems (CMS). We currently use Workable.</li>\n  <li>Excellent communication and interpersonal skills</li>\n  <li>Strong decision-making skills</li>\n </ul>\n <div>\n  You’ll be a great fit for TaxJar if you\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li>Only want to work remotely</li>\n  <li>Are a PRO at communicating and collaboration</li>\n  <li>Highly value working with people you like and respect</li>\n  <li>Are accountable</li>\n  <li>Are confident in your skills and a solid team player (We’re peers here, no egos please) but also comfortable working asynchronously</li>\n  <li>Hungry to play an impactful role and not afraid to fail</li>\n </ul>\n <div>\n  <a href='https://workable.com/nr?l=https%3A%2F%2Flife.taxjar.com%2F' rel='nofollow'>We’re a happy team</a>&nbsp;and we all really love what we do. We've created a space where high-achievers can succeed, but are also safe to fail. We're profitable and focused on growing TaxJar sustainably. We're always learning how to make TaxJar the best place to work for all of us, and not just another tech startup. We’re always looking for an amazing new teammates to come share in the excitement of solving real-world problems with technology.\n </div>\n <div>\n  <h4>BENEFITS</h4>\n </div>\n <ul>\n  <li>Excellent health, vision and dental benefits</li>\n  <li>Flexible vacation policy</li>\n  <li>$1,000 in professional development credit</li>\n  <li>Home office stipend</li>\n  <li>Equity in a profitable company</li>\n  <li>2x year all-company in person retreats (fully paid for by us of course)</li>\n  <li>Mandatory Birthday holiday!</li>\n  <li>12 week paid maternity/ 6 week paid paternity leave</li>\n  <li>Monthly perks reimbursement for things like Netflix, Amazon Prime, your gym membership, home internet and more.</li>\n </ul>\n <div>\n  Visit&nbsp;\n  <a href='https://workable.com/nr?l=https%3A%2F%2Fwww.taxjar.com%2Fjobs' rel='nofollow'>www.TaxJar.com/jobs</a>&nbsp;for a full list of our benefits and to learn more about how we work and what we stand for.\n </div>\n <div>\n  <br>\n </div>\n <div>\n  If you're not the perfect fit for this position, but you know someone who is, we'll pay you $1,000 if you refer us to the person we hire.\n </div>\n <div>\n  <br>\n </div>\n</div>\n<div>\n <h4> Related Jobs <span><a rel='nofollow'> See more Business &amp; Management jobs<span>→</span></a></span></h4>\n <ul>\n  <li>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>Tutuka</span><br><span>Global Operations Leader</span><span>featured</span><br><span>Full-Time</span><span>/</span><span>Europe, Middle East, South East Asia</span></a></li>\n </ul>\n <br>\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "GqMFs0kMRYuO2FGxsT4Mcg",
    "url": "https://berlinstartupjobs.com/hr-recruiting/talent-acquisition-manager-m-f-d-mvp-factory/",
    "title": "Talent Acquisition Manager (m/f/d) // MVP Factory",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "DBG_TECH1:k/t/w:generics/java/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/java",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 25, 2019 4:05:22 PM",
    "validThrough": "Jul 2, 2019 4:05:22 PM",
    "crawled": "Jun 25, 2019 4:08:25 PM",
    "content": "<h3>Talent Acquisition Manager (m/f/d) // mvpfactory</h3>\n<div>\n  Company: mvpfactory \n <br> \n <br>\n</div>\n<div>\n  Tags:\n</div>\n<div> \n <div> \n </div> \n <p><strong>DESCRIPTION</strong></p> \n <p>MVP Factory delivers the best software in the market. We enable companies of all sizes to efficiently design, test, build and scale top technology products.</p> \n <p>We’re now looking for a Talent Acquisition Manager to help us achieve our ambitious growth plans. We’ve experienced some rapid success and are looking for someone to help us craft and develop our Talent Acquisition operation.</p> \n <p>We are tech agnostic and hand curate cross-functional teams to execute our client projects, meaning we need flexible and dynamic hiring strategies to effectively deal with demand.</p> \n <p>This person would ideally understand &amp; have a passion for product, with a firm understanding of both start-up and corporate ecosystems alike. You are a self-starter and are always looking for ways to innovate your practice and challenge ‘standard’ ways of doing things.</p> \n <p><strong>THE ROLE:</strong></p> \n <ul> \n  <li>Identification, engagement and recruitment of the best talent in the market across Software Development, Product Management, Project Management and UX/UI – both freelance and fulltime.</li> \n  <li>Develop and own end-to-end process management, ensuring all candidates have a great experience throughout, irrespective of the outcome.</li> \n  <li>Work alongside management to build authentic employer branding, driving consistent inbound interest from the best profiles across our key markets.</li> \n  <li>Work with marketing to proactively spot content &amp; event opportunities to drive our reputation forward as a key player in the digital landscape</li> \n </ul> \n <p><strong>YOUR PROFILE:</strong></p> \n <ul> \n  <li>You have solid experience recruiting for technical positions across development, product &amp; UX/UI – your knowledge allows you to quickly determine a truly skilled candidate without relying on ‘keywords’ or script-like questioning.</li> \n  <li>You understand the competitive nature of the market and have developed your own approach to address this.</li> \n  <li>You’re interested in what you’re building – as the first point of contact to potential talent, you’re able to properly articulate the mission because you’re passionate about what you do. You stay on top of the latest developments in the tech industry and spend time to really understand the fundamentals of the projects you need to recruit for.</li> \n  <li>You have excellent knowledge of the various sourcing channels and are constantly looking for ways to ‘hack’ the traditional methods of talent identification. Your approach is personal and makes you stand out from the generic ‘spam’ approach.</li> \n  <li>You can always be found at a meetup/talk/conference, engaging with the ‘hard to find’ profiles that don’t make themselves known elsewhere.</li> \n  <li>Above everything else, you are a people person – you care about engaging talent for the right reasons and spend the time getting to know what someone’s key drivers are before ‘selling’ to them.</li> \n </ul> \n <p><strong>WHY US?</strong></p> \n <ul> \n  <li>Competitive salary</li> \n  <li>Being part of MVPF enables you to build a network of companies and people all over the world and share knowledge with the best entrepreneurs, designers and developers in the industry</li> \n  <li>We embrace remote work and allow our employees to work remotely whenever possible.</li> \n  <li>Amazing views over Berlin in our 29th Floor office, right next to the river!</li> \n  <li>Access to the best resources – whatever you need to do your job the best way possible</li> \n  <li>“Take as you need” vacation policy + occasional international pop-up offices to facilitate remote work (for the last two years Cape Town in January)</li> \n  <li>Regular team events – we celebrate our successes together</li> \n </ul> \n</div>\n<span>Apply for this position</span>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "l4gJpVQFQkS4XhUjEljROw",
    "url": "http://workinstartups.com/job-board/job/81618/talent-acquisition-and-hr-intern-at-wegift/",
    "title": "Talent Acquisition and HR Intern",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``flexibl 3W work 2W from 2W home",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/HR",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "WeGift",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 19, 2019 4:44:26 PM",
    "validThrough": "Jun 26, 2019 4:44:26 PM",
    "crawled": "Jun 24, 2019 6:23:08 PM",
    "content": "*----A 3-6 month internship with a genuine prospect of a full time offer thereafter----*\n<br>\n<br>*Role:*\n<br>Assisting with talent identification, recruitment and day to day management\n<br>\n<br>*Responsibilities:*\n<br>* Looking after the recruitment inbox and answering recruitment queries\n<br>* Manage recruitment websites, updating and maintaining the dashboard\n<br>* Generate a strong candidate pool, getting in touch with candidates, leading phone and face-to-face interviews\n<br>* Ensure a robust and effective hiring process\n<br>* Delivering employee learning and development programmes, including coaching\n<br>* Communicate feedback to candidates after the interview\n<br>* Assist with HR and Recruitment projects\n<br>\n<br>*Requirements:*\n<br>* Passion for Human Resources and Recruitment\n<br>* Previous experience in Tech/Financial Start-ups\n<br>* Proficient use of Pack Office (Excel, PowerPoint and Word)\n<br>* Self-motivated, but a real team player\n<br>* Positive attitude, forward-thinking and proactive\n<br>* Ability to think creatively and handle multiple projects\n<br>* Ability to work under pressure\n<br>* Good English language skills (speaking and writing) and communication skills\n<br>* Good organisational and time-management skills\n<br>\n<br>*What's in it for you?*\n<br>We believe there is a clear distinction between perks and benefits. Perks are easily replicable, whereas benefits are something that are unique to us and something that we have taken the time to think about and tailor to fit our culture and ethos.\n<br>\n<br>*Benefits*\n<br>* Pay reviews every 6 months to make sure we’re paying market rate.\n<br>* Participation in the Employee Options pool so you get to own a piece of WeGift.\n<br>* Pension scheme (3% contribution)\n<br>* A minimum of 25 days holiday + bank holidays (we’re not too descriptive about holidays so if you need more time off then just ask).\n<br>* Staff perks with WeGift brands - discounts of up to 12% on coffee, weekly groceries, holidays, the list is endless.\n<br>* Flexible hours and work from home when needed - yes, yes everyone says this but we do.\n<br>* WeRecognise, where we shine the spotlight on exceptional employees every month who in turn get a £200 award in the eGift card of their choice.\n<br>* Personal development budget - well actually there is no budget as we don’t believe in putting a cap on learning new things.\n<br>* Generous maternity and paternity packages to make sure you get to spend time with your new bundle of joy.\n<br>* Fully licensed as a tier 2 sponsor + relocation packages to help you get settled in.\n<br>\n<br>*Perks*\n<br>* Brand new We Work office based in Monument, London.\n<br>* A new laptop as standard - no one wants an old one when they need to be doing their best work + all the trimmings you need to get the perfect work setup.\n<br>* Catered lunch once a week.\n<br>* Monthly team socials (Escape Rooms, Karaoke - everyone gets a chance to choose what this looks like)\n<br>* Cycle to work scheme - save some £££ on buying a bike\n<br>\n<br>\n<br>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "rDkVBvNpQAWXEDPRTrqKyQ",
    "url": "http://workinstartups.com/job-board/job/81618/talent-acquisition-ampamp-hr-intern-at-wegift/",
    "title": "Talent Acquisition &amp;amp; HR Intern",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``flexibl 3W work 2W from 2W home",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/HR",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "WeGift",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 19, 2019 4:44:26 PM",
    "validThrough": "Jun 26, 2019 4:44:26 PM",
    "crawled": "Jun 24, 2019 5:06:31 PM",
    "content": "*----A 3-6 month internship with a genuine prospect of a full time offer thereafter----*\n<br>\n<br>*Role:*\n<br>Assisting with talent identification, recruitment and day to day management\n<br>\n<br>*Responsibilities:*\n<br>* Looking after the recruitment inbox and answering recruitment queries\n<br>* Manage recruitment websites, updating and maintaining the dashboard\n<br>* Generate a strong candidate pool, getting in touch with candidates, leading phone and face-to-face interviews\n<br>* Ensure a robust and effective hiring process\n<br>* Delivering employee learning and development programmes, including coaching\n<br>* Communicate feedback to candidates after the interview\n<br>* Assist with HR and Recruitment projects\n<br>\n<br>*Requirements:*\n<br>* Passion for Human Resources and Recruitment\n<br>* Previous experience in Tech/Financial Start-ups\n<br>* Proficient use of Pack Office (Excel, PowerPoint and Word)\n<br>* Self-motivated, but a real team player\n<br>* Positive attitude, forward-thinking and proactive\n<br>* Ability to think creatively and handle multiple projects\n<br>* Ability to work under pressure\n<br>* Good English language skills (speaking and writing) and communication skills\n<br>* Good organisational and time-management skills\n<br>\n<br>*What's in it for you?*\n<br>We believe there is a clear distinction between perks and benefits. Perks are easily replicable, whereas benefits are something that are unique to us and something that we have taken the time to think about and tailor to fit our culture and ethos.\n<br>\n<br>*Benefits*\n<br>* Pay reviews every 6 months to make sure we’re paying market rate.\n<br>* Participation in the Employee Options pool so you get to own a piece of WeGift.\n<br>* Pension scheme (3% contribution)\n<br>* A minimum of 25 days holiday + bank holidays (we’re not too descriptive about holidays so if you need more time off then just ask).\n<br>* Staff perks with WeGift brands - discounts of up to 12% on coffee, weekly groceries, holidays, the list is endless.\n<br>* Flexible hours and work from home when needed - yes, yes everyone says this but we do.\n<br>* WeRecognise, where we shine the spotlight on exceptional employees every month who in turn get a £200 award in the eGift card of their choice.\n<br>* Personal development budget - well actually there is no budget as we don’t believe in putting a cap on learning new things.\n<br>* Generous maternity and paternity packages to make sure you get to spend time with your new bundle of joy.\n<br>* Fully licensed as a tier 2 sponsor + relocation packages to help you get settled in.\n<br>\n<br>*Perks*\n<br>* Brand new We Work office based in Monument, London.\n<br>* A new laptop as standard - no one wants an old one when they need to be doing their best work + all the trimmings you need to get the perfect work setup.\n<br>* Catered lunch once a week.\n<br>* Monthly team socials (Escape Rooms, Karaoke - everyone gets a chance to choose what this looks like)\n<br>* Cycle to work scheme - save some £££ on buying a bike\n<br>\n<br>\n<br>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "E1AV2OEBTh2FS-oU0PPIqg",
    "url": "https://remote.co/job/recruiter-57/",
    "title": "Recruiter",
    "tags": [
      "DBG:surround``remot W OR(contractor,assist,ok)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Side Real Estate",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 23, 2019 9:00:47 PM",
    "validThrough": "Jun 30, 2019 9:00:47 PM",
    "crawled": "Jun 23, 2019 9:31:16 PM",
    "content": "<h3>Recruiter at <span>Side Real Estate</span></h3>\n<div>\n <span><i></i> Remote</span> | \n <span> Freelance </span>\n</div>\n<div> \n <p><strong>REMOTE</strong></p>\n <p><strong>PEOPLE OPERATIONS – TALENT</strong></p>\n <p><strong>1099 (CONTRACT</strong>)</p>\n <p><strong>ABOUT SIDE</strong></p>\n <p>At Side, we believe everyone should own their path.</p>\n <p>As the first company to design an end to end modern brokerage solution, Side is re-imagining the real estate industry from the ground up by combining innovative technology, creative branding expertise, and an experienced leadership team with a mission to empower the world’s leading real estate professionals to own their brand and better serve home buyers and sellers.</p>\n <p>In the past two years, with an exceptional team of inSiders, we’ve processed $1B in transactions and raised over $30M in funding from top tier investors like Matrix Partners, Trinity Ventures, and 8VC.</p>\n <p>At Side, you’ll have the opportunity to collaborate and innovate your way to success. Becoming an inSider means that you’ll be empowering business leaders to become business owners, all while forging your own path with like-minded entrepreneurs. Join us at Side and own your career, your impact, and your life.</p>\n <p><strong>ABOUT THE TEAM</strong></p>\n <p>We’re a growing team of Talent Specialists and we’re instrumental to the direct growth of the company. We touch every department, and our hiring managers see us as hiring experts and partner closely with us to scale the company with the right talent in the right roles.</p>\n <p><strong>ABOUT THE ROLE</strong></p>\n <p>We’re looking for a full-cycle <strong>(remote contractor)</strong> Recruiter to own a mixture of business and technical hiring. As a full-cycle recruiter, you’ll be responsible for developing and implementing a candidate recruitment strategy. This includes advertising and passive candidate sourcing, acting as the gatekeeper to our culture and screening candidates thoroughly before passing them onto the next round, and creating a superb candidate experience that promotes our employer brand. You’ll own the recruitment of 8-10 roles at a time and manage the relationships with each candidate.</p>\n <p><strong>WHAT YOU’LL BE DOING</strong></p>\n <ul>\n  <li>Lead intake discussions with hiring managers, gathering the role requirements and supporting hiring managers in defining the interview process</li>\n  <li>Develop and implement advertising strategies to attract candidates to each role that you own</li>\n  <li>Source potential candidates on major and niche platforms by crafting personalized recruiting emails</li>\n  <li>Phone screen candidates and assess for cultural and role fit, make recommendations to hiring managers on which candidates to move forward with</li>\n  <li>Own candidate relationships and maintain a high close rate per requisition</li>\n </ul>\n <p><strong>WHAT WOULD MAKE YOU A STRONG FIT FOR THE ROLE?</strong></p>\n <ul>\n  <li>5+ years of experience in the recruiting industry with at least 3 years as a full-cycle recruiter</li>\n  <li>Strong writing skills and can succinctly develop a pitch</li>\n  <li>Critical eye for identifying top talent for specific roles</li>\n  <li>Strong prioritization skills</li>\n  <li>Successful track record of achieving targets</li>\n  <li>Candidate-first mentality</li>\n  <li>Familiarity with Applicant Tracking Systems (specifically Lever)</li>\n  <li>Self-starter with an incredible work ethic</li>\n </ul>\n <p>Side is committed to creating a diverse environment and is an equal opportunity employer. Side does not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, parental status, veteran status, or disability status.</p>\n <p>Side uses the E-Verify employment verification program.</p>\n <p>Our stewardship of the data of many of our customers means that a background and DRE license check is required to join Side. We will, nonetheless, consider qualified applicants with arrest and conviction records in accord with applicable law, including the San Francisco Fair Chance Ordinance.</p> \n</div>\n<div> \n <a href='https://jobs.lever.co/sideinc/26585d5a-4515-41ff-9930-e4add5ef60a2' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "iWGWlJVvQ_Cq2TNe_eTLVg",
    "url": "https://weworkremotely.com/remote-jobs/healthy-hemp-oil-hiring-manager-for-health-wellness-brand",
    "title": "Healthy Hemp Oil: Hiring Manager for Health & Wellness Brand",
    "tags": [
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "GoDaddyFull-TimeU.S or any country where GoDaddy has operationsVIPKidContractRemoteiTutorGroupContractGlobal",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 19, 2019 8:52:56 PM",
    "validThrough": "Jun 26, 2019 8:52:56 PM",
    "crawled": "Jun 19, 2019 9:30:26 PM",
    "content": "<h3> Hiring Manager for Health &amp; Wellness Brand </h3>\n<div>\n <div>\n  <span>Hey Teammate :)</span>\n </div>\n <div>\n  <span><br></span>\n </div>\n <div>\n  <span>We’ve got a thriving e-commerce business in a rapidly growing industry, and we are looking to increase our hiring rate, and build a better and stronger team.</span>\n </div>\n <div>\n  <span><br></span>\n </div>\n <div>\n  <span>In this work from home position, you’ll work closely with the founder of the business to make all key hiring decisions. You’ll be involved in every step of the hiring process, and have lots of freedom to learn and grow.&nbsp;</span>\n </div>\n <div>\n  <span><br></span>\n </div>\n <div>\n  <span>Job Summary:</span>\n </div>\n <ul>\n  <li><span>Work with various departments to determine new positions needed</span></li>\n  <li><span>Writing, posting, updating &amp; canceling new job posts</span></li>\n  <li><span>Managing and moving applicants through our HR software (JazzHr)</span></li>\n  <li><span>Main point of contact communicating with applicants throughout our hiring process</span></li>\n  <li><span>Screening candidates, reviewing resumes and providing feedback to our internal team</span></li>\n  <li><span>Scheduling, and conducting phone interviews</span></li>\n  <li><span>Developing and deploying skills testing methods for candidates (where appropriate)</span></li>\n  <li><span>Discussing compensation, setting up contracts and hiring teammates</span></li>\n </ul>\n <div>\n  <span><br></span>\n </div>\n <div>\n  <span>Job Details:</span>\n </div>\n <ul>\n  <li><span>Work hours initially might be 20-25 per week and will grow from there as projects increase.&nbsp;</span></li>\n  <li><span>We are flexible on work hours/time as long as you are responsive and get the job done.</span></li>\n </ul>\n <div>\n  <span><br></span>\n </div>\n <div>\n  <span>***To be considered, click the apply button, and tell us three of your favorite interview questions to ask -- and why you like them.</span>\n </div>\n <div>\n  <span><br></span>\n </div>\n <div>\n  <span>We’ve got a wonderful team and like to think that we know how to hire great people. That said, I’d love to hear your ideas for how you think we could improve our process.</span>\n </div>\n <div>\n  <span><br></span>\n </div>\n <div>\n  <span>Cheers,</span>\n </div>\n <div>\n  <span>Brandon</span>\n </div>\n <div>\n  <span><br></span>\n </div>\n <div>\n  <span>CEO of Healthy Hemp Oil</span>\n </div>\n <div>\n  <span>https://healthyhempoil.com/</span>\n </div>\n <div>\n  <span><br></span>\n </div>\n <div>\n  <span>P.S. I encourage you to read some of the products reviews on our website to see how our products have positively impacted people's lives. We strongly believe in our products and hope you do too.</span>\n </div>\n</div>\n<div>\n <h4> Related Jobs <span><a rel='nofollow'> See more All Other jobs<span>→</span></a></span></h4>\n <ul>\n  <li><span>New</span>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>GoDaddy</span><br><span>Senior Threat Researcher - Sucuri</span><span>featured</span><br><span>Full-Time</span><span>/</span><span>U.S or any country where GoDaddy has operations</span></a></li>\n  <li>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>VIPKid</span><br><span>Online English Teacher - Work From Home </span><span>featured</span><br><span>Contract</span><span>/</span><span>Remote</span></a></li>\n  <li>\n   <div></div>\n   <div>\n    <a rel='nofollow'>\n     <div></div><span>View company profile</span></a>\n   </div><a rel='nofollow'><span>iTutorGroup</span><br><span>Online English Teacher</span><span>featured</span><br><span>Contract</span><span>/</span><span>Global</span></a></li>\n </ul>\n <br>\n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "yWKNfJr8TLW46XteIDk02g",
    "url": "https://remote.co/job/hr-administrator/",
    "title": "HR Administrator",
    "tags": [
      "DBG:surround``OR(work,remot) 3W 3W(OR(wherev,whenev,where), OR(want,comfort))",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Human Made",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 19, 2019 4:22:47 PM",
    "validThrough": "Jun 26, 2019 4:22:47 PM",
    "crawled": "Jun 19, 2019 5:08:27 PM",
    "content": "<h3>HR Administrator at <span>Human Made</span></h3>\n<div>\n <span><i></i> Remote</span> | \n <span> International </span>\n</div>\n<div> \n <p>You will be responsible for coordinating the hiring process, so experience with recruitment is desirable including building role profiles and understanding and using recruitment platforms. As Human Made is actively seeking to create a more diverse team, experience with recruiting from minority groups in the tech industry is an advantage. You will draft job descriptions, advertise new roles, triage applications, and follow up with applicants. When a new employee accepts a position, you will be responsible for creating their contract and onboarding them to the company. You should provide input into how to refine and improve Human Made’s recruitment and hiring processes.</p>\n <p>Human Made has a number of HR management systems, including CharlieHR and TriNet. You will be responsible for updating these as required and ensuring that they remain compliant with relevant data protection law. The company has a public handbook, which you will be responsible for updating, including HR policies based on the suggestions of our HR advisors in the UK, USA, and Australia. You will be expected to liaise with those advisors on HR-related matters, and to speak to our other legal advisors with regards to issues such as new subsidiaries, insurance, and visa applications.</p>\n <p>You will be responsible for administrating Human Made’s HR processes, including engagement surveys, 360s, and Performance Review. You’ll work with the Director of People Operations to roll out new HR and culture initiatives.</p>\n <p>Human Made is a visa sponsoring organisation in the UK and Australia. You will be responsible for administering the visa application process for employees who are seeking to move to these countries.</p>\n <p>You will be responsible for Human Made’s GDPR compliance, including updating our data protection policies and conducting data protecting audits as necessary. Prior knowledge of this is not required and training will be provided to support you.</p>\n <p>Human Made is a remote company so you should have excellent written communication skills that enable you to work with a diverse group of people from around the world. You should be able to work in a self-directed manner, addressing problems as they come up, and identifying issues in your area of work and fixing them. You should be able to prioritise your tasks and able to ask for help when you need it.</p>\n <p>As this is a HR role, you should have excellent interpersonal skills and be able to communicate well with people at all levels of the company. You will be a member of the Operations Team, reporting directly to the Director of People (who reports to the CEO).</p>\n <h5><strong>Responsibilities</strong></h5>\n <ul>\n  <li>Assisting with the management of the hiring process, including triaging applications, advertising new roles, following up with applicants.</li>\n  <li>Onboarding new employees.</li>\n  <li>Updating the handbook and HR policies.</li>\n  <li>Liaising with HR advisors in the UK, USA, and Australia.</li>\n  <li>Creating contracts.</li>\n  <li>Liaising with the company’s employment law advisors.</li>\n  <li>Managing the visa sponsorship process and maintaining compliance.</li>\n  <li>Overseeing the company’s data protection compliance (including GDPR).</li>\n  <li>Updating the company’s HR systems.</li>\n  <li>Administrating continuous improvements cycles (360s &amp; performance reviews).</li>\n  <li>Administrating the engagement survey</li>\n  <li>Supporting employee engagement across the company.</li>\n  <li>Promoting our culture and values within our people documents and communications.</li>\n  <li>Collating key people metrics and reporting to the company.</li>\n </ul>\n <h5><strong>REQUIREMENTS</strong></h5>\n <ul>\n  <li>Empathetic and people-focused.</li>\n  <li>Experience with recruitment.</li>\n  <li>Experience with recruiting minorities in the tech industry is an advantage.</li>\n  <li>HR experience in the UK, United States, or Australia.</li>\n  <li>Excellent written and verbal communication skills.</li>\n  <li>Able to understand and communicate legal advice.</li>\n  <li>Excellent organisational skills and attention to detail.</li>\n  <li>Ability to identify and implement commercial HR solutions.</li>\n  <li>Excellent interpersonal skills.</li>\n  <li>Ability to juggle multiple tasks and switch contexts.</li>\n  <li>Pro-active about fixing problems where you see them</li>\n  <li>Experience of People Operations or remote work is an advantage.</li>\n </ul>\n <h5><strong>BENEFITS</strong></h5>\n <ul>\n  <li>£25,000 – £30,000 GBP (or local equivalent)</li>\n  <li>Flexible working</li>\n  <li>52 weeks parental leave</li>\n  <li>35 days holiday (including public holiday)</li>\n  <li>Sickness and carers leave</li>\n  <li>Annual company retreat (Previous retreats have been in Sri Lanka, Italy, Slovakia, Spain, Norway)</li>\n  <li>Conference and training budget</li>\n  <li>Monthly remote working allowance</li>\n  <li>Work wherever you want</li>\n  <li>New computer and mobile phone</li>\n  <li>Office equipment when you need it</li>\n </ul> \n</div>\n<div> \n <a href='https://humanmade.workable.com/jobs/1054742' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "hVWs2lWxSWGhKx2oYugxhQ",
    "url": "https://remote.co/job/senior-recruiter-15/",
    "title": "Senior Recruiter",
    "tags": [
      "DBG:surround``5N( opportun,             2N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Alexander Mann Solutions",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 17, 2019 4:43:43 PM",
    "validThrough": "Jun 24, 2019 4:43:43 PM",
    "crawled": "Jun 17, 2019 5:07:21 PM",
    "content": "<h3>Senior Recruiter at <span>Alexander Mann Solutions</span></h3>\n<div>\n <span><i></i> Remote</span> \n</div>\n<div> \n <p><strong>Overview</strong></p>\n <ul>\n  <li><strong>Job ID:</strong> 11488</li>\n  <li><strong>Country:</strong> United States of America</li>\n  <li><strong>Location: United States (Remote)</strong></li>\n  <li><strong>Job Type:</strong> Employee</li>\n  <li><strong>Employment Type:</strong> Full-Time</li>\n  <li><strong>Functional Area:</strong> Recruitment</li>\n </ul>\n <p><strong>Job Description</strong></p>\n <p><strong>Job Description Summary</strong></p>\n <p><strong><em>We are Alexander Mann Solutions and we’re passionate about helping companies and individuals fulfill their potential through talent acquisition and management.</em></strong></p>\n <strong><em></em></strong>\n <p><strong><em>Today, nearly 4,000 of our talent acquisition and management experts are partnering with our blue-chip clients across multiple sectors and in more than 90 countries. Delivering a distinctive blend of outsourcing and, through our Talent Collective team, consulting services, our unrivaled experience, capability and thought leadership helps our clients attract, engage and retain the talent they need for business success.</em></strong></p>\n <p>We are seeking a Senior Talent Acquisition Specialist with extensive Aerospace and Engineering background managing the full life cycle and sourcing recruitment experience to support our Defense and Engineering client.&nbsp;<strong>This is a remote opportunity.</strong></p>\n <ul>\n  <li>Develop end-to-end recruitment campaign strategies for specialized Engineering roles</li>\n  <li>Develop and support the sourcing strategy for each role and agree with the strategy (including web-based and direct sourcing) with the hiring manager</li>\n  <li>Responsible for the management of candidate relationships and their satisfaction with the recruitment experience until the start date</li>\n  <li>Ensure that all changes to a candidate’s status are tracked on the ATS to enable accurate reporting</li>\n  <li>Support the hiring manager with deciding which candidate to hire and guide them in determining an appropriate offer. Close the candidate: broker the offer with the chosen candidate, manage objections and support the candidate during their notice period</li>\n </ul>\n <p><strong>Position Requirements</strong></p>\n <ul>\n  <li><strong>Bachelor’s Degree or equivalent experience</strong></li>\n  <li>Recruitment experience with IT, Manufacturing, Engineering roles</li>\n  <li>Good planning and organizing skills</li>\n  <li>Demonstrated experience developing and delivering successful end to end recruitment campaign strategies to meet client requirements, including developing sourcing strategies</li>\n  <li>Proven experience working across remote teams and as an individual contributor to drive the talent agenda</li>\n  <li>Ability to work in a segmented recruitment model with very intricate process</li>\n </ul>\n <p>We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.</p> \n</div>\n<div> \n <a href='https://careers.peopleclick.eu.com/careerscp/client_ams_ta/external/jobDetails.do?functionName=getJobDetail&amp;jobPostId=16639&amp;localeCode=en-us' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "PfnDCkTyQCCeDUj8YZh_7g",
    "url": "https://remote.co/job/recruiting-coordinator-7/",
    "title": "Recruiting Coordinator",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``work 2W from 2W home 4W OR(staff,cowork,offic,posit)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "PeopleScout",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 14, 2019 5:19:48 PM",
    "validThrough": "Jun 21, 2019 5:19:48 PM",
    "crawled": "Jun 14, 2019 6:24:09 PM",
    "content": "<h3>Recruiting Coordinator at <span>PeopleScout</span></h3>\n<div>\n <span><i></i> Remote</span> | \n <span> Entry-level </span> | \n <span> Part-time </span>\n</div>\n<div> \n <p><strong>Location:</strong> <strong>USA</strong></p>\n <p>As a Recruiting Coordinator, you are part of a team of highly skilled recruiting professionals working on high-volume and/or hard to fill positions for PeopleScout’s RPO clients. The Phone Screener role will provide support to the recruiting staff in coordinating all aspects of screening, scheduling interviews, tracking and monitoring candidate information and selection hiring of new employees. This position requires an extremely perceptive person who is able to relate to individuals at all levels.</p>\n <p>This is a <strong>Part time, Virtual, work from home</strong> position working up to 40 hours a week with some flexibility with hours/days worked.</p>\n <p><strong>Responsibilities:</strong></p>\n <ul>\n  <li>Tracking and monitoring confidential candidate information</li>\n  <li>Overseeing the background and pre-employment screening process</li>\n  <li>Editing and opening requisitions to internal/external sites</li>\n  <li>Managing daily information/candidate data tracking and completing offer letters</li>\n  <li>Scheduling interviews and providing information to the client as needed</li>\n  <li>Maintaining a high level of customer retention and satisfaction.</li>\n </ul>\n <p><strong>Requirements:</strong></p>\n <ul>\n  <li>1 year experience as a Recruiting Coordinator or administrative assistant in human resources or similar industry</li>\n  <li>Ability to manage a large workload in a timely manner and prioritize and complete projects within deadline</li>\n  <li>Ability to prioritize and plan in a fast-paced, high volume setting</li>\n  <li>Strong attention to detail and prioritization of projects</li>\n  <li>Strong Microsoft Outlook skills and literacy in Excel and Word.</li>\n  <li>Excellent communication skills and the ability to collaborate effectively with others and build strong relationships</li>\n </ul>\n <p>PeopleScout, is the world’s largest recruitment process outsourcing (RPO) provider, offering a dedicated, scalable, and strategically customized delivery model. PeopleScout’s suite of services includes RPO, employment branding, on-boarding, career counseling, and employee retention. PeopleScout serves businesses of all industries.</p>\n <p>PeopleScout, a TrueBlue company, has helped define the RPO industry since we were founded in 1991. Our proprietary applicant tracking system and revolutionary processes have simplified and standardized candidate sourcing, selection, hiring, on-boarding and retention for some of the top companies in the world.</p>\n <p>Veteran hiring efforts are core to our mission at PeopleScout, and we are proud to have placed more U.S. Military veterans in full-time employment than any other recruitment firm in the world. PeopleScout is an equal opportunity employer, strengthened by the diversity of our workforce.</p> \n</div>\n<div> \n <a href='https://peoplescout.greatjob.net/job/PEOPUSae63b2988adb4de2a0253b89fa565084/Recruiting-Coordinator-(1149358)#PEOPUSae63b2988adb4de2a0253b89fa565084' rel='nofollow'>Apply for job</a> \n</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "61QzqF6QQaOiCy-I1HGjXQ",
    "url": "http://workinstartups.com/job-board/job/81449/hr-manager-at-we-make-change/",
    "title": "HR Manager",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/HR",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "We Make Change",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 13, 2019 9:00:24 PM",
    "validThrough": "Jun 20, 2019 9:00:24 PM",
    "crawled": "Jun 13, 2019 10:30:43 PM",
    "content": "Job Description: HR Manager - We Make Change\n<br>\n<br>Role Title: HR Manager - We Make Change\n<br>Team: People (HR)\n<br>Location: Remote\n<br>Reporting to: Head of Recruitment &amp; Onboarding, Sabina Raus\n<br>Staff Management: HR Associate x 2\n<br>Key Working Relationships: Head of Recruitment &amp; Onboarding, HR Manager (Changemakers), HR Associate (Changemakers), HR Associate (We Make Change), HR Coordinator, Head of Inclusion &amp; Diversity\n<br> \n<br>Time Commitment: 4-5 hours minimum per week (plus any more time you are able to offer)\n<br>\n<br>Our Company\n<br>https://www.wemakechange.org \n<br>We Make Change gives you the power to change the world.\n<br>Our platform enables anyone, anywhere to use their skills to make the change they want to see. \n<br>We connect ChangeMakers (purpose-driven individuals) with high-impact NGOs to develop projects supporting the causes they care about. \n<br>\n<br>The People Team\n<br>As a member of the People Team, you will be assisting in the recruitment and onboarding process of our We Make Change (WMC) and Changemaker People. We have recently restructured and the Changemaker/WMC Functions sit devolved alongside one another.\n<br>\n<br>\n<br>\n<br>\n<br>Job Brief\n<br>We’re looking for an HR Manager to lead the development the HR functions within the internal team at We Make Change. The postholder will work alongside a HR Manager (Changemakers) who will manage the external function.\n<br>\n<br>The role will involve working closely with our Head of Resourcing and Onboarding, with the aim of developing our recruitment strategy, advising on designing practices and policies, as well as ensuring that we promote the fun, inspiring and empowering culture that we wish to define our organisation.\n<br>\n<br>The internal team HR Manager will be responsible for delivering a people development strategy, encompassing recruitment, learning and development, internal communication and volunteer engagement across the entire We Make Change Team.\n<br>\n<br>What you will do:\n<br>Work with people across the business to develop and implement a recruitment strategy.\n<br>Work with stakeholders across the business to scope, design and implement career development strategies such as reward mechanisms, mentoring, coaching and role model programmes and succession planning.\n<br>Work in partnership with the management team to establish skill gaps and then develop effective training solutions aligned to business objectives and values.\n<br>Research, scope, recommend and implement people strategies and initiatives that will complement the evolving needs of the business.\n<br>Take ownership of the internal on-boarding process in partnership with the Head of Resourcing and Onboarding, inclusive of processing relevant paperwork using internal systems.\n<br> Work with senior management to develop ways of driving up engagement.\n<br>Work with other managers, improving volunteers’ experiences of working with us\n<br> Promote Equality, Diversity &amp; Inclusion\n<br>Promote Health and Safety\n<br>\n<br>Desired experience:\n<br>Professional experience in an HR role is a requirement\n<br> Leading people development initiatives at strategic level\n<br> Some experience within Learning and Development is preferred\n<br>Experience of working within a busy HR or training department during a significant period of change\n<br>Knowledge of Equality, Diversity &amp; Inclusion best practice \n<br>\n<br>Desired skills:\n<br> High emotional intelligence and the ability to influence stakeholders at all levels of the business\n<br>Ability to work under pressure and under tight deadlines.\n<br>Excellent communication skills, highly personable with a flexible and mature approach.\n<br>Management and leadership skills\n<br>Accuracy and attention to detail\n<br>\n<br>\n<br>Location\n<br>The role will be performed remotely, so applications are welcomed from across the world.\n<br>As the role is as a volunteer, it is unpaid, but it offers a great opportunity to gain experience, while helping to change the world!\n<br>Whatever cause you care about, whatever skill you have, if you want to change the world, then become a Changemaker by applying today.\n<br>\n<br>Our systems\n<br>At We Make Change, we utilise the power of technology to drive forward positive social change using programme management techniques and social action. Systems we use, include;\n<br>Trello: our primary project management board)\n<br>Slack (Changemakers): Our communication channel with Changemakers\n<br>Slack (We Make Change): Our internal communication channels\n<br>GSuite: Files stored on google drive\n<br>\n<br>We Make Change: We are all unique\n<br>At We Make Change, we value the power of diversity and recognise the importance of Inclusion, authenticity and belongingness at the heart of what we do. Our aim is to create an environment where all our people are able be their authentic-selves, and each unique individual’s contribution is valued. \n<br>\n<br>In line with the 2010 Equality Act (UK), we will not tolerate discrimination on the grounds of; Age, Disability, Ethnicity, Gender Reassignment, Marriage or Civil Partnership, Pregnancy &amp; Maternity, Race, Religion or Belief, Sex or Sexual Orientation. All of our recruitment and selection processes undergo a meritocratic assessment process.\n<br>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "xuz_w0HESEWdP8OjQBRpPQ",
    "url": "https://weworkremotely.com/remote-jobs/code-for-cash-inc-sourcing-operations-associate-programming-knowledge-required",
    "title": "Code For Cash, Inc: Sourcing Operations Associate | programming knowledge required.",
    "tags": [
      "DBG:surround``OR(eastern, east, est, edt, newyork) 3W OR(time,timezon)",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG:surround``usa 3W OR(time,timezon)",
      "DBG_TECH1:k/t/w:air/frontend/8",
      "DBG_TECH1:k/t/w:air/mobile/8",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=8, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=11}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/mobile",
      "TITLE1/HR",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "frontend",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false,
      "formatted": ""
    },
    "employmentType": "UNSET",
    "published": "Jun 11, 2019 8:11:38 PM",
    "validThrough": "Jun 18, 2019 8:11:38 PM",
    "crawled": "Jun 11, 2019 8:30:30 PM",
    "content": "<h3> Sourcing Operations Associate | programming knowledge required. </h3>\n<div>\n <div>\n  <span></span>\n </div>\n <div>\n  <span>Code For Cash recruits software developers in ways that are high-integrity, non-intrusive and mutually profitable, and we are hiring a </span>\n  <span>sourcing operations associate</span>\n  <span>. &nbsp;In plain English, this means we need someone to find great potential employees for our clients, even if they’re not on the job market.</span>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span>We need someone who's smart and thinks critically. &nbsp;We need someone who is punctual and reliable, who gets things done but also has the courage to challenge and improve our processes if they think there is a better way. &nbsp;We need someone who is hungry for success but has the personal boundaries and self-discipline to lead a sustainable, spiritually fulfilling life. Culturally, it's essential that you have some professional programming experience, either full-time or as a freelancer. &nbsp;Other than that, there are no rules, and we hope to welcome you into our eclectic culture.</span>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Details</b></span>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span>This is a remote job. &nbsp;You are expected to be available for at least four hours between 10am and 6pm USA Eastern Time. &nbsp;You must have authorization to work with a USA company but may be located anywhere in the world.</span>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Requirements</b></span>\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li><span>Native-level English fluency and flawless grammar (it's okay if you're aided by Grammarly, as long as you're consistent in using it!)</span><br><br></li>\n  <li><span>HTML and CSS knowledge, comfortable adapting responsive templates</span><br><br></li>\n  <li><span>Power use of web software (i.e. you know the hotkeys for many apps; you are comfortable using Zapier in complex ways if necessary)</span><br><br></li>\n  <li><span>Experience with Git and GitHub</span><br><br></li>\n </ul>\n <div>\n  <span><b>Compensation</b></span>\n  <br>\n </div>\n <div></div>\n <div>\n  <span><br></span>\n </div>\n <div>\n  <span>Negotiable, depending on experience. &nbsp;Equity after standard one-year cliff. Additional equity awards for work that impacts the business at a unit economics level.</span>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Will I belong? </b></span>\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li><span>Our backgrounds are extraordinarily different; we are united by our love of technology and our desire for independence and freedom. &nbsp;</span><br><br></li>\n  <li><span>We’re winners. &nbsp;Are you as well?</span><br><br></li>\n  <li><span>We like to work quickly. &nbsp;Can you keep up?</span><br><br></li>\n  <li><span>Check out our vibe at https://codefor.cash/aboutus</span><br><br></li>\n </ul>\n <div>\n  <span><b>What’s the impact the company has on the world? &nbsp;</b></span>\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li><span>For candidates, we're making it a lot easier to find a great job in tech.</span><br><br></li>\n  <li><span>For employers, we're making the process of adding a new employee more seamless.</span><br><br></li>\n </ul>\n <div>\n  <span><b>What colleagues am I going to be interacting with day to day, and who benefits from my work? </b></span>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span>You're primarily going to be interacting with the client-facing Account Executives. e.g., Zack (https://www.linkedin.com/in/zackburt) &nbsp;</span>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>What are the growth and learning opportunities for everyone in the company?</b></span>\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li><span>Paid training: increase your technical and marketing skills.</span><br><br></li>\n  <li><span>Book club. We will buy you any book you want as long as you summarize your findings into a blog post.</span><br><br></li>\n  <li><span>As many online courses as you want, as long as you share your learning with the team and apply them in your day to day work.</span><br><br></li>\n  <li><span>People are always encouraged to increase their responsibilities as long as their existing responsibilities are well cared for.</span><br></li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>What’s work of this position like day to day?</b></span>\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li><span>Keep your Account Exec in the loop with your progress with 2x daily updates, at the start of the day and at the end of the day.</span><br><br></li>\n  <li><span>Going through Craigslist, Indeed, GitHub, LinkedIn and searching for professionals that match our clients’ criteria.</span><br><br></li>\n  <li><span>Leverage browser extensions and programming to partially automate all aspects of your work, with the goal of gradually creating end-to-end automation.</span><br><br></li>\n  <li><span>Update our Operations Associate handbook constantly as we are reassembling the airplane in the air.</span><br><br></li>\n  <li><span>Building landing pages that properly describe our roles.</span><br><br></li>\n  <li><span>Launching advertising campaigns to target our candidates.</span><br><br></li>\n </ul>\n <div>\n  <span><b>What am I going to be doing in 6 months? </b></span>\n </div>\n <div>\n  <br>\n </div>\n <ul>\n  <li><span>If you are enjoying your position and want work-life balance, you are encouraged to stay in it.</span><br><br></li>\n  <li><span>If you are ambitious and would like a promotion, you are expected to increasingly automate all aspects of your work and then hire someone to delegate your work to. &nbsp;Within 6 months, you could be managing an entire team.</span></li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>What specific skills and values are you looking for? What will candidates be evaluated on?</b></span>\n  <br>\n </div>\n <div></div>\n <div>\n  <span><br></span>\n </div>\n <ul>\n  <li><span>Do we get along with you personally: do we enjoy our interactions and do they leave us feeling energized?</span><br><br></li>\n  <li><span>Are you motivated to do the work, even if outside your job description?</span><br><br></li>\n  <li><span>Are you professional and reliable in that you show up to meetings prepared?</span><br><br></li>\n  <li><span>Does your application demonstrate attention to detail and thoughtfulness?</span></li>\n </ul>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>Compensation</b></span>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span>Negotiable, depending on experience. Equity after standard one-year cliff. Additional equity awards for work that impacts the business at a unit economics level.</span>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>How to apply</b></span>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span>You'll need a clean, pdf format version of your resume. &nbsp;Then, take that pdf and convert it into HTML and CSS...nothing fancy, but make the page look exactly like the pdf. &nbsp;Send an email with your resume in pdf format and a link to the live webpage version. We promise to respond to everyone who applies within these parameters! &nbsp;</span>\n </div>\n <div>\n  <br>\n </div>\n <div>\n  <span><b>The interview process</b></span>\n </div>\n <div>\n  <br>\n </div>\n <ol>\n  <li><span>Apply according to the instructions</span><br><br></li>\n  <li><span>10 minute video meeting with Zack, the Account Exec</span><br><br></li>\n  <li><span>10 minute meeting with two other colleagues</span><br><br></li>\n  <li><span>We'll extend you a contract offer with DocuSign and set you up with Gusto payroll</span><br><br></li>\n  <li><span>Anyone who overdelivers in the first week is going to be offered continued employment</span><br><br></li>\n </ol>\n</div>\n<div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
