{
 "items": [
  {
    "id": "T9IrcCDgTVuez6vIDYL2_g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4349-software-integrations-engineer-reaction-commerce",
    "title": "Software & Integrations Engineer @ Reaction Commerce",
    "content": "<h2>              Software &amp; Integrations Engineer<small> @ Reaction Commerce</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-04-13 03:13</p></dd>          <dt><span>Description</span></dt>          <dd><p>Reaction Commerce is seeking a Software Engineer to join our growing Solutions (client  &amp; community) engineering team. As a part of the engineering team at Reaction Commerce, you’ll have the opportunity to help shape the fastest growing open source commerce platform in the world. You’ll be responsible for collaborating with the engineering team to work on enterprise client implementations, community code, and 3rd-party integrations on Reaction Commerce.  You will play an active role in translating business and functional requirements into reliable, quality software.</p><p><strong>Responsibilities</strong></p><ul><li>Work with clients to determine their needs in regards to integration/extensions</li><li>Collaborate with clients and provide technical leadership on how to best customize the software</li><li>Build 3rd-party and client integrations using software best practices</li><li>Create documentation for both clients and community for created packages</li><li>Work with the core team to establish API’s for extending the core software</li><li>Operate within a cross-functional distributed team to deliver reliable, performant, well-crafted software by agreed-upon deadlines</li></ul><p><strong>Qualifications</strong></p><ul><li>BA/BS in Computer Science or related field or equivalent experience</li><li>Fluent in English</li><li>2+ Years as a software engineer working on 3rd party solutions and integrations</li><li>Experience with Node and the npm environment</li><li>A strong understanding of the asynchronous programming model</li><li>Experience in one or more other JavaScript framework/toolkits like React, GraphQL, Relay, Redux, Express, Apollo, or Meteor</li><li>Experience with SQL, MongoDB, and other NoSQL databases</li><li>Experience building integrations into ERP, Tax, Accounting, Inventory management, Payment gateways, and other 3rd parties essential to ecommerce storefronts.</li><li>Experience writing automated scripts to transform and migrate large datasets from one platform to another.</li><li>Exceptional written and oral communication skills including the ability to communicate complex issues to technical and non-technical staff and management</li><li>Experience developing for ecommerce or CMS platforms</li><li>Understanding of open source software tools such as Git</li><li>Experience maintaining or contributing to open source projects is a plus</li><li>Experience in one or more other app containerization platforms such as Docker, Kubernetes, OpenStack, Mesos and DC/OS is a plus</li></ul><p><strong>Characteristics</strong></p><ul><li>Motivated, self-starter who can work in a distributed team environment</li><li>Open-minded mentality</li><li>Goal-oriented personality</li><li>Empathy for customers, community, and co-workers</li><li>Tendency to teach others what you know and excitement for sharing knowledge</li><li>Growth oriented mindset and a desire to be better today than yesterday</li><li>Desire to deliver an exceptional customer experience</li><li>Critical thinker who will work to solve the right problem</li><li>Cooperative attitude and an ability to pair program effectively with other engineers</li><li>Ability to think holistically for a given project or problem</li><li>Understanding of the intricacies of simultaneous development for both desktop and mobile targets</li></ul><p><strong>Details</strong></p><ul><li>Position:  Full Time</li><li>Location: Anywhere</li><li>Compensation: Salary commensurate with experience, stock options, medical and dental benefitsHours:</li><li>Flexible<ul><li>Irregular hours and some weekends to support an international community and developer events like hackathons, conferences, user groups, team meetings and preferably at least 5 hours overlapping Pacific Standard Time.</li></ul></li></ul><p><strong>About</strong></p><p>At Reaction Commerce, we believe that the best results come from shared ideas. We’re an open source platform built on open source code, driven by modern technology and the spirit of our global community. Collaborate with us at our Santa Monica HQ, located just minutes from the beach, or work remotely from anywhere in the world.</p><p>Physical and mental health is important to us, which is why we offer full medical, dental, and vision coverage for employees, family leave, plus stock options, flexible office hours, free lunch, <a href='https://blog.reactioncommerce.com/why-were-opting-for-a-minimum-vacation-policy/' rel='nofollow'>vacation stipends</a>, and more.</p><p>We’re an equal opportunity employer, but we go above and beyond mere lip service. We welcome people of any gender identity, ethnicity, age, size, nationality, sexual orientation, neurotype, religion, elder status, family structure, culture, subculture, education level, identity, and self-identification. We think accessibility for people with disabilities is a priority, not an afterthought. We think neurodiversity is a feature, not a bug.</p><p>We believe in being inclusive, welcoming, and supportive of anyone who comes to us with the desire to build, collaborate, and lead. To learn more, <a href='https://docs.reactioncommerce.com/reaction-docs/master/diversity-statement' rel='nofollow'>visit our diversity statement</a>.</p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere*</p></dd>            <dt><span>Location</span></dt>            <dd><p>Preferably at least 5 hours overlapping Pacific Standard Time.</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Apr 13, 2018 6:12:20 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/integration",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "DPWBHmGIQUa59KuNeQUB7w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/170433/cloud-build-and-release-engineer-elastic?a=V9N847GZfNe",
    "title": "Cloud- Build and Release Engineer at Elastic  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Data &amp; Analytics, Search, Software Development / Engineering</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>501-1k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>At Elastic, we have a simple goal: to pursue the world's data problems with products that delight and inspire. We help people around the world do exceptional things with their data. From stock quotes to Twitter streams, Apache logs to WordPress blogs, our products are extending what's possible with data, delivering on the promise that good things come from connecting the dots. Often, what you can do with our products is only limited by what you can dream up. We believe that diversity drives our vibe. We unite employees across 30+ countries into one unified team, while the broader community spans across over 100 countries.</p><p>Elastic is building out our Elastic Cloud Team focusing on Elastic as a Service. This is a great opportunity to help lead our Cloud efforts and make an immediate impact to our strategy and implementation.</p><p>Our cloud product allows users to create new clusters or expand existing ones easily This product would be built on technologies such as OpenStack, AWS, Docker, and others to enable the Operations Teams to easily create and manage multiple Elastic Clusters.</p><p><strong>Job Duties and Requirements</strong></p><ul><li>Work closely with Elastic’s engineering teams (like Elasticsearch, Kibana, Logstash and Beats) to plan releases on Cloud’s infrastructure</li><li>Add automation to continuously deploy nightly snapshot releases and release candidates to staging/production environments</li><li>Managing git branching processes and automation</li><li>Managing the scala sbt/make build framework for Cloud</li><li>Collaborate with the infra team on CI workflows</li><li>Simplifying and automating developer workflows</li></ul><p><strong>Qualifications</strong></p><ul><li>Experience or familiarity with Docker</li><li>Experience in automating release deployments in SaaS infrastructure</li><li>Deep knowledge of at least one build system (preferably sbt) and one CI system (preferably Jenkins)</li><li>Strong knowledge and experience with git and git workflows</li><li>Good working knowledge of Unix based operating systems</li></ul><p><strong>Additional Information</strong></p><ul><li>Competitive pay and benefits</li><li>Stock options</li><li>Catered lunches, snacks, and beverages in most offices</li><li>An environment in which you can balance great work with a great life</li><li>Passionate people building great products</li><li>Employees with a wide variety of interests</li></ul><p>Your age is only a number. It doesn't matter if you're just out of college or your children are; we need you for what you can do.</p><p>Elastic is an&nbsp;Equal Employment employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees.&nbsp;Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status&nbsp;or any other basis protected by federal, state or local law, ordinance or regulation.&nbsp;Elastic also makes reasonable accommodations for disabled employees consistent with applicable law.&nbsp;</p>                    </div>                            <h2>                About Elastic            </h2>            <div><p>Elastic builds software to make data usable in real time and at scale for search, logging, security, and analytics use cases. Founded in 2012, the company develops the open source Elastic Stack (Elasticsearch, Kibana, Beats, and Logstash), X-Pack (commercial features), and Elastic Cloud (a SaaS offering). To date, there have been more than 100 million cumulative downloads. The Elastic community is 100,000 members strong. Thousands of organizations including Cisco, eBay, Goldman Sachs, NASA, Microsoft, Mayo Clinic, <em>The New York Times</em>, Wikipedia, and Verizon use Elastic to power mission-critical systems. Backed by Benchmark Capital, Index Ventures, and NEA with more than $100 million in funding, Elastic has a distributed workforce with more than 600 employees in 30 countries. Learn more at <a href='http://www.elastic.co' rel='nofollow'>elastic.co</a></p>            </div>                                <h2>Benefits</h2>                            <div>                                 401k Matching Up to 6 % in US and Pensions in some other countries                            </div>                            <div>                                 Health Care Insurance                            </div>                            <div>                                 Vacation Time Determined By Location                            </div>                            <div>                                 Lunch and Breakfast in Most Offices                            </div>                            <div>                                 100% Remote work possible                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/integration",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "BQj5yzPER7axU8g6YzaA_w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/67134/help-needed-to-build-simple-alexa-skills-at-desire-path/",
    "title": "Help needed to build simple Alexa Skills",
    "content": "We are a small team of designers and developers creating experiences for mobile, chatbots and now voice!<br /><br />I'm looking for a talented programmer to help develop an Alexa Skill. Initially just one skill is needed, but more will be required for the right person.<br /><br />You must have experience in creating skills and can point to existing Alexa skills you have created in the marketplace. <br /><br />The first skill to be created is a simple one, but more information about the projects can be supplied during selection process.<br /><br />It is immediate start for the right person! This would suit a freelancer or evening/weekend work. Remote work acceptable!<br /><br />Thanks!<br />",
    "urlFetchPending": false,
    "published": "Mar 15, 2018 7:57:15 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "e2Z0bNtnTjqybEslMkcxyw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "wfh.io",
    "url": "https://www.wfh.io/jobs/4151-build-and-release-engineer-ruby-exp-bamtech-media",
    "title": "Build and Release Engineer - Ruby exp. @ BAMTECH Media",
    "content": "<h2>              Build and Release Engineer - Ruby exp.<small> @ BAMTECH Media</small>          </h2><dl>          <dt></dt>          <dd><p></p></dd>          <dt></dt>          <dd><p>2018-02-21 04:00</p></dd>          <dt><span>Description</span></dt>          <dd><p>BAMTECH Media is a place for the creative and the bold. We’re seeking talent across disciplines to join our team. Whether New York City, San Francisco, Manchester or Amsterdam we provide opportunities to elevate your career and transform an industry.</p><p>BAMTECH is a leading technology services and video streaming company owned by The Walt Disney Company, MLBAM, and the National Hockey League. Our proprietary technology provides direct-to-consumer video solutions, especially for live events with high viewership, offering viewers high-quality visuals any time and on any device.</p><p>Build and Release Engineer - New York, NY We are looking for a Ruby Engineer to join our Apple &amp; Android Platforms Core Engineering team. This is an opportunity to help build tooling around industry leading apps while getting to work closely with some of the greatest minds in the app development world. If working in a collaborative team environment and facing new challenges every day while your apps get used by millions of people excites you, then this is the role for you.</p><p>We believe we offer a unique opportunity for any technologist:</p><ul><li>The opportunity to work on a bleeding edge and ever growing technology stack.</li><li>The opportunity to work with a world-class team of software and systems engineers.</li><li>The opportunity to work on award-winning, highly complex apps and systems.</li><li>The opportunity to work in a highly collaborative team environment.</li><li>The opportunity to face new challenges and reap new rewards every day.</li><li>Amazing benefits including - 100% employer-paid Medical, Dental and Vision.</li></ul><p><strong><em>This permanent position is located in New York, NY or remote.</em></strong></p><p><strong>Responsibilities</strong></p><ul><li>Work with the Build and Release Manager, engineering leads, project managers, and QA leads to manage build and release processes across multiple applications simultaneously.</li><li>Help manage continuous integration process for iOS, tvOS, Android, Android TV and Fire Tablet/TV platforms.</li><li>Help maintain and grow build management systems (Jenkins, scripts, build servers, tools, etc.).</li><li>Continuously work to improve the efficiency and scalability of our build and release processes and environments.</li><li>Help automation and mobile engineers build and maintain testing systems for all applications.</li><li>Help application engineers maintain lint, unit test, code coverage reports, and other app health.</li></ul><p>Tools</p><ul><li>Build custom tools to improve the development process and automate tasks.</li><li>Research and develop improvements to our Continuous Integration system.</li><li>Stay connected to emerging technologies in the build and release industry.</li></ul><p><strong>Basic Qualifications</strong></p><ul><li>1+ years experience with the Ruby language.</li><li>2+ years experience with any Object Oriented language.</li><li>Strong understanding of continuous integration principles and practices.</li><li>Excellent understanding of the software development lifecycle.</li><li>Excellent communication and collaborative skills, be a team player.</li><li>Knowledge of stateless servers.</li><li>Passion for DevOps.</li></ul><p><strong>Preferred Qualifications</strong></p><ul><li>Knowledge of Ansible or equivalent strongly preferred.</li><li>Knowledge of containerization using Docker or equivalent preferred.</li><li>Knowledge of Amazon Web Services preferred.</li><li>Knowledge of Test Driven Development (TDD) preferred.</li></ul><p><strong>Company Overview</strong></p><p>BAMTECH is a streaming technology joint venture between The Walt Disney Company, Major League Baseball Advanced Media, and the National Hockey League. BAMTECH handles streaming for numerous partners, some of which include, HBO, MLB, NHL, Eurosport, ESPN, and World Wrestling Entertainment. Fans demand access to content on their own terms on any device, anytime, anywhere. We are those fans. As a result, the BAMTECH Media team helped pioneer live event streaming over the Internet in 2002 for Major League Baseball. The passion to improve that experience led to many impressive firsts: the first 720p or “HD Ready” stream, the consecutive record for concurrent streams and the first stream in 8K ultra HD. Today, BAMTECH has a proven, scalable platform that powers direct-to-consumer applications for leading entertainment brands; and is now a major player in sports and eSports rights acquisition.</p><p><strong>Additional Information</strong></p><p><em>This position is a legal entity of BAMTECH LLC, an equal opportunity employer.</em></p></dd>          <dt></dt>            <dd>              <p>                              </p>            </dd>          <dt><span>Country</span></dt>          <dd><p>Anywhere</p></dd>        </dl>",
    "urlFetchPending": false,
    "published": "Feb 21, 2018 6:00:03 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/ruby",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "ruby"
    ]
  },
  {
    "id": "lFsdFtuCSCGc0p2samUrog",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168467/senior-data-integration-engineer-dba-compucorp-ltd?a=UuUDYlqfG9y",
    "title": "Senior Data Integration Engineer (DBA) at Compucorp Ltd. (London, UK) ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior, Lead</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>System Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>CRM, Information Technology, Non-Profit</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Are you a data nerd? If so we want you!</p><p>We like to build stuff… sometimes complicated stuff… for Non Profits, Charities and Art Galleries. We’re on the lookout for a confident and ambitious&nbsp;Data integration specialist&nbsp;to join our fast growing startup to help us build and automate complex data integrations for our clients and platforms.</p><p>We do things a little differently, basing all our solutions on open source products, offer a great work-life balance with flexible working hours and a real team mentality.</p><p>Our work covers web design, app development and branding for Charities and non-profit organisations across the country. Our clients include Charities such as Wikimedia and Farm Africa, art galleries such as the Photographers Gallery and Craft Central but also companies, trade associations and government bodies.</p><p>The role will comprise of 2 main elements. Most of our projects will involve a degree of data integration or migration and so we are looking to have a dedicated DBA to work on these elements of the projects. We want to develop an automated and scalable architecture that can be used in a flexible way across large client projects.</p><p>The other element of the role will be to be part of the infrastructure team in a devops/sysadmin capacity. You would also become a key architect in helping us to develop a robust SAS platform for a major SaaS product we are developing for Non Profit Organisations around the world.</p><p>The ideal candidate will have:</p><ul><li>Excellent SQL skills&nbsp;&nbsp;</li><li>Experience of using ETL (Extract Transform and Load) tools such as Pentaho or equivalent&nbsp;</li><li>Confidence in a Linux &amp; PHP (LAMP/LEMP) Environment</li><li>Experience of other programming languages such as Python, PHP or Java (or a willingness to learn).</li><li>Previous experience with CI/DevOps tools platforms (i.e. Jenkins, Chef, Puppet, Ansible).</li><li>Is&nbsp;meticulous and loves documentation!</li><li>Is a&nbsp;real team player who likes to muck in and get the job done!</li></ul><p>What were looking for is someone who can grasp concepts quickly, has great attention to detail, and most importantly loves a tech challenge. In short, we’re a young team of self confessed geeks who love tinkering and tweaking until something is just right and are looking for someone who thinks and acts like us.</p><p>If you live and breath SQL and know your left joins from your inner joins&nbsp;then we would love to hear from you.</p><p><strong>Location</strong></p><p>At Compucorp we are a distributed team and we welcome people to join us from all around the world, however as a UK based Company some overlap with UK hours will be required. By default you should assume that your working hours would be +/- 3h max from GMT start times of 9.00AM&nbsp;UK start time. There is some flexibility in this but please be aware that staff members starting outside of these hours are rare and as such if you would expect these hours to be an issue for you then we would not suggest that you apply.&nbsp;</p><p>For the&nbsp;Data Engineer role, due to EU data protection requirements, the team member must be from either an EEA country or a country that the EU considers to have adequate level of data protection. The list can be found at the link below:</p><p><a href='https://ico.org.uk/for-organisations/guide-to-data-protection/principle-8-international#eea-countries' rel='nofollow'>https://ico.org.uk/for-organisations/guide-to-data-protection/principle-...</a></p>                    </div>                            <h2>                About Compucorp Ltd.            </h2>            <div><p>We&nbsp;like&nbsp;to&nbsp;build&nbsp;stuff,&nbsp;sometimes&nbsp;complicated&nbsp;stuff,&nbsp;for&nbsp;people&nbsp;who&nbsp;like&nbsp;to&nbsp;make&nbsp;a&nbsp;difference. We&nbsp;do&nbsp;things&nbsp;a&nbsp;little&nbsp;differently,&nbsp;basing&nbsp;all&nbsp;our&nbsp;solutions&nbsp;on&nbsp;open&nbsp;source&nbsp;products,&nbsp;having&nbsp;flexible&nbsp;working hours&nbsp;and&nbsp;a&nbsp;real&nbsp;team&nbsp;mentality. We're&nbsp;passionate&nbsp;about&nbsp;the&nbsp;platforms&nbsp;we&nbsp;work&nbsp;with&nbsp;and&nbsp;the&nbsp;communities&nbsp;which&nbsp;we&nbsp;are&nbsp;part&nbsp;of. Our&nbsp;work&nbsp;covers&nbsp;web&nbsp;design,&nbsp;app&nbsp;development&nbsp;and&nbsp;branding&nbsp;for Art Galleries, Charities&nbsp;and NGO&nbsp;organisations&nbsp;across&nbsp;the&nbsp;country.&nbsp;</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible working hours                            </div>                            <div>                                 UK Visa Sponsorship                            </div>                            <div>                                 Remote working                            </div>                            <div>                                 Flexible holidays                            </div>                            <div>                                 Training and development                            </div>                            <div>                                 Contribute to Open Source projects                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 18, 2018 11:18:35 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/integration",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "QTsEQeDPTFGRNZmw9k9iMQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/168495/engineer-integrations-auth0?a=UvuJX2uIsta",
    "title": "Engineer, Integrations at Auth0  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, IT Security, Software Development / Engineering</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>201-500 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>Auth0 provides the simplest and most secure identity platform for developers to make the internet safer. We believe in crafted software, in end-to-end ownership of projects and hyper-fast iterations. The company continues to grow rapidly and services major startups and enterprise customers. We are processing hundreds of millions of logins for thousands of customers from startups to big organizations.</p><p>We are looking for an engineer to join our Integrations team to help us enhance our existing product and add new features. The Integrations Engineer is responsible for solving complex challenges related to communications between multiple systems, in an effort to provide customizability to the authentication pipeline and expand the existing feature set through third-party services. The role will act as a liaison between internal teams and external services.&nbsp;</p><p><strong>We:</strong></p><ul><ul><li>Are remote-by-design. Work from anywhere, your office is The Internet (but we also have physical locations around the world).</li><li>Are obsessed with delivering customer value. Everything we do assumes we only succeed if our customers do.</li><li>Trust and respect each other. Building a new product is like hacking a new path through the jungle. We’ve got your back. We expect the same from you. We respect our differences and use them to our advantage.</li><li>Hold ourselves to high standards. We take pride in work done well, and constantly push ourselves towards personal betterment.</li><li>Are collaborative in nature. We believe a team is bigger than the sum of its parts.</li><li>Innovate through experiments, failure, and learning. Failure is part of our process, no blame attached.</li><li>Are transparent. We are making an explicit effort to share all data relevant to the making of better decisions. No politics. &nbsp;</li><li>Are passionate. Our common driver is trying to accomplish something meaningful.</li></ul></ul><p><strong>You will:</strong></p><ul><ul><li>Design, build, and maintain extensibility solutions for internal and external services.</li><li>Debug production issues across multiple levels of our stack.</li><li>Collaborate with fellow engineers to build new features at large-scale.</li><li>Refine engineering practices, standards, and tooling.</li></ul></ul><p><strong>You might work on:</strong></p><ul><ul><li>Adding new extensibility points to our platform (think Rules, Hooks, and Extensions).</li><li>Creating new Auth0 Extensions that expand the capabilities of the product.</li><li>Distributed systems that need to communicate well and maintain high availability.</li></ul></ul><p><strong>You might be a good fit for this role if you:</strong></p><ul><ul><li>Have a history of developing and supporting intuitive and robust extensibility solutions.</li><li>Are familiar with the challenges and approaches for designing interconnected, scalable systems.</li><li>Take an iterative approach to development, dividing long-term goals into incremental milestones.</li><li>Thrive in a fast-paced and collaborative environment.</li><li>Have familiarity with the tools we currently use, such as NodeJS, React/Redux, and MongoDB. However, we always try to use the best tool for the job, therefore we care more about your general engineering skill than knowledge of a particular language or tool.</li><li>Have experience working in a remote-first organization.</li><li>Place a high value on security.</li></ul></ul><p>It’s not expected that a single candidate has expertise in all these areas. We’re looking for professional engineers, who can quickly learn and adapt as our systems and situation changes, rather than candidates with a rigid skill set.</p><p>You can learn more about our hiring process&nbsp;<a href='https://auth0.com/blog/how-we-hire-engineers/' rel='nofollow'>here</a>.</p><p>Auth0 is an Equal Employment Opportunity employer. Auth0 conducts all employment-related activities without regard to race, religion, color, national origin, age, sex, marital status, sexual orientation, disability, citizenship status, genetics, or status as a Vietnam-era special disabled and other covered veteran status, or any other characteristic protected by law. Auth0 participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.</p>                    </div>                            <h2>                About Auth0            </h2>            <div><p>Auth0 provides an enterprise-grade platform that secures billions of log-ins every year. The company makes it easy to implement even the most complex identity solutions for their web, mobile, IoT and internal applications, as well as sophisticated identity management for employees, customers and partners. Auth0 has raised over $54 million from Meritech Capital, NTT DoCoMo, Trinity Ventures, Bessemer Venture Partners, K9 Ventures, Silicon Valley Bank, Founders Co-Op, Portland Seed Fund and NXTP Labs.</p><p>Thousands of enterprises and millions of users worldwide depend on Auth0 for authentication and authorization of their most mission-critical apps, APIs and IoT devices. Auth0’s top priorities are availability and security.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Competitive Equity                            </div>                            <div>                                 Free Nespresso                            </div>                            <div>                                 Top-of-the-Line Macbooks and other great tools                            </div>                            <div>                                 Embrace Distributed Work                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 18, 2018 11:18:35 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "_L0n4WKCS-WzC2Cb3TN_9A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/156656/integrations-engineer-cxt-software?a=QxkouNJeFzy",
    "title": "Integrations Engineer at CXT Software (Phoenix, AZ)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Information Technology, Software Development / Engineering, Transportation</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>CXT Software, a leader in providing automation technology to expedited delivery and distribution businesses, is seeking an Integrations Software Engineer with solid server and web service based development experience using Microsoft tools, including C#, WCF, MS SQL Server. Join a talented team of software professionals to enhance, maintain, and support our market-leading software products.</p><p>Position Scope</p><ul><li>Intelligent, dedicated, and eager to learn.</li><li>High level of proficiency with software, databases, networking, and hardware.</li><li>Highly motivated, hands-on, and results-oriented.</li><li>Comfortable in a small team environment using Agile methodologies.</li><li>Ability to efficiently solve problems and implement code for time-sensitive engineering projects.</li><li>Experience working in a remote environment.</li></ul><p>Position Responsibilities</p><ul><li>Design and develop challenging two way integrations with proprietary software platforms using web services, file transfer protocols, and industry-standard formats such as X12 EDI, XML, JSON and flat files.</li><li>Design and implement web service based business processes for an enterprise-level software platform.</li><li>Provide tier-4 technical support to internal and external customers.</li></ul><p>Candidate Requirements</p><ul><li>Solid working knowledge in developing C# and service oriented business applications.</li><li>Solid working knowledge of X12 EDI, XML, JSON, and RESTful web services.</li><li>Knowledge of MS SQL Server including stored procedures, triggers, database design, and ADO.</li><li>Working knowledge of performance monitors and debugger tools.</li><li>Must have an work space that is free of distractions.</li></ul><p>Candidate Desired Qualities</p><ul><li>Experience with data integration platforms and EDI.</li><li>Experience in use of WCF for web services a plus.</li><li>Working knowledge of unit testing using Microsoft test.</li><li>Ability to read and understand programs written in Visual Basic 6.0.</li><li>Experience with JIRA, Git and SVN.</li></ul>                    </div>                            <h2>                About CXT Software            </h2>            <div><p>&nbsp;CXT Software Benefits:</p><p>CXT Software offers competitive pay, 401(k) with 3% of salary company match, paid vacations, holiday and personal time pay, and medical/dental benefits.</p><p>&nbsp;Note to Applicants:</p><p>&nbsp;CXT Software is an equal opportunity employer.&nbsp; We value the diversity of our workforce.&nbsp; No third parties please.&nbsp; We are unable to sponsor H1b applicants at this time.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 9 Paid Holidays Per Year                            </div>                            <div>                                 Personal and Vacation Time                            </div>                            <div>                                 Company contributes 80% of the Employees Medical Insurance Premium                            </div>                            <div>                                 Remote Working                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 2:27:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "ip3P2FTLSEyD-dkWf9MaIA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/128492/build-and-release-engineer-gradle-expert-elastic?a=H5Ixo1rLnFu",
    "title": "Build and Release Engineer - Gradle Expert at Elastic ()",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Data &amp; Analytics, Search, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>501-1k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>At Elastic, we have a simple goal: to solve the world's data problems with products that delight and inspire. As the company behind the popular open source projects — Elasticsearch, Kibana, Logstash, and Beats — we help people around the world do great things with their data. From stock quotes to real time Twitter streams, Apache logs to WordPress blogs, our products are extending what's possible with data, delivering on the promise that good things come from connecting the dots. The Elastic family unites employees across 30+ countries into one coherent team, while the broader community spans across over 100 countries.</p><p>Do you want to work on distributed search and analytics software which impacts the lives of millions of people? We are looking for an outstanding build/release engineer who loves solving problems. We’re not interested in your previous job title. Instead, we are looking for bright people with a deep knowledge and love of shipping software with a desire to take on new challenges.</p><p><strong>Engineering</strong>&nbsp;<strong>Philosophy</strong></p><p>Engineering a highly complex distributed system that is easy to operate via elegantly designed APIs is a non-trivial effort. It requires solid software development skills, and more importantly, a sharp mind and the ability to think like a user. We also care deeply about giving you full ownership of what you’re working on. Our company fundamentally believes great minds achieve greatness when they are set free and are surrounded and challenged by their peers, which is clearly visible in our organization. At Elastic, we effectively don’t have a hierarchy to speak of. We feel that anyone needs to be in the position to comment on absolutely anything, regardless of their role within the company.</p><p>Right now, we are looking to add a talented&nbsp;<strong>Build/Release</strong>&nbsp;<strong>Engineer</strong>&nbsp;to join our&nbsp;<strong>Elasticsearch</strong>&nbsp;team and focusing on the build infrastructure of Elasticsearch.</p><p><strong>What</strong>&nbsp;<strong>you</strong>&nbsp;<strong>will</strong>&nbsp;<strong>be</strong>&nbsp;<strong>doing</strong></p><ul><li>Managing the build and release process for Elasticsearch</li><li>Working with the internal infra team on Elasticsearch CI</li><li>Simplifying and automating developer workflows</li><li>Keeping abreast of tool chain changes (e.g., improvements in Gradle, the JDK, etc.) and adapting the Elasticsearch build accordingly</li><li>Collaborating in open source with the ES team and the Elastic Stack users</li></ul><p><strong>What</strong>&nbsp;<strong>you</strong>&nbsp;<strong>will</strong>&nbsp;<strong>bring</strong>&nbsp;<strong>along</strong></p><ul><li>Deep knowledge of at least one build system (preferably Gradle) and one CI system (preferably Jenkins)</li><li>Experience managing large builds</li><li>Practical experience routinely shipping production software</li><li>Follows JDK mailing lists</li></ul><p><strong>Plus</strong>&nbsp;<strong>ideally</strong></p><ul><li>Experience deploying and operationalizing software in production</li><li>Knowledge of packaging (like RPM / Debian) and experience with Docker</li><li>Strong shell skills</li><li>Strong on Java/Groovy in general</li><li>Tenacity towards problem solving</li></ul><p><strong>Additional</strong>&nbsp;<strong>Information</strong></p><ul><li>Competitive pay and benefits</li><li>Stock options</li><li>Catered lunches, snacks, and beverages in most offices</li><li>An environment in which you can balance great work with a great life</li><li>Passionate people building great products</li><li>Employees with a wide variety of interests</li><li>Your age is only a number. It doesn't matter if you're just out of college or your children are; we need you for what you can do.</li></ul>                    </div>                            <h2>                About Elastic            </h2>            <div><p><strong>Additional Information</strong></p><ul><li>Competitive pay and benefits</li><li>Stock options</li><li>Catered lunches, snacks, and beverages in most offices</li><li>An environment in which you can balance great work with a great life</li><li>Passionate people building great products</li><li>Employees with a wide variety of interests</li><li>Your age is only a number. It doesn't matter if you're just out of college or your children are; we need you for what you can do.</li><li>Distributed-first company with employees in over 30 countries, spread across 18 time zones, and speaking over 30 languages! Some even fly south for the winter :)</li></ul><p>Elastic is an Equal Employment employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status or any other basis protected by federal, state or local law, ordinance or regulation. Elastic also makes reasonable accommodations for disabled employees consistent with applicable law.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 401k Matching Up to 6 % in US and Pensions in some other countries                            </div>                            <div>                                 Health Care Insurance                            </div>                            <div>                                 Vacation Time Determined By Location                            </div>                            <div>                                 Lunch and Breakfast in Most Offices                            </div>                            <div>                                 100% Remote work possible                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java"
    ]
  },
  {
    "id": "17cMkC11S2mjDxSCW2iP8Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/131074/build-release-engineer-at-elastic-elasticsearch-elastic?a=HXp915iI6gE",
    "title": "Build/Release Engineer at Elastic (Elasticsearch) at Elastic ()",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Full Stack Developer, Frontend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Data &amp; Analytics, Search, Software Development / Engineering</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>501-1k people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><span>Elastic is building out our Elastic Cloud Team focusing on Elastic as a Service. This is a great opportunity to help lead our Cloud efforts and make an immediate impact to our strategy and implementation.</span></p><p><span>Our cloud product allows users to create new clusters or expand existing ones easily This product would be built on technologies such as OpenStack, AWS, Docker, and others to enable the Operations Teams to easily create and manage multiple Elastic Clusters.</span></p><p><strong>Job Duties and Requirements</strong></p><ul><li><span>Work closely with Elastic’s engineering teams (like Elasticsearch, Kibana, Logstash and Beats) to plan releases on Cloud’s infrastructure</span></li><li><span>Add automation to continuously deploy nightly snapshot releases and release candidates to staging/production environments</span></li><li><span>Managing git branching processes and automation </span></li><li><span>Managing the scala sbt/make build framework for Cloud</span></li><li><span>Collaborate with the infra team on CI workflows</span></li><li><span>Simplifying and automating developer workflows</span></li></ul><p><strong>Qualifications</strong></p><ul><li><span>Experience or familiarity with Docker</span></li><li><span>Experience in automating release deployments in SaaS infrastructure</span></li><li><span>Deep knowledge of at least one build system (preferably sbt) and one CI system (preferably Jenkins)</span></li><li><span>Strong knowledge and experience with git and git workflows</span></li><li><span>Good working knowledge of Unix based operating systems</span></li></ul><p><em><strong>Please include a short note as to why you are a fit for the role and why working at Elastic interests you :)</strong></em></p>                    </div>                            <h2>                About Elastic            </h2>            <div><p>Elastic is the world's leading software provider for making structured and unstructured data usable in real time for search, logging, security, and analytics use cases. Founded in 2012 by the people behind the Elasticsearch, Kibana, Beats, and Logstash open source projects, Elastic's global community has more than 80,000 members across 45 countries, and since its initial release. Elastic's products have achieved more than 100 million cumulative downloads. Today thousands of organizations, including Cisco, eBay, Dell, Goldman Sachs, Groupon, HP, Microsoft, Netflix, <em>The New York Times</em>, Uber, Verizon, Yelp, and Wikipedia, use the Elastic Stack, X-Pack, and Elastic Cloud to power mission-critical systems that drive new revenue opportunities and massive cost savings. Elastic is backed by more than $104 million in funding from Benchmark Capital, Index Ventures, and NEA; has headquarters in Amsterdam, the Netherlands, and Mountain View, California; and has over 400 employees in more than 30 countries around the world.</p><p><strong>Additional Information</strong></p><ul><li>Competitive pay and benefits</li><li>Stock options</li><li>Catered lunches, snacks, and beverages in most offices</li><li>An environment in which you can balance great work with a great life</li><li>Passionate people building great products</li><li>Employees with a wide variety of interests</li><li>Your age is only a number. It doesn't matter if you're just out of college or your children are; we need you for what you can do.</li></ul><p>Elastic is an Equal Employment employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status or any other basis protected by federal, state or local law, ordinance or regulation. Elastic also makes reasonable accommodations for disabled employees consistent with applicable law.</p><p>Elastic is an Equal Employment employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status or any other basis protected by federal, state or local law, ordinance or regulation. Elastic also makes reasonable accommodations for disabled employees consistent with applicable law.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 401k Matching Up to 6 % in US and Pensions in some other countries                            </div>                            <div>                                 Health Care Insurance                            </div>                            <div>                                 Vacation Time Determined By Location                            </div>                            <div>                                 Lunch and Breakfast in Most Offices                            </div>                            <div>                                 100% Remote work possible                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/integration",
      "TZ/America/East"
    ],
    "tagsNames1": [
      "US East time zone"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "2zeQevypSqq_5-WdkH2OlQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/164747/accounts-and-integration-developer-bigchange-apps-ltd?a=TfyYu300Ipy",
    "title": "Accounts and Integration Developer at BigChange Apps Ltd (Leeds, UK)",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Mid-Level, Senior</span>                                        </div>                                        <div>                                            <span>Industry: </span>                                            <span>CRM, SaaS, Vehicle Tracking</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Company size: </span>                                            <span>11-50 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>Private</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p><strong>Technologies</strong></p><p>.net&nbsp;c# AWS SQL Server</p><p><strong>Job Description</strong></p><p>We are looking for a skilled developer who wants to be part of a growing company where they can design and deliver great, high quality, innovative software. This doesn't mean you have been working on the industry for years and years - just that you're really good at your job.</p><p><strong>Profile</strong></p><ul><li>Loves writing code to solve problems</li><li>Interested in the latest developments in .NET and development in general</li><li>Flexible enough to get requirements from customers and see it all the way through to release</li><li>Open minded about approach or the technology to use for each problem</li><li>Wants to work with the latest cloud based solutions</li><li>Deep knowledge of C#, SQL,</li><li>Preferably experience of cloud solutions, mobile, Big Data (and probably lots more)</li><li>Eager to share knowledge with the rest of the small, dedicated but geographically diverse team</li><li>Accounting integration experience, preferably with Sage 50 / 200 / Xero / Quickbooks and more</li></ul><p><strong>Advantages</strong></p><ul><li>Flexible working hours</li><li>The convenience of working from home (but feel free to come to the office anytime you want)</li><li>Working with the latest releases&nbsp;</li><li>The chance to influence our next steps and build something really different</li><li>New diverse challenges&nbsp;regularly</li><li>Anything else: just ask!</li></ul><p><strong>About BigChange Apps Ltd</strong></p><ul><li>BigChange are a UK based technology company specialising in Mobile Resource Management Software. We have developed in-house a SAAS system that enables businesses to improve operational efficiency and all paperwork from field operations.</li><li>We are growing by 80% year on year and have plans to grow globally in 2018</li><li>Our Founder and CEO is an Entrepreneur who values providing excellent service to our customers</li><li>We have a fantastic product… No honestly it’s brilliant.</li><li>Our customers love us</li></ul>                    </div>                            <h2>                About BigChange Apps Ltd            </h2>            <div><p><strong>About BigChange Apps Ltd</strong></p><ul><li>BigChange are a UK based technology company specialising in Mobile Resource Management Software. We have developed in-house a SAAS system that enables businesses to improve operational efficiency and all paperwork from field operations.</li><li>We are growing by 80% year on year and have plans to grow globally in 2018</li><li>Our Founder and CEO is an Entrepreneur who values providing excellent service to our customers</li><li>We have a fantastic product… No honestly it’s brilliant.</li><li>Our customers love us</li></ul>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from Home                            </div>                            <div>                                 Flexible time                            </div>                            <div>                                 Family culture                            </div>                            <div>                                 Latest technology                            </div>                    ",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 1:12:53 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/dotnet",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "dotnet"
    ]
  },
  {
    "id": "-vxgLLudSWuRTk9oi7BA9A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16288831",
    "title": "Integration Platform Developer Location: Bangalore Position summary: Join the Adobe I/O Events team (part of Adobe I/O) ...",
    "content": "<div>                  <span>Integration Platform DeveloperLocation: Bangalore<p>Position summary: Join the Adobe I/O Events team (part of Adobe I/O) and contribute to the building of new Generation Adobe Developer Platform. Help build the various components of our stack: event management, serverless runtime, monitoring, operations, analytics, connectors to third party services. Work with product teams across the three Adobe clouds to identify and fill gaps in exposed APIs and events from their services. And much, much more!</p><p>If you are interested, email Yuvaraj at mande@adobe.com with your resume and any questions you may have!</p><p><a href='https://adobe.wd5.myworkdayjobs.com/en-US/external_experienced/job/Bangalore/Integration-Platform-Developer_59047' rel='nofollow'>https://adobe.wd5.myworkdayjobs.com/en-US/external_experienc...</a><span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 9:00:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/integration",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  }
]
}
