{
 "items": [
  {
    "id": "PO0H2H09T7WyrjYKy3aAgg",
    "url": "https://cjl.ist/2Do4oFT",
    "title": "Security Solutions Engineer",
    "tags": [
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "DBG_TECH1:k/t/w:android-studio/mobile/5",
      "DBG_TECH1:k/t/w:android/java/4",
      "DBG_TECH1:k/t/w:android/mobile/8",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:c/c/5",
      "DBG_TECH1:k/t/w:eclipse/java/1",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=13, mobile=16, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=7, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/c",
      "TECH1/mobile",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "c",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 23, 2018 8:05:16 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Security Solutions Engineer</h2>   Location:    San Francisco Bay Area  <div>  Role and job type: Other… Full-time </div> <div>  <h3>Job Description</h3>  <p>You will be working closely with Business Development, Product Management and Engineering and responsible for providing technical support for Rivetz clients. From the solutions perspective, this includes creating and delivering presentations of Rivetz products, gathering technical requirements, creating test plans and enabling solutions with Rivetz technology. You will work closely with customers as their primary point of contact for feedback and resolution of issues and be the customers’ advocate with Rivetz support teams. You will provide feedback to Product Management on new feature requests and product enhancements from your prospect and customer base.</p>  <p>This technically oriented position will also provide support for developers and designers who are utilizing our Software Development Kit (Toolkit) in both mobile and server-based applications. You will provide support services and incident management via email, web and telephone and face to face with client. Responsibilities include first line interaction with developers, setting and managing customer expectations, timely communication, performance and process improvement, troubleshooting, trending and resolving complex support cases.</p>  <p>Responsibilities<br>General</p>  <ul>   <li>Drive the entire technical dialogue from initial customer engagement to closed sales (and in some cases through delivery and ongoing account management).</li>   <li>Develop and Deliver technical product presentations to prospects and existing customers.</li>   <li>Act as the customer’s focal point for all technical matters relating to requirement definition, architectural design, proof of concept implementation and deployment.</li>   <li>Become the Rivetz subject matter expert understanding applications that can be enabled with Toolkit and act as our consultant regarding suggested uses of Toolkit</li>   <li>Work with engineering, business development and product management to prioritize Customer requested enhancements</li>   <li>Assist through release cycles in testing new features, enhancements, verify bug fixes and provide test versions to the customer when applicable.</li>   <li>Develop sample applications that utilize the Toolkit / SDK and demonstrate possible uses.</li>   <li>Monitor and support email and phone Toolkit support requests</li>   <li>Log and track all customer issues including defects and feature requests. Participate in strategic and tactical account planning.</li>  </ul>  <p>Qualifications</p>  <ul>   <li>Languages: C/C++, Java, Groovy.</li>   <li>Technologies: Trusted Computing, Global Platform, Blockchain.</li>   <li>Platforms: Android, iOS.</li>   <li>Tools: GitHub, Eclipse, Android Studio, AWS.</li>   <li>Customer facing experience.</li>   <li>Experience in developing and delivering technical/solution presentations.</li>   <li>BSc OR MSc in Computer Science or Electrical Engineering or equivalent work experience.</li>   <li>Excellent social skills and willingness to work in a collaborative team environment.</li>  </ul>  <p>Awesome to Have</p>  <ul>   <li>Interest and/or experience in digital currency/blockchain/decentralization.</li>   <li>Mobile security experience</li>   <li>Cybersecurity knowledge</li>   <li>IoT Security experience</li>   <li>Android / mobile development experience</li>  </ul>  <h4>Salary range</h4>  <p>DOE plus equity</p> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Hhy_qYk9S0Ccnuijsq41Bg",
    "url": "http://www.indeed.co.uk/viewjob?t=Senior+SQL+Developer&jk=b67d8a442160fd6d&",
    "title": "Senior SQL Developer | Swansea (Remote Working Options) - Opus Recruitment Solutions - Swansea",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "£",
      "minValue": 50000,
      "maxValue": 60000,
      "info": "Permanent",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 21, 2018 10:30:36 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "IoyWbPVYTDOyT-KwXIeChw",
    "url": "https://stackoverflow.com/jobs/203096/information-security-lead-surevine?a=166WUr1IPtnO",
    "title": "Information Security Lead at Surevine (London, UK) ",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=2, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=2, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/apple",
      "TECH1/mobile",
      "TITLE1/solution",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "apple",
      "mobile"
    ],
    "hiringOrganization": {
      "name": "Surevine",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "£",
      "minValue": 45000,
      "maxValue": 60000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 21, 2018 1:06:09 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Information Security Lead</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior, Lead</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>System Administrator</span>                                    </div>                            </div>                    </div>                <div>Company: Surevine | London, UK<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                            <div>                                    <span>Preferred Timezone:</span>                                    <span>(GMT+00:00) London </span>                                </div>                                                            <div>                                    <span>Office Location:</span>                                    <span>London, UK.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div>security</div><div>web-services</div><div>cloud</div><div>iso</div><div>audit</div>                <h3>Job description</h3>                <div><p><strong>UK APPLICANTS ONLY</strong></p><p><em><strong>Description</strong></em></p><p>Security is at the heart of what Surevine do and our Information Security Lead is responsible for keeping us honest to that. Responsible for the development, implementation, delivery and support of our Information Security Management System (ISMS), they will ensure Security doesn’t become a tick-box exercise in compliance, but remains aligned with the strategic requirements of the business, through the promotion of a security awareness culture throughout the business and an active programme of training, audits and exercises.</p><p>This role is ultimately to ensure protections are in place, and being continually monitored and improved, to ensure the business minimises security threats and our security culture is externally benchmarked to meet or exceed the appropriate standards to demonstrate our security stance to the business’ stakeholders, e.g. maintaining ISO27001 and Cyber Essentials Plus certification.</p><p><em><strong>Skills and experience</strong></em></p><p><em>Essential</em></p><ul><li>You will have carried out audits and have many examples of actioning any non-compliances or making improvements through effective training, processes and systems, e.g. you have completed ISO27001 audits and actioned observations</li><li>You will have defined and run exercises that test people, processes and tools are complying with a Security Information Management System and more generally ensuring a system is in place that is effective against a documented set of potential threats</li><li>You have maintained and run an effective Incident Management process responding to security incidents quickly and ensure continuity of the business or organization</li><li>You will be a sensitive and sophisticated communicator, able to adapt your interactions to allSurevine stakeholders, including the board, in a way that is accessible to both technical and non-technical customers, employees, contractors, partners and board memberS</li><li>You will be able to demonstrate highly experienced managerial skills required to expertly manage the security programmes, projects and initiatives you will lead.</li></ul><p><em>Highly-Desirable</em></p><ul><li>You will have a deep understanding of software, platform and infrastructure cloud services (particularly Amazon Web Services) and the implications of using such services to support the business and its customers</li><li>You will be able to support an estate of mainly Apple end-user devices, e.g. Macs and iOS devices, used to connect to typically cloud-based services by our remote workers.Information Security Lead</li></ul><p><em><strong>Responsibilities</strong></em></p><ul><li>Ensure the right tools, processes and culture is in place to maintain and continue to build on our living Information Security Management System</li><li>Maintain an accurate risk register for the business, ensuring effective treatments are in place for risks and communicating an accurate picture of the risk profile to the board as required, e.g. at board meetings</li><li>Complete the necessary audits to maintain our ISO27001 certification and build on our Information Security Management System to incorporate aspects of other relevant standards, to include our current Cyber Essential Plus certification</li><li>Be the main point-of-contact for external accreditation bodies ensuring our certifications are maintained</li></ul>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/203096?reset=False&amp;ra=166WUr1IPtnO&amp;oqs=a%3D166WUr1IPtnO' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About Surevine</h3>            <div><p>Surevine builds secure, scalable collaboration solutions for the most security conscious organisations; joining people up and enabling collaboration on their most sensitive information. Our systems are accredited to handle the most sensitive information, whilst still delivering an intuitive and engaging user experience which actively promotes participation; building smart, secure networks of connected people. Our own smart research and development and customer sponsored R&amp;D into collaboration technology delivers constant innovation, building products born out of genuine user needs.</p><p><strong>Reasons to join</strong></p><ul><li>Opportunity to work amongst a team of exceptional developers working on and with the latest technologies</li><li>Be part of an agile, delivery-focussed team with daily stand-ups, fortnightly sprints, and retrospectives</li><li>Our belief in self-managed teams and reliance on self-motivated people</li><li>Our Director’s aren’t hidden away. They are accessible and involved. They are our co-workers</li><li>Chance to work in an fast-moving innovative environment with some tough problems for you to help us solve</li><li>Everyone is provided with a budget to kit out their workspace and make it cooler and more productive than they would ever get in a corporate cube</li><li>We don’t wear suits (often)</li></ul>            </div>        ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "iEYy1WzpSNOV32rkeX-CAg",
    "url": "https://www.remotejobr.com/jobs/security-privacy-and-compliance-manager",
    "title": "Security, Privacy and Compliance Manager",
    "tags": [
      "DBG:surround``OR(you,we,employe,develop,engin,abl,workmat) 2W work 2W from 2W home",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 21, 2018 7:25:43 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div>        </div>                            <h2>Security, Privacy and Compliance Manager</h2>                            <p>      </p><p>  <strong>Headquarters:</strong> U.S.A    <br><strong>URL:</strong> ww.scheduleonce.com</p><div><span></span></div><div><span></span></div><div>We are looking for a Security and Compliance Manager to lead our security and compliance efforts and support our rapid growth within the Enterprise market. Candidates should have the potential to serve as ScheduleOnce's top authority on all security and compliance matters.&nbsp;</div><div><br></div><div> <strong>Please note:</strong><br> </div><ul> <li>ScheduleOnce operates virtually and all employees work remotely from home.</li> <li>Urgent security and privacy incidents may require out-of-hours responses, including nights and weekends.&nbsp;</li> </ul><div><br></div><div><strong>Roles and responsibilities</strong></div><ul> <li>Ensure compliance with security and privacy frameworks (PCI, HIPAA, GDPR, etc.)</li> <li>Define security policies and controls in line with SOC2, ISO27001 and NIST standards</li> <li>Suggest and implement continuous improvements to ScheduleOnce security through an ongoing risk management process</li> <li>Manage security of production and QA environments</li> <li>Manage IT and security of employee devices across a geographically distributed team</li> <li>Develop and deliver training and security awareness programs to employees</li> <li>Provide an information security perspective on compliance with client agreements</li> <li>Develop security policies and standards and ensure they are implemented and followed</li> <li>Ongoing monitoring of the company’s security and compliance health on all fronts</li> <li>Act as a subject matter expert on security and privacy throughout the product development lifecycle</li> <li>Define and manage the company’s security and compliance roadmap</li> </ul><div></div><div><br></div><div><strong>Requirements:</strong></div><div><br></div><ul> <li>2 years of experience in a relevant role&nbsp;</li> <li>Information security certification is an advantage (CISSP or CISM)&nbsp;</li> <li>Experience with security and privacy frameworks (SOC2, ISO27001, HIPAA, PCI, NIST, CSA, EU Privacy Shield)</li> <li>Experience writing professional requirements and policy documents</li> <li>Experience with cyber security concepts, protocols, processes, architectures and tools&nbsp;</li> <li>Excellent English, written and verbal communications skills (Native)</li> <li>Hands on, fast learner, good team working skills and highly motivated</li> <li>Knowledge of Information Security/Risk Management best practices</li> <li>Understanding of business and technical risk, how to translate between the two and communicate to various levels of technical and business stakeholders</li> </ul><div><br></div><div><strong>Employment details:</strong></div><div><br></div><ul> <li>Full time position&nbsp;</li> <li>100% work from home in a virtual environment&nbsp;</li> <li>Non-standard hours might be required&nbsp;</li> </ul><div><br></div><div><strong>What we offer:</strong></div><div><br></div><ul> <li>Dental insurance&nbsp;</li> <li>Medical Insurance&nbsp;</li> <li>401K Plan&nbsp;</li> <li>Paid vacation days</li> <li>Paid sick days&nbsp;</li> <li>Company provided laptop and headset</li> <li>Opportunity to travel for the company bi-annual international retreats</li> </ul><div></div><div><br></div><ul></ul><p><strong>To apply:</strong> <a href='https://hire.withgoogle.com/public/jobs/scheduleoncecom/view/P_AAAAABkAAAKEfpo_IIDMMd?trackingTag=weworkremotely' rel='nofollow'>https://hire.withgoogle.com/public/jobs/scheduleoncecom/view/P_AAAAABkAAAKEfpo_IIDMMd?trackingTag=weworkremotely</a></p>    <p></p>        <p>            </p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "21wLzWZ-QUuQkArwooC6Rw",
    "url": "http://jobmote.com/jobs/25808-solutions-architect-south-of-england-remote-working-85000",
    "title": "Solutions Architect - South Of England/Remote Working £85000",
    "tags": [
      "DBG:surround``remot 3N OR(options, avail, allow) NOT encourag",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Nigel Frank International",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 18, 2018 7:21:30 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p><strong>Solutions Architect - £65000 to £85000</strong></p><p>My Client is a leader for Microsoft managed solutions in the UK, they are long established and have a highly respected reputation as a Microsoft partner. Due to their continued growth, they are looking for a Solution Architect who is experienced in ensuring successful definition and delivery of Office 365 based solutions.</p><p>My Client is looking for a Dynamic SharePoint Architect to join their successful team and work on a variety of projects with an extensive portfolio of high profile clients that is continuing to grow. My Client is offering a highly competitive basic salary, car allowance plus remote working opportunities and fantastic career progression pathways.</p><p>Deliver projects based on a range of Office 365 and Azure based technologies</p><p>Essential Skills</p><ul><li>Demonstrate an expert understanding in the Office 365 workloads, including Exchange, SharePoint, Power Apps and Azure Active Directory</li><li>Experience of on-premises solutions built on SharePoint 2013 or 2016</li><li>Demonstrate a good understanding of development patterns and best practices for working with Office 365 and Azure</li></ul><p>Desirable</p><ul><li>Data and BI</li><li>Demonstrate knowledge of device and application management</li><li>Demonstrable understanding of SharePoint Framework integration</li></ul><p>Benefits:</p><ul><li>Annual professional training budget to support your PDP</li><li>25 days holiday - increasing to 26 days after 1 year, to 27 days after 2 years etc</li><li>Workplace pension scheme</li><li>Free on-site parking, subject to availability</li><li>Regular social activities such as a summer event, quiz nights, wine tasting, pub nights, family events, BBQs and so much more</li></ul><p>There are many other benefits which I will be happy to discuss with interested candidates! If you would like to hear more about the position please contact me at: or</p><p></p></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "cmtcQNgsQ0m_YeDrOwP9uw",
    "url": "https://remote.co/job/solutions-architect-6/",
    "title": "Solutions Architect",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Cleo",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 18, 2018 4:35:23 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Solutions Architect at <span>Cleo</span></h2><div><span><i></i> Remote</span>        </div><div>            <p><strong>Description</strong><br>Cleo is a cloud integration technology company focused on business outcomes. Every day we ensure that each one of our 7,000+ customer’s potential is realized by delivering solutions that make it easy to discover and create value through the movement and integration of enterprise data. By providing the industry’s most complete and flexible integration offerings, we are helping our client’s build trusted relationships across their partner ecosystems today, while providing all the control and visibility they need to advance their business tomorrow.</p><p>Simply put, Cleo … never stops</p><p><strong>The Position</strong><br>Cleo is looking for a Solutions Architect to join our Services team to provide Design and Architecture integration solutions to the client.&nbsp;<strong>This position can be based out of any one of our offices in the US or work remotely from anywhere in the US </strong>–&nbsp;it is all about finding the right fit! Ideal candidates possess a strong background working with data translation tools and software and have an interest in working directly with clients to provide consultative solutions based on their business needs.</p><p><strong>What You Will Be Doing:</strong></p><ul><li>Leading design discussions with Project Manager present</li><li>Design and architect data integration solutions based on the client’s business needs</li><li>Requirement gathering</li><li>Goal setting</li><li>Present to the client how Cleo will implement the solution and once implemented how the solution will work within the Client’s environment</li><li>Establish and document best practices to assist in making day to day work more efficiently</li></ul><p><strong>Requirements:</strong></p><ul><li><strong>Bachelor’s degree or related technical degree from a four-year college or university (Engineering, Computer Science, or related field of study)</strong></li><li>Experience with: B2B, data integration, data translation, and/or mapping</li><li>Must have experience with design and architecture of integration solutions</li><li>Prior experience in a technical services role</li><li>Knowledge of data transformation products including transformation of EDI, Flat File, XML, file formats</li></ul><p><strong>Benefits:</strong></p><ul><li>Competitive base salary</li><li>Great Healthcare + Dental + Vision</li><li>401k with company match</li><li>Opportunity to work on large, high impact projects</li><li>Ongoing training and development</li></ul>        </div><div>        <a href='https://jobs.jobvite.com/cleo-communications/job/oMqe8fwi' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "a51xj-ZVQHmSPmVx1jjxpA",
    "url": "https://whereverjobs.com/listing/4078/security-manager",
    "title": "Security Manager",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "AmaZix",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 18, 2018 4:02:41 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h3>Security Manager</h3><div>Company: AmaZix<br><br></div><div>                                <div><b>Operational Security Manager (CISMP, CISM, CISSP)<span>&nbsp;</span></b></div><div><br></div><div></div><div><span>AmaZix is the leading provider of community management services for crypto projects. We specialise in helping projects running on the Ethereum blockchain, especially those building up to their ICOs. Projects we work on include Bancor, BANKEX, WePower, GBX and Cardstack.</span></div><div><br></div><div></div><div><span>We are growing extremely fast and from our founding nine months ago we now have over 100 team members and manage over 60 high level projects, with many more asking to come aboard than we can take. We are profitable and have been since day one.</span></div><div><br></div><div></div><div><span>If you are not technically familiar with blockchain based projects then no problem - it is not required. However some knowledge of what Ethereum is would be useful.</span></div><div><br></div><div></div><div><span>Though our company is based in Hong Kong our team is distributed around the world (primarily Europe).</span></div><div></div><div><br></div><div></div><div><span><b>Your position</b></span></div><div><br></div><div></div><div><span>We are looking for a candidate with extensive experience in an Operational Security Manager role, who can demonstrate ownership and accountability of delivering Security IT Services into a dynamic and remote business.<span>&nbsp;</span></span></div><div><br></div><div></div><ul><li><span></span><span>Minimum one of the following Security qualifications; IS027001 lead Auditor, CISMP, CISM or CISSP</span></li><li><span></span><span>Excellent communications skills &amp; be able to translate complex security information into layman's terms for those that are not conversant with security knowledge &amp; services</span></li><li><span></span><span>Good knowledge of British &amp; International security standards</span></li><li><span></span><span>Ability to work as part of a remote team</span></li><li><span></span><span>Ability to develop conceptual models for the delivery of security services</span></li><li><span></span><span>Security Risk Management</span></li></ul><div><br></div><div></div><div><span>Responsibilities for this role will include:</span></div><div><br></div><div></div><ul><li><span></span><span>Managing relationships with the business and with customers</span></li><li><span></span><span>Be responsible for all Security related aspects to maintain Security compliance</span></li><li><span></span><span>Proactively promote security services</span></li><li><span></span><span>Management of security incidents</span></li><li><span></span><span>Managing &amp; mitigating threats</span></li><li><span></span><span>Writing and maintaining security policies &amp; compliance</span></li><li><span></span><span>Adhere to 27001 compliances and develop roadmap to accreditation</span></li><li><span></span><span>Ensure operational security input &amp; governance is exercised over all new technical implementations</span></li><li><span></span><span>Raise security awareness within the business</span></li><li><span></span><span>Manage a security risk register</span></li><li><span></span><span>Review &amp; authorise change requests</span></li><li><span></span><span>Act as a security point of contact for the business</span></li><li><span></span><span>Ensure all security documents are maintained</span></li><li><span></span><span>Manage privilege access management</span></li><li><span></span><span>Ensure 3rd parties are Security compliant</span></li><li><span></span><span>Produce monthly Security report for your line manager</span></li><li><span></span><span>Chair &amp; Manage Security meetings &amp; maintain minutes</span></li><li><span></span><span>Produce and drive recommendations for security improvements</span></li></ul><div></div><div><br></div><div></div><div><span><b>Requirements:</b></span></div><div><br></div><div></div><div><span>Perfect command of English (written and spoken)</span></div><div><br></div><div></div><div><span>Invoicing structure and proper registration. Willingness to be paid in Ethereum would be a huge plus.</span></div><div><br></div><div></div><div><span>Able to work full-time.<span>&nbsp;</span></span></div><div><br></div><div></div><div><span></span></div><div><br></div>            </div><div>How to apply:<br>Go to our website: <a href='http://www.amazix.com' rel='nofollow'>www.amazix.com</a> and press the &quot;Join us&quot; button. Select option &quot;B&quot; and fill out the fields in the Typeform</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "MDQDwRcmRkSaLcZBZCLXwA",
    "url": "https://whereverjobs.com/listing/4019/security-manager",
    "title": "Security Manager",
    "tags": [
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "AmaZix",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 18, 2018 12:28:59 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h3>Security Manager</h3><div>Company: AmaZix<br><br></div><div>                                <div><b>Operational Security Manager (CISMP, CISM, CISSP)<span>&nbsp;</span></b></div><div><br></div><div></div><div><span>AmaZix is the leading provider of community management services for crypto projects. We specialise in helping projects running on the Ethereum blockchain, especially those building up to their ICOs. Projects we work on include Bancor, BANKEX, WePower, GBX and Cardstack.</span></div><div><br></div><div></div><div><span>We are growing extremely fast and from our founding nine months ago we now have over 100 team members and manage over 60 high level projects, with many more asking to come aboard than we can take. We are profitable and have been since day one.</span></div><div><br></div><div></div><div><span>If you are not technically familiar with blockchain based projects then no problem - it is not required. However some knowledge of what Ethereum is would be useful.</span></div><div><br></div><div></div><div><span>Though our company is based in Hong Kong our team is distributed around the world (primarily Europe).</span></div><div></div><div><br></div><div></div><div><span><b>Your position</b></span></div><div><br></div><div></div><div><span>We are looking for a candidate with extensive experience in an Operational Security Manager role, who can demonstrate ownership and accountability of delivering Security IT Services into a dynamic and remote business.<span>&nbsp;</span></span></div><div><br></div><div></div><ul><li><span></span><span>Minimum one of the following Security qualifications; IS027001 lead Auditor, CISMP, CISM or CISSP</span></li><li><span></span><span>Excellent communications skills &amp; be able to translate complex security information into layman's terms for those that are not conversant with security knowledge &amp; services</span></li><li><span></span><span>Good knowledge of British &amp; International security standards</span></li><li><span></span><span>Ability to work as part of a remote team</span></li><li><span></span><span>Ability to develop conceptual models for the delivery of security services</span></li><li><span></span><span>Security Risk Management</span></li></ul><div><br></div><div></div><div><span>Responsibilities for this role will include:</span></div><div><br></div><div></div><ul><li><span></span><span>Managing relationships with the business and with customers</span></li><li><span></span><span>Be responsible for all Security related aspects to maintain Security compliance</span></li><li><span></span><span>Proactively promote security services</span></li><li><span></span><span>Management of security incidents</span></li><li><span></span><span>Managing &amp; mitigating threats</span></li><li><span></span><span>Writing and maintaining security policies &amp; compliance</span></li><li><span></span><span>Adhere to 27001 compliances and develop roadmap to accreditation</span></li><li><span></span><span>Ensure operational security input &amp; governance is exercised over all new technical implementations</span></li><li><span></span><span>Raise security awareness within the business</span></li><li><span></span><span>Manage a security risk register</span></li><li><span></span><span>Review &amp; authorise change requests</span></li><li><span></span><span>Act as a security point of contact for the business</span></li><li><span></span><span>Ensure all security documents are maintained</span></li><li><span></span><span>Manage privilege access management</span></li><li><span></span><span>Ensure 3rd parties are Security compliant</span></li><li><span></span><span>Produce monthly Security report for your line manager</span></li><li><span></span><span>Chair &amp; Manage Security meetings &amp; maintain minutes</span></li><li><span></span><span>Produce and drive recommendations for security improvements</span></li></ul><div></div><div><br></div><div></div><div><span><b>Requirements:</b></span></div><div><br></div><div></div><div><span>Perfect command of English (written and spoken)</span></div><div><br></div><div></div><div><span>Invoicing structure and proper registration. Willingness to be paid in Ethereum would be a huge plus.</span></div><div><br></div><div></div><div><span>Able to work full-time.<span>&nbsp;</span></span></div><div><br></div><div></div><div><span></span></div><div><br></div>            </div><div>How to apply:<br>Go to our website: <a href='http://www.amazix.com' rel='nofollow'>www.amazix.com</a> and press the &quot;Join us&quot; button. Select option &quot;B&quot; and fill out the fields in the Typeform</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3CsFA949Q5OUj2hGTe0dYg",
    "url": "http://jobmote.com/jobs/25768-ping-identity-iam-solution-architect-remote-identity-and-access-man",
    "title": "Ping Identity IAM Solution Architect - Remote, Identity and Access Man",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:k/t/w:internet-explorer/frontend/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "WSI Nationwide",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 100000,
      "maxValue": 120000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 17, 2018 9:22:21 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p>Identity and Access Management/IAM Solution Architect candidates will have experience with Ping Identity/PingID/Ping ID.</p><p>If no strong Ping Identity experience it's a no-go. Candidates will ideally come from a software development background. We will entertain candidates from either end user or service provider backgrounds. This role is remote with travel so candidates can be based anywhere in the US.</p><p>Location - Virtual-Remote-Telecommute - 35% national travel<br>Starting salary $100,000 to $120,000+ per year, Also part of the comp package are full time health benefits along with significant career progression opportunity.</p><p>This is a permanent position working for a leading Cyber Security Solution provider servicing large enterprise organizations and US Government agencies.</p><p>In this Identity and Access Management Solution Architect position you will be the primary customer interface and technical authority with regard to IAM products and solutions.</p><p>Duties and Responsibilities</p><p>-Provides technical design and consulting services on (IAM) Identity and Access Management (IAM) products<br>-Provides customer specific though leadership and solution construction including installations of Identity and Access Management (IAM) products for User life cycle management, Identity and Access Governance, Automated Provisioning, (SSO) Single Sign-On, Federation, and Privileged Account Management<br>-Enhances existing systems by analysing business objectives, preparing an action plan and identifying areas for modification and improvement<br>-Creates customer level documentation specific to deployment of IAM products<br>-Creates knowledge articles for corporate website related to IAM<br>-Provide regular feedback to the Professional Services Director to guide systems integration methodology and packages service development </p><p>Technical Experience and Qualifications</p><p>-Experience with Ping Identity<br>-Lead customer-focused discussions and interact with our customers as the primary technical authority for an engagement<br>-Ability to present project solutions to clients, manage client expectations, and implement and deliver solutions<br>-Become a subject matter expert with IAM products and concepts<br>-Web Application security<br>-Software Security<br>-HTTP and related technologies<br>-Database/Directory integration<br>-x509 Certificates<br>-Windows, Unix, Linux<br>-Experience with some combination of IAM products: Radiant Logic, Sailpoint, Centrify, ForgeRock, Ping Identity/PingID, Ping ID, PingFederate, Ping Access, IBM, Okta, Oracle, RSA, simeio<br>-Federated Identity and Single Sign-On<br>-Access Management and API Gateways<br>-SAML, WS-Federation, OAuth, OpenID Connect, and/or SCIM standards<br>-RADIUS and/or KERBEROS<br>-APIs (SOAP, XML, REST, JSON)<br>-Social APIs including Facebook, Twitter, LinkedIn, etc.<br>-User Directory (Active Directory OpenLDAP, OpenDJ, etc.)<br>-Java and/or .NET development<br>-Amazon's AWS services (ie VPCs, SES, RC2, R3, Route 53, Cloud Formation, etc.)</p><p></p></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "I0Yva1jbQsGx2twB33JY1g",
    "url": "http://jobmote.com/jobs/25762-ping-federate-pingfederate-solution-architect-remote-identity-and-acce",
    "title": "Ping Federate/PingFederate Solution Architect-Remote-Identity and Acce",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:k/t/w:internet-explorer/frontend/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "WSI Nationwide",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 120000,
      "maxValue": 145000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 17, 2018 8:21:13 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p>Identity and Access Management/IAM Solution Architect candidates will have experience with Ping Federate/PingFederate. Candidates will ideally come from a software development background. We will entertain candidates from either end user or service provider backgrounds. This role is remote with travel so candidates can be based anywhere in the US.</p><p>Location - Virtual-Remote-Telecommute - 35% national travel </p><p>Starting salary $120,000 to $145,000+ per year, Also part of the comp package are full time health benefits along with significant career progression opportunity.</p><p>This is a permanent position working for a leading Cyber Security Solution provider servicing large enterprise organizations and US Government agencies.</p><p>In this Identity and Access Management Solution Architect position you will be the primary customer interface and technical authority with regard to IAM products and solutions.</p><p>Duties and Responsibilities </p><p>-Provides technical design and consulting services on (IAM) Identity and Access Management (IAM) products<br>-Provides customer specific though leadership and solution construction including installations of Identity and Access Management (IAM) products for User life cycle management, Identity and Access Governance, Automated Provisioning, (SSO) Single Sign-On, Federation, and Privileged Account Management<br>-Enhances existing systems by analysing business objectives, preparing an action plan and identifying areas for modification and improvement<br>-Creates customer level documentation specific to deployment of IAM products<br>-Creates knowledge articles for corporate website related to IAM<br>-Provide regular feedback to the Professional Services Director to guide systems integration methodology and packages service development </p><p>Technical Experience and Qualifications </p><p>-Experience with Ping Federate/PingFederate<br>-Lead customer-focused discussions and interact with our customers as the primary technical authority for an engagement<br>-Ability to present project solutions to clients, manage client expectations, and implement and deliver solutions<br>-Become a subject matter expert with IAM products and concepts<br>-Web Application security<br>-Software Security<br>-HTTP and related technologies<br>-Database/Directory integration<br>-x509 Certificates<br>-Windows, Unix, Linux<br>-Plusses include experience with IAM products: Radiant Logic, Sailpoint, Centrify, ForgeRock, Ping Identity, IBM, Okta, Oracle, RSA, simeio<br>-Federated Identity and Single Sign-On<br>-Access Management and API Gateways<br>-SAML, WS-Federation, OAuth, OpenID Connect, and/or SCIM standards<br>-RADIUS and/or KERBEROS<br>-APIs (SOAP, XML, REST, JSON)<br>-Social APIs including Facebook, Twitter, LinkedIn, etc.<br>-User Directory (Active Directory OpenLDAP, OpenDJ, etc.)<br>-Java and/or .NET development<br>-Amazon's AWS services (ie VPCs, SES, RC2, R3, Route 53, Cloud Formation, etc.)</p><p></p></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "MtSsWTFkSly9r3WH2NCA3Q",
    "url": "http://jobmote.com/jobs/25726-solutions-engineer-fully-remote",
    "title": "Solutions Engineer - Fully Remote",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:javascript/frontend/4",
      "DBG_TECH1:k/t/w:javascript/nodejs/4",
      "DBG_TECH1:k/t/w:node.js/nodejs/13",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=17, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=12}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "FULLSTACK RECRUITMENT LIMITED",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 15, 2018 9:21:41 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p>Fullstack London is currently working alongside a ground-breaking technology startup; assisting with their search for a Solutions Engineer to join their team on a fully remote basis. We're seeking a passionate developer - experienced in Javascript (React/Node) and MongoDB - who wants to join a small and talented team looking to move fast and break things. This role presents an incredible opportunity for someone to really place their stamp on both a product and the company as they scale. </p><p>The company is dedicated to building the best product in class, and have already picked up a couple of awards along the way. They thrive to provide a great experience and support to their customers and pride themselves in being one of the most positively reviewed apps in the Marketplace. They are growing at a fantastic rate, and this is an incredible opportunity for someone talented and ambitious to make a huge impact. </p><p><strong>Responsibilities:</strong></p><ul><li>You will work directly with the support team to troubleshoot, diagnose and resolve technical issues.</li><li>You will design and develop solutions to leverage the work of internal teams including support, product, marketing and sales.</li><li>You will help improving and maintaining technical documentation.</li><li>You will play a key role in shaping company direction.</li></ul><p><strong>About you:</strong></p><ul><li>You are someone who thrives on uncertainty. You won't necessarily have worked in a startup environment before, but you will be drawn by the incredible opportunities for learning and growth that it presents.</li><li>You will be excited about the full stack all-rounder nature of this role in the near term.</li><li>You are someone who sets very high standards for others and especially for yourself. You believe strongly in the importance of Do What You Say You Will Do.</li><li>You need to know and love coding in JavaScript. ES6 experience is a plus.</li><li>Experience with Node.js development.</li><li>Experience with MongoDB.</li></ul><p>This a superb opportunity for any Javascript enthusiast who wants to work in a sharp, welcoming and dynamic environment, as part of a highly-talented distributed team. In addition to a great salary you'll also benefit from share options, flexible working hours and of course being based at home! </p><p>If you're interested please send us your CV or get in touch for more information.</p><p></p></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "FeCnE0roQ5-7JrFzTSt98A",
    "url": "https://stackoverflow.com/jobs/200254/sr-it-specialist-linux-aws-google-cloud-upcurve-cloud?a=159R7zvUInh6",
    "title": "Sr. IT Specialist (Linux/AWS/Google Cloud) at UpCurve Cloud (Austin, TX) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:php/php/10",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=10, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "UpCurve Cloud",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2018 9:06:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Sr. IT Specialist (Linux/AWS/Google Cloud)</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>System Administrator</span>                                    </div>                            </div>                    </div>                <div>Company: UpCurve Cloud | Austin, TX<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Austin, TX.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                        <div>                                    <span>Relocation Assistance:</span>                                    <span>Yes</span>                                </div>                        </div>                    </div>                <h3>Technologies</h3><div>linux</div><div>aws</div><div>gcp</div><div>php</div><div>apache</div><div>sysadmin</div>                <h3>Job description</h3>                <div><p>Come join UpCurve Cloud and help shape the future of Cloud Computing.</p><p>We are a rapidly growing Cloud Services Provider specializing in application hosting and CRM application development. &nbsp;</p><p>If you are a curious, team-oriented DevOps specialist who likes to learn new technologies and solve interesting problems while providing outstanding service to customers and users, then we would love to talk with you.. &nbsp;</p><p>To qualify for our position, you need to have:</p><ul><li>A solid track record as a Linux system administrator</li><li>Experience installing and configuring Apache, MySQL and PHP</li><li>Experience working with Amazon Web Services and/or Google Cloud Platform</li><li>Excellent verbal and written communication skills</li></ul><p>If you have AWS, and/or GCP certifications, that's a big plus, but not a requirement.</p><p>This position is based in our office in Austin, Texas or remote. &nbsp;We provide a competitive salary, a fun, open work environment, fully-stocked kitchen with snacks and drinks, and an outstanding package of health and retirement benefits.</p>                </div>            <div>        <a href='https://upcurvecloud.applytojob.com/apply/io0Cz8YHIQ/Sr-IT-Specialist-LinuxAWSGoogle-Cloud?source=STCK' rel='nofollow'>                        Apply now        </a></div>            <h3>About UpCurve Cloud</h3>            <div><p>UpCurve Cloud is a rapidly growing Cloud Services Provider specializing in application hosting and CRM application development.</p>            </div>        ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "6Pn-5kEASoCAya_iHtAaeA",
    "url": "https://stackoverflow.com/jobs/169521/solutions-architect-nlp-and-machine-learning-critical-mix?a=UQPpTuM9Aly",
    "title": "Solutions Architect - NLP and Machine Learning at Critical Mix (Perrysburg, OH) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:angularjs/frontend/8",
      "DBG_TECH1:k/t/w:artificial-intelligence/bigdata-ml/6",
      "DBG_TECH1:k/t/w:deep-learning/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/6",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:keras/bigdata-ml/8",
      "DBG_TECH1:k/t/w:machine-learning/bigdata-ml/8",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:k/t/w:reactjs/frontend/24",
      "DBG_TECH1:k/t/w:torch/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=4, other=0, dotnet=0, c=0, mobile=0, go=6, nodejs=1, bigdata-ml=38, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=33}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Critical Mix",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2018 9:06:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Solutions Architect - NLP and Machine Learning</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Manager</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Integrated Marketing Solutions</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Critical Mix | Perrysburg, OH<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Perrysburg, OH.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>reactjs</div><div>go</div><div>python</div><div>watson-conversation</div><div>php</div>                <h3>Job description</h3>                <div><p>&nbsp;&nbsp; Critical Mix is looking for a&nbsp;<strong>Solutions Architect</strong>&nbsp;to work with our teams across the United States and is passionate on simplifying the complex with digital innovation.&nbsp; Success in this position will require some unique knowledge in the areas of natural language processing services such as Watson and Lex as well as expertise in machine learning technologies. Of course, none of this really functions without an exceptional and intuitive BOT interface for the end user.</p><p><strong>Responsibilities:</strong></p><ul><li>Take technical lead on the team in the ML/NLP domain and keep up with latest industry solutions.</li><li>Design, develop, validate and deploy proposed ML/NLP solutions both internal and client facing.</li><li>Innovate and&nbsp;build new features for our products including chatbots and virtual assistants.</li><li>Coaching and mentoring a team of diverse and talented software engineers.</li><li>Interfacing with senior management and stakeholders to define requirements and take the lead on operational and technical projects in a fast-paced environment.</li></ul><p><strong>Requirements</strong></p><ul><li>Advanced degree Computer Science, Statistics, Mathematics, or related area&nbsp;</li><li>3+ Years of experience building software products as an Architect</li><li>1+ years ML/NLP domain experience.</li><li>Experience with Python or Go programming languages</li><li>Knowledge of JavaScript frameworks like ReactJS, React Native, AngularJS</li><li>Experience with Microservices and Resftul API’s</li><li>Familiarity with a major machine learning/deep learning frameworks a plus (Keras, Tensorflow, Torch, Spark-ML)</li></ul>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/169521?reset=False&amp;ra=UQPpTuM9Aly&amp;oqs=a%3DUQPpTuM9Aly' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About Critical Mix</h3>            <div><p>Critical Mix provides easy access to highly-targeted global survey respondents, survey programming and data visualization services for market research and consulting firms. Driven by a passion for simplifying data collection, the team at Critical Mix is personally invested in giving clients the ultimate customer service experience.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Health benefits</span>                            </li>                            <li>                                <span></span>                                <span>Flexible schedule</span>                            </li>                            <li>                                <span></span>                                <span>Great work/life integration</span>                            </li>                            <li>                                <span></span>                                <span>Empowerment</span>                            </li>                            <li>                                <span></span>                                <span>Unlimited vacation policy</span>                            </li>                            <li>                                <span></span>                                <span>Competitive compensation</span>                            </li>                            <li>                                <span></span>                                <span>Remote location</span>                            </li>                            <li>                                <span></span>                                <span>Gym memberships</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "_syT_ZD1RQS7zVoUuonrsg",
    "url": "https://stackoverflow.com/jobs/194780/solution-engineer-id-prse01-open-xchange-gmbh?a=13k2gGHkY1qM",
    "title": "Solution Engineer (ID: PRSE01) at Open-Xchange GmbH (Nürnberg, Deutschland) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=8, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TECH1/c",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml",
      "c"
    ],
    "hiringOrganization": {
      "name": "Open-Xchange GmbH",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2018 9:06:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Solution Engineer (ID: PRSE01)</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>System Administrator</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Collaboration Tools, Computer Software, Open-Source</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>201-500 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>VC Funded</span>                                    </div>                            </div>                    </div>                <div>Company: Open-Xchange GmbH | Nürnberg, Deutschland<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Nürnberg, Deutschland.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>powerdns</div><div>dns</div><div>linux</div>                <h3>Job description</h3>                <div><strong>Don’t just go to work.&nbsp;Thrive.</strong><br>Here are people committed to openness, a rebellious business spirit and they have the will to revolutionize the market.<p></p><p><strong>We are eMail</strong><br>Worldwide companies like: 1&amp;1, STRATO, Host Europe, NetCologne, network solutions / web.com and Rackspace use our &quot;white label&quot; products for eMail and collaboration.</p><p><strong>Open people for an open source!</strong><br>Join the force which works on products to support people in their daily digital life without sacrificing their personal freedom and protect their data.</p><p>Daily activities alternate between working on customer issues and actual &quot;Professional Services for customer implementations (both on &amp; off-site). As a Solutions Engineer (with a focus on PowerDNS) you will work closely with the PowerDNS development team, as well as other parts of Open-Xchange and Dovecot development, sales and Product Management teams form within the European Service team.</p><p>We think Support &amp; Implementation is a great step into a promising career. We are specifically looking for employees willing to learn quickly while delivering great support and service. Keeping an eye towards growing within the Global Services department or into different roles in the larger Open-Xchange organisation. In other words, this position is a great opportunity for your personal development. There will be a close and intimate cooperation between PowerDNS and OX Professional Services regarding the &nbsp;support, implementation and development roles.</p><p><strong>Your passion / Your job</strong></p><ul><li>Implementation &amp; Support of PowerDNS technology for our customers</li><li>Investigate and reproduce complex custom issues, test solutions, help implement fixes</li><li>Providing technical support during complex deployment projects and roll-outs</li><li>Evaluation of customer environment, creation of custom integration concepts, and writing SOWs for actual implementations.</li><li>Customer communication and managing (technical) relationship</li><li>Work closely with PowerDNS (including Open-Xchange and Dovecot) development, sales, and product management teams</li><li>Manage architecture, design and documentation for customer solutions &amp; projects</li><li>Hands on training of customer’s administrators and support team</li></ul><p><strong>What do you bring to the table</strong></p><ul><li>Good knowledge of DNS technologies and solutions (Open source and commercial).</li><li>Knowledge and experience with PowerDNS is a bonus</li><li>Experience in system administration or support of Unix or Linux systems, ideally in the hosting/telco market.</li><li>In-depth knowledge of and demonstrated experience with Linux systems</li><li>Experience with System architecture and design (design and analysis of complex setups in heterogeneous environments).&nbsp;</li><li>Good understanding of large, complex networking environments (IP, Anycast, Telco mobile and broadband networks, etc.)</li><li>Hands-on experience with Ansible, cloud technologies and databases (MySQL, PostgreSQL, Redis and sqlite)</li><li>Knowledge of Lua script and/or C++ is a bonus.</li><li>Ability to work independently</li><li>Ability to travel international</li><li>Excellent verbal and written communication skills in English</li><li>multi-lingual candidates (in German, Dutch, French, Spanish or Italian) will get bonus points</li><li>Experience with mission critical systems</li><li>knowledge of large scale E-Mail systems is a bonus&nbsp;</li></ul><p><strong>What do we offer</strong></p><ul><li>Training and personal development</li><li>Home Office and the opportunity to work from one of the many offices we define as the OX world</li><li>The latest in IT equipment</li><li>Flat hierarchies combined with &quot;Open Door&quot; policies</li><li>Personal development in a dynamic environment</li></ul><p>                </p></div>            <div>        <span>Apply now</span></div>            <h3>About Open-Xchange GmbH</h3>            <div><p><strong>Open-Xchange / Open people for Open source</strong></p><p>With some 250+ employees Open-Xchange develops a Open-Source-Software addressing communication, collaboration and office-productivity worldwide. Sales are made through Internet service providers, hosting, telecommunication and cable providers, which offer their customers the Open-Xchange solution as SaaS (Software as a Service). More than 200 million users adopted Open-Xchange software for their private and business communications via partners such as 1 &amp; 1, STRATO, Host Europe, NetCologne, network solutions / web.com and Rackspace.</p><p>The core offer is named <a href='https://www.open-xchange.com/portfolio/ox-app-suite/' rel='nofollow'>OX App Suite</a> with applications for processing e-mails, contacts and appointments, which can be extended by functions like: <a href='https://www.open-xchange.com/portfolio/ox-drive/' rel='nofollow'>OX Drive</a> for managing and synchronizing documents, images, photos and movies; <a href='https://www.open-xchange.com/portfolio/ox-documents/' rel='nofollow'>OX Documents</a> for text processing, spreadsheets and presentations and <a href='https://www.open-xchange.com/portfolio/ox-guard/' rel='nofollow'>OX Guard</a> for encrypting emails and files. Software from <a href='https://www.open-xchange.com/portfolio/dovecot-pro/' rel='nofollow'>Dovecot</a> and <a href='https://www.open-xchange.com/portfolio/ox-powerdns/' rel='nofollow'>PowerDNS</a> are complementing Open-Xchange's portfolio.</p><p>We want to constantly advance and are looking for people who have fun working with the latest technologies in an international team. There are locations in Hamburg, Bremen, Dortmund, Cologne, Olpe and Nuremberg as well as Finland, France, the Netherlands, Italy and Spain. International offices are in Tokyo, Sydney and Palo Alto which represents the distributed team in the USA.</p><p>If you are interested, please contact Jochen F. Schude for further information - or send us your paperless application with a cover letter including the job ID, tabular CV, certificates, salary request and the earliest possible date of entry by e-mail to recruiting at open-xchange.com.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Homeoffice</span>                            </li>                            <li>                                <span></span>                                <span>Flache Hierarchien</span>                            </li>                            <li>                                <span></span>                                <span>Flexible Arbeitszeiten</span>                            </li>                            <li>                                <span></span>                                <span>Modernste Technik</span>                            </li>                            <li>                                <span></span>                                <span>Work-Live-Balance</span>                            </li>                            <li>                                <span></span>                                <span>Culture-Mixed</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "A8yVro38QlylC2BnxQ3Gvw",
    "url": "https://stackoverflow.com/jobs/186436/architecte-solutions-capgemini-france?a=10wxwXFSDNa8",
    "title": "Architecte Solutions at CAPGEMINI FRANCE (Paris, France) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG_TECH1:k/t/w:java-ee/java/13",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:windows-ce/embedded/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=15, gamedev=0, php=0, embedded=8, frontend=0}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/solution",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "CAPGEMINI FRANCE",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "€",
      "minValue": 50000,
      "maxValue": 100000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2018 9:06:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Architecte Solutions</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior, Lead, Manager</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Automation, IT Consulting, Technology Consulting</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>10k+ people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: CAPGEMINI FRANCE | Paris, France<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Paris, France.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>java</div><div>jee</div><div>esb</div><div>mom</div><div>soa</div>                <h3>Job description</h3>                <div><p>En pleine transformation digitale, les grands comptes du secteur Banque &amp; Assurance font appel à l'entité FS SBU (Financial Services Strategic Business Unit) du groupe Capgemini. A Paris, Nantes ou Montpellier, les 1 300 talents de la FS s'appliquent à imaginer et réaliser des solutions novatrices, adaptées aux nouveaux enjeux de demain.<br> <br> En tant qu'Architecte Solution H/F, vous avez participé à des projets de transformation. Outre votre connaissance des techniques et méthodologies, cela vous a permis de développer vos aptitudes relationnelles et votre leadership. Chez Capgemini, vous accompagnez les projets de nos clients en travaillant avec des interlocuteurs variés.<br> <br> Vos missions :<br> <br> - Accompagner les projets dans leurs différentes phases<br> - Participer au recueil des besoins et problématiques métiers et techniques<br> - Concevoir des solutions qui répondent aux exigences de performance, de robustesse, d'exploitabilité et de sécurité<br> - Définir et porter les architectures applicatives et techniques en assurant la traçabilité et la justification des choix<br> - Participer ou piloter la conception détaillée, la réalisation des solutions<br> - Avoir un rôle d'expert technique pour valider la faisabilité des projets<br> - Contribuer aux actions d'avant-vente<br> - Participer au développement de le la communauté des architectes Capgemini<br> - Faire progresser le positionnement et la reconnaissance technologique de Capgemini en tant qu'acteur majeur de la transformation Digitale des entreprises.<br> - Apporter votre valeur dans l'amélioration des outils et méthodes Capgemini<br> - Suivre et coacher des architectes juniors afin de garantir la qualité de notre delivery et de les épauler dans leur évolution professionnelle.</p><p>Diplômé d'un BAC+5 (Ecole d'ingénieur, Master 2 Système d'Information), vous maîtrisez les principales technologies et approches de l'architecture de SI (ESB, MOM, SOA, REST) ainsi que les problématiques associées (organisation dont agilité, devOps). Vous avez une expérience des solutions innovantes (microservices, RPA, IA, APIzation, Cloud...).</p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/186436?reset=False&amp;ra=10wxwXFSDNa8&amp;oqs=a%3D10wxwXFSDNa8' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About CAPGEMINI FRANCE</h3>            <div><p>Fort de 50 ans d’expérience et d’une grande expertise des différents secteurs d’activité, le groupe accompagne les entreprises et organisations dans la réalisation de leurs ambitions, de la définition de leur stratégie à la mise en œuvre de leurs opérations. Capgemini, leader mondial du conseil, des services informatiques et de la transformation numérique, a réalisé un chiffre d'affaires de 12,7 milliards d'euros en 2017.</p><p><strong>Notre vision</strong> <br>Pour Capgemini, ce sont les hommes et les femmes qui donnent toute sa valeur à la technologie. L’honnêteté, l’audace, la confiance, la liberté et l’indépendance d’esprit, la solidarité, la simplicité et le plaisir sont les valeurs fortes qui façonnent la manière dont nous répondons aux besoins de nos clients. Résolument multiculturel, le Groupe compte 200&nbsp;000 collaborateurs présents dans plus de 40 pays.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Contexte multiculturel</span>                            </li>                            <li>                                <span></span>                                <span>Misions diversifiées : clients d'envergure, tous secteurs d'activité</span>                            </li>                            <li>                                <span></span>                                <span>Ecole de formation : réseaux d'experts, certifications, Université...</span>                            </li>                            <li>                                <span></span>                                <span>Accord égalité professionnelle Hommes/Femmes</span>                            </li>                            <li>                                <span></span>                                <span>Accord Télétravail</span>                            </li>                            <li>                                <span></span>                                <span>Mutuelle d'entreprise</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "-RF56624REWjEiPSYBF-UQ",
    "url": "https://stackoverflow.com/jobs/170484/cloud-developer-hazelcast?a=VaQSnT92XvO",
    "title": "Cloud Developer at Hazelcast  ",
    "tags": [
      "DBG:surround``OR(europ, european, europeanunion) 3W OR(timezon,time)",
      "DBG:surround``OR(no,no W central) W offic",
      "DBG:surround``remot 16W timezon",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:java-developer/java/13",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:jvm/java/13",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:spring/java/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=44, gamedev=0, php=0, embedded=0, frontend=9}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/solution",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "Hazelcast",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 70000,
      "maxValue": 100000,
      "info": "Equity",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2018 9:06:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Cloud Developer</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior, Lead</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Backend Developer, DevOps</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Big Data, Cloud-Based Solutions, Enterprise Software</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>VC Funded</span>                                    </div>                            </div>                    </div>                <div>Company: Hazelcast | No office location<br></div><h3>Technologies</h3><div></div><div>java</div><div>kubernetes</div><div>docker</div><div>spring</div><div>amazon-web-services</div>                <h3>Job description</h3>                <div><p>Do you enjoy any of the following?</p><ul><li>Solving complex problems.</li><li>Implementing non-trivial infrastructure code.</li><li>Creating well crafted and&nbsp;thoroughly&nbsp;tested features, taking full-responsibility from the design phase.</li><li>Paying attention to all aspects of code quality, from clean-code, to allocation-rates.</li><li>Digging into mechanical sympathy concepts.</li></ul><p>At Hazelcast you will work with the best engineers out there.&nbsp;</p><ul><li>Who delve into JVM code.</li><li>Who implement and&nbsp;scrutinize&nbsp;garbage collection algorithms.</li><li>Who take any piece of software and multiply its performance by applying deep technical understanding.&nbsp;</li><li>Who regularly squash bugs in the depths</li></ul><p>We are looking for people who can deliver solid production code.&nbsp;You may either work in our office in London,&nbsp;Istanbul or code remotely from a home office in European timezone.</p><p>We would like you to:</p><ul><li>Be a senior Java engineer&nbsp;- including all aspects connected to it.</li><li>Be skeptical yet always open to new concepts.</li><li>Have strong opinions about software quality.</li><li>Be an excellent communicator in written and spoken English.</li><li>Familiarity with container and orchestration technologies is required (Docker, Kubernetes)&nbsp;</li><li>Experience on cloud platforms is required. (AWS, Azure or Google Compute Engine)</li><li>Experience with Spring framework is required.</li><li>Experience on React JS is a plus.</li></ul>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/170484?reset=False&amp;ra=VaQSnT92XvO&amp;oqs=a%3DVaQSnT92XvO' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About Hazelcast</h3>            <div><p><strong>ABOUT 111</strong></p><p>Hazelcast is the leading open source in-memory data grid, but it is also the name of our company. How do we define Hazelcast the company?</p><p>Immediately when you use the product, you notice that it is simple to use, that the code has been provided under an open source license and other details. Hazelcast nodes join together to form a cluster that is more powerful than any individual node. These qualities go beyond the Hazelcast project and are the basis for the culture of the company.</p><p><strong>OUR FOUNDER:</strong></p><p>Talip Ozturk, founder of Hazelcast describing 111:</p><p>I created Hazelcast 111 to define the unique “kernel” of Hazelcast company culture that is designed to scale as the company grows.</p><p>Hazelcast&nbsp;111&nbsp;(one-eleven) is the cultural&nbsp;”source code” for the company. The name is derived from the idea that&nbsp;1 + 1 + 1 can equal more than 3, that together we can be much more&nbsp;powerful than we are alone.These principles are expected to govern the professional behavior of&nbsp;Hazelcast team members and set expectations with the greater Hazelcast&nbsp;community about what they can expect when working with our team. New team members will be interviewed for cultural fit and we strive to make Hazelcast a great place to work for those who share these&nbsp;principles.</p><p><strong>111 PRINCIPLES:</strong></p><p><strong>1. Quality</strong></p><p><strong>Strive for work products that are reliable, stable and free of defects</strong></p><p><strong>2. Positivity</strong></p><p><strong>Solve problems or communicate about them in a constructive way.</strong></p><p><strong>3. Scalable Thinking</strong></p><p><strong>Make things work well as they scale up or down.</strong></p><p><strong>4. Bias Towards Simplicity</strong></p><p><strong>Try to make things as simple as possible.</strong></p><p><strong>5. Humility</strong></p><p><strong>Assume other Hazelcast community members are smart.</strong></p><p><strong>Give credit to the ideas and work of others first.</strong></p><p><strong>6. Honesty</strong></p><p><strong>Say what needs to be said even if it is difficult. Have hard conversations.</strong></p><p><strong>7. Ownership</strong></p><p><strong>Own your projects. Deliver on time.</strong></p><p><strong>Coordinate with anything that delivery depends on</strong></p><p><strong>Escalate when you are stuck</strong></p><p><strong>8. Community Focus</strong></p><p><strong>Seek to improve the lives of Hazelcast team members, customers and users.</strong></p><p><strong>9. Commitment</strong></p><p><strong>Participate in the decision process</strong></p><p><strong>Contribute to success even if you disagreed with the decision outcome</strong></p><p><strong>FEELS GOOD<br></strong></p><p>The correct implementation of&nbsp;111&nbsp;FEELS GOOD to team members, customers, partners, investors and open source users of Hazelcast. The test of&nbsp;111&nbsp;is whether it feels good. If it does not feel good, we need to improve either or both of our implementation or specification of&nbsp;111.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Medical, Dental and Vision Plans</span>                            </li>                            <li>                                <span></span>                                <span>Flexible Spending Accounts (FSA)</span>                            </li>                            <li>                                <span></span>                                <span>Commuter Benefits</span>                            </li>                            <li>                                <span></span>                                <span>Health Savings Accounts (HSA)</span>                            </li>                            <li>                                <span></span>                                <span>Employee Assistance Program (EAP)</span>                            </li>                            <li>                                <span></span>                                <span>Life Insurance, Voluntary Benefits, etc.</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "jz1sgJ_uQgalw2qd6mjg8A",
    "url": "https://stackoverflow.com/jobs/195351/l%C3%B6sungsarchitekt-solution-architect-platformsh?a=13vUntmHmuas",
    "title": "Lösungsarchitekt - Solution Architect at Platform.sh  ",
    "tags": [
      "DBG:surround``OR(no,no W central) W offic",
      "DBG:surround``OR(work,2W(work,remot)) 3W from 2W OR(wherev,wherev,where)",
      "DBG_TECH1:k/t/w:drupal/php/10",
      "DBG_TECH1:k/t/w:el/java/8",
      "DBG_TECH1:k/t/w:magento/php/40",
      "DBG_TECH1:k/t/w:symfony/php/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=0, php=66, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Platform.sh",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2018 9:06:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Lösungsarchitekt - Solution Architect</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior, Manager</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Cloud-Based Solutions, Continuous Delivery, PaaS</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>VC Funded</span>                                    </div>                            </div>                    </div>                <div>Company: Platform.sh | No office location<br></div><h3>Technologies</h3><div></div><div>cloud</div><div>linux</div><div>symfony</div><div>drupal</div><div>amazon-web-services</div>                <h3>Job description</h3>                <div><p>Unsere Kunden brauchen Onboarding und Training, bevor sie den Platform.sh-Spaß meistern können. Können Sie atemberaubende und aufregende Tech-Demos liefern und die Feinheiten der Kommandozeilen-Tools erklären? Wir betreiben OEM PaaS-Services für bekannte Marken wie Magento Enterprise Cloud Edition und Sensio Cloud - können Sie uns helfen, diese dynamischen Softwareprodukte zu entwickeln und zu betreiben?</p><p>Sie berichten direkt an unseren Director of Customer Solutions und sind in enger Zusammenarbeit mit unseren Teams für Vertrieb, Support, Engineering und Infrastruktur verantwortlich für den Verkauf und die proaktive Sicherstellung eines stabilen und sicheren Produkterlebnisses:</p><ul><li>Anpassung des Produkts an die Anforderungen der potenzielle Kunden</li><li>Enge Zusammenarbeit mit Vertriebsteams für Produktdemos und Beantwortung technischer Fragen</li><li>Eingliederung und Bildung von Neukunden</li><li>Demonstration des Geschäftswissens unserer Kunden im Hinblick auf unsere Produktnutzung</li><li>Analyse der technischen Bedürfnisse der Kunden, um Beratungsleistungen vorzuschlagen und deren Anforderungen zu erfüllen.</li><li>Unterstützung unserer Großkunden bei der täglichen Nutzung unserer Produkte</li><li>Zusammenarbeit mit den Entwicklungsteams, wenn dies für die Produktverbesserung erforderlich ist.</li><li>sich regelmäßig mit unseren neuen Produktfeatures vertraut zu machen</li></ul><p>Sie geben unseren Kunden einen ersten Eindruck von unserem Produkt und führen den Weg zu hoher Zufriedenheit in ihrer Produkterfahrung.</p><p><strong>Was wir suchen</strong></p><ul><li>Nachgewiesene erfolgreiche Erfahrung im Umgang mit technischen Kundenbeziehungen in der Web-Branche</li><li>Nachweis der Fähigkeit, Kundenerwartungen erfolgreich mit der Produktkapazität abzugleichen</li><li>Umfangreiches Wissen über Architektur und Dienste von Webanwendungen (DNS, CDN, Webserver, Datenbanken, Cache-Layer usw.) und verteilte Systeme.</li><li>Umfangreiche Kenntnisse von Web-Entwicklungs-Workflows und vorhandenen Tools (Git, CI-Tools)</li><li>Kenntnisse gängiger Webanwendungen und Frameworks: Magento Ecommerce, Symfony, Drupal, eZ Platform oder Typo3 (viele unserer Kunden betreiben diese)</li><li>Kenntnisse über Cloud-Dienste (AWS, Azure)</li><li>Dynamik mit einem kühler Kopf</li><li>Ausgezeichnete Kommunikationsfähigkeiten mit Englischkenntnissen und deutsche als Muttersprache.</li></ul><p><strong>Schön zu haben :</strong></p><ul><li>Mad Linux (Debian) skillz</li><li>Öffentliches Reden Erfahrung</li></ul>                </div>            <div>        <a href='https://grnh.se/e467c76b2' rel='nofollow'>                        Apply now        </a></div>            <h3>About Platform.sh</h3>            <div><p>Wir sind ein Risikokapital finanziertes, preisgekröntes Team von Hardcore-Hackern, die die Art und Weise revolutionieren möchten, wie Entwickler und Agenturen Webanwendungen erstellen und bereitstellen. Wir sind meistens verteilt, aber wir treffen uns täglich im Cyberspace und gelegentlich in Paris, Frankreich. Wir schätzen Begeisterung, Teamgeist und den ständigen Wunsch, das persönliche Wissen zu erweitern und einen Beitrag für die Gemeinschaft zu leisten. Wir bieten eine multikulturelle, lockere und ausgeglichene Arbeitsumgebung. Kürzlich haben wir der Einführung der Magento Enterprise Cloud Edition und der Sensio Cloud im/mit Platform.sh-Technologie mitgeholfen.</p><p>Zu unsere Kunden zählen unter anderem Vivienne Westwood, der britische Modehändler Reiss, die Canadian Football League, der British Council, der Parc Asterix, Seloger.com, das deutsche Start-up Flixbus oder das südamerikanische El Universo.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Work from home, wherever you are</span>                            </li>                            <li>                                <span></span>                                <span>Safe and friendly working environment</span>                            </li>                            <li>                                <span></span>                                <span>Stock options for everyone</span>                            </li>                            <li>                                <span></span>                                <span>Rest and recovery are essential to health and happiness; we get that</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "fi04o1jHSQeSPpckVz3Qjg",
    "url": "https://stackoverflow.com/jobs/163486/remote-srdeveloper-strong-aws-experience-surge?a=SPllvgdKtAQ",
    "title": "REMOTE Sr.Developer - strong AWS experience, Gluster/GlusterFS or AWS EFS at Surge  ",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(no,no W central) W offic",
      "DBG_TECH1:k/t/w:angular/frontend/16",
      "DBG_TECH1:k/t/w:go/go/9",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:k/t/w:php/php/15",
      "DBG_TECH1:k/t/w:ruby/ruby/6",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=9, nodejs=0, bigdata-ml=0, ruby=6, apple=0, java=0, gamedev=0, php=15, embedded=0, frontend=21}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend",
      "php"
    ],
    "hiringOrganization": {
      "name": "Surge",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2018 9:06:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>REMOTE Sr.Developer - strong AWS experience, Gluster/GlusterFS or AWS EFS</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Contract</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Senior, Lead</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>System Administrator</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Software Development</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>201-500 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Surge | No office location<br></div><h3>Technologies</h3><div></div><div>amazon-web-services</div><div>filesystems</div><div>aws-elasticfilesystem</div><div>glusterfs</div><div>linux</div><div>sysadmin</div>                <h3>Job description</h3>                <div><p>Surge Forward is looking for smart, self-motivated, experienced, senior-level consultants who enjoy the freedom of telecommuting and flexible schedules, to work as long-term, consistent (40 hrs/week) independent contractors on a variety of software development projects.</p><p>File System Developer - strong AWS experience, Gluster/GlusterFS or AWS EFS (elastic file system), strong in Linux, Ruby or PHP or Go</p><p>REQUIRED:File System Developer - strong AWS experience, Gluster/GlusterFS or AWS EFS (elastic file system), strong in Linux, Ruby or PHP or Go</p><p>* Must haves</p><p>&nbsp;&nbsp;&nbsp; * Strong AWS experience</p><p>&nbsp;&nbsp;&nbsp; * Gluster/GlusterFS or AWS EFS (Elastic File System)</p><p>&nbsp;&nbsp;&nbsp; * Strong in linux</p><p>&nbsp;&nbsp;&nbsp; * Ruby or PHP or Go</p><p>* Nice to Have</p><p>&nbsp;&nbsp;&nbsp; * Actual linux systems programming - Needs to understand the OS in and out</p><p>&nbsp;&nbsp;&nbsp; * Experience working with a Distributed File System&nbsp;</p><p><strong>Only candidates located in Canada and/ or the US can be considered at this time. Sorry, No Visas.</strong></p><p><strong>Resume must include the tech stack under each job and if you have Angular experience, please include what version of Angular you have coded in at each position.</strong></p><p>For immediate consideration, email resume and include your cell phone number and start date: <a href='mailto:dsanderson@surgeforward.com' rel='nofollow'>dsanderson@surgeforward.com</a></p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/163486?reset=False&amp;ra=SPllvgdKtAQ&amp;oqs=a%3DSPllvgdKtAQ' rel='nofollow'>Apply now</a></div>            <h3>About Surge</h3>            <div><p>Surge is an onshore provider of custom web, cloud, mobile, digital, and desktop software development and consulting services to clients in every industry, from hot startups to Fortune 500 companies.<br><br>Founded in 2007, and listed on the Inc. 5000 list of America’s fastest growing companies for five straight years, Surge has successfully delivered hundreds of software products, apps, and solutions to its clients using a proven agile/scrum development process combined with an elite group of North American software professionals.<br><br>Simply put, Surge offers America’s best software engineers, on demand, at rates 30-50% less than the competition.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Great Pay</span>                            </li>                            <li>                                <span></span>                                <span>Choose Your Hours</span>                            </li>                            <li>                                <span></span>                                <span>Work From Home</span>                            </li>                            <li>                                <span></span>                                <span>Work With Happy People</span>                            </li>                            <li>                                <span></span>                                <span>Zero Commute</span>                            </li>                            <li>                                <span></span>                                <span>See Your Family More</span>                            </li>                            <li>                                <span></span>                                <span>Travel While You Work</span>                            </li>                            <li>                                <span></span>                                <span>Software Provided</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "jns_Ccu3Tra5kvq9BaK_DA",
    "url": "https://stackoverflow.com/jobs/200997/sales-engineer-solutions-architect-interfolio-inc?a=15piXWrRoceY",
    "title": "Sales Engineer / Solutions Architect at Interfolio, Inc (Washington, DC) ",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:clojure/other/5",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=5, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/other",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "other"
    ],
    "hiringOrganization": {
      "name": "Interfolio, Inc",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2018 9:06:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Sales Engineer / Solutions Architect</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level</span>                                    </div>                                    <div>                                        <span>Industry: </span>                                        <span>Computer Software, Education, SaaS</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Company size: </span>                                        <span>51-200 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Interfolio, Inc | Washington, DC<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Washington, DC.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                            <div>                                    <span>Visa Sponsorship:</span>                                    <span>Yes</span>                                </div>                                                    </div>                    </div>                <h3>Technologies</h3><div></div><div>saas</div><div>clojure</div><div>web-services</div>                <h3>Job description</h3>                <div>Interfolio is on a mission to build smart, inspired and useful products for faculty and academic communities. By building an engine for faculty activity, decisions, and data, Interfolio has become the first mover in defining and owning the category of faculty-focused technology that cultivates goal-oriented collaboration around academic decision-making.Interfolio operates the first holistic faculty information system to support the full lifecycle of faculty work, from job seeking to review, tenure, sabbatical, committee work, research, and beyond. Offering colleges and universities increased clarity and insight into faculty data to help achieve their strategic initiatives, Interfolio believes that advancing the faculty will advance the institution.<strong>What’s even better than that? </strong>We’ve crafted a fun, collegial, dynamic culture that celebrates team and individual success almost daily. We’ve got a lean team of super-smart, super-hard working, local and remote colleagues who collaborate closely to produce a valuable service for an industry we’re passionate about. And, we genuinely like working with each other and with our clients.<strong>Like what you’ve heard so far?</strong>Then consider joining our Sales team. The position of Sales Engineer (Solutions Consultant) is open to remote employees as well as locals in commuting distance to our Washington, D.C. office.Interfolio is committed to diversity and the principle of equal employment opportunity for all employees. You will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), national, social or ethnic origin, age, gender identity and/or expression, sexual orientation, family or parental status, or any status protected by the laws or regulations in locations where we operate.<strong>About the Role</strong>A thought leader and strategic partner to the Sales Team, you will own all technical and product-related activities required throughout the sales life cycle. Keenly attuned to the buyer’s journey, you are a trusted advisor to the buyer (Provosts, Vice Provosts, CIOs, etc.) and play a primary role in creating larger buy-in across all stakeholders (including functional end users) by architecting buyer vision and mapping it to our product suite. You will engage audiences through tailored, compelling product demonstrations and fully address any functional and technical questions that may arise with professionalism and tact. You will be the product matter and technical expert within Sales and will work closely with other departments to relay product feedback from out in the field, create and maintain the sales demo environment, and help contribute to the development of our product roadmap. This role lives within the Sales department at Interfolio, under the Sales Operations division. &nbsp;&nbsp;<p><strong>About You</strong></p><ul><ul><ul><li><strong>Platform Evangelist and Expert Product Demonstrator:</strong>&nbsp;You have a passion for presenting user-friendly, elegantly designed solutions to decision-makers and large audiences and drawing from user stories.</li><li><strong>Technical Solutions Consultant:</strong>&nbsp;You will work closely with the Account Executive team to execute on open opportunities. You are responsible for the technical relationship, discovering and qualifying opportunities from a technical standpoint, addressing the technical questions, and helping drive solutions that leverage the Interfolio product suite.</li><li><strong>Buyer Advocate:&nbsp;</strong>A client-centric approach is core to your approach. Creating and cultivating relationships with a diverse group of individuals comes naturally to you.</li><li><strong>Passionate about Higher Education:</strong>&nbsp;Your passion for higher education drives you and the work you do. You’re excited to get out of bed in the morning and willing to take on “tiger team” responsibilities that go beyond the job description. &nbsp;&nbsp;</li></ul></ul></ul><p><strong>Specific Responsibilities</strong></p><ul><ul><ul><li>Deliver tailored, technical product demonstrations both onsite and virtually that showcase the breadth and depth of Interfolio’s products, while expertly navigating through functional and technical questions from decision makers and end users</li><li>Partner with regional AE team members to close customer opportunities</li><li>Assist in scoping conversations and create custom SOWs and detailed implementation plans for prospective clients (in collaboration with Professional Services). Be well-versed in client best practices specifically related back to implementation</li><li>Lead technical conversations with the IT team at prospective client institutions</li><li>Identify and develop product and technical sales assets needed throughout the buyer’s journey</li><li>Ability to assist in proposal writing and IT questionnaire responses for new business opportunities</li><li>Help manage the RFP content management knowledge base</li><li>Build out our sales demo environment (“Sandbox”) for all product modules. Map out the FIS storyline and create new demo scripts</li><li>Partner with internal departments, in particular our Product and Product Strategy teams, to relay product feedback, &nbsp;contribute to product development, and decide how to communicate new releases to prospective buyers and current clients</li><li>Master our diverse product portfolio while being well-versed on the competitive landscape</li><li>Relay new product updates and enhancements with sales team</li><li>Assist with product training of new sales personnel</li><li>Evangelize Interfolio’s approach to providing the first-of-its-kind faculty-centric platform for universities and colleges in all engagements</li><li>Report to Associate Director, Sales Operations</li></ul></ul></ul><p><strong>Basic Qualifications</strong></p><ul><ul><ul><li>Bachelor’s degree in a technical field or equivalent experience--some of our best employees have degrees in non-related fields and are rock stars</li><li>3+ years of work experience in technology consulting, product management, implementation consulting, software development, and/or demonstrating enterprise SaaS solutions in a sales capacity</li><li>Thorough understanding of SaaS solutions. Technical mindset with an aptitude for problem solving and delivering customer-driven solutions</li><li>Experience with Salesforce</li><li>Be able to speak and write fluently in English (as a minimum requirement)</li><li>Excellent verbal and communication skills</li><li>Willing and able to travel up to 60% of the time</li></ul></ul></ul><p><strong>Ideal Qualifications</strong></p><ul><ul><ul><li>Experience working for, or delivering services to, universities and colleges are a significant plus</li><li>Prior experience as a sales engineer or solutions consultant</li><li>Technical acumen, i.e. can speak elegantly on SaaS platforms, APIs, data security, etc</li><li>Thrives in an exciting, fast-paced, action-packed work environment - we’re an early stage, high growth company!</li></ul></ul></ul>Applicants for this position must currently reside in the continental United States. In addition to a competitive salary, Interfolio offers a robust benefits package that includes medical insurance, unlimited PTO, a wellness benefit, 401k, and professional development opportunities. Our culture sets us apart—we look forward sharing more about our company and our team!                </div>            <div>        <a href='https://jobs.lever.co/interfolio/4b7d18d8-8b1b-45ec-8974-a570283cd903?lever-origin=applied&amp;lever-source%5B%5D=StackOverflow' rel='nofollow'>                        Apply now        </a></div>            <h3>About Interfolio, Inc</h3>            <div><p>Interfolio is on a mission to build smart, inspired and useful products for faculty and academic communities. By building an engine for faculty activity, decisions, and data, Interfolio has become the first mover in defining and leading the category of faculty-focused technology that cultivates goal-oriented collaboration around academic decision-making.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Medical, Dental &amp; Vision Insurance</span>                            </li>                            <li>                                <span></span>                                <span>401K Plan</span>                            </li>                            <li>                                <span></span>                                <span>Professional Development Program</span>                            </li>                            <li>                                <span></span>                                <span>Life &amp; Disability Coverage</span>                            </li>                            <li>                                <span></span>                                <span>Unlimited PTO</span>                            </li>                            <li>                                <span></span>                                <span>Wellness benefit stipend</span>                            </li>                            <li>                                <span></span>                                <span>Snacks in the office</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "8JxNZW6vRZ-8PAFhwyGVdQ",
    "url": "https://stackoverflow.com/jobs/172410/php-plus-laravel-engineer-at-high-growth-fintech-lenox-park-solutions-llc?a=VOTNmFSPHQk",
    "title": "PHP + Laravel Engineer at High-Growth FinTech Company at Lenox Park Solutions LLC (Austin, TX) ",
    "tags": [
      "DBG:surround``2N(work, remot) 2N OR(option, allow, abl, possibl, permit)",
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:laravel/php/40",
      "DBG_TECH1:k/t/w:php/php/35",
      "DBG_TECH1:k/t/w:reactjs/frontend/8",
      "DBG_TECH1:k/t/w:vue.js/frontend/16",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=75, embedded=0, frontend=24}",
      "REMOTE1/50",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "Lenox Park Solutions LLC",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 35000,
      "maxValue": 40000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserDefaultImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2018 9:06:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>PHP + Laravel Engineer at High-Growth FinTech Company</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Contract</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Junior, Mid-Level</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Backend Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Financial Technology, Investment Banking, Software Development / Engineering</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>1-10 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: Lenox Park Solutions LLC | Austin, TX<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Austin, TX.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>php</div><div>laravel</div><div>vue.js</div><div>ubuntu</div><div>linux</div>                <h3>Job description</h3>                <div><p>Lenox Park Solutions is seeking a PHP Engineer with 2-5 years of commercial experience. As a PHP Engineer, you would work closely with our Development team to code and test functionality which will directly increase the scalability of Roundtables, our flagship product which will disrupt and revitalize the Asset Management industry. The junior developer will work directly with an experienced Senior PHP Engineer in helping to execute platform development, and will have the opportunity to grow within the organization as LPS expands it technical team. At LPS, we focus on accountability, proactive-ness, and creative thinking. Staff members retain the option to work remotely, as we are a goals-oriented team.</p><ul><li><strong>Requirements</strong>:</li><ul><li>Professional experience on PHP, specifically with Laravel, VueJS/ReactJS, and Git, and preferably with Laravel Queues, Websockets, Amazon Web Services, and Linux (Ubuntu);</li><li>Outstanding communication skills, both verbal and written experience with technical and non-technical audiences;</li><li>Ability to assess ongoing processes critically and recommend creative, thoughtful operational improvements;</li></ul><li><strong>Preferred Skills</strong>:</li><ul><li>Understanding of Asset Management industry;</li><li>Business-oriented, highly analytical mind with a knack for accounting for both complex business and technical considerations simultaneously</li></ul></ul>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/172410?reset=False&amp;ra=VOTNmFSPHQk&amp;oqs=a%3DVOTNmFSPHQk' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About Lenox Park Solutions LLC</h3>            <div><p>Lenox Park Solutions LLC (LPS) is a FinTech firm focused on Asset Managers and Financial Institutions. Our mission is to enable the democratization of access to Institutional capital by using technology to match best-in-class Asset Allocators with the most talented Asset Managers. Our solutions will challenge entrenched traditional notions of who should be able to manage money, upending the staid model where pedigree and privilege drive capital allocation. Leveraging deep experience in investment banking and asset management, LPS licenses CRM solutions that emphasize networking and collaboration to manage Fundraising, Deal Pipeline, Business Development and Operations. LPS maintains offices in New York, NY and Austin, TX.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Remote Office</span>                            </li>                            <li>                                <span></span>                                <span>Experienced Investment Professionals</span>                            </li>                            <li>                                <span></span>                                <span>Austin and New York Offices</span>                            </li>                            <li>                                <span></span>                                <span>Lean, Entrepreneurial Team</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "TUHQxNIKSgOa1ywm_hguqA",
    "url": "https://stackoverflow.com/jobs/151620/ruby-developer-rean-cloud?a=OQCbZQVb4XK",
    "title": "Ruby Developer at REAN Cloud (Herndon, VA) ",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``3N(locat,remot)",
      "DBG_TECH1:k/t/w:embedded/c/1",
      "DBG_TECH1:k/t/w:embedded/embedded/8",
      "DBG_TECH1:k/t/w:rake/ruby/8",
      "DBG_TECH1:k/t/w:rspec/ruby/8",
      "DBG_TECH1:k/t/w:ruby-developer/ruby/39",
      "DBG_TECH1:k/t/w:ruby/ruby/10",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=1, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=65, apple=0, java=0, gamedev=0, php=0, embedded=8, frontend=0}",
      "REMOTE1/50",
      "TECH1/ruby",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "ruby"
    ],
    "hiringOrganization": {
      "name": "REAN Cloud",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2018 9:06:10 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Ruby Developer</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level, Senior</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>System Administrator</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>Cloud Computing, Digital Health, Education Technology</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>201-500 people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: REAN Cloud | Herndon, VA<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Herndon, VA.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                </div>                    </div>                <h3>Technologies</h3><div></div><div>amazon-web-services</div><div>ruby</div><div>docker</div><div>automation</div>                <h3>Job description</h3>                <div><p><span>REAN Cloud, a major player in the AWS Partner Network is growing substantially and looking for a strong&nbsp;</span><strong>Ruby Developer</strong><span>&nbsp;to join our talented team.&nbsp;REAN Cloud&nbsp;works with enterprise level organizations on some of the world’s largest automation and cloud deployment projects.&nbsp; You would be embedded into a talented, senior team providing best-in-class solutions for extremely complex issues and have the ability to work with cutting edge technology platforms and tools.</span></p><p><span>Ideally, we are looking for a professional with experience in automating large scale deployments with modern configuration and deployment management systems. You will be working on a team of talented engineers to solve some of the most complex and exciting challenges facing the world of IT Automation and cloud deployments.</span></p><p><strong>Must-Have Skills</strong></p><ul><li><span>Bachelor’s Degree in Computer Science, Information Technology or equivalent work experience</span></li><li><span>5+ years using Ruby, and 2+ years building libraries or frameworks</span></li><li><span>2+ years experience with Docker</span></li><li><span>2+ years experience with Rake</span></li><li><span>2+ years experience with RSpec</span></li><li><span>2+ years experience writing Unit tests and Integration tests</span></li><li><span>2+ years Cloud experience (Amazon Web Services)</span></li><li><span>2+ years automation experience using Jenkins</span></li></ul><p><strong>Desired Skills</strong></p><ul><li><span> Experience with:</span></li><ul><li><span>Jenkins Job DSL</span></li><li><span>Jenkins Pipeline DSL</span></li><li><span>Experience writing tools for developers</span></li></ul></ul><p><span>Perks of your working life at REAN:</span></p><ul><li><span>Health, Dental, Vision and Life Insurance company provided</span></li><li><span>401k retirement plans</span></li><li><span>Flexible working hours and ability to work from home on occasion</span></li><li><span>Comfortable and exciting office atmosphere promoting innovation</span></li><li><span>Ability to directly impact a growing business</span></li></ul><p><br><span>If interested, send us your resume at </span><span><a href='mailto:careers@reancloud.com' rel='nofollow'>careers@reancloud.com</a></span></p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/151620?reset=False&amp;ra=OQCbZQVb4XK&amp;oqs=a%3DOQCbZQVb4XK' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About REAN Cloud</h3>            <div><p>REAN Cloud, a Premier AWS Partner is growing substantially and looking for a highly driven individual with excellent leadership qualities to support our talented sales team. REAN Cloud works with startups to enterprise level organizations providing best in class solutions for some of the world’s largest cloud integration projects. Companies near and far are looking to the cloud for simplicity in business, instantaneous data retrieval and constant collaboration beyond boundaries. &nbsp;REAN Cloud is on the forefront of this market and our services are in demand. &nbsp;The REAN Cloud Sales team is responsible for identifying, qualifying and capturing the business of companies taking their infrastructure to the cloud.</p><p>For any further information, please visit our website at or contact us at <a href='mailto:info@reancloud.com' rel='nofollow'>info@reancloud.com</a> or +1 (844) 377-7326.</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>health</span>                            </li>                            <li>                                <span></span>                                <span>agressive bonuses</span>                            </li>                            <li>                                <span></span>                                <span>Work Remotely!</span>                            </li>                            <li>                                <span></span>                                <span>Flexible Hours</span>                            </li>                            <li>                                <span></span>                                <span>Budget for Tech Conferences</span>                            </li>                            <li>                                <span></span>                                <span>Dental, Vision</span>                            </li>                            <li>                                <span></span>                                <span>401(k)</span>                            </li>                            <li>                                <span></span>                                <span>Exercise Competitions</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "JwupdjDaR4-s8SVacNCUKw",
    "url": "http://jobmote.com/jobs/25276-unica-business-solutions-consultant-bsc-remote-opportunity",
    "title": "Unica Business Solutions Consultant (BSC) - Remote Opportunity",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:extjs/frontend/8",
      "DBG_TECH1:k/t/w:java/java/2",
      "DBG_TECH1:k/t/w:java/mobile/1",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=1, go=0, nodejs=0, bigdata-ml=0, ruby=2, apple=0, java=2, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Tanisha Systems, Inc.",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 11, 2018 6:21:59 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p><em><strong>Unica Business Solutions Consultant (BSC) - 100% Remote - Fulltime Permanent</strong></em></p><p><em>Note - <strong>75% travel required (Mostly CA)</strong></em></p><p><strong>Job Description</strong></p><p><strong>Summary:</strong></p><p>The Unica Business Solutions Consultant is responsible for providing product configuration expertise during Unica software implementations, upgrades and workshops, facilitating solution definition, design, testing, implementation and user adoption. Perform requirements gathering/confirmation, functional solution design, application configuration, unit and system integration testing, UAT and deployment support across the Unica Suite: Campaign, Interact, Contact Optimization and Marketing Operations.</p><p>Knowledge and functional experience with the supporting third-party components including: web application layer, database and operating systems is also required.</p><p>This position requires the ability to work independently, take accountability for solution/services sales and delivery and function as a team member with both colleagues and clients.</p><p><strong>Experience:</strong></p><p>Qualified candidates should have 5+ years of experience and a demonstrated track record in solution design, functional configuration, user adoption of Unica marketing solutions. The role requires a 4-year university degree.</p><p><strong>Responsibilities:</strong></p><ol><li><p>Qualified candidates are responsible for implementation of IBM Campaign, Contact Optimization, Marketing Operations, and IBM Interact:</p><ol><li>Lead lab services customer engagements providing solutions, specifically facilitating client-facing activities related to requirements and design for solution definition, proposal and client acceptance.</li><li>Document, present and gain client acceptance of proposed Unica marketing solutions (e.g., requirements documentation, design documents and associated diagrams and write-ups).</li><li>Perform product configuration and perform testing: unit and system, including use case and test plan creation/execution. Support/facilitate customer executed UAT.</li><li>Perform and/or support product configuration asset migration across environments, including production deployment and go-live.</li><li>Provide guidance and enablement to client marketing staff in the configuration and best practice usage of the Unica products, as well as supporting data exchange and reporting with other source/destination applications.</li><li>Apply common data modeling, design, and documentation techniques (e.g., Entity Relationship Diagrams (ERDs), data dictionaries, Visio diagram views).</li><li>Some familiarity with Java API program design, development, unit test and execution.</li><li>Build intellectual capital to be used as accelerators for solution delivery, and enablement.</li><li>Must be able to lead and facilitate client interactions throughout the entire implementation lifecycle to achieve the desired outcome, including requirements and design sessions, document reviews/approvals, training and enablement both in group and one-to-one settings.</li><li>Perform product demonstrations both in a pre-sales and post-sales capacity.</li><li>Surface project risks, scope changes and additional opportunities to rest of team.</li><li>Assist with the preparation of business cases and project scoping.</li><li>Assist with product and services sales opportunities.</li></ol></li></ol><p>_ <strong>Products:</strong> _</p><p><em>IBM Campaign, IBM Contact Optimization, IBM Marketing Operations, and IBM Interact. All were formally branded Unica or Affinium.</em></p><p><strong>Thanks</strong>!</p><p><strong>Ruby Kumari</strong></p><p>Tanisha Systems Inc.</p><p>Email:</p><p>Direct: +1- EXT 328</p><ul><li>provided by Dice Looking For Unica Business Solutions Consultant (BSC) - 100% Remote </li></ul></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "LR5Lfy4ES8aEmRxkJWyOtQ",
    "url": "http://jobmote.com/jobs/25254-sailpoint-solution-architect-remote-identity-and-access-management-iam",
    "title": "Sailpoint Solution Architect-Remote-Identity and Access Management/IAM",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:k/t/w:internet-explorer/frontend/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "WSI Nationwide",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 140000,
      "maxValue": 160000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 10, 2018 9:21:41 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p>Qualified Identity and Access Management/IAM Solution Architect candidates need experience with SailPoint/SailpointIQ.</p><p>If no strong SailPoint experience it's a no-go. Candidates will ideally come from a software development background. We will entertain candidates from either end user or service provider backgrounds. This role is remote with travel so candidates can be based anywhere in the US. Must have easily understood English speaking skills.</p><p>Location Virtual-Remote-Telecommute 35% travel<br>Starting base salary-generous at $140,000 to $160,000 per year, more for specific skills very flexible, Also part of the comp package are full time health benefits along with significant career progression opportunity.</p><p>This is a permanent position working for a leading Cyber Security Solution provider servicing large enterprise organizations and US Government agencies.</p><p>In this Identity and Access Management Solution Architect position you will be the primary customer interface and technical authority with regard to IAM products and solutions. </p><p>Duties and Responsibilities</p><p>-Provides technical design and consulting services on (IAM) Identity and Access Management (IAM) products<br>-Provides customer specific though leadership and solution construction including installations of Identity and Access Management (IAM) products for User life cycle management, Identity and Access Governance, Automated Provisioning, (SSO) Single Sign-On, Federation, and Privileged Account Management<br>-Enhances existing systems by analysing business objectives, preparing an action plan and identifying areas for modification and improvement<br>-Creates customer level documentation specific to deployment of IAM products<br>-Creates knowledge articles for corporate website related to IAM<br>-Provide regular feedback to the Professional Services Director to guide systems integration methodology and packages service development </p><p>Technical Experience and Qualifications</p><p>-Experience with SailPoint<br>-Lead customer-focused discussions and interact with our customers as the primary technical authority for an engagement<br>-Ability to present project solutions to clients, manage client expectations, and implement and deliver solutions<br>-Become a subject matter expert with IAM products and concepts<br>-Web Application security<br>-Software Security<br>-HTTP and related technologies<br>-Database/Directory integration<br>-x509 Certificates<br>-Windows, Unix, Linux<br>-Experience with IAM products: Radiant Logic, Sailpoint/SailpointIQ, Centrify, ForgeRock, Ping Identity, IBM, Okta, Oracle, RSA, simeio<br>-Federated Identity and Single Sign-On<br>-Access Management and API Gateways<br>-SAML, WS-Federation, OAuth, OpenID Connect, and/or SCIM standards<br>-RADIUS and/or KERBEROS<br>-APIs (SOAP, XML, REST, JSON)<br>-Social APIs including Facebook, Twitter, LinkedIn, etc.<br>-User Directory (Active Directory OpenLDAP, OpenDJ, etc.)<br>-Java and/or .NET development<br>-Amazon's AWS services (ie VPCs, SES, RC2, R3, Route 53, Cloud Formation, etc.)</p><p>Please e-mail a resume with contact information, address and phones to Jay J, with the subject line of this message in the subject line of the message you send, (no URL resume links or ZIP files and please do not return a copy of this announcement with your response) or call.</p><p>When resumes are received, the candidate is contacted if there is a match, the situation is thoroughly described and the candidate tells us how they would like us to proceed. No information leaves our office without prior approval.</p><p>This creates long term relationships, which we encourage.</p><p>WSI is a specialty recruiting organization with over twenty years experience and fees paid by our selected client companies, freeing our hands to find top level candidates for better projects all over the USA.</p><p></p></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "LdJdjw1YThOo30DJdxmcPw",
    "url": "http://jobmote.com/jobs/25248-ping-access-iam-solution-architect-remote-identity-and-access-manag",
    "title": "Ping Access IAM Solution Architect - Remote, Identity and Access Manag",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG_TECH1:k/t/w:dotnet/dotnet/8",
      "DBG_TECH1:k/t/w:internet-explorer/frontend/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=2}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "WSI Nationwide",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 100000,
      "maxValue": 120000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Sep 10, 2018 8:20:24 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><div><div></div></div><div><div><div><p>Identity and Access Management/IAM Solution Architect candidates will have experience with Ping Access. Candidates will ideally come from a software development background. We will entertain candidates from either end user or service provider backgrounds. This role is remote with travel so candidates can be based anywhere in the US.</p><p>Location - Virtual-Remote-Telecommute - 35% national travel<br>Starting salary $100,000 to $120,000+ per year, Also part of the comp package are full time health benefits along with significant career progression opportunity.</p><p>This is a permanent position working for a leading Cyber Security Solution provider servicing large enterprise organizations and US Government agencies.</p><p>In this Identity and Access Management Solution Architect position you will be the primary customer interface and technical authority with regard to IAM products and solutions.</p><p>Duties and Responsibilities<br>-Provides technical design and consulting services on (IAM) Identity and Access Management (IAM) products<br>-Provides customer specific though leadership and solution construction including installations of Identity and Access Management (IAM) products for User life cycle management, Identity and Access Governance, Automated Provisioning, (SSO) Single Sign-On, Federation, and Privileged Account Management<br>-Enhances existing systems by analysing business objectives, preparing an action plan and identifying areas for modification and improvement<br>-Creates customer level documentation specific to deployment of IAM products<br>-Creates knowledge articles for corporate website related to IAM<br>-Provide regular feedback to the Professional Services Director to guide systems integration methodology and packages service development </p><p>Technical Experience and Qualifications<br>-Experience with Ping Access<br>-Lead customer-focused discussions and interact with our customers as the primary technical authority for an engagement<br>-Ability to present project solutions to clients, manage client expectations, and implement and deliver solutions<br>-Become a subject matter expert with IAM products and concepts<br>-Web Application security<br>-Software Security<br>-HTTP and related technologies<br>-Database/Directory integration<br>-x509 Certificates<br>-Windows, Unix, Linux<br>-Experience with some combination of IAM products: Radiant Logic, Sailpoint, Centrify, ForgeRock, Ping Access, Ping Identity/Ping ID/PingID, PingFederate, IBM, Okta, Oracle, RSA, simeio<br>-Federated Identity and Single Sign-On<br>-Access Management and API Gateways<br>-SAML, WS-Federation, OAuth, OpenID Connect, and/or SCIM standards<br>-RADIUS and/or KERBEROS<br>-APIs (SOAP, XML, REST, JSON)<br>-Social APIs including Facebook, Twitter, LinkedIn, etc.<br>-User Directory (Active Directory OpenLDAP, OpenDJ, etc.)<br>-Java and/or .NET development<br>-Amazon's AWS services (ie VPCs, SES, RC2, R3, Route 53, Cloud Formation, etc.)</p><p></p></div></div><div></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "OZzkR6B2RUqQWcICIrK1jg",
    "url": "https://remoteok.io/jobs/68691",
    "title": "Sales Engineer Solutions Architect",
    "tags": [
      "DBG:classic``&quot;open to remot&quot;",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/solution",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Interfolio",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 30, 2018 6:21:08 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<td><span><h2>Sales Engineer Solutions Architect</h2></span><br><span><h3>Interfolio</h3></span></td><div><div>Interfolio is on a mission to build smart, inspired and useful products for faculty and academic communities. By building an engine for faculty activity, decisions, and data, Interfolio has become the first mover in defining and owning the category of faculty-focused technology that cultivates goal-oriented collaboration around academic decision-making.<br>Interfolio operates the first holistic faculty information system to support the full lifecycle of faculty work, from job seeking to review, tenure, sabbatical, committee work, research, and beyond. Offering colleges and universities increased clarity and insight into faculty data to help achieve their strategic initiatives, Interfolio believes that advancing the faculty will advance the institution.<br><br>What’s even better than that? <br><br>We’ve crafted a fun, collegial, dynamic culture that celebrates team and individual success almost daily. We’ve got a lean team of super-smart, super-hard working, local and remote colleagues who collaborate closely to produce a valuable service for an industry we’re passionate about. And, we genuinely like working with each other and with our clients.<br><br>Like what you’ve heard so far?<br><br>Then consider joining our Sales team. The position of Sales Engineer (Solutions Consultant) is open to remote employees as well as locals in commuting distance to our Washington, D.C. office.<br><br>Interfolio is committed to diversity and the principle of equal employment opportunity for all employees. You will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), national, social or ethnic origin, age, gender identity and/or expression, sexual orientation, family or parental status, or any status protected by the laws or regulations in locations where we operate.<br><br>About the Role<br><br>A thought leader and strategic partner to the Sales Team, you will own all technical and product-related activities required throughout the sales life cycle. Keenly attuned to the buyer’s journey, you are a trusted advisor to the buyer (Provosts, Vice Provosts, CIOs, etc.) and play a primary role in creating larger buy-in across all stakeholders (including functional end users) by architecting buyer vision and mapping it to our product suite. You will engage audiences through tailored, compelling product demonstrations and fully address any functional and technical questions that may arise with professionalism and tact. You will be the product matter and technical expert within Sales and will work closely with other departments to relay product feedback from out in the field, create and maintain the sales demo environment, and help contribute to the development of our product roadmap. This role lives within the Sales department at Interfolio, under the Sales Operations division. &nbsp;&nbsp;<br><br><br><br>About You<br><br><br><br><br><br><br>* Platform Evangelist and Expert Product Demonstrator:&nbsp;You have a passion for presenting user-friendly, elegantly designed solutions to decision-makers and large audiences and drawing from user stories.<br><br>* Technical Solutions Consultant:&nbsp;You will work closely with the Account Executive team to execute on open opportunities. You are responsible for the technical relationship, discovering and qualifying opportunities from a technical standpoint, addressing the technical questions, and helping drive solutions that leverage the Interfolio product suite.<br><br>* Buyer Advocate:&nbsp;A client-centric approach is core to your approach. Creating and cultivating relationships with a diverse group of individuals comes naturally to you.<br><br>* Passionate about Higher Education:&nbsp;Your passion for higher education drives you and the work you do. You’re excited to get out of bed in the morning and willing to take on “tiger team” responsibilities that go beyond the job description. &nbsp;&nbsp;<br><br><br><br><br><br><br><br><br><br><br>Specific Responsibilities<br><br><br><br><br><br><br>* Deliver tailored, technical product demonstrations both onsite and virtually that showcase the breadth and depth of Interfolio’s products, while expertly navigating through functional and technical questions from decision makers and end users<br><br>* Partner with regional AE team members to close customer opportunities<br><br>* Assist in scoping conversations and create custom SOWs and detailed implementation plans for prospective clients (in collaboration with Professional Services). Be well-versed in client best practices specifically related back to implementation<br><br>* Lead technical conversations with the IT team at prospective client institutions<br><br>* Identify and develop product and technical sales assets needed throughout the buyer’s journey<br><br>* Ability to assist in proposal writing and IT questionnaire responses for new business opportunities<br><br>* Help manage the RFP content management knowledge base<br><br>* Build out our sales demo environment (“Sandbox”) for all product modules. Map out the FIS storyline and create new demo scripts<br><br>* Partner with internal departments, in particular our Product and Product Strategy teams, to relay product feedback, &nbsp;contribute to product development, and decide how to communicate new releases to prospective buyers and current clients<br><br>* Master our diverse product portfolio while being well-versed on the competitive landscape<br><br>* Relay new product updates and enhancements with sales team<br><br>* Assist with product training of new sales personnel<br><br>* Evangelize Interfolio’s approach to providing the first-of-its-kind faculty-centric platform for universities and colleges in all engagements<br><br>* Report to Associate Director, Sales Operations<br><br><br><br><br><br><br><br><br><br><br>Basic Qualifications<br><br><br><br><br><br><br>* Bachelor’s degree in a technical field or equivalent experience--some of our best employees have degrees in non-related fields and are rock stars<br><br>* 3+ years of work experience in technology consulting, product management, implementation consulting, software development, and/or demonstrating enterprise SaaS solutions in a sales capacity<br><br>* Thorough understanding of SaaS solutions. Technical mindset with an aptitude for problem solving and delivering customer-driven solutions<br><br>* Experience with Salesforce<br><br>* Be able to speak and write fluently in English (as a minimum requirement)<br><br>* Excellent verbal and communication skills<br><br>* Willing and able to travel up to 60% of the time<br><br><br><br><br><br><br><br><br><br><br>Ideal Qualifications<br><br><br><br><br><br><br>* Experience working for, or delivering services to, universities and colleges are a significant plus<br><br>* Prior experience as a sales engineer or solutions consultant<br><br>* Technical acumen, i.e. can speak elegantly on SaaS platforms, APIs, data security, etc<br><br>* Thrives in an exciting, fast-paced, action-packed work environment - we’re an early stage, high growth company!<br><br><br><br><br><br><br><br><br><br>Applicants for this position must currently reside in the continental United States. In addition to a competitive salary, Interfolio offers a robust benefits package that includes medical insurance, unlimited PTO, a wellness benefit, 401k, and professional development opportunities. Our culture sets us apart—we look forward sharing more about our company and our team!<p>See more jobs at <span>Interfolio</span></p></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "0qGhE-ztRA-d_knH2P-xMw",
    "url": "http://www.indeed.co.uk/viewjob?t=PHP+Developer&jk=4d596ab3e6d3189f&",
    "title": "PHP Developer - Opus Recruitment Solutions - Bridgend",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:jquery/frontend/8",
      "DBG_TECH1:k/t/w:php/php/15",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=15, embedded=0, frontend=12}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/php",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "php"
    ],
    "hiringOrganization": {
      "name": "Opus Recruitment Solutions",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "SalaryParserWithNoiseImpl",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 23, 2018 10:32:51 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h3>PHP Developer</h3><div>Company: Opus Recruitment Solutions<br></div><div>Location: Bridgend<br></div><div>£20,000 - £30,000 a year -<br><br></div><div>Permanent<br><br></div><span><div>An exciting opportunity has arisen to work for a up and coming start-up company based in Bridgend. They've had an impressive rise in the last twelve months and continue to grow. Since the beginning of 2018 the company has come on leaps and bounds, taking on a number of new clients and in the process of moving to a brand new office in the next few months.<br><br>Because of the impressive growth they are looking to take on developer who has a real passion for technology.<br><br>If you have the following skills it would be a massive bonus:<br><ul><li>PHP</li><li>HTML/CSS</li><li>Javascript/Jquery</li></ul><br>Bonuses:<br><ul><li>Competitive Salary</li><li>Flexible Working Hours</li><li>Remote Working</li><li>Performance Related Bonus</li></ul>If you'd like to find out more about the company and the role then please get in touch with matt.north@opusrs.com or call 0117 302 7733.</div></span>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "U_ojjlvtRJyOtYdbUcg6wQ",
    "url": "https://cjl.ist/2vk0zKW",
    "title": "Holochain Developer - Cryptography, Security, Identity",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/solution",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 90000,
      "maxValue": 140000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 30, 2018 2:36:05 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Holochain Developer - Cryptography, Security, Identity</h2>   Location:    Remote    Remote  <div>  Role and job type: Full-time </div> <div>  <h3>Job Description</h3>  <p>The Holo team will be working on many of the following activities:</p>  <ul>   <li>Signed Service Logs</li>   <li>Anon/Web gateway services </li>   <li>Virtual Source Chain Mgt</li>   <li>Web browser key management</li>   <li>Collect &amp; share peer performance metrics</li>   <li>HQuery for hashing/signing, etc.</li>   <li>User Centric container management</li>   <li><span>[email&nbsp;protected]</span> routing/NAT</li>   <li>Calculating Host Performance Levels</li>   <li>DNS on CDN - JavaScript service workers</li>   <li>Sub browser to CDN w/domain certs</li>   <li>UI for app providers</li>   <li>UI for admins</li>   <li>Log analytics for fraud detection</li>   <li>Scaling and load tests</li>   <li>HoloPort cloud service</li>  </ul>  <p>And much more…</p>  <p>What we offer:</p>  <ul>   <li>Starts with a 3 Month Contract to Hire (dependent on country and employment laws)</li>   <li>Generous salary (National Currency or ETH)</li>   <li>Generous bonus program (HOT &amp; Holo fuel)</li>   <li>BYOE with Equipment Reimbursement</li>   <li>Remote work</li>   <li>Regular team meetings (video and in person)</li>   <li>Agile/Scrum</li>   <li>Pair Programming Opportunities</li>   <li>Collaborative and Inspiring Culture</li>   <li>Creating Benefits Programs based on wants and needs of the team</li>   <li>Flexible Work Schedules and Vacation</li>  </ul>  <h4>Salary range</h4>  <p>USD $90k - $140k</p> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
