{
 "items": [
  {
    "id": "yp_2cWmyQsKdtbkQP7ecaQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/173095/business-intelligence-bi-developer-webrtcventures?a=W38RVaBPD0I",
    "title": "Business Intelligence (BI) Developer at WebRTC.ventures  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Full-time</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Senior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Database Administrator</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Computer Software, Web Design, Web Development</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>The Report Developer is primarily responsible for building reports and other Visualization products (subscriptions, views on reports, etc.) and administering user accounts for Visualization products. The Report Developer may also be responsible for making bug fixes on Visualization products and interacting with customers on report design and report validation. With training, the Report Developer will graduate to creating and/or modifying domains, topics, database queries or other means of extracting data from the analytics warehouse.</p><p><strong>Your experience should show some or all of these:</strong></p><ul><li>One to two years experience with at least one Reporting/Analytics commercial product</li><li>Exploration of data through ad hoc reporting</li><li>Deep SQL skills querying a relational database</li><li>Working knowledge of data warehousing concepts</li><li>Exacting standards and attention to detail</li><li>Efficiency and a desire to execute time-saving strategies</li><li>Analytical disposition that often leads to new or greater insight&nbsp;</li></ul><p><strong>It’s great if your experience also demonstrates:</strong></p><ul><li>Experience with Jaspersoft to build ad hocs, reports, and dashboards</li><li>Experience with ETL tools</li><li>Educational background in statistics</li><li>Agility in a Linux environment</li><li>Work in an AWS environment</li><li>Familiarity with the commercial trucking industry</li></ul><p><strong>Education:</strong></p><p>4 year degree or equivalent experience</p>                    </div>                            <h2>                About WebRTC.ventures            </h2>            <div><p>AgilityFeat was founded in 2010 by Arin Sime. Arin lives in Virginia, and travels around the companies American training methodologies agile and Scrum and Kanban. <br><br>In 2011, Arin was associated with David Alfaro of Costa Rica to begin providing development services software nearshore to customers AgilityFeat in the USA. David is a leading IT experience in Costa Rica, and well known in Costa Rica as one of the first to bring Agile to America Central. <br><br>David and Arin ensure that AgilityFeat always strives to deliver high quality services and high efficiency for our customers. <br><br>But our team full command so that really makes us special. Read our Commando's Creed to know the values that have made us successful <a href='http://www.agilityfeat.com/creed' rel='nofollow'>http://www.agilityfeat.com/creed</a></p>            </div>                                <h2>Benefits</h2>                            <div>                                 100% Remote - Work From Home                            </div>                            <div>                                 Paid Company Outings                            </div>                            <div>                                 Flexible Work Hours                            </div>                            <div>                                 Passionate People                            </div>                            <div>                                 Cutting Edge Technologies                            </div>                            <div>                                 Ideal Environment for Creative Minds                            </div>                    ",
    "urlFetchPending": false,
    "published": "Apr 15, 2018 2:07:51 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "25806T5eSqODAlaAtZN9Eg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/67938/account-executive-at-safetyculture/",
    "title": "Account Executive",
    "content": "<br />The Role<br /><br />You're a hunter at heart but can bring the balance of empathy to our customers as we solve a very important problem. Make no mistake you are responsible for new business and converting leads.<br /><br />The primary objective of an Account Executive will be to deliver the SafetyCulture value proposition, demonstrate solutions to their pain points, and follow up with them to solve their issues.<br /><br />As part of our Manchester team you'll be the first point of contact for high potential customers in the UK and Europe, working with them to ensure they have the best possible introduction for their implementation of iAuditor throughout their organisation.<br /><br />Are you game?<br /><br />The Soul<br /><br />You give a sh#t. You live and breathe customer solutions and you never (ever) give up until the problem is solved. You are a product advocate who is passionate about putting safety and quality in the hands of every worker.<br /><br />You’re not a passenger! You want to change the world. We are aiming for 1 million workers improving safety and quality by 2020.<br /><br />You’re driven to achieve, and than better those achievements again and again.<br /><br />The Responsibilities<br /><br />- Hunting for and connecting with high potential leads, finding your way to the right decision maker and assisting the customer through a potential trial<br />- Leads you’ll work may be already using the SafetyCulture solution to a small degree or might come through our marketing function - whether conferences, webinars, partnerships team or online enquiries<br />- Outstanding verbal and written communication skills and experience in a sales positions within the SaaS and B2B software space<br />- Proven work ethic, a commitment to personal development and an attitude of self-motivation.<br />- Deliver/present the SafetyCulture value proposition both online and in person<br />- Work with Sales Leadership and other critical company resources to meet or exceed company revenue goal<br />- Form strong links and collaborate with all teams across SafetyCulture<br />- Formal training and/or applied experience in sales methodologies such as Sandler, Command of the Message, Miller Heiman, or SPIN Selling<br /><br />Why SafetyCulture<br /><br />- We’re operating at a scale few other companies are, and you’ll be doing challenging work that impacts millions every day and helps to move the world forward.<br />- We have money in the bank and plentiful investors knocking on our doors<br />- We have HUGE ambitions. We aren’t scared to aim for tens of millions of users by 2025<br />- We operate within a largely untapped market with endless possibilities and we are a part of a new, exciting wave of SaaS companies that focus on frontline workers<br />- We know a thing or two about making our employees happy, and we go the extra mile connecting our people to our mission. The experience trips are an example of how we're pushing the boundaries of company culture and employee engagement<br /><br />Location:<br /><br />There is always something to explore in Manchester! Between the booming restaurant scene, interesting museums and galleries, and theatre and arts, Manchester is thriving. Not to mention, they can pour a good pint. Our office is located in the heart of the Northern Quarter, in an awesome warehouse space, surrounded by tech and creative businesses, and just a 5 minute walk from Piccadilly Station.",
    "urlFetchPending": false,
    "published": "Apr 12, 2018 12:06:18 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "_aTYrZCSRBWBpf22AS5J2g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/67925/sales-development-representative-at-geoblink/",
    "title": "Sales Development Representative",
    "content": "*About Geoblink*<br />Geoblink was founded in March 2015 with the goal of revolutionising the world of Location Intelligence and the way businesses think about, and act upon location intelligence data. We’ve already made some huge waves in the industry, raised more than 6M Euros in investment from top venture capital firms so far and been named by Bloomberg as ‘one of the 50 most promising startups of the world’<br /><br />Everyone at Geoblink is passionate about what they do, whether it be increasing businesses ROI or building complex data systems. People join Geoblink not just for the flexible work schedule, unlimited vacations, and unlimited tea/coffee/beers/cokes but because we offer everyone the opportunity to have real impact in the business and collaborate with some off the best minds in the industry (think McKinsey, MIT, CERN or EA Games). If you’re looking to get your foot in the door at a fast growing tech start-up and work your way up the career ladder then we have the perfect positions for you!<br /><br />*Who we’re looking to recruit*<br />We are looking for a highly energetic Sales Development Representative to be the liaison between our Marketing and Sales teams in the UK, Spanish or French market depending on your language skills, although the job is based in Madrid. You will be responsible for proactively seeking out and building new business opportunities in the market in order to boost sales and contribute to our long-term business growth. Don’t have any previous sales experience? No problem! What is important for us is that you are smart, empathetic that can easily build rapport with clients. Here is a list of some other things that we think would make someone good at the job:<br />* Goal driven and confident<br />*  Strong communicator (both written and verbal)<br />*  Fluent in either English, Spanish or French <br />* Tenacious and good with objection handling and problem solving<br />* Hands-on experience with multiple sales techniques (including cold calls) is a bonus<br /><br />*What you will be doing*<br />* Contacting potential clients through cold calls and emails to create business opportunities in the market<br />* Seeking out new leads to introduce Geoblink solution <br />* Identify potential clients’ business needs in order to communicate this to the Account Executives <br />* Build trusting and long lasting customer relationships from the start in order to contribute to the country team’s growth goals<br /><br />*Perks of the job*<br />* Unlimited holidays, flexible work schedule or ability to work from home<br />* Unlimited coffee, tea, coke to keep you going<br />* Chillout space with ping-pong, table football, etc<br />* Attractive compensation package<br />* Lots of space for you to work in peace so you can produce your best work<br />* Opportunity to collaborate with some of the best people in the industry <br />* Great career progression <br />* Quarterly off sites to awesome destinations, language tan<br />",
    "urlFetchPending": false,
    "published": "Apr 12, 2018 9:50:53 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "yhy3aq2OT5SG8yXRcDsCpg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/67923/enterprise-account-executive-french-speaking-at-invision/",
    "title": "Enterprise Account Executive (French speaking)",
    "content": "InVision is the Digital Product Design platform used to make the world’s best customer experiences. We provide design tools and educational resources for teams to navigate  every stage of the product design process, from ideation to development.<br /><br />Today, more than 3.5 million people use InVision to create a repeatable and streamlined design workflow; rapidly design and prototype products before writing code, and collaborate across their entire organization. That includes more than 80 percent of the Fortune 100, and organizations like Airbnb, Amazon, HBO, Netflix, Slack, Starbucks and Uber, who are now able to design better products, faster.<br /><br />InVision is a fully distributed company with employees in 25 countries around the world. The company has raised more than $235 million in funding from leading investors including Accel, ICONIQ, FirstMark, Tiger Global, Battery Ventures, and Spark Capital. Visit us at InVisionApp.com and InVisionApp.com/blog.<br /><br />Are you an experienced sales leader with a passion for design? Can you comfortably convey your enthusiasm, energy and good sense of humor over the phone? Are you well-connected to peers in leadership roles within design, product marketing, UX or user research? Do you possess a special skill for juggling responsibilities while wearing multiple hats?<br /><br />We're looking for an Enterprise Account Executive to capitalize on our growing global footprint, and own our European presence as we rapidly expand our Enterprise sales efforts in EMEA.<br /><br />*Requirements*:<br /><br />*5 years or more of inside sales experience in a B2B SaaS vertical<br />*Consistent track record of exceeding quota<br />*Referenceable executive-level customers at Fortune 2000 companies, major digital agencies and prominent tech firms<br />*Action-oriented and results driven, with a willingness to learn and adapt<br />*Fluent French speaker<br /><br />*Responsibilities*<br /><br />*Manage full sales cycle in a consultative manner, from initial qualification through product demo through follow up calls to closing<br />*You will enjoy being a visible presence for InVision in EMEA by being an active participant at industry conferences and networking events, engaged in client and prospective client on-sites and with the overall design community<br />*In addition to handling incoming leads, you will develop new business opportunities through your own efforts<br />*Drive strategic direction of InVision sales and customer success presence in EMEA<br />*Manage against company revenue targets<br />*Potential to build broader team to support EMEA growth",
    "urlFetchPending": false,
    "published": "Apr 12, 2018 9:25:46 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "dhai7e3-SpilaUM0A9GXZw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/351066-global-partnerships-manager-ethereal-summit",
    "title": "Global Partnerships Manager - Ethereal Summit",
    "content": "<div><h2>Global Partnerships Manager - Ethereal Summit at ConsenSys</h2><div>Brooklyn, San Francisco, Remote · Full Time</div><div></div></div><div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>ConsenSys is a venture production studio focused on building and scaling tools and enterprise software products on the Ethereum platform. Our mission is to use these solutions to power the emerging economic, social, and political operating systems of the planet.</p><p>Our teams are busy at work building the future of identity, financial markets, commerce, security and infrastructure, and more. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.</p><p>The Role</p><p>ConsenSys is seeking a Global Partnerships Manager for the Ethereal Summit team to oversee partnerships and sponsorships as the popular Ethereal Summit scales to become a leading global events brand. Working closely with the Design, Marketing, and Community teams, the Partnerships Manager will be responsible for the ongoing management of sales leads to help achieve annual business objectives and revenue targets. This includes proactively sourcing potential partners, delivery of existing partners’ contractual rights, developing and presenting creative partnership proposals, and establishing a permanent market presence for the global Ethereal Summit brand. </p><p>The ideal candidate has experience working in event management on the partnerships or sponsorships side, preferably in the technology and/or startup space, and has a deep network of potential sponsors to bring to Ethereal Summit. He or she should have a strong track record of success helping events achieve their sponsorship goals. While knowledge about Ethereum or blockchain technology is not required, candidates should be passionately interested in the technologies poised to transform the way we live, and prepared to learn about blockchain.</p><p>Responsibilities</p><p>Developing leads with prospective sponsors and partners, and building an industry network<br>Creating bespoke presentations, including market research and data to build powerful and persuasive proposals based on the business needs of potential clients<br>Using sponsorship assets to build and demonstrate innovative marketing programs which will add genuine value to potential clients<br>Manage all contractual rights and work with sponsors to deliver their activation goals<br>Create activation proposals for sponsors that align with their strategy<br>Be the central point of contact internally and externally for all partner related activity<br>Ensure other internal teams are fully aware of all campaign activities of sponsors<br>Work closely with the Ethereal Summit, Marketing, Design, and Community teams upholding the highest standards of communication and transparency</p><p>Requirements</p><p>Strong interpersonal and relationship management skills<br>Strong writing and communication skills<br>Ability to create and present materials that are effective and persuasive<br>Upbeat and positive personality, sense of humor, ability to collaborate productively with many different kinds of people<br>3+ years in a sponsorships or partnerships role for an events business<br>Deep knowledge of the events business, particularly technology and startup events</p></div>",
    "urlFetchPending": false,
    "published": "Apr 12, 2018 1:57:26 AM",
    "tags": [
      "Brooklyn",
      "Full Time",
      "Marketing",
      "REMOTE1/100",
      "Remote OK",
      "San Francisco",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "hRG8ViLdTt-dGGJg_VFcgQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/franchiseblast/jobs/15460-inside-sales-representative",
    "title": "Inside Sales Representative",
    "content": "<div><h2>Inside Sales Representative at FranchiseBlast</h2><div>Ottawa, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$35K–$100K<br>No Equity</div></div><h3>Job Description</h3><div><p>We are looking for someone who can make a significant impact at FranchiseBlast in an inside sales / business development role. We are demanding, but we are rewarding. We are at an inflection point in our company’s history and we would like to see the selected candidate advance in their role to become one of the core pillars of the company.</p><p>We offer a flexible work environment. Here are the required skills:<br>•    Good listening skills and empathy<br>•    Excellent understanding of the various business operations (legal, sales, accounting) to see things from the franchisor’s perspective. <br>•    Very comfortable with technology – ability to adapt to the technological level of the interlocutor and provide simple explanations<br>•    Be very confident without falling into arrogance<br>•    Possess previous experience in selling software solutions (in a startup environment)<br>•    Detail-oriented; be able to mention what the two founders of the company studied in university in their motivation letter <br>•    Ability to self-motivate, plan and manage time, develop your own working structures and seek to improve procedures on an ongoing basis<br>•    Ambitious and demanding, determined to succeed and willing to move forward in a changing environment<br>•    Creative : Able to recognize a need and find the best way to fill it<br>•    Excellent written and spoken English, ideally bilingual (French) <br>•    Having the audacity and flair for identifying opportunities, but also patience and resilience.</p><p>Assets<br>•    Experience in business and / or within a franchise<br>•    Self motivated and independent<br>•    University degree, new graduates welcome</p><p>Your Mission<br>•    Lead generation, demos and follow-ups <br>•    Develop strategies and apply best practices in sales<br>•    Work with the development team to identify requested features or ways to simplify the product <br>•    Timely report all technical difficulties with the site or customers<br>•    Wear different hats! (Marketing, for example)</p></div>",
    "urlFetchPending": false,
    "published": "Apr 12, 2018 1:50:22 AM",
    "tags": [
      "Full Time",
      "Ottawa",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "68mLFzfqQ3iSu3gGHkLQcw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/67915/remote-sales-associate-at-tried-and-supplied/",
    "title": "Remote Sales Associate",
    "content": "Tried and Supplied is a B2B supplier search looking to develop its database of artisan food and drink suppliers. This is an exciting role for anyone looking to get into sales. It offers an opportunity to work remotely for an early stage start-up and have a big impact on our overall growth. <br /><br />You will be responsible for: <br /><br />- calling suppliers in our database to get them to sign up<br />- providing customer/prospect feedback to senior management for strategic decision making<br />- developing our database of suppliers and buyers through market research<br />- calling buyers to get them to leave recommendations for suppliers<br /><br />Please respond with a covering letter explaining why you think you would be suitable for the role. Communication and research skills are key. You will need a UK phone number.",
    "urlFetchPending": false,
    "published": "Apr 11, 2018 10:25:18 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "mYfxtTw3QpObnCLB2tPZcg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/67837/account-executive-at-property-basecamp/",
    "title": "Account Executive",
    "content": "Account Executive<br /><br />We are looking for an Account Executive to become an integral part of our expanding start-up business, Property Basecamp.<br /><br />Property Basecamp began with a simple idea. An idea cultivated by a group of young professionals, a laptop and the desire to create something special. Now it has been defined as a platform that has the potential to disrupt the global employee relocation and property industry, and we want you to join us as we continue our expansion into the UK market.<br /><br />So what actually is Property Basecamp? Property Basecamp is an enterprise digital application that connects a globally mobile workforce to their home away from home. However, Property Basecamp is about much more than just putting a roof overhead. Our one of a kind PB community platform will enhance your overall living experience by providing you with the ability to foster relationships and build a strong support network, not just with your housemates, neighbours, or people in your city but all over the world. So no matter where you go you will have a friendly face to help you settle in to your new surroundings.<br /><br />PURPOSE OF THE ROLE<br />Have you ever had to relocate somewhere else in the world for work purposes? Well you know stressful this can be. Why not help reinvent the relocation experience! We are currently seeking candidates who would be interested in helping transferees relocate to London and the surrounding area. The Account executive responsibilities are:<br /><br />•    Work with account managers to build, manage, and grow strategic partnerships with large customers and agencies in the UK market<br />•    Be the main point of contact on client accounts and ensure that our work is aligned with their business goals<br />•    Leverage customer feedback to drive improvements to the products and services that we provide customers.<br />•    Conduct Pre-Arrival consultation with relocating employee. Gather employee specific home search criteria.<br />•    Educate and offer local knowledge and advice to relocating employees on all things London including, but not limited to: neighbourhoods, transportation links, commuting times, local amenities, schools, shopping, recreation and local dining<br />•    Research suitable apartments/rental homes that meet the relocating employees individual and unique needs<br />•    Assist with scheduling property viewings with property agencies and landlords<br />•    Facilitate ‘individual mover’ employees to source potential housemates via PB ‘Buddy-Up’ process<br />•    Full exposure to other departments within the company including Sales, Marketing and Product Development and management<br />•    Strong potential for senior position as we are growing aggressively<br /><br /><br />This is not an ordinary role in an ordinary company. This is full-on startup mode where you will have the ability and freedom to make decisions in a split second without the need for approval after approval from management. We are extremely ambitious and plan to make ourselves a global brand which will provide you with the opportunity to see the world and grow both personally and professionally. What are you waiting for, take the leap<br /><br />Underlying Principles when working with Property Basecamp<br />•    Accountability - Are you happy to stand over the work you are doing?<br />•    Provide Value- Provide more value to your colleagues, employees and stakeholders than you ask for<br />•    Communication - transparency with your colleagues and stakeholders<br />•    Respect - respect to your colleagues and stakeholders<br />•    Property Basecamp is about People, not Properties<br /><br />Property experience is a bonus for this role but not mandatory. <br /><br />",
    "urlFetchPending": false,
    "published": "Apr 10, 2018 1:25:14 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/go",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "qtTFAQQ6RkGTe_ucXwLvXw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workingnomads.co",
    "url": "https://www.workingnomads.co/jobs/new-business-development-director-starberry",
    "title": "New Business Development Director",
    "content": "<p>We're a decentralised full-stack digital agency specialising in UX/UI, website design &amp; development, and content marketing. located in London, UK. &nbsp;We have had a very successful year, and are in urgent need of a new talent to join the Starberry Constellation and work with us to develop the next wave of award-winning websites and content marketing.</p><p>&nbsp;</p><p>We are looking for a sharp minded Business Development Director based in London, who can work remotely from your home office or co-working space. You will work closely with the founders of the Starberry to help to raise our profile, secure new clients and manage key accounts. &nbsp;It is an exciting time to join our growing, innovative and creative agency.</p><p>&nbsp;</p><p>The role involves working on several accounts as the client partner, managing client expectations and being the key liaison for new relationships. &nbsp;Your leadership skills and an analytical mindset will drive the business forward proactively managing the sales processes through lead generation, solution pitch, negotiation and closing deals.</p><p>&nbsp;</p><p>Awesome stakeholder and relationship skills are needed, both internally working closely with the Project Managers, Creative teams, and with clients stakeholders in order to deliver projects according to plan. Working within a small, close-knit team this role is a key position in the company.</p><p>&nbsp;</p><p>The Role:</p><ul><li><p>Responsible for owning lead generation, from marketing initiatives through to developing and securing new accounts from industry contacts and networking</p></li><li><p>Present the company to potential clients through direct communications in face-to-face meetings, video conferences, telephone calls and emails</p></li><li><p>Owning and managing the company sales pipeline</p></li><li><p>You will have individual responsibility for new business and are expected to self-manage, however, support will be available from the CEO, and management for larger/more complex pitches, strategies and solutions</p></li><li><p>Representing the company at trade/industry events</p></li><li><p>Interaction with other internal departments</p></li><li><p>Developing sales collateral, credentials across all relevant clients and sectors</p></li><li><p>Keeping up to date with industry news</p></li><li><p>Meeting and reporting on agreed sales targets</p></li></ul><p>&nbsp;</p><p>Skills:</p><ul><li><p>Have a real passion and strong background in delivering cutting edge digital solutions, including comms strategies, websites, apps, mobile and content marketing campaigns.</p></li><li><p>Excellent presenting and negotiating skills at board level</p></li><li><p>First class written and verbal communication skills</p></li><li><p>Capable of hands-on problem-solving, with the ability to generate ideas and solutions</p></li><li><p>Good time management and planning</p></li><li><p>Have a creative eye and sound knowledge of the digital media landscape</p></li><li><p>Prior experience in the property sector would be good, but not essential.</p></li><li><p>Prior experience in Account Direction or Account Management in a digital agency is essential.</p></li></ul><p>&nbsp;</p><p>As Starberry is fully decentralised you will work remotely from your home office or co-working space. The role will suit an experienced corporate or consumer all-rounder currently at Senior Account Director level and looking to progress their career. This is a truly exciting post where you can have a real impact on the agency's success.</p><p>Visit our Website: https://starberry.tv</p><p>If you believe you have what it takes and are ready to propel your career to the next level then this is the role for you, and the sky's the limit.</p>",
    "urlFetchPending": false,
    "published": "Apr 10, 2018 12:08:29 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "s-LQdx9-Thirf_Nopv9PLg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/67726/freelance-sales-intern-for-eco-academy-at-solveearth/",
    "title": "Freelance sales intern for eco-academy",
    "content": "Ideally suited to students at university or college or recent graduates with a strong interest in environmental issues. Being based in the UK or in London is an added bonus - but we will also hire sales interns based ANYWHERE in the world.<br /><br />Solve.Earth is a startup academy that trains eco-entrepreneurs via online courses.<br /><br />This is a commission based role that pays 50% commission on every sale made - for every customer that enrols on a Solve.Earth online training course you get 50% of the revenue made by Solve.Earth.<br /><br />You don't need any sales experience - just enthusiasm for the cause - to protect our planet from environmental destruction. <br /><br />Ideal exposure to an exciting new startup in the eco-innovation space that is going to be HUGE in the future.<br /><br />",
    "urlFetchPending": false,
    "published": "Apr 5, 2018 9:28:30 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "7f05ss2eSdyVFvH_Nc4Hng",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-support",
    "url": "https://weworkremotely.com/remote-jobs/pathable-european-happiness-manager",
    "title": "Pathable: European Happiness Manager",
    "content": "<div>  <div>    <h2>European Happiness Manager</h2>      <h4>Posted Apr  4</h4>    <h3>      <span>Pathable</span><br>      <span>Headquarters: Seattle</span><br>        <a href='https://careers.jobscore.com/careers/pathableinc/jobs/european-client-happiness-manager-dLReT8mTKr6k-ReMg-44q7' rel='nofollow'>https://careers.jobscore.com/careers/pathableinc/jobs/european-client-happiness-manager-dLReT8mTKr6k-ReMg-44q7</a>      <br>      <a rel='nofollow'>View all Pathable jobs →</a>    </h3>  </div>    </div>  <div>    <div>While this is a remote-work position, we are specifically looking for candidates who live in the UK or Western Europe, as the goal is to service our European and APAC clients.<br></div><div></div><div><br></div><div>As a Client Happiness Manager, you are the partner and guide for our clients. You’ll master our provisioning and deployment dashboard, you’ll be sweet-talking the important details out of the harried and over-worked event planners that are our customers, preparing and launching the sites, and then providing “best practices” nudges and hand-holding to help them get the most out of the on-line community you built for them. When something goes wrong and a customer calls, hot under the collar, you’re imperturbable. When they finish talking to you, they’re thinking “whew, that’s one less thing I need to worry about!”</div><div><br></div><div>We are a software company, which means you should be adept and comfortable with computers, the Internet and the modern way of doing things: you know when to right-click in your browser, you use formulas in Excel, you can tell me why you prefer your mobile device to the one that you don’t have. You know the difference between a text message and a push notification, you check your e-mail somewhat obsessively and you know that sometimes, work has to be done at 1 AM because it has to be done at 1 AM.<br></div><div></div><div><br></div><div>You are fun to work with and when a client is difficult to work with, you know how to get your zen on.&nbsp;<br></div><div></div><div>While not a requirement, candidates with sales background will get extra consideration, as we would like the option of making this a split sales / support role.<br></div><div></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Apply through <a href='https://careers.jobscore.com/careers/pathableinc/jobs/european-client-happiness-manager-dLReT8mTKr6k-ReMg-44q7' rel='nofollow'>https://careers.jobscore.com/careers/pathableinc/jobs/european-client-happiness-manager-dLReT8mTKr6k-ReMg-44q7</a>- Please do not phone or email. - We do NOT work with recruiters. </p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 11:20:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "j54w72DOR9Cj1oQrvziIjQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/remote-jobs/pressable-wordpress-sales-executive",
    "title": "Pressable: WordPress Sales Executive",
    "content": "<div>  <div>    <h2>WordPress Sales Executive</h2>      <h4>Posted Apr  4</h4>    <h3>      <span>Pressable</span><br>      <span>Headquarters: San Antonio</span><br>        <a href='https://pressable.com/careers/account-manager/' rel='nofollow'>https://pressable.com/careers/account-manager/</a>      <br>      <a rel='nofollow'>View all Pressable jobs →</a>    </h3>  </div>    </div>  <div>    <div>Pressable, a leading provider of WordPress hosting, is looking for driven individuals to join our remote team as a Sales Specialist. This is an outbound sales position. Compensation is salary plus commission. In addition to strong technical sales skills, you’ll need a working knowledge of WordPress to succeed in this role.</div><div><br></div><div>This position is salary + bonus, with incredible potential.</div><div><br></div><div><span>Requirements for this role include:</span></div><div><br></div><ul><li>Identifying leads using technographic data and other means.</li><li>Building a pipeline.</li><li>Travelling to industry events.</li><li>Being a thought leader, sharing opinions based on customer feedback with our team.</li><li>Coordinating with team members and leads to get estimates.</li><li>Working with an Account Manager to ensure that customers are successful and stay with Pressable.</li><li>Reporting to management and executives on a regular basis.</li></ul><div><span>An Sales Specialist should have the following skills and experiences:</span></div><div><br></div><ul><li>Familiar with WordPress and the WordPress Community.</li><li>Demonstrable success in B2B technical sales. Non-technical salespersons should not apply.</li><li>A self-starting approach to work.</li><li>Strong troubleshooting and problem solving skills.</li><li>Excellent written and verbal communication skills, possessing the ability to clearly communicate through text-based chat, video conferencing and phone calls.</li></ul><div><span>Preference will be shown to candidates with experience selling WordPress at a hosting company or digital agency.</span></div><div><br></div><div>We may invite an applicant to complete a limited-time “trial” project as part of the hiring process. A trial is an opportunity for our team to get hands-on experience working with an applicant and evaluating their work. We pay applicants a standard rate of $15/hour while they work as a contractor to complete their trial project.</div><div><br></div><div>We ask everyone who applies to be authorized to work in the United States. When you apply, please provide a detailed description of your past experience in technical sales.</div><div><br></div><div><span>Our benefits our great. You can expect:</span></div><div><br></div><ul><li>Flexibility. Our team is remote, meaning you can work from anywhere you want as long as you have an internet connection.</li><li>Medical, dental, vision, and life insurance for less than $10. We pay 99% of premiums for you and your family.</li><li>401(k) matching. We match your 401(k) contributions up to 6% of your salary.</li><li>A generous time off policy. We want our team members to enjoy a phenomenal work–life balance.</li><li>An annual company retreat.</li></ul><div><span>Let us know you’re interested!</span></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://pressable.com/careers/apply/?position=account_manager' rel='nofollow'>https://pressable.com/careers/apply/?position=account_manager</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Apr 4, 2018 9:17:37 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "FsOSoqlaSTWPxmjXvDK_sQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16745850",
    "title": "Opfin | Head of Sales and Business Development | India (anywhere) | Full-time, Onsite",
    "content": "<div>                  <span>Opfin | Head of Sales and Business Development | India (anywhere) | Full-time, Onsite<p>Opfin (www.opfin.com) is an automated payroll service for Indian companies which features:</p><p>- Auto bifurcation of salary into components like basic, hra, medical, conveyance and special allowance. We minimise the employees' tax liability by maximising their exemptions and deductions as much as possible. Can almost guarantee tax savings for employees with HRA.</p><p>- Automated bank transfers of salary to any bank in India.</p><p>- Free and unlimited ad-hoc payments to contractors and vendors with auto TDS deduction.</p><p>- TDS, PF, PT and ESI payments to government with web access to challans. We also take care of the quarterly TDS filing.</p><p>- Access to employees for self-service, payslips, reimbursements and documents.</p><p>Benefits:</p><p>- Work remotely from anywhere in India.</p><p>- Performance based pay with ridiculous incentives.</p><p>- We're a startup, so lots of flexibility mixed with responsibility.</p><p>If interested, please email me at aj@opfin.com. Thank you.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Apr 3, 2018 6:53:08 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "YbyAzZiLRyCqfLvtHIqv4Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/ekincare/jobs/98918-corporate-sales-mumbai",
    "title": "Corporate Sales - Mumbai",
    "content": "<div><h2>Corporate Sales - Mumbai at eKincare </h2><div>Mumbai, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>₹500K–₹1000K<br>No Equity</div></div><h3>Job Description</h3><div><p>If you enjoy the challenges of working at a start-up and passionate about meeting new people and building strong relations then keep reading.</p><p>eKincare has developed India’s first AI based personal health assistant. eKincare’s patent pending technology reads medical data from health records and various healthcare interventions to predict future health risks and provide timely personalised recommendations to beat those risks. Recognised among the “100 most innovative digital healthcare companies in the world” by the journal of mHealth, we are leveraging technology and data science to make healthcare simple. </p><p>See our story @  <a href='https://yourstory.com/2016/04/ekincare-growth-story/' rel='nofollow'>https://yourstory.com/2016/04/ekincare-growth-story/</a> </p><p>If you're an energetic, street smart, creative, hungry &quot;crushing it&quot; kind of professional and are interested in truly making a difference in Indian healthcare then apply now! Before it's too late!</p><p>** Added bonus if you have experience working in a healthcare industry!</p><p>What you would be doing?</p><p>- Generate new business opportunities<br>- Demo eKincare platform benefits and use cases to clients <br>- Drive revenue through corporate and insurance sales<br>- Nourish existing relationships and strive towards best customer experience<br>- Negotiate contractual terms, pricing and services with the partners<br>- Keep an ear to the ground on healthcare trends and market<br>- Contribute towards platform development by sharing market requirements<br>- Continuously track towards company’s goals and aspirations</p><p>What You Need For This Position <br>(PLEASE DO NOT APPLY IF YOU DON'T MEET THE CRITERIA)</p><p>- Previous relevant experience (2-5 years) within insurance broker/healthcare/SaaS/Corporate sales a MUST<br>- Experience in commercial discussions with customers/ negotiations<br>- Track record of driving incremental revenue opportunities and closing sales <br>- Management graduate from a Tier-1 school - Preferred<br>- Be able to thrive in a complex and demanding startup environment<br>- Street smart, open minded, analytical, persistent, accountable and ethical</p></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 6:51:29 PM",
    "tags": [
      "Business Development",
      "Full Time",
      "Mumbai",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "ufGxfTTQQ_Sj472jC6vxyQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/baby-startup/jobs/72062-business-development-internship-part-time-5-10-hours",
    "title": "Business development Internship (part-time 5-10 hours)",
    "content": "<div><h2>Business development Internship (part-time 5-10 hours) at BabyNoggin</h2><div>Austin, Remote · Internship</div><div></div></div><div><div>Compensation</div><div>No Salary<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>BabyNoggin is a platform that develops medical apps.  We take the latest scientific screening tools, and digitize them into easy apps for parents &amp; doctors to use.</p><p>Our mission is to help achieve universal screening for all children — screening for autism, speech, emotional, and all physical delays so we can provide children treatment as soon as possible.  </p><p>You'll be working directly with the head of marketing to unroll a mix of digital marketing activities:  </p><p>-Ad campaigns on Adsense, Facebook and the app store<br>-Social media management—both content creation and lead generation <br>-Affiliates &amp; partnerships — strategic alliances with influencers <br>-Lead generation — ongoing lead list of target users, mailchimp experience a big plus<br>-SEO &amp; ASO optimization </p><p>We are looking for creative individuals eager to learn and get involved in a small team venture-funded startup.  Depending on performance and commitment, your unpaid, 5-10 hour/week internship may turn into paid contracts or even full-time employment.</p><p>To apply, please send an introduction with a description of your experience in marketing and the baby space.   Please note, this is a work remote position.</p></div>",
    "urlFetchPending": false,
    "published": "Apr 2, 2018 6:38:49 PM",
    "tags": [
      "Austin",
      "Internship",
      "Marketing",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/mobile",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "mobile"
    ]
  },
  {
    "id": "UEJ5_FFYTdySNEnzccFqjQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/circlehd/jobs/118780-enterprise-sales-specialist",
    "title": "Enterprise Sales Specialist",
    "content": "<div><h2>Enterprise Sales Specialist at CircleHD</h2><div>Seattle, Remote · Full Time</div></div><div><div>Compensation</div><div>$50K–$120K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Looking for a Sales Specialist and/or business development experienced in enterprise sales and business partnerships. </p><p>This will  be a contract position to begin with. We will not offer fixed salary at this point. It'll be result based compensation e.g. certain amount after qualified leads (setting the meetings), certain amount after closing the deals, bonus after hitting some number of closed deals.</p></div>",
    "urlFetchPending": false,
    "published": "Mar 30, 2018 6:31:24 PM",
    "tags": [
      "Account Manager",
      "Business Development",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Seattle",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "gYYwe2PJRmyiuJs3Ekod1g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/67541/inside-sales-executive-emea-at-invision/",
    "title": "Inside Sales Executive EMEA",
    "content": "InVision is the Digital Product Design platform used to make the world’s best customer experiences. We provide design tools and educational resources for teams to navigate every stage of the product design process, from ideation to development.<br /><br />Today, more than 3.5 million people use InVision to create a repeatable and streamlined design workflow; rapidly design and prototype products before writing code, and collaborate across their entire organization. That includes more than 80 percent of the Fortune 100, and organizations like Airbnb, Amazon, HBO, Netflix, Slack, Starbucks and Uber, who are now able to design better products, faster.<br /><br />InVision is a fully distributed company with employees in 25 countries around the world. The company has raised more than $235 million in funding from leading investors including Accel, ICONIQ, FirstMark, Tiger Global, Battery Ventures, and Spark Capital. Visit us at InVisionApp.com and InVisionApp.com/blog.<br /><br />We're looking for a high energy sales rep to open new accounts.  Should you want to progress within the company, this role can lead to the Account Rep, Leadership or Strategic Account Rep roles.<br /><br />World class training across our tools, services and our sales process will be provided.<br /><br />*Mission*<br /><br />As part of our growth strategy across Europe, this role focus on targeting and acquiring net new Enterprise customers. . It is likely these accounts will be spread geographically as well as cross industry.  You will be expected to mine targeted list of companies and make proactive outreach, finding new accounts, identifying the most appropriate people and using both the phone and email contact them to drive interest.  You will then be responsible for building value over subsequent meetings and closing the first deal in the account. This is an activity driven role and will be accountable for a high level of outbound prospecting, lead qualification and opportunity creation.<br /><br />Responsibilities:<br /><br />*Passionately evangelize our products and services to drive interest;<br />*Engage with prospects on business challenges and requirements;<br />*Present the InVision solution over video conference;<br />*Manage against personal New Logo and Subscription Targets;<br />*Ensure SFDC is up to date and provide weekly forecasts to the business on new logo acquisition;<br />*Demonstrated ability to manage a transactional sales process - from prospecting to close;<br />*Develop new business opportunities through proactive efforts, in addition to handling incoming leads;<br />*Drive the entire sales cycle in a consultative manner, from initial qualification; through product demo through contracting to closed business; and<br />*Collaborate internally to determine when a prospect account may be better served by a Senior or Strategic Account Executive<br /><br />*Requirements*<br /><br />*2 years or more of inside sales experience - ideally in a B2B SaaS vertical<br />*Proven track record exceeding quota and activity based goals<br />*Eager to be part of a fast-paced sales organisation<br />*Self-motivated and keen to exceed goals<br />*Highly organized and attentive to detail<br />*High degree of comfort with outbound calling<br />*Passion, enthusiasm, energy, humor, and the ability to convey this through phone and email communications<br />*Consummate multi-tasker who can wear multiple hats<br />*Bias towards immediate action and results<br />*Willingness to learn and adapt<br /><br />*About us*<br />At InVision, culture transcends space, with a team made of kind, smart people in more than 25 countries. By focusing hiring efforts on humility and talent, a family-like camaraderie naturally unfolds. You will have the opportunity to grow a career from your homes—or communal workspaces in mini hubs, where many InVisioners live. As a result, you can weave productivity into your lifestyle, with successful work-life integration making it possible to travel the world while spearheading an impressive career.",
    "urlFetchPending": false,
    "published": "Mar 29, 2018 1:31:51 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "i85cD_pgRQym1ObwUcoLuA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/67502/sales-manager-at-rich-contacts/",
    "title": "Sales Manager",
    "content": "Sales Manager <br /><br />Our unique London-based B2B prospecting service is looking to recruit an experienced sales professional to help grow its already thriving business.<br /><br />Founded in 2017, we are on a mission to provide best-in-class, white labelled, business<br />development services which translate into new sales opportunities for our clients.<br /><br />To be considered, you must possess the following experience/skills.<br /><br />●    An expert listener - empathetic to the needs of our prospects.<br />●      An expert communicator within a team structure. <br />●    A proven background in business to business Field Sales with a minimum of 3-5 years experience. Including a demonstrable history of closing and negotiating contracts with a minimum ACV of £50k.<br />●    A background in selling B2B lead generation solutions is desirable.<br />●    Experience of formulating proposals and presenting these to clients.<br />●    Experience of the tech start-up sector.<br />●    Relentless and experienced networker.<br />●    Experience in working in small companies and demonstrating revenue growth as a direct result of your actions.<br />●    Superior organisational and time management skills.<br />●    Exceptional presentation skills.<br />●    Proficient in Excel, Powerpoint, Word and Google Docs<br /><br />This full-time position offers flexible and remote working conditions, however, you will be expected to spend 2-3 days per week in London for face to face sales meetings, networking events and training, a desk is available at WeWork.  Some of your sales activity will be focused on the US market, so there will be an expectation for you to adapt some of your working time to the US schedule. <br /><br />For the right person, we offer the opportunity to work for a modern, progressive company.  You will have the ability to join us at a very exciting time of growth.  Joining us from this early stage will allow you real scope for career progression, and you will be key to driving our continued success.<br /><br />As part of the interview process, you will be expected to clearly demonstrate how you impacted revenue growth for your previous employers, present slides on a topic of our choice, prepare a mock proposal and submit it back to us within a set time frame.",
    "urlFetchPending": false,
    "published": "Mar 28, 2018 1:57:56 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "-xwp_CJAQLSdAh5naouznw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/remote-jobs/hotjar-director-of-sales",
    "title": "Hotjar: Director of Sales",
    "content": "<div>  <div>    <h2>Director of Sales</h2>      <h4>Posted Mar 27</h4>    <h3>      <span>Hotjar</span><br>      <span>Headquarters: Malta</span><br>        <a href='https://www.hotjar.com/' rel='nofollow'>https://www.hotjar.com/</a>      <br>      <a rel='nofollow'>View all Hotjar jobs →</a>    </h3>  </div>    </div>  <div>    <div>Hotjar is looking for a customer-centric, analytical and process-driven sales leader who is passionate about creating WOW moments for prospective customers by delivering a painless and intuitive sales experience.</div><div><br></div><div>This position will see the successful candidate build a small sales team that is focused on quality and putting the customers’ needs first. We’re looking for someone who has experience in managing teams who are not reliant on pushy sales techniques, and instead focus on delivering efficient, memorable and educational interactions. The sales team will work closely with our Legal, Finance and Customer Success teams to ensure that customers have a smooth experience getting started and continuing their use of Hotjar.</div><div><br></div><div>Your main objective will be to create, oversee and improve the processes and resources within our sales pipeline to develop an effortless experience for customers and internal teams alike. We pride ourselves on being timely and delivering quickly, so you’ll be expected to develop the department with these values as a key focus.</div><div>In this role you will report to the Director of Customer Experience. This is an excellent remote career opportunity in a key role within a fast growing and innovative tech-startup.</div><div></div><div><br></div><div><b>As the Director of Sales you’ll be responsible for:</b></div><div><br></div><ul><li>Building and leading a small inbound sales team to prospect, develop, close, and prepare appropriate documentation for sales contracts.<br></li><li>Working closely with Finance and Legal to ensure we efficiently issue and manage estimates, invoices and legal agreements.<br></li><li>Consulting with internal and external legal counsel as well as the leadership team to close complex enterprise deals.<br></li><li>Working closely with the Customer Success team both during the sales pipeline and at the handover stage.<br></li><li>Creating, updating and maintaining a sales opportunity and forecast system.<br></li><li>Acting as a champion for our prospective and existing customers by defining and at times leading projects that make it possible for them to self-serve their sales-related needs. This includes working with Marketing and Customer Success to develop appropriate materials and identifying ways to improve our lead generation and onboarding experience.<br></li><li>Conveying prospective customer needs to product managers and product teams.<br></li><li>Performing product demos and presenting at product webinars for both prospects and customers.<br></li><li>Coaching and training all client facing teams as well as driving technical changes to support the sales process.<br></li><li>Working with the leadership team to create strategies and processes for driving new business and new products across different territories.<br></li><li>Partnering with Marketing to create and drive market specific programs and lead generation campaigns.<br></li><li>Refining and developing how we converse with prospective clients to ensure they are educated on what they can achieve with our product.<br></li><li>Working with leadership to help determine pricing and product line strategy as well as identify new markets we can enter and develop plans to do so effectively.</li></ul><div></div><div><br></div><div><b>Compensation Range</b></div><div><br></div><div>The budgeted compensation range for this role is €80,000 to €110,000 annually. Ranges are based on market research and are equitable to other roles within Hotjar. The actual compensation offered to a successful candidate will be based on relative experience and skills. At this time we are only able to provide official employment status to those located in Malta. All other candidates will join our team as full-time consultants and will be responsible for paying any taxes or applicable fees where they reside.</div><div></div><div><br></div><div><h4><b>Requirements</b></h4></div><ul><li>3-5 years of sales management and relevant client facing experience in a technology environment.</li><li>SaaS experience is required.<br></li><li>Willingness to get your hands dirty and wear many hats in a startup role - you'll need to be comfortable taking calls and negotiating deals while also building a team and iteratively improving the processes to scale this going forward.<br></li><li>Strong negotiating and strategic selling skills.<br></li><li>Passionate about technology solutions.<br></li><li>Proven ability to develop and drive others in a metrics-driven, process-based environment with high accountability.<br></li><li>Strong oral, written, and presentation skills in English.<br></li><li>Demonstrated history of successfully selling into enterprise accounts.<br></li><li>Demonstrated history of successfully managing renewals.<br></li><li>Experience with inbound sales and selling in the customer experience vertical will be considered an asset.<br></li><li>Must submit to a background check confidentially processed by our third party.<br></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Please apply via <a href='https://careers.hotjar.com/o/director-of-sales/?source=WeWorkRemotely' rel='nofollow'>https://careers.hotjar.com/o/director-of-sales/?source=WeWorkRemotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 27, 2018 6:38:21 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "VVyvgQmyQz-Ogr5xgqsidg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/67388/uk-and-ireland-campus-business-developer-at-lydia/",
    "title": "UK and Ireland campus business developer",
    "content": "Lydia is one of Europe’s fastest-growing fintech start-ups. Our mission is to make payments as simple as possible. How? By providing one app to pay for everything in all situations - from paying back a friend for last night’s pizza to buying lunch at a food market.<br />We launched Lydia in Paris in 2013, and we are now the number one mobile payments service in France. We have over one million users across France, the UK, Ireland, Spain, and Portugal, and more than 1500 people create an account every day. <br />We’re looking for entrepreneurial, highly motivated talent to join our mission to become Europe’s universal means of payment. You will be working with the UK International Business Developer to continue Lydia’s expansion into the UK market. Your tasks will include key aspects of growing Lydia’s user-base in the UK.<br /><br />RESPONSIBILITIES INCLUDE<br />Identify business development opportunities in the UK and Ireland student sector<br />Conducting the whole sales cycle from prospecting, signing accounts, account management, and upselling<br />Event planning and organisation<br />Social media management: assisting in creating content for the Lydia English social media channels (Facebook and Twitter for now). <br />Organising marketing projects<br />Creating marketing collateral documents<br />Contributing to social media strategy<br /><br />REQUIREMENTS<br />Native or fluent in English (spoken and written), knowledge of French is a plus<br />Recent graduate with excellent knowledge of the UK student market<br />Extremely well-organised, detail-oriented, rigorous<br />Creative problem-solver with an analytical mindset<br />Proactive self-starter that can take initiative and seizes any challenge, no matter how big or small<br />Ability to multitask, can work under pressure<br />Excellent communication skills <br /><br />BENEFITS<br />The opportunity to work at one of France’s fastest growing start-ups<br />Have a real impact on the company’s growth and evolution in a new market<br />Travel between Paris and the UK<br /><br />Start date: immediate <br />Compensation: according to experience<br />Contract type: full-time contract<br />Location: remote with frequent travel to Paris",
    "urlFetchPending": false,
    "published": "Mar 23, 2018 4:41:45 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "9-0n0vODTH6h2sT-V9t2Pw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/67339/business-development-representative-german-speaking-at-invision/",
    "title": "Business Development Representative, German Speaking",
    "content": "InVision is the Digital Product Design platform used to make the world’s best customer experiences. We provide design tools and educational resources for teams to navigate  every stage of the product design process, from ideation to development.   <br /><br />Today, more than 3.5 million people use InVision to create a repeatable and streamlined design workflow; rapidly design and prototype products before writing code, and collaborate across their entire organization. That includes more than 80 percent of the Fortune 100, and organizations like Airbnb, Amazon, HBO, Netflix, Slack, Starbucks and Uber, who are now able to design better products, faster.<br /><br />InVision is a fully distributed company with employees in 25 countries around the world. The company has raised more than $235 million in funding from leading investors including Accel, ICONIQ, FirstMark, Tiger Global, Battery Ventures, and Spark Capital. Visit us at InVisionApp.com and InVisionApp.com/blog.<br /><br />We're looking for a Business Development Representative to accelerate the already rapid growth of our Enterprise EMEA sales efforts.<br /><br />Requirements:<br /><br />1 year or more of inside sales experience in a B2B SaaS vertical<br />Fluent German language skills<br />Proven track record exceeding quota<br />Passion, enthusiasm, energy, humor, and the ability to convey this through phone and email communications<br />High degree of comfort with outbound calling<br />Bias towards immediate action and results<br />Willingness to learn and adapt<br />Consummate multi-tasker who can wear multiple hats<br />Exposure to design tool space a plus<br />Responsibilities:<br /><br />Evangelize InVision to prospects and qualify them for sales team<br />Proactively reach out to target prospects<br />Catch and respond to requests from inbound leads<br />Book demo requests and meetings for sales team<br />Create and prioritize target prospect lists<br />Support research initiatives around target prospects through LinkedIn and internal tools",
    "urlFetchPending": false,
    "published": "Mar 22, 2018 11:58:11 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "3Qnq-bGFSPqvqb05XnwAHA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-other",
    "url": "https://weworkremotely.com/remote-jobs/help-scout-account-executive-1",
    "title": "Help Scout: Account Executive",
    "content": "<div>  <div>    <h2>Account Executive</h2>      <h4>Posted Mar 20</h4>    <h3>      <span>Help Scout</span><br>      <span>Headquarters: Remote</span><br>        <a href='http://www.helpscout.com/careers' rel='nofollow'>www.helpscout.com/careers</a>      <br>      <a rel='nofollow'>View all Help Scout jobs →</a>    </h3>  </div>    </div>  <div>    <div>At Help Scout, the sales team serves as a trusted advisor for prospects and customers -- listening to their needs, clearly explaining what’s possible, and leading training/onboarding efforts to make sure everyone is successful for the long term. Quite simply, you’ll have the opportunity to impact small businesses in a big way on a daily basis.</div><div><br></div><div><b>About the role</b></div><ul><li>You’ll partner with customers through the entire buying process, from initial evaluation to close, and through onboarding of the entire team. You’ll be the primary point of contact through the first year renewal.<br></li><li>You’ll team with marketing to ensure inbound campaigns are well coordinated as you follow up to qualify and close those opportunities.<br></li><li>In most cases you’ll be partnering with SMBs between 10-250 people. On a monthly basis you’ll have the opportunity to close several new deals and get them on track with the product.<br></li><li>The companies you work with will be qualified and passed to you based on the number of expected Users. They will mostly be trial signups, webinar attendees, or inbound leads we’ve talked with to get a high-level understanding of their needs. You’ll also work with existing customers on high-value upgrade and expansion opportunities.<br></li><li>Most of your time will be spent working with stakeholders over email and on the phone, and doing demos. There’s a reason we call you a trusted advisor -- this is less about the hard sell and more about having the product knowledge, passion and people skills to let the product sell itself.<br></li><li>Based on what works, you’ll experiment with, measure and document strategies that help us increase sales effectiveness. You’ll be a critical part of helping us enhance our sales playbook.<br></li><li>You’ll be proactively reporting on learnings and valuable feedback to the product team so that we can improve the product and prioritize the right projects.</li></ul><div></div><div><br></div><div><b>About you</b></div><ul><li>You have 2+ years of successful selling to SMBs, and have experience working on deals similar in size and volume to the ones you’d be working on at Help Scout.<br></li><li>You are in sales because you love helping people win. It energizes you to work alongside people to improve their business.<br></li><li>You are naturally curious and have a history of learning new things quickly. This is especially important in a remote company like Help Scout, as you won’t always have people nearby that you can talk to and learn from.<br></li><li>You excel at managing yourself like a successful business -- highly organized, setting and achieving goals with regularity, creating a great customer experience, and making your teammates better.<br></li><li>You have experience tracking all of your sales activity and reports with Salesforce.<br></li><li>As the primary point of contact and a trusted advisor, you’re happy to wear several hats: sales, support, customer success. Over the course of a customer’s first year, you may be point person on any one of them, mobilizing your teammates for support.<br></li><li>Above all, you’re an entrepreneur and are excited by the prospect of building your business and hitting your quarterly and annual goals.</li></ul><div><span><br></span></div><div><span><b>Benefits</b></span></div><ul><li>Competitive Salary - We pay at or above market salary in most cases and evaluate a lot of research to make sure everyone is paid well. The formula we use to calculate all salaries is public to employees and is improved upon regularly.<br></li><li>Work anywhere - Work from our office in Boston or anywhere else, provided you have 4 hours of overlap with the team. We’ll even buy your home office furniture or help you pay for a co-working space.<br></li><li>Health and dental insurance - We cover you and your family's health/dental insurance 100%. If you are based in the US, we'll cover you on our Aetna policy.<br></li><li>Long-term/Short-term Disability Insurance &amp; Life Insurance - we cover 100% of the premiums for LT/ST Disability insurance and base Life Insurance. You also have the option to purchase supplementary life insurance through our provider.<br></li><li>International Benefit Stipend - If you’re based outside the US, you’ll receive a monthly stipend that goes towards covering medical insurance, long and short-term disability, and accountant costs.<br></li><li>Flexible vacation - Take time off when you need it, we trust you.<br></li><li>Paid parental leave, including adoption - 12 weeks if you have or adopt a baby, 4 weeks if your partner has a baby.<br></li><li>401k with 1% match- 1% Retirement Plan matching for both US and International Employees<br></li><li>Personal development stipend - Up to $1,800 per year to improve your craft<br></li><li>Great tools - Each employee receives a Mac laptop and 27'' display (or equivalent). We’ll also purchase any of the software or hardware you need as well as high-end furniture to get your home office started<br></li><li>Complete transparency - Everyone has full access to business metrics and financial information about the company.</li></ul><div><br></div><div><b>About Us</b></div><div><br></div><div>Help Scout is made by roughly 70 people in 40+ cities around the world, all with a passion for excellence in their craft.</div><div><br></div><div>We come from diverse backgrounds and are united by an enthusiasm for great products and delightful customer experiences.</div><div><br></div><div>Since launching in April of 2011, Help Scout now powers 8,000+ support teams in over 140 countries. Our software is used and trusted by businesses of every shape and size.</div><div><br></div><div><b>Designed to go the distance</b></div><div><br></div><div>Our mission is to foster the world’s customer-centric businesses by providing tools that serve customers in the most human, helpful way. While growth is important, team and values are paramount. We’re always striving to do impactful work we’re proud of in lieu of chasing overnight success.</div><div><br></div><div>We’re builders without borders</div><div><br></div><div>Our entire team is free to work remotely from wherever they choose. We overcome remote challenges through transparency, trust, and video conferencing. The reward is worth the effort—we’ll take talent, skill, and diverse perspectives over local geography any day.</div><div><br></div><div>Above all, we want Help Scout to be a place where passionate people can do their very best work. You won’t find any ping-pong tables or kegerators here. Instead, you’ll be surrounded by driven, supportive teammates who will push you to be better. We take work/life harmony seriously, too, as we want every career at Help Scout to be a long and satisfying one.</div><div><br></div><div><b>Diversity &amp; Inclusion</b></div><div>We are an equal opportunity employer and are committed to building a company that embraces and celebrates diversity and inclusion. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, or disability status.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://jobs.lever.co/helpscout/2bae0aaf-a067-4819-b7b8-416f4506e1b5' rel='nofollow'>https://jobs.lever.co/helpscout/2bae0aaf-a067-4819-b7b8-416f4506e1b5</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 8:17:23 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/sales",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "kg9gWRVCRw--2yD4idxokQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "stackoverflow.com",
    "url": "https://stackoverflow.com/jobs/170359/north-america-based-pre-sales-and-training-platformsh?a=V8fJphRkCFG",
    "title": "North-America based Pre-sales and training Engineer at Platform.sh  ",
    "content": "                        <h2>About this job</h2>                        <div>                                <div>                                        <div>                                            <span>Job type: </span>                                            <span>Permanent</span>                                        </div>                                        <div>                                            <span>Experience level: </span>                                            <span>Junior</span>                                        </div>                                        <div>                                            <span>Role: </span>                                            <span>Backend Developer</span>                                        </div>                                </div>                                <div>                                        <div>                                            <span>Industry: </span>                                            <span>Cloud-Based Solutions, Continuous Delivery, PaaS</span>                                        </div>                                        <div>                                            <span>Company size: </span>                                            <span>51-200 people</span>                                        </div>                                        <div>                                            <span>Company type: </span>                                            <span>VC Funded</span>                                        </div>                                </div>                        </div>                                        <h2>Job description</h2>                    <div><p>You are a software developer that likes human contact. You are impassioned about DevOps and have experience with web technologies. You can develop in a couple of languages, but have played with a bunch of technologies; You like traveling around the country.&nbsp;</p><p>Platform.sh is a cloud application platform shrouded in black magic; Multi-Cloud, Multi-Stack, Container powered. Fully buzzword compliant. Your main job would be to show-off the awesomeness.</p><p><strong><strong>Mission :</strong></strong></p><p>We are looking for a Partner Account Manager to enhance our partnership recruitment, onboarding and training activity in North America. Expect Travel. You need to live in North America (USA or Canada). This role encompasses various activities :</p><p>1. Training :</p><ul><li>travel to partner locations on predetermined dates to deliver training to our North-America based partners</li><li>maintain training database and course data</li><li>gather and organize information about the product and its&nbsp;releases</li><li>monitor and evaluate the quality of training ; revise as needed</li><li>maintain a current understanding of training trends and best practices</li><li>prepare and present workshops at users’ conference if needed</li></ul><p>This will involve delivering material through various media including user guides, videos, virtual classroom, face-to-face training.</p><p>You will end up working with our teams to design training programs and materials.</p><p>2. Sales :</p><ul><li>you will learn how to identify and contact potential partners</li><li>organize partner meetings to discuss business opportunities</li><li>you don't have to have sales experience&nbsp;... but that would be a plus.</li></ul><p>3. Marketing :</p><ul><li>participate in conferences and company events to promote our product and provide product demos</li></ul><p><strong>The ideal candidate must have :</strong></p><ul><li>the professionalism, charisma, enthusiasm, and knowledge to help convert partners into enthusiasts</li><li>Experience in Python and PHP development</li><li>Git knowledge</li><li>excellent communication skills</li><li>a customer-oriented attitude combined with a positive and proactive nature</li><li>autonomy and the ability to work well with a distant international team</li><li>willingness and excitement to travel 50% of your time in Canada and the USA ; you have easy access to an international airport</li><li>educational background in software development will be a plus</li><li>Magento, Wordpress, Symfony, Drupal and/or PaaS knowledge will grant you points</li></ul>                    </div>                            <h2>                About Platform.sh            </h2>            <div><p>Platform.sh is a groundbreaking cloud hosting and development tool for web applications. We are a European VC-Backed startup with a host of blue-chip Enterprise clients and a string of awards and grants (including €2m from the EU Horizon 2020 program). Though young, we have become a major player in ecommerce and we recently helped launch Magento Enterprise Cloud Edition and the Sensio Cloud on Platform.sh technology.</p><p>We are an award-winning team of hard-core hackers who want to revolutionize the way that developers and agencies build and deploy web applications. We’re mostly distributed, but we meet up daily in cyberspace, and occasionally in the real world. We value enthusiasm, team spirit, and a constant desire to expand personal knowledge and contribute to the community. We provide a multi-cultural, casual and balanced work environment.</p><p>If you’re looking for an exciting, high-growth opportunity with an award-winning, cutting-edge company, this could be just the job for you.</p>            </div>                                <h2>Benefits</h2>                            <div>                                 Work from home, wherever you are                            </div>                            <div>                                 Safe and friendly working environment                            </div>                            <div>                                 Stock options for everyone                            </div>                            <div>                                 Rest and recovery are essential to health and happiness; we get that                            </div>                    ",
    "urlFetchPending": false,
    "published": "Mar 20, 2018 12:52:38 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ]
  },
  {
    "id": "aaVIHzHBRoKQpHYNkxDikA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/67193/junior-salesbusiness-development-at-livingpackets-uk/",
    "title": "Junior Sales/Business Development",
    "content": "Junior Sales/Business Development <br /><br />Location: London, EC2A<br />Start Date: ASAP<br />Full-time job, <br />9-month contract, with the aim to become permanent<br />Salary: £22,000 to £27,000 depending on experience<br />We will be interviewing on a first comes first served basis, and we will hire the right candidate ASAP.<br /><br />Summary<br /><br />We are looking for a hungry, motivated and high-achieving junior sales rep based in London to work on expansion of the company in the UK. <br /><br />The ideal candidate needs to be a self-started with a results-oriented approach. You enjoy being out in the field, driving sales, spending time with the co-founders and understanding the need of the business. The role is a 9 months contract covering a maternity leave, with the view of becoming a full-time placement. It will involve telesales, and face-to-face (field) sales<br /><br />The company<br />LivingPackets is a young and dynamic start-up based in Central London. Livingpackets offers a service for professionals and individuals who need speed and security for any type of parcels from samples, prototypes, documents to valuable objects - all fully insured.  LivingPackets has launched the London/Paris route, and will be rolled out to other French/British cities and European capitals in 2018.<br />The result of two years of R&D has enabled LivingPackets to invent a bag filled with technology, amd fully patented.  The smart packaging is optimised, and designed to be tracked in real-time to ensure secure shipments at all stages of the journey.<br />As well as saving the cost and physical waste of extraneous packaging - the bag, called the LivingPacket is designed to be reusable at least 500 times.<br />In a new business model that LivingPackets has renamed as CrowdSharing -the profits are distributed between the travellers, known as Voyagers who earn more than half the price of delivery; and the Guardians (contracted local shops) who receive and hold the parcels, and investors known as Sharing Angels (sponsors of the model).<br />A series of exclusive, limited offers enable Sharing Angels to choose the sponsorship package that works for them.<br /><br /><br />Core requirements<br />Highly capable, self-motivated, collaborative and personable <br />Strong academic record<br />Strong commercial skills gained from a professional background<br />Able to demonstrate integrity, drive and natural curiosity<br />An excellent written and verbal communicator, English at mother tongue level<br />High level of business acumen<br />Ability to effectively work remotely, from a co-working space and with an international team<br /><br />Role and responsibilities<br />The Role is varied and involves a combination of strategic thinking, analysis and engagement with internal and external stakeholders.<br />You will be developing and maintaining value-based relationships with our customers.<br />You will be first working directly with the CEO UK on developing and evaluating new opportunities and continue the work during her maternity leave and until her return to work.<br />You will be at the heart of a truly unique movement that will have a massive impact within the UK/EU parcel delivery space.<br />In the first few months, you should expect to be more of a sales operations role. Here are a few examples of what you will be doing, in Sales and Operations:<br /><br /><br />The Sales Part:<br />-    Researching organisations online to identify new lead, potential new markets, decision makers <br />-    Contacting new potential clients via email or phone to establish a relationship and set-up meetings<br />-    Attending conference, meeting and industry events<br />-    Preparing presentations and proposals<br />-    Updating clients on new developments <br />-    Working with external design and marketers to prepare sales collateral<br />-    Securing new clients<br />-    Elaborate marketing and social media campaign with internal and external stakeholders to boost inbound leads<br /><br />The Operations Part:<br />    - Answer basic enquiries from Voyagers and Investors on email and by phone <br />    - Liaise with partner stores to ensure that everything runs smoothly <br />    - Help in elaborating partner pack and processes <br />    - Be ready to jump on the Eurostar to Paris for a last-minute trip (so cool, right?!) <br />    - Organise courier for deliveries when required <br />    - Help in elaborating Courier network and processes <br />    - Help bring new local store partner on board <br /><br />Benefits<br />Successful candidates will have the opportunity to join a fast-growing, agile and international team, passionate about innovation and making a difference. <br />We will offer guidance, mentorship and opportunities for professional development.<br />Equity share for the right candidate and huge professional development<br />Very friendly young & dynamic co-working space, in the heart of the Silicon roundabout<br />Dog friendly office<br />Coffee and tea on tap<br />Free breakfast every Tuesday morning<br />Occasional trips to France<br /><br />",
    "urlFetchPending": false,
    "published": "Mar 18, 2018 5:10:23 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/c",
      "TITLE1/sales",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "c"
    ]
  },
  {
    "id": "5qGj19FyS3iwAwqOqBqbuw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/67132/business-development-full-time-remote-at-causalens/",
    "title": "Business Development (Full Time, Remote)",
    "content": "This is a remote position.<br /><br /><br />Summary<br /><br /><br />We are looking for a motivated and high-achieving individual based in Europe to join the team working on expansion of the company in global markets. This is a full time placement with significant opportunities for growth, travel and advancement as one of the first employees of the company.<br /><br /><br />The Company<br /><br /><br />causaLens is high-tech startup based in London. We are bringing machine learning and big data technologies to the World’s leading asset managers. We are an extraordinary team and the founders have worked for some of the most prominent global hedge funds and scientific institutions.<br /><br /><br />Core requirements<br /><br /><br />Highly capable, self-motivated, collaborative and personable<br />Strong academic record<br />Strong commercial skills gained from a professional background<br />Interest in advanced technologies such as machine learning<br />Able to demonstrate integrity, drive and natural curiosity<br />An excellent written and verbal communicator with a high level of business acumen<br />Ability to effectively work remotely (from home or coworking space)<br /><br />Roles and Responsibilities<br /><br /><br />The role is varied and involves a combination of strategic &amp; critical thinking, analysis and engagement with internal and external stakeholders.<br /><br />You will identify new opportunities and manage the full sales cycle from finding new prospects through to closure.<br />You will be developing and maintaining value-based relationships with our customers.<br />You will work directly with the CEO on developing and evaluating new opportunities.<br /><br />Benefits<br /><br /><br />Successful candidate will have the opportunity to join a fast-growing, agile, and international team passionate about innovation and making a difference. We will offer guidance, mentorship, and opportunities for professional development.",
    "urlFetchPending": false,
    "published": "Mar 15, 2018 5:17:12 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "NSWpOeHaTwG8ZaWbYE0bxA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/remote-jobs/emsisoft-sales-representative-antivirus-anti-malware",
    "title": "Emsisoft: Sales Representative - Antivirus/Anti-Malware",
    "content": "<div>  <div>    <h2>Sales Representative - Antivirus/Anti-Malware</h2>      <h4>Posted Mar  7</h4>    <h3>      <span>Emsisoft</span><br>      <span>Headquarters: Earth</span><br>        <a href='https://www.emsisoft.com/en/company/jobs/' rel='nofollow'>https://www.emsisoft.com/en/company/jobs/</a>      <br>      <a rel='nofollow'>View all Emsisoft jobs →</a>    </h3>  </div>    </div>  <div>    <div>We’re searching for a motivated sales representative to help grow Emsisoft’s reseller network. If you’re looking for a role that will test your sales chops while providing you with the fantastic work-life balance that comes with location independent working, this could be the position for you!</div><div><br></div><div>A leading name in the antivirus space, Emsisoft is dedicated to making the world a safer place by protecting users against all forms of malware. As the company grows, we’re looking to bring on new talent to expand our reseller partnerships and grow channel sales.</div><div><br></div><div>That’s where you come in.</div><div><br></div><div><h4>The role</h4></div><div>As a sales rep, you’ll be responsible for growing the Emsisoft reseller network in English speaking countries and providing these resellers with ongoing support. The position is well-suited to someone who has experience in software sales (ideally with resellers), is ready to hit targets and has the drive and passion needed to succeed in a fast-paced and exciting industry.</div><div><br></div><div>In return, we offer a competitive hour-based salary, target-based bonuses and total location independence, which gives you the freedom to work from anywhere in the world!</div><div><br></div><div><h4>Key responsibilities:</h4></div><ul><li>Establish a strong reseller network in English speaking countries.</li><li>Work with resellers and provide them with necessary support to motivate their sales.</li><li>Grow sales from English speaking markets.</li><li>Deliver monthly reports, analyses and sales targets.</li></ul><div><h4>Job requirements:</h4></div><ul><li>Experience in software sales, preferably with resellers and/or managed service providers (MSP).</li><li>Ready to meet targets.</li><li>Fluent in English.</li><li>Must be a self-starter and comfortable working in a fast-paced innovative environment.</li><li>High energy level and ability to work independently.</li><li>High levels of collaboration and teamwork.</li><li>Positive attitude and willing to go the extra mile without being asked.</li></ul><div><h4>What we offer</h4></div><ul><li>Safe, long-term employment (40 hours/week) as an independent contractor.</li><li>Semi-flexible work hours providing the short daily meetings are covered.</li><li>Completely location independent role, assuming you have access to a reasonably fast and stable Internet connection.</li><li>Opportunity to work in an interesting field as part of a growing multicultural company.</li><li>Fixed hour-based salary and target-based bonuses.</li></ul><div></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>Think you’d be a good fit for the role? We’d love to hear from you. Send us your C.V. and cover letter to <a href='mailto:jobs@emsisoft.com' rel='nofollow'>jobs@emsisoft.com</a> and we’ll be in touch.</p>  </div>",
    "urlFetchPending": false,
    "published": "Mar 7, 2018 4:08:23 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "aTPtks35TCKDbHl46xNiUg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16498465",
    "title": "(stealth start-up) | Business partner | Anywhere US | Part-time OK | REMOTE (US-only) | up to 50% equity",
    "content": "<div>                  <span>(stealth start-up) | Business partner | Anywhere US | Part-time OK | REMOTE (US-only) | up to 50% equity<p>I am looking for a business co-founder with up to 50% equity for a fully automated e-commerce business based initially on drop-shipping high quality items on Amazon and other platforms. In parallel, I am building an SaaS (another company) exposing some of the functionality developed for this purpose to 3rd party sellers and would like to have this new company as a dogfooding business that is fully automated, profitable, growing and solid (100% customer and platform satisfaction), instantly putting into use latest tech I develop. I have already fully automated inventory ETL generation, automated repricing, purging stale stock, retrieving orders, placing them at suppliers and notifying customers about shipping. In addition, I am a Deep Learning expert and work on NLP and TTS tech for automating client support as well.</p><p>Your role would be the business executive, establishing and cultivating business relationships, handling all administrative tasks, searching for high-quality suppliers, handling Amazon issues and initially customer support until it is automated away. You need to be a US resident, ideally citizen, working from anywhere/anytime you want, usually less than 1h/day. Contact me on deepmarket@tuta.io.</p><p>Please note there are no engineering openings right now.<span>              </span></p><div>        <p>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Mar 2, 2018 5:00:09 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "_wZixEztTP2ixae2xV42xg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/remote-jobs/zapier-partner-manager-launches",
    "title": "Zapier: Partner Manager - Launches",
    "content": "<div>  <div>    <h2>Partner Manager - Launches</h2>      <h4>Posted Feb 27</h4>    <h3>      <span>Zapier</span><br>      <span>Headquarters: San Francisco</span><br>        <a href='https://zapier.workable.com/j/FD957EF200' rel='nofollow'>https://zapier.workable.com/j/FD957EF200</a>      <br>      <a rel='nofollow'>View all Zapier jobs →</a>    </h3>  </div>    </div>  <div>    <div>Hi there! We're looking for someone who's eager to help our newest and fastest-growing partners, like Zoom, Calendly, and Airtable, succeed in launching and growing their Zapier integration. If you're excited about SaaS, APIs, and automation, then read on.</div><div><br></div><div>Even though our job description may seem like we're looking for a specific candidate, the role inevitably ends up tailored to the person who applies and joins. Regardless of how well you feel you fit our description, we encourage you to apply if you’re organized, detail oriented, excel at following up with of others, and you are intrigued by new products and technology.</div><div><br></div><div><h3>About You</h3></div><div><span>Meaningful relationships maximize your success.</span>&nbsp;You prioritize creating, nurturing, and managing personal relationships over-relying on hastily-made contacts.</div><div><br></div><div><span>Long-term customer success tops short-term revenue.</span>&nbsp;You pull in partners to activities that yield sustainable gains, not just one-time growth bumps.</div><div><span><br></span></div><div></div><div>Sales skills aren’t just for sales professionals.&nbsp;You don't hesitate to make a cold call, deliver a presentation, or negotiate a win-win deal.</div><div><span><br></span></div><div></div><div>You strive to build partnerships that benefit customers and partners alike.&nbsp;You think about how a potential partnership will solve customers' problems with practical use cases.</div><div><span><br></span></div><div></div><div>API documentation is familiar territory.&nbsp;You're comfortable looking for and suggesting improvements to an integration based on reading through a tool's API docs.</div><div><span><br></span></div><div></div><div>Efficiency impacts outcomes.&nbsp;You consistently automate time-consuming processes to free up time for more meaningful work.</div><div><span><br></span></div><div></div><div>Strong writing is a skill you sharpen non-stop.&nbsp;From authoring a short, convincing email to an 800-word persuasive blog post, you don't stop honing your craft.</div><div><span><br></span></div><div></div><div>Action beats inactivity.&nbsp;When you're given a task, you take ownership and find an effective way to complete it, whether or not it requires dozens of Google searches.</div><div><span><br></span></div><div></div><div>Learning gives you satisfaction.&nbsp;You strive to improve your work and expand your industry and marketing knowledge.</div><div><h3><br></h3></div><div><b>Things You Might Do</b></div><div>Zapier is a small, fast-growing, and remote-first company, so you'll likely get experience on many different projects across the organization. That said, here are some things you'll probably do:<br></div><div></div><div></div><ul><li>Establish and maintain meaningful relationships with dozens of Zapier&nbsp;<a href='https://zapier.com/zapbook/' rel='nofollow'>integration partners</a>&nbsp;at once</li><li>Help partners to meet all requirements for launching their integration on Zapier</li><li>Persuade integration partners to tie their products to Zapier more closely</li><li>Gain understandings of partners' users and show them practical use cases for Zapier</li><li>Create marketing materials including launch blog posts and help documentation</li><li>As part of our&nbsp;<a href='https://zapier.com/learn/customer-support/everyone-on-support/' rel='nofollow'>All Hands Support</a>&nbsp;initiative, every week help customers have the best possible experience with Zapier</li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://zapier.workable.com/j/FD957EF200' rel='nofollow'>https://zapier.workable.com/j/FD957EF200</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 27, 2018 6:27:09 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "MDh-SVDpSR2kaB2gyvZMYQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/66623/software-blockchain-business-development-sales-at-cygnetise/",
    "title": "Software (Blockchain) Business Development / Sales",
    "content": "About Us:<br /><br />Cygnetise are leading the wave of practical blockchain applications in the enterprise space. We offer a unique solution for managing authorised signatory lists (ASLs) allowing companies to maintain and distribute them in a secure and efficient way. At our current phase of growth and funding, we require an additional business development / sales resource to accelerate client adoption.<br /><br />We are one of the few live, commercially scalable private blockchains. Via our platform, clients can alleviate the burden of maintaining and distributing ASLs, while safely and securely enabling greater audit and control functions.<br /><br />With marquee clients in the fund services, asset management, insurance, legal and business services sectors, our current geographic focus is London, Channel Islands, Luxembourg.<br /><br />We are a small team, primarily with a background in financial services and consulting and have varied skillsets all of which complement each other. We need someone to join us who will enjoy working in a small firm whilst sharing our ambition to become a much larger firm.<br /><br />Role:<br /><br />This is a new business sales role focused on, but not limited to, financial services companies including: fund services, private equity real estate, asset managers, hedge funds, banks and insurance.<br /><br />We are looking for a self-starter, resilient, willing to take responsibility, full of ideas and disciplined enough to carry out their own plans.<br /><br />We have a significant growth trajectory, in order to provide you with an opportunity to develop your own career as the business grows.<br /><br />Responsibilities:<br /><br />Oversight of a mixture of new sales accounts and developing existing accounts further<br />New sales – identifying new accounts, leveraging your network and that of the firm and approaching them directly<br />Define, execute, and own an engagement plan for key prospects<br />Be comfortable pitching to a range of individuals including Company Secretaries, Legal Counsel, COO and Operations teams and other senior leaders within these accounts<br />Able to research and build detailed understanding of the customer environment, how they manage authorised signatory lists<br />Work alongside an experienced business developer who will provide guidance and support as you build your pipeline<br />Ensure a smooth hand-off of all new accounts to the account management team<br />Look for opportunities to add value for the customer and develop additional revenue<br />Travel expected in due course to develop European and global client base over time<br /><br />Requirements:<br /><br />3+ years’ experience in a consultative or financial services or SaaS sales role<br />Experience and enthusiasm for engaging at different seniority levels and building relationships to maximise opportunities<br />Ideally you will have experience and knowledge of some aspect the finance services sector e.g. any of the following (but not limited to) asset management, fund services, insurance, retail banking, private equity. Other sectoral experience is welcomed and considered.<br />Successful history of direct new business sales, with the ability to prove consistent delivery against targets<br />Ability to balance a longer term strategic view for an account with a faster-paced transactional approach<br />Desire to focus on building a business and developing territories and sectors and the responsibilities that come with it, as further hires are made with the company<br /><br /><br />Salary:<br /><br />£35-£45k + commission structure<br /><br />Equity:<br /><br />Company EMI (Employee share options) available at the discretion of management<br /><br />Benefits:<br /><br />Conference attendance allowance<br />Flexible working hours<br /><br />Holiday:<br /><br />25 days p/a + 8 public holidays<br /><br />Cygnetise is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, creed, colour, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, or veteran status",
    "urlFetchPending": false,
    "published": "Feb 27, 2018 12:17:02 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "OEFJepOQRE2CTjdjDjyIcw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/logcheck/jobs/87846-sales-development-representative",
    "title": "Sales Development Representative",
    "content": "<div><h2>Sales Development Representative at LogCheck</h2><div>New York City, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$40K–$50K<br>0.0%–0.3%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>We’re seeking a motivated and ambitious individual that can serve on the frontline of our marketing and sales efforts to prospect, identify qualified leads, and generate interest in LogCheck. Your goal is to get qualified leads to take the next step and speak live with one our our Sales Account Executives.</p><p>As an early employee you’ll be working directly with the CEO and Head of Sales, and your voice will have an influence and effect on all aspects of business at LogCheck. The connections you make through customer outreach will give you the ability to make a name for yourself in the fast-changing world of real estate technology.</p><p>This is an entry-level sales position with room for growth. If you are interested in joining our awesome sales team, convince us to take the next step with you when you submit your application.</p><p>WHAT YOU GET</p><p>Competitive salary and benefits<br>Meet and connect with executives at the biggest real estate and facility management companies<br>Work with the brightest team in NYC that are hyper-focused on success<br>Learn how to start and grow a business as an entrepreneur<br>Chipotle team lunch every Friday<br>Make a name for yourself in sales and the startup world in NYC’s Silicon Alley</p><p>RESPONSIBILITIES</p><p>Building and maintaining lead lists of potential clients through internet research and the assistance of our marketing team.<br>Engage prospects by emailing 100+ people per day under a semi-automated process and calling a subset of those based on measured engagement.<br>Enter client data and update changes to existing accounts in the Salesforce.com CRM database<br>Book meetings with targeted and qualified leads and hand-off to Sales Account Executive (Goal: 1-2 meetings booked per day)<br>Distribute marketing materials associated with new and existing products.</p></div>",
    "urlFetchPending": false,
    "published": "Feb 26, 2018 7:25:24 PM",
    "tags": [
      "Full Time",
      "New York City",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "wBysi_RkRZ6CJEavHm3Ahg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-marketing",
    "url": "https://weworkremotely.com/remote-jobs/group-twenty-seven-google-adwords-ppc-account-manager",
    "title": "Group Twenty Seven: Google AdWords PPC Account Manager",
    "content": "<div>  <div>    <h2>Google AdWords PPC Account Manager</h2>      <h4>Posted Feb 24</h4>    <h3>      <span>Group Twenty Seven</span><br>      <span>Headquarters: Massachusetts</span><br>        <a href='https://grouptwentyseven.com/' rel='nofollow'>https://grouptwentyseven.com/</a>      <br>      <a rel='nofollow'>View all Group Twenty Seven jobs →</a>    </h3>  </div></div>  <div>    <div>Group Twenty Seven is a boutique online advertising agency that’s run by a close-knit team of advertising professionals.</div><div><br></div><div>Our team is distributed geographically (with most located in Colorado and Massachusetts), but you wouldn’t know it from how we interact. We work together closely and collaboratively—and have a genuine fondness and respect for one another.</div><div><br></div><div>All of us are driven by the common goal of getting good results for our clients. If one team member needs extra help, other team members pitch in. We like our work and are focused on performing it smartly and efficiently. That’s just how we do it!</div><div><br></div><div>If this collaborative team environment sounds like a good fit for you, read on to learn more:</div><div></div><div><br></div><div><b>Responsibilities</b></div><div><br></div><ul><li>&nbsp; &nbsp; Provide overall day-to-day management of AdWords and Bing Ads client accounts</li><li>&nbsp;&nbsp;&nbsp; Work directly with clients to meet the goals of their PPC programs</li><li>&nbsp;&nbsp;&nbsp; Manage budgets daily to stay within monthly budget limits</li><li>&nbsp;&nbsp;&nbsp; Review key metrics daily, such as leads, sales, quality scores, positions and impression shares</li><li>&nbsp;&nbsp;&nbsp; Regularly manage for quality traffic</li><li>&nbsp;&nbsp;&nbsp; Manage search, display, shopping and video campaigns</li><li>&nbsp;&nbsp;&nbsp; Create new campaigns and develop campaigns to improve performance</li><li>&nbsp;&nbsp;&nbsp; Provide recommendations to further enhance program performance</li><li>&nbsp;&nbsp;&nbsp; Generate monthly reports</li><li>&nbsp;&nbsp;&nbsp; Work closely with PPC Associates who will support you in your day-to-day tasks.</li></ul><div><br></div><div><b>Required skills</b></div><div><br></div><ul><li>&nbsp;&nbsp;&nbsp; Ability to identify and creatively solve problems</li><li>&nbsp;&nbsp;&nbsp; Very high attention to detail</li><li>&nbsp;&nbsp;&nbsp; Ability to multi-task and set priorities</li><li>&nbsp;&nbsp;&nbsp; Skilled at communicating with clients about their PPC programs, including complex topics.</li><li>&nbsp;&nbsp;&nbsp; Enjoys learning about new businesses &amp; industries; can appropriately apply what’s learned to develop new or amend existing PPC strategies</li><li>&nbsp;&nbsp;&nbsp; Self motivated</li><li>&nbsp;&nbsp;&nbsp; Analytical mindset</li><li>&nbsp;&nbsp;&nbsp; Loves performing data analysis.</li></ul><div><br></div><div><b>Qualifications</b></div><div><br></div><ul><li>&nbsp;&nbsp;&nbsp; Minimum two years experience managing AdWords accounts and working directly with clients</li><li>&nbsp;&nbsp;&nbsp; Experience with Google Analytics</li><li>&nbsp;&nbsp;&nbsp; Proficient in Excel, PowerPoint and/or Google Sheets and Slides</li><li>&nbsp;&nbsp;&nbsp; AdWords and/or Bing certified</li><li>&nbsp;&nbsp;&nbsp; Undergraduate degree in arts, science or related area.</li></ul><div><br></div><div><b>Benefits</b></div><div><br></div><ul><li>&nbsp;&nbsp;&nbsp; Competitive salary</li><li>&nbsp;&nbsp;&nbsp; Health insurance </li><li>&nbsp;&nbsp;&nbsp; Three weeks compensated time off per year</li><li>&nbsp;&nbsp;&nbsp; Ten holidays per year</li><li>&nbsp;&nbsp;&nbsp; Opportunities to advance to more senior levels of management.</li></ul><div></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>To apply, tell us why you’re a good fit! Email your resume and cover letter to Pauline Jakober: <a href='mailto:pjakober@grouptwentyseven.com' rel='nofollow'>pjakober@grouptwentyseven.com</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 24, 2018 6:04:46 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "6eHGwdWAQ2mdJpEJOeNnPw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/66539/graduate-sales-executive-at-snowplow-analytics/",
    "title": "Graduate Sales Executive",
    "content": "Graduate Sales Executive <br />London/Remote (UTC+0 - UTC+1)<br /><br />Our mission is to empower people and companies to use data to do transformative things. We provide technology and services that enables our users to collect the data that they want, use that data to understand each of one of their customer’s complete user journeys, and transform their business.<br /><br />Snowplow has grown significantly this last year and is set to do the same in 2018. Having recently brought on our VP Sales, we are now looking for a driven Sales Executive to join him in our newly formed sales function.<br /><br />The Opportunity:<br /><br />The role comes with enormous scope for progression and it's a chance for someone to get involved with aspects of the entire sales cycle, as well as helping create marketing collateral. There's no pressure to be a sales expert straight away though! You'll start by qualifying warm, inbound leads and designing some outbound sales material, and will the move onto being able to demo our product and working on more advanced employer branding.<br /><br />The environment you’ll be working in:<br /><br />Our culture is as unique as our customers. Over half of our employees work remotely so we have fostered an environment based on trust, communication and a solution-focused attitude. You won’t find micro-management here and everyone takes ownership of their work. Collaboration is at core of everything we do and all of us are learning every day (it's ok to make mistakes). <br /><br />What you’ll be doing:<br /><br />Managing warm, inbound sales queries in Salesforce<br />Qualifying inbound leads and carrying out initial calls with potential customers<br />Working with marketing on imaginative outbound sales material<br />Gaining deep knowledge of our product with a view to being able to take over some demo calls from our VP Sales<br />Develop content for social media campaigns<br />Conduct research and analyse sales & marketing efforts  <br />Effectively managing your workload, prioritising tasks and getting on with your work, even when our VP Sales is on client visits<br />Learning how to conduct client meetings<br /><br />What you bring to the team:<br /><br />A conscientious, team-oriented attitude<br />Passion for technology and adding value to businesses through data<br />Drive, focus and determination<br />Fantastic communication skills, both written and verbal<br />Confident, calm and collected nature<br />Self-motivated and always looking to for opportunities to learn & improve<br /><br />What you’ll get in return:<br /><br />Competitive package (basic salary + commission) based on experience <br />25 days holiday a year plus bank holidays<br />The freedom to work wherever suits you best<br />Two fantastic company Away-Weeks in a different European location each a year <br />Working alongside a supportive and talented team<br />Opportunity to be part of our Cultural Works Committee/Software Development Guild <br /><br />Office-specific:<br /><br />Convenient central Shoreditch location<br />Continuous supply of Pact coffee<br />Regular mystery events/meetups/offsites<br />MacBook and 5K 27” screen",
    "urlFetchPending": false,
    "published": "Feb 23, 2018 9:54:34 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "-Ss3f7WOTfu_dJhIAbPpkQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-programmers",
    "url": "http://workinstartups.com/job-board/job/66410/global-business-developer-intern-at-passionio/",
    "title": "Global Business Developer -- Intern",
    "content": "PASSION.io is the Berlin-based company that lets you discover your passion through successful people and enables you to learn their top skills. We are an international team with the majority of our customers in the US and the vision to improve 10 million lives by 2022.<br /><br />We are looking for an inspiring, engaged and motivated new member for our business development team that proactively drives our US expansion and manages projects related to that. You gained work experiences in high-paced environments and have the vision to change the future of learning. <br /><br />Your mission will be to build and execute on various projects to market the Passion.io learning experience to millions of people anytime, anywhere.<br />We work with social media celebrities with millions of followers. Working on key projects around them will be a relevant part of the job. Hence, past experience with project management, sales and strong execution skills would be beneficial. You will work in a cross-functional team to deliver high quality, outstanding work.<br /><br />*What you'll be working on*<br />* Work in our task force of our best people: On each assignment you will drive a specific function such as marketing, product, celebrity management, and operations<br />* You will analyze different verticals in the US, close partnerships, organize video productions, and build up deep functional expertise<br />* You will face and tackle the challenges of setting a business from scratch as well as strategically planning our expansion<br />* Passion is moving at high speed and will provide you with immense opportunities for initiative, creativity and leadership<br />* This job is an unique opportunity to learn, experience &amp; join a first-class team<br /><br />*What you'll bring to the team*<br />* Outstanding degree at a top university (likely: MBA, Wi-Ing or similar)<br />* Desirable: Prolonged stay abroad (&gt; 6 months)<br />* You have exceptional analytic skills and a strong attention to detail as well as a hands-on mentality<br />* Preferably gained 2 years professional experience in high-performance environments (strategy consulting, banking, start-up, or similar)<br />* Proven track record of professional achievements<br />* Project management: You planned, implemented and controlled major projects, in particular extensive analytical, sales, and marketing work<br />* Preferably: supported internationalization, set up new business verticals<br /><br />*What we offer you*<br />* Steep learning curve: Expect the steepest learning curve you have ever experienced - we are building a playground at passion.io to become the best version of ourselves. Meet and work with successful people worldwide to learn their success secrets.<br />* Value-based company: Be part of an open, honest, creative, and results-driven environment where your opinion is highly valued. We want to change the globe for the better by providing value to others.<br />* High-growth environment: You will be part of a strongly growing company with the opportunity to develop into a key contributor with incomparable responsibilities.<br />* Personal and professional development: You will tackle projects across departments and thereby gain a top-notch tool box to succeed in tackling bigger and bigger challenges.<br />* Autonomy / entrepreneurial work-style: You will only be measured by the results you produce and are in the driver’s seat, with full flexibility.<br />* Berlin: You will join our friendly and international team located in the heart of Berlin Mitte.",
    "urlFetchPending": false,
    "published": "Feb 20, 2018 10:13:48 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "iRintfULThOmZ4FbXkA7Cg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/66408/media-buyer-online-funnel-performance-marketer-intern-at-passionio/",
    "title": "Media Buyer / Online Funnel Performance Marketer -- Intern",
    "content": "PASSION.io is the Berlin-based company that lets you discover your passion through successful people and enables you to learn their top skills. We are an international team with the majority of our customers in the US and the vision to improve 10 million lives by 2022.<br /><br />You gained first experiences with online marketing and have the vision to change the future of learning. Your mission will be to build and execute on marketing campaigns on social media channels to market the Passion.io learning experience to millions of people anytime, anywhere.<br /><br />Our social media channels are Instagram, Facebook, and YouTube – so experience with it is highly desirable. Creating inspiring and motivating campaigns and ads around our instructors will also be a relevant part of the job. Hence, past experience with creating campaigns and ads and any writing experience would be beneficial. You will work in a cross-functional marketing team to deliver high quality, outstandingly inspiring stories on social media. You will directly report to our Marketing Manager and be responsible for the management of all social media channels. Thus, you can also be creative and instantly execute the ideas you have.<br /><br />*What you'll be working on*<br />* Work with 6-figure budgets in various markets incl. USA, CA, UK, AUS<br />* Constantly optimize all relevant Facebook metrics in order to maximize profit after variable marketing cost for our products: audiences, budgets, bidding, conversions<br />* Research best practices and utilize company research and partners to implement and test best performing Facebook Marketing practices<br />* Work with internal &amp; external copywriters for best landing pages and ad copies<br />* Create ad copy that includes the components that lead to high conversion rates: interesting, curious, emotional, empowering, exciting, urgent, scarce, actionable<br />* Work closely together with videographers &amp; designers on best performing ad materials<br />* Use the correct brand voice when communicating on behalf of a celebrity partner<br />* Work closely together with CRM &amp; Copywriter to direct traffic with the intention of maximizing lead value and therefore marketing profit<br />* Research &amp; test new traffic campaigns on additional channels like YouTube, Google * AdWords, Native Ads and GDN and other new platforms<br />* Track results for key KPI’s: learn, iterate and report results to marketing &amp; funnel manager, including daily performance reports for running campaigns<br />* Split testing and tracking variables that contribute to KPI<br /><br />*What you'll bring to the team*<br />* Profound skills with numbers and data<br />* Business studies or studies in a field that builds analytical and data-oriented skills<br />* Advanced knowledge (usage) of different social media channels<br />* Hard working attitude with an eagerness to learn and self-teach<br />* Independent and self-motivated work style<br />* Experience in Social Media Performance Marketing or CRM would be a clear benefit<br /><br />*What we offer you*<br />* Steep learning curve: Expect the steepest learning curve you have ever experienced - we are building a playground at passion.io to become the best version of ourselves. Meet and work with successful people worldwide to learn their success secrets.<br />* Value-based company: Be part of an open, honest, creative, and results-driven environment where your opinion is highly valued. We want to change the globe for the better by providing value to others.<br />* High-growth environment: You will be part of a strongly growing company with the opportunity to develop into a key contributor with incomparable responsibilities.<br />* Personal and professional development: You will tackle projects across departments and thereby gain a top-notch tool box to succeed in tackling bigger and bigger challenges.<br />* Autonomy / entrepreneurial work-style: You will only be measured by the results you produce and are in the driver’s seat, with full flexibility.<br />* Berlin: You will join our friendly and international team located in the heart of Berlin Mitte.",
    "urlFetchPending": false,
    "published": "Feb 20, 2018 10:11:45 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "rxgGKB4JRI2FL02HJR3z3Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/66407/media-buyer-online-funnel-performance-marketer-trainee-at-passionio/",
    "title": "Media Buyer / Online Funnel Performance Marketer -- Trainee",
    "content": "PASSION.io is the Berlin-based company that lets you discover your passion through successful people and enables you to learn their top skills. We are an international team with the majority of our customers in the US and the vision to improve 10 million lives by 2022.<br /><br />You gained experiences with online marketing and have the vision to change the future of learning. Your mission will be to build and execute on marketing campaigns on social media channels to market the Passion.io learning experience to millions of people anytime, anywhere.<br /><br />Our social media channels are Instagram, Facebook, and YouTube – so experience with it is highly desirable. Creating inspiring and motivating campaigns and ads around our instructors will also be a relevant part of the job. Hence, past experience with creating campaigns and ads and any writing experience would be beneficial. You will work in a cross-functional marketing team to deliver high quality, outstandingly inspiring stories on social media. You will directly report to our CMO and be responsible for the management of all social media channels. Thus, you can also be creative and instantly execute the ideas you have.<br /><br />*What you'll be working on*<br />* Assisting the CMO<br /># You will be assigned to the Chief Marketing Officer who will be your mentor during the entire program<br /># You will drive focus projects to leverage and bond with your mentor<br /># Define, structure, develop processes and tools, and show measurable results<br /><br />* Social Performance Marketing<br /># You work on facebook and instagram performance marketing while consistently sounding out the market to help refine the offers while monitoring and optimizing key performance indicators (KPIs): (Video) Ad Creation, Landing Pages, Squeeze Pages, Quizzes, Waitlists, Challenges, Order Form, Sales Pages, VSL, PLFs with the goal to maximize Frontend ROI per lead<br /># You will have ideas for further developing the funnels, have a clear idea about new offers, and how they will transform the market<br /># You will successfully drive offers through the lifecycle from conception to launch to scale<br /><br />* Conversion Rate Optimization<br /># You will work on key projects in marketing, such as LPO (landing page optimization), funnel hacking, mobile, loyalty, and others to deliver high quality traffic, optimize conversion rates, and improve retention<br /># You will support implementing the international marketing strategy and its roadmap across markets<br /># You will keep a close eye on the market, competition and use your research to continuously improve marketing activities<br /><br />* Maximize Lifetime Profits<br /># Build and convert the non-buyer user base (from emails, Facebook groups, etc.) into paying customers with group postings and time-based promotions (e.g. Black Friday, date-based challenges)<br /># Build and convert our paying customer base in upsells, cross-sells, alternate products<br /># Increase retention by onboarding, engaging, and locking the customer in our programs<br /># Deliver key projects that increase referrals<br /><br />* Prep project for your new role<br /># In this module, you will be prepared you for your new role after the traineeship is over<br /><br /><br />*What you'll bring to the team*<br />* Profound skills with numbers and data<br />* Business studies or studies in a field that builds analytical and data-oriented skills<br />* Advanced knowledge (usage) of different social media channels<br />* Hard working attitude with an eagerness to learn and self-teach<br />* Independent and self-motivated work style<br />* Experience in Social Media Performance Marketing or CRM would be a clear benefit<br /><br /><br />*What we offer you*<br />* Steep learning curve: Expect the steepest learning curve you have ever experienced - we are building a playground at passion.io to become the best version of ourselves. Meet and work with successful people worldwide to learn their success secrets.<br />* Value-based company: Be part of an open, honest, creative, and results-driven environment where your opinion is highly valued. We want to change the globe for the better by providing value to others.<br />* High-growth environment: You will be part of a strongly growing company with the opportunity to develop into a key contributor with incomparable responsibilities.<br />* Personal and professional development: You will tackle projects across departments and thereby gain a top-notch tool box to succeed in tackling bigger and bigger challenges.<br />* Autonomy / entrepreneurial work-style: You will only be measured by the results you produce and are in the driver’s seat, with full flexibility.<br />* Berlin: You will join our friendly and international team located in the heart of Berlin Mitte.",
    "urlFetchPending": false,
    "published": "Feb 20, 2018 10:10:52 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "1HhrGdu_RyCJaMotwvBggg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/epianalytics-1/jobs/119045-enterprise-sales",
    "title": "Enterprise Sales",
    "content": "<div><h2>Enterprise Sales at EpiAnalytics</h2><div>San Francisco, San Diego, Virginia, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Enterprise Software, Text Analytics, Subscription Models, SalesForce.com, Solutions Selling, Software as a service</div><div>Compensation</div><div>$60K–$85K<br>0.01%–0.025%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Solution Sales Executive</p></div>",
    "urlFetchPending": false,
    "published": "Feb 14, 2018 1:45:03 AM",
    "tags": [
      "Enterprise Software",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "SalesForce.com",
      "San Diego",
      "San Francisco",
      "Software as a service",
      "Solutions Selling",
      "Subscription Models",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown",
      "Text Analytics",
      "Virginia"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "5JQDaAZaQluJU5-RbMyvow",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "weworkremotely.com-management",
    "url": "https://weworkremotely.com/remote-jobs/lean-startup-co-director-of-business-development",
    "title": "Lean Startup Co.: Director of Business Development",
    "content": "<div>  <div>    <h2>Director of Business Development</h2>      <h4>Posted Feb 12</h4>    <h3>      <span>Lean Startup Co.</span><br>      <span>Headquarters: Walnut, CA</span><br>        <a href='https://lean-startup-co.breezy.hr/p/2ca49bcd5bcc01-director-of-business-development?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/2ca49bcd5bcc01-director-of-business-development?source=weworkremotely</a>    </h3>  </div>    </div>  <div>    <div>Born from the global movement spawned by Eric Ries’ books,&nbsp;<a href='http://leanstartup.co/' rel='nofollow'>Lean Startup Company</a>&nbsp;offers the most exciting education solutions in modern management available today.</div><div><br></div><div>A cutting-edge methodology, Lean Startup principles provide a scientific approach to problem-solving and a&nbsp;<span>framework for innovation,</span>&nbsp;so you can learn what your customers really want. It’s about testing continuously, so you can effectively adapt and adjust before it’s too late.</div><div><br></div><div>LSCo’s&nbsp;<a href='https://leanstartup.co/education/' rel='nofollow'>year-round education</a>&nbsp;efforts bring the entrepreneurial spirit to all types of organizations and help them transform how they work. We serve every size company and sector of the economy - from the the aspiring entrepreneur to high-growth startups, nonprofits, and large bureaucratic institutions. The industry looks to us for practical knowledge and valuable lessons in modern management. Through our various&nbsp;<a href='https://leanstartup.co/blog/' rel='nofollow'>media</a>&nbsp;and live event efforts, we aim to serve our highly-engaged community members with professional, high-quality, and practical content.</div><div><br></div><div>As the Lean Startup movement grows, there is an increasing need to connect those who want to learn with those who want to help them move towards working the Startup Way. And&nbsp;<a href='https://leanstartup.co/' rel='nofollow'>Lean Startup Co</a>. is the answer.</div><div><br></div><div><span>ABOUT THE POSITION</span></div><div><br></div><div>As the home base for the Lean Startup movement, we have a hearty community of enthusiastic followers. So we don’t need a Director of Business Development who preaches best practices.<span>&nbsp;We are seeking a tenacious and metrics-driven Director of Business Development who has a proven track record of mastering product knowledge, building meaningful client relationships, closing large deals with enterprise companies and championing new ways of supporting our customers.</span></div><div><span>Role Overview:</span>&nbsp;Learn and document the goals and challenges of large organizations seeking Lean Startup Education, determine if they’re the right fit for us to support, gain clarity on the outcome(s) they are looking for, only commit to what our Faculty can surely deliver, negotiate and close sales.</div><div><br></div><div>Come join us if you’re ready to help us<span><em>&nbsp;help our customers solve the world’s biggest problems.</em></span></div><div><span>You’ll thrive in this role if you have experience delivering results in these four areas of core competency:</span></div><div><br></div><ol><li><em>You have a natural sales ability and the experience to back it up. You’ve helped develop and lead company Business Development/Sales strategy to drive sales and revenue growth.</em></li><li>You’ve been the top Business Development/Sales performer at 1+ companies and have a track record of successful outcomes using data-driven decision-making.</li><li>You’re excited to share examples of 1) your ability to pitch ideas and create tests, with the outcome to drive sales and revenue growth, 2) different strategies (e.g. new pricing) you’ve tested, and 3) impact you’ve had</li></ol><div><li><em>Not only are you a sales extraordinaire, but you are also financially savvy.</em></li></div><ul><li>Sure, there are plenty of folks that can show how they produce results from their efforts, but you also demonstrate a deep understanding of the business and delicate balance between business development spend, testing, and results.</li><li>You have a track record of developing, setting and managing ambitious and actionable sales goals, forecasts, and operating budgets that are aligned to target metrics.</li><li>You believe in and practice financial stewardship.</li></ul><div><li><em>You are already an all-star Director of Business Development. Don’t bother talking table stakes. All you need to ramp up is time to fully master all the products we have to offer.</em></li></div><ul><li>You are an excellent listener. You create meaningful relationships with customers and believe in matching their needs with the services that will solve their unique problems.</li><li>You’re excited to sell product offerings in the consulting services space. You’re comfortable pitching new (or refined) product offerings to existing and new markets and verticals</li><li>You’re a master at presenting and getting buy-in from senior leader and executive level stakeholders and know what it takes to drive closing a deal from initial qualification, formal evaluation, and negotiation all the way through to close, including pricing, legal and procurement approval</li><li>You’re proud to represent, and intimately know, all facets of the products you’ve sold. You can clearly communicate the value of the last few products you sold (and how it is a validated solution for your customer’s problems!).</li></ul><div><li><em>You’re in it not to just hit sales goals, but to help us achieve company goals and make a bigger impact in our community.</em></li></div><ul><li>You’re a team player at heart. You have sales goals to hit, and you know how to work with other functions (e.g. marketing, account management, etc) to make them happen.</li><li>You can proudly share stories about how your actions and efforts supported company goals/growth.</li></ul><div></div><div></div><div><br></div><div>In this role, you’ll work closely with the Director of Sales to achieve the following:</div><div><br></div><ul><li>Test, report on, learn and iterate from the outcomes of sales initiatives</li><li>You’ll be deeply involved with:</li><li>Business development and sales planning and reporting (including setting annual revenue targets)</li><li>Pipeline management and expansion opportunities</li></ul><div>You’ll also work closely with the Director of Marketing to help inform and refine LS education products based on insider knowledge obtained from building meaningful client relationships.</div><div></div><div></div><div><br></div><div><span>You’ll fit right into this role and our team if:</span></div><div><br></div><ul><li>You are a great listener and have the ability to understand customer goals and pain points, and how our products can help solve some of their biggest challenges.</li><li>You’re curious and resourceful. You LOVE solving problems and aren’t afraid to admit you are obsessed with getting the details right.</li><li>You have experience with, and ENJOY working for a young growing startup. You’ll love the balance you need in this role; a mix of big picture, strategic thinking and rolling up your sleeves and getting into the details.</li><li>You love that some processes haven’t been put in place. You’re excited to be deeply involved with building out the business development and sales function and the systems and processes to steer a well-run ship and team.</li><li>You have a strong sense of ownership and urgency as it relates to the health of the company.</li><li>You possess high levels of integrity, autonomy, and self-motivation.</li><li>You are open to feedback, take ownership of your mistakes, and love applying your lessons learned to get 10x better.</li><li>You have a keen ability to manage competing and changing priorities.</li><li>You are assertive, fair, and capable of directing others and implementing projects with little to no supervision.</li><li>You work well with cross-functional teams and hold yourself accountable for your actions.</li></ul><div><br></div><div><span>Requirements:</span></div><div><br></div><ul><li>BA/BS in Marketing, Business, Communication or related field preferred. MBA or other related graduate degree a plus.</li><li>7+ years of Sales experience</li><li>Familiarity with and enjoy working remotely and collaboratively (Slack, Zoom, Google apps).</li><li>Excellent written, verbal and presentation skills.</li><li>Consistent and thorough attention to detail; it's important to understand the goals and challenges of customers, craft a proposal that matches the outcomes they are looking for with our offerings, negotiate a contract that encompasses the above, and ensure our Team and Faculty can deliver on those commitments.</li><li>Ability to juggle and prioritize many different tasks simultaneously, and enjoy collaborating with a wide range of people.</li><li>Experience with Salesforce</li><li>Experience speaking to and negotiating with C-Suite and Senior Executives at medium to enterprise-level companies</li><li>Availability during regular business hours to schedule calls with prospects in varying time zones.</li><li>Incorporate the mission of Lean Startup Company into all aspects of the role, like encouraging customers to share their Lean Startup learnings and story with our community via blog, podcast or case study.</li></ul><div><span></span></div><div></div><div><br></div><div><span>Bonus if you have:</span></div><div><br></div><ul><li>Experience selling consulting services</li><li>Business development experience in Lean Startup, tech and/or enterprise innovation spaces.</li></ul><div><span>Why You’ll Love Working With Us</span></div><div><br></div><ul><li><em>We encourage growth.</em></li><li>If it’s your dream to become a leader in an organization, this is the role for you. We seek people who want to be promoted and grow with us.</li></ul><div><li><em>You can work from wherever you want, as long as you have a working laptop and solid internet connection.</em></li></div><ul><li>We’re a 100% remote team using fun, collaborative tools.</li><li>We encourage unplugging for vacation and prefer you don’t check email while you’re away.</li></ul><div><li><em>Big impact.</em></li></div><ul><li>If you’ve ever wanted to be in the middle of it all and leave a legacy, this is it. The work we do will go down in history as powerfully-transformative.</li><li>We are a startup with&nbsp;<span>global brand recognition</span>&nbsp;headquartered in San Francisco, CA. Our global community will give you a front row seat to the challenges they’re facing around innovation. Better yet, you get to help them solve their problems.</li></ul><div></div><div></div><div><br></div><div>The&nbsp;<span>position is a 100% remote, full-time role</span>, but we ask that you’re 1) located in&nbsp;<span>the U.S.</span>&nbsp;and 2) available to communicate during Pacific Time business hours.</div><div><br></div><div>*Note - We understand that you are eager to hear back from us. We receive a lot of applications and cannot respond to all of them. Please do not reach out to us regarding your application. If there is a mutual fit, we will contact you to move forward with the next steps in the process.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p><a href='https://lean-startup-co.breezy.hr/p/2ca49bcd5bcc01-director-of-business-development?source=weworkremotely' rel='nofollow'>https://lean-startup-co.breezy.hr/p/2ca49bcd5bcc01-director-of-business-development?source=weworkremotely</a></p>  </div>",
    "urlFetchPending": false,
    "published": "Feb 12, 2018 4:12:13 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/nodejs",
      "TITLE1/sales",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "nodejs"
    ]
  },
  {
    "id": "oWRfjbbXRNKWS1KlnWKmYw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/fariaedu/jobs/142678-sales-associate-taipei",
    "title": "Sales Associate, Taipei",
    "content": "<div><h2>Sales Associate, Taipei at Faria Education Group</h2><div>Taipei, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Writing, Travel, Communication Skills, Empathy, Able to Work Independently, Written communication</div><div>Compensation</div><div>$25K–$36K<br>No Equity</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Description</p><p>We are looking for an energetic, persistent go-getter with significant prior sales experience.<br>You will have primary responsibility for outbound sales outreach for ManageBac in the EMEA region. ManageBac is the world’s leading software provider to International Baccalaureate world schools and currently serves over 2,000 schools in 120 countries.</p><p>Requirements</p><p>What are we looking for?<br>● Ability to manage high-stress situations and troubleshoot challenging problems.<br>● Exceptional written and oral communication skills.<br>● Ability to learn quickly &amp; execute quickly.<br>● Attention-to-detail and satisfaction from a job well-done.<br>● Native English speaker.</p><p>What will you learn in the first 30 days?<br>● How ManageBac is structured to support International Baccalaureate schools.<br>● Our standard outbound sales procedures.<br>● Our internal workflows for ensuring smooth, efficient sales follow-up.</p><p>Key Responsibilities<br>● Conducting school visits &amp; demonstrations with interested schools in your region, and moving them to trial.<br>● Qualifying new signups.<br>● Attending regional conferences and providing presentations.<br>● Working with the marketing team to follow up on recurring ManageBac marketing campaigns.</p><p>This position requires over 50% travel.</p><p>Benefits<br>$70,000 ~100,000 NTD/ month, negotiable and dependant on experience. <br>You will be eligible for a sales incentive bonus for each year based on reaching certain ARR targets.</p><p>To apply go to <a href='http://faria.co/work' rel='nofollow'>http://faria.co/work</a><br>Please note: Due to a high volume of applicants, only short-listed candidates will be contacted.</p></div>",
    "urlFetchPending": false,
    "published": "Feb 8, 2018 12:08:56 PM",
    "tags": [
      "Able to Work Independently",
      "Communication Skills",
      "Empathy",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/go",
      "TITLE1/sales",
      "TZ/unknown",
      "Taipei",
      "Travel",
      "Writing",
      "Written communication"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "go"
    ]
  },
  {
    "id": "uSqXB_YsQ2uDS9kBlKx_JQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/65994/graduate-sales-and-marketing-internship-paid-at-snowplow-analytics/",
    "title": "Graduate Sales and Marketing Internship (Paid)",
    "content": "Graduate Sales and Marketing Internship (Paid)<br />London/Remote (UTC+0 - UTC+1)<br /><br />Our mission is to empower people and companies to use data to do transformative things. We provide technology and services that enables our users to collect the data that they want, use that data to understand each of one of their customer’s complete user journeys, and transform their business.<br /><br />Snowplow has grown significantly this last year and is set to do the same in 2018. Having recently brought on our VP Sales, we are now looking for a driven Sales & Marketing Intern to join him in our newly formed sales function.<br /><br />The Opportunity:<br /><br />The internship will be 6 months with a view to taking this individual on permanently after this time period. There is enormous scope for progression and it's a chance for someone to get involved with aspects of the entire sales cycle, as well as helping create marketing collateral and working on our social media. There's no pressure to be a sales expert straight away though! You'll start by qualifying warm, inbound leads and designing some outbound sales material, and will the move onto being able to demo our product and working on more advanced employer branding.<br /><br />The environment you’ll be working in:<br /><br />Our culture is as unique as our customers. Over half of our employees work remotely so we have fostered an environment based on trust, communication and a solution-focused attitude. You won’t find micro-management here and everyone takes ownership of their work. Collaboration is at core of everything we do and all of us are learning every day (it's ok to make mistakes). <br /><br />What you’ll be doing:<br /><br />Managing warm, inbound sales queries in Salesforce<br />Qualifying inbound leads and carrying out initial calls with potential customers<br />Working with marketing on imaginative outbound sales material<br />Gaining deep knowledge of our product with a view to being able to take over some demo calls from our VP Sales<br />Develop content for social media campaigns<br />Conduct research and analyse sales & marketing efforts  <br />Effectively managing your workload, prioritising tasks and getting on with your work, even when our VP Sales is on client visits<br />Learning how to conduct client meetings<br /><br />What you bring to the team:<br /><br />A conscientious, team-oriented attitude<br />Passion for technology and adding value to businesses through data<br />Drive, focus and determination<br />Fantastic communication skills, both written and verbal<br />Confident, calm and collected nature<br />Self-motivated and always looking to for opportunities to learn & improve<br /><br />What you’ll get in return:<br /><br />Competitive package (basic salary + commission) based on experience <br />25 days holiday a year plus bank holidays<br />The freedom to work wherever suits you best<br />Two fantastic company Away-Weeks in a different European location each a year <br />Working alongside a supportive and talented team<br />Opportunity to be part of our Cultural Works Committee/Software Development Guild <br /><br />Office-specific:<br /><br />Convenient central Shoreditch location<br />Continuous supply of Pact coffee<br />Regular mystery events/meetups/offsites<br />MacBook and 5K 27” screen",
    "urlFetchPending": false,
    "published": "Feb 7, 2018 5:21:39 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ]
  },
  {
    "id": "0Q9GC5y4TU25762B0lGHKg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-sales",
    "url": "http://workinstartups.com/job-board/job/65945/partnerships-manager-at-granttree/",
    "title": "Partnerships Manager",
    "content": "DESCRIPTION<br /><br />From accountants to startup incubators, universities to innovation consultants, the range of partnerships we have at GrantTree is vast. Our useful funding products, which we believe will change the landscape of Government funding allows us to network with people at the forefront of software technology in the UK. We're excited to start our hunt for the talent who will grow and maintain our network of satisfied partners.<br /><br />Are you the self-motivated, entrepreneurial Partnerships Manager we're looking for?<br /><br />GrantTree was founded 7 years ago and employs 33 people. In our self-managing culture everyone has the freedom, power and trust to do great work. We call this open culture. It’s been successful for us so far, a rewarding and somewhat unusual working experience for self-motivated individuals (we suggest you check out our GlassDoor reviews). This is the ideal environment for creative, independent people who are open to developing through challenging work.<br /><br />Our Sales team is...<br /><br />High-reaching.<br />Brilliant at conversion.<br />Formed of talented individuals each with their own creative way of building effective relationships.<br /><br />Could you see yourself in this team?<br /><br />A significant amount of GrantTree's success is a direct result from collaboration with our partners. We work with fantastic organisations and it's important to us to continue to strengthen our relationships with each of our existing and newly on-boarded partners.<br /><br />You will work closely with the Partnership Director as a member of the wider Sales team to implement new partnership plans and to grow the deal flow from our existing Partnership base. Drawing on your prior Business Development experience you'll capitalise on your expert relationship building techniques to thrive within the Partnership space.<br /><br />REQUIREMENTS<br /><br />- You have professional experience in independent lead generation (within software/tech would be a plus).<br />- You're confident negotiating contracts and closing new business where necessary.<br />- You know how to generate and manage pipelines.<br />- You have the ability to implement partnership delivery plans.<br />- You enjoy working towards targets.<br />- Running workshops, roundtables, existing delivery plans and attending events are key activities for you.<br />- You're innovative, and think creatively about how to add further value to partnerships.<br />- You pride yourself on your brilliant communications skills.<br /><br />BENEFITS<br /><br />We believe that people should be rewarded fairly for the work they do. At GrantTree there is no secrecy over salaries and the way we work them out. For this role, this is likely to lie between £28k-£35k depending on experience. We don't have a commission structure here, and ask you to consider, &quot;is important to you?&quot;<br /><br />While we understand an environment without commission won't work for everyone, if you join our team at GrantTree you can enjoy the unlimited access to paid training we offer, access to health insurance, our cycle to work scheme, and an annual discretionary bonus which all contribute to the overall package.<br /><br />Aside from money, we offer a place where you can be yourself. We want you to develop your skills and fulfil your potential. We have a flexible approach to working, and some of our staff work remotely most of the time. Our office near Old Street is bright and airy, with a fab roof terrace. You can take up to 6 weeks as holiday each year.<br /><br />Equal Opportunities<br /><br />Teams are stronger when they have a diverse range of people. Applications are accepted from everyone, regardless of the categories they put themselves in. We also encourage talented ‘square pegs’, who don’t neatly fit into the person specification, to apply.<br /><br />How to Apply<br /><br />Please use the email address provided and let us know you saw this job on &quot;Work in Startups&quot;.",
    "urlFetchPending": false,
    "published": "Feb 6, 2018 4:38:57 PM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "FVTljXG9Qsef8RJX4Bla9w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/stellar-analytics/jobs/113814-business-development-partner",
    "title": "Business Development Partner",
    "content": "<div><h2>Business Development Partner at Stellar Analytics</h2><div>Earth, Europe, United States, Remote · Contract</div><div></div></div><div><div>Skills</div><div>Business Development, Sales and Marketing, New Business Development, Marketing Management</div><div>Compensation</div><div>₹200K–₹300K<br>No Equity</div></div><h3>Job Description</h3><div><p>Business Development Partner - Grow Stellar Analytics through partnerships.</p><p>Stellar Analytics is seeking exceptional business talent to join our growing team.</p><p>The Business Development team identifies worthwhile partners, negotiates and closes deals, and manages and cultivates ongoing partnerships. We're looking for help defining and executing a partnership strategy that achieves user and revenue growth. The Business Development team collaborates across teams internally--from Market Research to sales and Data Process Outsourcing.</p><p>You will:<br>Identify partnership opportunities and lead all aspects of deal execution, including prioritization of partners, strategic and financial assessment, transaction structuring and negotiation.</p><p>Work on partnerships including, but not limited to, product integration partnerships with Market Research publishing companies and distribution partnerships with Clients.</p><p>Manage established partnerships to increase the adoption of Stellar Analytics, and extend our relationship with the partner.</p><p>Build partnerships with other companies that can help make Stellar Analytics products and services better for users.</p><p>Compensation and Benefits:<br>You will be able to work flexible hours from any location<br>Compensation will be on Revenue sharing model<br>You will work independently so you will have no added pressure<br>Fixed Bonus subject to meeting targets</p></div>",
    "urlFetchPending": false,
    "published": "Feb 5, 2018 8:50:51 PM",
    "tags": [
      "Business Development",
      "Contract",
      "Earth",
      "Europe",
      "Marketing",
      "Marketing Management",
      "New Business Development",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Sales and Marketing",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown",
      "United States"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "3E4CMpC9RdWPrpONNCrssw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/instyle-villas/jobs/44706-sales-and-business-development",
    "title": "Sales and Business Development",
    "content": "<div><h2>Sales and Business Development at InStyle Villas</h2><div>Greece, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>€5K–€40K<br>1.0%–5.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Key Responsibilities:<br>•    Undertake local market analysis and build segmentation framework <br>•    Develop relationships with key contacts in local travel industry, and identify suitable opportunities for promoting InStyle Villas, and generate revenue opportunities through sale or rental of villas.<br>•    Develop additional revenue streams in line with short and long term objectives/targets, and strategies for the company<br>•    Conducting sales calls to key accounts or major prospects<br>•    Act as a local representative of the company<br>•    Support business development &amp; marketing activities<br>•    Promote ISV villas through local Social Media Channels: Facebook, Blogs, LinkedIn and other social networks<br>•    Suggest quality improvements<br>•    Develop client relationship through aligning with concierge services and luxury services <br>•    Follow up with client for satisfaction surveys</p><p>Requirements:<br>•    A Bachelor’s degree in tourism / hotel management / related degree is required, in-addition 1-3 years of demonstrated success promoting luxury travel rental&amp; packages preferably to local High Networth Individuals (HNI’s), wedding planners, and corporate clients. A Master’s degree in tourism and international education will be preferred.<br>•    Superior verbal communication skills. Bilingual – English +1 more language.<br>•    Proven track record of success in sales / partner development/account management<br>•    Ability to work well independently and be self-motivated<br>•    Have creative and entrepreneurial mindset; is interested in helping to build a business and to be compensated according to performance<br>•    Have demonstrated ability and initiative to handle increasing responsibility over time</p><p>Candidate (s) will initially be engaged on three month probation with remote training and monitoring from HQ. Candidates successfully meeting KPIs and Sales Target will be inducted into the team</p></div>",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 9:46:22 PM",
    "tags": [
      "Full Time",
      "Greece",
      "Marketing",
      "Office Manager",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "fo-2DRoQSzWbAvPaOlZABQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=IT&c=ITECH+SOLUTIONS&l=Remote&jk=e5689144c4378146&rtk=1c5gsur1c40gvbl3&from=rss",
    "title": "IT / Healthcare Recruiters or Business Developers - ITECH SOLUTIONS - Remote",
    "content": "<div><b>IT / Healthcare Recruiters or Business Developers</b><br><span>ITECH SOLUTIONS</span>     -<span>Remote</span>    <div>        <span>Full-time,&nbsp;Part-time,&nbsp;Temporary,&nbsp;Commission</span>        </div></div><span><p><b>Job Summary</b></p><p><b>100% COMMISSION BASED POSITIONS</b></p><p>We are looking for entrepreneurs mind set professionals who would like to work for a one year old start up Recruitment/ Staffing in areas of IT and Healthcare.</p><p>Also need Business Ambassador to help get the right clients and grow themselves with the company.</p><p><b>Benefits</b></p><p>This position is commission based, with a high earning potential. The fee structure is extremely high payable on a monthly basis. Could be hourly or monthly fixed commission on case to case basis.</p><p>This position will get you not only the first hand experience, but a long-term residual income from the sales of those recruited and the ability to work from home on your own flexible working hours.</p><p>Job Types: Full-time, Part-time, Temporary</p><p>Required experience:</p><ul><li>Healthcare Recruitment: 1 year</li><li>Business Generation/Sales: 1 year</li><li>IT Recruiting: 1 year</li><li>work on 100% commission basis only: 1 year</li></ul><p>Required education:</p><ul><li>Bachelor's</li></ul></span>",
    "urlFetchPending": false,
    "published": "Feb 4, 2018 10:03:53 AM",
    "tags": [
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "rC0g37arR8yOSsIofUeTAg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/consensys/jobs/252804-blockchain-education-growth-manager-strategic-initiatives-team",
    "title": "Blockchain Education Growth Manager, Strategic Initiatives Team",
    "content": "<div><h2>Blockchain Education Growth Manager, Strategic Initiatives Team at ConsenSys</h2><div>Brooklyn, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$90K–$130K<br>0.01%–0.01%</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Apply Here:  <a href='https://consensys.net/open-positions/?gh_jid=730153' rel='nofollow'>https://consensys.net/open-positions/?gh_jid=730153</a></p><p>ConsenSys is the world’s largest blockchain venture production studio focused on developing cutting edge application across all major industry sectors, investing in disruptive startups, and consulting global organizations / governments on decentralized technologies powered by Ethereum.</p><p>Our mission is to use these solutions to power the emerging economic, social, and political operating systems of the planet. ConsenSys is building the future of identity, financial markets, commerce, security and infrastructure, and more.</p><p>About the role:</p><p>The education team at ConsenSys is growing fast within ConsenSys with the first of its kind blockchain education programs being developed and delivered globally. We are a team of ex-consultants, bankers, product managers, project managers, educators, entrepreneurs, and teachers. Given the explosive growth of blockchain technologies worldwide, the projects led by this team are strategic in nature with implications for the global blockchain ecosystem.</p><p>The team’s partners include global corporations, major governments, world class developers / lawyers / business schools and our initiatives are changing education paradigms fundamentally.</p><p>Learn more about us here:</p><p><a href='https://consensys.net/press/' rel='nofollow'>https://consensys.net/press/</a><br><a href='https://consensys.net' rel='nofollow'>https://consensys.net</a><br>Our team's first initiative:  <a href='https://medium.com/@ConsenSysAcademy' rel='nofollow'>https://medium.com/@ConsenSysAcademy</a><br> <br>About you:</p><p>A multi-tasker who thrives in a fast-paced environment<br>Self-directed and motivated by leading projects end to end<br>An innovative problem solver who likes to get new initiatives off the ground and then see them executed flawlessly to completion<br>A strategic and critical thinker but with an eye to outcomes<br>A decision maker with the ability to generate buy-in and / or adjust conclusions rapidly based on inputs<br>Out of the box in solution design but methodical and structured in execution</p><p>Your Qualifications:</p><p>3-4 years of experience in finance, management consulting or building businesses<br>Excellent verbal and written communication skills with demonstrated experience engaging and influencing executives and entrepreneurs alike<br>Entrepreneurial spirit with track record for successfully delivering measurable results in fast-moving environments<br>You have a passion and enthusiasm for our business and the greater movement it is a part of<br>Great chemistry with our team and culture<br>Optional</p><p>MBA<br>Domain knowledge or prior experience in education or curriculum design<br>Technical understanding of blockchain<br>Brooklyn NY preferred, open to other remote locations</p></div>",
    "urlFetchPending": false,
    "published": "Feb 3, 2018 9:40:39 PM",
    "tags": [
      "Brooklyn",
      "Full Time",
      "Operations Manager",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "dr_xwgiZT86s7NnaWaa7ow",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/lobster/jobs/55654-sales-and-agency-business-development",
    "title": "Sales and Agency Business Development",
    "content": "<div><h2>Sales and Agency Business Development at Lobster</h2><div>London, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Business Development, Digital Media, Social Media, Networking, Sales, Ad Agency, Sales Strategy and Management, Social Media Marketing, Advertising, Twitter, Sales and Marketing, Communication Skills, Revenue Growth, Blogger Relations, Knowledge Management, Subscription Models, Agency Management, Growth Hacking, Love for Creativity, Account Management, Fluent in English</div><div>Compensation</div><div>£16K–£24K<br>0.3%–0.5%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>This is a business development role working with the digital media agency &amp; publishers industry. Meaning you need to talk great and write great, and most importantly, make agencies, media and publishers subscribe for Lobster.</p><p>Lobster is looking for a person experienced in working with (or better off within!) digital media, advertising agencies and creatives of all sorts. This is a very important role for us great dedication and a share option in the company, it is almost a co-founder role.</p><p>We have developed an outstanding tool for the agencies and publishers to find exactly right social media visual content and license it for work from the authors. Now we are turning it into the whole world’s honest place to access real people’s content and it’s your turn to come on stage and reach all the agencies that need it.</p><p>Launched on TechCrunch Disrupt Battlefield Europe 2014, Graduate of Wayra UK accelerator 2014, raised £1m in 2017, reached 10 million photos and videos immediately available with the help of AI, first great agency subscribers and brands – waiting for you to grow the UK &amp; European customer side!</p><p>We can only consider people in London and settled in the UK to join the team at this time, even though you may be in office only occasionally.</p></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 8:51:16 PM",
    "tags": [
      "Ad Agency",
      "Advertising",
      "Business Development",
      "Digital Media",
      "Full Time",
      "Growth Hacker",
      "London",
      "Networking",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Sales Strategy and Management",
      "Social Media",
      "Social Media Marketing",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/unknown",
      "Twitter"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "yR-gk5NqTjKGaORfFLiKaQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16287290",
    "title": "Databook: Data-driven sales. We provide the missing financial acumen for sales teams so they can sell on value ...",
    "content": "<div>                  <span>Databook: Data-driven sales.<p>We provide the missing financial acumen for sales teams so they can sell on value and directly to the C-suite.</p><p>Location:Palo Alto, CA (REMOTE OK, Full time)</p><p>Website:<a href='https://www.trydatabook.com' rel='nofollow'>https://www.trydatabook.com</a></p><p>Positions:- Backend Developer: mid-level or senior- Frontend Developer: junior or mid-level</p><p>Contact:inigo [_at_] trydatabook [_dot_] com<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 2, 2018 3:00:05 AM",
    "tags": [
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend"
    ]
  },
  {
    "id": "GeRySFWJRSGbh0d0OYD-nA",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "hackernews",
    "url": "https://news.ycombinator.com/item?id=16285549",
    "title": "(stealth start-up) | Business partner | Anywhere US | Part-time OK | REMOTE (US-only) | up to 50% equity",
    "content": "<div>                  <span>(stealth start-up) | Business partner | Anywhere US | Part-time OK | REMOTE (US-only) | up to 50% equity<p>I am looking for a business co-founder with up to 50% equity for a fully automated e-commerce business based initially on drop-shipping high quality items on Amazon and other platforms. In parallel, I am building an SaaS (another company) exposing some of the functionality developed for this purpose to 3rd party sellers and would like to have this new company as a dogfooding business that is fully automated, profitable, growing and solid (100% customer and platform satisfaction), instantly putting into use latest tech I develop. I have already fully automated inventory ETL generation, automated repricing, purging stale stock, retrieving orders, placing them at suppliers and notifying customers about shipping. In addition, I am a Deep Learning expert and work on NLP and TTS tech for automating client support as well. Your role would be handling all administrative tasks, searching for new high-quality suppliers, handling Amazon issues and initially customer support until it is automated away. You need to be a US resident, ideally citizen, working from anywhere/anytime you want, usually less than 1h/day. Contact me on deepmarket@tuta.io.<span>              </span></p><div>        <p>                      <u></u>                        </p></div></span></div>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 11:00:05 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ]
  },
  {
    "id": "YLSST4x5S2u-uDX8lzFTrw",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Enterprise+Account+Executive&c=Sparta+Systems&l=Remote&jk=007169250cd68c36&rtk=1c5g89oku144k3lk&from=rss",
    "title": "Enterprise Account Executive - EMEA - Sparta Systems, Inc. - Remote",
    "content": "<div><b>Enterprise Account Executive - EMEA</b><br><span>Sparta Systems, Inc.</span>     -<span>Remote</span>    </div><span>If you share a true passion for technology, enjoy working together in developing solutions, share ideas, and exchange knowledge we want to talk to you. Sparta Systems is the Leader in Enterprise Quality Management Solutions (EQMS) and moving forward!<br><br>We have a work hard, play hard culture and want the best players on our team! This is a huge opportunity to join an industry leader with potential for exponential growth and great financial reward. As an Account Executive at Sparta you will interact with senior management and have the opportunity to significantly contribute to the growth of our business! You will be responsible for selling Sparta software, services, and training within your assigned accounts/territory and to targeted top-ranked companies. Sales will be generated through personal contact, prospecting, business case justification, demonstrations, phone calls and written proposals. A complete sales cycle of activities from lead identification through contract negotiation, account transition to services, ongoing support and follow on sales will be performed.<br><br><b>Required skills:</b><br><ul><li>Minimum of 5 years selling complex enterprise software solutions to large corporations, with experience of selling to consumer products companies and C-level executives.</li><li>Proven success in previous sales experience for each of the past five years.</li><li>Expected minimum of 2-3 years’ experience at each position held during previous 10 years</li><li>Customer references will be requested</li><li>Education to degree level</li></ul><br><b>Preferred Skills:</b><br><br>Founded in 1994, Sparta Systems is the world’s premier provider of cloud and on-premise quality management software. We offer the solutions, analytics, and expertise that speed up quality and compliance. Companies in life sciences, consumer products, discrete manufacturing and more, rely on Sparta.<br><br><b>Sparta Systems Offers:</b><ul><li>Competitive salaries</li><li>401k and great benefits package</li><li>An outstanding collaborative work environment in our state of the art facility</li><li>Employee engagement programs such as Sparta Gives Back, Wellness, Spirit Committee, etc.</li><li>An opportunity to work for the leader</li></ul><br>Sparta Systems, Inc. is the industry leader for global enterprise quality management solutions (EQMS) and compliance management systems. Its TrackWise Enterprise Quality Management Software is a web-based software application used by quality, manufacturing, and regulatory affairs professionals to manage quality and compliance issues across the enterprise. We have an extensive customer base in the life sciences and other highly regulated industries. Sparta Systems offers its customers a complete solution for global quality management needs, including the onsite support required throughout the project lifecycle.<br><br>Life is short… Work somewhere outstanding… Sparta Systems!<br><br>Sparta Systems in an Equal Opportunity Employer with our Headquarters located in Hamilton, NJ</span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 10:20:26 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "5WgyzmaeRtuhfIb5-Ar7HQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Enterprise+Account+Executive&c=Sparta+Systems&l=Remote&jk=007169250cd68c36&rtk=1c5gchuka92paene&from=rss",
    "title": "Enterprise Account Executive - EMEA - Sparta Systems, Inc. - Remote",
    "content": "<div><b>Enterprise Account Executive - EMEA</b><br><span>Sparta Systems, Inc.</span>     -<span>Remote</span>    </div><span>If you share a true passion for technology, enjoy working together in developing solutions, share ideas, and exchange knowledge we want to talk to you. Sparta Systems is the Leader in Enterprise Quality Management Solutions (EQMS) and moving forward!<br><br>We have a work hard, play hard culture and want the best players on our team! This is a huge opportunity to join an industry leader with potential for exponential growth and great financial reward. As an Account Executive at Sparta you will interact with senior management and have the opportunity to significantly contribute to the growth of our business! You will be responsible for selling Sparta software, services, and training within your assigned accounts/territory and to targeted top-ranked companies. Sales will be generated through personal contact, prospecting, business case justification, demonstrations, phone calls and written proposals. A complete sales cycle of activities from lead identification through contract negotiation, account transition to services, ongoing support and follow on sales will be performed.<br><br><b>Required skills:</b><br><ul><li>Minimum of 5 years selling complex enterprise software solutions to large corporations, with experience of selling to consumer products companies and C-level executives.</li><li>Proven success in previous sales experience for each of the past five years.</li><li>Expected minimum of 2-3 years’ experience at each position held during previous 10 years</li><li>Customer references will be requested</li><li>Education to degree level</li></ul><br><b>Preferred Skills:</b><br><br>Founded in 1994, Sparta Systems is the world’s premier provider of cloud and on-premise quality management software. We offer the solutions, analytics, and expertise that speed up quality and compliance. Companies in life sciences, consumer products, discrete manufacturing and more, rely on Sparta.<br><br><b>Sparta Systems Offers:</b><ul><li>Competitive salaries</li><li>401k and great benefits package</li><li>An outstanding collaborative work environment in our state of the art facility</li><li>Employee engagement programs such as Sparta Gives Back, Wellness, Spirit Committee, etc.</li><li>An opportunity to work for the leader</li></ul><br>Sparta Systems, Inc. is the industry leader for global enterprise quality management solutions (EQMS) and compliance management systems. Its TrackWise Enterprise Quality Management Software is a web-based software application used by quality, manufacturing, and regulatory affairs professionals to manage quality and compliance issues across the enterprise. We have an extensive customer base in the life sciences and other highly regulated industries. Sparta Systems offers its customers a complete solution for global quality management needs, including the onsite support required throughout the project lifecycle.<br><br>Life is short… Work somewhere outstanding… Sparta Systems!<br><br>Sparta Systems in an Equal Opportunity Employer with our Headquarters located in Hamilton, NJ</span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 10:20:26 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "JulpB-V5RWSJy7W8pHy_Ow",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Enterprise+Account+Executive&c=Sparta+Systems&l=Remote&jk=007169250cd68c36&rtk=1c5gm7ns49ma3ej6&from=rss",
    "title": "Enterprise Account Executive - EMEA - Sparta Systems, Inc. - Remote",
    "content": "<div><b>Enterprise Account Executive - EMEA</b><br><span>Sparta Systems, Inc.</span>     -<span>Remote</span>    </div><span>If you share a true passion for technology, enjoy working together in developing solutions, share ideas, and exchange knowledge we want to talk to you. Sparta Systems is the Leader in Enterprise Quality Management Solutions (EQMS) and moving forward!<br><br>We have a work hard, play hard culture and want the best players on our team! This is a huge opportunity to join an industry leader with potential for exponential growth and great financial reward. As an Account Executive at Sparta you will interact with senior management and have the opportunity to significantly contribute to the growth of our business! You will be responsible for selling Sparta software, services, and training within your assigned accounts/territory and to targeted top-ranked companies. Sales will be generated through personal contact, prospecting, business case justification, demonstrations, phone calls and written proposals. A complete sales cycle of activities from lead identification through contract negotiation, account transition to services, ongoing support and follow on sales will be performed.<br><br><b>Required skills:</b><br><ul><li>Minimum of 5 years selling complex enterprise software solutions to large corporations, with experience of selling to consumer products companies and C-level executives.</li><li>Proven success in previous sales experience for each of the past five years.</li><li>Expected minimum of 2-3 years’ experience at each position held during previous 10 years</li><li>Customer references will be requested</li><li>Education to degree level</li></ul><br><b>Preferred Skills:</b><br><br>Founded in 1994, Sparta Systems is the world’s premier provider of cloud and on-premise quality management software. We offer the solutions, analytics, and expertise that speed up quality and compliance. Companies in life sciences, consumer products, discrete manufacturing and more, rely on Sparta.<br><br><b>Sparta Systems Offers:</b><ul><li>Competitive salaries</li><li>401k and great benefits package</li><li>An outstanding collaborative work environment in our state of the art facility</li><li>Employee engagement programs such as Sparta Gives Back, Wellness, Spirit Committee, etc.</li><li>An opportunity to work for the leader</li></ul><br>Sparta Systems, Inc. is the industry leader for global enterprise quality management solutions (EQMS) and compliance management systems. Its TrackWise Enterprise Quality Management Software is a web-based software application used by quality, manufacturing, and regulatory affairs professionals to manage quality and compliance issues across the enterprise. We have an extensive customer base in the life sciences and other highly regulated industries. Sparta Systems offers its customers a complete solution for global quality management needs, including the onsite support required throughout the project lifecycle.<br><br>Life is short… Work somewhere outstanding… Sparta Systems!<br><br>Sparta Systems in an Equal Opportunity Employer with our Headquarters located in Hamilton, NJ</span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 10:20:26 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "YKSAkU__SXWmrNmZAbhjbQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Enterprise+Account+Executive&c=Sparta+Systems&l=Remote&jk=007169250cd68c36&rtk=1c5gsus169tlkba1&from=rss",
    "title": "Enterprise Account Executive - EMEA - Sparta Systems, Inc. - Remote",
    "content": "<div><b>Enterprise Account Executive - EMEA</b><br><span>Sparta Systems, Inc.</span>     -<span>Remote</span>    </div><span>If you share a true passion for technology, enjoy working together in developing solutions, share ideas, and exchange knowledge we want to talk to you. Sparta Systems is the Leader in Enterprise Quality Management Solutions (EQMS) and moving forward!<br><br>We have a work hard, play hard culture and want the best players on our team! This is a huge opportunity to join an industry leader with potential for exponential growth and great financial reward. As an Account Executive at Sparta you will interact with senior management and have the opportunity to significantly contribute to the growth of our business! You will be responsible for selling Sparta software, services, and training within your assigned accounts/territory and to targeted top-ranked companies. Sales will be generated through personal contact, prospecting, business case justification, demonstrations, phone calls and written proposals. A complete sales cycle of activities from lead identification through contract negotiation, account transition to services, ongoing support and follow on sales will be performed.<br><br><b>Required skills:</b><br><ul><li>Minimum of 5 years selling complex enterprise software solutions to large corporations, with experience of selling to consumer products companies and C-level executives.</li><li>Proven success in previous sales experience for each of the past five years.</li><li>Expected minimum of 2-3 years’ experience at each position held during previous 10 years</li><li>Customer references will be requested</li><li>Education to degree level</li></ul><br><b>Preferred Skills:</b><br><br>Founded in 1994, Sparta Systems is the world’s premier provider of cloud and on-premise quality management software. We offer the solutions, analytics, and expertise that speed up quality and compliance. Companies in life sciences, consumer products, discrete manufacturing and more, rely on Sparta.<br><br><b>Sparta Systems Offers:</b><ul><li>Competitive salaries</li><li>401k and great benefits package</li><li>An outstanding collaborative work environment in our state of the art facility</li><li>Employee engagement programs such as Sparta Gives Back, Wellness, Spirit Committee, etc.</li><li>An opportunity to work for the leader</li></ul><br>Sparta Systems, Inc. is the industry leader for global enterprise quality management solutions (EQMS) and compliance management systems. Its TrackWise Enterprise Quality Management Software is a web-based software application used by quality, manufacturing, and regulatory affairs professionals to manage quality and compliance issues across the enterprise. We have an extensive customer base in the life sciences and other highly regulated industries. Sparta Systems offers its customers a complete solution for global quality management needs, including the onsite support required throughout the project lifecycle.<br><br>Life is short… Work somewhere outstanding… Sparta Systems!<br><br>Sparta Systems in an Equal Opportunity Employer with our Headquarters located in Hamilton, NJ</span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 10:20:26 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "vTalDmaJR8OVj5B4UUgu9g",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Commission+Based+Sales+Manager&c=Bham+Pharma&l=Remote&jk=4a96810af04ad9b2&rtk=1c5g89oku144k3lk&from=rss",
    "title": "Commission-Based Sales Manager - Bham Pharma - Remote",
    "content": "<div><b>Commission-Based Sales Manager</b><br><span>Bham Pharma</span>     -<span>Remote</span>    <div>        <span>                £30,000 - £50,000 a year - </span>        <span>Part-time,&nbsp;Commission</span>        </div></div><span><p>Requirements:</p><ul><li>Competent and confident over LinkedIn and the telephone</li><li>Hungry for success and a career in business</li><li>Happy to work remotely</li><li>Preferable but not necessary - Up to 3 years sales/business development experience in the pharmaceutical industry</li><li>Preferable but not necessary - Experience within the medical communications/medical writing sector</li></ul><p>Role:</p><ul><li>Opportunity to earn £30,000-£50,000+</li><li>Fully commission-based</li><li>Uncapped commission</li><li>Repeat commission on repeat business</li><li>Initially part-time - 2-3 days per week</li><li>Will receive full ongoing training and development</li></ul><p>Job Types: Part-time, Commission</p><p>Required experience:</p><ul><li>Sales: 2 years</li></ul><p>Job Location:</p><ul><li>Remote</li></ul><p>Required language:</p><ul><li>English</li></ul></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 5:40:20 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "lseko8pUS-yMMPuMsaHY9A",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Commission+Based+Sales+Manager&c=Bham+Pharma&l=Remote&jk=4a96810af04ad9b2&rtk=1c5gchuka92paene&from=rss",
    "title": "Commission-Based Sales Manager - Bham Pharma - Remote",
    "content": "<div><b>Commission-Based Sales Manager</b><br><span>Bham Pharma</span>     -<span>Remote</span>    <div>        <span>                £30,000 - £50,000 a year - </span>        <span>Part-time,&nbsp;Commission</span>        </div></div><span><p>Requirements:</p><ul><li>Competent and confident over LinkedIn and the telephone</li><li>Hungry for success and a career in business</li><li>Happy to work remotely</li><li>Preferable but not necessary - Up to 3 years sales/business development experience in the pharmaceutical industry</li><li>Preferable but not necessary - Experience within the medical communications/medical writing sector</li></ul><p>Role:</p><ul><li>Opportunity to earn £30,000-£50,000+</li><li>Fully commission-based</li><li>Uncapped commission</li><li>Repeat commission on repeat business</li><li>Initially part-time - 2-3 days per week</li><li>Will receive full ongoing training and development</li></ul><p>Job Types: Part-time, Commission</p><p>Required experience:</p><ul><li>Sales: 2 years</li></ul><p>Job Location:</p><ul><li>Remote</li></ul><p>Required language:</p><ul><li>English</li></ul></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 5:40:20 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "Ao9-L2U-QAey6m5ZP0WZ9Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Commission+Based+Sales+Manager&c=Bham+Pharma&l=Remote&jk=4a96810af04ad9b2&rtk=1c5gm7ns49ma3ej6&from=rss",
    "title": "Commission-Based Sales Manager - Bham Pharma - Remote",
    "content": "<div><b>Commission-Based Sales Manager</b><br><span>Bham Pharma</span>     -<span>Remote</span>    <div>        <span>                £30,000 - £50,000 a year - </span>        <span>Part-time,&nbsp;Commission</span>        </div></div><span><p>Requirements:</p><ul><li>Competent and confident over LinkedIn and the telephone</li><li>Hungry for success and a career in business</li><li>Happy to work remotely</li><li>Preferable but not necessary - Up to 3 years sales/business development experience in the pharmaceutical industry</li><li>Preferable but not necessary - Experience within the medical communications/medical writing sector</li></ul><p>Role:</p><ul><li>Opportunity to earn £30,000-£50,000+</li><li>Fully commission-based</li><li>Uncapped commission</li><li>Repeat commission on repeat business</li><li>Initially part-time - 2-3 days per week</li><li>Will receive full ongoing training and development</li></ul><p>Job Types: Part-time, Commission</p><p>Required experience:</p><ul><li>Sales: 2 years</li></ul><p>Job Location:</p><ul><li>Remote</li></ul><p>Required language:</p><ul><li>English</li></ul></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 5:40:20 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "cQGM8iIrSZ-k_41wfQHO3w",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.co.uk-2",
    "url": "http://www.indeed.co.uk/viewjob?t=Commission+Based+Sales+Manager&c=Bham+Pharma&l=Remote&jk=4a96810af04ad9b2&rtk=1c5gsus169tlkba1&from=rss",
    "title": "Commission-Based Sales Manager - Bham Pharma - Remote",
    "content": "<div><b>Commission-Based Sales Manager</b><br><span>Bham Pharma</span>     -<span>Remote</span>    <div>        <span>                £30,000 - £50,000 a year - </span>        <span>Part-time,&nbsp;Commission</span>        </div></div><span><p>Requirements:</p><ul><li>Competent and confident over LinkedIn and the telephone</li><li>Hungry for success and a career in business</li><li>Happy to work remotely</li><li>Preferable but not necessary - Up to 3 years sales/business development experience in the pharmaceutical industry</li><li>Preferable but not necessary - Experience within the medical communications/medical writing sector</li></ul><p>Role:</p><ul><li>Opportunity to earn £30,000-£50,000+</li><li>Fully commission-based</li><li>Uncapped commission</li><li>Repeat commission on repeat business</li><li>Initially part-time - 2-3 days per week</li><li>Will receive full ongoing training and development</li></ul><p>Job Types: Part-time, Commission</p><p>Required experience:</p><ul><li>Sales: 2 years</li></ul><p>Job Location:</p><ul><li>Remote</li></ul><p>Required language:</p><ul><li>English</li></ul></span>",
    "urlFetchPending": false,
    "published": "Feb 1, 2018 5:40:20 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "hyGV3bwZSb25l_LdMQjvBg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "angel.co",
    "url": "https://angel.co/circlehd/jobs/118780-enterprise-sales-business-development-specialist",
    "title": "Enterprise Sales / Business Development Specialist",
    "content": "<div><h2>Enterprise Sales / Business Development Specialist at CircleHD</h2><div>Seattle, Remote · Full Time</div></div><div><div>Compensation</div><div>$50K–$120K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Looking for a Sales Specialist and/or business development experienced in enterprise sales and business partnerships. </p><p>This will  be a contract position to begin with. We will not offer fixed salary at this point. It'll be result based compensation e.g. certain amount after qualified leads (setting the meetings), certain amount after closing the deals, bonus after hitting some number of closed deals.</p></div>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 9:55:33 PM",
    "tags": [
      "Account Manager",
      "Business Development",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Seattle",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "3CvXH5_iQCCca6fqWKNBpQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "jobmote",
    "url": "http://jobmote.com/jobs/532-facebook-ads-manager",
    "title": "Facebook Ads Manager",
    "content": "Facebook Ads&nbsp;Manager - Jobmote<div><div><h2>Facebook Ads&nbsp;Manager</h2><h5>Emily Hirsh, Inc.</h5></div></div><div><div><div><div><div><p>We’re looking for a rockstar Facebook Ads Manager to join our team.</p><p>Emily Hirsh, Inc. is a leading digital advertising and sales funnel strategy agency, primarily working with entrepreneurs and infopreneurs to scale their business and increase their revenue by providing strategic planning and management of their digital media buying.&nbsp;</p><p>We continue to grow rapidly and need another Facebook Ads Manager to help support our team.</p><p>We are looking for someone who has…</p><ul><li>1-2 years experience creating and managing client campaigns in Facebook Ads Manager and/or Power Editor</li><li>An ability to analyze and optimize client campaigns daily, including troubleshooting and issues and ideating new strategies</li><li>Familiarity with Pixel placement and management&nbsp;</li><li>Experience with client communication, including email correspondence and monthly strategy calls&nbsp;</li><li>The ability to manage their time and priorities on a day to day basis</li><li><strong>Excellent attention to detail&nbsp;</strong></li></ul><p>This is a remote position that requires 30-40 hours a week. We are looking for American or Canadian candidates who are available during US office hours and who are able to attend daily video meetings and accomodate monthly client calls.&nbsp;</p></div></div><div></div></div></div></div>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 7:21:52 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "WW0fL0AJQjW8eJDk8Yhzqg",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "authenticjobs.com",
    "url": "https://authenticjobs.com/jobs/30248?r=rss2",
    "title": "Emily Hirsh, Inc.: Facebook Ads Manager",
    "content": "<p>Part-time</p><p><strong>(Anywhere)</strong> </p><p>We're looking for a rockstar Facebook Ads Manager to join our team.</p><p>Emily Hirsh, Inc. is a leading digital advertising and sales funnel strategy agency, primarily working with entrepreneurs and infopreneurs to scale their business and increase their revenue by providing strategic planning and management of their digital media buying.&nbsp;</p><p>We continue to grow rapidly and need another Facebook Ads Manager to help support our team.</p><p>We are looking for someone who has...</p><ul><li>1-2 years experience creating and managing client campaigns in Facebook Ads Manager and/or Power Editor</li><li>An ability to analyze and optimize client campaigns daily, including troubleshooting and issues and ideating new strategies</li><li>Familiarity with Pixel placement and management&nbsp;</li><li>Experience with client communication, including email correspondence and monthly strategy calls&nbsp;</li><li>The ability to manage their time and priorities on a day to day basis</li><li><strong>Excellent attention to detail&nbsp;</strong></li></ul><p>This is a remote position that requires 30-40 hours a week. We are looking for American or Canadian candidates who are available during US office hours and who are able to attend daily video meetings and accomodate monthly client calls.&nbsp;</p><p></p><p><strong>Apply:</strong> </p>",
    "urlFetchPending": false,
    "published": "Jan 31, 2018 6:44:07 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "ona8vSGuSBmN9YuL91U8vQ",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "workinstartups-marketers",
    "url": "http://workinstartups.com/job-board/job/65707/social-media-manager-at-tempo/",
    "title": "Social Media Manager",
    "content": "Looking for a superstar social media manager to join an exciting new technology platform revolutionising the recruitment space. The role entails the following roles/responsibilities:<br /><br />- Working with creatives on social content;<br />- Working with the Marketing Manager on developing a social calendar;<br />- Scheduling and publishing regular posts, ensuring optimum reach and engagement rates;<br />- Post candid expiring content on InstaStories and Instagram Live;<br />- Actively interact with the community to grow the accounts;<br />- Focus on Instagram, Facebook and LinkedIn.<br /><br />The ideal candidate will be creative, energetic, outgoing and of course passionate about social media, with experience in successfully managing other brand's social accounts. This role works closely with the whole team, reporting into the Marketing Manager.<br /><br />Initially this role is for a part-time contract (24hrs/week), based in Victoria offices Mon-Fri, with requirement to spend some time on the weekends. There is room to make this role your own, increase your hours and move into a full-time/more perm role.<br /><br />Job Types: Part-time, Contract<br /><br />Salary: £300.00 /week",
    "urlFetchPending": false,
    "published": "Jan 30, 2018 8:01:14 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  },
  {
    "id": "DZQ5cW-ATLyGT0vo-GcX4Q",
    "source": {
      "contentTransform": "TEXT_STRIP_FORMATTING",
      "jobAdContentRegExp": ""
    },
    "sourceName": "indeed.com-2",
    "url": "http://www.indeed.com/viewjob?t=Account+Executive&c=McCormick&l=Work+at+Home&jk=ac846b111a5666e8&rtk=1c5gsur1c40gvbl3&from=rss",
    "title": "Account Executive (East Region) - McCormick - Work at Home",
    "content": "Account Executive (East Region) - Work at Home - Indeed Mobile<div><a rel='nofollow'></a></div><p><b>Account Executive (East Region)</b><br>McCormick - <span>Work at Home</span></p><div>McCormick &amp; Co., Inc., a world leader in the spice, flavor &amp; seasonings industry, is seeking a full time Retail Account Executive – Northeast &amp; Mid-Atlantic Region. This new hire will work for Gourmet Garden (gourmetgarden.com), a leading brand in the fresh produce department, calling on Ahold, Delhaize, Wegmans, Wakefern, Safeway Eastern, Market Basket and other independent retailers. The Account Executive will report to the Head of Sales for Gourmet Garden North America.<br><br>With more than $4 billion in annual sales, the Company manufactures markets and distributes spices, seasoning mixes, condiments and other flavorful products to the entire food industry – retail outlets, food manufacturers and foodservice businesses. We create differentiating flavors consumers prefer with unmatched quality, science, innovation and service. Every day, no matter where or what you eat, you can enjoy food flavored by McCormick. McCormick makes every moment and meal better™<br><br>As a company recognized for exceptional commitment to employees, McCormick offers a wide variety of benefits, programs and services. Benefits include, but are not limited to, tuition assistance, medical, dental, vision, disability, group life insurance, 401(k), profit sharing, paid holidays and vacations.<br><br>POSITION OVERVIEW<br><br>This Retail Account Executive is responsible for the achievement of customer volume objectives, budgets and planning. Execution of Retail controllables and customer collaboration are key responsibilities to the success of this position.<br><br>RESPONSIBILITIES<br><br>Developing and delivering customer plans to achieve volume objectives and primary and day-to-day selling interface at customer HQ.<br>Manage direct and indirect account sales of Gourmet Garden product offerings, category performance reviews, forecast &amp; distribution for existing brands and new products.<br>Manage a team of dedicated part-time merchandisers exclusively representing the Gourmet Garden brand at store-level.<br>Partner with our produce broker network to execute business plans and optimize retail execution.<br>Represents the brand at selected regional and national produce trade shows.<br><br>REQUIRED QUALIFICATIONS<br><br>Bachelor’s Degree in Business, Marketing, Management or related field.<br>Minimum 4 years Sales, Marketing or related experience with a minimum of 2 years’ experience successfully managing customer base.<br>Proficient in the Microsoft Excel, PowerPoint, Outlook, Office365.<br>Excellent verbal and written communication, negotiating and influencing, teamwork and relationship, computer and analytical skills.<br>Ability to analyze, interpret and leverage syndicated and internal sales data.<br>Understanding of the Produce/CPG industry sector and competitive landscape required.<br>Ability to travel, approximately 25% of the time.<br>Valid Driver License and clean driving record.<br><br>PREFERRED QUALIFICATIONS<br><br>Strong relationships within retail and wholesale fresh produce channels in the assigned region.<br>Experience in channels/segments outside of traditional grocery (i.e., Natural, E-Commerce, etc.).<br>Entrepreneurial approach as portion of customer portfolio will be targeting undersold or unsold accounts.<br><br>McCormick &amp; Company is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.<br><br>McCormick does not offer employment visa sponsorships upon hire or in the future. You must be lawfully authorized to commence work upon being offered employment.<br><span>McCormick</span><span> - </span><span>5 days ago</span></div><p><a href='https://www.indeed.com/rc/clk?jk=ac846b111a5666e8&amp;atk=' rel='nofollow'>View job</a></p><p><b>Other jobs you may like</b></p>    <p><a rel='nofollow'>Correspondent Account Executive</a><br>                US Bank - <span>Home Based</span><br>            <span>2 days ago</span></p>    <p><a rel='nofollow'>Enterprise Account Executive, Med/SLED - Northeast</a><br>                ServiceNow - <span>Remote</span><br>            <span>1 day ago</span></p>    <p><a rel='nofollow'>Account Executive - Mid-Market NJ</a><br>                FinancialForce.com - <span>Remote</span><br>            <span>2 days ago</span></p>    <p><a rel='nofollow'>New Search</a></p><p>View Indeed in: <span><b>Mobile</b> - </span><a rel='nofollow'>Classic</a></p>",
    "urlFetchPending": false,
    "published": "Jan 30, 2018 5:56:35 PM",
    "tags": [
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ]
  }
]
}
