{
 "items": [
  {
    "id": "dPnfQgctSVaxpujTHK7Mzg",
    "url": "https://jobspresso.co/job/akkroo-sales-remote-part-time-sales-development-representative-chicago/",
    "title": "Sales Development Representative (Chicago)",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Akkroo",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2018 3:27:42 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2> Sales Development Representative (Chicago)</h2><div>Sales<br></div><div>Anywhere in US<br></div><div>Company: Akkroo<br></div><div>ContractPart Time<br></div><h3>Overview</h3><p></p><strong>Note: This is a contract, part-time role that requires regular travel to Chicago, IL.</strong><p></p><strong>ABOUT AKKROO</strong><p>Here at Akkroo, we’re on a mission to help businesses think differently about exhibiting and the way they capture and process leads at B2B trade shows and events.</p><p>We’re at the forefront of a new, emerging category that bridges the big gap between exhibiting at events and the organisation’s existing Sales and Marketing processes.</p><p>We’re based in London, UK, however have a large and growing customer base in the US and in line with our recent Series A funding are now hiring for Sales Development Representatives in key US locations, including Chicago.</p><p>Sales Development Representatives play an incredibly important role in Akkroo, helping us to proactively qualify buying interest, understand size and shape of potential accounts and line them up for further conversations and demos with the Account Executive team.</p><p></p><strong>ABOUT THE ROLE&nbsp;</strong><p>This role is all about helping us to generate well qualified sales leads in the US.</p><p>The role will involve a mixture of:</p><ul></ul><li>visiting local B2B trade shows, exhibitions and events, mostly at McCormick Place Exhibition Centre, to open conversations with great-fit customers</li><li>prospecting into target accounts, utilizing a modern suite of outbound sales tools, campaigns and social outreach</li><li>handling inbound enquiries received via the Akkroo.com website outside of UK working hours to qualify those leads and transition into the sales pipeline</li><p>You’ll be part of our larger, UK-based Sales team with a focus on identifying and qualifying great-fit customers which are then passed over to our Account Executive team for demo and closing</p><p>You’ll also work alongside our Marketing team to identify sectors, organizations and events to target</p><p>This is a part time, remote and flexible contract position – the exact number of hours each week may vary, but we’re anticipating around 30 hours.</p><p></p><strong>ABOUT YOU</strong><ul></ul><li>You have previous B2B sales experience, either as an Account Executive or SDR role, ideally within a Software-as-a-Service (SaaS) organization</li><li>You love speaking to new people and are just as comfortable face-to-face as you are on the phone, via email or live chat through our website</li><li>You’re willing and able to travel to events (occasionally at weekends) to meet new prospects</li><li>As this is a remote role, you’re able to do great work independently and love the challenge of solving problems, proactively tackling challenges and when you don’t know something, you embrace the chance to grow and get better</li><li>You’re setup to work remotely, with a suitable working environment and able to invoice us on a bi-weekly basis for your hours worked as a contractor</li><p></p><strong>WHAT WE’RE OFFERING</strong><p>This is a fantastic opportunity to join a successful European scale-up as one of our early teammates on the ground in the US</p><p>We’re paying competitive salary, based on an hourly rate for a fixed number of hours. On top of this, you’ll receive a commission scheme based on generating Sales Qualified Leads</p><p>You’ll be provided with all the tools you need to successfully do the job, including a MacBook and access to a suite of software that we use, including Slack, LinkedIn Sales Navigator, SalesLoft and Hubspot CRM</p><div> <div><div><p>To apply for this job please visit the following URL: <a href='http://akkroo.recruiterbox.com/jobs/fk01l8a?apply=true' rel='nofollow'>http://akkroo.recruiterbox.com/jobs/fk01l8a?apply=true →</a></p></div></div></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "kAb_bLSJQFiZzCRUDKs-qg",
    "url": "https://weworkremotely.com/remote-jobs/qwilr-account-executive-north-america",
    "title": "Qwilr: Account Executive - North America",
    "tags": [
      "DBG:surround``OR(pacif, pst, pdt, western, california, losangel, sanfrancisco, paloalto, sanmateo) 2W hour",
      "DBG:surround``OR(work,countri,locat,contract,base,you W can) 2W anywher",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/16",
      "DBG_TECH1:k/t/w:embed/embedded/2",
      "DBG_TECH1:k/t/w:express/nodejs/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=8, bigdata-ml=16, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=2, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/America/West"
    ],
    "tagsNames1": [
      "US Pacific time zone"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Qwilr",
      "sameAs": "http://jobs.qwilr.com/o/account-executive-north-america"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 29, 2018 10:28:10 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Account Executive - North America</h2><span>Company: Qwilr<br></span><span>Headquarters: Sydney, Australia<br></span><span>http://jobs.qwilr.com/o/account-executive-north-america<br><br></span>  <div>    <div>We're looking for an experienced Account Executive based out of the North America to join our growing global sales team.&nbsp;<br></div><div></div><div></div><div></div><div></div><div><br></div><div>At Qwilr, our sales team serves as a trusted advisor for prospects and customers - listening to their needs, clearly explaining what Qwilr is (and isn't), and leading our initial training and onboarding efforts to make sure everyone is successful for the long term.&nbsp;</div><div><br></div><div><em>Note: While you can be located anywhere in North America, you will need to be comfortable working Pacific coast hours so that you can overlap with the team in Sydney.&nbsp;</em></div><div><br></div><div><span><a href='https://team.qwilr.com/Qwilr-Account-Executive-Sales-Team-North-America-Lh143t6TSVq4' rel='nofollow'>To see this page as a beautiful Qwilr, and get more details, here</a>.</span></div><div><br></div><div><h4>Requirements</h4></div><div><strong>You have 2+ years of successful selling to SMBs</strong>, and have experience working on deals similar in size&nbsp;(1k to 10k ACV) and volume to the ones you’d be working on at Qwilr.&nbsp;</div><div><br></div><div><strong>You have worked for an excellent SaaS Sales company.</strong>&nbsp;This could be a startup or a big player like Salesforce or HubSpot, but we're looking for someone who has experienced an excellent sales culture.&nbsp;</div><div><br></div><div><strong>You are excellent at inbound - but you're not afraid of occasional outbound.</strong>&nbsp;We get thousands of inbound leads per month - but there are times that outbound makes sense.&nbsp;</div><div><br></div><div><strong>You know your way around a modern CRM.</strong>&nbsp;You will need this for your day-to-day, as well as for helping our clients as we embed deeply into CRMs like Salesforce &amp; HubSpot.&nbsp;</div><div><strong></strong></div><div><br></div><div><strong>You are in sales because you love helping people win.</strong>&nbsp;It energises you to work alongside people to improve their business.&nbsp;</div><div><br></div><div><strong>You are naturally curious and have a history of learning new things quickly</strong>. At Qwilr, our product is always evolving, as is our market. Things will change - you need to be comfortable adapting to that change.&nbsp;</div><div><br></div><div><strong>You excel at managing yourself like a successful business.&nbsp;</strong>You are&nbsp;highly organised, you set and achieve goals with regularity, you create a great customer experience, and you make your teammates better.&nbsp;</div><div><br></div><div><strong>Above all, you’re an entrepreneur</strong>&nbsp;and are excited by the prospect of building your business and hitting your quarterly and annual goals.&nbsp;</div><div><br></div><div><h3><b>The Simple Benefits&nbsp;</b></h3></div><div><b>Competitive Salary &amp; Comp&nbsp;</b>- with uncapped commissions.&nbsp;</div><div><b>Equity</b>&nbsp;- Everyone at Qwilr owns a meaningful stake in our success.&nbsp;</div><div><b>Paid parental leave</b>&nbsp;- 12 weeks for primary caretaker and 4 weeks for secondary caretaker.&nbsp;</div><div><b>Company Retreats</b>&nbsp;- Every year we get together to meet and work in person in an amazing location somewhere in the Pacific (typically near a beach).&nbsp;</div><div><b>Complete transparency</b>&nbsp;- Everyone has access to business metrics and financial information about the company.&nbsp;</div><div><b>Further Education support</b>&nbsp;- We'll cover all courses below $1000 and split the ones above with you 50/50. We'll happily buy you any business books you'd like to read - even if they're outside of your role.&nbsp;</div><div><br></div><div><h3><strong></strong></h3><h3><b>The Real Benefits</b></h3></div><div><h3><strong>Impact</strong></h3></div><div>Every member of Qwilr is actively encouraged to input and contribute to the direction of the product and the company. We actually have a formal process around The Big Questions at Qwilr called&nbsp;<a href='https://pages.qwilr.com/ZVvDa2bdRtmm' rel='nofollow'>“Group Think”</a>. Ideas can come from any quarter and shape our whole trajectory.&nbsp;</div><div><br></div><div><h3><b><span>Work with smart people who care about what they do</span></b></h3></div><div>We’ve got that list of impressive backgrounds we can reel off (Google, Microsoft, Campaign Monitor, McKinsey, Harvard etc) - but what you really need to know is this: Qwilr is fierce about finding the best people and providing them an environment to flourish. That means we’ve got a team of really smart people, who really care about, and take pride, in what they do.&nbsp;</div><div><br></div><div><h3><b>We have a high bar of excellence&nbsp;</b></h3></div><div>Our first&nbsp;<a href='https://pages.qwilr.com/gTndRdDyT7mY' rel='nofollow'>principle as a company</a>&nbsp;is “Undeniable Bestness”. We believe in winning our race by being the best, not throughs hacks, bandaids and shortcuts. This means we have a high bar of excellence at the company. We go back to the drawing board when things aren't right, because we care deeply about the quality of what we produce.</div><div><br></div><div><span></span></div><div><br></div><div><span></span></div><div><br></div><div><h3><strong>Our Process</strong>&nbsp;- What To Expect.</h3></div><div><br></div><ul><li><b>Tell Us Something About Yourself:</b>&nbsp;Together with your CV, send in a Qwilr Page telling us who you are, why you think you would be great for the role, and what your favourite sale was.&nbsp;<br></li><li><b>Chat with our Talent &amp; Culture Lead:</b>&nbsp;If your Qwilr Page resonates with us, we'll set up a get-to-know-you chat with Elisa.&nbsp;<br></li><li><b>Chat with a Founder:</b>&nbsp;If you look like a good fit you'll chat with Mark, the Founder who leads our Sales team.&nbsp;<br></li><li><b>Pitch us Qwilr:&nbsp;&nbsp;</b>We find that there is no better way to find out if someone will be good for the job than to have them do the job&nbsp;in a simulated environment. We do this in some capacity for all hires across Qwilr.&nbsp;This task will mirror what it’s like working with our prospects in a sales call.&nbsp;<br></li><li><b>Chat with the sales team:</b>&nbsp;As things progress you’ll chat with two or three of our Sales &amp; Success team. This will be an opportunity for you to get to know us at a human level, and for us to get to know you.&nbsp;<br></li></ul><div></div><div><br></div><div><span></span></div><div><br></div><div><h3><strong>Why Qwilr?</strong></h3></div><div><strong><br></strong></div><div>Qwilr makes it easy for people to express themselves using the web.&nbsp;</div><div><br></div><div>We have thousands of customers from over 50 countries, we have an excellent product, our team is doubling in size every year (and our revenue is growing even faster), we are backed by some of the best SaaS investors on the planet, and we are growing like crazy.&nbsp;</div><div><br></div><div>Now is the time to join.</div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>To Apply head to: <a href='http://jobs.qwilr.com/o/account-executive-north-america' rel='nofollow'>http://jobs.qwilr.com/o/account-executive-north-america</a> And submit a CV as well as a Qwilr Page telling us A) Who you are and why you think you would be great for this role, and B) What your favourite / best sale was. We want to know the details, why it mattered to you, how you did a great job and anything else that you think is relevant / impressive. </p>  </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "EMkpcsocR2i5q2CKEK9R9A",
    "url": "http://workinstartups.com/job-board/job/72457/book-keeperjunior-accountant-wanted-at-pronto-eat/",
    "title": "Book Keeper/Junior Accountant WANTED",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``can 2W remot",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "50% remote",
      "European time zones"
    ],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Pronto Eat",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 28, 2018 8:35:08 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Book Keeper/Junior Accountant Internship <br />No. of Vacancy: 2<br /><br /><br />Key tasks:<br /><br />-General accounting work<br />-Purchase and sales ledger control<br />-Reconcile invoices received with orders and statement and prepare for payment<br />-Process payment of invoices<br />-Make payment runs using BACS and Chaps<br />-Post general, debtor and creditor journals<br />-Reconcile supplier statements<br />-Process sales and purchase invoices on a weekly basis<br />-Prepare Management Accounts<br />-Quarterly VAT returns<br />-Payroll <br /><br />Candidate profile:<br /><br />-Must be studying AAT/AAC or qualified already at Level 3 above <br />-Good knowledge of Xero web based accounting <br />-Demonstrate a successful track record<br />-Results driven, systematic and logical<br />-Strategic, consistent and disciplined approach to work methodology<br />-Challenge the status quo in order to create continuous improvement<br />-Brings a sense of urgency to situations and manages them through to achieve goals<br />-PC literate, including office products and bespoke database solutions<br />-Ability to take on general tasks within the company necessary for it’s business requirements and well-being<br />-Have a good understanding of basic tax UK tax laws and regulations <br /><br />We are looking for candidates who can work remotely and in our office based in London (E1 & E14)<br /><br />Please attach CV and cover letter<br />",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "M6LYnusOT6-f-R-mt14B7A",
    "url": "https://remote.co/job/social-media-manager-3/",
    "title": "Social Media Manager",
    "tags": [
      "DBG:surround``2W( OR(100,fulli,entir), remot)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "PayBear",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "$",
      "minValue": 58000,
      "maxValue": 90000,
      "info": "",
      "unit": "YEAR",
      "parser": "SalaryParserLargeText",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 28, 2018 5:46:14 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Social Media Manager at <span>PayBear</span></h2><div><span><i></i> Remote</span>         | <span> Freelance </span> | <span> International </span></div><div>            <p><strong>Remote </strong></p><p><strong>Contract</strong></p><div><strong>Skills</strong><br>Social Media, Social Media Marketing<br><strong>Compensation</strong><br>$58K – $90K<br>No Equity<br><strong>Visa Sponsorship</strong><br>Not available</div><p>We’re a small, distributed startup in a competitive space trying to do the impossible. We’re creating a payment platform for ecommerce &amp; SaaS merchants to easily accept cryptocurrencies. We’ve already built a product that’s way ahead of the competition, but now we need key talent to scale.</p><p><strong>Job Description</strong></p><p>Paybear is a cutting-edge cryptocurrency platform working towards the creation of a global toolkit for crypto-based financial products. With the initial version of our payment gateway already up and running, we’re currently focused on incorporating new products into our growing ecosystem.</p><p>Now, we’re on the hunt for a Social Media Manager to take control of our voice and build a community that’s as excited about the future of crypto as we are. You’ll be leading our social media strategy, curating our brand presence and driving engagement with passionate crypto fans across the globe.</p><p><strong>Responsibilities</strong></p><ul><li>Research and analyze leading trends, communication methods and audience preferences.</li><li>Design and implement an effective social media strategy to enhance business objectives.</li><li>Set specific, measurable objectives and report on ROI.</li><li>Create, edit, publish and share engaging content on a daily basis (e.g. original text, photos, videos and news).</li><li>Monitor SEO and web traffic metrics.</li><li>Collaborate with other teams, including marketing, sales and customer service, to ensure brand consistency and create engaging, shareable stories.</li><li>Engage regularly with the community and monitor customer reviews.</li><li>Supervise the creation of design assets, including Facebook cover images, profile pictures, banners and so on.</li><li>Create and implement new features and campaigns to cultivate brand awareness, such as promotions, competitions and other engagement initiatives.</li><li>Passionately follow current tech and trends in social media, design tools and applications.</li></ul><p><strong>Requirements</strong></p><ul><li>Fluent English, both spoken and written.</li><li>3+ years’ proven experience in social media management.</li><li>Strong analytical and problem-solving skills.</li><li>Hands-on experience in content management.</li><li>Ability to conceptualize and deliver creative content (text, image and video).</li><li>Knack for distilling complex social media data into easily-digestible takeaways.</li><li>A natural multi-tasker able to handle a variety of ongoing projects.</li><li>Deep knowledge of Facebook’s advertising platform is a must.</li><li>Knowledge of various online marketing channels.</li><li>Willingness to learn new channels and platforms relevant to crypto and ICO communities.</li></ul><p><strong>Terms of employment</strong></p><ul><li><strong>Full-time</strong>: 40 hours/week.</li><li>From $30 USD/hr.</li></ul><p><strong>Our advantages</strong></p><ul><li><strong>No corporate drudgery: Work when you want, how you want, and where you want. Our international team is fully remote.</strong></li><li>Absolute freedom: Our lean approach will give you the independence needed to solve challenges your way. We’re dedicated to the startup spirit.</li><li>Cutting-edge tech: Gain priceless, hands-on experience with crypto currencies and other leading technologies.</li><li>Friendly English-speaking team: Forge meaningful relationships with colleagues around the world.</li></ul>        </div><div>        <a href='https://angel.co/paybear/jobs/416615-social-media-manager' rel='nofollow'>Apply for job</a>    </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "EL_YynX0S_OsS8hGO7bCBQ",
    "url": "https://angel.co/fitpass-2/jobs/128041-associate-partner-management",
    "title": "Associate, Partner Management",
    "tags": [
      "Business Development",
      "Communication Skills",
      "DBG:surround``fulltim 4N remot",
      "Delhi",
      "Full Time",
      "MS Office",
      "Noida",
      "REMOTE1/100",
      "Remote OK",
      "Sales Strategy and Management",
      "Sales and Marketing",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "FITPASS",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=989137&listings[0][]=128041&listings[0][]=130303"
    },
    "salary": {
      "currency": "Rs",
      "minValue": 240000,
      "maxValue": 360000,
      "info": "No Equity",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 27, 2018 6:50:06 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Associate, Partner Management at FITPASS</h2><div>Delhi, Noida, Remote · Full Time</div></div><div><div>Skills</div><div>Business Development, Sales Strategy and Management, MS Office, Sales and Marketing, Communication Skills</div><div>Compensation</div><div>₹240K–₹360K<br>No Equity</div></div><h3>Job Description</h3><div><p>Job Responsibilities:</p><p>-Identifying key players in the industry through extensive market research and converting them into fitpass partners</p><p>-Imparting necessary training to partnered fitness studios to help them use the CRM system to their maximum advantage</p><p>-Connecting with partnered fitness studios and conducting meetings regularly to maintain long-term relationships and address their concerns</p><p>-Working closely with the Product and Technology team to improve services basis feedback received</p><p>-Working closely with the Branding and Marketing team to increase customer engagement with the brand and with the product</p><p>-Developing strategies for the expansion of FITPASS pan India </p><p>Prerequisites:<br>-Bachelor's degree in any field<br>-0-2 years of work experience in a client facing role<br>-Excellent oral/written communication and negotiation skills<br>-Enthusiastic and self-motivated individuals with the drive to achieve targets<br>-Comfortable traveling within the city<br>-Excellent organizational and time management skills<br>-Sufficient knowledge of MS Office (Excel/Word)</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "BdcQpaG-TjugU-_c4Pxi7g",
    "url": "https://weworkremotely.com/remote-jobs/aha-media-group-director-of-business-management",
    "title": "Aha Media Group: Director of Business Management",
    "tags": [
      "DBG:surround``2N(remot, posit)",
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:spring/java/24",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=24, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/java",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "Aha Media Group",
      "sameAs": "https://ahamediagroup.com/"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 27, 2018 6:29:28 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Director of Business Management</h2><span>Company: Aha Media Group<br></span><span>Headquarters: Silver Spring, MD<br></span><span>https://ahamediagroup.com/<br><br></span>  <div>    <div><span>Directorof Business Management will lead operations, finance and technology for afast-growing company. This person will report to the President, be a part ofthe Executive leadership team, and manage the Bookkeeper and Systems Manager. </span></div><div><br></div><div></div><div><span>Whilethis is a primarily remote position, you must live within the Washington D.C. metropolitanarea to travel to company headquarters in Silver Spring, MD up to 2 times perweek. Commuting expenses will not be reimbursed.</span></div><div><br></div><div></div><div><span>Theideal candidate</span><span> willdemonstrate the ability to:<br></span></div><div></div><div></div><div></div><div></div><div></div><div></div><div><span>·<span>&nbsp;</span></span>Forecast business needs and adjust businessoperations to respond to needs</div><div></div><div><span>·<span>&nbsp;</span></span>Take an “outside-the-box” approach toproblem-solving</div><div></div><div><span>·<span>&nbsp;</span></span>Communicate business performance, stats andpriorities to the President and provide&nbsp;</div><div>&nbsp; analysis and plausible solutions<br></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div></div><div><span>You willhave a bachelor’s degree in accounting, finance or related field and alsobe expected to travel to in-person team meetings approximately 2-4 times peryear.</span></div><div><br></div><div></div><div><b><span>Responsibilities</span></b><span><br></span></div><div></div><div></div><div></div><div></div><div></div><div></div><ul><li><b><span>Financial operations,</span></b><span> including accounts receivables, accounts payable, budget,     financial reporting and analysis, and payroll processing in multiple     states</span></li><li><b><span>Business operations, </span></b><span>including contracts and vendor paperwork, project compliance,     insurances, SIMPLE IRA and business registrations</span></li><li><b><span>Information technology and business systems</span></b><span>, including Salesforce, email client     management, web-hosting and domain registrations, project management     software, and other office systems</span></li><li><b><span>Pricing analysis and financial forecasting,</span></b><span> including implementing processes     and systems to achieve profit targets as well as support sales strategies</span></li></ul><div></div><div><b><span><br></span></b></div><div><b><span>You Have</span></b></div><div></div><ul><li><span>7-10 years of accounting or finance experience ideally in a     small business environment</span></li><li><span>Bachelor’s degree in accounting, finance or related field</span></li><li><span>Proven experience managing junior team members</span></li><li><span>Expertise in QuickBooks and Excel</span></li><li><span>Proficiency in Salesforce and ability to quickly learn other     business software as needed</span></li><li><span>Excellent organizational skills; this role involves a lot of     moving pieces</span></li><li><span>Knowledge that the devil is in the     details</span><span>—no i     goes undotted, no t goes uncrossed</span></li><li><span>Excellent communication skills, this role involves     communication with clients and internal team members</span></li><li><span>A scrappy, can-do attitude with a willingness     to try new ways of thinking and working</span></li><li><span>Proven ability to manage confidential information<b></b></span></li><li><span>Ability to work from 9-5, Monday through Friday</span></li><li><span>Ability to travel to onsite meetings at least twice a week in     Silver Spring, MD </span></li><li><span>Proven ability to successfully work from home</span></li></ul><div><span><br></span></div><div><span>Aha Media is a fast-pacedatmosphere. If these align with your values, you should apply:</span><span><br></span></div><div></div><div></div><div></div><div></div><div></div><div></div><div><span>·<span>&nbsp;&nbsp;</span></span><b>Above and beyond, no matter what,every single time: </b>We hire exceptional people&nbsp;</div><div>&nbsp; &nbsp;and expect them todeliver their very best—every time.<b><br></b></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div></div><div><span>·<span>&nbsp;&nbsp;</span></span><b>Meaningful work, meaningful life: </b>We put inthe time we need to get the job done&nbsp;</div><div>&nbsp; &nbsp;in the best way possible, and then we go home to the people and hobbies we love.</div><div></div><div></div><div></div><div></div><div><br></div><div></div><div><span>·<span>&nbsp;&nbsp;</span></span><b>Be impeccable with your words andyour intentions: </b>We are respectful and direct&nbsp;</div><div>&nbsp; &nbsp;communicators whosay the things we mean and mean the things we say.<b><br></b></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div></div><div><span>·<span>&nbsp;&nbsp;</span></span><b>Stay curious longer: </b>Weapproach every challenge with a fresh perspective and&nbsp;</div><div>&nbsp; &nbsp;explore new approachesand solutions.<b><br></b></div><div></div><div></div><div></div><div></div><div></div><div><br></div><div></div><div><span>·<span>&nbsp;&nbsp;</span></span><b>Always be learning:</b> We focuson continuous learning and self-improvement.<b><br></b></div><div></div><div></div><div></div><div></div><div></div><div><br></div>  </div>  <div>    <h4>Apply for this position</h4>    <p>If you are interested, please submit:•    Resume•    Cover letter (include where you found the job posting, the city &amp; state you live in, your educational         background and # of years accounting, finance or related experience)•    Please include a P.S. with the number 6 in your cover letter and send your application to <a href='mailto:careers@ahamediagroup.com' rel='nofollow'>careers@ahamediagroup.com</a></p>  </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "bHO-0BARTC2aluHAOgV7Fw",
    "url": "https://stackoverflow.com/jobs/196137/backend-developer-for-our-roiback-business-the-hotelbeds-group?a=13MfEJRN6EbS",
    "title": "Backend Developer (for our ROIBACK business) at The Hotelbeds Group (Palma, Spain) ",
    "tags": [
      "DBG:surround``3N(locat,remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W OR(germani, unitedkingdom, austria, croatia, hrvatska, denmark, franc, ireland, netherland, spain, sweden, switzerland)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:k/t/w:html5/frontend/10",
      "DBG_TECH1:k/t/w:javascript/frontend/2",
      "DBG_TECH1:k/t/w:javascript/nodejs/2",
      "DBG_TECH1:k/t/w:python/python/4",
      "DBG_TECH1:techWeightMap:{python=4, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=2, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=12}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TITLE1/sales",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "The Hotelbeds Group",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 7:56:26 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2><span>Backend Developer (for our ROIBACK business)</span>                </h2>                    <h3>About this job</h3>                    <div>                            <div>                                    <div>                                        <span>Job type: </span>                                        <span>Full-time</span>                                    </div>                                    <div>                                        <span>Experience level: </span>                                        <span>Mid-Level</span>                                    </div>                                    <div>                                        <span>Role: </span>                                        <span>Backend Developer</span>                                    </div>                            </div>                            <div>                                    <div>                                        <span>Industry: </span>                                        <span>B2B, Information Technology, Travel &amp; Tourism</span>                                    </div>                                    <div>                                        <span>Company size: </span>                                        <span>5k-10k people</span>                                    </div>                                    <div>                                        <span>Company type: </span>                                        <span>Private</span>                                    </div>                            </div>                    </div>                <div>Company: The Hotelbeds Group | Palma, Spain<br></div>                    <h3>Remote details</h3>                    <div>                        <div>                                                                                        <div>                                    <span>Office Location:</span>                                    <span>Palma, Spain.</span>                                        <span>Employees can also work full time from this office.</span>                                </div>                                                                                        <div>                                    <span>Relocation Assistance:</span>                                    <span>Yes</span>                                </div>                        </div>                    </div>                <h3>Technologies</h3><div></div><div>javascript</div><div>python</div><div>sql</div><div>html5</div><div>linux</div>                <h3>Job description</h3>                <div><p>KEY RESPONSIBILITIES.</p><p><br><strong>How can you help us?</strong></p><p>We are seeking for top programmers and software architects to be part of our technology team.</p><p>As a software developer:</p><p><br>• As part of our booking engine team, implementing user stories with high business value using good techniques and practices.<br>• Helping the Product Ower in clarifying, prioritizing and estimating the user stories.<br>• Designing technical solutions and developing clear, testesable and efficient code, performing peer reviews with your collegueas.<br>• Ensuring continuous integration and build is in place.<br>• Collaborating with architects and other developers to produce just enough design and just enough technical documentation.<br>• Writing technical user stories for refactoring the existing code or implementing new technical features.<br><br>As a software architect:</p><p><br>• Doing some up front architecture envisioning to get started the developments in the right direction, collaboratively working with the team.<br>• Facilitating the architectural modeling and evolution efforts of our technological platform.<br>• Understanding of the business domain and communicating the architecture to developers and to other project stakeholders.<br>• Practising code review, pair programming and other agile techniques to improve the development team programming skills.<br>• Transitioning architectural skills to other team members<br><br>What can we offer you?</p><p><br>• To participate in very challenging projects with the top hotel chains from Europe, Asia and America, from the idea to the delivery.<br>• To work in a Company that invests (really invests) in technology.<br>• To be part of an Agile culture to obtain the best results in software development and to become a high-performance team, in a really happy environment.<br>• Work together with extremely passionate programmers, and being part of a top programmer community.<br>• To be part of a team-making decisions, to determine the technical roadmap of our platforms.<br>• To lead both business and technical projects from end-to-end.<br>• To live in the best city of the World<br><br>(<a href='http://www.thesundaytimes.co.uk/sto/style/homes_and_gardens/best_places/article1533629.ece' rel='nofollow'>http://www.thesundaytimes.co.uk/sto/style/homes_and_gardens/best_places/article1533629.ece</a>)<br><br><strong>CANDIDATE PROFILE.</strong><br><br>• It is a must to hold a University degree in Engineering or Computing Sciences, or having completed at least 80%.<br>• &nbsp;If you know Python or Go ... excellent! But what we are really looking for is a top programmer who loves technology and software development, and ready to learn any programming language that could be required.<br>• You have to feel comfortable working with databases (SQL and NoSQL), web programming (HTML5, CSS3, Javascript) and Linux environments.<br>• Good programming best-practices, such continuous integration, unit testing generation, code repositories, log management, code comments and documentation ...<br>• You will need to meet with the business to understand the needs and to translate them into code.<br>• You will be part of an agile team, so, what is really important in Roiback is the team success, not the individual success.<br>• It is not a must to have a lot of experience. For us, what is really important is the potential and attitude you have to become a great programmer</p>                </div>            <div>        <a href='https://stackoverflow.com/jobs/apply/196137?reset=False&amp;ra=13MfEJRN6EbS&amp;oqs=a%3D13MfEJRN6EbS' rel='nofollow'>Apply now</a></div><div>                                                                                                                                                            </div>            <h3>About The Hotelbeds Group</h3>            <div><p><strong>Roiback.com</strong></p><p><strong>About us</strong></p><p>We specialise in the development and management of online projects for hotel chains and independent hotels. We not only have a knack for all things digital, but we also have a knack for people. We know that the closer we are to you, the better and more adapted solutions we'll provide to your business. We have over 15 years experience in the industry, which has allowed us to develop a team of professionals who exceed in their fields. WHAT WE DO: We work with our partners to get to the nitty gritty of their business. This allows us to design custom-made solutions that deliver tangible results and provide a real answer to market demand. Our passion allows us to never stop improving our service and product offering, day in, day out. • Integrated Marketing Online Management. We help you build your brand differentiation in today’s crowded digital space. We have a flair for everything online and a real passion for the hospitality industry. Our method is quite simple: we first analyse your needs and then define action plans that make sense for you. We bring you a fresh approach to help you get the most out of your marketing spend, finding cost-effective ways to drive more traffic, and more bookings, to your website. • Web Design &amp; Development. Our websites are specifically created for with the hotelier in mind. Designed to work on any device, strikingly beautiful and with a slick user experience. We are passionate about building websites that will engage visitors and drive conversions, taking direct channel sales to a new level. • Booking Engine for Hotels // BACKHOTEL 4.5 We specialise in creating technology that works for hoteliers. Our booking engine brings together beautiful design and seamless user experience to capture and convert your web traffic into bookings for your direct channel. • Technology We have direct integrations with the industry’s main Channel Managers and Property Management Systems to simplify the way you manage your direct channel.</p><p><strong>Company details</strong></p><p><strong>Website</strong></p><p><a href='http://www.roiback.com' rel='nofollow'>http://www.roiback.com</a></p><p><strong>Headquarters</strong></p><p>Palma de Mallorca, Islas Baleares</p><p><strong>Year founded</strong></p><p>2010</p><p><strong>Company type</strong></p><p>Privately Held</p><p><strong>Company size</strong></p><p>51-200 employees</p><p><strong>Specialties</strong></p><p>booking engine, web development, digital marketing, travel, tourism, web design, technology, and hotels</p>            </div>                            <h3>Benefits</h3>                    <ul>                            <li>                                <span></span>                                <span>Pretty sure</span>                            </li>                            <li>                                <span></span>                                <span>You prefer</span>                            </li>                            <li>                                <span></span>                                <span>To join our team</span>                            </li>                            <li>                                <span></span>                                <span>And enjoy all</span>                            </li>                            <li>                                <span></span>                                <span>We can offer</span>                            </li>                            <li>                                <span></span>                                <span>Than read it here</span>                            </li>                    </ul>                ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "n3wHZJMvTVyeYHpkWqAbfQ",
    "url": "https://angel.co/blacksmith-agency/jobs/119215-sales-development-rep-remote",
    "title": "Sales Development Rep - Remote",
    "tags": [
      "BD Manager",
      "Business Development",
      "Cold Calling",
      "DBG:surround``OR(home,remot,telecommut) 3W OR(meet, face, person)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:less/frontend/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=5}",
      "Earth",
      "Email Marketing",
      "Full Time",
      "Phoenix",
      "Prospecting and Cold Calling",
      "REMOTE1/50",
      "Remote OK",
      "Sales",
      "Sales and Marketing",
      "Salesforce",
      "TECH1/frontend",
      "TITLE1/sales",
      "TZ/unknown",
      "Toronto"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "Blacksmith Agency",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=718115&listings[0][]=119215"
    },
    "salary": {
      "currency": "$",
      "minValue": 40000,
      "maxValue": 80000,
      "info": "No Equity",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 6:15:37 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Sales Development Rep - Remote at Blacksmith Agency</h2><div>Earth, Phoenix, Toronto, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Sales, Email Marketing, Sales and Marketing, Cold Calling, Salesforce, Prospecting and Cold Calling</div><div>Compensation</div><div>$40K–$80K<br>No Equity</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Blacksmith is hiring for a remote sales position.</p><p>Top Reasons to Apply:</p><p>Remote: Work from home. Less meetings/company politics &amp; more autonomy and closing deals<br>Big clients – We have worked with clients such as Google &amp; GE.<br>Great Product/Service – Here is our work: <a href='http://blacksmith.agency' rel='nofollow'>http://blacksmith.agency</a><br>Innovative Sales Process – View this video: <a href='https://dropbox.com/s/qaesr5voutok4su/process.mov?dl=0' rel='nofollow'>https://dropbox.com/s/qaesr5voutok4su/process.mov?dl=0</a><br>Great Pay!<br>Growth: Get in early and catapult your sales career. Unlimited promotion opps.<br>Job offer in 24-48 hours – for the right candidate<br>PLEASE DO NOT APPLY UNLESS YOU ARE QUALIFIED (see below)</p><p>Proven Quota Crusher: 200%, 150%, 100% Quota attainment<br>Experience – you have sold to director, vp, or c-level before<br>Drive – you are a bonafide hustler who never quits<br>We will ask you to prove your sales success via:</p><p>CRM screenshots – proprietary or company information may be “blacked”out<br>Management References<br>Sales Award certificates<br>Guaranteed interview if you send documentation to <a href='mailto:info@blacksmith.agency' rel='nofollow'>info@blacksmith.agency</a> following your application.<br>Why this position will change your life:</p><p>We would argue that this position is the most important position we will ever have. If you are looking to catapult your sales career, this is the place.<br>You will work directly with the owner of the company to drive sales qualified leads into the pipeline for the organization.<br>Our sales process is fine tuned and simply needs some raw sales talent to pull the lever.<br>The company owner &amp; developer’s supporting families will be counting on you.<br>Need to Have:</p><p>Truly a top sales rep within their company – documentation required prior to offer<br>Successful B2B experience talking to Directors, VPs, &amp; C-level<br>(marketing dept even better)<br>Successful sales experience at obscure company or startup<br>SDR experience setting appointments<br>Hunter mentality<br>Relentless Cold Caller<br>Ability to detail their lead generation methods<br>Competitive nature<br>Goal oriented<br>Internally optimistic<br>Experience with solution based (PAIN) selling<br>Ability to be coached<br>If remote:</p><p>Self-starter &amp; ability to remove distractions<br>Nice to Have:<br>Experience selling digital or website knowledge<br>College Degree<br>Family oriented<br>Experience with 1-3 month sales cycle<br>Keywords: Business Development Representative, Business Development Representatives, Business Development Rep, BDR, Sales Development Representative, Sales Development Representatives, Sales Development Rep, SDR,</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "eD1KjfyRScCiIAWPzeiwHA",
    "url": "https://www.workingnomads.co/jobs/sales-development-representative-akkroo",
    "title": "Sales Development Representative",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Akkroo",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 24, 2018 3:20:55 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<p><strong>ABOUT US</strong></p><p>Here at Akkroo, we’re on a mission to help businesses think differently about exhibiting and the way they capture and process leads at B2B trade shows and events.</p><p>We’re at the forefront of a new, emerging category that bridges the big gap between exhibiting at events and the organisation’s existing Sales and Marketing processes.</p><p>We’re based in London, UK, however have a large and growing customer base in the US and in line with our recent Series A funding are now hiring for Sales Development Representatives in key US locations, including Chicago.</p><p>Sales Development Representatives play an incredibly important role in Akkroo, helping us to proactively qualify buying interest, understand size and shape of potential accounts and line them up for further conversations and demos with the Account Executive team.</p><p><strong>ABOUT THE ROLE&nbsp;</strong></p><ul><li>This role is all about helping us to generate well qualified sales leads in the US</li><li>The role will involve a mixture of:<ul><li>visiting local B2B trade shows, exhibitions and events, mostly at McCormick Place Exhibition Centre, to open conversations with great-fit customers</li><li>prospecting into target accounts, utilizing a modern suite of outbound sales tools, campaigns and social outreach</li><li>handling inbound enquiries received via the Akkroo.com website outside of UK working hours to qualify those leads and transition into the sales pipeline</li></ul></li><li>You’ll be part of our larger, UK-based Sales team with a focus on identifying and qualifying great-fit customers which are then passed over to our Account Executive team for demo and closing</li><li>You’ll also work alongside our Marketing team to identify sectors, organizations and events to target</li><li>This is a part time, remote and flexible contract position - the exact number of hours each week may vary, but we’re anticipating around 30 hours.&nbsp;</li></ul><p><strong>ABOUT YOU</strong></p><ul><li>You have previous B2B sales experience, either as an Account Executive or SDR role, ideally within a Software-as-a-Service (SaaS) organization</li><li>You love speaking to new people and are just as comfortable face-to-face as you are on the phone, via email or live chat through our website</li><li>You’re willing and able to travel to events (occasionally at weekends) to meet new prospects</li><li>As this is a remote role, you’re able to do great work independently and love the challenge of solving problems, proactively tackling challenges and when you don’t know something, you embrace the chance to grow and get better</li><li>You’re setup to work remotely, with a suitable working environment and able to invoice us on a <em>bi-weekly </em>basis for your hours worked as a contractor</li></ul><p><strong>WHAT WE’RE OFFERING</strong></p><ul><li>This is a fantastic opportunity to join a successful European scale-up as one of our early teammates on the ground in the US</li><li>We’re paying competitive salary, based on an hourly rate for a fixed number of hours. On top of this, you’ll receive a commission scheme based on generating Sales Qualified Leads</li><li>You’ll be provided with all the tools you need to successfully do the job, including a MacBook and access to a suite of software that we use, including Slack, LinkedIn Sales Navigator, SalesLoft and Hubspot CRM</li></ul><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "TiNeqJSwStuY-CA04LgRfg",
    "url": "https://weworkremotely.com/remote-jobs/emily-hirsh-inc-facebook-ads-manager-1",
    "title": "Emily Hirsh, Inc. : Facebook Ads Manager",
    "tags": [
      "DBG:surround``headquart 3N remot",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Emily Hirsh, Inc.",
      "sameAs": "https://emilyhirsh.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 23, 2018 8:47:46 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Facebook Ads Manager</h2><span>Company: Emily Hirsh, Inc.<br></span><span>Headquarters: Remote<br></span><span>https://emilyhirsh.com<br><br></span>  <div>    <div><span>Department: </span><span><span>    </span></span><span> Advertising Team</span><br></div><div></div><div><span>Reports to: </span><span><span>    </span></span><span>Senior Digital Strategist </span></div><div><br></div><div><span>Role </span><br></div><div></div><ul><li><span>Creating and managing client campaigns on a daily basis through a strategic lens, communicating with the client, sending weekly reports and supporting the client with strategic consultations as needed.</span><br><br></li></ul><div><b><br></b></div><div><span>Responsibilities </span><br></div><div></div><ul><li><span>Understanding the strategy of a specific campaign and client funnel</span><br><br></li><li><span>Tasking out different components of a campaign such as images and copy to the correct contractors</span><br><br></li><li><span>Loading or tasking the loading of campaigns/ads to the ads specialists</span><br><br></li><li><span>Reviewing, editing &amp; loading of ad assets as needed</span><br><br></li></ul><ul><li><span>Placing and verifying pixel to ensure proper campaign tracking</span><br><br></li></ul><ul><li><span>Daily optimization of campaigns to ensure the lowest possible cost per result and an overall positive ROI</span><br><br></li></ul><ul><li><span>Proactively create, execute, and optimize creative strategies to consistently drive high-quality leads, traffic &amp; visibility</span><br><br></li><li><span>Produce weekly reports for client account updates, recommendations and results</span><br><br></li><li><span>Follow-up with client communications, questions and concerns in a timely manner</span><br><br></li><li><span>Stay on top of new techniques, strategies and changes to test for better client results &amp; campaign successes</span><br><br></li></ul><ul><li><span>Communicating with clients about the success of the campaign, and offering suggestions for ways to improve</span><br><br></li></ul><ul><li><span>Schedule &amp; perform monthly client meetings &amp; consultations for account goals and strategic success of each client account</span><br><br></li><li><span>Participate in daily, monthly and quarterly team huddles to ensure agency team members are all meeting company goals &amp; responsibilities</span><br><br></li></ul><div><span>Results:</span></div><div><span>First 90 days: </span><span>Learn each assigned clients account and launch strategies with direction from the Director of Advertising to ensure proper execution of client goals and success. Master the “Hirsh Process” for proper client account management and ongoing optimization. Feel 100% confident by the end of the 90-day period that you can manage your accounts with minimal support and oversight needed from the Director of Advertising or the CEO. </span><br></div><div></div><div><b><br></b></div><div><span>After initial 90 days:</span><span> Ads Manager should be able to perform all client tasks, communications and strategy consulting with minimal direction from the Director of Advertising and moving to be a trusted main source of contact for strategy consultation for the client while reporting to the Director of Advertising for strategy updates, guidance &amp; insight. The ads manager will continue to learn and grow and bring innovative strategies to the Hirsh Agency and our clients. </span><br></div><div></div><div><b><br></b></div><div><span>Requirements </span><br></div><div></div><ul><li><span>2+ years of </span><span>online</span><span> marketing experience</span><br></li><li><span>Dedication to problem-solving and the ability to analyze results and make suggestions to the client based on their individual results</span><br></li><li><span>High attention to detail, </span><span>proofreading, writing and editing skills for accuracy</span></li><li><span>Mid - Expert level knowledge of Facebook advertising (minimum 1-2 years experience)</span><br></li><li><span>Quick learner who retains information easily</span><br></li><li><span>Knowledge of various 3rd party platforms such as ClickFunnels, MailChimp, etc</span><br></li><li><span>Ability to communicate effectively </span><br></li><li><span>Access to a high-speed internet connection</span><br></li><li><span>Good time management and organization skills as a remote worker</span><br></li><li><span>Ability to communicate with clients via email &amp; video meetings.</span><br></li><li><span>Understanding of Funnel Marketing strategies &amp; the psychology of advertising to the customer journey</span><br></li><li><span>Excellent verbal communication skills</span><br></li><li><span>Committed to ongoing education and training to stay on top of the Facebook platform, rules, regulations, strategies and updates for proper ad execution, implementation &amp; client success</span><br><br></li></ul><div><b><br></b></div><div><span>Details:</span><span>&nbsp;</span><br></div><div></div><ul><li><span>Paid training that leads to base and incentive compensation based on performance</span><br><br></li></ul>  </div>  <div>    <h4>Apply for this position</h4>    <p>Send your resume and cover letter to <a href='mailto:jobs@emilyhirsh.com' rel='nofollow'>jobs@emilyhirsh.com</a></p>  </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "1qZ8QcMVQ0WgfAfV-mnjvQ",
    "url": "https://angel.co/sentext-solutions/jobs/122653-account-executive",
    "title": "Account Executive",
    "tags": [
      "Business Development",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Sales and Marketing",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown",
      "United States"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "SenText Solutions",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=899417&listings[0][]=122653"
    },
    "salary": {
      "currency": "$",
      "minValue": 50000,
      "maxValue": 90000,
      "info": "No Equity",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 23, 2018 7:08:48 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Account Executive at SenText Solutions</h2><div>United States, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Sales and Marketing</div><div>Compensation</div><div>$50K–$90K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Responsible for showing 98% of companies that are NOT text marketing how they can.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "6DaiVz3bTMCiBpfjc4VDpQ",
    "url": "https://angel.co/softinway/jobs/63006-outside-senior-sale-rep",
    "title": "Outside Senior Sale REP",
    "tags": [
      "Aerospace",
      "DBG:surround``fulltim 4N remot",
      "Defense Technology",
      "Full Time",
      "Mechanical Engineering",
      "New York City",
      "Outside Sales",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "SoftInWay",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=508577&listings[0][]=63006"
    },
    "salary": {
      "currency": "$",
      "minValue": 200000,
      "maxValue": 280000,
      "info": "No Equity",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 23, 2018 6:59:45 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Outside Senior Sale REP at SoftInWay</h2><div>New York City, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Defense Technology, Mechanical Engineering, Outside Sales, Aerospace</div><div>Compensation</div><div>$200K–$280K<br>No Equity</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Looking for US based, Outside Sales Reps, with interest/contacts/experience in Oil &amp; Gas, Aerospace, Power Generation, Automotive, Government &amp; Defense Sectors.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "LV8c6YNDTjumKZk5TAKgFg",
    "url": "https://angel.co/trysome-inc/jobs/108747-marketing-and-business-development-assistant",
    "title": "Marketing and Business Development Assistant",
    "tags": [
      "Brooklyn",
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "Growth Hacker",
      "Internship",
      "Marketing",
      "REMOTE1/50",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "TrySome",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=874737&listings[0][]=108747"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "0.5% – 1.0%",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 23, 2018 6:13:41 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Marketing and Business Development Assistant at TrySome</h2><div>Brooklyn, Remote · Internship</div><div></div></div><div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>We are looking for a communicative rock star with a passion and willingness to make things happen. If you can't wait to write captivating copy, we can't wait to hear from you. </p><p>YOU:<br>We are looking for an intelligent creative person with excellent verbal and written communication skills to join our Marketing and Communications team. <br>An interest in organic, vegan and fair-trade products is definitely a plus, but don’t lie about it, it’s not more important than being real.</p><p>THE JOB:<br>You will have the opportunity to work on a variety of digital media and communications tasks including, but not limited to:</p><p>- Designing and implementing social media and email strategy to align with TrySome’s business goals<br>- Generate, edit and publish engaging social media content daily (e.g. original text, photos, videos and news) <br>- Conduct market research<br>- Send out email campaigns to our subscribers<br>- Monitor Google Analytics and web traffic metrics, adjusting social media and email campaigns accordingly to increase web traffic<br>- Communicate with TrySome subscribers and social media followers. Respond to customer service inquiries in a timely manner and monitor comments and reviews<br>- Initiate and implement new features to develop brand awareness, like promotions, Instagram challenge or competitions<br>- Initiate creative growth efforts to increase number of users and manufacturers on the platform</p><p>You should have basic understanding of SEO and set up KPIs to monitor progress. You will work directly with the Chief Marketing Officer for guidance.<br>This position is unpaid and requires a commitment of at least 3 full days per week, preferably full time. If you prove invaluable a full time position is a possibility. We prefer if you are in NYC and can come to the office, but working remotely is an option.</p><p>We are looking forward to hearing from you.</p><p>Application deadline &amp; start date: Next internship starting in March. Apply asap. We will on-board the first right person.   </p><p>TO APPLY:</p><p>Send us an email with:<br>- Your resume<br>- A writing sample (write a draft post for 2 of our 4 different social media platforms). For each post please explain why you think the particular post is good for that particular platform.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Uttaq9a_STy9RpWb81vAYg",
    "url": "http://workinstartups.com/job-board/job/72315/senior-offline-media-planerbuyer-mfx-at-dcmn-gmbh/",
    "title": "Senior Offline Media Planer/Buyer (m/f/x)",
    "tags": [
      "DBG:surround``work 2W from 2W home 3W OR(whenev,wherev,agil)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "DCMN GmbH",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 23, 2018 12:59:59 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Are you a curious innovator? A passionate problem solver? Born digital? And maybe a little wild at heart? If so, read on.<br /><br />We’re DCMN – the growth marketing partner for digital businesses and startups. Our holistic, data-driven approach combines technology with expert knowledge to grow the market leaders of tomorrow. Our vision is bold: we want everyone in the world to use one of our client’s services. If you have the drive to get us there, let’s talk.<br /><br /><br />Join our ambitious, supportive and international team, and you’ll work on the following:<br />- Develop growth solutions for digital brands together with your client team, always with our mission in mind: to grow the market leaders of tomorrow<br />- Take full responsibility for assigned clients and their marketing campaigns (focus on performance-driven TV campaigns)<br />- Challenge client briefs and internal teams to ensure we deliver stuff that sets us apart<br />- Interpretation of campaign results and ability to explain them to clients and discuss the results with them on an advanced level<br />- Planning, buying, controlling and on-going optimisation of international marketing campaigns (with a strong focus on TV campaigns)<br />- Prepare comprehensible campaign reports, based on our own TV attribution tool and third-party tools<br />- Build good, yield-rich and long-term relationships with our (international) customers<br />- Advise digital commerce companies about opportunities to scale their business with data-driven and intelligent marketing campaigns<br />- Effectively communicate and promote our vision and philosophy to potential new clients and stakeholders<br />- Live the startup vibe, act as an entrepreneur, have a hands-on approach and proactively identify opportunities that go beyond your daily account managing tasks to help grow our business in the UK market<br /><br /> <br />Of course we’ll need you to bring along a few things, including:<br />- At least 4 years working experience in digital marketing and/or DRTV<br />- 3-5 years of experience in planning, buying, controlling and on-going optimisation of TV campaigns in the UK (preferably also internationally)<br />- Good network of contacts in the UK offline/TV landscape<br />- First experience with Sky Advanced products, OTT campaigns and video advertising are beneficial<br />- Proficiency with tools such as Techedge/IMD - CARIA, etc.<br />- Knowledge of other offline channels (radio, OOH, etc.)<br />- Not afraid of working with numbers and Excel, plus strong analytical skills<br />- Previous experience within a startup and/or in the field of marketing for digital brands is a big plus<br />- Efficient and result-oriented working style<br />- Fluent in English (written & spoken)<br /><br /><br />And here’s what you’ll get in return for working with us:<br />- An awesome WeWork office space in the heart of Shoreditch full of radically supportive colleagues<br />- Support for your personal and professional growth, whether this means regular massage sessions and pilates classes or an overseas conference trip<br />- Flexibility to manage your own hours and work from home whenever you need<br />- A multicultural work environment, plus the chance to visit our international offices and apply for our exchange program. One year placement in New York, anyone?<br />- No hierarchies, freedom and full responsibility from day one. We believe top-down hierarchies just limit our progress – so we’ve created a whole new way of working<br /><br />Can’t wait to get started? Then we’d love to hear from you. Please send us your CV along with any relevant documents and your earliest possible starting date. And don’t hesitate to reach out if you have any questions!",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "bXjU7lsqTi-EokJ6b3U6gw",
    "url": "https://remote.com/jobs/browse/preview/manager-14",
    "title": "Manager",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``OR(partial,share,amen,semi) 3W remot",
      "DBG_TECH1:k/t/w:c++/c/8",
      "DBG_TECH1:k/t/w:visual-studio/dotnet/8",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=8, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/50",
      "TECH1/c",
      "TECH1/dotnet",
      "TITLE1/sales",
      "TZ/America"
    ],
    "tagsNames1": [
      "50% remote",
      "American time zones"
    ],
    "tagsNames2": [
      "c",
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "Ehutty",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2018 9:23:43 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "JOB TYPE: Full time<br /><br />LOCATION:<br />New York, NY, USA<br />(Partial remote)<br /><br />Anywhere in<br />New York<br /><br />EXPERIENCE: beginner<br /><br />COMPANY: Ehutty; 1-10 employees; 0-25% remote;<br /><br />SKILLS:<br />• Microsoft Visual Studio C++<br />• Wordpress<br /><br />Want manager of the website. who is responsible for the management of the website like identifying the errors in the website, design, website is working properly or not.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "gQRRQ__QSV-T8nPcCdf44g",
    "url": "https://angel.co/open-health-network/jobs/37677-director-of-sales",
    "title": "Director of Sales",
    "tags": [
      "Business Development",
      "Clinical Trials",
      "Closing Deals",
      "DBG:surround``fulltim 4N remot",
      "Deal Execution",
      "Deal Structuring",
      "Full Time",
      "Health Care Information Technology",
      "Healthcare",
      "Healthcare Expertise",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Sales and Marketing",
      "Sunnyvale",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Open Health Network",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=171649&listings[0][]=54021&listings[0][]=86122&listings[0][]=120532&listings[0][]=37677"
    },
    "salary": {
      "currency": "$",
      "minValue": 120000,
      "maxValue": 160000,
      "info": "1.0% – 2.0%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2018 6:26:06 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Director of Sales at Open Health Network</h2><div>Sunnyvale, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Business Development, Healthcare Expertise, Deal Structuring, Health Care Information Technology, Sales and Marketing, Closing Deals, Healthcare, Deal Execution, Clinical Trials</div><div>Compensation</div><div>$120K–$160K<br>1.0%–2.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Experienced sales executive with over 10 years of B2B sales in Healthcare space. Proven track record of closing deals. Connections to C-level executives in Pharma, Medical, Advocacy and other healthcare organizations.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "RATamEAeTbyoE7SmVDtkCw",
    "url": "https://angel.co/teach-me-now/jobs/111131-sales-executive",
    "title": "Sales Executive",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "Dubai",
      "Education",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Teach Me Now And EdTechSolutions.org",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=542962&listings[0][]=89107&listings[0][]=113798&listings[0][]=111131"
    },
    "salary": {
      "currency": "$",
      "minValue": 33000,
      "maxValue": 100000,
      "info": "No Equity",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 22, 2018 6:16:21 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Sales Executive at Teach Me Now And EdTechSolutions.org</h2><div>Dubai, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Sales, Education</div><div>Compensation</div><div>$33K–$100K<br>No Equity</div></div><h3>Job Description</h3><div><p>Are you amazing at sales and looking for a new opportunity with big incentives? Are you result oriented? </p><p>We are looking to hire a passionate sales executive with experience in either educational or technology sales. </p><p>You will be building relationships with key partners and selling an educational software solution that is growing globally and helping thousands of students have access to education on a daily basis. </p><p>We are looking for someone with an eye for sales, passion for education/tech and an international approach. </p><p>We are a growing dynamic and international team looking for the right people to make things happen. Do you have what it takes? </p><p>Functional Role: </p><p>- Sell educational products to schools, governments, institutes and HR departments. </p><p>- Implement marketing and promotion strategy to the identified key operators to promote Teach Me Now as a software-as-a-service solution to further advance the teaching and learning process of schools, institutions and governments;</p><p>- Continuously improve marketing and and sales strategies;</p><p>- Coordinate with set up of new customers;</p><p>Required Skills / Experience: </p><p>- You must be fluent in English</p><p>- Background in education and technology sales </p><p>- Result driven and a proven track record of targets</p><p>- Full of initiative </p><p>- Knowledge and experience of sales and marketing strategy</p><p>- Strategic Thinking and planning skills</p><p>- Presentation Skills/ Good at Public Speaking</p><p>- Communication &amp; Relationship Management</p><p>Apply with your cv and cover letter to <a href='mailto:hr@teachmenow.com' rel='nofollow'>hr@teachmenow.com</a> today.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ipVwixyjSs2mby8IpBZUBQ",
    "url": "https://angel.co/lurkin/jobs/66594-account-executive",
    "title": "Account Executive",
    "tags": [
      "Account Executive / Project Manager",
      "Advertising",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Los Angeles",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "Sales Strategy and Management",
      "Sales and Marketing",
      "Sales/Marketing and Strategic Partnerships",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Lurkin",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=282728&listings[0][]=66538&listings[0][]=66537&listings[0][]=66539&listings[0][]=66540&listings[0][]=66594&listings[0][]=66593&listings[0][]=66591&listings[0][]=71410&listings[0][]=66592"
    },
    "salary": {
      "currency": "$",
      "minValue": 60000,
      "maxValue": 70000,
      "info": "1.0% – 1.0%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 21, 2018 7:25:33 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Account Executive at Lurkin</h2><div>Los Angeles, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Sales Strategy and Management, Advertising, Sales and Marketing, Sales/Marketing and Strategic Partnerships, Account Executive / Project Manager</div><div>Compensation</div><div>$60K–$70K<br>1.0%–1.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Exceptional executive to identify, prioritize, and secure business opportunities.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "OXsbymnsSnOm0tMDs4mMlw",
    "url": "https://angel.co/dataiku/jobs/213015-account-executive-europe-paris-based-or-remote",
    "title": "Account Executive - Europe (Paris-based or remote)",
    "tags": [
      "Big Data",
      "Cofounder",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``remot 3W OR(execut,presenc,etiquett)",
      "DBG_TECH1:k/t/w:express/nodejs/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=8, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "English language",
      "Europe",
      "Paris",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/nodejs",
      "TITLE1/sales",
      "TZ/Europe",
      "good knowledge in technical field"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "Dataiku",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=141418&listings[0][]=121891"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "0.5% – 1.0%",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 21, 2018 7:13:23 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Account Executive - Europe (Paris-based or remote) at Dataiku</h2><div>Paris, Europe, Remote · Cofounder</div></div><div><div>Skills</div><div>Big Data, Sales, English language, good knowledge in technical field</div><div>Compensation</div><div>No Salary<br>No Equity</div><div>Visa Sponsorship</div><div>Available</div></div><h3>Job Description</h3><div><p>Dataiku is looking for an experienced Account Executive whose native language is English to join our EU sales team (based in Paris or remotely) to focus on a large European territory. In addition to strong product-market fit, the territory benefits from extensive marketing and sales exposure over the past 18 months with significant latent demand.</p><p>The role consists of engaging prospects and customers on the topic of their Big Data and Advanced Analytics initiatives and to help them develop a more efficient approach, leveraging Dataiku DSS. The Account Executive is responsible for the entire sales cycle, leveraging various company resources, to reach a successful collaboration with the prospect.</p><p>Dataiku is a young company with great momentum and at this early stage, the Account Executive is likely to work cross-functionally with Marketing, Product Management and Engineering, and will be a key player in defining Dataiku's European strategy. We’re looking for someone who can express passion about the new technologies and possibilities of Big Data and Advanced Analytics.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "ObZqpAhKQpi7ogJlB2GkSg",
    "url": "https://angel.co/franchiseblast/jobs/15460-inside-sales-representative",
    "title": "Inside Sales Representative",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Ottawa",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "FranchiseBlast",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=251020&listings[0][]=15462&listings[0][]=15460"
    },
    "salary": {
      "currency": "$",
      "minValue": 35000,
      "maxValue": 100000,
      "info": "No Equity",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 21, 2018 6:30:27 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Inside Sales Representative at FranchiseBlast</h2><div>Ottawa, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$35K–$100K<br>No Equity</div></div><h3>Job Description</h3><div><p>We are looking for someone who can make a significant impact at FranchiseBlast in an inside sales / business development role. We are demanding, but we are rewarding. We are at an inflection point in our company’s history and we would like to see the selected candidate advance in their role to become one of the core pillars of the company.</p><p>We offer a flexible work environment. Here are the required skills:<br>•    Good listening skills and empathy<br>•    Excellent understanding of the various business operations (legal, sales, accounting) to see things from the franchisor’s perspective. <br>•    Very comfortable with technology – ability to adapt to the technological level of the interlocutor and provide simple explanations<br>•    Be very confident without falling into arrogance<br>•    Possess previous experience in selling software solutions (in a startup environment)<br>•    Detail-oriented; be able to mention what the two founders of the company studied in university in their motivation letter <br>•    Ability to self-motivate, plan and manage time, develop your own working structures and seek to improve procedures on an ongoing basis<br>•    Ambitious and demanding, determined to succeed and willing to move forward in a changing environment<br>•    Creative : Able to recognize a need and find the best way to fill it<br>•    Excellent written and spoken English, ideally bilingual (French) <br>•    Having the audacity and flair for identifying opportunities, but also patience and resilience.</p><p>Assets<br>•    Experience in business and / or within a franchise<br>•    Self motivated and independent<br>•    University degree, new graduates welcome</p><p>Your Mission<br>•    Lead generation, demos and follow-ups <br>•    Develop strategies and apply best practices in sales<br>•    Work with the development team to identify requested features or ways to simplify the product <br>•    Timely report all technical difficulties with the site or customers<br>•    Wear different hats! (Marketing, for example)</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3LmvAydHRiC1OrUGbxo4PA",
    "url": "https://angel.co/mist-minds-technologies/jobs/91430-business-development-head",
    "title": "Business Development Head",
    "tags": [
      "Bengaluru",
      "Business Development",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Marketing",
      "REMOTE1/100",
      "Remote OK",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Mist Minds Technologies",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=860379&listings[0][]=91430"
    },
    "salary": {
      "currency": "$",
      "minValue": 10000,
      "maxValue": 20000,
      "info": "5.0% – 5.0%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 17, 2018 7:14:45 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Business Development Head at Mist Minds Technologies</h2><div>Bengaluru, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$10K–$20K<br>5.0%–5.0%</div></div><h3>Job Description</h3><div>No description available.</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "vy9lI5-XQhKMpGp3nohTag",
    "url": "https://angel.co/memsql/jobs/111417-enterprise-account-executive-new-york",
    "title": "Enterprise Account Executive, New York",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Databases",
      "Enterprise Sales",
      "Enterprise Software",
      "Full Time",
      "New York City",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "MemSQL",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=40574&listings[0][]=111417"
    },
    "salary": {
      "currency": "$",
      "minValue": 260000,
      "maxValue": 300000,
      "info": "0.0% – 0.05%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 17, 2018 6:22:29 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Enterprise Account Executive, New York at MemSQL</h2><div>New York City, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Sales, Databases, Enterprise Software, Enterprise Sales</div><div>Compensation</div><div>$260K–$300K<br>0.0%–0.05%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Position Overview<br>MemSQL is looking for an accomplished sales professional to join our Enterprise Sales Team. In this role you will be responsible for closing new business and expanding existing business with large enterprise customers in the tri-state region. This is an incredible opportunity to join an established, fast-growing startup in the enterprise software industry, where you will have the opportunity to over-achieve, earning uncapped commission and accelerators.</p><p>Enterprise Account Executives at MemSQL are accomplished sales leaders who are passionate about evangelizing the industry’s most disruptive technologies. You’re excited to exercise your modern data infrastructure expertise and communicate solution value to enterprise accounts. You also possess an in-depth understanding of the market landscape, have the ability to partner closely with sales engineers and inside sales reps, and can thrive in a fast-paced, collaborative environment. </p><p>Role and Responsibilities<br>Develop and execute territory account plans to achieve (ideally exceed) quota<br>Lead multiple customer sales cycles and effectively close new business (hunter mentality with the ability to sign new logos)<br>Manage and grow large, strategic enterprise accounts<br>Effectively partner with Sales Engineering, Inside Sales, and Field Marketing<br>Quickly learn our software products and be able to clearly communicate the value proposition<br>Develop strong relationships with key decision makers, influencers, and partners within your territory<br>Travel within your assigned territory</p><p>Required Skills and Experience<br>Proven track record of successfully selling enterprise software solutions and increasing revenue through new customer acquisition<br>Solution selling of a disruptive technology in the data infrastructure space<br>Firm understanding of the modern data infrastructure such as the open source community and the various enterprise software (business intelligence, analytics, ETL, cloud infrastructure, etc.) products<br>Demonstrated ability to sell to CXO or line of business, successfully emphasizing business value versus product<br>Strong ability to connect with customers to understand their individual business needs<br>B.S. degree or equivalent in a related field<br>Understanding of OLTP and OLAP architectures is a plus</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "bxMDYugNRiGS0tGhe3EdMg",
    "url": "https://angel.co/baby-startup/jobs/72062-sales-internship-commission-only-part-time",
    "title": "Sales Internship (Commission-Only, part-time)",
    "tags": [
      "Austin",
      "Chicago",
      "DBG:surround``2N(remot, posit)",
      "Internship",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "San Francisco",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "BabyNoggin",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=642826&listings[0][]=72062"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "0.5% – 1.0%",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 16, 2018 7:17:57 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Sales Internship (Commission-Only, part-time) at BabyNoggin</h2><div>Austin, San Francisco, Chicago, Remote · Internship</div><div></div></div><div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>BabyNoggin is a platform that develops medical apps.  We take the latest scientific screening tools, and digitize them into easy apps for parents &amp; doctors to use.</p><p>Our mission is to help achieve universal screening for all children — screening for autism, speech, emotional, and all physical delays so we can provide children treatment as soon as possible.  </p><p>This position has a possibility to evolve into a salaried role based on your success. You'll be working directly with the head of sales to spearhead a mix of digital sales activities:  </p><p>-Cold-calling leads<br>-Following up on inbound sales<br>-Facilitating demos/presentations<br>-Attending events nationwide</p><p>We are looking for creative individuals eager to learn and get involved in a small team venture-funded startup.  Again, depending on performance and commitment, this internship may turn into a full-time employment.</p><p>To apply, please send an introduction with a description of your experience in marketing and the baby space.   Please note, this is a work remote position.</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "GL5vrDHATL2MVERjmd3KKg",
    "url": "http://berlinstartupjobs.com/sales/account-executive-m-f-perdoo-gmbh/",
    "title": "Account Executive (m/f) // Perdoo GmbH",
    "tags": [
      "DBG:surround``OR(locat, anywher, base, resid) 7W usa",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/sales",
      "TZ/America"
    ],
    "tagsNames1": [
      "American time zones"
    ],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 16, 2018 11:04:58 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Account Executive (m/f) // Perdoo</h2><div> Company:  Perdoo <br> <br></div><div> Tags:</div><li>communication skills</li><li>customer success</li><li>account executive</li><li>management consulting</li><div>  <p><strong>We are looking for a full-time Account Executive who will report directly to one of our founders. As our first Sales hire you’ll be responsible for selling Perdoo to CEOs and senior level execs at companies in the EU and US.</strong></p>  <p><strong>About us</strong></p>  <p>We’re an ambitious team of entrepreneurs excited about building the next big thing in B2B. Perdoo helps companies turn ambition into reality with our SaaS tool which is based on OKR – a goal management framework used by top-achieving businesses like Google and LinkedIn. By focusing companies around common objectives, we help them fix the broken link between strategy and execution so that everyone can work together on a clear path towards success. Many well-known companies throughout the world already trust us and our product.</p>  <p><strong>About the position</strong></p>  <p>You’ll be the most important source of revenue growth at Perdoo. Your main responsibility is to convert incoming leads to customers. You’ll be selling Perdoo to CEOs and senior level execs at companies in the EU and US. Sales at Perdoo is entirely inbound and done from our headquarters in Berlin. Hence, there’s no need for exhaustive traveling, neither do you have to disturb anyone with cold calls or cold emails. Instead, you’ll talk to prospects who have already shown an interest in our product and services, allowing you to take a consultative approach by showing them how best we can help them realize their ambitions. As we scale, your insights will dictate how our sales team operates at 10x its current size.</p>  <p><strong>As our Account Executive you will</strong></p>  <ul>   <li>Achieve revenue goals and contribute to Perdoo’s overall sales strategy and growth objectives.</li>   <li>Qualify and prioritize incoming leads.</li>   <li>Perform sales demos that give prospects a good and thorough understanding of the Perdoo product and services.</li>  </ul>  <p><strong>We’d love to hear from you if you</strong></p>  <ul>   <li>Have 1-4 years experience working in sales, customer success or management consulting.</li>   <li>Have at least a Bachelor’s degree.</li>   <li>Are fluent in English, German would be a plus.</li>   <li>Have some flexibility in terms of working hours as a considerable amount of our prospects is located in the US.</li>   <li>Have excellent verbal and written communication skills.</li>   <li>Are an autonomous worker and self-starter.</li>  </ul>  <p><strong>What we offer</strong></p>  <ul>   <li>A fixed salary, benefits and employee stock option plan.</li>   <li>Contribute to a real-life product used by thousands of users every day.</li>   <li>Work in a dynamic, exciting and fun startup environment where every person has a voice and can have a real impact on company success.</li>   <li>Office in Berlin-Mitte, the heart of Europe’s startup scene.</li>   <li>Regular team retreats to remote locations. Last time we took the team to a finca in Mallorca.</li>   <li>An awesome rooftop overlooking Berlin with regular after-work drinks, BBQs and our annual Rooftop Party.</li>   <li>Free food and coffee in our kitchen.</li>  </ul> </div><a href='https://www.perdoo.com/careers/#job-165699' rel='nofollow'>Apply for this position</a>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "djYWgF60RRyX6_TXKAkwAQ",
    "url": "https://angel.co/epianalytics-1/jobs/119045-enterprise-sales",
    "title": "Enterprise Sales",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Enterprise Software",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "SalesForce.com",
      "San Diego",
      "San Francisco",
      "Software as a service",
      "Solutions Selling",
      "Subscription Models",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown",
      "Text Analytics",
      "Virginia"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "EpiAnalytics",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=1018997&listings[0][]=119045"
    },
    "salary": {
      "currency": "$",
      "minValue": 60000,
      "maxValue": 85000,
      "info": "0.01% – 0.025%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 15, 2018 6:27:18 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Enterprise Sales at EpiAnalytics</h2><div>San Francisco, San Diego, Virginia, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>Enterprise Software, Text Analytics, Subscription Models, SalesForce.com, Solutions Selling, Software as a service</div><div>Compensation</div><div>$60K–$85K<br>0.01%–0.025%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div><p>Solution Sales Executive</p></div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "hz-CsO0pT8-J6WEiJhFvLw",
    "url": "http://workinstartups.com/job-board/job/72010/magazine-print-amp-digital-sales-manager-at-film-daily/",
    "title": "Magazine Print &amp; Digital Sales Manager",
    "tags": [
      "DBG:surround``3N( OR(feasibl,OR(consid,consider),option,occas,opportun,possibl,abil), OR(3N(remot, work),telecommut,2N(work,home)) ) NOT OR(regularli, abracadabra)",
      "DBG:surround``OR(abl,will,challeng,flexibl,experi,get,prefer) 2W 2N(work,remot)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Film Daily",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 15, 2018 1:52:16 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Base rate + commission<br />30 – 40 hours per week<br />3 months to perm<br />Online/Remote Working or in our LA office<br /><br />Who we are: Always now, forever independent<br /><br />Film Daily is a platform connecting audiences with indie filmmakers via news, views, and reviews.<br /><br />We’re looking for sales managers to join our busy advertising & sponsorship department.<br /><br />Are you blessed with the gift of the gab? Come place advertising in our printed film magazine and daily newsletter.<br /><br />The role goes for 3 months to begin, but can become full-time for the right person.<br /><br />Responsibilities<br />Build relationships.<br />Meet realistic sales targets.<br />Maintain contact databases.<br />Maintain relationships with industry-specific businesses.<br />Look for regional opportunities in our core markets (LA, New York, Sydney, Toronto).<br />Clearly understand the marketplace and the competition.<br />Work with the team at large on lead generation.<br />Keep approved advertisers on brand.<br />Liaise with Accounts Payable to assure invoices are paid by deadlines.<br />Position Requirements<br />Must love Film & TV<br />Working knowledge of Google & Microsoft Office products<br />Working knowledge of Excel & Google Sheets<br />Working knowledge of Trello, Riot, and Slack<br />Working knowledge of the film industry<br />Past experience working in digital/print sales<br />Past experience working for a publisher<br />Experience working remotely<br />Ability to manage own diary & schedule<br />Working laptop & phone<br />Experience working in an office environment<br />Excellent reading & listening skills<br />At least 2 years’ sales experience with proven track record meeting targets<br />Past experience working in print advertising sales<br />Motivation to close deals<br />Outgoing personality<br />Little black book filled with advertising agency contacts, brand relationships, past partners, and future partners<br />Education<br />We prefer candidates who have studied marketing, business, or PR.<br /><br />Details<br />Candidates must be available to commit to at least 30 hours per week.<br />What we offer<br />Competitive retainer<br />25-50% monthly bonus<br />Phone allowance<br />Access to online streaming platforms<br />Invitations to red carpet events, product launches, and premieres",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "yWw6p2ZmSiqtcLy4eUAljw",
    "url": "http://berlinstartupjobs.com/operations/office-manager-idagio/",
    "title": "Office Manager // Idagio",
    "tags": [
      "DBG:surround``home W base",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/frontend",
      "TECH1/nodejs",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "frontend",
      "nodejs"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 14, 2018 2:50:49 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Office Manager // Idagio</h2><div> Company:  Idagio <br> <br></div><div> Tags:</div><li>management</li><li>administration</li><li>music</li><li>Office</li><div>  <p>ABOUT US</p>  <p>“This startup is set to revolutionize classical music” – Frankfurter Allgemeine Zeitung</p>  <p>We are a technology company that is driven by the mission to build the world’s best streaming service for classical music lovers. We’re the only service worldwide that is able to offer the specialized search that lovers of this genre want and need. A search that they can’t and won’t get at Spotify, Apple Music or Youtube.</p>  <p>We are honoured to also work directly with the world’s leading musicians and institutions, including the Vienna Philharmonic, the Philharmonia Orchestra and the Israel Philharmonic.</p>  <p>IDAGIO is available to music lovers across the globe, but physically we are rooted in Berlin and consider the German-speaking countries our home base, as the world perceives them as the cradle and the center of classical music.</p>  <p>WHERE YOU’LL CONTRIBUTE</p>  <ul>   <li>Being responsible for the reception area, greeting visitors and for general email and phone enquiries</li>   <li>Ensuring that our team members and guests feel welcome at IDAGIO</li>   <li>Contributing to a supportive, passionate, and committed team culture</li>   <li>Maintaining correspondence with various vendors and keeping stock of office supplies</li>   <li>Supporting team members in administrative tasks such as travel bookings</li>   <li>Working closely with Finance and HR to maintain budgets, coordinate and plan team events, and onboard new team members</li>   <li>Handling requests and queries from our founders accordingly</li>   <li>Defining, developing, and implementing office procedures/policies in a fast-growing startup setting</li>   <li>Continuing to grow professionally through personal projects</li>  </ul>  <p>EXPERIENCE AND PERSONALITY TRAITS WE FIND RELEVANT FOR THIS POSITION</p>  <ul>   <li>At least 2-3 years experience in Office Management or Administration in an international, professional environment, ideally in a startup</li>   <li>Fluency in German and English (spoken and written)</li>   <li>Impeccable time management skills and high attention to detail</li>   <li>Ability to multitask, prioritize various assignments, and solve problems dynamically</li>   <li>Knowledge of basic office tools like Excel, Google Suite, Slack etc.</li>   <li>Ability to work and make good judgments independently</li>   <li>Excellent communication and interpersonal skills</li>   <li>Open, friendly and positive personality</li>   <li>A passion for classical music is a big plus</li>  </ul>  <p>WHAT WE HAVE TO OFFER</p>  <ul>   <li>Join an exceptional multinational team of 70 and shape the future of classical music</li>   <li>Enjoy a positive and purpose-driven working atmosphere in our office in Berlin Kreuzberg</li>   <li>Contribute directly to the success of our game-changing product</li>   <li>Enjoy flexible working hours, occasional remote work and using the tools and hardware of your choice</li>   <li>IDAGIO is well funded by renowned investors such as Tengelmann Ventures, Macquarie Capital and b-to-v</li>   <li>A competitive salary and a yearly education budget</li>   <li>Sharpen your piano skills on our Steinway Model D, and yes, there is good coffee too</li>   <li>We can support you with your Visa process and can answer your questions around relocation. Berlin is a beautiful city with lots to offer.</li>  </ul> </div><a href='mailto:jobs@idagio.com' rel='nofollow'>Apply for this position</a>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "XP2cCAUZQPu6pm1MBbnLNA",
    "url": "https://angel.co/kwanzoo/jobs/62723-account-executive-austin-tx",
    "title": "Account Executive (Austin, TX)",
    "tags": [
      "Austin",
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "REMOTE1/100",
      "Remote OK",
      "Sales",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Kwanzoo",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=70301&listings[0][]=62723&listings[0][]=4727"
    },
    "salary": {
      "currency": "$",
      "minValue": 35000,
      "maxValue": 70000,
      "info": "0.25% – 0.5%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 13, 2018 7:16:13 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Account Executive (Austin, TX) at Kwanzoo</h2><div>Austin, Remote · Full Time</div><div></div></div><div><div>Compensation</div><div>$35K–$70K<br>0.25%–0.5%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div>No description available.</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "rH_XgtEqRGagdtNpvtPAoA",
    "url": "https://angel.co/kwanzoo/jobs/4727-director-of-sales",
    "title": "Director of Sales",
    "tags": [
      "DBG:surround``fulltim 4N remot",
      "Full Time",
      "Los Altos",
      "REMOTE1/100",
      "Remote OK",
      "SaaS",
      "Sales",
      "Sales Strategy and Management",
      "Sales/Marketing and Strategic Partnerships",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Kwanzoo",
      "sameAs": "https://angel.co/job_lists/1/browse_startups_table?startups[]=70301&listings[0][]=62723&listings[0][]=4727"
    },
    "salary": {
      "currency": "$",
      "minValue": 80000,
      "maxValue": 160000,
      "info": "1.0% – 4.0%",
      "unit": "YEAR",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 13, 2018 7:10:34 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<div><h2>Director of Sales at Kwanzoo</h2><div>Los Altos, Remote · Full Time</div><div></div></div><div><div>Skills</div><div>SaaS, Sales, Sales Strategy and Management, Sales/Marketing and Strategic Partnerships</div><div>Compensation</div><div>$80K–$160K<br>1.0%–4.0%</div><div>Visa Sponsorship</div><div>Not available</div></div><h3>Job Description</h3><div>No description available.</div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "pq73R2KNTbmDpU7pShS-wA",
    "url": "https://news.ycombinator.com/item?id=17725514",
    "title": "SEEKING FREELANCER | Remote I work at a startup called Lorem: www.asklorem.com We are a marketplace that connects ...",
    "tags": [
      "DBG:surround``seek 2W freelancerescap 4W remot",
      "DBG_TECH1:k/t/w:wordpress/php/5",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=5, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 9, 2018 6:17:06 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<span>SEEKING FREELANCER | Remote<p>I work at a startup called Lorem: www.asklorem.com</p><p>We are a marketplace that connects business owners with our network of WordPress and Shopify freelance developers and designers. The pitch: sit anywhere in the world, we match you with clients, streamline the project management, and send payment immediately.</p><p>We've been getting an influx of new projects and are looking to quickly bring more developers into the network. If you know of anyone, please ask them to apply here <a href='https://www.asklorem.com/become-an-expert' rel='nofollow'>https://www.asklorem.com/become-an-expert</a></p><p>Here are some reviews on product hunt: <a href='https://www.producthunt.com/posts/ask-lorem' rel='nofollow'>https://www.producthunt.com/posts/ask-lorem</a></p><p>More questions? charlie at asklorem.com<span>              </span></p><div>        <p>                        </p></div></span>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "_R4VVw3_ReG7b5uPtR4JCQ",
    "url": "https://authenticjobs.com/jobs/30797?r=rss2",
    "title": "10up: Technical Sales & Account Management",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG:surround``4W( OR(fulltim,work,talent), anywher)",
      "DBG_TECH1:k/t/w:php/php/5",
      "DBG_TECH1:k/t/w:wordpress/php/15",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=20, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/php",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "php"
    ],
    "hiringOrganization": {
      "name": "10up",
      "sameAs": "https://10up.com"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 6, 2018 11:37:05 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Technical Sales &amp; Account&nbsp;Management</h2><div>Full-time</div><div>Anywhere</div><div>Remote job</div><div>Small business</div><div>            <div>Posted Aug 6 – Accepting applications</div>        <p>Web Strategists&nbsp;advance account growth and acquisition (sales) by applying&nbsp;a&nbsp;sophisticated&nbsp;understanding of 10up’s&nbsp;capabilities to client and prospect business goals, buttressed by superior communication, attention to detail, and ownership of&nbsp;company&nbsp;sales&nbsp;goals.</p><p></p><p><strong>Responsibilities</strong></p><ul><li>Communicate with prospective clients via calls, video conferencing, and in-person sessions to understand goals and define strategic and tactical plans aligned to their needs and 10up strengths.</li><li>Write, edit, revise, and complete compelling emails, proposals, and other documents to drive&nbsp;prospective and current clients buy in to 10up’s strategies and approaches.</li><li>Negotiate client goals, constraints, and 10up resourcing and delivery standards to create detailed contracts, proposals, and project plans that set 10up&nbsp;and its&nbsp;clients up for success.</li><li>Support and grow client relationships via regular check-ins and collaboration with client and production teams; complete all related deliverables necessary to ensure outstanding client service in a timely and insightful manner.</li><li>Maintain accurate, timely, and detailed documentation for deals, client relationships, and projects.</li><li>Successfully manage and grow relationships with partners in hosting, technology, and related areas.</li></ul><p>&nbsp;</p><p><strong>Requirements</strong></p><ul><li>Experience with and passion for building websites (or other platforms using web technologies).</li><li>Experience&nbsp;with and knowledge of web&nbsp;content management systems (CMS), preferably WordPress or similar open source platforms.</li><li>Experience&nbsp;producing client agreements and proposals.</li><li>Knowledge of&nbsp;common&nbsp;metrics for digital media success and popular&nbsp;tools&nbsp;and mechanisms&nbsp;for&nbsp;measuring success (e.g. Google Analytics).</li><li>Outstanding written communication.</li><li>Outstanding verbal communication.</li><li>Outstanding collaboration skills, inspiring consensus and collaboration from varied internal and external stakeholders.</li><li>Passion for&nbsp;helping clients and prospects move from concept&nbsp;to execution&nbsp;by matching their goals to 10up expertise.</li><li>Comfortable networking and building new relationships on behalf of 10up.</li><li>Willingness to take initiative and help with a variety of&nbsp;account service&nbsp;tasks.</li></ul><p>&nbsp;</p><p><strong>Nice to have</strong></p><ul><li>Experience with core&nbsp;10up disciplines, e.g. back&nbsp;and&nbsp;front end&nbsp;engineering, UX and visual design, ad strategy, and audience growth.</li><li>A strong familiarity with the WordPress and web development ecosystem, e.g. knowledge of popular tools, plugins, frameworks, best practices, and conventions.</li><li>Hands on experience building websites using&nbsp;PHP and WordPress.</li><li>Experience&nbsp;with the digital marketing ecosystem of tools, e.g. Google Analytics, DFP.</li><li>Experience&nbsp;with MS Office, Google Docs, Apple Pages, Apple Keynote, and Teamwork.</li><li>Remote working experience appreciated.</li></ul><p></p>  </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Y7RFHVQzSU-ZeUxUGFce2Q",
    "url": "http://workinstartups.com/job-board/job/71613/account-executive-at-deepcrawl/",
    "title": "Account Executive",
    "tags": [
      "DBG:surround``OR(travel,visit) W to 4W OR(offic,headquart,onsit)",
      "DBG:surround``flexibl 3W work 2W from 2W home",
      "DBG_TECH1:k/t/w:angularjs/frontend/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=8}",
      "REMOTE1/50",
      "TECH1/frontend",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "frontend"
    ],
    "hiringOrganization": {
      "name": "DeepCrawl",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 3, 2018 9:27:32 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Company Overview:<br /><br />DeepCrawl is a pioneering cloud-based, enterprise website crawler. We’re an emerging start-up with an ambitious growth strategy and an established client base comprised of many of the world’s largest brands and digital agencies. DeepCrawl is on a mission to deliver crucial insights to teams managing large-scale, complex websites, and to become the tool that powers brands’ reporting, and supports all marketers in extracting actionable data from web properties.<br /><br />Utilising some of the very latest technology, including NoSQL databases, AngularJS, Elasticsearch and AWS, the DeepCrawl technology team are on the cutting edge of SaaS design and implementation. Our Marketing, Sales and Service functions are examples of a classic SaaS model with class leading customer acquisition costs, service delivery, and customer success.  <br /><br />Working in partnership with major corporates and digital agencies, our client base consists mainly of digitally savvy and connected individuals who work hard and have fun.  We are looking for entrepreneurial team players who match our culture of self-starters, revelling in taking responsibility and delivering excellence in an environment where they are encouraged to be innovative and self-reliant.<br /> <br />Key Responsibilities:<br /><br />We're seeking an ambitious Enterprise Account Executive to join our EMEA Enterprise Sales Team. The Enterprise AE is a proactive, entrepreneurial and enthusiastic hustler who delivers engaging, tailored and enjoyable experiences to prospective clients throughout their buying journey. This is a great challenge to join a growing enterprise sales function, where you can build and manage key relationships, both internally and externally, while securing new business to significantly contribute to the company's growth and success. <br /><br /> - Source new opportunities for DeepCrawl through Outbound efforts<br /> - Understand customer challenges to develop and present bespoke solutions<br /> - Navigate a set of, often complex, organisational champions and decision makers to win buy-in for subscribing to DeepCrawl<br /> - Deliver SaaS demos that are engaging and highlight how DeepCrawl can solve important client challenges/problems <br /> - Drive revenue in the EMEA region by closing Enterprise deals<br /> - Collaborate across Customer Success, Marketing and Product teams<br /> - Serve as the customer’s voice when passing on market knowledge and product feedback to the Product & Dev teams<br /> <br />Key Criteria:<br /><br />Your personality is as important as your skills and experience in determining whether or not you’ll be a success at DeepCrawl. As an Enterprise Account Executive, you will represent the company both in and out of the office (at events & meetups) and are expected to cultivate and develop strong relationships with prospective clients, so exceptional people skills are a must. Success in this position requires a consultative sales approach, ability to solve business challenges and and the ability to consultatively drive the sales process forward to meet & exceed monthly targets. <br /> <br /> - At least 3-5 years’ experience in opening & closing business<br /> - Experience in a SaaS company would be beneficial but not essential<br /> - Strong listening and questioning skills with an ability to understand new people quickly<br /> - Positive approach with a genuine drive for personal and team success<br /> - A history of exceeding expectations and working hard to achieve goals<br /> - Energetic, enthusiastic and thrives in a startup/entrepreneurial environment<br /> - A fast learner who is able to understand complex or technical challenges<br /> - Passionate about digital marketing and technology<br /> - Ability to generate innovative ideas that solve complex problems <br /> - Understanding of SEO (advantageous)<br /><br />Why work for DeepCrawl??<br /><br /> - We're an innovative and fast growing tech start-up<br /> - Raised our series A investment from a prominent venture capitalist <br /> - An international business, with clients all over the world and offices across London, New York and Poland<br /> - Flexible working from home & remote working policy<br /> - Potential to travel to other offices<br /> - Annual personal training budget<br /> - Company trips <br /> - Monthly office drinks & lunches <br />",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "YXwo4A0aQ6C40gq5gk6Sow",
    "url": "http://workinstartups.com/job-board/job/71612/sales-development-representative-at-deepcrawl/",
    "title": "Sales Development Representative",
    "tags": [
      "DBG:surround``OR(travel,visit) W to 4W OR(offic,headquart,onsit)",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "DeepCrawl",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 3, 2018 9:23:08 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Overview of the role<br /><br />DeepCrawl is currently growing at an exceptional rate, and in order to drive this growth we’re growing the sales development team in the London & New York offices. The team will be responsible for reaching out to potential clients, generating leads and pipelining sales meetings for the Enterprise Accounts team. This opportunity sits in the London office.<br /><br />Key Responsibilities<br /><br /> - Take the lead in creating demand for DeepCrawl’s award winning technology by phone and email outreach, with the goal of setting meetings for our Enterprise Account Executive team<br /> - Research potential clients, their companies and search marketing strategies in order to provide insight to the sales team<br /> - Cold call, prospect, nurture and qualify new leads, building a healthy pipeline of prospective clients<br /> - Collaborate with the Sales and Marketing teams on initiatives that drive demand generation and revenue growth<br /> - Develop and deliver optimal work flows and best practices in order to make demand generation as efficient and scalable as possible<br /><br />Key Criteria<br /><br /> - A passionate self-starter who has the ability to deliver in a fast-paced and dynamic environment<br /> - A confident communicator who can quickly build a rapport with potential clients<br /> - A positive, determined and resilient approach to selling<br /> - A high degree of self-motivation and ambition<br /> - A genuine interest in the technology space<br /> - A naturally curious mind with a passion for keeping up with the latest trends and developments within the SEO and digital marketing industry<br /><br />Why work for DeepCrawl??<br /><br /> - We're an innovative and fast growing start-up<br /> - An international business, with clients all over the world and offices across London, New York and Poland<br /> - Potential travel to other offices<br /> - Annual personal training budget<br /> - Company trips<br /> - Monthly office drinks & lunches<br />",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "xukxGJ3USF6lg3Q_Yvj1HQ",
    "url": "https://news.ycombinator.com/item?id=17670283",
    "title": "FreeAgent, Edinburgh and REMOTE (UK-only) https://www.freeagent.com At FreeAgent we help freelancers and small ...",
    "tags": [
      "DBG:surround``remot 3W onli",
      "DBG_TECH1:k/t/w:com/dotnet/8",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:k/t/w:ruby-on-rails/ruby/8",
      "DBG_TECH1:k/t/w:ruby/ruby/2",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=0, go=0, nodejs=1, bigdata-ml=0, ruby=10, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TECH1/ruby",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet",
      "ruby"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 2, 2018 12:00:07 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<span>FreeAgent, Edinburgh and REMOTE (UK-only)<p><a href='https://www.freeagent.com' rel='nofollow'>https://www.freeagent.com</a></p><p>At FreeAgent we help freelancers and small businesses be more successful by putting them in control of their company finances.</p><p>We have built an award-winning online accounting product that offers full end-to-end compliance, from time tracking to tax return filing. We're based in beautiful Edinburgh and we're growing from strength to strength with over 65,000 paying customers and strong YoY growth. Our NPS is off the charts (71!) - customers love what we do!</p><p>We're a growing team of over 130 people and the majority of our team are based in Edinburgh, but we have staff distributed across the UK. If you want to help us make small businesses awesome at doing their finances, we have great opportunities in our product and engineering team. Our stack is currently Ruby/Rails, JavaScript, React.js, MySQL, RabbitMQ, Elasticsearch, SmartOS.</p><p>We on a growth push and have lots of opportunities in Engineering. We’re looking for full-stack engineers, front-end specialists and experienced engineering managers.</p><p>We like to work with people who show initiative and continually seek to improve themselves, their teammates, and our codebase. Our engineering teams are small and cross functional, enjoying a great degree of responsibility. We invest in our platform (code health, scalability, security) as well as working on improving and adding new features that help our customers.</p><p>You can apply directly via the website – <a href='https://www.freeagent.com/company/careers' rel='nofollow'>https://www.freeagent.com/company/careers</a> – or feel free to get in touch with me directly: olly [at] freeagent [dot] com.</p><p>(We are looking for UK-based full-time staff only right now)<span>              </span></p><div>        <p>                        </p></div></span>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "daxq8-ftSpiOjOgtJjtSDw",
    "url": "https://news.ycombinator.com/item?id=17663679",
    "title": "SEEKING FREELANCER | NYC | REMOTE ONLY Our mission at RxMx is to help health care practitioners manage patient care ...",
    "tags": [
      "DBG:surround``remot 3W onli",
      "DBG:surround``seek 2W freelancerescap 4W remot",
      "DBG_TECH1:k/t/w:android/java/1",
      "DBG_TECH1:k/t/w:android/mobile/2",
      "DBG_TECH1:k/t/w:com/dotnet/8",
      "DBG_TECH1:k/t/w:css/frontend/3",
      "DBG_TECH1:k/t/w:ios/apple/2",
      "DBG_TECH1:k/t/w:ios/mobile/2",
      "DBG_TECH1:k/t/w:javascript/frontend/1",
      "DBG_TECH1:k/t/w:javascript/nodejs/1",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=8, c=0, mobile=4, go=0, nodejs=1, bigdata-ml=0, ruby=0, apple=2, java=1, gamedev=0, php=0, embedded=0, frontend=4}",
      "REMOTE1/100",
      "TECH1/dotnet",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "dotnet"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2018 5:57:04 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<span>SEEKING FREELANCER | NYC | REMOTE ONLY<p>Our mission at RxMx is to help health care practitioners manage patient care more effectively.</p><p>We are an international team based in Sydney, New York City and Berlin.</p><p>We are looking for a contract Mobile Web / Hybrid App developer to assist our mobile development team further develop new features for our iOS and Android hybrid apps.</p><p>Technologies: mobile web development: JavaScript, HTML, CSS, Cordova, Framework7, bitbucket and Jira.</p><p>Website: <a href='https://rxmxcorp.com/' rel='nofollow'>https://rxmxcorp.com/</a></p><p>LinkedIn: <a href='https://www.linkedin.com/company/rxmx/' rel='nofollow'>https://www.linkedin.com/company/rxmx/</a></p><p>Contact: hr [at] rxmxcorp [dot] com<span>              </span></p><div>        <p>                        </p></div></span>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "4XbnUCmUQBGmSkFz-anndA",
    "url": "http://workinstartups.com/job-board/job/71533/sales-account-executive-german-speaker-at-invision/",
    "title": "Sales Account Executive (German speaker)",
    "tags": [
      "DBG:surround``4N( OR(virtual,distribut,scatter), OR(compani,team,OR(organ,organis)))",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "InVision",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2018 10:14:31 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "InVision is the Digital Product Design platform used to make the world’s best customer experiences. We provide design tools and educational resources for teams to navigate  every stage of the product design process, from ideation to development.   <br /><br />Today, more than 3.5 million people use InVision to create a repeatable and streamlined design workflow; rapidly design and prototype products before writing code, and collaborate across their entire organization. That includes more than 80 percent of the Fortune 100, and organizations like Airbnb, Amazon, HBO, Netflix, Nike, Slack, Starbucks and Uber, who are now able to design better products, faster.<br /><br />InVision is a fully distributed company with employees in 25 countries around the world. The company has raised more than $235 million in funding from leading investors including Accel, ICONIQ, FirstMark, Tiger Global, Battery Ventures, and Spark Capital. Visit us at InVisionApp.com and InVisionApp.com/blog.<br /><br />We're looking for an Enterprise Account Executive to capitalize on our growing global footprint, and own our DACH presence as she/he accelerates rapid growth of our Enterprise sales efforts in EMEA. <br /><br />*Requirements*<br /><br />*5 years or more of inside sales experience in a B2B SaaS vertical<br />*Proven track record exceeding quota<br />*Referenceable executive-level customers at Fortune 2000 companies, major digital agencies and prominent tech firms<br />*Rolodex of contacts in leadership roles in design, product, marketing, UX or user research<br />*Passion, enthusiasm, energy, humor, and the ability to convey this through phone and email communications<br />*High degree of comfort with outbound calling<br />*Bias towards immediate action and results<br />*Willingness to learn and adapt<br />*Skilled multi-tasker who can wear multiple hats<br />*Passion for design<br />*Fluent German speaker<br />Responsibilities:<br /><br />Be a visible presence for InVision in EMEA, inclusive of conferences, client and prospect onsites, networking events and the overall design community<br />Focus on expanding relationships with existing EMEA customers and driving net new prospect acquisition<br />Manage full sales cycle in a consultative manner, from initial qualification through product demo through follow up calls to closing<br />Develop new business opportunities through proactive efforts, in addition to handling incoming leads<br />Drive strategic direction of InVision sales and customer success presence in EMEA<br />Manage against company revenue targets<br />Potential to build broader team to support EMEA growth<br />",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "XJmRhpqyQ3myWadf1fScrg",
    "url": "http://workinstartups.com/job-board/job/71528/social-media-manager-at-cstb/",
    "title": "Social Media Manager",
    "tags": [
      "DBG:surround``2N(work, remot) 3W accept",
      "DBG:surround``fulltim 4N remot",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "CSTB",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Aug 1, 2018 7:19:06 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Exciting new startup in the process of raising equity funding is looking to bring on a Social Media Manager.<br /><br />The company is bringing a popular existing game into the 21st century by integrating cryptocurrency and blockchain technology.  The role will be part time initially, with the opportunity to be brought on full time.  Remote working accepted for the initial stage.<br /><br />Ideally the candidate will be as follows:<br />- Has knowledge/interest in the cryptocurrency/blockchain space<br />- Has the will to play a key role in the success of the company<br />- Is a self-starter and can work without major supervision<br />- Experienced in managing different social media channels<br />- Experienced in coming up with innovative ideas for campaigns<br />- Experienced in creating visuals for said social media campaigns (or at least the ideas for said ideas)<br /><br />On offer is:<br />- The chance to be part of an exciting company <br />- The opportunity to work alongside smart, like minded people<br />- The opportunity to share ideas as a key member of the team<br />- The opportunity to eventually build your own team<br /><br />Compensation is negotiable.  Good short and long term earning opportunities.<br /><br />Please apply to this role mentioning previous experience, your knowledge of crypto, why you think you would be the best person for the role and one thing of your choice which may convince us you are the right person.<br />",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "j7BJQMFEQL-2qh3fsB-Plw",
    "url": "http://workinstartups.com/job-board/job/71417/global-business-developer-usa-at-passionio/",
    "title": "Global Business Developer USA",
    "tags": [
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Passion.io",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 27, 2018 12:44:15 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Who is the MOST inspiring person you know? What have they ACHIEVED that you really admire? Wouldn’t it be great if they would share their success secrets with YOU?<br /><br />The obvious answer - YES - prompted us to embark on our mission, aiming to improve 10 million lives by 2022. By creating marketing campaigns, launching digital products or coaching our clients, PASSION.IO gives inspiring people the platform they deserve to share their message with the world and impact lives.<br /><br />We are an international team with the majority of our customers in the US. We’ve grown from nothing to multi-million dollar business in under 2 years… because when you focus on impact, income will follow. We work together to not only make this company successful, but to transform our clients, our customers and ourselves into our best versions. <br /><br />As we say, Do it with Passion, or not at all.<br /><br />Do you think you’re the right fit? <br /><br />We are looking for an inspiring, engaged and motivated new member for our business development team that proactively drives our US expansion and manages projects related to that.<br /><br />You gained work experiences in high-paced environments and have the vision to change the future of learning. <br /><br />Your mission will be to build and execute on various projects to market the Passion.io learning experience to millions of people anytime, anywhere. We work with social media celebrities with millions of followers. Working on key projects around them will be a relevant part of the job. Hence, past experience with project management, sales and strong execution skills would be beneficial. You will work in a cross-functional team to deliver high quality, outstanding work.<br /><br />*What you'll be working on*<br /># You will analyze different verticals in the US, close partnerships, organize video productions, and build up deep functional expertise<br /># You work on product launches while consistently sounding out the market to help refine the products while monitoring and optimizing key performance indicators (KPIs)<br /># You will have ideas for further developing the products and business model, have a clear idea about the offers, and how they transform the market<br /># You will successfully drive projects through the lifecycle from conception to launch<br /># Define, structure, develop processes and tools, and show measurable results<br /># You will work on key projects in marketing, such as CRM, mobile, loyalty, and others to deliver high quality traffic, optimize conversion rates, and improve retention<br /># You will support implementing the marketing strategy and its roadmap across offers<br /># You will keep a close eye on the market, competition and use your research to continuously improve marketing activities<br /># You will identify and convert leads to active clients, including larger clients and strategic partnerships<br /># You will identify opportunities to further improve the sales processes, streamline operations and share best practices across markets<br /><br />*What you'll bring to the team*<br /># Outstanding degree at a top university (likely: MBA, Wi-Ing or similar)<br /># Desirable: Prolonged stay abroad (> 6 months)<br /># You have exceptional analytic skills and a strong attention to detail as well as a hands-on mentality<br /># Preferably gained 2 years professional experience in high-performance environments (strategy consulting, banking, start-up, or similar)<br /># Proven track record of professional achievements<br /># Project management: You planned, implemented and controlled major projects, in particular extensive analytical, sales, and marketing work<br /># Preferably: supported internationalization, set up new business verticals<br /><br />*What we offer you*<br /># Steep learning curve: Expect the steepest learning curve you have ever experienced - we are building a playground at passion.io to become the best version of ourselves. Meet and work with successful people worldwide to learn their success secrets.<br /># Value-based company: Be part of an open, honest, creative, and results-driven environment where your opinion is highly valued. We want to change the globe for the better by providing value to others.<br /># High-growth environment: You will be part of a strongly growing company with the opportunity to develop into a key contributor with incomparable responsibilities.<br /># Personal and professional development: You will tackle projects across departments and thereby gain a top-notch tool box to succeed in tackling bigger and bigger challenges.<br /># Autonomy / entrepreneurial work-style: You will only be measured by the results you produce and are in the driver’s seat, with full flexibility.<br /># Berlin: You will join our friendly and international team located in the heart of Berlin Mitte.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Q6xiTMkbQ-ioEuWXdrX5Gg",
    "url": "http://workinstartups.com/job-board/job/71416/global-business-developer-trainee-at-passionio/",
    "title": "Global Business Developer Trainee",
    "tags": [
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Passion.io",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 27, 2018 12:42:31 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Who is the MOST inspiring person you know? What have they ACHIEVED that you really admire? Wouldn’t it be great if they would share their success secrets with YOU?<br /><br />The obvious answer - YES - prompted us to embark on our mission, aiming to improve 10 million lives by 2022. By creating marketing campaigns, launching digital products or coaching our clients, PASSION.IO gives inspiring people the platform they deserve to share their message with the world and impact lives.<br /><br />We are an international team with the majority of our customers in the US. We’ve grown from nothing to multi-million dollar business in under 2 years… because when you focus on impact, income will follow. We work together to not only make this company successful, but to transform our clients, our customers and ourselves into our best versions. <br /><br />As we say, Do it with Passion, or not at all.<br /><br />Do you think you’re the right fit? <br /><br />Training program that trains top talent in all dimensions of Passion’s business. Program candidates will gain inside perspectives, drive day-to-day management and build deep functional expertise by rotating every 3-6 months to new functional stages with different challenges.<br /><br />Duration: 15 months total, fast track: 12 months depending on exceptional performance <br /><br />Alumni will then build verticals globally from scratch to market leadership or become a key player in functions such as online marketing, product development, sales and operations.<br /><br />You are responsible to excel in 6 modules. During the program, you will be assigned to a mentor you report to on a bi-weekly basis and direct responsible individuals (DRIs) for each program stage where you lead diverse projects to lift Passion’s business.<br /><br />*What you'll be working on*<br />* Product Launch<br /># You work on product launches while consistently sounding out the market to help refine the products while monitoring and optimizing key performance indicators (KPIs)<br /># You will have ideas for further developing the products and business model, have a clear idea about the offers, and how they transform the market<br /># You will successfully drive projects through the lifecycle from conception to launch<br /># Define, structure, develop processes and tools, and show measurable results<br />* Marketing<br /># You will work on key projects in marketing, such as CRM, mobile, loyalty, and others to deliver high quality traffic, optimize conversion rates, and improve retention<br /># You will support implementing the international marketing strategy and its roadmap across markets<br /># You will keep a close eye on the market, competition and use your research to continuously improve marketing activities<br />* Sales<br /># You will identify and convert leads to active clients, including larger clients and strategic partnerships<br /># You will identify opportunities to further improve the sales processes, streamline operations and share best practices across markets<br />* Prep project for your new role<br /># In this module, you will identify and implement a complex project that prepares you for your new role<br /><br />*What you'll bring to the team*<br /># Outstanding degree at a top university (likely: business administration, Wi-Ing or similar studies)<br /># Preferably gained professional experience in high-performance environments (strategy consulting, banking, start-up, small company or similar)<br /># Proven track record of professional achievements<br /># Project management: has planned, implemented and controlled major projects, in particular extensive analytical work<br /># Preferably: supported internationalization, set up new business verticals<br /># Google Suite or MS office, particularly strong in Spreadsheets and presentations<br /># Understanding of internet business models<br /># Extensive skills in project management<br /># Experience in business operations, background / experience in scaling internet companies<br /><br />*What we offer you*<br /># Steep learning curve: Expect the steepest learning curve you have ever experienced - we are building a playground at passion.io to become the best version of ourselves. Meet and work with successful people worldwide to learn their success secrets.<br /># Value-based company: Be part of an open, honest, creative, and results-driven environment where your opinion is highly valued. We want to change the globe for the better by providing value to others.<br /># High-growth environment: You will be part of a strongly growing company with the opportunity to develop into a key contributor with incomparable responsibilities.<br /># Personal and professional development: You will tackle projects across departments and thereby gain a top-notch tool box to succeed in tackling bigger and bigger challenges.<br /># Autonomy / entrepreneurial work-style: You will only be measured by the results you produce and are in the driver’s seat, with full flexibility.<br /># Berlin: You will join our friendly and international team located in the heart of Berlin Mitte.",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "OqX5rbVQSROuO1j229l7lw",
    "url": "http://workinstartups.com/job-board/job/71239/junior-startup-sales-rep-at-snowplow-analytics/",
    "title": "Junior Startup Sales Rep",
    "tags": [
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG:surround``work 2W wherev 2W you",
      "DBG_TECH1:k/t/w:coffeescript/frontend/1",
      "DBG_TECH1:k/t/w:coffeescript/nodejs/1",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=1, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=1}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/sales",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Snowplow Analytics",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 23, 2018 12:21:50 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Junior Startup Sales Rep<br />Ideally based in London<br /><br />Our mission is to empower people and companies to use data to do transformative things. We provide technology and services that enables our users to collect the data that they want, use that data to understand each of one of their customer’s complete user journeys, and transform their business. <br /><br />Snowplow has grown significantly over the last 12 months and we are now looking for our second Sales Development Representative to help us achieve even bigger things! <br /><br />The Opportunity:<br />Our sales function is newly formed so, as the second Startup Sales Rep there is enormous scope for a talented individual to progress quickly and have real impact on how this team is formed over the next few years. Starting with qualifying inbound leads, the role will see someone go on to work closely with our marketing function to create innovative outbound sales material. <br /><br />Within 3-9 months (depending on individual progression, there’s no pressure to be a sales expert within a few weeks), you’ll also learn how to carry out demos of our product and how to guide a customer through the entire sales journey, from initial call to customer. <br /><br />The environment you’ll be working in:<br />Our culture is as unique as our customers. Over half of our employees work remotely from all over the world so we have fostered an environment based on trust, communication and transparency. You won’t find micro-management here and everyone takes ownership of their work. Collaboration is at the core of everything we do - we work together and learn from each other.<br />What you’ll be doing:<br />Managing inbound sales queries in Salesforce<br />Qualifying inbound leads and carrying out initial calls with potential customers to assess how/if our product could add real value to their business <br />Working closely with our marketing team to start producing some outbound lead generation<br />Gaining deep knowledge of our product offering with a view to being able to take over some demo calls <br />Achieving (and hopefully exceeding) monthly and quarterly sales targets <br />Effectively managing your workload & prioritising tasks <br /><br />What you bring to the team:<br />Min 1 year experience in a sales role (preferably within a data analytics/SaaS environment)<br />A conscientious, caring & team-oriented attitude<br />Drive, enthusiasm and creativity <br />Passion for technology and adding value to businesses through data<br />Fantastic communication skills, both written and verbal <br />Confident, calm and collected nature <br />Self-motivated and always looking for opportunities to learn & improve <br /><br />What you’ll get in return:<br />A competitive package based on experience, including share options <br />25 days of holiday a year (plus bank holidays)<br />Freedom to work wherever suits you best <br />Two fantastic company Away-Weeks in a different European city each year (next one is Milan in May 2018!)<br />Work alongside a supportive and talented team <br />Grow and develop in a fast-moving, collaborative organisation <br />Enjoy fun events in and around London organised by our Cultural Work Committee <br />Learn to code or improve your existing skills with our Software Development Guild <br />Convenient location in central London (Shoreditch)<br />Continuous supply of Pact coffee<br />Regular events with the team",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "1uhSBV-ZTu2VbOMgg6CJ9g",
    "url": "http://workinstartups.com/job-board/job/71232/business-development-associate-at-hubble/",
    "title": "Business Development Associate",
    "tags": [
      "DBG:surround``OR(thrive,benefit,comfort,hour) 3N 2N(remot,work)",
      "DBG_TECH1:k/t/w:jackson/java/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=8, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/java",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "java"
    ],
    "hiringOrganization": {
      "name": "Hubble",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 23, 2018 10:22:52 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "DESCRIPTION<br />Hubble is on a mission to find the perfect home for every company. We’ve built an online marketplace to help businesses rent, manage and share office space in London. But this is just the beginning. The commercial property sector hasn’t kept up with the needs of new companies and still works like it did 20 years ago. Our vision is to completely transform the way commercial property is transacted, managed and financed.<br /><br />As a Business Development Associate you will build partnerships with flexible office providers in London and beyond. You will also support clients in uploading and updating their listings. You will have direct contact with clients, interacting in-person and through email, live chat, and phone.<br /><br />You should be willing to get stuck in, with a very ‘hands-on’ approach and work autonomously in a fast-paced, constantly changing environment. You’ll need to be able to communicate with cross functional teams from marketing to engineering.<br /><br />You will operate at the heart of a fast growing startup and will therefore have plenty of opportunity to learn and contribute beyond your core role.<br /><br />RESPONSIBILITIES<br />- Source and grow relationships with flexible office providers in London and beyond.<br />- Pitch potential clients on the benefits of working with Hubble, and support them through the onboarding process.<br />- Manage day to day relationships with Hubble’s existing office clients, making sure all their space is listed on Hubble, and keeping their availability up to date.<br />- Regularly review online and offline sources to identify and acquire office space not currently listed on Hubble.<br />- Work closely with new flexible office market entrants to help them advertise, sell and manage their space using Hubble.<br />- Source and advise companies looking to sublet space using Hubble.<br />- Work closely with the product team to build disruptive technologies for the flexible office sector.<br />- Work closely with the sales and support team and get stuck in where required.<br /><br />REQUIREMENTS<br />- Energetic, passionate, and driven individual who can easily collaborate with others.<br />- Willing to get your hands dirty and work autonomously in a fast-paced, entrepreneurial environment.<br />- Sensitive to varied customer personalities and needs.<br />- At ease when communicating with others, whether that’s via email, phone or face to face.<br />- Technology savvy and willing to learn new tools.<br />- Conscientious, with excellent attention to detail.<br />- Strong work ethic and sense of ownership.<br />- Comfortable taking initiative, suggesting improvements and making decisions independent of others.<br /><br />Big plus if you have;<br />- Experience of the flexible office sector.<br />- Experience working in startup environment.<br /><br />BENEFITS<br />We make sure everyone in the team is comfortable and has the best environment for them. We offer flexible hours, remote working and have a relaxed attitude to taking holiday - focusing only on whether work gets done. Benefits can be tweaked on an individual basis depending on what makes you most productive. Here are some of the things we offer:<br /><br />- Remuneration competitive with industry and level of experience.<br /> -Equity options.<br /> -Macbook, peripherals and standing desk.<br />- Expense budget & travel.<br />- Noise-cancelling headphones.<br />- Spotify Premium or Apple Music.<br />- Kindle Unlimited + free technical books.<br />- Health & Pension.<br />- Cycle to Work scheme.<br />- Additionally, being part of Entrepreneur First, 500 startups and Seedcamp gives us (and you) access to a vibrant startup community, office hours and talks with industry experts.<br /><br />ABOUT HUBBLE<br /><br />Hubble is backed by top venture capital firms Entrepreneur First, Seedcamp and 500 startups, and property tech specialists Spire Ventures (PiLabs). Hubble’s investors and advisors include founders & C-level including James Caan (Dragon’s Den and serial entrepreneur), Rohan Silva (Second Home, Former Policy Advisor to the Prime Minister), Jackson Hull (Student.com, Onefinestay), Brett Akker (Zipcar, Lovespace), Jonathan Galore (Wonga, Silverlake Partners) etc.<br /><br />Hubble is an equal opportunities employer. We are a diverse bunch of people who are committed to maintaining a welcoming culture of inclusion and equality. We encourage applications from anyone that meets the requirements for the role. ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "Xy8JMHLDQLS-bddUt11yig",
    "url": "http://workinstartups.com/job-board/job/71177/customer-account-manager-at-switchee-ltd/",
    "title": "Customer Account Manager",
    "tags": [
      "DBG:surround``OR(we,team,compani,member,employe,develop,engin,workmat) 2W work W remot",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Switchee Ltd",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 19, 2018 5:11:44 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "One in five households in the UK live in social housing, a sector with the right values at its core but that has historically struggled to deploy innovations in the home. Many residents still can’t afford to heat their homes and live in cold, mouldy properties they can’t be proud of. At Switchee, we believe that everyone deserves to live in a decent home and that the environments we inhabit have a massive influence on our ability to enjoy life and prosper.<br /><br />We may be only three years old, but it’s already been quite a ride! Our first product, the internet connected Switchee thermostat is already in 35 of the biggest housing providers in the UK. We’re growing 100% year on year and are backed by some of the best-known investors in technology and social impact.<br /><br />To strengthen our small team of 15 passionate and ambitious people we are looking for an outstanding individual to join us as<br /><br />*Customer* *Account* *Manager*<br /><br />We are driven by a collective desire to make a positive impact in the housing sector, both for residents and landlords, so your commitment to our values and mission are paramount.<br /><br />*Your* *responsibilities*<br /><br />As Customer Account Manager you will be responsible for all Switchee’s interactions with our most important Housing Association and Local Authority customers. You will co-ordinate the various touchpoints the Switchee team has with each customer, typically taking ownership from sales and working with our operations, development, marketing and leadership teams. Your ultimate responsibility will be the successful delivery of Switchee services to our large, complex landlord customers with the aim of building long-term (multi-year) commercial relationships based on trust. As we continue to develop our technology an important part of this role will be to develop a deep understanding of both our customers’ and end users needs so that you can input into Switchee product development.<br /><br />Being more specific, you will:<br /><br />* Be the main point of contact with up to 20 Switchee Customers<br />* Co-ordinate and oversee communication with each customer from various parts of the Switchee team; ensure that all deliverables are met on time<br />* Actively seek and grow relationships with all parts of each customer organization, focusing on relevant decision makers<br />* Pro-actively develop a deep understanding of customer and resident needs and how Switchee can either solve them today or develop solutions and/or commercial partnerships to solve them in the future<br />* Monitor and proactively grow the usage of Switchee data insights by all parts of a customer organisation<br />* Suggest and present new product features to our development team, demonstrating a clear understanding of customer value and the need for ROI<br />* Be constantly aware of the need to deliver customer and resident value and to measure and objectively report on this to a range of stakeholders<br />* Be aware that successful implementation of Switchee’s technology does not stop at the delivery of a dashboard, but will ultimately require changed customer behaviour (for example the switch from reactive to pro-active maintenance)<br />* Understand that blockers may be cultural/behavioural as well as technical and thrive in finding solutions to these<br />* Contribute to the growth of Switchee by building long-term commercial relationships with each customer<br /><br /><br />We are a company built on a strong technical foundation. You’ll need to grasp and communicate a technical solution with clients. We also expect you to work closely with Product Development to ensure our product evolves with the customer’s needs at the very centre.<br /><br /><br /><br />*Your* *experience*<br /><br />We firmly believe extraordinary people can come from a wide range of places – but we wouldn’t be surprised if the person who gets this role has:<br /><br />* At least 3 years’ experience in management consultancy or a similar commercial field<br />* Bachelor’s degree from a top university<br />* Excellent communication and interpersonal skills<br />* Proven ability to develop and implement effective solutions to complex commercial problems<br />* Strong analytical & numeracy skills with complete command of Excel<br />* Fluency with large data sets and an ability to interrogate them for commercial insight<br />* Comfort talking in detail about the technology and processes required to manage large customer accounts<br />* B2B customer facing experience preferred<br />* Experience in a small & quickly expanding business<br />*Knowledge of the housing sector<br />* Experience working with Internet of Things devices<br /><br /><br />*You*<br /><br />We are a diverse bunch of people at Switchee. That said, there are some characteristics we always look for:<br /><br />* You deeply care about Switchee’s mission; you have a desire to build something revolutionary, that will disrupt an industry, and positively impact ordinary people’s lives.<br />* You care about the environment, are interested in energy efficiency and have thought about the challenges and opportunities posed by an evolving domestic energy market<br />* You like technology and neat solutions to complex problems<br />* You thrive on challenge and change; you naturally gravitate to the hardest questions first and love thinking differently to solve them.<br />* You are biased towards action and you’re happiest when you’re ‘getting stuff done’.<br />* You’re open, positive & straightforward. You’re not afraid to stand up for your convictions, even when it’s hard to do so.<br />* You delight in your colleagues’ successes and thrive on your failures; you grasp any opportunity for learning and constantly seek to improve.<br /><br /><br />*Our* *mission*<br /><br />We believe that radical innovation in internet connected technology can ensure that every resident, every day, is living in a home that allows them to succeed. That’s why our products are built not just on great technology, but on an understanding of what people want from the space they live in.<br /><br />This approach led us to reimagine the most mundane household object, a thermostat, into a product that automagically reduces energy bills, looks great and offers control to those who want it.<br /><br />We are also revolutionising the way social landlords manage their housing stock with an obsessively tailored SAAS property dashboard and handy alerts on things like when the boiler is going to break.<br /><br />Our next project is to build the ultimate connected hub for the social home. It’s going to revolutionise the way residents interact with their properties and landlords manage their homes.<br /><br />*Life* *at* *Switchee*<br /><br />We like to keep things simple and flexible at Switchee and consider you to be joining our family. We don’t currently track holidays so you’re free to take as much as you need. We occasionally work remotely but are sensitive to the needs of our colleagues.<br /><br />We socialise together with regular outings in London and an annual “working remotely” trip where you have the option (but not obligation) to join us in working from a fun location.<br /><br />If we end up working together, we can offer a competitive salary and a generous stake in the company.<br /><br />If you believe in the same things, don’t hesitate any longer, apply now! Please be in touch soon as we’ll proceed once the right person is found. If you’d like to apply please submit a CV and cover letter on our Careers page. ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "4psquJWkQKKxz2vqpydhng",
    "url": "http://workinstartups.com/job-board/job/71067/salesbusiness-development-at-resi/",
    "title": "Sales/Business Development",
    "tags": [
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Resi",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 17, 2018 10:33:40 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "We are Resi. The straight-forward modern architect.<br /><br /><br />We believe in making world-class residential architecture accessible to all. Through our use of technology, we can offer a high quality and cost-effective service right across the UK.<br /><br /><br />Working here, you’ll discover that we do things a little differently to our competitors. We’re looking to shake up the architecture industry and so need an ambitious, no-holds-barred team to make this happen.<br /><br /><br />We have a fun, dynamic team, located in Bermondsey (though we’re moving to Elephant & Castle soon). Currently, we’re a small team of under 30, but we’re growing quickly and on the hunt for someone with a bit of hustle to join our business development team. Nope not cold calling. You help answer questions that homeowners might have before they commission us to undertake their project.<br /><br /><br />Most companies say they are an equal opportunities employer, but we really mean it. We are led by a female CEO and a female CTO. We actively encourage people who feel like they don’t fit the traditional stereotypes to apply. Your experience is all that matters.<br /><br /><br />Experience<br />•    Likes helping people and talking<br />•    Can hustle or put differently, can build rapport with people – we don’t like the hard sell<br />•    1-2 years sales experience (in any setting)<br />•    Can write well<br />•    Is diligent and hardworking<br />•    Has a thirst for knowledge and picks things up quickly<br /><br /><br />Desirable but not essential:<br />•    Has studied architecture (or even incomplete) or some form of construction experience<br />•    Understands or has experience working on a building site, the lifecycle of a house extension (maybe you have done one) in an architecture firm or as a supplier (could be flooring / glazing / kitchens)<br /><br /><br />What we offer: <br />•    A good London-based salary <br />•    Commission<br />•    The opportunity for rapid progress <br />•    Ownership of your work & area <br />•    On the job training <br />•    30 days holiday (inc Bank Holidays)<br />•    The chance to help build a company from the ground up<br /><br /><br />All applications should include a CV and a cover letter/email as to why you think you would be a good fit for Resi",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "86RUdNDdSXy3T9k6czi6pg",
    "url": "https://cjl.ist/2zGl4GK",
    "title": "Social Media Manager",
    "tags": [
      "DBG:surround``OR(countri, locat) 3W OR(remot,flexibl)",
      "DBG:surround``can 2W remot",
      "REMOTE1/50",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [
      "50% remote"
    ],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 17, 2018 7:06:00 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Social Media Manager</h2>   Location:    Remote    Moscow  <div>  Role and job type:  Marketing Full-time </div> <div>  <h3>Job Description</h3>  <p>Akropolis is looking for a Social Media Manager to join our ambitious and highly motivated team. Brand Marketing will be transformational for the future of Akropolis and you will play a pivotal role in this. This position requires a high level of creativity, as well as the ability to use data-driven insights and other team member inputs to produce relevant material. </p>  <p>Akropolis has grown rapidly over the past few months and we are looking for someone who will be responsible for community building and growth across all social media channels. The ideal candidate should have a proven track record in managing Social Media in the crypto sphere. </p>  <p>Daily Operations:</p>  <ul>   <li>Represent our brand on social media channels;</li>   <li>Deliver engaging and inspiring messages to our social audiences, with the goal of driving brand awareness and consideration;</li>   <li>Significantly grow our audience on social media;</li>   <li>Define and implement paid and organic growth strategies;</li>   <li>Turn our high level marketing strategy into a social media strategy and calendar;</li>   <li>Prioritize between channels, posts and messages;</li>   <li>Work together with influencers, internal, and external creative teams to build social content that engages and inspires large customer audiences;</li>   <li>Scale our social content across multiple markets and languages;</li>   <li>Drive engagement with our social community;</li>   <li>Ensure communication excellence and convert audience feedback into reputation/brand-building moments;</li>   <li>Drive and develop customer understanding through insightful analyses and actionable reporting;</li>   <li>Work closely together with the other channel managers to drive a consistent and differentiated brand message to a mix of countries and audiences.</li>  </ul>  <p>Previous experience/skills:</p>  <ul>   <li>Min 1-3 years experience managing large scale social media channels;</li>   <li>Working experience in a blockchain startup is a plus;</li>   <li>Strong understanding of the social media landscape and crypto trends;</li>   <li>Ability to define a strategy across multiple channels and to operate within them;</li>   <li>Operational mastery of owned Twitter, Facebook and Linkedin channels. Experience in other channels (Telegram, YouTube, Reddit) is a plus;</li>   <li>Ability to define and execute on audience growth strategies through paid and organic campaigns;</li>   <li>Good ideas on how to make our brand stand out in a competitive Fintech landscape.</li>   <li>Experience briefing and cooperating with creative teams in order to produce outstanding messaging;</li>   <li>You stay up-to-date on the latest trends in social media. You’re a first mover and identify the underlying trends before they grow;</li>   <li>You know the ins and outs of how to successfully collaborate with influencers;</li>   <li>Strong analytical and reporting skills; able to use the right data and metrics to optimize performance; strong Excel skills and familiarity with Ads tools;</li>   <li>Ability to work in a fast-paced cross-functional environment. Understand how to align and motivate a variety of stakeholders and influence their priorities;</li>   <li>Clear communicator with excellent command of written and spoken English.</li>  </ul>  <p>What we offer: </p>  <ul>   <li>Working with an international team of world-class professionals with experience in finance, pensions, blockchain and crypto industries;</li>   <li>A fulfilling, challenging and flexible work experience;</li>   <li>Competitive salary, performance-based bonuses;</li>   <li>Flexible working hours;</li>   <li>You can work remotely or from our office in Moscow;</li>   <li>Practically unlimited professional and career growth opportunities.</li>  </ul>  <h4>Salary range</h4>  <p>Competitive </p> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "3S8CcyzBS6qGk0KvxM6akQ",
    "url": "http://workinstartups.com/job-board/job/70985/account-executive-at-chaser/",
    "title": "Account Executive",
    "tags": [
      "DBG:surround``OR(fulltim,offer) 5W 2N(work,remot)",
      "DBG:surround``OR(locat, base, resid) 3W OR(berlin, london, pari)",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=0, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/go",
      "TITLE1/sales",
      "TZ/Europe"
    ],
    "tagsNames1": [
      "European time zones"
    ],
    "tagsNames2": [
      "go"
    ],
    "hiringOrganization": {
      "name": "Chaser",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 16, 2018 9:53:51 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "*Role Summary*<br /><br />We have an exciting opportunity for a sales professional to join our team as an Account Executive. Your role will be working as a valuable member of our sales team managing relationships with our amazing partner accounting firms.<br /><br />We're growing at an incredible rate and generating huge growth in the accounting channel. This is a perfect time to join Chaser and make an instant impact and contribution to the company's success.<br /><br />Chaser Account Executives are at the heart of our sales and customer service offering. Taking a consultative approach to form strong relationships with our accounting partners, assisting and guiding them with cloud strategy.<br /><br />As cloud accounting adoption keeps increasing within accounting firms, you will have the unique position to help support and increase their client portfolio by adopting Chaser into their firms. You can truly help them become more efficient, add real value to their clients and help them become that go digital accounting firm they strive to become.<br /><br />You'll be reporting directly to the Head of Partner Channel Sales. Our head office is located in Moorgate London; however, we do offer remote working for the right candidate.<br /><br />*As a person you:*<br /><br />* Have highly developed communication skills and a positive demeanour<br />* Are consultative, process driven and persistent, with excellent professional written and verbal communication skills<br />* Hard working but like to have fun and come to work with a smile on your face<br />* You will be extremely ambitious<br />* You will be someone who thrives in a high speed environment<br />* Digitally proficient, you will be excited to build an understanding of how best to use Chaser as a product. This will be essential for your success in the role<br /><br />*What your role will consist of*<br /><br />* Building a deep understanding of accounting and bookkeeping firms<br />* Acting as a trusted advisor to our accounting and bookkeeping partners and supporting change management in their firms<br />* Educating partners to help maximise growth<br />* Managing and respond to incoming partner enquiries<br />* Monitoring all existing and prospective partners progress through the sales funnel<br />* Maintaining and update the CRM system of all partners staff and contact details, alongside adding new partner enquiries<br />* Creating and running webinars<br />* Providing both online and onsite demos of Chaser<br /><br />*Why you'll love Chaser*<br /><br />At Chaser we value our people, we want them to enjoy the job they do and provide opportunities to love and grow their career. An exciting growing company we attract people who want to help us have a positive impact by helping our partner and their clients thrive and be successful. Our passionate, innovative Chaser team strive every day to make a meaningful impact. At Chaser, we truly value the input of every single member of the team. If successful, you'll be joining a sharp, welcoming group of people who will help you learn new skills and develop as an individual.<br /><br />*Benefits*<br /><br />* Competitive salary<br />* Share options<br />* Company pension scheme<br />* 25 days holiday<br />* Flexible working hours<br /><br />If you're looking for a role that is exciting, challenging and diverse in which you can form lasting business and personal relationships, apply for the Chaser Account Executive position today.<br /><br />*How to apply*<br /><br />In applying, please answer the following questions:<br /><br /># Why have you applied for this role?<br /># What is your proudest professional or academic achievement and why? - ( Max 200 words)<br /># Are you eligible to work in the UK?",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "IG2tOVspR6ezfqXur2whkA",
    "url": "http://workinstartups.com/job-board/job/70978/student-or-graduate-sales-exec-position-at-driven-media/",
    "title": "Student or Graduate Sales Exec position",
    "tags": [
      "DBG:surround``4N( OR(look, search),     4N(OR(distribut, remot), OR(employe,develop,engin,team)) )",
      "DBG:surround``remot 3N ( OR(employe,develop,engin,team,role,employment,workmat) OR compani OR worldwide)",
      "REMOTE1/100",
      "TECH1/unknown",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "unknown"
    ],
    "hiringOrganization": {
      "name": "Driven Media",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 16, 2018 12:47:00 AM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Driven Media is a Truck and HGV advertising specialists. We utilise the valuable but often unused space on the side of trucks, and rent it to run campaigns for our clients and advertisers.  <br /><br />Following our appearance on Dragons Den, and successful investment at the start of this year, we are now looking to expand our remote sales team and take on 2 or 3 current students or recent graduates who want to make a name for themselves. <br /><br />The role involves marketing your respective geographical areas, and utilising the contacts and companies at your disposal in order to get our brand name out into the market place. You will be tasked with landing 3/6/ 12 month campaigns and will receive a healthy commission percentage in return. We are also offering initial and ongoing training, a Sales Buddy to guide and support you with your clients, and will support you with generating inbound leads, marketing and how get the best form your sales efforts. <br /><br />In addition to a healthy 10% commission per campaign (average client campaign being worth £8,000), you can also benefit from a lucrative 'fast start' bonus, which rewards those team members who hit the ground running, and have the passion and stamina to succeed in the highly competitive market that is advertising space. This bonus scheme could be with up to £3,200 extra within your first 6 months!<br /><br />So if you are a fast self-starter, wanting to make a name for yourself in sales and marketing, love negotiation and closing deals, and want to earn uncapped commission to subsidise your studies, please apply below and lets start a conversation. <br /><br />Every relationship has to start somewhere, and this could be your next big opportunity.<br /><br />",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "eZgqfxlRSMKYhB5iYh1uvQ",
    "url": "https://cjl.ist/2zzNDWm",
    "title": "Regional Business Development Officers",
    "tags": [
      "DBG:surround``OR(employe,develop,engin,team,workmat) 2W locat",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=0, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "UNSET",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 13, 2018 2:59:01 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "<h2>Regional Business Development Officers</h2>   Location:    Seoul    Tokio    Brazil    Argentina  <div>  Role and job type: Other… Full-time </div> <div>  <h3>Job Description</h3>  <p>Career at Snow Fox Technologies</p>  <p>We seek experienced Regional Business Development Officers to join our team.</p>  <p>Sales experience is necessary, along with the willingness to offer great customer service and learn new things. Being organized and using CRM system is paramount.</p>  <p>Cryptocurrency or blockchain knowledge is favorable however not necessary.</p>  <p>You should be based in one of the following locations:</p>  <ul>   <li>Singapore</li>   <li>Hong Kong</li>   <li>Seoul</li>   <li>Manila</li>   <li>Kuala Lumpur</li>   <li>Shanghai</li>   <li>Latin America</li>  </ul>  <p>Please answer the following questions when sending your CV </p>  <ul>   <li>Do you have knowledge about blockchain and cryptocurrencies?</li>   <li>Are you part of any local groups in the bitcoin/crypto space?</li>   <li>Are you fluent in the local language</li>  </ul>  <h4>Salary range</h4>  <p>USD 3k-10k per month</p> </div>",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  },
  {
    "id": "prixQDS7RDinKT6lCKqBJQ",
    "url": "http://workinstartups.com/job-board/job/70762/rockstar-graduate-sales-honchos-at-global-noticeboard/",
    "title": "Rockstar Graduate Sales Honchos",
    "tags": [
      "DBG:surround``2N(anywher, remot)",
      "DBG_TECH1:k/t/w:computer-vision/bigdata-ml/8",
      "DBG_TECH1:k/t/w:go/go/3",
      "DBG_TECH1:techWeightMap:{python=0, other=0, dotnet=0, c=0, mobile=0, go=3, nodejs=0, bigdata-ml=8, ruby=0, apple=0, java=0, gamedev=0, php=0, embedded=0, frontend=0}",
      "REMOTE1/100",
      "TECH1/bigdata-ml",
      "TITLE1/sales",
      "TZ/unknown"
    ],
    "tagsNames1": [],
    "tagsNames2": [
      "bigdata-ml"
    ],
    "hiringOrganization": {
      "name": "Global NoticeBoard",
      "sameAs": "UNSET"
    },
    "salary": {
      "currency": "UNSET",
      "minValue": 0,
      "maxValue": 0,
      "info": "",
      "unit": "UNSET",
      "parser": "UNSET",
      "isEquity": false
    },
    "employmentType": "UNSET",
    "published": "Jul 9, 2018 4:33:04 PM",
    "validThrough": "Jan 1, 1970 1:00:00 AM",
    "content": "Rockstar Graduate Sales Honchos<br /><br />We’re scouring London for Rockstar Sales Honchos who are talented, inspired and have a tenacious get-up-and-go attitude. Join our fun, fast-growing, early stage prop-tech start-up as a graduate Sales Honcho.<br /><br />Your role<br /><br />You’ll be boomeranging around London’s estate agencies, selling in-person, our cutting-edge technology software. The product is the industry-disrupting ‘Agency in a Box’ – which provides agencies with everything and anything they need to manage and grow their businesses. This includes 360° virtual property viewings, mobile apps, websites and entire back office software. All of this can be accessed remotely, anywhere in the world. We are constantly innovating; we are soon to roll out our virtual reality goggles and aerial drones. <br /><br />We are facing unprecedented demand for our tech, and now is a perfect time to join an early-stage core team. £23k basic, plus uncapped commission which you earn with every sale.<br /><br />You<br /><br />•    Get up and go attitude<br />•    Enthusiasm<br />•    Work-ethic<br />•    A hunger to learn, improve and succeed<br />•    Proactive<br />•    Confident and fun<br />•    Emotionally intelligent<br /><br />We will support you to learn, develop and grow throughout this role – providing you with the foundations of a successful career in sales. No experience is necessary – we prioritise tenacity and diligence over everything else.<br /><br />Show us what you’ve got in your two-month probation period and we’ll completely invest in you. You’ll be the head of a two/three-person appointment booking team that work for you to secure your appointments. You’ll then spend your days smashing them.<br /><br />Our mission<br /><br />The GNB was created in 2010 as a charity – set up to end homelessness through a global humanitarian platform. We wanted to fund this ourselves rather than rely on governments and donations… so we started our prop-tech start-up, GNB Properties, in 2016. Our mission is not profit motivated – it is exclusively social. We only exist to serve our mission.<br /><br />Send us your CV and a short covering letter persuading us why you want to be a Sales Honcho. Our phone number is also below.<br /><br />www.gnbproperty.com<br />02037 892 892<br /><br />Curious to know more? Watch our 1-minute video!<br />https://www.youtube.com/watch?v=5m3K8MvJTmQ",
    "place1": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    },
    "place2": {
      "locality": "UNSET",
      "region": "UNSET",
      "country": "UNSET"
    }
  }
]
}
